{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Do you want to learn how to get more customers and sales online without getting overwhelmed and overworked?</p>\n\n<p>Or perhaps you have been trying really hard to market your business online but you are still not seeing the results you hoped for...</p>\n\n\n\n\n\n<p><strong>If you are looking for a course that can help you to work <em>SMARTER </em>(not <em>HARDER</em>) to generate more sales for your business online, then what you need is right in front of you!</strong></p>\n\n\n\n\n\n<p><br>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br></p>\n\n\n\n\n\n\n\n<p><em>\"</em><em>Having enjoyed KC's clarity of instruction and step-by-step guidance in his previous course, I was expecting nothing less than another high quality course from him. In this course, his instructions are just as clear as ever, and yet again his attention to detail simply amazing. This time round, we still get the direct \"how to\" actionable lessons, coupled with \"secret sauce\" insights derived from years of his experience and topped with sharing of supplementary resources whenever it is practical to do so. And boy, I'm impressed! Looking to learn online marketing for small business? This is it!\" </em><em>– Michael Lim</em></p>\n\n\n\n\n\n\n\n<p>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br><br><br>If you have been struggling with online marketing with little success so far, maybe you have been missing something important...</p>\n\n\n\n<p><strong>When it comes to marketing, you need to remember the golden 80/20 principle<em> – 80 percent of your outcomes come from 20 PERCENT of your efforts.</em></strong><br></p>\n\n\n\n\n\n<p><em>Precisely, just 20 percent!</em> Rather than trying to do all, you ought to be focusing your time and resources only on marketing activities that produce the <em>most</em> results for you.</p>\n\n\n\n\n\n<p>Make every dollar and minute that you invest into marketing your business count!</p>\n\n\n\n<p>Here is the difference it makes when you apply the 80/20 rule to your business:<br></p>\n\n\n\n\n\n<ol><li>You avoid wasting time and money on marketing channels that do <em>not </em>ROI for you!</li><li>You gain more time to focus on marketing channels that bring you better results (as well as other important aspects of your business)!</li><li>Instead of getting overwhelmed with marketing, you reap the benefits of working with greater productivity!</li><li>You achieve <em>greater </em>sales results with <em>lesser </em>effort!</li></ol>\n\n\n\n\n\n\n\n<p><br>To this end, this practical course is created to empower you to focus on the right online marketing strategies for your business – so that you can work <em>smarter </em>while your online marketing strategies work <em>hard </em>for you!</p>\n\n\n\n<p>You will learn the top 3 proven digital marketing strategies (your 20 percent) that contribute the majority of sales, which are Search Engine Marketing, Facebook Marketing and Email Marketing.<br><br>Whether you are –<br></p>\n\n\n\n\n\n\n\n<ul><li>Just starting out in your small business and you're clueless about which online marketing strategies you should focus on,</li><li>An existing business owner who has been struggling to attract sales online with little or no success so far</li></ul>\n\n\n\n\n\n\n\n<p><br><strong>This course will give you the knowledge <em>and</em> practical SKILLS to implement these top 3 ROI marketing channels in your business and use them to your own advantage!</strong><br><br><em>This is a highly actionable course that is designed based on my years of experience in Internet marketing and running my own business (and these are the exact techniques that I am using for my own businesses now)!</em></p>\n\n\n\n<p>By applying these top-ROI digital marketing strategies, you will be able to maximize your time and resources to generate more leads and sales for your business!</p>\n\n\n\n<p>To help you get the most out of this course, all the concepts are explained to you in simple terms and broken down nicely into actionable steps that is easy to understand and follow.<br></p>\n\n\n\n<p>This practical how-to course <strong>comes with </strong><strong>over 30 detailed step-by-step videos (4 hours of content)</strong> that teach you:</p>\n\n\n\n\n\n\n\n<ol>  \t<li>What are the things you need to prepare before you start marketing your business website – <em>this will potentially save you thousands of dollars!</em><br>  \t</li>  \t<li>How to make the very best out of Search Engine Marketing and adopt best practices to rank your website and enjoy highly affordable pay-per-click rates!<br>  \t</li>  \t<li>How to leverage Facebook to build a strong following for your business. Learn what you should and should NOT share on Facebook!<br>  \t</li>  \t<li>Model my email marketing strategies to close sales every month without having to buy or rent email databases!</li></ol>\n\n\n\n\n\n\n\n<p><em><br>What this course is NOT:</em><br></p>\n\n\n\n\n\n\n\n<ul><li><em>A general course that talks about every type of digital marketing technique out there;</em></li><li><em>Big picture theories without practical application tips</em></li><li><em>Outdated digital marketing techniques that are no longer effective now</em></li></ul>\n\n\n\n\n\n\n\n<p><br></p><p>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br></p>\n\n\n\n\n\n\n\n<p><em>\"</em><em>KC Tan is one of the best teachers in Udemy. He's clear, concise and goes to the point without any fluff or extra talk. He always exceeds expectations.\" </em><em>– Eugenio Gonzalez</em><br>:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::</p>\n\n\n\n\n\n<p><em><br>Above all, if you get stuck or experience any difficulties along the way, you won't ever have to struggle on your own and worry about having no one to turn to for help.</em><br></p>\n\n\n\n\n\n<p><strong>Because upon becoming a student of this course, you will receive continuous support from me – help that comes with no expiry!</strong> I will be here to share my advice and answers to all your questions whenever you need help from me :)</p>\n\n\n\n\n\n<p><br>**********************************************************************<br></p>\n\n\n\n\n\n\n\n<p>  \t<em><em><strong>30-DAY MONEY BACK GUARANTEE</strong></em></em></p>\n\n\n\n\n\n\n\n<p>  \t<em>I trust that you'll like this course as much as I enjoyed teaching it.</em></p>\n\n\n\n\n\n<p><em>But if the course is not to your satisfaction, you can choose to cancel if within the first 30 days and receive a full refund of your money. No questions, no hassles.<br></em></p>\n\n\n\n\n\n\n\n<p>  \t                                                            **********************************************************************<br><br>This is a gift that only YOU can give yourself and you fully deserve to learn everything in this course. </p>\n\n\n\n<p>So act on it and I welcome you to join my course!<br></p>\n\n\n\n<p><strong>To enroll, simply click on the 'Take This Course' button on top and I look forward to see you inside!</strong><br></p>\n\n\n\n\n\n\n\n<p><br>  </p>", 
    "end_date": null, 
    "title": "The Digital Marketing Success Course For Small Businesses", 
    "price": "30.00", 
    "instructors": "KC Tan", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324818_e6c8_8.jpg", 
    "course_url": "https://www.udemy.com/8020-online-marketing-for-small-business/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T11:48:00Z"
}