{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Learn to create a simple marketing &amp; sales funnel to sell digital content online using entirely free tools.</p>\n\n<p><strong class=\"redactor-inline-converted\">Build a high-converting funnel that collects email addresses in return for free content, and up-sells prospects on your paid-for content</strong></p>\n\n\n\n\n\n\n\n<ul><li>Create Professional Landing Pages</li><li>Write Emails That get Response</li><li>Create Free ebooks/reports</li><li>Script and Record Video Sales Letters</li><li>Launch a secure, members-only website for your paid-for content</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Create a website that actually gathers leads</strong></p>\n\n\n\n\n\n<p>A funnel-based website that guides your prospects through from one end to the other is a far higher converting lead generation asset than the traditional website layout that most businesses revert to.<br></p>\n\n\n\n\n\n<p>You'll learn the practices used by businesses gathering thousands of leads per day from paid and free online channels, and the process they push their leads through once they have them on their email list.</p>\n\n\n\n\n\n<p>The course is unique in using 100% free tools. Our instructors use these same tools to build out prototype funnels to test new markets before investing in commercial platforms. </p>\n\n\n\n\n\n<p>We're not a technology business, we're marketers, and we want to take away any barriers to your online marketing that we can.</p>\n\n\n\n\n\n<p>The course includes a complete over-the-shoulder view of me creating a fictional funnel for a new online training product, which you can copy and adapt to your own market. Just use your own copy in each of the provided templates and you can be up and gathering new customers in just a few hours.</p>", 
    "end_date": null, 
    "title": "The Free Funnel Formula Build A Landing Page With Free Tools", 
    "price": "20.00", 
    "instructors": "Stephen Pratley", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/803280_7f49.jpg", 
    "course_url": "https://www.udemy.com/thefreefunnelformula/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T23:24:07Z"
}