{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Looking to expand your Marketing knowledge base and take it to the next level? </p>\n\n<p><strong class=\"redactor-inline-converted\">The 7 Pillars of Digital Marketing™</strong> is a comprehensive framework and a new paradigm for learning and mastering the ever evolving discipline of marketing. It provides a new prism through which to view strategy, budgeting, execution and analysis of the entire universe of integrated (digital and traditional) marketing ideas, tactics and techniques. 7 Pillars illuminates the entire Internet ecosystem – from Social Media to Website Analytics – and provides a practical methodology for understanding the full spectrum of digital marketing opportunities. The course expertly covers:</p>\n\n\n\n\n\n\n\n<ul><li><strong>Digital Strategy</strong></li><li><strong>Content Marketing</strong></li><li><strong>Search Engine Optimization</strong></li><li><strong>Social Media Marketing</strong></li><li><strong>Web Design</strong></li><li><strong>Digital Advertising &amp; Media</strong></li><li><strong>Branding</strong></li><li><strong>Analytics &amp; ROI</strong></li></ul>\n\n\n\n\n\n\n\n<p>7 Pillars is a practical and scientific approach to marketing, not some vague, jargon-laden theory. It has been forged in the fire of nearly 20 years of marketing trials and activity, on behalf of startups and Fortune 500 companies. It makes marketing accountable! The results – mistakes and successes alike – are brought forth into this all-encompassing, learnable methodology. </p>\n\n\n\n\n\n\n\n<p>The beauty of 7 Pillars is that it brings every little detail – from a mobile app feature, to a specific search engine keyword – back to the whole. Marketing is a holistic, interconnected field that requires a framework to understand how everything fits together. Learning a specific tactic in a vacuum is counter-productive. The Pillars represent far more than specific tactics; they are overarching principles or energies that govern the marketing world.\n</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Arman Rousta</strong>, CEO of Blueliner and author of The 7 Pillars of Digital Marketing book, was inspired to create 7 Pillars so that his staff and clients had access to a complete educational and organizational system, upon which one can build and apply marketing knowledge. </p>\n\n\n\n\n\n\n\n<p>It is used for the planning, execution and analysis of all types of marketing efforts and can be implemented by even non-technical business owners. You will be a Digital Marketing Expert (or Blue Belt Samurai as we call it) in no time!</p>", 
    "end_date": null, 
    "title": "The 7 Pillars of Digital Marketing", 
    "price": "50.00", 
    "instructors": "Arman Rousta", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834454_6647_2.jpg", 
    "course_url": "https://www.udemy.com/the-7-pillars-of-digital-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-28T14:11:41Z"
}