{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Did you ever wonder why SOME of the websites are getting ALL the traffic... and making ALL the money?</strong> </p><p style=\"\">This quick, but packed course will position you to take your online business as far as you want! It&#039;s up to you. </p><p>You see, the problem most online businesses face today is <strong style=\"\">NOT</strong> that that they don&#039;t have enough traffic. </p><p><em style=\"\">It&#039;s that they don&#039;t have a site that is WORTHY of traffic.</em> </p><p><strong style=\"\">Why send tons of visitors to a site that won&#039;t convert???</strong> </p><p>And it makes sense why your site isn&#039;t the BEST it can be (yet). The reason you don&#039;t invest the proper time and energy into fixing your site is because there are too many websites and you don&#039;t see the rewards quickly enough!! That&#039;s fair. </p><p>But it&#039;s not hard!! I mean it... </p><p>IT&#039;s just knowing the simple strategies... the ones that only a handful out of the millions of millions of websites out there bother learning... most of them easy, affordable, and timeless. </p><p style=\"\">Enroll today in this course highlighting the 21 most common mistakes you are making with your websites.  It&#039;s a quick course (under 90 minutes), easy to fly through...  money back, guaranteed.  <br style=\"\"></p><p style=\"\">Just getting started with your online business? Then start off on the right foot!</p><p style=\"\">These tactics are designed to create a site that will allow you to compete with the best and become a well known brand in your market.</p><p style=\"\">Get your hand on this course today to start immediately seeing results with your online business</p><p style=\"\">This course has 8 modules, 25 videos and is under 90 minutes total! Includes a long and ongoing list of resources to support the content. </p>", 
    "end_date": null, 
    "title": "The 21 Mistakes You Are (probably!) Making With Your Website", 
    "price": "35.00", 
    "instructors": "Andrea Yager", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470854_ab7e_8.jpg", 
    "course_url": "https://www.udemy.com/the-21-mistakes-you-are-making-with-your-website/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T14:08:42Z"
}