{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Be a better marketer and Learn more in the next 30 days than most small business owners will ever know</strong>  </p>  <p>  \tDear small business owners and bloggers,  </p>  <p>  \tDo you struggle to find the time, money and expertise required for success in online marketing?  </p>  <p>  \tIf you&#039;re like me, your inbox is flooded with marketing messages, spanning every imaginable topic: SEO, social media, blogging, copywriting, web design, etc. You may be also getting bombarded with offers, webinars, courses and videos, all pointing you to the next &quot;bright shiny object&quot;, trick and tactic that promises to double your traffic overnight. Yuck!  </p>  <p>  \tWhile there are many great, trusted online marketing resources out there, most of us feel like we&#039;re constantly gathering pieces of a ginormous jigsaw puzzle. <strong style=\"\">What you really need is the puzzle itself!</strong>  </p>  <p>  \tThe 30-Day Online Marketing Crash Course is super-simple, &quot;geek-free&quot; blueprint that walks you through proven, actionable steps to establish the right foundation for online success.  </p>  <p>  \t<strong style=\"\">30-Day Online Marketing Crash Course Outline</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">Lesson 1</strong> sets the stage for your online marketing by using a simple but powerful, 3-step funnel to view and measure your online marketing strategy</li>  \t<li><strong style=\"\">Lesson 2</strong> is all about WordPress, the best, most powerful and easiest- to-use website platform for small businesses</li>  \t<li><strong style=\"\">Lesson 3</strong> reveals 8 secrets of user engagement: how to build instant trust and authority with your audience</li>  \t<li><strong style=\"\">Lesson 4</strong> covers 12 ways to double conversion rates, generating more opt-ins and leads. Just one of the strategies in this video can be used to double your website&#039;s conversion rates!</li>  \t<li><strong style=\"\">Lesson 5 </strong>&quot;SEO Made Simple&quot; is a straightforward, easy-to-understand overview of how Google works and how to find and use the right keywords to reach your audience</li>  \t<li><strong style=\"\">Lesson 6</strong> lays out the top 10 places to reach your audience online and best practices for listing your business, engaging in groups, industry blogs and forums</li>  \t<li><strong style=\"\">Lesson 7 </strong>covers the basic website metrics that every business owner needs to know and includes an awesome &quot;one-click&quot; at-a-glance Google Analytics dashboard!</li>  \t<li><strong style=\"\">Lesson 8</strong> details a unique content strategy unlocking 6 highly effective content marketing secrets that large brands and publishers use to exponentially  &quot;multiply&quot; the reach for every piece of content you produce.</li>  \t<li><strong style=\"\">Lesson 9 </strong>&quot;Blogging made simple&quot; will walk you through the Anatomy of a Perfect Blog post, providing a simple template for creating great, highly engaging blogs every time.</li>  \t<li><strong style=\"\">Lesson 10</strong> &quot;Intro to Online Video&quot; simplifies the process for creating editing, publishing and marketing great web videos and video blogs, including the &quot;$199 video studio.&quot;</li>  \t<li><strong style=\"\">Lesson 11</strong> will teach you how to get more online reviews, referrals and renewals using  proven and inexpensive email marketing tools.</li>  \t<li><strong style=\"\">Lesson 12 </strong>the 30-Day Quick Action Checklist walks you through a series of simple  and specific daily steps that will take you from zero to online marketing ninja in one month flat! This last lesson contains 5 additional tutorial bonus videos</li>  </ul>  <p>  \t<strong style=\"\">Don&#039;t let the low price fool you!</strong> I set out to make <strong style=\"\">the best introductory online marketing course available</strong>, revealing a simple and proven blueprint for growing your business. There are many courses available for $497, $997 or more. My passion is helping business owners succeed by making this highly valuable material available to everyone with the desire to build a thriving online business. Take action, implement the 30-Day Quick Action Plan provided in Lesson 12 and please let me know if you have any questions.<br style=\"\">  </p>  <p>  \tThanks and Happy Marketing!  </p>  <p>  \tAaron, Liz and Maddy  </p>  <p>  \tGeek-Free Marketing, Inc.  </p>", 
    "end_date": null, 
    "title": "The Online Marketing Crash Course: Traffic, Leads & Clients ", 
    "price": "20.00", 
    "instructors": "Aaron N. Fletcher", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41899_1d83_3.jpg", 
    "course_url": "https://www.udemy.com/online-marketing-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-16T02:35:02Z"
}