{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t TLC consists of 10 modules, 43 videos of almost 300 minutes. Each video is 5 - 13 minutes in length so you can concentrate on the subject and not get overwhelmed by long videos &amp; pdfs.  </p>  <p>  \tYou also get invited for &#039;live&#039; online sessions held twice a week for 60 days.  </p>  <p>  \t In small steps, you will learn:  </p>  <p>  \t <strong style=\"\">Keyword Research</strong>  </p>  <p>  \t How to keyword research using Google and why keyword research is critical to attracting targeted traffic to your website.  </p>  <p>  \t <strong style=\"\">Traffic</strong>  </p>  <p>  \t Do you know how small or big your niche or market is? Learn how many unique visitors are searching for your product or service each month.  </p>  <p>  \t <strong style=\"\">Competition</strong>  </p>  <p>  \t We all want our websites to be ranked no.1 on Page 1 of Google. Learn how to spy on the number of competitors and the strength of your competitor&rsquo;s website.  </p>  <p>  \t <strong style=\"\">Mind Mapping</strong>  </p>  <p>  \t Before starting any project, campaign, product or anything new, you must have a mind map so you and your co-workers know what you want to do. Mind mapping will improve your communications and your workflow, learn how to do this.  </p>  <p>  \t <strong style=\"\">Google</strong>  </p>  <p>  \t Most people think of Google just as a search engine. Wrong. Google offers over 150 products of which most of them are free. Learn how to transform your business with Google Apps.  </p>  <p>  \t <strong style=\"\">Planning &amp; Communicating</strong>  </p>  <p>  \t Learn how to plan, communicate with your co-workers and outsourcers. Keep everything organised from managing projects to workflow updates using simple tools.  </p>  <p>  \t <strong style=\"\">How to Outsource </strong>  </p>  <p>  \t Find some of the most talented professionals from around the world and outsource your tedious and boring jobs, so you work on your business and not in your business  </p>  <p>  \t <strong style=\"\">Email Marketing</strong>  </p>  <p>  \t Start your email marketing, set up your campaigns, how to give away free content and build your list. Set up your email marketing on auto-pilot. All is covered.  </p>  <p>  \t <strong style=\"\">Become an expert</strong>  </p>  <p>  \t Publish your 1st ebook on Amazon and show the world your expertise and know how. It&rsquo;s so simple you won&rsquo;t believe it!!  </p>  <p>  \t <strong style=\"\">Why do you need a Landing Page</strong>  </p>  <p>  \t For every advertising campaign, you need a dedicated landing page. Learn how to convert your leads into prospects or customers using a landing page.  </p>  <p>  \t <strong style=\"\">Monetize your emails &amp; website</strong>  </p>  <p>  \t Learn how to monetize your marketing emails, website, blogs and the social media platform. It is pretty much making money while you sleep no matter which business you&rsquo;re in.  </p>  <p>  \t <strong style=\"\">Place your Ads</strong>  </p>  <p>  \t Want to put up your ads on websites like CNN, Mashable, Vogue, or any other major website. Learn how you can set up campaigns, optimise it for higher conversions and then scale it to as high as you want.  </p>  <p>  \t <strong style=\"\">No time for social media</strong>  </p>  <p>  \t Most business owners don&rsquo;t have any time, let alone trying to update social media platforms every day. Learn how to search and look for interesting content to share and set it up across all your platforms in one go. This will save you hours on end!  </p>  <p>  \t <strong style=\"\">Still not convinced?</strong>  </p>  <p>  \t Try TLC today and with the 30-day money back guarantee, you have nothing to lose.  </p>", 
    "end_date": null, 
    "title": "Traffic Leads Conversion", 
    "price": "25.00", 
    "instructors": "Uzair Kharawala", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/120082_e68d_8.jpg", 
    "course_url": "https://www.udemy.com/trafficleadsconversion/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T23:56:10Z"
}