{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.\n</p>\n\n<p><strong>New videos added May 2016: Top 8 Paid Ad Platforms</strong></p>\n\n\n\n\n\n<p><strong>So you've just launched your Udemy course.</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Perhaps you're like many, who expected instant sales and instant success. Udemy has 9 million students, and so it sounded easy to get several thousand of them to buy your course. And it didn't turn out to be like that.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What now? </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course, I go through 8 places you should consider marketing your course. I've seen these places work for me or for others. So those make good places for you to start searching for your audience and bring them to you.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I'm not expecting all 8 will be a perfect fit for everyone. And certainly not expecting you to add 8 more hours of work per day to your already full plate! But start with one new marketing approach, try it, and then add a second if you find the first one working!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Everything in this course is <strong>practical</strong>. The videos show you what I and others do on those platforms. Anyone can do this, and nothing is complicated, or requires special skills, or deep pockets. </p>\n\n\n\n\n\n<p>For more advanced tactics, I've recently included videos discussing paid ad platforms. Paid ads is not for everyone, but it might be for you. It's worth checking out.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So sign up today, and get started building your authority on your course topic!<br></p>", 
    "end_date": null, 
    "title": "Udemy Course Marketing for Beginners – Unofficial", 
    "price": "25.00", 
    "instructors": "Scott Duffy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736416_eece.jpg", 
    "course_url": "https://www.udemy.com/course-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T05:28:32Z"
}