{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Have you ever <strong>struggled</strong> to get the YouTube views that you deserve?</p><p>Are you looking for a <strong>PROVEN formula</strong> for a successful YouTube channel?</p><p>Do you want to learn from an <strong>ACTUAL YouTuber with millions of views</strong>, and not some \"instructor\" who doesn't even have a successful channel themselves?</p><p>If you answered <strong>YES</strong> to any of the above, then you're in the right place. Keep reading...</p><p>My name is ODi Productions and I'm a marketing specialist, music producer, and entrepreneur. </p><p>I currently have a YouTube channel with over <strong>4,400,000+ views </strong>and <strong>10,000+ subscribers. </strong>(And this is with <em>only</em> 58 videos<em> </em>uploaded to this date).</p><p>I designed this course to reveal EVERYTHING from my years of YouTube experience, and many individual parts of this course make up entire \"courses\" from other instructors. So what you're really getting is about 4 or 5 courses for the price of just ONE really good one :-) </p><p>This course includes:</p><ul><li>Perform <strong>KEYWORD OPTIMIZATION</strong> to rank your videos higher than ever on YouTube and Google's search engines to maximize your organic views for months and years to come!</li><li>Create <strong>BEAUTIFUL CUSTOM THUMBNAILS</strong> for free using Gimp software and with a LIVE step-by-step video demonstration from ODi Productions.</li><li>Launch your first successful <strong>GOOGLE ADWORDS CAMPAIGN</strong> to get \nhundreds, if not thousands of legit views for as little as less than a \ncent per view! (Includes a LIVE video demonstration)</li><li>Learn the secret to <strong>SOCIAL MEDIA MARKETING</strong> that works best for YouTube (most \"instructors\" are doing it WRONG)<span></span></li><li>Set a new standard for <strong>HIGH-QUALITY CONTENT</strong> that will set your channel apart from the millions of other YouTubers out there.<span></span></li><li>Ultimately, <strong>get more VIEWS and SUBSCRIBERS than ever before</strong> on your journey towards a successful YouTube channel!</li></ul><p><strong>What are you waiting for? Click that \"Take this Course\" button NOW and let's begin!</strong></p>", 
    "end_date": null, 
    "title": "Ultimate YouTube Marketing: SEO, Thumbnails, Google Adwords", 
    "price": "50.00", 
    "instructors": "ODi Productions", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566310_d645_3.jpg", 
    "course_url": "https://www.udemy.com/ultimate-youtube-marketing-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T17:52:21Z"
}