{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<span>This course has been carefully designed to explain </span><span>r</span><span>etargeting/remarketing</span><span> in all its aspects including setup, launch, optimization and best practices to creating and launching the most effective campaigns for maximum conversions/sales/lead collection. </span><em style=\"\"><strong style=\"\">After taking this course you WILL become an expert on retargeting/remarketing. </strong></em></p><ol style=\"\"><li>Find what opportunities there are on Google, Facebook, YouTube, and AdRoll to reach your existing audience!</li><li>See how to use Google AdWords for conversions with live hands on advertising campaign creation for online sales using remarketing campaigns through Google Analytics targeted at previous website visitors and previous YouTube channel viewers.</li><li>Explore retargeting ads on Facebook, YouTube, and AdRoll with hands on tutorials showing you exactly how to make your ads and optimize them!</li></ol>  <p>  \t<em style=\"\"><strong style=\"\">Why take this course?</strong></em>  </p>  <p>  \tThere are many advantages to learning about retargeting/remarketing, especially in this course as it covers <strong style=\"\">EVERY LITTLE aspect of the subject</strong>. Some of the advantages of taking this course:  </p>  <ul style=\"\">  \t<li>Reach your existing audience on Google, Facebook, YouTube, Twitter, Perfect Audience, Google Analytics and even Google Tag Manager.</li><li><span>Earn additional income from your website (website owners)</span></li>  \t<li><span>Get paid for setting up retargeting/remarketing campaigns (marketers)</span></li>  \t<li><span>Get paid for optimizing and trouble-shooting other peoples </span><span>retargeting/remarketing </span><span>(marketers)</span></li>  \t<li><span>Become a consultant on retargeting/remarketing &amp; start earning more (marketers)</span></li>  \t<li><span>Grow &amp; expand your business &amp; brand </span><span>(website owners)</span></li>  \t<li><span>Save money and setup retargeting/remarketing without paying ad agencies a single dollar (marketers)</span></li>  </ul>  <p>  \t<strong style=\"\">Are there any <span>prerequisites?</span></strong>  </p>  <p>  \t  There are <strong style=\"\">NO </strong><strong style=\"\">prerequisites</strong> to taking this course. <em style=\"\">You don&#039;t need to know code, paid marketing or ANYTHING in digital marketing to take this course.</em> Having a website is definitely a plus, however is not required. The course is designed for all user levels and is structured in the most effective way possible for maximum learning and implementation.  </p>  <p>  \t<strong style=\"\">Material &amp; Follow-up</strong>  </p>  <p>  \t  Each and every section contains downloadable material that will help you remember and better expand your knowledge in the subject. The downloadable material is there to assist and confirm what you have learned. <em style=\"\">Every section contains video, audio and live presentations to help you become an expert in the subject quickly. </em>I have also made sure that all my students will have the ability to interact with me and ask me any questions that they feel are necessary to grow their knowledge.  </p>  <p>  \t<strong style=\"\">This is not your ordinary course!</strong> This course is designed from beginning to end with the intention to get you to become an expert/consultant in this area. Retargeting/remarketing has long been a best kept secret by agencies and expert marketers, however that&#039;s all about to change.  </p>  <p>  \tHope to see in the course! :-)  </p>", 
    "end_date": null, 
    "title": "Ultimate Guide to Retargeting (Adwords, Facebook, Twitter +)", 
    "price": "45.00", 
    "instructors": "Zaid Ammari", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/279308_8e9b_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-retargeting-remarketing-campaigns/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-12T09:13:16Z"
}