{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t    You will learn the exact system that I used to sponsor hundreds of people to join my network marketing team. Using the methods I teach, I was able create a list of over 1,000 prospects in a short space of time. That was just from one of the sections. I converted around 10% to paying customers.  </p>  <p>  \t<p>  \t\t     This system can be used by anyone looking for leads and prospects.  \t</p>  \t<p>  \t\t<p>  \t\t\t    The course starts off by showing you how to find an almost endless supply of leads. You will be surprised how many names you can come up with. You may have heard the phrase the &quot;money is in the list&quot; Every business knows they need a list of leads. You will learn how to grow your list whenever you need more names.  \t\t</p>  \t\t<p>  \t\t\t<p>  \t\t\t\t    The first part of the course is intended to be a work along. As you work through each lecture you will be prompted to add names to your list. You will be able to return to each lecture when you want to add more leads to your list.  \t\t\t</p>  \t\t\t<p>  \t\t\t\t<p>  \t\t\t\t\t    I decided to make the course a complete marking system. I originally was only going to teach the list building. I wanted to ensure that you knew what to do once you had a list. In part two, I teach the exact methods I used to make the first contact with the leads. It doesn&#039;t involve cold calling. (You can do that if you want) I used a system that allows me to almost on autopilot make contact with the lead. I will share with the letters and emails that I used. I explain the keys points used. This will allow you to edit them to fit your needs. In each of the videos I teach how the marketing systems works. Once you understand the marketing system you should be able to adapt it to your offer.  \t\t\t\t</p>", 
    "end_date": null, 
    "title": "Ultimate Marketing System build A list of Clients  Prospects", 
    "price": "20.00", 
    "instructors": "Gary Skinner", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238860_c31d_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-marketing-system-build-a-list-of-clients-prospects/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-07T11:16:30Z"
}