{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tGetting Targeted Converting Traffic to your Website is an Nightmare for most online business owners,  </p>  <p>  \tAccording to the latest reports 90% of Small Business Owners in USA Spending 60% of their Time on  </p>  <p>  \tMarketing their products through Google and Seo. Most of them get failed because of lots of reasons.  </p>  <p>  \tBut the most common reason is ....  </p>  <p>  \tThe most common reason is So much Competition and countless  </p>  <p>  \thours of consistent work without seeing any result And they need not only the targeted traffic to  </p>  <p>  \tthere website but also good conversion rate . So How will i get the most targeted and Converting Traffic  </p>  <p>  \tto my Website Without any Seo ?  </p>  <p>  \tHere is the good news &quot;TRAFFIC SECRET RESOURCES&quot; is designed for you To Get Tons of Converting Traffic to your Website  </p>  <p>  \tto Blast Leads and Sales Without any kind of SEO. The Best Part is this Course is Based on Most Of Traffic Resources  </p>  <p>  \tAll Over The the Web Through which You Can Get Traffic According To your Niche &amp; Business Needs. Also designed to keeping in  </p>  <p>  \tmind with most kind of niches on the web in very easy learning mode. You can complete this course in 1 week or less.  </p>  <p>  \tWhat offered in this Course is...  </p>  <p>  \t All Tested Latest Methods Of Getting Targeted Traffic With Lot of Different Resources  With or Without Any Kind OF Expertise and SEO  </p>  <p>  \t You will be Able to Get Highly Targeted and Converting Traffic According To your Niche  </p>  <p>  \tCan&#039;t wait to help you to get Tons of highly targeted and converting traffic to your website  </p>  <p>  \tGet Instant Access To t Traffic Secret Resources Now!  </p>", 
    "end_date": null, 
    "title": "Unlimited Traffic Secret|Tons of Targetted visitors No SEO", 
    "price": "20.00", 
    "instructors": "Zeeshan Shah", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44492_499b_10.jpg", 
    "course_url": "https://www.udemy.com/quality-traffic-cpanel/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-03T02:12:44Z"
}