{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Take your ecommerce to the next level. We'll show you how!</strong><br></p>  <p>Do visitors hit roadblocks moving from your product page to checkout? They want to buy, and you want to sell. But many websites make it hard for the customer. <strong>Are you breaking the rules of good user experience? </strong></p>  <p><strong>Learn how to do it right:</strong></p>  <p>Our course teaches you what you need to do on each page of your site, from homepage to product pages, to checkout and beyond. In addition, we’ll show you how to keep the customer connection going through correct use of emails. </p>  <p>This step-by-step course was designed to be <strong>practical</strong>. Sure, it’s nice to learn the theories behind UX practice, but we get right to the heart of the issue: What you need to do <u>today</u> to boost your conversion rates. </p>  <p>We know that the best way to learn is not listening – it's by doing! That’s why this course is jam-packed with real examples of every principle we teach. You’ll find practical quizzes and assignments to get you internalizing and implementing key UX concepts.</p>  <p><strong>It's worth it. Here's why:</strong> </p>  <p>We know that time is your most valuable asset, and no one has resources to waste. That said, putting in the time to learn and apply our UX principles means big ROI for you. Your investment will pay itself back many times over in increased sales and higher revenues. </p><p><strong>Proven best practices to share - with <u>you</u>!</strong></p><ul><li>key questions customers need answered on your homepage</li><li>helping customers find what they're looking for. Fast!</li><li>the most important part of your site to invest in – even if you don't have the resources</li><li>types of customers that visit your site, and how to give them what they want</li><li>streamlining and simplifying the checkout process</li><li>… and much more!</li></ul><p><br></p><p><strong>What am I going to get from this course?</strong></p>  <ul><li>30+ lectures and over 1.5 hours of packed video content!</li><li>Fun quizzes and assignments to put UX principles into action – right now!</li><li>Handy checklists to keep track of the changes you want to implement.</li></ul>      <p>At course end, you'll know how to create a great user experience, drive sales and keep visitors coming back for more!</p>", 
    "end_date": null, 
    "title": "User Experience design for eCommerce", 
    "price": "20.00", 
    "instructors": "Netcraft LTD", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585384_eafe_5.jpg", 
    "course_url": "https://www.udemy.com/make-more-money-from-your-ecommerce-site/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T13:14:37Z"
}