{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<span>Video Marketing Scholars (VMS) is designed for entrepreneurs and business owners that are looking for ways to advertise their businesses without spending a fortune on advertising.</span>  </p>  <p>  \tVideo marketing continues to grow at an extraordinary rate and will account for 74% of Internet traffic by 2017.  As a result, VMS was designed to help customers achieve page one rankings on the major search engines without resorting to paid advertising.  </p>  <p>  \tEverything on VMS starts with keyword research.  This is the cornerstone of the course.  We teach students how to use keyword research for Video Marketing, Video SEO, On-Page SEO, Local SEO and Article Marketing.  </p>  <p>  \tThe keyword research alone would help any entrepreneur or business owner do extremely well on social media marketing too.  </p>  <p>  \tThe Video Marketing Scholar course is primarily video driven.  Many of the things we demonstrate on the videos are applicable to what every student needs to do to be successful with video marketing.  </p>  <p>  \tThere are 8 sections in the VMS course.  Students may choose specific sections to focus on, but the course was designed to fill in as many gaps as possible to be successful.  </p>  <p>  \tVMS specifically addresses:  </p>  <ol style=\"\">  \t<li><span>Keyword Research</span></li>  \t<li><span>YouTube</span></li>  \t<li><span>Video Marketing</span></li>  \t<li><span>Webmaster Tools</span></li>  \t<li><span>On-Page SEO and Video SEO</span></li>  \t<li><span>PowerPoint And Keynote</span></li>  \t<li><span>Article Marketing</span></li>  \t<li><span>Google My Business</span></li>  </ol>  <p>  \tThere is approximately 7 hours of video content available to students. Each lecture is designed to address a specific knowledge gap within the 8 sections of this course.  </p>  <p>  \tVideo marketing should be a key component of any business owner’s arsenal.  VMS has gone to great lengths to fill in the knowledge gaps about video marketing and spent three full years refining the topics covered based on the dialogue we have had with customers all over the world.  </p>  <p>  \tThe value you will receive from VMS is incalculable.  </p>", 
    "end_date": null, 
    "title": "Video Marketing Scholars", 
    "price": "20.00", 
    "instructors": "Scott Morris", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378626_5721_5.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-scholars/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T17:14:44Z"
}