{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Learn how to create a web push notification marketing campaign and use it to bring valuable visitors back to your website</strong></p>\n\n<p>This course is going to give you a full understanding of what web push notifications are and how to use them in your online marketing activities.</p>\n\n\n\n<p>After providing an overview of what web push notifications are and we cover how to understand and communicate the customer benefit such that you are able to encourage visitors to sign up to your push notification programs. We also focus upon understanding your business goals such that any push notification program you develop has a great synergy been beneficial to the customer and yourself.</p>\n\n\n\n<p>The course covers examples of opportunities and how some online businesses are already using push notifications to great effect.</p>\n\n\n\n<p>Mindful of delivering pragmatic learning which can be applied at the end of the course we also focus upon how to get permission from the visitor to send them push notifications in the future. This is expanded to cover the requirement to build an ongoing relationship with each subscriber such that your push notification program is not subject to large-scale unsubscribes and viewed as spam communication.</p>\n\n\n\n<p>Building a push notification subscriber base is just as valuable as building an email subscriber base. However, it is not as easy as merely implementing a push notification program as there are some considerable dangers you can be exposed to if you select the wrong push notification service provider. You could end up not owning your subscriber base and be locked into their service for the foreseeable future. We cover how to select a service provider that does not penalise you like this and focus on the important items that you actually must own such that you can control your own subscribers and future communications with them.</p>\n\n\n\n<p>In this rapidly evolving area we also touch upon future developments and consider some of the opportunities which may arise in the next few months.</p>", 
    "end_date": null, 
    "title": "Web Push Notifications: Fast Start Guide To Get Subscribers", 
    "price": "20.00", 
    "instructors": "Alan Higginson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864808_3f43_3.jpg", 
    "course_url": "https://www.udemy.com/web-push-notifications-fast-start-guide-to-get-subscribers/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T16:04:10Z"
}