{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Successful Marketers <em>know</em> that live Webinars convert more leads to high paying cash customers than any other form of online marketing. PERIOD</p><p><strong>There are no exceptions to it.</strong></p><p><em>So Why isn't every marketer or online business owner running webinars?</em></p><p><strong>The simple truth is most people don’t understand the science to running live webinars.</strong><br><span></span></p><p><strong><em>There is an Intelligence behind webinars that works almost every single time.</em></strong></p><ul><li><strong>Rule # 1: Make them Webinar Hungry. </strong>This means you need to create a compelling topic to the right visitor so when they come to the landing page, your webinar is the perfect solution to their exact problem. </li><li><strong>Rule # 2: Build a Killer Webinar </strong>- Building a Webinar is not just a powerpoint presentation, rather it is a sequence of messaging that when it is presented, the attendee sees your product as a no brainer to their problem. </li><li><strong>Rule # 3: Follow Up &amp; Sell. </strong>This part is important, so important that executing it correctly can increase your sales by 200% to 300%. This is things like using scarcity, urgency and call to actions that make them want to click that buy button.</li></ul><p>This blueprint is based 100% on dozens of webinars that I've done and attended done over the years. What's the result of this blueprint? $10,000 - $100,000+ sales in 1 hour.</p><p>Webinar Intelligence will walk you through everything you need to know to maximize the power of your webinars.</p><p><strong>Take the course and Watch how it explodes the profits on your webinars.</strong></p><p>Watch how it gets you more registrations, more people showing up to your webinar and higher conversions and even more people watching your replays.</p><p><strong>100% Money-Back Guarantee For 30 Days.</strong></p><p>I'm 100% confident that when you use this blueprint that you’ll increase the results of your webinars.</p><p>Thats why I'm happy to once again stand behind our training and products and give you my 100% satisfaction guarantee.</p><p>Use it for 30 days, and if this training does improve your webinar stats, I'll simply give you your money back.</p>", 
    "end_date": null, 
    "title": "Webinar Intelligence: Earn Six Figures In 1hr Webinars", 
    "price": "20.00", 
    "instructors": "Basim Salim", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628922_e8e1_2.jpg", 
    "course_url": "https://www.udemy.com/webinar-intelligence-earn-massive-revenue-with-1-hour-webinars/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T15:53:32Z"
}