{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">----Introductory Price ONLY--- </strong></p><p style=\"\"><strong style=\"\"> \t                ----Updated w/ Bonus 1st Webinar in 24 Hrs Guide Added---</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Over $2 Million Dollars of Results from Webinars &amp; 25,000+ Happy Customers</strong>  </p>  <p style=\"\">  \t                           $50,229 in pure profits from an online sales presentation selling a product that didn't even exist….  </p>  <p style=\"\">  \t                           Those are the types of results that we've achieved with webinars in the span of just 5 days.  </p>  <p style=\"\">  \t                           On top of that, $58,077 in sales selling with the affiliate webinar model and $24,082 from a backend webinar.  </p>  <p style=\"\">  \t                           Check out our Proof Screenshots and Videos in the Free Preview Videos.  </p>  <p style=\"\">  \t<strong style=\"\">   Guarantee: By the end of this course you'll be able to create webinars that will generate $1,000+ each.  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">   What is a Webinar aka Online Sales Presentation?  </strong>  </p>  <p style=\"\">  \t                           It's simply a presentation that sells something at the end that can be scaled up to 100s of live attendees all eager to buy.  </p>  <p style=\"\">  \t                           You can sell informational courses like Udemy courses, software products, memberships or other people's products and still get 50%!  </p>  <p style=\"\">  \t                            The exact same principles we'll teach you apply to you if you're interested in live events and even high ticket one on one sales meetings.  </p>  <p style=\"\">  \t<strong style=\"\">   Who is the DigiStrats Team?  </strong>  </p>  <p style=\"\">  \t                           My name is Eric Weiss and on behalf of the DigiStrats team I want to welcome you to our 7-Day Webinar Course where I'll be teaching you from A to Z how to create a webinar business from scratch if you don't have any current business or how to explode your business with webinars if you're already selling online.  </p>  <p style=\"\">  \t                           We've sold over $3 million dollars' worth of products in the past 2.5 years alone and out of that $1.9 million can be attributed directly to webinars.  </p>  <p style=\"\">  \t                           In this course we'll unveil the hidden Black Art Webinar tactics that the 7-figure and 6-figure online business gurus use that are seldom discussed because these are the true money makers.  </p>  <p style=\"\">  \t                           We're going to go deep under the hood of our own business model and show you the exact strategies on how…  </p>  <p style=\"\">  \t                           -We sold $50,229 worth of product without having the product finished  </p>  <p style=\"\">  \t                           -You can copy &amp; paste our proven webinar sales presentation template that's done $2 MIL+ for us  </p>  <p style=\"\">  \t                           -We got 800+ attendees LIVE on a webinar that resulted in $50k+ in profits in 5 days  </p>  <p style=\"\">  \t                           Using the case study model, we'll construct a webinar from scratch during the course taking you through the following…  </p>  <p style=\"\">  \t<strong style=\"\">   -Day #1: 7-Figure Mental State</strong> - I tell you the easy way how to engage your audience even if you might think you're not the \"right personality\" for webianrs  </p>  <p style=\"\">  \t<strong style=\"\">   -Day #2: Webinar Building Blocks</strong> - The essentials for ultra-high conversions of $50+ per attendee for your webinars  </p>  <p style=\"\">  \t<strong style=\"\">   -Day #3: Masterminding a $50,299 Webinar Product </strong>- During this day I go over \"product hacks\" even if you have no product &amp; mastermind a product in a market I know ZERO about  </p>  <p style=\"\">  \t<strong style=\"\">   -Day #4: Crafting a $50,229 Presentation</strong> - During this module I'll dissect one of our webinars and show you how I build it from scratch  </p>  <p style=\"\">  \t<strong style=\"\">   -Day #5: Traffic of 800+ Attendees to Your Webinar</strong> - Without having attendees you can't sell anything so I'll walk you through filling up your webinars  </p>  <p style=\"\">  \t<strong style=\"\">   -Day #6: The Professional Studio Setup</strong> - I'll teach you how to get that \"Hollywood\" quality sound on your webinars and videos  </p>  <p style=\"\">  \t<strong style=\"\">   -Day #7: Webinar Systems</strong> - The dead simple walk through so you don't have to deal with any technical nonsense  </p>  <p style=\"\">  \t                           Plus you'll get <strong style=\"\">5 Bonuses</strong> for enrolling including our…  </p>  <p style=\"\">  \t<strong style=\"\">   -Bonus #1: The Exploitation Script</strong> that lets you \"hack\" product creation and have an industry insider create a high-value product while you just sell it for 50-75% of the profits  </p>  <p style=\"\">  \t<strong style=\"\">   -Bonus #2: The $100k Course Outline</strong> so you can mastermind a product in 15-minutes  </p>  <p style=\"\">  \t<strong style=\"\">   -Bonus #3: The 6-Figure Inner Circle Script</strong> to break into the world of 6-figure and 7-figure Online Business owners while making money from them with your webinar  </p>  <p style=\"\">  \t<strong style=\"\">   -Bonus #4: The $50,229 Webinar Outline</strong> so you can structure your webinar as we go through the course  </p>  <p style=\"\">  \t<strong style=\"\">   -Bonus #5: Our Microsoft PowerPoint Webinar Presentation Template</strong> that's Resulted in $2 MIL+ in Sales so you can just copy &amp; paste our webinar structure, fill in the blanks &amp; hit the ground running with a proven high-converting webinar  </p>  <p style=\"\">  \t                           There are even concrete action steps so that by the end of the course you'll have completed your first webinar.  </p>  <p style=\"\">  \t                           This is by far the most powerful, comprehensive and step-by-step course on webinars ever created.  </p>  <p style=\"\">  \t<strong style=\"\">   The Better than Money Back Guarantee  </strong>  </p>  <p style=\"\">  \t                        Of course there is a 30 day money back guarantee. But in my opinion that is weak so I'm going to come out and say that if you don't get results and see the value in this course then I demand that you get your money back because we are committed in getting you results and <strong style=\"\">if you follow the course and take action I am confident you will make money with webinars.</strong></p>  <p style=\"\">  \t<strong style=\"\">   Special Introductory Price - Rising Soon</strong></p>  <p style=\"\">  \t                           Normally we charge $497, $697 and $997 for our life changing courses but we will keep this introductory price before raising it as a special for the Udemy community.  </p>  <p style=\"\">  \t<strong style=\"\">   Take Action &amp; Enroll  </strong>  </p>  <p style=\"\">  \t                           Enroll now, make the commitment and jump straight into the course right now. I know this course will revolutionize the way you do business.  </p>  <p style=\"\">  \t                           See you on the inside and check out the preview videos to see what value you'll be getting!  </p>  <p style=\"\">  \t                           Talk soon,  </p>  <p style=\"\">  \t                           Eric  </p>  <p style=\"\">  \t                        ------------------------------------------------------------------------------------------  </p>  <p style=\"\">  \t<strong style=\"\">   Testimonial from Benjamin Hero (Niche: Personal Development)  </strong>  </p>  <p style=\"\">  \t                           When I first learned about webinars I had no idea how to create, structure or even present them. I was literally a complete newbie to all of this. But Eric literally taught me everything he knew, he made sure that I understand exactly how a webinar is run. I like to ask questions and I asked a whole lot of questions and he answered every single one of them. If you want to learn about webinars then I cannot think of a better source. - Benjamin Hero  </p>", 
    "end_date": null, 
    "title": "Webinar Alchemy: 7-Day Webinar Sales Blueprint", 
    "price": "40.00", 
    "instructors": "Digi Strats", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336426_dffb_3.jpg", 
    "course_url": "https://www.udemy.com/webinar-alchemy-7-day-webinar-sales-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T10:48:15Z"
}