{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Este curso vai ajudar você a tirar suas ideias do papel, perder o medo da tecnologia e alavancar seus negócios atraindo novos clientes e mostrando seu valor de forma simples mas profissional.</p>  <p>A minha intenção com este curso é criar uma rede de profissionais capacitados para usar este meio de comunicação. </p>  <p>Um grupo que esteja disposto a aprender e a compartilhar seus conhecimentos e experiências.</p>  <p>Um grupo que interaje, que compartilha e que pensa! </p>  <p>Um grupo de profissionais que compartilha ideias, estratégias e resultados!</p>  <p><strong>Por isso este curso será sempre atualizado, complementado e você poderá acompanhar este desenvolvimento de perto! </strong></p>  <p><strong>Na verdade, não quero que este curso tenha fim, quero que ele seja um início… o início de uma nova era no marketing de conteúdo e na educação a distância. </strong></p><p>Como será este curso?<br></p><p>O <strong>Curso Webinar Express </strong>será realizado em 3 módulos:</p><p><strong>Conceitos básicos:</strong></p><ul><li>Sobre os webinários: o que são webinários e como adaptá-los ao seu negócio</li><li>Requisitos para um webinário que gera resultados </li></ul><p><strong>Desvendando a tecnologia: </strong></p><ul><li>Equipamento necessário</li><li>Como funcionam as salas de webconferência</li><li>Como escolher um software/ plataforma para hospedar seus webinários</li></ul><p><strong>Planejamento</strong></p><ul><li>Cronograma de trabalho</li><li>Passo a passo para criação de webinários</li></ul><p>À partir da ideia, passando pela apresentação e até a avaliação dos resultados! </p><p>Como eu já falei, quero com este curso formar uma comunidade e para isso você vai poder aproveitar também de: </p><ul><li>Material complementar: textos, vídeos, tablemas e infográficos para melhorar o seu desempenho</li><li>Newsletter com as atualizações do curso</li><li>Grupo de apoio para compartilhar informações, desenvolver competências, sanar dúvidas, enviar sugestões: compartilhar mais para saber mais.</li><li>Aulas ao vivo (webinars) para que você possa aprender novas estratégias e tirar suas dúvidas ao vivo! </li></ul>", 
    "end_date": null, 
    "title": "Webinar Express", 
    "price": "20.00", 
    "instructors": "Leila Adriano Ostoyke", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758336_e5a3_4.jpg", 
    "course_url": "https://www.udemy.com/webinar-express/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T12:42:57Z"
}