{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Thumbnails can make a big difference in views you receive within search. <em>“A picture is worth a thousand words</em>\" and a thumbnail is worth more than a description.</p><p>Thumbnails are<strong> important </strong>in search results and in suggested videos.<br></p><p>3 Primary areas that having optimized video thumbnails can <strong>DRIVE MORE views</strong>.</p><p>In <strong>YouTube Search</strong> a better thumbnail can get you more clicks even if your video ranks lower in the search results.  People look at visual ques first when they are looking for content.  Having an appealing video thumbnail can really make a difference.</p><p><strong>Google Search</strong> - your video already has an advantage over websites in that videos in search results have Thumbnails.  Use this more effectively to drive traffic to your video.</p><p><strong>Suggested Videos</strong> - The suggested videos is one of the best sources for traffic to your YouTube Videos.   Stand out from the crowd and get more clicks on your video.</p><p><strong>Why you should consider optimization of your thumbnails!</strong></p><ul><li>more professional impression of your video</li><li>YouTube does not pick the most optimal image for your video</li><li>Your audience grow as people look at thumbnails first when deciding a video to watch</li><li>Quicker way to convince viewers to pick your video</li><li>Answer the viewers question and entice them on viewing your video</li><li>thumbnails can reinforce your video title and send a stronger message to the potential viewer.</li><li>Channel branding and consistency </li></ul><strong>Important factors in Thumbnail Optimization</strong><ul><li>Make them eye catching</li><li>use good contrast of colors</li><li>Represent your content</li><li>Always create a thumbnail</li><li>Clear and well designed</li><li>Visually compelling leaving the audience wanting more</li><li>make the audience curious to the content of your video</li><li>Close up of faces</li><li>Look great on all devices large and small</li><li>Hi resolution and clear</li></ul><em>Did you know that 70% of marketers plan to increase their use of visual assets?</em> That's because visuals are proven to drive more engagement.", 
    "end_date": null, 
    "title": "YouTube Thumbnails Power of Images for SEO Video Marketing", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519196_1746_5.jpg", 
    "course_url": "https://www.udemy.com/youtube-thumbnails-power-of-images-for-seo-video-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T15:29:07Z"
}