{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<hr><p>THE YELLOW BRICK ROAD OF MARKETING?</p><p><em>NOTICE: Course Recently Updated.  New tools, strategies and content.</em></p><p>YES... there's a yellow brick road to proven zero-cost marketing success and it starts with this \"Primer\" course. <br>  </p>    <ul>  \t<li>If you are a Small Business Owner, Startup or Entrepreneur... this is for you. <br>  </li>  \t<li>If you're a Marketer, Affiliate Marketer or Marketing Consultant... you'll love this!<br>  </li>  \t<li>If you want to market literally ANY product or service... get ready to take some serious notes.<br>  </li>  \t<li>Got a book, info-product, event, or ????? Want to maximize your profits? Look no further.<br>  </li>  </ul><hr>CAN THIS BE TRUE?    <ul>  \t<li>Yes, you can do 100% of your marketing for zero.</li>  \t<li>Yes, you can learn a LOT about marketing without spending a dime.</li>  \t<li>Yes, it is easy and works in all niches.</li>  \t<li>Yes, it can be a permanent (evergreen) solution.</li>  \t<li>But NO... this is NOT for everyone. </li>  \t<li>The one requirement is an open mind.</li>  </ul>  <p>Your instructor, Dan Hollings, has personally invested countless months researching, testing and compiling everything he knows about running a business for ZERO and marketing for ZERO. This is not theory, this is not hype; this is pure reality. <span><br>  </span></p>    <p>Dan has managed small campaigns, million dollar campaigns and epic campaigns, for himself and for his clients (yes, on a zero budget). Dan has also taught thousands of business owners, marketers, marketing managers, authors and consultants like you, to do the same.</p>  <hr>WHAT'S COVERED in this free marketing course?    <ul>  \t<li>The Core Problem Revealed... </li>  \t<li>Busting The \"Zero Cost\" Myth... </li>  \t<li>A Frank Look at Wasted Costs... </li>  \t<li>Let's Talk Tools (Pros &amp; Cons)... </li>  \t<li>25 Categories of Business &amp; Marketing... <br>  <br>  <strong> ZERO COST EXAMPLES</strong></li>  <ul>  \t<li>Example 1... A Viral Launch Strategy.</li>  \t<li>Example 2... How To Build a Zero Cost Squeeze Page.</li>  \t<li>Example 3... The Zero Cost Mobile Site.</li>  \t<li>Example 4... A Dual Landing Page Strategy.</li>  \t<li>Example 5... How to Do Text Message Marketing for Free.</li>  \t<li>Example 6... The Zero Cost Traffic Funnel.</li>  \t<li>Example 7... Zero Cost Newsletter List Building Tips.</li>  \t<li>Example 8... A Reminder Tool (lest we forget)<br>  <br>  </li>  </ul><strong>AND MORE...</strong><br>    \t<li>Cashing in... Where's The Money in Zero?</li>  \t<li>What's next?... Where to go from here!</li>  </ul><hr><strong>SO IT'S YOUR CHOICE...<br>   DO NOTHING or DO ZERO!</strong>    <p>Don't be fooled by the the word \"PRIMER\"... this course is for beginners and pros alike. There's something here for everyone... promise! Dan will walk you through the concepts, challenges, myths, and marvels of marketing on a zero budget.<br>  </p>    <p>Dan presents most of this program in video format with high-quality slides, illustrations and animations. EIGHT hands-on examples are revealed (including case studies) so that you may begin your journey to zero cost with full confidence you are on the right path.</p>    <p>This course is a robust and exciting introductory course, not intended to take you all the way to the horizon... but guaranteed to take you far enough so that you'll never think twice about turning back.</p>  <hr>RAVE REVIEWS BY UDEMY STUDENTS...    <p>Nothing says more about the quality and benefits of a course than the <strong>reviews and testimonials</strong> of the students, business owners, entrepreneurs, authors, consultants and marketers that have participated in this course. Please enjoy dozens and dozens of reviews for <em>Zero Cost Marketing Strategies</em> at the LOWER RIGHT of this page. &gt;&gt;&gt;&gt;<br>  </p>  <hr>Your \"Journey To Zero\" Begins Now...    <p>Over 3 HOURS of video plus slides and resources:</p>    <p><span>Take this Free Marketing Course right now and learn free marketing ideas &amp; strategies for your business.</span><br>  </p>", 
    "end_date": null, 
    "title": "Zero Cost Marketing Strategies: Official Primer Course (NEW)", 
    "price": "30.00", 
    "instructors": "Dan Hollings", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37310_11d5_18.jpg", 
    "course_url": "https://www.udemy.com/zero-cost-marketing-secrets-official-primer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-21T16:10:27Z"
}