{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<span>Данный курс создан проектом «Теплица социальных технологий».</span>  </p>  <p>  \tВместе с нами ты узнаешь, как создать сайт для своего проекта, создать и оформить содержание, продвигать его, а также анализировать эффективность.  </p>  <p>  \tВсе тематические блоки созданы специалистами Теплицы и организованы в виде пяти модулей:  </p>  <p>  \t·«Введение»;  </p>  <p>  \t·«Основы Всемирной сети»;  </p>  <p>  \t·«Управление CMS», «Создание и управление содержанием»;  </p>  <p>  \t·«Социальные сети»;  </p>  <p>  \t·«Веб-аналитика».  </p>  <p>  \t<strong style=\"\">Каждый модуль</strong> содержит наглядные видеолекции и скринкасты, каждый длительностью в несколько минут. Каждый модуль завершается мини-тестом.  </p>  <p>  \tВесь курс будет завершен финальным тестом по всем разделам сайта.  </p>  <p>  \t<strong style=\"\">Курс рассчитан</strong> на активистов гражданского общества, сотрудников общественных организаций и НКО. Он проводится в рамках конкурса малых сайтов.  </p>  <p>  \t<strong style=\"\">Курс носит практический характер</strong> и позволит вам освоить навыки самостоятельного создания сайтов средней сложности. Вы узнаете обо всех тонкостях сайтостроения и сможете хорошо разбираться в терминологии и технических аспектах разработки сайтов. Это поможет вам не только самим создавать сайты, но и понимать, о чем говорят разработчики, если вы предпочтете в дальнейшем заказывать создание сайта на стороне.  </p>  <p>  \t<strong style=\"\">Курс на русском языке.</strong> Длительность видеолекций от 1 до 8 минут. Все модули имеют список дополнительной литературы и ресурсов, который постоянно пополняется. Следите за обновлениями.  </p>  <p>  \t<strong style=\"\">Если у вас возникнут вопросы</strong> в ходе изучения, вы сможете их задавать в разделе комментарии, и наши инструкторы ответят вам и помогут разобраться в сложных моментах.  </p>  <p>  \t<strong style=\"\">Конкурс малых сайтов</strong> – это уникальная возможность для вашей организации, инициативы или объединения вместе со специалистами Теплицы создать красивый, современный и функциональный сайт абсолютно бесплатно.  </p>  <p>  \tСотрудники Теплицы хорошо знакомы с типичными проблемами и вызовами сайтов некоммерческих организаций и общественных инициатив. За последние два года мы помогли сотням некоммерческих организаций консультациями, грантами, прямой технической поддержкой.  </p>  <p>  \tЭтот опыт мы представляем в специально спроектированном для НКО онлайн-курсе по созданию сайтов, который нужно пройти каждому участнику конкурса.  </p>  <p>  \tТаким образом, вы имеете шанс не только разработать современный сайт для вашей организации, но и получить необходимые навыки для поддержки и управления сайтом самостоятельно.  </p>", 
    "end_date": null, 
    "title": "Как создать, развивать и продвигать сайт", 
    "price": 0, 
    "instructors": "Алексей Сидоренко, Oleg Gant", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280064_9c39_2.jpg", 
    "course_url": "https://www.udemy.com/website-dev-101/", 
    "subject_name": [
        "Digital Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T11:27:15Z"
}