{"selfpaced": false, "topic_name": ["Self Improvement"], "description": "\n\n                    \n                    \n                    El curso está diseñado para que aprendas a generar un poder sin límites y despertar en ti la importancia de tomar iniciativas, riesgos y emprender acciones valientes que te permitan tomar ventaja de los diferentes retos y situaciones que se te presenten.\n\nNuestro curso te proporcionará el conocimiento y las herramientas para establecer estrategias triunfadoras y a poderlas aplicar con éxito. Si buscas: reforzar un liderazgo empresarial, nuevas oportunidades de negocio, una estrategia empresarial, emprender un negocio o superación personal, estás en el curso indicado, ya que con nuestro catedrático especializado quien tiene en su experiencia la asesoría de más 90 empresas internacionales de diversas industrias, y quien logrará en ti llegar a tener más que negocio rentable o una superación personal.\n\nLa estrategia de éxito se convierte en el elemento crucial que permite a personas, empresas, instituciones y países tomar ventaja de las situaciones que enfrenta, de los recursos con los que cuenta y para eso, el curso consigue el entendimiento preciso de la situación, la concepción original de la forma en que puede tomar la ventaja sobre competidores o adversarios y cómo generar el crecimiento sostenido a lo largo del tiempo, fortalece el liderazgo haciendo énfasis en el desarrollo del estratega, quien piensa y actúa en cualquier momento como tal, para quien su objetivo además de ser efectivo es triunfar en cada batalla librada a lo largo de su vida o en la empresa.\n\nAdemás con nosotros aprenderá a analizar la forma en que toma decisiones y entiende sus limitantes, a conseguir que la visión sea de largo plazo y que se considere el tiempo y los recursos en general como escasos. Durante 6 semanas trabajarás sobre la originalidad y creatividad necesaria para conseguir que el factor sorpresa se consiga y genere ventaja. Partiendo del principio de que la estrategia se establece para el peor de los escenarios, todo el curso está basado en la realidad, en la que existe competencia y terrenos complicados para poder lograr los objetivos.\n\nAtrévete a convertirte en una herramienta contundente y se un generador de acciones incontenibles hacia el éxito.\n\n                                    ", "end_date": "2016-06-27T00:00:00Z", "title": "CNeg001x: Diseño de Estrategias Exitosas y Acciones Incontenibles", "price": 0, "instructors": "Jorge Iván Echeverría Permouth", "institution_name": ["Galileo University"], "commitment": "5-6 hours", "subject_name": ["Personal Development"], "course_url": "https://www.edx.org/course/diseno-de-estrategias-exitosas-y-galileox-cneg001x", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edX"], "start_date": "2016-05-16T00:00:00Z"}