{"selfpaced": false, "topic_name": ["Self Improvement"], "description": "\n\n                    \n                    \n                    Have you ever faced a decision you really struggled over, but just couldn’t find your way? Imagine you had been given a set of tools, so you were confident of making the best choice you could make. This course provides a path to developing those decision skills and improving your life.Good decision-making is an essential life skill most people acquire through trial and error. Few have had the benefit of formal training in decision making or are aware of decision science. This course demonstrates how a framework to help us make better decisions, decision quality, can help overcome common mistakes humans fall into, decision traps. The principles and practice of decision quality have been successfully applied in business, medicine, and engineering. Through our work with teachers, schools, and students, we have witnessed the tremendous value this material brings through helping individuals and groups resolve their toughest dilemmas.\r\nIn this course you will:\r\n\r\nLearn the decision quality framework for improving your personal and life decisions\r\nDiscover common decision traps and tools to combat them\r\nApply the decision framework to a variety of situations to experience the value of making better decisions\r\n\r\nParticipants in similar courses have experienced increased awareness of decision opportunities and greater confidence in making decisions. Furthermore, improving your motivation and commitment in following through increases your chances of a successful outcome for your decisions.\r\nThis course is designed for adults who work with youth: educators, mentors, counselors and parents. Teenagers will also find the material accessible and relevant to their life and the choices they face. For this reason, parents and mentors can benefit from participating in the course along with a young person to gain a shared language for decision making. These advanced concepts have demonstrated value with individuals of all ages and we believe those who apply them will find they are of immediate value in improving their life.The Decision Education Foundation (DEF) is dedicated to making decision skills accessible to young people and to bringing decision education into the mainstream. Visit www.decisioneducation.org for more information.\n\n                                            Syllabus\n                        Weeks 1-2: Take Charge and Improve Your Outcomes with Decision Skills and Form TeamsWeek 3: Recognize and Avoid Decision TrapsWeek 4: Define a Helpful Frame and Clarify Your ValuesWeek 5: Explore Creative Alternatives and Generate Useful InformationWeek 6-7: Apply Sound ReasoningWeek 8: Commit and Follow Through\n                                    ", "end_date": "2016-09-12T00:00:00Z", "title": "Decision Skills: Power Tools to Build Your Life", "price": 0, "instructors": "Chris Spetzler", "institution_name": ["Decision Education Foundation"], "commitment": "2-3 hours", "subject_name": ["Personal Development"], "course_url": "https://novoed.com/decision-skills-11", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["NovoEd"], "start_date": "2016-07-18T00:00:00Z"}