{"selfpaced": false, "topic_name": ["Self Improvement"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Personal Development\n                                                                                            \n                            \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Personal Development\n                                                                                                    &gt; Self Improvement\n                                                            \n                            \n                                                \n                    \n                    \n                    Leaders must be able to act in a complex world and under uncertainty. This course is a first step to develop yourself into one of the future’s key decision makers or to enhance your decision-making skills.\n\nFirst, this course will address what complexity is and will define uncertainty. Next, we cover a number of tools and methods to understand and be able to navigate through the complex and uncertain world.\n\nThe need for a multidisciplinary approach will be emphasised throughout the course. Guest lecturers from different faculties will explain, provide applications and examples from their respective fields of study for a more comprehensive understanding of the different elements of complexity. For example, complexity can be beautifully explained by the use of insects and brains and many other natural and social phenomena. The same ideas can be applied to economic and financial systems.\n\nAfter introducing the first principles, guest lecturers will cover interdisciplinary aspects of complexity. These are graph theory and networks, emergent behaviour, agent-based modelling, evolutionary dynamics, cellular automata and self-organisation, complexity in history, decision making under uncertainty, heuristics and biases and subsequently entrepreneurship. Finally, relating this all back together in two case studies will conclude the course. The first case study is financial stability and crises and the latter is growth and development of cities.\n\nBy completing this course you will have developed skills and knowledge that will enhance your decision-making skills in order to act in a complex world and under uncertainty.\n\nThis course has received a major update in 2016 with added content on agent-based modelling, entrepreneurship and city planning.\n\n\n                                    ", "end_date": "2016-10-17T00:00:00Z", "title": "Decision Making in a Complex and Uncertain World", "price": 0, "instructors": "Lex Hoogduin", "institution_name": ["University of Groningen"], "commitment": "6 hours", "subject_name": ["Personal Development"], "course_url": "http://www.futurelearn.com/courses/complexity-and-uncertainty?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-09-05T00:00:00Z"}