{"selfpaced": false, "topic_name": ["Self Improvement"], "description": "\n\n                    \n                    \n                    This is a short interdisciplinary course on strategic thinking and some of its most powerful tools. Strategic thinking is not exclusive to business applications or the military. The skills taught in this course can be useful to anyone. Young professionals can use the knowledge to effectively plan their careers, stay-at-home mothers can use it to improve how they communicate with their children, and entrepreneurs can use it to better position their business in the marketplace. Anyone who wants to learn how to think about and solve social, business, personal, environmental, or other problems in smarter and more creative ways will benefit from this course.\r\n\r\nWe will draw lessons and use concepts from economics and game theory, scenario planning, and futures studies, as well as philosophy and language. The course includes reading material, video lectures, and audio content, which is accompanied by short quizzes derived from that content. We will also work on case studies for each topic where students will have an opportunity to practice the tools and frameworks and discuss them with the learning community. At a reasonable pace of approximately one hour per day, a student can finish the course in about one week. The workload will depend on how quickly students consume the content and how much time and effort they wants to devote to the case study assignments. The course will be open for three weeks.\r\n\r\nThis course is designed to be a starting point for people who are just beginning to learn about strategic thinking. It is relatively short, informal, easy to follow, and practical (and hopefully entertaining).\n\n                                    ", "end_date": "2015-07-13T00:00:00Z", "title": "Introduction to Strategic Thinking", "price": 0, "instructors": "Sandjar Kozubaev", "institution_name": [], "commitment": "", "subject_name": ["Personal Development"], "course_url": "https://www.canvas.net/browse/canvasnet/courses/introduction-to-strategic-thinking-4", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Canvas.net"], "start_date": "2015-06-22T00:00:00Z"}