{"selfpaced": false, "topic_name": ["Anthropology"], "description": "\n\n                    \n                    \n                    People have explored and depended on the oceans of our planet for millennia. During that time the geography of our world has changed radically as coastal regions have flooded and islands have risen up, or been lost beneath the waves. With 70% of the world’s surface covered by water, an unparalleled, yet largely untouched record of human life has been left beneath the sea for us to discover, from our earliest ancestors right through to present day. Over the length of this Shipwrecks and Submerged Worlds course we will learn about maritime archaeology together - exploring underwater landscapes from the ancient Mediterranean to the prehistoric North Sea, and consider Shipwrecks from the Indian Ocean to the Pacific coast of the Americas.\n\nWe will introduce you to the pioneers of the discipline and explain what maritime archaeology is and why it is relevant today. We’ll also explore the technologies used to investigate these challenging environments and the new horizons that are opening to us daily. Finally, we’ll help show you ways in which you can become further involved in the exciting world of maritime archaeology.\n\nThe Centre for Maritime Archaeology is one of the world’s leading maritime research centres. Its strength lies in the breadth and depth of knowledge held by its staff, its variety of active projects across the globe and the energy and enthusiasm of its students. As you will learn through this course, maritime archaeology is a highly demanding field, drawing on marine geophysics, archaeology, history, environmental science and advanced computing techniques. We hope that the diverse expertise of our team can truly do justice to the potential of this topic to transform our understanding of human society in the past, present and potentially the future.\n\nThe educators on this course are:\n\n\n  Professor Jon Adams\n  Dr Lucy Blue\n  Peter Campbell\n  Thomas Dhoop\n  Dr Helen Farr\n  Dr Jesse Ransley\n  Dr Fraser Sturt\n  Dr Julian Whitewright\n\n\nYou can keep up to date with what’s happening via our blog and on our Twitter account @UoSShipwrecks.\n\nYou can also find out how maritime archaeology can help us dispel stereotypes in this blog post from educator, Peter Campbell, for Talk Like a Pirate Day.\n\n\n                                    ", "end_date": "2016-02-29T00:00:00Z", "title": "Shipwrecks and Submerged Worlds: Maritime Archaeology", "price": 0, "instructors": "", "institution_name": ["University of Southampton"], "commitment": "4 hours", "subject_name": ["Social Sciences"], "course_url": "http://www.futurelearn.com/courses/shipwrecks?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-02-01T00:00:00Z"}