{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    This health and safety course explores a variety of electronic applications used in the promotion of healthy behavior, focusing on cases relating to physical health (electronic cigarettes), mental health (apps and wearables), and social health (e-mediation). In each of these areas, experts will share cutting-edge scientific knowledge and demonstrate some of the latest e-applications to boost healthy behavior. The course consists of 4 modules:\n\ne-Cigarette: Promoting physical health. In this module, you will learn about the potential implications of e-cigarettes as a Tobacco Harm Reduction Strategy. You will gain contemporary scientific knowledge about the safety, efficacy, and potential health threats of using e-cigarettes.\n\te-Mental Health: Promoting mental health. In this module, you will learn about innovations in online, mobile and wearable tools used in mental healthcare (a rapidly expanding field), as well as their potential advantages and disadvantages.\n\te-Mediation: Promoting social health. In this module, you will learn about the core principles of mediation, and how you can use electronic communication to prevent escalation and promote conflict resolution during the mediation process.\n\tFAQ and closing: In this module, our experts address the questions that were most frequently asked by you and your ‘fellow-travelers’ during this MOOC.\nThis MOOC consists of knowledge clips, demonstration movies, exercises, discussion, and homework (reading) assignments.\n\n                                    ", 
    "end_date": "2016-12-27T00:00:00Z", 
    "title": "ePSYx: Trends in e-Psychology", 
    "price": 0, 
    "instructors": "Frank Baeyens, Katalien Bollen, Martin C. Euwema, Filip Raes, Dinska Van Gucht and Tom Van Daele", 
    "institution_name": [
        "KU Leuven University"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/trends-e-psychology-kuleuvenx-epsyx-0", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-11-15T00:00:00Z"
}