{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\nDo you have a personal improvement goal that has proven resistant to your sincerest intentions, smartest plans, and best efforts? If so, then this course is for you. Last spring, we kicked off a world-wide experiment to see if Kegan and Lahey’s ground-breaking, award-winning approach (the Immunity to Change process) could be deployed online to help tens of thousands of people make lasting changes at work or in their private lives. The experiment was largely a success! Many participants succeeded at making important changes in their lives. Here’s what our students have to say:\n\n“When I first started, I was a bit skeptical on how I would actually change. Looking back at myself 14 weeks ago and comparing it with how I am now is incredible! I couldn't be happier that I decided to take this course and learn a new approach to change. My life is so much better because of it.”\n\t“Someone asked me recently if I felt like I'd just wasted 14 whole weeks on self-inquiry. I can honestly say no - I feel like I wasted 30 years sleepwalking!  An incredible experience. Bob and Lisa have created a truly wondrous process, and the staff and fellow students have built a rich and supportive learning environment.” \n\t“I appreciated the opportunity to feel like I was a part of a bigger community striving to grow and improve. This made me want to constantly push myself because I believed in the power behind the material and in the power of being part of a community working toward similar goals.”\n\t“This has been an amazing course and I have made long lasting changes that I didn't even dream about when I began this course. There is no way to express my deepest thank you for that . . . my life is changed.”\nThis fall, we invite you to join us in a continuation of this experimental personal development course. Via demonstrations, exercises, readings, personal experiments, and novel interactive tools, this course will teach you new psychological theory about personal change, but—more than this—it will engage you in applying that theory to yourself from the first class to the last.\n\nIn 2011 Oprah Winfrey listed the Top Ten Things You Should Do to Start the New Year Right. Number One on the list was, “Try the Immunity-to-Change approach.” Come, join us!\n\nThis course runs from Tuesday, September 16 to Monday, December 15, 2014. It begins on September 16 with a one-week orientation. The orientation is designed to introduce you to the culture of the community we will form together and the technology we will use. Some of you may not need the full week to complete the orientation. The substance of the course begins a week later, on September 23.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\n                                    ", 
    "end_date": "2014-12-23T00:00:00Z", 
    "title": "GSE1.1x: Unlocking the Immunity to Change: A New Approach to Personal Improvement", 
    "price": 0, 
    "instructors": "Nick Parlante, Robert Kegan and Lisa Lahey", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.edx.org/course/unlocking-immunity-change-new-approach-harvardx-gse1-1x", 
    "duration": "14 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-09-16T00:00:00Z"
}