{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    psy-001\n                                                                    psy-002\n                                                                    psy-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Since we were young children, we have tried to understand, to predict,\nand to control behavior. We first dealt with our parents and teachers,\nand later our friends and companions. This course shows, however,\nhow the understanding, prediction, and control of behavior require scientific\nvalidation. By using tools that are systematic and objective, psychology\nhas learned how people behave and think.\n\nPsychology is a very broad field of study and the course will include\ndiscussions of the brain and nervous system, sensation and perception,\nlearning, memory, intelligence and thinking, lifespan development, emotion\nand motivation, personality, social behavior, behavioral disorders, and\npsychological treatment of disorders. The course will include short\nlecture modules, demonstrations and experiments, and writing assignments.\n\n\n\n                                            Syllabus\n                        This is a twelve-week Introductory Psychology course that is usually taught in the first year of college. There is a Spring Break during the week of March 17-21, 2014. Psychology is a broad discipline as you can see in the outline, and the course will\nsurvey the many areas studied by psychologists. Psychologists study the mind and behavior.\nThis course was funded by a generous grant from the Bill &amp; Melinda Gates Foundation. The QM certification mark recognizes that this course met Quality Matters review standards.\n\n\nPrerequisite Knowledge\nThere are no prerequisites for this course.\n\n\nOnline Resources\nWe will be using material developed by Carnegie Mellon University called the Open Learning Initiative. The OLI material is divided into 56 modules and the course outline indicates which modules will be covered each week. Learning objectives are given\nat the beginning of each module.\n\n\nGrading Policy\nThere will be a multiple choice quiz at the end of each week of lecture (11 quizzes total). The quizzes will be timed and you can only take each quiz only once. Quizzes will be available from 5:00 PM EST on Friday of each week until 5:00 PM on the next\nWednesday. The lowest quiz score will be automatically dropped. There will be a final exam at the end of the course. The overall allocation of quizzes and projects to the final grade are as follows::\n\n\n    Quiz average: 50% of final grade\n    Final examination: 50% of final grade\nA total score of 70% or higher will guarantee a passing grade in the course and a Statement of Accomplishment. Earning a score of 85% or higher will guarantee a passing grade in the course and a Statement of Accomplishment with Distinction.\n\n\nCommunication\nPlease communicate with the instructor and staff via the online forums. Because there are so many students, it is not possible for us to respond individually to every question. There will be a Q&amp;A forum where you can post your questions about the\ncourse. Students will have the opportunity to \"vote up\" questions they want answered, and the questions with the most votes will be answered either in a forum post or a video. Announcements from the instructor about the course will be sent via e-mail\nto all registered students and also will appear on the announcement page.\n\n\nNetiquette\nWritten English language will be the primary means of communication. Please interact with your fellow students and the instructor in the discussion forums. There can be miscommunication as there is no intonation in these written communications. Please\nbe positive, supportive, and constructive in your comments and forum postings.\n\n\nExpectations\nParticipants are expected to:\n\n    Watch all lecture videos every week\n    Complete all quizzes and the final examination\n    Abide by the standards of academic honesty – plagiarism and any form of cheating will not be tolerated and will result in the removal of the participant from the course\n    Seek help if needed from your fellow students by using the forums\n\n\n\nHonesty\nYour answers on quizzes and the exam should be your own.\n\n\nCourse Goals\nUpon successful completion of the course, students will be able to describe what psychologists study. They will be exposed to basic information about the different areas of psychology listed as different modules in OLI and weekly topics in the outline.\nThey will understand that we can understand behavior only by doing research to uncover the facts.\n\nSpecific course goals are:\n\n    Students will be able to recognize and describe major psychological principles, theories, and perspectives.\n    Students will be able to distinguish between different methods used by psychologists to study the different areas of psychology.\n    Students will be able to describe the nature-nurture controversy across different areas of psychology.\n    Students will know the basic principles in each area of psychology and how good research is required to understand these principles.\n    For each area of psychology, students will know how the nervous system and other biological systems are involved in understanding behavior in that area.\n\n\n\nCourse Outline\n\n\n    \n        \n            Week\n            Topic\n            Modules\n            OLI Modules\n        \n        \n            Week 1\n                January 13-17\n            Psychology as a Science\n            a. Introduction to the course\n                b. Analysis of pretest\n                c. Scientific methods\n                d. Example of experimental method\n            OLI 1-4\n        \n        \n            Week 2\n                January 20-24\n            Biopsychology\n            a. Neurons\n                b. Nervous system\n                c. Biopsychology\n                d. Methods of biopsychology and neuroscience\n            OLI 5-8\n        \n        \n            Week 3\n                February 3-7\n            Sensation and Perception\n            a. Introduction to sensation and perception\n                b. Vision\n                c. Receptive fields\n                d. Audition and the other senses\n                e. Depth perception\n            OLI 9-12\n        \n        \n            Week 4\n                February 10-14\n            Learning\n            a. Learning and classical conditioning\n                b. Operant conditioning\n                c. Other types of learning\n            OLI 13-15\n        \n        \n            Week 5\n                February 17-21\n            Memory\n            a. Introduction to memory\n                b. Types of memory\n                c. Episodic memory\n                d. Memory errors and amnesia\n            OLI 16-19\n        \n        \n            Week 6\n                February 24-28\n            Cognition, Language, and Intelligence\n            a. Language\n                b. Intelligence\n            OLI 20-24\n        \n        \n            Week 7\n                March 3-7\n            Development\n            a. Cognitive development\n                b. Social development\n                c. Aging and memory 1\n                d. Aging and memory 2\n            OLI 25-30\n        \n        \n            Week 8\n                March 10-14\n            Motivation and Emotion\n            a. Motivation\n                b. Hunger\n                c. Emotion\n                d. Measuring emotion\n            OLI 31-33\n        \n        \n            \n                SPRING BREAK\n                \n            \n        \n        \n            Week 9\n                March 24-28\n            Personality\n            a. What is personality?\n                b. Psychodynamic approach\n                c. Measuring personality\n            OLI 34-36\n        \n        \n            Week 10\n                March 31-April 4\n            Social Environment\n            a. Social cognition\n                b. Conformity, compliance, and obedience\n                c. Attitudes\n            OLI 37-39\n        \n        \n            Week 11\n                April 7-11\n            Psychological Disorders\n            a. Psychological disorders\n                b. Depression and mood disorders\n                c. Schizophrenia\n            OLI 46-52\n        \n        \n            Week 12\n                April 14-18\n            Treatment\n            a. Medical treatment\n                b. Psychotherapy\n                c. Cognitive therapy\n                d. Alzheimer's disease and wrap-up\n            OLI 53-56\n        \n    \n\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Introduction to Psychology as a Science", 
    "price": 0, 
    "instructors": "Anderson D. Smith", 
    "institution_name": [
        "Georgia Institute of Technology"
    ], 
    "commitment": "8-10 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/course/psy", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-01-13T00:00:00Z"
}