{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    The great 18th century writer Dr Samuel Johnson, who suffered from severe bouts of depression, said “the only end of writing is to enable the reader better to enjoy life or better to endure it.”\n\nThis free online course will explore how enjoying literature can help us to endure life.\n\nTaking Johnson’s phrase as a starting point, the course will consider how poems, plays and novels can help us understand and cope with times of deep emotional strain. The reading load will be flexible, and you will have the opportunity to exchange ideas and feelings via the online discussions with other learners.\n\nTogether, we’ll explore six themes:\n\n\n  \n    Stress: In poetry, the word “stress” refers to the emphasis of certain syllables in a poem’s metre. How might the metrical “stresses” of poetry help us to cope with the mental and emotional stresses of modern life?\n  \n  \n    Heartbreak: Is heartbreak a medical condition? What can Sidney’s sonnets and Austen’s Sense and Sensibility teach us about suffering and recovering from a broken heart?\n  \n  \n    Bereavement: The psychologist Elisabeth Kübler-Ross famously proposed that there are five stages of grief. How might Shakespeare’s Hamlet and poems by Wordsworth and Hardy help us to think differently about the process of grieving?\n  \n  \n    Trauma: PTSD or “shellshock” has long been associated with the traumatic experiences of soldiers in World War 1. How is the condition depicted in war poetry of the era? Can poems and plays offer us an insight into other sources of trauma, including miscarriage and assault?\n  \n  \n    Depression and Bipolar: The writer Rachel Kelly subtitles her memoir Black Rainbow “how words healed me – my journey through depression”. Which texts have people turned to during periods of depression, and why? What can we learn from literature about the links between bipolar disorder and creativity?\n  \n  \n    Ageing and Dementia: One of the greatest studies of ageing in English Literature is Shakespeare’s King Lear. Is it helpful to think about this play in the context of dementia? Why are sufferers of age-related memory loss often still able to recall the poems they have learned “by heart”?\n  \n\n\nLeading you through the course and readings will be:\n\n\n  \n    Dr Paula Byrne: One of the world’s leading Jane Austen experts, who conceived of this course while researching how Austen’s novels were prescribed to victims of shellshock in World War 1.\n  \n  \n    Professor Jonathan Bate: A critic, biographer and reviewer; Man Booker Prize judge; and author of a prize-winning biography of the poet, John Clare, and Being Shakespeare - the hit one-man play for Simon Callow. Jonathan is also the Lead Educator on the immensely successful Shakespeare and his World FutureLearn course.\n  \n\n\nAlong the way, you’ll also hear from doctors, who offer a medical perspective on the conditions discussed in the course, as well as from a range people who have turned to literature at moments of crisis, including such well-known figures as Melvyn Bragg, Ian McKellen and Stephen Fry.\n\nYou’ll have the opportunity to share your own experiences, discover new texts, and take part in activities that explore the relationship between reading and wellbeing. Start now by following the link to Professor Jonathan Bate and Dr Paula Byrne’s article for the FutureLearn blog ‘Can you find solace in a sonnet?’, where you can reflect on the calming and reassuring powers of a short poem.\n\nCome and join the conversation.\n\nLearner comments\n\nWe have had such a hugely positive reaction to the course. Here are just a few of the wonderful comments learners have said about the course so far:\n\n\n  “I [have] loved this course, thank you. It has reminded me of the power of words to lift us up and that express emotions and conditions that can be hard to deal with. I have been inspired to read and write more poetry as a result. Thank you again!” - Susan Perry\n\n\n\n  “Thoroughly enjoyed the course and found it really rewarding. Excellent content and food for thought. I can’t praise it highly enough. I’m now totally convinced about the impact literature can have on mental health. I know it will help more people in future - literature, art and music has a tremendous power to help healing and promote mental well-being. It is a lifeline and a wonderful coping mechanism. It’s been great to learn from and share experiences with all the delegates too.” - Dr. Rachael Turner\n\n\n\n  “I have have enjoyed this course immensely. It’s given me a new outlook on life and even the courage to read new and exciting things and to even enjoy a wider range of materials I’ve ever thought of. A really wonderful experience and I’ve loved the feedback and comments from fellow course members.” - Amanda Bedwell\n\n\n\n                                    ", 
    "end_date": "2016-10-17T00:00:00Z", 
    "title": "Literature and Mental Health: Reading for Wellbeing", 
    "price": 0, 
    "instructors": "Jonathan Bate and Dr Paula Byrne", 
    "institution_name": [
        "The University of Warwick"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/literature?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-05T00:00:00Z"
}