{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    ¿Cómo podría integrarse la práctica de la atención plena con la inteligencia emocional? Este es el contenido fundamental que desarrollaremos en el presente curso, a través del entrenamiento en Inteligencia Emocional Plena (INEP).\r\nLa Atención Plena o Mindfulness basada en la técnica milenaria de la Meditación ha sido recientemente integrada por la Psicología Contemporánea como herramienta válida, fiable y con efectos terapéuticos demostrados.\r\nEn este curso aprenderás nociones básicas sobre Inteligencia Emocional y Atención Plena, y cómo, la práctica regular de la Atención Plena puede favorecer el desarrollo de las habilidades emocionales. Así, cuando focalizamos la atención plena en los contenidos emocionales, se facilita enormemente la comprensión y regulación de nuestras emociones.\r\n \r\nConocimientos necesarios:\r\n \r\nAlguna experiencia práctica en desarrollo personal o en su defecto algunas nociones básicas de psicología\n\n                                            Syllabus\n                        Módulo 0. Bienvenida\r\nMódulo 1. Inteligencia emocional\r\nMódulo 2. Comunicación y relaciones interpersonales\r\nMódulo 3. Mindfulness o Atención Plena\r\nMódulo 4. Efectos de la práctica Mindfulness\r\nMódulo 5. Programa Inteligencia Emocional Plena I\r\nMódulo 6. Programa Inteligencia Emocional Plena II\n                                    ", 
    "end_date": "2015-11-12T00:00:00Z", 
    "title": "Mindfulness para regular emociones (Programa Inteligencia Emocional Plena)", 
    "price": 0, 
    "instructors": "Natalia S. Ramos Diaz and Liliana Jazmin Salcido Cibrian", 
    "institution_name": [
        "Universidad de Malaga"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.miriadax.net/web/mindfulness-2-ed", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Miríada X"
    ], 
    "start_date": "2015-10-01T00:00:00Z"
}