{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    The deadline for an important job is getting closer, or it is a difficult duty exam in the study to master - Actually, you should already study or work, but every day you manage to deal with other \"important\" tasks, such as cleaning or Internet surfing . But time is scarce and the pressure getting bigger ...\r\nProcrastination or \"procrastination\" is an everyday phenomenon, which should be familiar to most people: Unpleasant activities are rather Once pushed, rather than be shot immediately. In eleven weeks we convey in this MOOC the scientific background and provide support to reflect on their own behavior and change!\r\nWhat will I learn in this course?\r\nThis MOOC is aimed at people who are interested in improving their self-regulation skills in order to develop a more effective approach in study and work in the future. The course aims not only to knowledge but would like to also help you to change your behavior! At the end of the course you should be able to apply those strategies in your daily life which prove especially promising for you.\r\nWhat prior knowledge do I need?\r\nNo - but you should of course already have problems with procrastination and want to change that! If you want to skydiving, visit indeed no cooking class, right? ;-) However, you should have a certain willingness to reflect on their own behavior, because only if you deal with it, you will get the procrastination in the handle!\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "MOOCen gegen chronisches Aufschieben!", 
    "price": 0, 
    "instructors": "Eliane Dominok", 
    "institution_name": [], 
    "commitment": "2 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://iversity.org/courses/moocen-gegen-chronisches-aufschieben", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2014-08-11T00:00:00Z"
}