{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso on-demand (ABIERTO, se puede cursar en cualquier momento), impartido en castellano por la Universidad Autónoma de Barcelona y el Centro de Crisis de Barcelona, está destinado a entrenar en la aplicación de primeros auxilios psicológicos (PAP) a personas afectadas por situaciones altamente estresantes, abarcando tanto emergencias cotidianas (incidentes críticos estadísticamente frecuentes que afectan de manera muy intensa: un accidente de tráfico, una hospitalización, una agresión o la muerte traumática o repentina de una persona, etc.) como emergencias comunitarias y/o masivas (sucesos infrecuentes, que afectan a muchas personas o a una comunidad entera y que sobrepasan con mucho lo que sucede habitualmente en ella: una catástrofe natural, un accidente ferroviario o aéreo o un atentado). \n\nDESTINATARIOS: \nA). Población general, incluyendo protocolos específicos para niños, adolescentes, personas mayores y discapacitados psíquicos. \nB). Profesionales que trabajan en contextos sanitarios, educativos y sociales. \nC). Responsables de programas de ayuda a niños, personas mayores, colectivos multi-problemáticos y discapacitados. Gobiernos locales, líderes religiosos, fuerzas de seguridad estudiantes que se están preparando para ejercer todas estas profesiones. \nD). Recomendado para voluntarios que colaboran en la ayuda a colectivos que han sufrido situaciones de estrés emocional agudo y traumático, como asociaciones de pacientes, grupos de auto-ayuda, ONGs, etc. \n\nOBJETIVOS DEL CURSO: \n1). Adquirir las competencias para aplicar los primeros auxilios psicológicos a personas, a familias y a comunidades tras un evento estresante cotidiano o comunitario. \n2). Ser capaz de preparar diferentes escenarios para ser utilizados como lugar de recepción de afectados y familiares y para la aplicación de los primeros auxilios psicológicos. \n3). Entrenarse en la aplicación de los protocolos de desactivación y recuperación de los intervinientes que han estado participando en la gestión de una emergencia.\n\nINICIO: 7 de Octubre de 2015\nESTADO DEL CURSO: ABIERTO\n\nNOTA SOBRE LOS SUBTÍTULOS: se ofrecen subtítulos en inglés solo para algunos vídeos del curso, cuyo idioma de grabación es el inglés. Para estos también se ofrecen en español. Para el resto de vídeos, los subtítulos se ofrecen en español.\n\n                                            Syllabus\n                        Bienvenida e información sobre el cursoBienvenidos al curso MOOC on-demand sobre Primeros Auxilios Psicológicos (PAP) que la Universidad Autónoma de Barcelona y el Centro de Crisis de Barcelona imparten en la plataforma Coursera. TIPOS DE MATERIALES DEL CURSO: en este curso encontrará cuatro tipos de materiales distintos: 1). Cada módulo empezará con un vídeo presentación y una guía de trabajo que le sugerirá un itinerario determinado a través de los contenidos. 2). Vídeos formativos donde, docentes y expertos invitados, le explicaremos los diferentes temas y contenidos de este curso sobre PAP. En dichos vídeos encontrará también ejercicios prácticos en forma de role playings que le mostrarán como aplicar y como no aplicar las diferentes técnicas que irá aprendiendo. 3). PDFs descargables que resumen, sintetizan e ilustran el contenido de los vídeos. 4). Tests (Quizz en inglés) al final de cada módulo, con una serie de preguntas tipo test. Si desea Ud. recibir el certificado del curso (ya sea en modalidad gratuita o de pago) le sugerimos que los realice. ¡Bienvenidos/as a todos/as!Módulo 1 - Definición y condiciones de aplicaciónEn este primer módulo veremos qué son los primeros auxilios psicológicos y para qué sirve esta técnica de intervención: qué es lo que hay que hacer para aplicar los primeros auxilios psicológicos, qué fases tiene esta técnica, dónde y cómo debe aplicarse. Al final del este módulo verá, de forma práctica, las formas correctas e incorrectas de aplicar los primeros auxilios psicológicos. CONTENIDOS DEL MÓDULO: una guía de trabajo (léala detenidamente), 7 vídeos de aprendizaje, documentos PDF de apoyo (en “Materiales adicionales y evaluación”), material complementario de lectura como enlaces u otros documentos si los hubiera y, por último, el test o Quizz del módulo (en “Test módulo 1”) que deberá realizar si desea obtener el certificado de este curso on-demand.Módulo 2 - PAP en niños hasta 12 añosEl Módulo 2 está dedicado a cómo se aplican los primeros auxilios psicológicos en franjas de edad concretas y determinadas. Al final del módulo encontrará unos vídeos roleplaying para que pueda ver cuál es la aplicación correcta y la aplicación incorrecta de los PAP  en estas franjas de edad. \n\nCONTENIDOS DEL MÓDULO: una guía de trabajo (léala detenidamente), 8 vídeos de aprendizaje, documentos PDF de apoyo (en “Materiales adicionales y evaluación”), material complementario de lectura como enlaces u otros documentos si los hubiera y, por último, el test o Quizz del módulo (en “Test módulo 2”) que deberá realizar si desea obtener el certificado de este curso on-demand.Módulo 3 - PAP en adolescentes y adultosEl tercer módulo se centra en las particularidades de la aplicación de los PAP en adolescentes (en la primera parte del módulo) y adultos (en la segunda parte). \n\nCONTENIDOS DEL MÓDULO: guía de trabajo (léala detenidamente), 9 vídeos de aprendizaje, documentos PDF de apoyo (en \n\n“Materiales adicionales y evaluación”), material complementario de lectura como enlaces u otros documentos si los hubiera \n\ny, por último, el test o Quizz del módulo (en “Test módulo 3”) que deberá realizar si desea obtener el certificadode este \n\ncurso on-demand.Módulo 4 - PAP en colectivos especialmente vulnerablesEn este módulo veremos cómo adaptar lo aprendido hasta ahora, a grupos de usuarios con necesidades especiales. Veremos por ejemplo, cómo hay que variar la aplicación de los PAP cuando los destinatarios son personas con discapacidad auditiva que sólo utilizan el lenguaje de los signos, o bien personas que padecen una enfermedad mental. También veremos cómo deben modularse los PAP en función de lo que haya ocurrido. Este módulo cuenta con profesionales expertos en situaciones especiales, que exponen su experiencia profesional en vídeos en inglés con subtítulos en español. \n\nCONTENIDOS DEL MÓDULO: guía de trabajo (léala detenidamente), 8 vídeos de aprendizaje, documentos PDF de apoyo (en “Materiales adicionales y evaluación”), material complementario de lectura como enlaces u otros documentos si los hubiera y, por último, el test o Quizz del módulo (en “Test módulo 4”) que deberá realizar si desea obtener el certificado de este curso on-demand.Módulo 5 - Autocuidado del intervinienteEn este quinto y último módulo Ud. aprenderá a cómo cuidarse usted mismo, el proveedor de los primeros auxilios psicológicos. Qué es la resiliencia y sobre todo qué son las pautas de auto cuidado para los intervinientes y cómo es la mejor manera, la forma más eficaz de aplicar estas pautas de auto cuidado. Aprenderá también a cuidar a otros intervinientes, a otras personas que hayan participado de la gestión de un suceso  crítico, ya sean profesionales o voluntarios. También en este módulo practicará y verá en un role playing cómo ayudar a personas que han sido gestores de un incidente crítico. \n\nCONTENIDOS DEL MÓDULO: una guía de trabajo (léala detenidamente), 8 vídeos de aprendizaje, documentos PDF de apoyo (en “Materiales adicionales y evaluación”), material complementario de lectura como enlaces u otros documentos si los hubiera y, por último, el test o Quizz del módulo (en “Test módulo 5”) que deberá realizar si desea obtener el certificado de este curso on-demand.\n\nTRABAJO FINAL: \nEn este último módulo también encontrará el trabajo final.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Primeros Auxilios Psicológicos (PAP)", 
    "price": 0, 
    "instructors": "Alicia Álvarez, Emilia Cruz, Ingeborg Porcar and Jordi Framis", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/pap", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}