{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    Are you a teacher, a course designer or a manager in education? Are you fed up with big lecture halls and passive students? Do you think students should be challenged instead of bored? Immerse yourself in Problem-Based Learning (PBL) and learn how to put your students at the centre of learning!In this course you will learn about PBL by doing PBL. After studying the basics, you can choose one of three tracks based on your interests:\r\n\r\nThe role of the tutor in PBL\r\nDesigning PBL problems and courses\r\nAssessment and organizational aspects of PBL\r\n\r\nAt Maastricht University we have used PBL for more than forty years, in domains ranging from Medicine to Economics and Sciences. We are continuously innovating PBL and applying it in new ways. You will have the opportunity to meet and engage with our experienced professors, teachers and PBL researchers!In eight weeks you will study four relevant problems with examples from different domains. In small online teams you will discuss -synchronously or asynchronously- what you have learned and how you could apply it in your own setting. Participating will take 4-8 hours a week, and those who complete the course will receive a Certificate of Participation.\n\n                                    ", 
    "end_date": "2015-11-30T00:00:00Z", 
    "title": "Problem-Based Learning: Principles and Design", 
    "price": 0, 
    "instructors": "Geraldine Clarebout, Daniëlle Verstegen and Herco Fonteijn", 
    "institution_name": [
        "Maastricht University"
    ], 
    "commitment": "4-8 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://novoed.com/problem-based-learning", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2015-10-05T00:00:00Z"
}