{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/socialpsychology\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/socialpsychology-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    socialpsychology-001\n                                                                    socialpsychology-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Coursera's largest class is back by popular demand!Beginning July 14, 2014, Social Psychology will feature a fresh line-up of special events, guest experts, and material intended to delight psychology lovers around the world. \n\nCourse Description from\nProfessor Plous:\n\nEach of us is dealt a different hand in life, but we all face similar\nquestions when it comes to human behavior: What leads us to like one\nperson and dislike another? How do conflicts and prejudices develop, and\nhow can they be reduced? Can psychological research help protect the environment,\nand if so, how? This course offers an introduction to classic and contemporary\nsocial psychology, covering topics such as decision making, persuasion,\ngroup behavior, personal attraction, and factors that promote health and\nwell-being.Our focus will be on surprising, entertaining, and intriguing research\nfindings that are easy to apply in daily life. As part of this focus, several\nhomework assignments will encourage you to experiment with your life, observe\nthe results, and analyze what took place. The course will also draw from\nthe web sites of Social Psychology Network, the world's largest online community devoted to social psychology. I hope\nyou'll join me for this course, have fun, and learn some useful information\nthat enriches your life!    \n\n                                    ", 
    "end_date": "2014-09-01T00:00:00Z", 
    "title": "Social Psychology", 
    "price": 0, 
    "instructors": "Scott Plous", 
    "institution_name": [
        "Wesleyan University"
    ], 
    "commitment": "4-8 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/course/socialpsychology", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-07-14T00:00:00Z"
}