{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    What are the forces shaping human behaviour? How do we think and decide? This course, from Professor Nick Chater and Warwick Business School, explores the origins of human rationality and irrationality.\n\nExplore our illusion of mental depth\n\nOur everyday conception of how our minds work is profoundly misleading. We are victims of an ‘illusion of mental depth’ - we imagine that our thoughts and behaviours arise from hidden motives and beliefs, and that we can understand ourselves by somehow uncovering these hidden forces, whether through therapy, lab experiments or brain scanning.\n\nThis course will suggest that this conception is not entirely correct, that we’re inventing these motives and beliefs at the very moment of decision. Professor Chater’s central proposition will be  that there is no mental depth, that mental depth is an illusion.\n\nUnderstand mystifying aspects of human behaviour\n\nThis course consists of six weeks of material. Each week we’ll start with a paradox, some mystifying aspect of human behaviour, before looking at insights into it, gained over decades of psychological and behavioural research. You’ll have a chance to try out a classic psychological experiment online.\n\nSome of the really exciting things we’ll be looking at are:\n\n\n  why we take risks and why we fear them;\n  how people succeed or fail to work with other people successfully;\n  how our behaviour, governed by a plethora of complicated psychological forces, makes sense at all;\n  the theory that we are creating an improvised character and trying to stay in our role;\n  and finally, how we can make society more coherent and create a better world.\n\n\nMeet behavioural science experts from academia, government and industry\n\nYou’ll learn from Warwick Business School’s leading behavioural science group, as well as a diverse range of people who have thought very deeply in a practical context about the nature of human behaviour.\n\nWe’ll be talking to Rory Sutherland, ad man and behavioural economics impresario; Tim Harford, the Financial Times undercover columnist; Gus O’Donnell, former head of the Civil Service; and many other senior representatives in high-profile organisations.\n\nWhat previous learners say\n\nOver 72,000 learners from across the world have joined previous runs of this course, and below are a few examples of the impact it had on them:\n\n\n  “Absolutely enjoyed every single minute of the course. It was interactive, provoking, educational, illustrative, and persuasive, and would definitely recommend to friends of mine. Thank you [Warwick] and fellow colleagues from this course.” Dilyana Gramadarova\n\n\n\n  “Just wanted to say how much I enjoyed the course. It has been very interesting both for the content and the realisation of how much psychology has moved into the mainstream. I was really interested to hear from “behaviourists” in finance, ecology, marketing, the government and the civil service. Thank you.” Christine Chapell\n\n\n\n  “We are responsible for our own happiness even though it can be dictated by everyday experiences &amp; our own actions. Governments are required to help us make better choices and therefore live happier lives. Thank you so much for the ‘Mind is Flat’ course, I have enjoyed it immensely. It has been such an eye opener how our everyday lives are influenced by clever marketing, advertising &amp; each other’s personalities.” Catharine McEuan\n\n\n\n                                    ", 
    "end_date": "2016-06-06T00:00:00Z", 
    "title": "The Mind is Flat: the Shocking Shallowness of Human Psychology", 
    "price": 0, 
    "instructors": "Nick Chater", 
    "institution_name": [
        "The University of Warwick"
    ], 
    "commitment": "5 hours", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "http://www.futurelearn.com/courses/the-mind-is-flat?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-04-25T00:00:00Z"
}