{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    【课程介绍】\n\n《当代应用心理学》是由云林科技大学 刘威德教授主讲的一门应用心理学课程\n                               并由云林科技大学 惠龙博士担任总顾问\n\n课程将精选八项心理学与日常生活息息相关的应用议题，藉由生活对象设计(人因心理学)、消费行为、领导管理、性格分析、犯罪行为、心理保健与心理测验、人际关系等方面运用生活知能、个体行为与态度、测验诊断加以说明诠释应用心理学之奥妙。例如:自行车设计动向、民众购车消费行为、便利商店兑币代换机制、组织领导策略、关注情绪管理、人格特质透析、以及如何经营成功良好的职场与人际关系等事例，深入浅出探讨来应用心理学的理论与实际生活经验分析概念。\n\n【课程大纲】\n探讨从众/群众心理、消费行为模式、成功营销的法则、消费者的觉察-广告营销的心理法则、广告营销心理实例探讨、探讨领导管理的现象、管理组织的策略、成功领导者的特质、组织人事的经营管理、探讨人格特质分析、人格的形成和发展、性格的影响因素、性格的常态与偏态、探讨犯罪心理、偏差行为发展脉络分析、法律与生活的关系、犯罪与偏差行为的预防-罢凌行为的心理探讨、探讨心理保健层面、情绪管理、快乐心理、落实小区心理保健、个别心理特质的差异、心理测验的原理、探讨如何藉由心理测验及诊断工具了解个别特质的差异、心理测验的迷思概念、探讨人际关系互动网络、人际关系的影响因素、成功职场心理的经营、职场的求职陷阱以及以上各内容之实例。\n\n第1周：心理学原理概述Introduction\n第2周：人因心理学原理简介及实例探讨Human Factors and Ergonomics\n第3周：消费者心理学原理简介及实例探讨Consumer Psychology\n第4周：组织及领导心理学原理简介及实例探讨Leadership Psychology\n第5周：性格心理学原理简介及实例探讨Personality Psychology\n第6周：法律与犯罪心理学原理简介及实例探讨 Law and Criminal Psychology\n第7周：身心健康与适应心理原理简介及实例探讨Mental Health Psychology\n第8周：心理测验与个别特质差异的原理简介及实例探讨Psychological Testing\n第9周：人际与职场心理的原理简介及实例探讨Human Relationship and Career Psychology\n\n【学习目标】\n心理学是一门探讨人性的科学，剖析个体的内隐心理历程和外显行为反应。涉及范围广泛，涵括有认知、情绪、人格、人际、和领导等多方领域，同时也和日常生活息息相关如婚姻、消费、家庭、对象设计等密不可分，心理学的影响层面扩及到教育、社会、科学、医学、生物等层面。因此，探讨分析心理学所产生的生理行为间接亦或直接影响到个人心智，运用大脑运作模式来解释个人行为，应用层面在日常生活中比比皆是。本课程之目标在于探讨心理学的科学理论基础原理、以心理学的观点检视剖析周遭生活中的个人与社会行为现象，并进而能够觉察与改变个人的心理历程与行为模式，终而能够经营圆满合谐而健康的人生。\n\n【学习要求】\n本课程的在线教材将以较短的课程长度实施9周，每周2小时，共18小时，每周规划一主题(topic)，每一个主题分为若干节(section)或讲次(lecture)，以及符合学习专注力时间长度的上课内容（15分钟小单元），透过在线学习平台，由教师制作提供主题明确且长度适中的单元教学影片，辅以测验及作业，让学生依自己学习步调在线自我学习，并藉由教师设计安排的学习互动，与老师及同侪于虚拟平台或实体空间进行探索讨论。教学互动及评量回馈，提升在线学习的质量及效能，期能建立华文课程品牌。\n\n【教材教参】\nSternberg, Robert J. (2004). Psychology 4th.C.A. Thomson Wadsworth.\nBekerian, D. A. &amp;Levey, A. B. (2005). Applied Psychology. Oxford.\nCascio, W. F. &amp;Aguinis, H. (2005). Applied Psychology in Human Resource Management. Pearson Prentice Hall.\n美国心理学会(American Psychology Association, APA)资源\n张春兴(1991).现代心理学。台北：东华书局。\n张春兴(2003).心理学原理。台北：东华书局。\n张春兴主编.世纪心理学丛书。东华书局(繁体字版)。浙江教育出版社(简体字版)。\n\n                                            Syllabus\n                        第一章 心理学原理概述现代心理学是一门研究人性的科学。人性的内在本质始乎人类的繁衍，其外显表现又与社会文化息息相关。因此，现代心理学可以比喻为是\"新瓶装旧酒\"的学科。瓶是新的，代表方法与课题是新的；酒是旧的，代表人性的本质是肇伊乎始的。这也说明了，社会科学的真理具备\"循环往复\"的特质。一方面追求\"创新\"，另一方面也追寻\"复古\"。从历史里看未来，这就是心理学令人着迷的可爱之处！本课程将精选八项心理学与日常生活息息相关的应用议题，藉由生活对象设计(人因心理学)、消费行为、领导管理、性格分析、犯罪行为、心理保健与心理测验、人际关系等方面运用生活知能、个体行为与态度、测验诊断加以说明诠释应用心理学之奥妙。第二章 人因心理学原理简介及实例探讨人因工程学事实上是一个交叉的学科，人因工程学听起来感觉像是工程，但是这一课程的发展，涉及到多种的学科领域，例如生理学是有关感觉与知觉的议题；另外也会涉及到像管理学，工程学的科技技术；此外人因工程学一定会探讨到心理学的使用者特质，总之应用领域十分广阔。本单元选择人因工程与应用心理学的关系，是希望进一步了解，原来我们生活当中许多接触到的系统和器物，事实上具有生理、心理、管理、工程乃至于是环境有关的理念。探讨这一门学问希望有三个目的，一个就是让工作更有效，第二是让工作更安全，第三让工作更舒适的积极的目的。\n\n\n東西方的科學探究有本質上的分別！西方歐美的科學家嘗試探討事件與人性的本質，經常是純粹為了發現真理與求知。當然其後也會轉為獲取利潤，而提出專利(patent)的法律保障，去專利標準局公開註冊，然後保有這些智慧財產。中國人的科學研究則常常是想找到有沒有可以參考的模板樣式，然後加以修改應用。使之合乎時宜。獲取權力或利益，因此都不重視自己的專利，只有不外傳的祕方。最後失傳。本單元的人因心理學與知識的發現和產品製造專利有密切關聯。若華人能藉由人因心理學探討而發現更多利人利己的知識原理，進而可以發明製造更安全舒適友善的工商產品，則華人世界將能更盛興文明，改善華人的生活品質水準。 第三章 消费者心理学原理简介及实例探讨在经济快速发展的社会里，包含你我每一个人每一天在购买消费的这些事情，绝对是生活的一部分，所以能够审慎面对自己或身边的人的消费者的行为，我们可能更可以有意义的觉察们的消费行为，做出比较好的消费决策模式。在消费者心理学的探讨基本观念这里，我们首先要知道消费者心理学的意涵以及各个有关名词的定义，进一步的来说明再消费者心理学的这些发现是用什么样子的适切的方法来加以探究的。所以这时不论是对于消费者这端或提供者那一端的商人都可以产生一个比较好的因应策略。第四章 组织及领导心理学原理简介及实例探讨本周的课程要谈论的主题是有关于组织与领导的心理学这个主题。在心理学的应用里是必谈的重点之一。因为他跟我们的生活和人与人之间的合作关系太密切了。俗话说一个和尚挑水喝，两个和尚抬水喝，三个和尚有时会没水喝。但是有时候我们又会说三个臭皮匠胜过一个诸葛亮。这表示人在独处自为的时候可以发挥的效能和人与人相处的时候可以产生的合作效益是有差异的。好的组织领导者可以妥善运用一些心理学原理，提升组织的效能；组织内的成员也可以透过心理学的原理，与组织内的成员和组织的领导有合宜的互动，以达成组织的发展目标。第五章 性格心理学原理简介及实例探讨本周这个课程的主题将探讨分析，有关于我们到底如何来形容一些人以及怎么样将一些人加以叙述它的特质。这是在心理学的一个重要课题，在心理学里，对于人格的发展，以及人格的探究着力甚深。在APA里面就把人格跟健康这个题目单独设为一个分支来加以讨论，很显然的，人格的议题在心理学上面是不可或缺的一环。在心理学的范畴里，是将人格视为是一个科学的议题，研究人格并不是要褒贬人事物的高尚与否，而是希望描述人格的各种样态，例如积极性，情绪稳定性等。此外，科学家也希望了解当前的性格是如何发展的。心理学家也已经发现性格表现与身心健康的关系。这些都是本周探讨的重点。第六章 法律与犯罪心理学原理简介及实例探讨犯罪的议题与现代人的生活其实是息息相关的，我们都希望成为良民，不要成为犯罪者，但事实上却是总会有那么或多或少的机会，就会无意中碰触到了一些犯罪的事情，轻者可能会有一些财务上的损伤，严重者恐怕就带来了生命的损害，所以我们对于这样的一个主题，安排在当代应用心理学之中，是希望藉由了解犯罪的本质，对于犯罪行为人的心理状态，是什么样子的因素发展成为犯罪的行为，成为了犯罪人；就良民的观点来说，我们又该要怎样在犯罪行为发生之前可以趋吉避凶，不要让自己涉入到有犯罪者接触的机会。哪怕是真的很不巧碰到了犯罪事件，在那个置身于犯罪的现场的时空之中，也希望能藉由了解犯罪的心理与犯罪的一些本质能够让伤害减到最低。 第七章 身心健康与适应心理原理简介及实例探讨健康心理学是将各种心理学的一些原理、知识跟技巧用来增进个人身心健康的学问。所以在这个部分在经过APA(美国的心理学会)健康心理学会的分支，在1980年的这个年会，就订定了有关于健康心理学所讲的包含这些内含。此外本周也会讲到有关于一些心理疾病的预防和治疗，进一步探讨有关个人功能的一些身心健康失调的原因和诊断。最后希望能够扩大建立健康管理的体系，甚至能够由政府或者一些NGO(非营利组织)来拟定一些方案跟政策，将健康心理学赋予科学化的管理发展。一方面是在维护个人的健康；另一方面希望能研拟公共的心理卫生的政策，透过这些新兴的心理科学的研究领域，增进人群更大的幸福。第八章 心理测验与个别特质差异的原理简介及实例探讨过去的人习惯采用像是算命或者是卜卦，或者是求神，这样子的方法来了解自己以及预测未来的事情，但是自从心理学走向科学心理学这样子的趋势以后，心理学家希望采取一种科学化的测量途径，来了解人性，毕竟人性是内隐而不容易被直接观察到的，可是心理学家必须要采取一些像是科学物理测量的这个方法来测量心理的各个层面。我们或许曾经或多或少的接触过各式各样的心理测验，例如你想要知道适合你的职业性向；你也许曾经进一步想要了解自己的人格特性，是倾向于内向的、是倾向于外向的、诸如此类的有关于像是性格的、人格这样的心理测验。此外，你曾不曾经想过一件事，这些测验准吗？第九章 人际与职场心理的原理简介及实例探讨职场心理学这一个主题，将探讨好多有关于职业、职场和生涯里面的观念。从事一个职业不只是一个找工作这么简单的想法，一开始必须先找到了工作，可是接下来是具有一个发展性的工作大未来，所以本周探讨职场心理的主题，要先从职业生涯发展(career development)这个观念来切入。进而说明认识自我知识的相关测验之运用与解释；其次，产业发展的趋势也必须了解；藉由求职面试的准备与历程心理；成功职场的人们，经常是自我认识了解，然后才会去选择进入到了某一些职场去发挥。接着必谈的主题就是管理时间的方法，以及职场人际关系的经营。本周也将探讨转换职场的注意事项，有助于职业的永续发展。\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "当代应用心理学", 
    "price": 0, 
    "instructors": "刘威德", 
    "institution_name": [
        "Shanghai Jiao Tong University", 
        "云林科技大学 (Yunlin University of Science and Technology)"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/dangdai-yingyong-xinli-xue", 
    "duration": "9 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}