{
    "selfpaced": false, 
    "topic_name": [
        "Psychology"
    ], 
    "description": "\n\n                    \n                    \n                    心理学很神秘？你会发现，只要有人的地方，就有心理学！\n心理学很深奥？你会发现，似乎每个人都是大众心理学家，谁都可以说点“心理学”。\n的确，我们生活中处处都是心理学！但这门课程却要告诉你，我们常常挂在嘴边的“心理学”绝大部分是错的，剩下的一小部分也是不全面的。\n在本课程中，我们会一起把看似复杂的心理学理论运用到简单的生活现象中，在理解和掌握心理规律和原理后，用独具的慧眼看到一个与原先完全不同的生活世界。\n\n                                            Syllabus\n                        欢迎学习《心理学与生活》欢迎你学习《心理学与生活》！你是否发现，有人的地方，就有心理学！你是否发现，似乎每个人都是大众心理学家，谁都可以说点“心理学”！但是，你知道吗？我们天天挂在嘴边的“心理学”绝大部分是错的，剩下的一小部分也是不全面的。你知道吗？简单的生活现象实际富含复杂的心理学。本课程将带领你用独具的慧眼看到一个与原先完全不同的生活世界。感知与记忆你看世界仅仅通过你的眼睛吗？其实你感知到的世界不仅仅是眼睛看到，还包含着你各种各样的经验，以及你自己主观的加工，即使是你引以为傲的记忆也常常会欺骗和戏弄你哦！“耳听为虚，眼见也未必实”，掌握这些感知与记忆的知识，将会帮助你了解你自己究竟是如何“看”这个世界的。这其中也包括那个在你熟睡之后，绮丽奇幻的梦中世界！发展与教育你会不会常常觉得自己的自制力不够？或许这恰恰是因为你的延迟满足能力不强。无论是延迟满足，还是性别意识，许多能力和特质都是你从小慢慢培训起来的。因此，你将会看到婴儿的依恋与成人的恋爱、儿童的游戏与成人的道德之间的联系，也将会了解人类最基本的三种学习模式，并借此学会有效地塑造良好的行为。因为，这个部分就是希望让你更多了解你的过去，或者说更多懂得你未来的孩子。情绪与情感为什么你会有那么多爱恨情愁？看似绝对主观的情绪与情感，却可能往往只是由环境中的一杯水、一朵花这样很细小的事物激发的。这个部分将探索情绪与情感，人类最为复杂的内心世界，让你看看它们神经生物的本质特性，让你了解如何与他人发生情感的联接，也让你知道怎样变得更有魅力。当然，还要让你了解更多关于压力和应激的知识，让你可以更好地应对人生的危机与挑战。\n动机与人格你可能莫名其妙地喜欢上一个人，也可能无缘无故地冲某个人发脾气，这些似乎都不受你自己意识的控制。这就是潜意识，一种蕴藏在你内心深处的神秘力量，它在真正激活你的动机、左右你的行为。而潜意识又是精神分析的核心概念之一。除此之外，行为主义、人本主义和特质理论也都是重要的人格理论流派，你将从不同的角度学习这些理论，让你更加明确心理正常与否的标准，同时也能更好地解释人类的行为。 文化与社会在一个特定情境中，你的行为可能变得“不由自主”，而从众和服从可能夺走你思考与辨别的能力。认识它们，或许可以给你自己多争得一点理智。人具有归因的本性，但在寻找原因的过程中却又很容易犯各种错误。身处不同的文化与社会环境中，你的行为也会有错综复杂的变化。这个部分将会让你看到，人类的行为绝不仅仅受到其自身人格的制约，还受到社会情境的影响，甚至因此出现巨大的变化和偏差。\n\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "心理学与生活", 
    "price": 0, 
    "instructors": "陈 昌凯", 
    "institution_name": [
        "Nanjing University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Social Sciences"
    ], 
    "course_url": "https://www.coursera.org/learn/xin-li-xue-sheng-huo", 
    "duration": "5 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}