{"selfpaced": false, "topic_name": ["Electrical Engineering"], "description": "\n\n                    \n                    \n                    Have you wondered about the design strategies behind temperature controllers, quad-copters, or self-balancing scooters? Are you interested in robotics, and have heard of, or tried, “line-following\" or “PID control” and want to understand more?\n\nFeedback control is a remarkably pervasive engineering principle. Feedback control uses sensor data (e.g. brightness, temperature, or velocity) to adjust or correct actuation (e.g. steering angle, motor acceleration, or heater output), and you use it all the time, like when you steer a bicycle, catch a ball, or stand upright.  But even though applications of feedback are very common, the subject is an uncommonly compelling example of mathematical theory guiding practical design.  In this engineering course we will introduce you to the theory and practice of feedback control and provide a glimpse into this rich and beautiful subject.\n\nEach week we will begin with a mathematical description of a fundamental feedback concept, combined with on-line exercises to test your understanding, and will finish with you designing, implementing, measuring, and exchanging video of your own propellor-levitated arm feedback system.  You will not need a background in calculus or software engineering to succeed in this class but you should be comfortable with algebra, mechanical forces, and modifying mathematical formulas in short computer programs.\n\nIMPORTANT:\nAs this is a lab course, in order to participate, learners will need to collect a set of items to build the propeller arm. Learners will be responsible for purchasing items themselves and should have the items prior to the start of the course. We have created shopping lists via Amazon and Digikey listing all necessary items for simple purchase, but many of these items should be available through other vendors, or found locally.\n\nYou will need ALL the parts on the following two lists (cost approximately $100 USD), and you should have the parts in hand BEFORE the first day of class!\nhttp://www.digikey.com/short/t2nb5t\nhttp://amzn.com/sl/1E146QPX99G3X\nPlease wait a few minutes for the lists to populate. They are sometimes slow to update.\n\nPlease note that this is a “Beta” class, you’ll be part of an experiment on incorporating physical labs in an on-line class.  Your experiences and contributions will shape the class, and impact a worldwide community.  \n\n                                    ", "end_date": "2016-01-25T00:00:00Z", "title": "6.302.0x: Introduction to Feedback Control Theory", "price": 0, "instructors": "Jacob White and Joe Steinmeyer", "institution_name": ["Massachusetts Institute of Technology"], "commitment": "5-6 hours", "subject_name": ["Engineering"], "course_url": "https://www.edx.org/course/introduction-feedback-control-theory-mitx-6-302-0x", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-01-04T00:00:00Z"}