{"selfpaced": false, "topic_name": ["Calculus & Mathematical Analysis"], "description": "\n\n                    \n                    \n                     The theory developed here (that you will not find in any other course :) has much in common with (and complements) \nstatistical mechanics and field theory courses; partition functions and \ntransfer operators are applied to computation of observables and \nspectra of chaotic systems.\n\nNonlinear dynamics I: Geometry of chaos (this course)\n\nTopology of flows - how to enumerate orbits, Smale horseshoes\n\nDynamics, quantitative - periodic orbits, local stability\n\nRole of symmetries in dynamics\n\n\nNonlinear dynamics II: Chaos rules (second course)\n\nTransfer operators - statistical distributions in dynamics\n\nSpectroscopy of chaotic systems\n\ndynamical zeta functions\n\nDynamical theory of turbulence\n\nThe course is in part an advanced seminar in nonlinear dynamics, aimed at\n PhD students, postdoctoral fellows and advanced undergraduates in \nphysics, mathematics, chemistry and engineering.\n\n                                            Syllabus\n                        \n\n Trajectories\n      \nRead quickly all of Chapter 1 - do not worry if there are stretches\nthat you do not understand yet.\n      \n\n\nFlow visualized as an iterated mapping\n      \nDiscrete time dynamical systems arise naturally by\nrecording the coordinates of the flow when a special event happens:\nthe Poincare section method, key insight for much that is to\nfollow.\n      \n\n\nThere goes the neighborhood\n      \nSo far\nwe have concentrated on description of the trajectory\nof a single initial point.\nOur next task is to define and determine the size of a\nneighborhood, and describe the local geometry of\nthe neighborhood by studying the linearized flow.\nWhat matters are the expanding directions.\n      \n\n\nCycle stability\n      \nIf a flow is\nsmooth, in a sufficiently small neighborhood it is essentially\nlinear. Hence in this lecture, which might seem an embarrassment\n(what is a lecture on linear flows doing in a book on \nnonlinear dynamics?), offers a firm stepping stone on the way to\nunderstanding nonlinear flows. Linear charts are the key tool of\ndifferential geometry, general relativity, etc, so we are in good\ncompany.\n      \n\n\n\nStability exponents are invariants of dynamics\t\n      \nWe prove that (1) Floquet multipliers are  the same everywhere\nalong a cycle, and (b) that they are invariant under any smooth\ncoordinate transformation.\n      \n\n\nPinball wizzard\n      \nThe dynamics\nthat we have the best intuitive grasp on\nis the dynamics of billiards.\nFor billiards, discrete time is altogether natural;\na particle moving through a  billiard\nsuffers a sequence of instantaneous kicks,\nand executes simple motion in between.\n      \n\n\nDiscrete symmetries of dynamics\n      \nWhat is a symmetry of laws of motion?\nThe families of symmetry-related full state space cycles\nare replaced by fewer and often much shorter\n\"relative\" cycles, and\nthe notion of a prime periodic orbit\nis replaced by the notion of\na \"relative\" periodic orbit, the shortest segment\nthat tiles the cycle under the action of the group.\n\nDiscrete symmetries: a review of the theory of finite groups\n      \n\n\n\nDiscrete symmetry reduction of dynamics to a fundamental domain\n      \nWhile everyone can visualize the fundamental domain for a 3-disk\nbilliard, the simpler problem - symmetry reduction of 1d dynamics\nthat is equivariant under a reflection, the most common symmetry in\napplications - seems to baffle everyone. So here is a step-by-step\nwalk through to this simplest of all symmetry reductions.\n      \n\n\nContinuous symmetries of dynamics\n      \nSymmetry reduction:\nIf the symmetry is continuous, the interesting dynamics unfolds on a\nlower-dimensional \"quotiented\" system, with\n\"ignorable\" coordinates eliminated (but not forgotten).\n\n Hilbert's invariant polynomials. Cartan's moving frames.\n      \n\n\nGot a continuous symmetry? Freedom and its challenges\n      \nWhenever you have a continuous symmetry, you need to cut the orbit\nto pick out one representative for the whole family. For continuous\nspatial symmetries, this is achieved by slicing. And then there is\ndicing.\n      \n\n\nSlice and dice\n      \nSymmetry reduction is the identification of a unique point on a\ngroup orbit as the representative of this equivalence class. Thus,\nif the symmetry is continuous, the interesting dynamics unfolds on\na lower-dimensional `quotiented', or `reduced' state space M/G. In\nthe method of slices the symmetry reduction is achieved by cutting\nthe group orbits with a set of hyperplanes, one for each continuous\ngroup paramete\n\nMoving frames give us a great deal of\nfreedom - we discuss how to choose a frame The most natural of all\nmoving frames: the comoving frame, the frame for space cowboys.\n      \n\n\nQualitative dynamics, for pedestrians\n      \nQualitative properties of\na flow partition the state space in a topologically invariant way.\n      \n\n\nThe spatial ordering of trajectories from the time ordered itineraries\t\n      \nQualitative dynamics: (1) temporal ordering, or itinerary with\nwhich a trajectory visits state space regions and (2) the spatial ordering\nbetween trajectory points, the key to determining the admissibility\nof an orbit with a prescribed itinerary. Kneading theory.\n      \n\n\nQualitative dynamics, for cyclists\n      \nDynamical partitioning of a plane.\nStable/unstable invariant manifolds, and how they partition the\nstate space in intrinsic, topologically invariant manner. Henon map\nis the simplest example.\n      \n\n\nFinding cycles\n      \nWhy nobody understands anybody? The bane of night fishing - plus\nhow to find all possible orbits by (gasp!) thinking.\n      \n\n\nFinding cycles; long cycles, continuous time cycles\n      \nMulti-shotting; d-dimensional flows; continuous-time flows.\n      \n\n                                    ", "end_date": "2015-03-03T00:00:00Z", "title": "Nonlinear Dynamics 1: Geometry of Chaos", "price": 0, "instructors": "Predrag Cvitanović", "institution_name": ["Georgia Institute of Technology"], "commitment": "5-7 hours", "subject_name": ["Mathematics"], "course_url": "https://www.coursera.org/course/chaosbook", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-01-06T00:00:00Z"}