{"selfpaced": false, "topic_name": ["Calculus & Mathematical Analysis"], "description": "\n\n                    \n                    \n                    Mathematics is at the heart of many aspects of modern life. Whether playing a game on your mobile phone, watching a Grand Prix or waking up to sunlight in the morning, maths (and more precisely, calculus) is behind the scenes.\n\nMaths is also used in many disciplines - from economics to engineering, biology to geography. But many of us struggle with maths, and find formulae and theories difficult to grasp, meaning that we can find ourselves at a disadvantage when thinking about certain careers.\n\nThe aim of this free online course is to demonstrate the practical uses of calculus and show that maths need not be daunting. It will give a basic introduction to the subject, with links to further resources for those who want to study at a more advanced level.\n\nLearn calculus using familiar, real world applications\nWe will take familiar, real world activities, such as motor racing and mobile games like Angry Birds, and use them to uncover the basic elements of calculus.\n\nTogether, we will look at the key ideas of calculus and how they are applied in real life situations:\n\n\n  differentiation: how things change\n  integration: how we put these changes together to decide what will happen in the future\n  and the fundamental theorem of calculus: how differentiation and integration are related.\n\n\nGet tips from people who use calculus everyday\n\nWe will meet experts from economics, physics and engineering, who will describe how they use maths in their own work. In this way, you’ll be learning about some powerful uses of mathematics through some very familiar, real world applications.\n\nJoin us on a journey from the race track to the solar system, and gain valuable insights as you travel.\n\n\n                                    ", "end_date": "2015-11-30T00:00:00Z", "title": "Real World Calculus: How Maths Drives Formula One and Launches Angry Birds", "price": 0, "instructors": "Jeremy Levesley", "institution_name": ["University of Leicester"], "commitment": "2 hours", "subject_name": ["Mathematics"], "course_url": "http://www.futurelearn.com/courses/real-world-calculus?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2015-11-09T00:00:00Z"}