{"selfpaced": true, "topic_name": ["Calculus & Mathematical Analysis"], "description": "\n\n                    \n                    \n                    “微积分二：数列与级数”将介绍数列、无穷级数、收敛判别法和泰勒级数。本课程不仅仅满足于得到答案，而且要做到知其然，并知其所以然。\n\n                                            Syllabus\n                        数列欢迎参加本课程！我是 Jim Fowler，非常高兴大家来参加我的课程。在这第一个模块中，我们将介绍第一个学习课题：数列。简单来说，数列是一串无穷尽的数字；由于数列是“永无止尽”的，因此仅列出几个项是远远不够的，我们通常给出一个规则或一个递归公式。关于数列，有许多有趣的问题。一个问题是我们的数列是否会特别接近某个数；这是数列极限背后的概念。级数在这第二个模块中，我们将介绍第二个主要学习课题：级数。直观地说，将数列的项按照它们的顺序依次加起来就会得到“级数”。一个主要示例是“几何级数”，如二分之一、四分之一、八分之一、十六分之一，以此类推的和。在本课程的剩余部分我们将重点学习级数，因此如果你在有些地方感到疑惑，将会有大量时间来弄清楚。另外我还要提醒你，这个课题可能会令人感到相当抽象。如果你曾经为此困惑，我保证下一个模块提供的实例会让你感到豁然开朗。审敛法在第三个模块中，我们学习用于确定级数是否收敛的各种审敛法：特别地，我们将说明比值审敛法、根值审敛法和积分审敛法。交错级数在第四个模块中，我们讲解绝对和条件收敛、交错级数和交错级数审敛法，以及极限比较审敛法。简而言之，此模块分析含有一些负项和一些正项的级数的收敛性。截至目前为止，我们已经分析了含有非负项的级数；如果项非负，确定敛散性会更为简单，因此在本模块中，分析同时含有负项和正项的级数，肯定会带来一些新的难题。从某种意义上，此模块是“它是否收敛？”的终结。在最后两个模块中，我们将讲解幂级数和泰勒级数。这最后两个课题将让我们离开仅仅是敛散性的问题，因此如果你渴望新知识，请继续学习！幂级数在第五个模块中，我们学习幂级数。截至目前为止，我们一次讲解了一种级数；对于幂级数，我们将讲解整个系列取决于参数 x 的级数。它们类似于多项式，因此易于处理。而且，我们关注的许多函数，如 e^x，也可表示为幂级数，因此幂级数将轻松的多项式环境带入棘手的函数域，如 e^x。泰勒级数在最后一个模块中，我们介绍泰勒级数。与从幂级数开始并找到其代表的函数的更好描述不同，我们将从函数开始，并尝试为其寻找幂级数。无法保证一定会成功！但令人难以置信的是，许多我们最喜欢的函数都具有幂级数表达式。有时，梦想会成真。和许多梦想相似，多数不说为妙。我希望对泰勒级数的这一简介能激起你学习更多微积分的欲望。期末期末测试是你展示我们一起所学东西的机会。你已经快要完成本课程。我要告诉你：成为你的数学导师之一我很荣幸，也很高兴。我非常喜欢我们一起学习本课程，并希望将来有更多课程。希望我们能再次见面。\n                                    ", "end_date": "2015-10-20T00:00:00Z", "title": "微积分二: 数列与级数 (中文版)", "price": 0, "instructors": "Jim Fowler", "institution_name": ["Ohio State University"], "commitment": "", "subject_name": ["Mathematics"], "course_url": "https://www.coursera.org/learn/gaojie-wei-jifen", "duration": "7 weeks", "language_name": ["Chinese"], "provider_name": ["Coursera"], "start_date": "2015-09-01T00:00:00Z"}