{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Learn what it takes to be successful at interviewing</strong></p>\n\n<p>Interviewing is not something that we do every day and when we do, we are up against other people that have all passed the same criteria. So what is it that will make you shine above the rest?</p>\n\n\n\n<p>As a communication skills expert I am often invited to sit on interview panels and it has been from this experience and through my research and training on how humans connect and make decisions, I, working with professionals from one of the largest recruitment companies in the world have developed this course for you.<br></p>\n\n\n\n<p>INTERVIEW TRAINING:</p>\n\n\n\n<p>This course steps you through the whole process from:</p>\n\n\n\n<ol><li>  Warning: What can trip you up</li><li>  Responding to the company</li><li>  Planing &amp; preparation</li><li>  Pre-interview checklist</li><li>  Creating a great 1st impression</li><li>  Being present in the interview</li><li>  Reading the room and knowing how to respond appropriately</li><li>  Selling yourself the right way</li><li>  Lasting impressions - How to finish the interview</li><li>Next step - follow-up</li><li>Respond to the results of your interview</li><li>Tips - What will give you the edge</li></ol>\n\n\n\n<p>In this course the <strong>12 Steps to Interview Success</strong> we look at what you need to know to walk in with confidence and a changed mind set. Awareness and focus so that you make less mistakes and a presence about you that will tip the scales on your side.</p>\n\n\n\n<p>Plus you will learn, enjoy and have a skill to use outside of interviewing...</p>", 
    "end_date": null, 
    "title": "12 Steps to Interview Success: Interview training ", 
    "price": 0, 
    "instructors": "Phill Cronin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646526_5d00.jpg", 
    "course_url": "https://www.udemy.com/12-steps-to-interview-success/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T07:08:36Z"
}