{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The <strong class=\"redactor-inline-converted\">5-Steps to A Roadie Job</strong> course is a beginner’s guide to getting road crew work with bands on tour. Following the 5 simple steps will enable you to earn a full-time living as a live sound engineer, touring lighting person, concert tour manager, backline tech, or other touring crew job. If you have ever Googled ‘how to work with bands on tour’, and not found any really useful information, then this course is for you.</p>\n\n<p><strong class=\"redactor-inline-converted\">What this course is about, and what it’s going to give you:\n\n  </strong></p>\n\n\n\n\n\n<ul><li>It’s for beginners, career-changers, students and those who have done a tiny bit of road crew work and who want to make it into a career\n\n  </li></ul>\n\n\n\n\n\n<ul><li>It’s a kind of Roadie 101, and features a 5-step action plan\n\n  </li></ul>\n\n\n\n\n\n<ul><li>It’s written by someone who is a roadie (and has been for a long time)  \n\n  </li></ul>\n\n\n\n\n\n<ul><li>Gives you the exact steps you need to start your own road crew business - vital in order to start working on the road\n\n  </li></ul>\n\n\n\n\n\n<ul><li>Comes with a free 45-page workbook (download) to help you plan your roadie career\n\n  </li></ul>\n\n\n\n\n\n<ul><li>Tells you what road crew jobs you can do, right now, with no skills, experience or training\n\n  </li></ul>\n\n\n\n\n\n<ul><li>Gives you all you need to know to get more, continuing roadie jobs\n\n  </li></ul>\n\n\n\n\n\n<ul><li>Contains 29 lessons, plus supplemental materials and resources, which should take you about 2.5 hours to complete</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Turn Your Passion For Music Into a Full-Time Living\n\n  </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Learning how to get a job as a roadie will enable you to turn your passion for live music into a full-time, high earning career. The Wall Street Journal (1) recently reported some road crew earning $200,000 a year, with the average ‘roadie’ earning at least $60,000 a year – that’s more than the average US household wage (2).\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Content and Summary\n\n  </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Designed for complete beginners, the 5 steps of 29 lessons, 2 hours of content and free workbook will guide you through the 5 steps to becoming a full-time ‘roadie’ – live sound engineer, backline tech, tour manager or lighting person for instance. The steps are broken down into individual lessons, many of them containing supplementary materials for you to download and study.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course was written and is presented by <strong class=\"redactor-inline-converted\">Andy Reynolds</strong>, who has spent the last 25 years touring as live sound engineer and concert tour manager, and who has made sure the information you get is up-to-date, relevant, and is actionable by you.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Along with the course comes a workbook, which again can be downloaded for you to use in helping you to complete the 5 steps. The workbook can be printed out, or the note fields can be filled in directly from your computer or tablet.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By watching and listening to the lectures, downloading the supplementary materials and making notes in the workbook, you will quickly get the knowledge you need to go out and start working with bands on tour. \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>The course comes with a 30-day, no quibble, money back guarantee and so, if you are for any reason not entirely satisfied, your investment will be refunded to you.</p>\n\n<h4><strong>Imagine: you are traveling around the world, working with incredible\n musicians, meeting music loving-people and being paid up to $200,000 a \nyear to do so. Enroll in the course and make it happen!</strong></h4>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p> \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>1.Shah, N. (2015). Roadies: Unlikely Survivors in the Music Business. <em>Wall Street Journal</em>, 19 March. [Online].  [Accessed: 24 March 2016]. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>2. Anon. (2016). Household income in the United States. [Online]. [Accessed: 24 March 2016].</p>", 
    "end_date": null, 
    "title": "5 Steps To A Roadie Job", 
    "price": "50.00", 
    "instructors": "Andy Reynolds", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611476_e3a4_3.jpg", 
    "course_url": "https://www.udemy.com/5-steps-to-a-roadie-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T08:40:29Z"
}