{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  This Success Formula has been and intrinsic part of Yvonne Teoh Bource&#039;s mentoring programs for the last 25 years. It gives a clear picture of what is necessary in order to achieve any desired outcome.  </p>  <p>  \t  7 Steps to Success offers 95 minutes of easy to follow lectures and looks at the mindset required to create success in whatever endeavor you may embark upon.  </p>  <p>  \t      This course goes beyond the mechanics of goal-setting and will show how to make changes and enable you to develop the same mindset that creates champions in sport, in business and in life.  </p>  <p>  \t If Success has been a problem for you up till now it is often because of a conditioned old belief or doubt that sabotages your actions and outcomes.  </p>  <p>  \t        These 7 Steps offer a clear step by step process not only to examine your own current mindset but gives simple instructions to put anyone on the path of becoming a success oriented individual.  </p>  <ol>  \t<li>Make a commitment</li>  \t<li>Be dedicated</li>  \t<li>Be Disciplined</li>  \t<li>Have unstoppable determination</li>  \t<li>Keep a single minded focused positive attitude</li>  \t<li>Make every action be purposeful and effective</li>  \t<li>Celebrate your achievements</li>  </ol>  <p>  \t      The course is supported with downloadable material to enhance and support the student through this process.  </p>  <p>  \t      A handbook of an overview of the course content is an additional bonus.  </p>  <p>  \t   With passion and a mindset focused with intent on your desired outcome, success is assured.  </p>  <p>  \t  Links are provided for further interaction with the instructor.  </p>", 
    "end_date": null, 
    "title": "7 Steps to Success", 
    "price": "30.00", 
    "instructors": "Yvonne Teoh Bource", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58042_027a_3.jpg", 
    "course_url": "https://www.udemy.com/7-steps-to-success/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-03T21:37:16Z"
}