{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this short course, you will learn the basic requirements of becoming a United States Private Pilot.  We will specifically focus on the things needed to fulfill Part 61 of the Federal Aviation Regulations. </p>\n\n<p>Learn What You Need To Do to Become a Private Pilot: </p>\n\n\n\n<ul><li>Recognize the difference between Part 141 and Part 61</li><li>Learn What You Need To Do to Obtain Your License</li><li>Understand the Basic Costs Associated with the Private Pilot License</li><li>Receive My Recommended Training Timeline &amp; Checklist</li></ul>\n\n\n\n<p>No experience is necessary.  I created this course so that anyone wishing to find out how to become a private pilot could learn it all in one place.  You could search out all of this information yourself, but you might have to look in several places to find it.  This course brings it all together and enhances it with a real pilot's experiences and advice. Through a series of easy to understand lectures, this course will provide you with the information you need to begin your path to flight.  Ground School, Flight School, Costs, Age Requirements, and Exams are all covered in this course. You will learn all you need to get started learning to fly without having to wade through the legal language of the Federal Aviation Regulations.  This course is great for anyone curious about the process of becoming a pilot, and a good starting point for those who want to start training to be a pilot.  You may also discover that flying is not for you, or that you'll need to re-evaluate your life, finances, etc, prior to starting training. You may learn you have to wait for awhile.  Whatever you learn, you will walk away a more educated student of aviation and be ready to take your next steps towards (or away from) the cockpit! <br></p>", 
    "end_date": null, 
    "title": "A Beginner's Guide to Becoming a Private Pilot", 
    "price": 0, 
    "instructors": "Tim Frizzell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788904_ec62.jpg", 
    "course_url": "https://www.udemy.com/become-a-private-pilot/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T21:42:38Z"
}