{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t <strong style=\"\">What is the course about?</strong>  </p>  <p>  \t     This course takes an in depth look at various types of engineering from the prospective of an Australian Engineering company. It gives you an insight it what engineering is all about, the different types of engineering out there, which are the most promising fields, which are the most lucrative fields as well as some design examples for mechanical and electrical engineering. You <strong style=\"\"><u style=\"\">don&#039;t need high level maths </u></strong>skills to solve these design problems! We hold your hand as you go through any problems!  </p>  <p>  \t <strong style=\"\">What kind of materials are included?</strong>  </p>  <ul style=\"\">  \t<li>Over 2 hours of content</li>  \t<li>2 Real World Design Examples</li>  \t<li>A list of the most lucrative jobs, now and in to the future</li>  \t<li>Tips for doing well at university to land a great job</li>  \t<li>And much much more</li>  </ul>  <p>  \t <strong style=\"\">How long will the course take to complete?</strong>  </p>  <p>  \t     Set aside a day (<strong style=\"\">8 hours</strong>) to do this course, as you will need a day to soak up the volumes of information we provide.  </p>  <p>  \t <strong style=\"\">How is the course structured?</strong>  </p>  <ol style=\"\">  \t<li>We take you through all the different types of engineering and their specialties</li>  \t<li>Some theory for mechanical and electrical engineering along with real world design examples</li>  \t<li>A University Guide including how to get into university/college and what university to select</li>  \t<li>The highest paying jobs, how to land an awesome job and a detailed analysis of jobs of the future.</li>  </ol>  <p>  \t <strong style=\"\">Why take this course?</strong>  </p>  <p>  \t     If you are interested in becoming an engineering, or you want to know about engineering and what engineers do, it is perfect for you! It is a great way to get a view into the closed and mysterious world of engineering from an engineering company&#039;s perspective.  </p>", 
    "end_date": null, 
    "title": "A Career in Engineering (An Introduction to Engineering)", 
    "price": "20.00", 
    "instructors": "Pascal Engineering", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/85432_0bdf_6.jpg", 
    "course_url": "https://www.udemy.com/a-career-in-engineering/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-29T07:38:42Z"
}