{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Many students become anxious at the prospect of having to write an essay or term paper. They don&#039;t understand the conventions for organizing essays, and they don&#039;t know how to manage their time and the writing process. </p><p>The result is that <strong style=\"\">many students enter college without the skills necessary to succeed simply because they were never properly taught how to write essays</strong>. </p><p>This course aims to overcome this problem by offering a systematic framework for essay writing that removes the mystery and presents a clear path for moving from idea to outline to completed first draft. </p><p><strong style=\"\">A STRUCTURED APPROACH TO SUCCESSFUL ESSAY WRITING</strong></p><p><strong style=\"\">The most efficient way to improve your essay writing is to focus on the key structural features that define successful writing at the essay level.</strong> An essay can be written beautifully, but if it&#039;s missing key structural elements (like a well defined thesis statement), it will fail as an essay.</p><p>This course provides a set of concepts and tools for thinking about, analyzing and fixing problems with the structural elements of your essay. </p><p><strong style=\"\">CONTENTS AND OVERVIEW</strong></p><p>Students in this course will learn how essay writing skills are related to &quot;deep reading&quot; and &quot;deep thinking&quot; skills, and why this is increasingly important in today&#039;s world. You will also learn how standards of good essay writing are related to standards of good written communication more broadly. You&#039;ll learn why academic essays are structured the way they are, how essay style is related to essay structure, how to approach the writing process, and how to organize your time so that you can actually get the work done before the deadline.</p><p>But <strong style=\"\">the centerpiece of the course is two detailed case studies.</strong> In one of them I take a short student essay that has some serious problems, analyze the structural issues and rewrite that essay from start to finish. </p><p>In another case study I take an actual essay assignment from an actual college class, that I don&#039;t teach, and take that essay from initial brainstorming and researching to a detailed outline to a completed first draft with a reference list and inline reference citations.</p><p>At the end of this course you will feel more confident about your ability to successfully complete essay assignments in school, and you will have a greater understanding of the skills and habits of successful writers. </p><p><strong style=\"\">NOTE: ACADEMIC INSTITUTIONS LOVE THIS CONTENT</strong></p><p>I have a lot of positive feedback about this content over the years. <strong style=\"\">College and universities from around the world have paid me thousands of dollars to license the use of these videos on their institutional servers (libraries, academic integrity programs, etc.).</strong> </p><p>Here are some of the institutions that have purchased copies of these videos for use on their own institutional servers:</p><ol style=\"\"><li><strong style=\"\">Michigan State University</strong></li><li><strong style=\"\">University of South Florida</strong></li><li><strong style=\"\">Forest Train Academy</strong></li><li><strong style=\"\">Harvard Kennedy School</strong></li><li><strong style=\"\">Lawrence High School</strong></li><li><strong style=\"\">Wayland Public Schools</strong></li><li><strong style=\"\">Wentville School District</strong></li></ol><p>… among others.</p><p>But I would like to share this content with as wide an audience as possible, and Udemy is a fabulous platform for hosting it.</p>", 
    "end_date": null, 
    "title": "A+ Essays: A Structured Approach to Successful Essay Writing", 
    "price": "20.00", 
    "instructors": "Kevin deLaplante", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285610_569c_3.jpg", 
    "course_url": "https://www.udemy.com/a-essays-a-structured-approach-to-successful-essay-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-22T00:41:53Z"
}