{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t   Do you want to secure a new role in the shortest time?\r\n</p>\r\n<p>\r\n\t   Do you want to make a career change and start a new career or job that fulfills you?\r\n</p>\r\n<p>\r\n\t   Do you want to know the secrets that employers won’t tell you but the best job hunters use everyday to find themselves great roles in the shortest time?\r\n</p>\r\n<p>\r\n\t     Based on research amongst 100’s of employers, recruiters and thousands of applicants, this course reveals for the first time the 10 key secrets that employers don&#039;t tell you, the secret tactics of the most successful job hunters and career changers and how to employ them.\r\n</p>\r\n<p>\r\n\t <strong>Providing a fresh new approach to developing your career, these 10 tried and tested strategies will transform your job hunt from a time consuming, frustrating endeavour, to a successful and empowering outcome in the shortest time and help <em>you </em>find <em>your </em>right job right now.</strong>\r\n</p>\r\n<p>\r\n\t     Do you want to know the smallest changes to your job hunting that will have the greatest effect?\r\n</p>\r\n<p>\r\n\t     If so &#039;<strong>The Top Ten Secrets to Finding the Right Job Right Now&#039;  </strong><strong>course reveals the secrets of employers and the best job hunters and unveils the most successful tactics to identify the right job and secure it in the shortest time.</strong>\r\n</p>\r\n<p>\r\n\t <strong></strong>\r\n</p>\r\n<p>\r\n\t     With these secrets in your possession you will learn how to secure a job you’ll love in the shortest time and never have to be between jobs again.\r\n</p>\r\n<p>\r\n\t     The course includes over 2 and a half hours of live content that is broken down into 10 units covering each of the 10 secrets for your convenience.\r\n</p>\r\n<p>\r\n\t <strong></strong>\r\n</p>", 
    "end_date": null, 
    "title": "Accelerate Your Career in 30 Days", 
    "price": "50.00", 
    "instructors": "Mr Gary Brown", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/158580_94c2_7.jpg", 
    "course_url": "https://www.udemy.com/the-top-10-secrets-to-finding-the-right-job-right-now/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-05T13:36:59Z"
}