{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Course Description</strong></p><p>Featured on majority of the major news channels as an expert on &quot;How to interview and get the job you want&quot; we have now developed an 1 hour course that walks through the 10 proven steps to interviewing that we have formed over the past 40+ years. Interviewing for a job is a skill that you have to master just like any other skill that is important to being successful. Ever wonder why you did not get that job you interviewed for? Why they chose another candidate over you when you had all of the skills to do the job successfully? This course will prepare you so that you don&#039;t have to ask yourself those questions anymore.</p><p><strong style=\"\">Master Interviewing And Land Your Dream Job</strong></p><p>Being in Recruiting for over 15 years I understand the common mistakes that candidates make when interviewing for a job. </p><p>A few topics I will walk through during this course:</p><ul style=\"\"><li>Suggestions for the common interview questions</li><li>Tips for matching your skills database with the job you are interviewing for</li><li>How to make a strong first and last impression </li><li>Appropriate types of questions to ask the Hiring Manager</li></ul><p><br style=\"\"></p><p><strong style=\"\">Overview And Who Would Benefit From This Course</strong></p><p>Finding a job these days is very competitive so when you finally land a job interview- you want to ensure that you are putting your best foot forward to Ace the Interview. Recent college graduates, parents re-entering the workforce, an experienced professional that has found themselves unemployed or ANYONE that is thinking about a new career or plans to interview in the upcoming months would benefit immensely from this 1 hour course. <br style=\"\"></p><p>This course contains 11 chapters; multiple worksheets along with mock interviews and question/answer suggestions. </p><p>By the end of this course you will feel confident walking in to ANY interview because you will have prepared appropriately!</p>", 
    "end_date": null, 
    "title": "Ace YOUR Job Interview- 10 Proven Steps For All Skill Levels", 
    "price": "50.00", 
    "instructors": "Carly Drum", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438742_ef70_7.jpg", 
    "course_url": "https://www.udemy.com/ace-a-job-interview-ten-proven-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T17:11:26Z"
}