{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Looking for a job in sustainability can be tough- not only is there high competition for open positions, it is also can be hard to determine what exactly do you want to do when it comes to sustainability and sustainable business. However, there are ways to not only understand what sort of job is your ideal position in sustainability, but also how to make yourself rise to the top of the résumé pile. In this course you will learn what are some of the best practices for sustainability professionals who are job hunting including:</p><ul style=\"\"><li style=\"\">What to put on your resume to show sustainability expertise</li><li style=\"\">How to narrow your job search and find your dream job</li><li style=\"\">Networking tips for talking to the right people</li></ul><p style=\"\">You will leave this course with a better understanding of what is your ideal position and how to find it, and the job hunting skills needed to get there. </p><p style=\"\">This course is set up into specific job-hunting sections: Understanding your Career Goals, The Job Search, Creating Your Resume, Adding Sustainability Experience, Networking and The Interview. You will see short videos from a leading sustainability author and consultant that will tell you best practices and ways to make all aspects of job hunting easier and more enjoyable. Furthermore, each section includes worksheets that will help guide you on your journey towards becoming a sustainability professional. </p>", 
    "end_date": null, 
    "title": "Advancing your Career in Sustainability ", 
    "price": "30.00", 
    "instructors": "Kevin Wilhelm", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499336_24a3.jpg", 
    "course_url": "https://www.udemy.com/advancing-your-career-in-sustainability/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T20:29:32Z"
}