{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is an advance course on Resume writing for professional who have a bit of work experience. Inside this course, I will help you master highly successful resume writing techniques that I personally use, and have successfully used to position others in<strong style=\"\"> roles that earn over $500 a day</strong>.</p><p>This course is for those who want to aggressively grow their corporate career and earn more by branding themselves. The focus of this training is on the on developing the right resume content, more specifically the personal branding and positioning aspects in the resume - the real ingredient that will help you get a higher pay and a faster career advancement.</p><p>If you are just out of college, this may not be the best course for you as I do not cover basics of how to make a resume, like the grammar or the font you should use in your Resume template. </p><p><em style=\"\">To understand if this is the right course for you, go through the curriculum and the lectures listed below.</em></p><p>This resume builder and resume template requires a bit of work, especially around researching the keywords and analyzing the roles. So again, if you are looking to write a resume on the fly, this may not be the course as this resume template requires effort.</p><p>After the 2008-12 recession, large corporations switched their hiring policies to focus more on their tactical needs rather than on long term strategic needs. This provides a tremendous opportunity for professionals who can quickly position themselves as experts and whose resume reflects a strong personal brand and positioning. </p><p>My name is Nara Kaveripatnam. I am a senior consultant in the banking industry. I specialize in managing change initiatives which requires me to work on internal branding and positioning strategies at these banks and corporations. I know exactly what these large corporations are looking for and what they want to see when it comes to resourcing. And that is what I have have based this training on.</p><p>This Advanced Resume writing course is intended to teach you the skill of how to make a resume, using a step-by-step resume builder process and resume template. Even before you finish this training, you will have your Resume ready – one that works in today&#039;s world. We will be building a brand new Resume that will position you are a leader and expert. The exercises will first help you identify your area of expertise and then leverage it to build your brand.</p><p>Once you master this skill, you will be ahead in the job market for life. I would love to see you go through this training and turbo-charge your career.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Advance Resume  Writing", 
    "price": "20.00", 
    "instructors": "Nara Kaveripatnam", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418234_c295_3.jpg", 
    "course_url": "https://www.udemy.com/advance-resume-builder-template/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T12:21:39Z"
}