{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">The very best thing that can happen to a person searching for their new job is to meet and become friends with a professional, independent recruiter also called a Headhunter. </p><p style=\"\">My name is Frank Welzig and I worked as a Headhunter for over 25 years and now... I want to be your coach and your friend. </p><p style=\"\"><strong style=\"\">Discover the Job-Hunting System That Never Fails!</strong></p><p style=\"\"><strong style=\"\">Note:</strong> Just about every Section has a downloadable PDF with all the vital information you need to master the secrets of that Section. </p><p style=\"\"><strong style=\"\">Section 1:</strong> Introduction and how to get maximum value from this course</p><p style=\"\"><strong style=\"\">Section 2:</strong> Takes you behind the Closed Doors of the corporate recruiting department. You need to know these facts to stop wasting your time and energy. </p><p style=\"\"><strong style=\"\">Section 2: Second lecture:</strong> Takes you behind the Closed Doors of my independent recruiting office. Here I hold nothing back and will show you how a true professional recruiter fills open job positions. When you finish the entire course you will have everything you need t<strong style=\"\">o act as your own Headhunter.</strong> </p><p style=\"\"><strong style=\"\">Section 3:</strong> Here you will discover your Unique Market Value. Your UMV will give you the confidence to get out of bed each morning to work on this course until you land your Dream job. </p><p style=\"\"><strong style=\"\">Section 4:</strong> The absolute best way to find a new job is to be found by recruiters and hiring managers searching for your skills and experience. This Section will show you exactly how to be found. </p><p style=\"\"><strong style=\"\">Section5:</strong> Résumés and Cover Letters. I&#039;ll show you the basics which is all you really need. You will learn the best way to use these tools. </p><p style=\"\"><strong style=\"\">Section 6: </strong>Job Options – you have far more options than you might think. I take you through a mind mapping exercise that will open your eyes to just how many job options you really have. </p><p style=\"\"><strong style=\"\">Section 7:</strong> You learn how to target only those companies that get you excited. </p><p style=\"\"><strong style=\"\">Section 8: </strong>Advanced Company Search – You will learn to take full advantage of the Internet and the website known as LinkedIn®. </p><p style=\"\"><strong style=\"\">Section 9:</strong> How to Get Interviews with the Hiring Managers; the only person who can actually hire you. The managers are going to love you because you are the solution to one or more of their daily problems and they will be anxious to talk with you. </p><p style=\"\"><strong style=\"\">Section 10:</strong> Interviewing Secrets that almost force the hiring managers to hire you. The hiring manager will walk you down to the Human Resources department and tell them to get you on board as soon as possible. </p><p style=\"\"><strong style=\"\">Section 11:</strong> How to Negotiate the Absolute Best Salary and Benefits package for you and your family. If you don&#039;t know how to negotiate at this stage in the hiring process, you will get skunked. The 10 Pillars of Interviewing will shift the power to you.</p><p style=\"\"><strong style=\"\">Section 12:</strong> Some parting advice, a reluctant goodbye and my very sincere wish that you will use what&#039;s in this course to change your job, your career and maybe your entire life. </p>", 
    "end_date": null, 
    "title": "Advanced Job Search: Step-by-Step Blueprint from a Recruiter", 
    "price": "20.00", 
    "instructors": "Frank Welzig", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461698_d57d_4.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-a-corporate-recruiter-find-your-dream-job-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T22:37:23Z"
}