{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you always wanted to work in the attractive world of event and wedding planning?</p><p>Have you ever thought about having a new profession or finding an interesting and fun job that makes you happy?</p><p>If the answer is yes, you are at the right place. This course is carefully created and designed especially for YOU ! I promise you that by the end of just 60 minutes (course duration), you will be able to learn everything you need in order to be a wedding organisation expert.</p>  <p>In a fun and simple way, we will go over all the necessary subjects in order to fully understand the way in which a wedding works.</p>  <p>  \t            With 12 videos you will completely get to know the world of weddings.  </p>  <p>  \t            We are going to find out about the details and the organisation of a banquet, the organisation of weddings, what we should wear when going to a wedding and the best way of designing the invitations.  </p>  <p>  \t            As well as the wedding details, we will explain in a simple and fun way the notions of protocol such as the best way to lay out the cutlery on the tables or how to dress when going to a luxury wedding.  </p>  <p>  \t            If all of this seems appealing, don't hesitate to come on the course  </p>  <p>  \t            Learn about wedding organisation on this course, created by one of the most prestigious wedding organizers in the world.  </p>", 
    "end_date": null, 
    "title": "All Levels Guide to Being an Effective Wedding Planner", 
    "price": "25.00", 
    "instructors": "Luis Prieto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301408_c606_17.jpg", 
    "course_url": "https://www.udemy.com/become-a-wedding-planner2/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T16:04:09Z"
}