{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This year over 100,000 Indians will study in America. If trends hold true about 20% will come home to India disappointed without a degree. This course is designed to help Indian students prepare for study in the US. If you are already in the US it offers you opportunity to gain insights into what you are experiencing and gives practical advice that will enable you to adjust faster.</p><p>In a study by Dr. Daljit Kaur students interviewed, all successful and from very competitive academic environments, felt that their academic adjustment would have been much easier had their problems been identified and dealt with earlier. This course is intended to do just that. </p><p>Your course instructor, David Peace moved with his family from NYC to New Delhi in 2001 where he has worked as an Interculturalist; consulting, training and coaching both Indians and expats. One of the things he has enjoyed most is training Indian students going to the US and American students coming to India.</p><p>Before coming to India he lived in New York City for 18 years where some of his closest friends were from India. During that time he served as an adjunct professor at a college just north of NYC. In this course he will draw on his experiences both in India and the US to narrow the gap of understanding as you step across cultures to study in the US.</p><p>Topics will include;</p><p>• Learning About Culture – Why is culture important?</p><p>• Planning for Your Move -- What do I need to do before I get on the plane?</p><p>• Understanding the American Context – Why do Americans do what they do?</p><p>• Adjusting to American Everyday Life – What should I do? What should I not do?</p><p>• Communicating with Americans -- Why do misunderstandings occur?</p><p>• Studying in American – How will the classroom be different?</p><p>• Indentifying Support Structures -- How will I cope?</p><p>In addition to 4 hours of lecture the course includes; downloadable resources and web links to important sites for additional information and study, check lists to help you prepare for your journey, interactive exercises to enable you to engage with American culture, reflection questions to help you process your transition.</p><p>Looking forward to seeing you online!</p>", 
    "end_date": null, 
    "title": "America Calling - A Guide for Indians Studying in the US ", 
    "price": "20.00", 
    "instructors": "David Peace", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427600_6b7d_3.jpg", 
    "course_url": "https://www.udemy.com/america-calling/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T10:36:54Z"
}