{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Apresentar com sucesso.</strong></p>  <p>O curso dar dicas como preparar uma apresentação, quais pontos são importantes antes de começar. Quais pontos são importantes, deveria ser refletir antes do inicio. </p>    <p>O curso é dividido em quatro aulas:</p>  <ul><li><em>O auditório</em> <ul><ul><li>Para quem eu vou apresentar e como eu preciso-me / ou a apresentação adaptar por esse auditório.</li></ul></ul></li><li><em>O sentido da apresentação </em><ul><ul><li>Qual sentido tem a apresentação. Qual é o objetivo da apresentação.</li></ul></ul></li><li><em>Lembrando o que </em><ul><ul><li>O auditório precisa se lembra de o que. Qual é mensagem principal da apresentação.  </li></ul></ul></li></ul>                  <ul><li><em>Conclusão </em><ul><ul><li>Finalização do curso com a conclusão do conteúdo das três aulas.<em> </em></li></ul></ul></li></ul><p><br></p><p>Esse curso é importante por pessoas que ainda não tem um forte conhecimento em preparar apresentações ou querem aumentar a capacidade deles em geral. </p><p>O curso vai oferece dicas como planejar uma apresentação e em quais pontos o apresentador deveria pensar antes de começar prepara apresentação.</p><p>O curso <em>Apresentar com sucesso</em> durar menos de uma hora. Não é necessário um conhecimento profundar de técnicas de apresentar nem precisa matérias adicionais para concluir esse curso.</p><p>Apresentar na uma forma certa, pode ser o começo do sucesso. Só quem sabe apresentar seus resultados, seu conhecimento na uma forma adequada, vai crescer profissionalmente.</p>", 
    "end_date": null, 
    "title": "Apresentar com sucesso", 
    "price": "20.00", 
    "instructors": "Dirk Heuer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635398_8696_2.jpg", 
    "course_url": "https://www.udemy.com/apresentar-com-sucesso/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T00:35:04Z"
}