{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Three things to you</p><p>1. You will Learn how to, I promise To get <strong style=\"\">Shortlisted</strong></p><p>2. You will Learn how to do <strong style=\"\">Great </strong>in<strong style=\"\"> Job Interview</strong></p><p>3. All in one Course. <strong style=\"\">The complete Package to get you your DREAM JOB</strong></p><p>After spending 1000+ hours learning how to craft the perfect resume and then landing job interviews at top-tier companies -- I compiled all of my <strong style=\"\">best resume strategies and tactics</strong> into a single, simple program.</p><p>This program is tested with hundreds of students who turned their ordinary resumes into world-class resumes.</p><p>Best of all, it only takes just <strong style=\"\">an hour</strong></p><p><strong style=\"\">How confident are you that you can land an interview for your dream job…that your resume will stand out enough to get you in the door?</strong></p><p>My guess is…<strong style=\"\">not very.</strong></p><p>You see, most open positions get inundated by templated, unimpressive resumes that fail to impress and all look exactly alike. If you were first in your class at Harvard, maybe this doesn&#039;t bother you…<strong style=\"\"></strong></p><p><strong style=\"\"></strong></p><p><strong style=\"\">THE COURSE FEATURES :</strong></p><p><strong style=\"\">Objective</strong> What the importance of <strong style=\"\">A Perfect Resume</strong>?</p><p><strong style=\"\">Initial preparation needed- </strong>Setting the career direction and preparing a self <strong style=\"\">SWOT.</strong></p><p><strong style=\"\">Types of Resume-</strong>We discuss the various types of <strong style=\"\">Resume-Chronological, functional and combo/hybrid</strong>.</p><p><strong style=\"\">Objective</strong> The objective statement is the direction you lay down and also is the value proposition that you can provide to the employer in terms of the skill sets and experience.</p><p><strong style=\"\">Accomplishment</strong> Here we provide the achievement that we have got as a measure of our skill performance at the market place.</p><p><strong style=\"\">Employment experience</strong> How to put up the employment experience in chronological sequence in terms of tenure or functional experience</p><p><strong style=\"\">Volunteer experience</strong> Any experience that showcases you in terms of leadership abilities, social cause or communication skills etc.</p><p><strong style=\"\">References</strong> The references that you put up may be a academic, professional or character letter.</p><p><strong style=\"\">Sample resumes</strong> We also look into the common errors committed, Do&#039;s and Do not&#039;s of resume building.</p><p><strong style=\"\">Power words</strong> used in resume and standard templates of Resume.</p>", 
    "end_date": null, 
    "title": "Art of Perfect Resume Writing – That gets YOU a JOB", 
    "price": "25.00", 
    "instructors": "Jibran Shahid, Asad Bukhari", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501922_d297_7.jpg", 
    "course_url": "https://www.udemy.com/perfect-resume-writing-that-gets-you-a-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T13:33:51Z"
}