{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Young people with autism like you make fantastic employees. But navigating the job market can be tough, leading to missing out on job opportunities. </p><p><strong>Learn the steps to success in this unique, transformative course.</strong></p><p>Here's what others are saying about 'Learn The Steps':</p><p>\"An important resource for young adults with autism like me who face serious systemic challenges when it comes to being employed\" </p><p>– CHLOE R</p><p>\"Great tips to finding not just a job, but a great match that will let you use your unique skills\" </p><p>– LYDIA W</p><p>The course is the result of a groundbreaking collaboration between uptimize and the Autistic Global Initiative of the Autism Research Institute, advised by researchers from Penn State university. </p><p><strong>The complete guide to getting your perfect job.</strong></p><p>'Learn The Steps' is taught by Ed Thompson, a recruiter who has conducted over 200 job interviews, as well as managing corporate internship and apprenticeship programs.</p><p>After taking the course you will:</p><p>•able to give yourself a great chance of getting hired to a job enjoy</p><p>•feel purposeful and confident, instead of nervous and confused</p><p>•start finding that employers want YOU, not just the other way round</p><p></p><p>Learn The Steps covers the complete job application process. </p><p>You'll learn where to start, and how to prepare for job applications and interviews effectively.</p><p>Then you'll learn how to nail interviews themselves, putting your 'best foot forward' and catapulting your chances of success.</p><p>You'll also learn how and when to disclose your disability, if you choose to, and have access to FIFTEEN additional downloadable tools to help you get a great first job in the 'real world'.</p><p>Start learning now!</p>", 
    "end_date": null, 
    "title": "Autism & Employment: Learn The Steps", 
    "price": "20.00", 
    "instructors": "up timize", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/574438_4e99_3.jpg", 
    "course_url": "https://www.udemy.com/learn-the-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T09:25:22Z"
}