{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t       There are a lot of things to know when you are an Uber or Lyft driver, yet they provide next to little training. There are so many small details to get right in order to earn the most amount of money per hour and also to achieve a high rating. Much of this information isn&#039;t taught anywhere and can be the key to make Lyft or Uber a gold mine for drivers. Many drivers now barely get by with low fares and constant price cuts but by taking this course, you can be a better driver and make more money per hour.  </p>  <p style=\"\">  \t       In this course, all of these videos are available to you at anytime and you can just watch what you like or watch them all. We bet that there is something you didn&#039;t know in many of the videos. By purchasing, you get lifetime access to it.  </p>  <p style=\"\">  \t           During a Lyft Mentor session, I only have time to go over about half of the content here and many of my mentees are highly rated and are better informed than many other drivers out there. I have used my experience as a mentor to craft this interactive course.  </p>  <p style=\"\">  \t               Here is what we will go over:  </p>  <ul style=\"\">  \t<li style=\"\">Advanced tips on how to pass your mentor session</li>  \t<li style=\"\">Detailed training on how to start/end a trip, finding the correct passenger and passenger location, and how a GPS can lead to better ratings</li>  \t<li style=\"\">The proper way to use GPS for rideshare</li>  \t<li style=\"\">When and how drivers get paid, </li>  \t<li style=\"\">Surge pricing and Prime Time explained and reimbursement for tolls</li>  \t<li style=\"\">How to deal with different types of passengers</li>  \t<li style=\"\">Lyft Mentoring</li>  \t<li style=\"\">Lyft Recruiting</li>  </ul>  <p style=\"\">  \t               And Udemy allows for course updates, so we will be updating and adding training to this course as more questions arise or changes occur in Lyft or Uber. The best thing about Udemy is that students have lifetime access, which means you will get to see the new course updates when they are published. Buy it once and reap the benefits as this course lengthens and improves over time.  </p>  <p style=\"\">  \t               Enroll in this course now and become a better driver today and a higher income by next week!  </p>  <p style=\"\">  \t  If you are not satisfied, I offer a 30-day money back guaranteed so if you don&#039;t like it, I will give you a full refund! What else do you have to lose?  </p>", 
    "end_date": null, 
    "title": "Be a Richer and Higher Rated Uber, Lyft, or Sidecar Driver", 
    "price": "50.00", 
    "instructors": "Rideshare Dashboard", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351530_7af9_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-lyft-or-uber-driver-training-program/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T03:13:52Z"
}