{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course is a combination of videos, audios, pdfs and exercise to help you accelerate your acting career. You may just be starting out or have been in the industry for many years and feeling a little stuck. </p><p style=\"\">This course is designed to help you create the career of your dreams on your terms. So many decisions are purely subjective e.g. what is a good headshot? Well that depends, what is the purpose of your headshot? This step by step guide will help you create an action plan to put you back in the driver&#039;s seat. </p><p style=\"\">Some of the content covered: </p><p style=\"\">Identifying your version of success | Agents | Honing your casting technique | Building rapport with creatives | Daily actions you can take when the phone isn&#039;t ringing | Networking | Being proactive rather than just waiting | Identifying your cast type | Strategies to keep you sharp and ready for the next opportunity.</p><p style=\"\">The course is broken down in 9 modules filled with comprehensive content. There are also a plethora of bonus videos; interviews with experts and quick fire &#039;5 strategies&#039; videos. </p><p style=\"\">&quot;One of the best things I&#039;ve done for my acting career was getting in touch with Nicky. She has given me a better understanding of how the industry works and also the positive energy to build my action plan. The personal image guide I&#039;ve got from her was a tremendous help and now I present myself in a more professional way. I would recommend Nicky to anybody who is starting up acting and needs a plan, to anybody who gets stuck along the way, or to anybody who needs the boost and advice of how to get back on top of things.&quot;</p><p style=\"\">This course can be taken at your own pace and worked through as a body of work or dipped into whenever needed. I often talk about momentum and taking action every day and this course provides plenty of opportunities to become productive daily. </p><p style=\"\">This course is crucial as an actor as it is important to take control of your career. Once you get into the realms of &#039;waiting to see what happens&#039; often the opportunities don&#039;t arise. This course will help you become more strategic and focused so you are spending your time and money concentrating on the activities that will ensure you get closer to your ultimate career goal. </p><p style=\"\">You can revisit whenever you choose. As an actor you are ever evolving, there is always something you can do and there is always another layer to uncover. </p><p style=\"\">&quot;Quoting one of Nicky&#039;s mottos &#039;every meeting matters&#039;, this is certainly one meeting, I shall never forget. I have found my own Fairy God Mother.  Thank you Nicky!&quot;</p>", 
    "end_date": null, 
    "title": "Be Ready for your Lucky Break |  Acceleration Kit for Actors", 
    "price": "30.00", 
    "instructors": "Nicky Raby", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565790_8c52_5.jpg", 
    "course_url": "https://www.udemy.com/accelerationkitforactors/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T07:06:29Z"
}