{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Being <strong>successful in life</strong> is all about unlocking your <strong>own potential</strong> by understanding how your emotions are attached to everything!  What you do, what you DON\"T do and why.  The key is understanding &amp; recognizing your emotions and harnessing them for ultimate success.  </p><p>Simply put, being smart about our emotions, or as it's called Emotional Intelligence (or EQ for short),  is that “something\" within us that helps us to sense how we feel and what we do or say or maybe <strong>most importantly</strong> what we <strong>DON'T DO or SAY! </strong> We all have an emotion first, then a reaction.  </p><p>This happens so fast that we usually don't even notice that it's happening, and often our emotions aren't always helping us be our best. Like in times of stress, when we are angry or frustrated, our \"best\" self is not represented.  </p><p><strong>But....</strong></p><p><strong>What if.... being seen and respected as a leader was effortless?</strong></p><p><strong>What if.... you could connect with people quickly and build strong relationships with ease?  </strong></p><p><strong>What if.... you knew yourself so well that even in the most stressful situations, you exude confidence?</strong></p><p>You can be all of those <strong>AND more </strong>with EQ training and this course.</p><p><em>This course covers the 5 essential areas of EQ:</em></p><ul><li>Self-Perception</li></ul><ul><li>Self-Expression</li></ul><ul><li>Interpersonal </li></ul><ul><li>Decision Making</li></ul><ul><li>Stress Management</li></ul><p><em>Some information that you will find in this course: </em></p><ol><li>The definition of Emotional Intelligence </li><li>Understand the 5 essential areas and the sub areas of EQ with a simple system</li><li>Recognize your own strengths &amp; weakness</li><li>Self-assessments in every lecture to help you put everything into practice right away!</li><li>Have an action plan to develop and balance your EQ</li></ol>Throughout this course, there will be real life examples, opportunities for self reflection, and a clear action plan.<br><em>Why take this course?</em><p><em></em>Unlike IQ, EQ can be developed and mastered with simple strategies. Starting which the basics, you will quickly identify, relate, develop and balance your own EQ.  </p><p>EQ can increase productivity, help with goal setting and achieving, manage stress, create lasting and fulfilled relationships, increase confidence, produce successful leaders and even happiness which is a results of a healthy and balanced EQ.  </p><p>EQ is the KEY for success in life.  Open yours today!</p><p>Together we can create the successful life you have always dreamed about!  Turn those <strong>\"What If's.... to reality!</strong>  Sign up today and I look forward to seeing you inside.</p><p>Course Duration: Approx. 6 Hours</p><p>Course materials: Videos, presentations, lectures and downloadable PDF files</p>", 
    "end_date": null, 
    "title": "Be Successful: Simple Steps to Unlock the Life You Want!", 
    "price": "20.00", 
    "instructors": "Bonita Lehmann", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513328_c0b5_7.jpg", 
    "course_url": "https://www.udemy.com/be-successful-simple-steps-to-unlock-the-life-you-want/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T03:17:00Z"
}