{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Getting through to the busy people in your world will always be a huge challenge. And whether those opportunities are big or small, personal or professional, none of us can avoid the necessity to deliver presentations. In this course, you'll learn highly practical tips from a Ted Talks coach that will help you speak with greater confidence and credibility so you and your ideas can be heard. In just the first lesson, you will see your skills climb to the next level.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">Master Four Speaking Skills That Create a Stronger Impression</strong></p><p style=\"\"><br style=\"\"><strong style=\"\"></strong></p><p style=\"\">-Learn what 'good eye contact' actually is and how it builds trust and believability</p><p style=\"\">-Develop stronger vocal delivery to enhance impact (lose those pesky ummms and uhhhhs!)</p><p style=\"\">-Leverage meaningful gestures to create stronger emphasis to key points</p><p style=\"\">-Use more purposeful/relaxed movement for greater engagement </p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">Studies show it's not just about <em style=\"\">what</em> you say, but equally if not more importantly it's <em style=\"\">how</em> you say it.</strong></p><p style=\"\"><br style=\"\"><strong style=\"\"></strong></p><p style=\"\"> As you consider this training, ask yourself this important question: How do you want to be perceived? Confident and credible? Believable and trustworthy? Engaging and knowledgeable? Now consider how you prepare. If you're like most people, you'll spend most of your time grinding out PowerPoint visuals but here's the disconnect. Nearly all the perception words you might come up with will always have more to do with how you are delivering your message. That's right. People will most often forget your words but they'll remember how you delivered them.</p><p style=\"\">In this 30 minute course we'll start by discussing the elements of making a solid first impression (because those matter!). We'll unpack four foundational skills, discuss their significance, talk about the science behind what's going on, show you a demonstration of the skill, and give you several practical tips and methods to developing the skill when you're preparing for your next meeting. </p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">Relevant. Specific. Practical. Immediately applicable. </strong></p><p style=\"\">By the end of the course you'll be more equipped to nail your next presentation!</p>", 
    "end_date": null, 
    "title": "Be the Presenter You’ve Always Wanted to Be", 
    "price": "40.00", 
    "instructors": "Amy Wolff", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598506_36d4_9.jpg", 
    "course_url": "https://www.udemy.com/be-the-presenter-youve-always-wanted-to-be/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T18:16:28Z"
}