{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you're in your 20s, you might already know that your age group has the highest rates of unemployment and underemployment. There might be <strong>100 job candidates</strong> (or more!) pursuing <strong>one job</strong> in your career field.<br></p><p><strong><em>How do you stand out as the job candidate they should hire?</em></strong></p><p>After finishing this course, you'll know how to:</p><ul><li>Meet more people who hold the keys to great jobs in your career field.</li><li>Get people in your network to connect you to VIPs.</li><li>Update your LinkedIn profile so that it draws people in.</li><li>Use LinkedIn strategically to help you get introductions to people at companies you're interested in.</li><li>Have meaningful conversations with people you've just met so that people at key companies (&amp; especially the hiring managers) become interested in you.</li><li>Ace different types of interviews!</li><li>Ask for the job.</li><li>Beat your competition to get the job!</li></ul><p><br></p><p><strong>Content and Overview</strong></p><p>In more than 65 lectures and nearly 5 hours of video, this course takes you through an entire process that is designed to get the attention of hiring managers (and the people who know them) in a positive way.</p><p>As a business coach, consultant, author, and speaker, I've spent many years in the corporate world as either an employee or consultant. I've been a leader of a career transition group (alongside other leaders who were recruiters, HR leaders, and corporate leaders) where we helped hundreds of people find and land great jobs.</p><p>I was especially drawn to the difficulties that people in their 20s experienced while trying to land a great job in their career field. </p><p>I spoke to many <strong>hiring managers</strong> to find out what irked them about people in their 20s as employees and as job candidates. I also asked them <strong>what they wanted</strong> in their younger employees.</p><p>They had a lot to say!</p><p>I developed this course with you - and your future hiring managers - in mind.</p><p>With this course you'll get information that comes from hiring managers and others I've interviewed about career development. You'll learn what to do with this information and how to use it to your best advantage to get a great job in your field!</p><p>To your success!</p><p><em>Glory Borgeson</em></p><p><br></p>", 
    "end_date": null, 
    "title": "Beat Your Competition to Get That Great Job!", 
    "price": "25.00", 
    "instructors": "Glory Borgeson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593364_cde8_2.jpg", 
    "course_url": "https://www.udemy.com/job-search-secrets-to-get-a-great-job-for-20-somethings/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T21:06:12Z"
}