{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The most successful people are not always the smartest people. But they have one thing in common: they communicate well.</p><p>Their manner, approach, style, and structure create a connection with their audience – a connection that enables them to move the audience to action. By speaking with confidence, they instill confidence in their listeners. When a speaker projects doubt, it creates doubt in the minds of the audience. Unfortunately, what may come across as doubt may simply be a lack of preparation or a poorly structured talk.</p><p>For over twenty-five years, I’ve been involved in the communication business. During this time, I’ve had the opportunity to study great communicators – both in person and through books. Honestly, some are just naturals. They were born to communicate. Speaking in front of crowds come as natural to them as throwing a baseball does to others.</p><p>Then there are the great communicators who made themselves great communicators through trial and error, and putting into practice the best principles of communication. They practice, practice, practice. They are open to feedback and are willing to make changes.</p><p>Whether it comes naturally or from hard work, successful communication follows a fairly predictable pattern. Once you discover that pattern and master it, you will be well on your way to success.</p><p>Think of a successful presentation in physiological terms. Every good speech has a central nervous system that holds it together and allows the audience to be actively engaged. The outline method you'll learn is one that has been tested in front of thousands of people. Following it will help your speech flow and move effectively towards your call to action. Its simplicity also enables you to have a firm grasp on your material, resulting in a more confident presentation.</p><p>Become a better speaker and become more successful.<br></p>", 
    "end_date": null, 
    "title": "Become More Successful by Becoming a Better Speaker", 
    "price": "20.00", 
    "instructors": "Ken Hensley", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494608_d0d4.jpg", 
    "course_url": "https://www.udemy.com/become-more-successful-by-becoming-a-better-speaker/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T23:00:48Z"
}