{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span>The course provides information on building codes, optimal building strategies and insight on the manufacturing process of wood types. Several terminologies will be explained including: roofs, staircases, framing and blueprint readings. The course progresses from basic safety to tool use and to framing methods of walls, stairs and roofs. After taking this course, you will have a vast knowledge of carpentry, be able to identify features in roofs, houses, and stairs. You will be able to construct your very own wooden structures including: wall frames, trusses, rough opening for doors and windows, staircases. The course provides descriptive videos designed with a professional background. Audio is provided to guide you through the lectures. The coursed is organized in specific categories to keep you focused on a certain subject for that time period. Each section will be followed with an engaging quiz to ensure that you are no skipping over the lectures. There is a 20 question final test to accurately assess the skills you learned about the material provided in the course. The course should not take an absurd amount of time as the short videos range from 1 minute to 7 minutes max. When all is said and done, after completion of “Become A Master Carpenter – Advanced Carpentry” you will be able to repair and construct your own structures to your home.</span>  </p>", 
    "end_date": null, 
    "title": "Become a Master Carpenter: Basic Carpentry", 
    "price": "20.00", 
    "instructors": "John Watson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405928_5281_6.jpg", 
    "course_url": "https://www.udemy.com/advanced-carpentry/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T01:19:59Z"
}