{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Why should you take this course?</strong>  </p>  <p style=\"\">  \t  This course will help you get started as a Business Analyst. You will understand the essentials about Business Analysis and have practical experience of how to apply core analysis techniques in the work place. This course provides both new and experienced Business Analysts with all the knowledge and tools they need to perform the BA roles.  </p>  <p style=\"\">  \t  At the end of this <strong style=\"\">Business Analysis Foundation Skills Course</strong> you are very competent in the foundation business analysis skills with a comprehensive understanding of the role of the Business Analyst in both traditional waterfall and Agile based projects.  </p>  <p style=\"\">  \t  You will also have the <strong style=\"\">tools and techniques (i.e. UML Use Cases, Activity Diagrams, Data Modelling)</strong> you need to perform business analysis requirements activities with confidence; you will have solid understanding of <strong style=\"\">key modelling techniques</strong> and how to apply them.  </p>  <p style=\"\">  \t <strong style=\"\">How is the course structured &amp; what is included?</strong>  </p>  <p style=\"\">  \t  You are guided through 10 Lectures. Each Lecture consists of a short <strong style=\"\">audio narrated video, clear instructions for further reading, examples, student materials to download</strong>, <strong style=\"\">practical assignments</strong> and <strong style=\"\">knowledge quizzes</strong> at the end of each lecture.  </p>  <p style=\"\">  \t <strong style=\"\">How long will the course take to complete?</strong>  </p>  <p style=\"\">  \t Lectures with practical assignments will take between 1-2 hours to complete. Lectures with reading materials for your review will take about 20-30 minutes of your time.  </p>", 
    "end_date": null, 
    "title": "Become A Business Analyst", 
    "price": "50.00", 
    "instructors": "A B", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176962_4e74_5.jpg", 
    "course_url": "https://www.udemy.com/become-a-business-analyst/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T23:52:48Z"
}