{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In just 1 hour you will improve yourself greatly.</p><p><strong>Master learning, cross-cultural communication and winning negotiation strategies.</strong></p><p><strong></strong>• Aquire skills faster than anyone else<br>• Become a great verbal, written and body language communicator across cultures<br>• Understand how different cultures experience time<br>• Win every negotiation</p><strong></strong> <p><strong>Improve upon the skills you use at work everyday and be ready to skyrocket your career!</strong></p><p>MBA courses all use this exact information. If you want to be great at work you will need to learn how to improve yourself every day. Further, you need to be an effective communicator across cultures and know how to win important negotiations. This course will teach you just that. </p><p><strong>Content and overview<br></strong>This course contains 13 high paced, information packed videos. It is suitable for everyone who is willing to study the theory and is looking for a promotion at work.</p><p>You will master the theory behind acquiring new skills. At the end of the course you will find that improving your skill set is much easier.</p><p>Furthermore, you will acquire excellent communication skills across cultures. In today's globalised workplace it is essential that you know how to communicate effectively written, verbal and that you use the right body language. Additionally, you will understand how different cultures experience time. Asian, Middle Eastern and Western companies will also be able to optimise their international business success with this information. </p><p>Moreover, you will get insight into winning negotiation strategies. You will have the theoretical knowledge to lead negotiations to your desired outcome. Upon completing the course you will receive a verifiable certificate of completion.</p><strong>Reviews</strong><br><p><em>From my course \"Master 5 Economic Concepts\"</em><br>★★★★★<br><em>Thomas Markus<br>\" Great course....This course had helped me a lot....the way Verstraten explains them is extremely clear and easy to understand.....\"</em></p><p>★★★★★<br><em>Mujahid Akram</em><br><em>\"</em><em>Simple, Clear and Concise.... Worthwhile of your time. Loved it.\"</em></p><p><strong>Bonus:</strong> did you ever wonder why it seems that so many people in your company are incompetent? Watch the bonus video.<br><br><br></p>", 
    "end_date": null, 
    "title": "Better at Work ", 
    "price": "20.00", 
    "instructors": "Jan-Willem Verstraten", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426512_d71d_2.jpg", 
    "course_url": "https://www.udemy.com/better-at-work/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T01:57:42Z"
}