{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">You&#039;re Hired! Bookkeeping Job Search Guide </strong>– Discover and learn the qualifications, qualities and soft skills employers require from a bookkeeper. Learn what bookkeepers do in the workplace for an exciting career makeover and be in control of your career path and be successful doing what you enjoy.</p><p style=\"\">Inside the course, complete the <strong style=\"\">Bookkeeper&#039;s Hiring Test </strong>used by employers to screen candidates designed to honestly assess and measure your accounting and bookkeeping skills. Learn through this test what you need to learn or know that you&#039;re ready for that next job interview! </p><p style=\"\">Bookkeeping job opportunities are growing every day. You want to translate your skills towards a bookkeeping but don&#039;t know where to begin. This course is designed to make it easy for job seekers <strong style=\"\">to learn what qualifications employers are looking for from candidates; the education, training, &amp; experience requirements along with the qualities and soft skills needed to be successful on the job. </strong>You will also learn what and how to earn the &#039;functional expertise&#039; you need to be successful. </p><p style=\"\">Given my professional background as your instructor, I will offer suggestions and insight from an employer&#039;s lens how your resume can stand out from the rest. I promote and encourage a lively class through the discussion forum. Expect me to respond to you within 24 hours or less. </p><p style=\"\">If you are considering a career in bookkeeping either as your first job, a career makeover or advance your career; this course is an excellent place for you to start.</p><p style=\"\">I&#039;d be delighted to be <strong style=\"\">your bookkeeping career coach </strong>on the inside!</p>", 
    "end_date": null, 
    "title": "Bookkeeping Job Search Guide", 
    "price": 0, 
    "instructors": "Majo Jacinto", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413508_a625_2.jpg", 
    "course_url": "https://www.udemy.com/bookkeeping-job-search-guide/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T20:43:28Z"
}