{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Have you ever wondered what kind of impact you could make at a small company with huge growth potential?</strong>  </p>  <p>  \t                  Are you interested in growing your career and advancing well beyond your peers?  </p>  <p>  \t                  There is a reason why jobs at startup companies are among the <strong style=\"\">most desired jobs in any industry</strong>:  </p>  <ul style=\"\">  \t<li> Super smart co-workers</li>  \t<li> The chance to have an impact</li>  \t<li> The opportunity to advance your career 10X faster than working at a larger firm</li>  </ul>  <p>  \t                  So, what’s stopping you from landing an awesome startup job?  </p>  <p>  \t<strong style=\"\">This course is a <em style=\"\">step by step guide </em>for people who currently don't possess any technical skills but want to land the startup marketing or business job of their dreams.</strong>  </p>  <p>  \t                  In this course we focus on one of the most impactful jobs a startup will ever have - GROWTH!  </p>  <p>  \t                  A growth role in a technology start up might be right for you if you want to:  </p>  <p>  \t                  Touch multiple parts of the business, including design, sales, web development, and product.  </p>  <p>  \t                  You are either creative or numbers driven  </p>  <p>  \t                  Are prepared to build one of the most in demand skill sets in the industry.  </p>  <p>  \t                  Grow your network far beyond what you imagined, ensuring when you are up for that next startup role, it will be there waiting for you.  </p>  <p>  \t                  Own the growth of your company, and have a huge impact on whether your product successfully scales!  </p>  <p>  \t<strong style=\"\">The path of most growth marketers is CEO/Founder, highly paid marketing director, or CMO.</strong>  </p>  <p>  \t                  Despite being one of the most difficult jobs to hire for - technology marketing does not require you to have specialized coding or sales skills.  </p>  <p>  \t                  You just need to be strategic, understand the major marketing concepts, and be willing to learn! Your career will know no limits if you can work hard, execute and learn on your feet.  </p>  <p>  \t                  This course is the first step by step guide with <strong style=\"\">exact strategies, word-for-word scripts, and proven tactics</strong> to land a Startup tech marketing role.  </p>  <p>  \t                  Best of all, this course is specifically designed for those who want to break into a business side startup job right from college or a different industry.  </p>  <p>  \t<strong style=\"\">Here is just *some* of what you will learn in this course:</strong>  </p>  <ul style=\"\">  \t<li>A step by step strategy for breaking into a startup, even if you don’t know where to start</li>  \t<li>A proven approach to connect with the right people to get an interview at your dream startup. </li>  \t<li>A roadmap for your entire job search and networking strategy.</li>  \t<li>A powerful method for answering any interview question like a top performer.</li>  \t<li>Exact strategies for pitching companies that ensures you rise to the top of all applicants</li>  \t<li>A deep understanding of how startup founders select employees <strong style=\"\">hint: </strong>they don’t hire from job boards.</li>  </ul>  <ul style=\"\">  \t<li><em style=\"\">Learn how to learn: </em>We don’t just show you how to break in, we give you the tools to win at interviews for top startups again and again, your career will never be the same! </li>  </ul>  <p>  \t<strong style=\"\">Here is An Outline of All the Awesome Things You're Going to Learn</strong>  </p>  <p>  \t                  Module 1: <strong style=\"\"><em style=\"\">Startup Marketing Foundations</em></strong>  </p>  <p>  \t<strong style=\"\">- </strong>Learn why growth at a technology startup is so critical to success, and how startup founders and CEOs really think about the role. At the end of this module, you will be speaking the same language as the pros. You’ll also learn the most common types of startup marketing jobs out there.  </p>  <p>  \t                  Module 2: <strong style=\"\"><em style=\"\">Becoming a Top Performer</em></strong>  </p>  <ul style=\"\">  \t<li>The best way to understand what distinguishes a good startup marketer is to understand the huge challenges they help solve in a startup environment. In this module, you will learn about the common challenges and skills needed in your role, so you can position yourself as the solution to your dream company’s problem. </li>  </ul>  <p>  \t                  Module 3: <strong style=\"\"><em style=\"\">Developing a Bulletproof Job Search Strategy</em></strong>  </p>  <p>  \t                  - Breaking into a tech startup is incredibly hard. In this module, we will give you the step by step job search, networking, and organizational strategies you will need to separate yourself from the pack. You will have an awesome battle plan ready after this module.  </p>  <p>  \t                  Module 4: <strong style=\"\"><em style=\"\">Building the Network of a Top Performer</em></strong>  </p>  <p>  \t                  - The strategies and mindsets in this course will show you what you need to do to build an insanely powerful network of influential people who are<strong style=\"\"> invested in seeing you succeed</strong>. More often than not, a strong network determines wether or not you will be successful, this module shows you how to get one.  </p>  <p>  \t                  Module 5: <strong style=\"\"><em style=\"\">Killer Strategies for Breaking In</em></strong>  </p>  <p>  \t                  Having the desire to work for a tech startup is not enough you need skills, strategies that set you apart from other candidates. In this module, we equip you with the strategies you need to lay a job search foundation.  </p>  <p>  \t                  Module 6: <strong style=\"\"><em style=\"\">Getting the interview</em></strong>  </p>  <p>  \t                  Most startups are totally overwhelmed with resumes  </p>  <p>  \t                  from applicants who don’t know how to play the game. Don’t fall prey to blind resume submissions. We will show you how to approach the application process so you will rise to the top of the pile  </p>  <p>  \t                  Module 7: <strong style=\"\"><em style=\"\">Acing the interview</em></strong>  </p>  <p>  \t                  Remember<strong style=\"\">, an interview is a performance. </strong>In this module, we will show you how to perform like a top candidate during the interview, and will show you how to answer difficult questions and impress your hiring manager.  </p>  <p>  \t<strong style=\"\">This course is for:</strong>  </p>  <ul style=\"\">  \t<li>People who want to break into a top tech startup and are willing to put the effort needed for this difficult task.</li>  \t<li>People interested in getting one of the few coveted, non-technical jobs at a startup, especially in marketing.</li>  \t<li>Those who are willing to build a strong network of friends and colleagues that help them have their dream career.</li>  </ul>  <p>  \t                  This course is not for people who think there is a magic bullet to finding your dream job, or for people who bought a course hoping it would solve their career problems. You need to take action and be creative, <em style=\"\">using the tactics, scripts and deep job search strategies</em> outlined in this course.  </p>  <p>  \t<strong style=\"\">The choice is up to you:</strong>  </p>  <p>  \t                        --------------------------------------  </p>  <p>  \t                  You can:  </p>  <ol style=\"\">  \t<li>Continue to struggle at finding your way into a job you are excited to go to every day, hoping at some point that your current situation will improve. </li>  </ol>  <p>  \t                  or  </p>  <p>  \t              2. Take action now in your career and set yourself on the path to landing that dream startup job.  </p>  <p>  \t                  No matter where you are in the job search process, if you take even one strategy or mindset away from this course, the result could result in a <strong style=\"\">dramatic improvement in your career.</strong>  </p>  <p>  \t                  I will personally respond to any questions you may have as you work through these presentations. I am invested in your success and happy to help!  </p>  <p>  \t                  -Erik Grueter  </p>", 
    "end_date": null, 
    "title": "Break Into A Technology Startup", 
    "price": "20.00", 
    "instructors": "Erik Grueter", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276306_2b36_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-startup-job-and-launch-your-professional-career/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T00:05:59Z"
}