{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h5><strong>&quot; To anyone who wants to enjoy a career in IT&quot;</strong></h5>\r\n<p>My name is Paul Browning and I worked as a police officer in the UK from 1988 to 2000<a rel=\"nofollow\" href=\"http://www.breakintoit.com/join/attachment/browning018/\" target=\"_blank\" class=\"external-link\"></a>.\r\n While I enjoyed the job immensely I felt I wanted to take on a new \r\nchallenge, I already had an interest in computers. I had attended an \r\ncourse on PC assembly and learned a little bit about computer \r\nnetworking.</p>\r\n<p>I started to study for some Microsoft exams and began to apply for \r\njobs in the IT industry. I landed a helpdesk job but as you can imagine,\r\n I quickly became bored doing password resets. I studied hard and passed\r\n some more exams and then got a role doing network support for Cisco \r\nsystems in the UK.</p>\r\n<p>I later left to start my own IT company offering training and \r\nconsulting services to companies both in the UK and internationally. I \r\nsold the company in 2008 and now run an online Cisco training company at\r\n <a href=\"http://www.howtonetwork.net\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">www.howtonetwork.net</a>.</p>\r\n<p>During the time I trained students I helped many hundreds of them get\r\n their break into a career in IT. I watched them move from helpdesk \r\nroles into networking and often into freelance consulting contracts or \r\neven their own companies. I’ve also worked with hundreds of IT managers \r\nwho have shared with me the things they look for when looking to hire IT\r\n staff for their companies. I’ve even been through the process myself \r\nwhen I was looking to get out of the police force.</p>\r\n<p>I see people making the same mistakes time and time again when they are trying to get a job in IT:</p>\r\n<ul><li>Sending resumes out and hoping for the best</li><li>Waiting for jobs to appear online before applying</li><li>Sending generic resumes which will never be read</li><li>Failing to prepare properly for technical interviews</li><li>Not presenting themselves professionally to companies</li><li>and many more common mistakes</li></ul>\r\n<p>Break Into IT has been devised with people like you in mind. It is a\r\n one stop training resource to help you plan, prepare and execute your \r\nplan to get you from where you are now to where you want to be. Here are\r\n just a few of the things you will learn:</p><ul><li>\r\nHow to find the best jobs before they appear online</li><li>How to tap into vast networks of people willing to help you</li><li>The secrets to getting your resume read</li><li>How to get called for interviews</li><li>How to ace technical interviews</li><li>Standing out from the crowd</li><li>How to bridge the lack of experience problem</li><li>How to negotiate your salary and benefits</li><li>How to get advancement once you get in</li><li>and much more</li></ul><br>\r\n<p>These tips will help you if you want to apply for any IT roles including:</p>\r\nNetworking<br>Desktop support<br>Helpdesk<br>Programming<br>Web design<br>Project management and support<br><br>Most people are doing it all wrong and never get called for interviews. They wonder why but because they don&#039;t know how the system works they will be forever in the dark.<br><br>These principles have been used my thousands of my students to break into IT. I hope you enjoy applying them to land your dream job.<br><br>I hope you enjoy the course. Post a question if you need any thelp.<br>", 
    "end_date": null, 
    "title": "Break into IT - How to Land Your Dream Job in IT", 
    "price": "25.00", 
    "instructors": "Paul Browning", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23872_04fc_2.jpg", 
    "course_url": "https://www.udemy.com/breakintoit/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-30T07:33:22Z"
}