{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "Whether you are an athlete, artist, actor, or all of the above, you need to put together an extracurricular résumé for your college application that will highlight all of your accomplishments if you are to have the best shot of earning admission to all the colleges and universities on your list. Craig Meister, college admissions expert and president of Admissions Intel, will help you determine the right words and develop the best layout in order to differentiate your extracurricular résumé from the competition. Remember, it’s no longer about simply being a college applicant worthy of admission; it’s also about communicating that you are a college applicant worthy of admission. A remarkable résumé helps you do just that! This short course is perfect for high school students of all ages and their parents because it efficiently and effectively educates individuals enrolled about how those in the know create college application résumés that earn students admission to the top colleges and universities in America. It is never too early to start your extracurricular résumé and as long as you have yet to submit your college application it is still not too late to apply the tips from this course to improve your chances of acceptance at the colleges and universities on your list. In addition to the course lecture, students gain access to the famed extracurricular résumé entry template that Craig Meister created a decade ago and which has served over 1,000 top college-bound students so well ever since. Students also gain access to a list of power verbs that will immediately energize their résumés and increase their chances of college admission. What are you waiting for? Don&#039;t delay in differentiating your extracurricular résumé from your competition. Sign up for this invaluable course today. ", 
    "end_date": null, 
    "title": "Build an Extraordinary Extracurricular Résumé", 
    "price": "40.00", 
    "instructors": "Craig Meister", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482116_3626_2.jpg", 
    "course_url": "https://www.udemy.com/build-an-extraordinary-extracurricular-resume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T13:24:08Z"
}