{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you tired of getting <em>rejection after rejection</em>? Feel you have a solid CV, set of skills and work experience? Yet still...you are not sure what the problem is?</p><p>I'm about to reveal to you the hidden secret of that no one is talking about....</p><p>If you want to get more follow up phone calls, more invitations to interviews, more job offers than ever before...well </p><p><strong>I can help you!</strong></p><p>Cover Letters are a <em>critical part</em> to making a Top-Tier application. It adds a level of focus to your application that will make you stand out amongst the stack of all other applicants.</p><p>I've been through the experience of myself of getting rejection after rejection and being frustrated as I WAS following alot of the advice I was reading online. </p><p>What I discovered was that the so called 'GURUS' had never even worked within the Corporation alot of the time, and had limited experiences of success. Furthermore the level of GENERIC information meant that I wasn't ever able to really able to build a truly unique Cover Letter</p><p>I didn't even appreciate how IMPORTANT a Cover Letter is to your application! And it seems it's not just me that thinks this:</p><p>'Your resume is important, but nothing can replace a well-written cover letter' - Business Insider</p><p>'Covering letters are more important than your CV' The Financial Times</p><p>' A cover letter is an important document sent along with your CV' The Telegraph</p><p>Having successfully landed a job at Deloitte as an ARTS student I've since gone on to help hundreds of people with their applications. If you want to build a truly killer cover letter I'll walk you through this guide and give you an AMAZING and the ONLY template you'll ever need alongside the knowledge and tools for super customisation :) </p><p><br></p>", 
    "end_date": null, 
    "title": "Build a Killer Cover Letter for the Corporation", 
    "price": "20.00", 
    "instructors": "Deepak Shukla", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673250_d9d7_3.jpg", 
    "course_url": "https://www.udemy.com/cover-letter/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T12:16:35Z"
}