{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Students will learn to create the correct Respond to \" What do you Do \" with lazier focus in the networking job search market without looking desperate.  Being able to master the networking conversation and connections to gain contacts that can lead you to your next job. You will learn to be confident and control the conversations with the other people’s agenda, which will be helping you, find the perfect job and interview introductions. Being proficient at exactly what to say and what not to say to build networks, chemistry and job referrals.</p><p>Introverts usually don’t like to talk about them selves. That is why they make the best networkers when they learn the few questions that focus on the other people. . Extroverts usually talk too much and don’t listen. Mastering these questions will inspire other people to go out of their way to help when presented properly.</p><p>Subject areas are your mindset and thoughts while you are networking and making contacts and building relationship. What you should wear. What you should say to quickly establish common ground. How to be perceived as the go to person in your industry. Creating chemistry and how to solve a problem now and or prevent one from occurring in the future. Describing your area of specialty. Describing your Basic Script and your 10-second pitch. How to tell a story well. Where to network and much more.</p>", 
    "end_date": null, 
    "title": "Business Networking To A New Job", 
    "price": "35.00", 
    "instructors": "Will Caraway", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709998_7f01_2.jpg", 
    "course_url": "https://www.udemy.com/networking-your-way-to-a-new-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T19:04:36Z"
}