{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn the concepts, tools and techniques that will help you to impress recruiters and get your resume shortlisted with airlines around the globe.</p><p><strong style=\"\">Attract the attention of your dream airline with this comprehensive course.</strong></p><ul style=\"\"><li>Understanding the selection process &amp; how to get noticed</li><li>Introductory copywriting, marketing and design for killer resumes</li><li>Developing expert interview skills based on elements of psychology</li><li>Coaching throughout the interview and selection process</li></ul><p><strong style=\"\"><br style=\"\">Give yourself an edge in this highly competitive industry</strong></p><p> For every flight attendant job, there&#039;s usually 100+ applicants. Just getting your resume noticed can become a challenge, let alone making it through the interview process.</p><p>By understanding the tricks of the trade you can greatly improve your chances of getting noticed.</p><p><strong style=\"\">Content and Overview</strong></p><p>This course is designed for anyone, regardless of background or experience level, who wants to land their dream job as a flight attendant.</p><p>This course will take you through the process of drafting, developing and perfecting a cabin crew resume. Beginning with identifying and highlighting only the most relevant skills, we will then polish it up using techniques drawn from professional copywriting, marketing and design. </p><p>You will learn the fundamentals skills needed for a successful airline interview including what to expect, what to wear and how to prepare using the STAR method.</p><p>By the end of this course, you&#039;ll have valuable skills that will help you to feel confident throughout the interview process. You&#039;ll know what style and format of resume to use, techniques to write it and how to bypass the gatekeepers that often stop it from being read. You&#039;ll also receive bonus materials that help you to brainstorm and prepare yourself for every step of the application process. </p><p><em style=\"\"><strong style=\"\">On completion of the course students will have access to a highly personalised 20 minute </strong></em><em style=\"\"><strong style=\"\">one on one coaching call.</strong></em></p>", 
    "end_date": null, 
    "title": "Cabin Crew Academy: Land Your Dream Flight Attendant Job", 
    "price": "50.00", 
    "instructors": "Anna McPhee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463926_e3f8_3.jpg", 
    "course_url": "https://www.udemy.com/cabin-crew-academy/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T10:26:25Z"
}