{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>أبحث عن إجابة لسؤال هام من نحو 22 سنة <strong style=\"\">هو لماذا بعض الناس أكثر نجاحاً في وصولهم لوظائف مرموقة برواتب مرتفعة وظروف مناسبة من غيرهم؟</strong>، وأيضاً يوجد الكثير من الأشخاص الذين تعبوا جداً على بناء ذاتهم ولكن كانوا الأسوء حظاً في الحصول على الوظيفة التي يستحقونها؟ </p><p>عملت في إدارة الموارد البشرية لأكبر الشركات والمؤسسات في الإمارات ومررت على أكثر من 10 آلاف سيرة ذاتية وحضرت تقريباً أكثر من 2000 مقابلة عمل لوظائف تراوحت رواتبها ما بين 35 ألف إلى 200 دولار شهرياً، وتعمقت في كتب ومقالات ونيوز لترز الموارد البشرية ودهاليز متخذي القرار في أكبر الشركات حول كيف يختارون موظفيهم، وحاولت قدم النتائج في برنامج متكامل يغطي أهم المحطات في عالم الحصول على وظيفة بما فيها: </p><p>أولاً: اعرف نفسك واكتشف قواك الكامنة (نحو 40 سؤال شخصي ينصح الإجابة عنهم لاكتشاف الذات)</p><p>ثانياً: تلخيص ما أنا عليه الآن  من الرصيد العلمي (سرد لكافة أنواع التخصصات العلمية) وقدراتك (تم سرد لكافة أنواع القدرات التي يتمتع بها البشر سواء كانت قدرات بدنية أو حركية أو حسية أو معرفية) ومخزون المهارات (تم سرد لكافة أنواع المهارات التي يتمتع بها البشر سواء كانت مهارات أساسية أو مهارات حل المشكلات أو مهارات إدارة المواد والتحكم بها أو المهارات الاجتماعية أو مهارات التعامل مع الأنظمة أو المهارات الفنية) ومجالات وأجواء العمل التي تناسبك (مثل المهن الواقعية Realistic occupations والمهن الاستقصائية Investigative occupations والمهن الاجتماعية والمهن الفنية Artistic occupations والمهن الاستثمارية Enterprising occupations  والمهن التقليدية Conventional occupations) وكذلك القيم المهنية مثل (حب الإنجاز Achievement وحب الاستقلال المهني Independence  وحب التقدير Recognitionوحب إقامة العلاقات  Relationshipsوحب الحصول على الدعم Support  وحب ضمان الأمان الوظيفي Working Conditions) كي تختار منها ما تتمتع به وتملكه.</p><p>ثالثاً: دراسة سوق العمل: معرفة ما الذي يشكل سوق العمل في القطاع الخاص؟ </p><p>رابعاً: دراسة الوظائف المتاحة والمستحدثة في السوق العمل</p><p>خامساً: اختيار أهم الوظائف التي تهمك وتواءم شخصيتك</p><p>سادساً: التحضير لكتابة  CVملائمة لخياراتك</p><p>سابعاً: النصائح الهامة</p>", 
    "end_date": null, 
    "title": "Career Planning - in Arabic - كيف تخطط مسارك الوظيفي", 
    "price": "20.00", 
    "instructors": "Sobhi Akbik", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469264_7503_3.jpg", 
    "course_url": "https://www.udemy.com/career-planning/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T19:41:57Z"
}