{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Through engaging lectures and hands-on exercises, Dana Perino, the former press secretary to George W. Bush, will guide you through every facet of building a successful career and a fulfilling personal life.</p>    <p>Dana has been through a variety of changes and challenges. But through perseverance, networking, and smart decision-making, she's been able to thrive in some of the most exciting careers.</p>    <p>Now you can access the best tips from her book, <em>And the Good News Is...: Lessons and Advice from the Bright Side</em>, along with other valuable insights you can apply to your own life.</p>    <p>Dana will show you how you can take the lessons she learned and use them to forge a path towards success, no matter how many challenges you might face.</p>    <p><strong>Valuable Life Lessons from a Former White House Press Secretary</strong></p>  <ul>  <li>Harness      the power of mentors and networking</li>  <li>Make      clear-headed decisions for every major challenge in life</li>  <li>Create      a work-life balance that brings happiness and fulfillment</li></ul><p><strong>Make Decisions That Will Bring You Success, Joy &amp; Balance</strong></p>  <p>Throughout this course, you'll learn what it takes to make decisions on a daily basis that will change your life for the better.</p>    <p>With the help of mentors and a network of professionals, you'll develop the right mindset so you can really let your career take flight.</p>    <p>Ultimately, you'll be able develop the perfect work-life balance to create joy and fulfillment throughout all areas of your life.</p>    <p>Like Dana, you'll know exactly how to navigate life's biggest and most difficult decisions and make choices that are truly right for your ambitions.</p>    <p><strong>Contents and Overview</strong></p>    <p>After an introduction into Dana's background, you'll begin this course by learning about the power of having and being a mentor. </p>    <p>She'll show you how she was able to make her way to a White House job even though she grew up in a small town with no connections.</p>    <p>Next, you'll learn how to build a strong network, regardless of what industry you work in. You'll cover the benefits of having a network of allies, as well as the many ways that you can expand your network so you can always have a support system in place.</p>  <p>Life is all about making big and small decisions daily, so Dana will show you how to make the right choices when it comes to things like your education and career. </p>    <p>You'll be able to choose when it's time to move on to another job, and you’ll release guilt and fear so you can make clear-headed choices that are truly right for you.</p>    <p>Having the right mindset for success is imperative, so Dana will teach you about forgiveness, risk-taking, and humility so you can transform negative patterns into positive ones that will help you succeed.</p>    <p>As you move through this course, you'll tackle how to speak effectively and take care of your team by showing gratefulness and loyalty. These skills will make you a more effective communicator so you can get what you want and need.</p>    <p>Finally, you'll gain insight into how to establish a great work-life balance and how to maintain a civil work environment.</p>    <p>By the time you complete this course, you'll be inspired to change your life and achieve your biggest dreams.</p>    <p>Whether you're struggling with going back to school, the career path you should take, or how to balance your personal and professional life, you'll have all of the tools necessary to make the right choice every time.  </p>", 
    "end_date": null, 
    "title": "Career and Life Lessons for Success and Joy by Dana Perino", 
    "price": "40.00", 
    "instructors": "Dana Perino", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636064_bd69_2.jpg", 
    "course_url": "https://www.udemy.com/danaperino/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T18:07:24Z"
}