{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This programme is essentially the hugely popular &#039;<a href=\"http://www.udemy.com/everyday-mind-mastery/\" title=\"EMM Course\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">Everyday Mind Mastery</a>&#039; course, applied to getting your dream job. It works.</p>  <p>Ben Franklin first came up with the concept of achieving mastery by focusing on just one thing at a time and Tom and Angela systematized the principles and created the 13x4 concept.</p>  <p>This course take the fundamentals of designing and landing your dream career and puts them into the simple 13x4 system to create the maximum results with the minimum effort.</p><p>Photo by Kieran Doherty -&nbsp;<a href=\"http://www.kierandoherty.com/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">http://www.kierandoherty.com/</a>&nbsp;© 2012 Kieran Doherty Photography<br style=\"\"></p>  <p>Upon Completion of The Course You Will Know:</p>  <ul style=\"\">  <li>Dozens of powerful strategies to&nbsp;get the career, job, role and salary that you want</li>  <li>How to&nbsp;answer any interview question easily&nbsp;and with total confidence</li>  <li>Proven strategies to increase you salary by between&nbsp;15% and 30%</li>  <li>How to&nbsp;&#039;sell&#039; yourself&nbsp;into any job, role or promotion</li>  <li>How to finally&nbsp;find the career that&#039;s right for you&nbsp;and get paid more than you&#039;ve ever earned before</li>  <li>How you can&nbsp;use recruitment agents&nbsp;to transform the number and quality of opportunities presented to you</li>  <li>The specific strategies for surviving and&nbsp;thriving in the current economy</li>  <li>Why&nbsp;LinkedIn&nbsp;is revolutionising the world of work - and how to use it effectively</li>  <li>How to&nbsp;influence your boss and colleagues&nbsp;so that they understand and buy into your ideas</li>  <li>How to&nbsp;access the hidden jobs market&nbsp;where the best career opportunities are to be found</li>  <li>The best way to&nbsp;directly approach the company&nbsp;you&#039;ve always dreamed of working for&nbsp;</li>  <li>Why 95% of people&nbsp;never achieve the success&nbsp;they want or deserve in their careers</li>  <li>How to&nbsp;think like the top 1%&nbsp;of successful people in the world</li>  <li>What you need to say in interviews&nbsp;to make the difference between success and failure</li>  <li>How to&nbsp;outperform all your peers&nbsp;with ease, using the precise strategies that Tom has used to sky-rocket his clients&#039; careers</li>  <li>How to get employers and&nbsp;agents coming to you&nbsp;with great opportunities, instead of you going to them</li>  </ul>  <p></p>  <p>Here&#039;s what some delighted clients have said about Tom and Angela&#039;s approach to Career Transition.</p>  <p>“I had the distinct pleasure of attending a couple of Tom’s career seminars recently while he was in Austin, TX. His presentations flowed with a mix of humor, science and concrete examples which kept me engaged and eager for the next nugget of wisdom. Among the many nuggets, Tom demonstrated how we can all access our genius and bring choice to our lives. Tom’s passion and ability to show how science can work for you in daily life is inspiring, energizing and uplifting. I highly recommend Tom for career advice or transition.” <span class=\"date\">January 18, 2012</span></p>  <p class=\"qualities\"><strong style=\"\">Top qualities:</strong>&nbsp;Great Results, High Integrity, Creative</p>  <p class=\"distance deg_1\"><span class=\"network-degree\"></span><a class=\"external-link\" title=\"View Eileen&#039;s Profile\" href=\"javascript:void(0)\" target=\"_blank\" rel=\"nofollow\" style=\"\">Eileen Wallace, ACSR</a>&nbsp;<em style=\"\"></em><br style=\"\">hired Tom as a Career Coach in 2012</p>  <p class=\"distance deg_1\">____________________________________________</p>  <p class=\"distance deg_1\">“Angela provided me with career transition consulting and my only regret was not finding her sooner! From the help re-writing my resume, to the worksheets that helped me to understand my key competencies (very useful for competency-based interviews), to understanding the importance of networking and LinkedIn. Every piece of information and advice Angela gave me was incredibly helpful and definitely got me out of my job search rut. In addition, her upbeat and positive attitude made it an all around pleasant experience working with her. Angela is the ultimate expert at what she does.” <span class=\"date\">June 11, 2011</span></p>  <p class=\"qualities\"><strong style=\"\">Top qualities: </strong>Great Results, Expert, High Integrity</p>  <p class=\"distance deg_1\"><a class=\"external-link\" title=\"View Jamelyn&#039;s Profile\" href=\"javascript:void(0)\" target=\"_blank\" rel=\"nofollow\" style=\"\">Jamelyn Hart</a><em style=\"\"></em> <br style=\"\">hired Angela as a Career Coach in 2011</p>  ", 
    "end_date": null, 
    "title": "Career Mind Mastery: Learn How To Get Your Dream Job", 
    "price": "40.00", 
    "instructors": "Angela R Loeb, Tom Cassidy", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/19331_7e81_7.jpg", 
    "course_url": "https://www.udemy.com/13x4xthe-science-of-career-transition/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-10T19:32:31Z"
}