{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Many people are unhappy or unsuccessful in their career--unnecessarily. That&#039;s why I created this course. It distills what I&#039;ve learned from having been a career coach to 4,800 clients with a 96% client-satisfaction rate.</p><p><strong style=\"\">Get what you need for career success</strong></p><p>In this course, you&#039;ll learn:</p> <ul style=\"\"><li>Two potent but not-obvious ways to find the right career for you. And if you&#039;re already in a career, these approaches will give you reassurance you&#039;re in the right career--or suggest that you might want to consider a change. </li><li>Best practices for landing a good job in a tight market. The standard, sterile resume, LinkedIn profile, and cover letter are not enough. You&#039;ll learn what works best <em style=\"\">today</em>. </li><li>How to find the right career training for <em style=\"\">you</em>--in or out of school. </li><li>Important but not obvious strategies for becoming successful in your career: managing stress, time, procrastination, and even your boss. </li></ul> <p><strong style=\"\">Why this course</strong></p><p>When I started out as a career counselor, almost 30 years ago now, I followed the standard advice: Give career &quot;tests&quot; , help clients write resumes and cover letters using job-seeker language like &quot;He drove profitability&quot; and &quot;She saved the company $9 ziillion.&quot; </p><p>The trouble is, that those don&#039;t work as well today yet, too often, that&#039;s still the advice given. And it&#039;s not enough to convert your resume into a LinkedIn profile and consider careers that are off-shore resistant. I created this course to help <em style=\"\">today&#039;s</em> career-minded person.</p><p><strong style=\"\">Join me</strong></p><p>I hope you&#039;ll join me and take this course. You&#039;ll find it jam-packed with not-obvious, helpful nugget. And it&#039;s enjoyable--no boring lectures, I promise!</p><p>And if you do your part, this course could well change your life. </p>", 
    "end_date": null, 
    "title": "Career Success, Step by Step", 
    "price": "40.00", 
    "instructors": "Marty Nemko", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508534_4df9_4.jpg", 
    "course_url": "https://www.udemy.com/getting-to-career-success-step-by-step/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T23:42:43Z"
}