{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><br></p>\n\n<p>Career Paces is a job search program designed to get you to the job interview stage of the job search process. </p>\n\n\n\n<p>The job search occurs in a series of stages. The first stage is finding opportunities to apply for. The second is the interview stage. The third is negotiation and final acceptance of an offer. Career Paces taps into the hidden job market to succeed in the first stage and get to that all important job interview.  </p>\n\n\n\n\n\n<p>Section one is preparation. This is identifying what employers you wish to apply for based on your skills, experience, and interests. You also work to identify the proper contact person through Linkedin and other resources. </p>\n\n\n\n\n\n<p>Section  two is action. This is where you develop your resume and Linkedin Profile services to get you ready for the job hunt. </p>\n\n\n\n\n\n<p>Next is the connection section. This is where you send your letter of introduction to the contacts in the companies and organizations you wish to work for. </p>\n\n\n\n\n\n<p>Next step is the section on execution. This is where you follow up the letter of introduction with your cover letter and resume. You also keep track of the contacts you sent out.</p>\n\n\n\n\n\n<p>Finally there is the section on solution. This is where you follow up with those contacts you have sent your resume to.  It is where you reflect on what worked and did not work.   </p>\n\n\n\n\n\n<p>The process offers the opportunity to do what is called rinse and repeat. If this round of potential employers did not work for you then you just see what adjustments need to be made and start the process over again.   </p>\n\n\n\n\n\n<p>Career Paces lets you take control of your job search in a proactive and manageable process. Make a difference in your job search by setting your own direction. </p>", 
    "end_date": null, 
    "title": "Career P.A.C.E.S.: Five Steps To Tap The Hidden Job Market", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/797888_41c1.jpg", 
    "course_url": "https://www.udemy.com/career-paces-five-steps-to-tap-the-hidden-job-market/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-19T11:35:34Z"
}