{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>Join the Web's Leading Professional Development Community!</strong></em></p><p><em><em>Course version v</em>ersion 3.3.1 released on February 1, 2016</em></p>  <p>  \t<strong>Present Yourself Like a Pro on Your Resume, LinkedIn® Profile, and in Interviews</strong>  </p>  <p>  \t                                                            You know how competitive the job market is and also that a great job is key to living a <strong>happy life,</strong> but you <strong>weren't taught</strong> <strong>how to job hunt</strong><strong> </strong>in school. After investing two or three afternoons or evenings learning to master the labor market and your professional presentation skills, you'll be able to qualify yourself for positions that pay more (one participant qualified themselves for a position paying $20,000/yr. more within 3 weeks), to source opportunities so that you don't waste your valuable time, and to present yourself articulately, with confidence, and with purpose. Think of it this way--you invest $249 and a few afternoons or evenings and within weeks you get:  </p>  <ul>  \t<li>A significant increase in your lifetime earnings</li>  \t<li>A meaningful professional network</li>  \t<li>The ability to connect with (almost) anybody</li>  </ul>  <p>  \t                            If you learn and use these strategies, this course is easily worth $30,000 to you in the form of increased pay, control over your career, and unlocked opportunities.  </p>  <p>  \t<strong>Beautifully Produced Videos and the Best Research Available</strong>  </p>  <p>  \t                                This collection of 150+ lectures, exclusive guides, templates, sample banks, and more addresses the <strong>full range of topics relevant for the modern leader</strong> including professional network cultivation and management, resume keyword optimization, professional presentation on LinkedIn®, and much more. The course designed following the structure used at the career management offices of the <strong>University of California at Berkeley</strong> and is used by the career centers at the <strong>EDHEC Global MBA</strong> program and <strong>California State University</strong> business schools. Each module leverages cutting-edge research from organizations like <strong>Harvard Business School</strong>, the <strong>McKinsey Consulting Group</strong>, and <strong>Duke University</strong>. As a premium subscriber to the course, you'll get lifetime access to:  </p>  <ul>  \t<li>150+ engaging, functional, research-driven videos presented in HD and designed by the animators at Eazl Studios in San Francisco</li>  \t<li>Pro-grade resume, cover letter, and LinkedIn® profile summary templates</li>  \t<li>Word tracks to use for e-networking, requesting professional recommendations, handing tough interview scenarios, and other tricky situations</li>  \t<li>Step-by-step guides on resume writing, resume keyword optimization, and advanced LinkedIn® profile building</li>  \t<li>Resume, cover letter, and LinkedIn® summary banks for a variety of professional backgrounds</li>  \t<li>and much more--this course is <strong>frequently updated</strong></li>  </ul>  <p>  \t                                You also have a <strong>30-day money back guarantee</strong> if you aren't 100% satisfied with our work. Enroll now and start creating the future you want.</p><p><em>Version release notes:</em></p><ul><li>January 2, 2015: What's New in Version 2.0<ul><li>Added the interview hacking cluster of modules</li></ul><ul><li>Added additional SideBYSides by request</li></ul></li><li>February 22, 2015: What's New in Version 2.2<ul><li>Added additional quizzes to support learning</li></ul><ul><li>Integrated private Facebook group access</li></ul></li><li>March 5, 2015: What's New in Version 2.3<ul><li>Did a sweeping review of SideBYSides and adjusted all audio issues on LinkedIn® SideBySides</li></ul></li><li>April 10, 2015: What's New in Version 3.0<ul><li>Added further study section on career planning, career technologies, and common resume challenges</li></ul><ul><li>There are all new intros that are much more fun and engaging!</li></ul><ul><li>Better reinforced learning with key learning outcomes and quizzes</li></ul></li><li>June 11, 2015: What's New in Version 3.1<ul><li>Added an segment of an interview with the Charles Hugh Smith, the economist and author, on the power of accrediting yourself in the modern economy.</li></ul><ul><li>Added four new sample resumes for you to use as you develop yours!</li></ul><ul><li>Added two new cover letters to the sample bank!</li></ul></li><li>August 5, 2015: What's New in Version 3.2<ul><li>Added the Guide to Post-Interview Follow Up (thanks for the suggestion Missy!). You can find it in Lecture 85.</li></ul></li><li>August 28, 2015: What's New in Version 3.2.1?\n<ul><li>Flow through to a few of the updates we've been making via the EazlVlog so that you can contextualize course concepts with real life scenarios and easy-to-use recipes.</li></ul></li><li>October 21, 2015: What's New in Version 3.2.2?<ul><li>Fixed an issue where the audio was creating blank space on two SideBYSide lectures. Thanks for helping us find the issue Cyrus!</li><li>Added an additional vlog link related to exporting your resume so that it works more seamlessly with the latest ATSs.</li></ul></li><li>December 22, 2015: What's New in Version 3.3?<ul><li>We've added a recording of the Practical Immigration Strategies for Working in the USA panel. This is a three-person panel discussion with Ari Sauer, a US-based immigration lawyer, Nick Livingston, a San Francisco-based technical recruiter, and Davis Jones, the co-founder of Eazl. Use this to dive into the world of US work visas and immigration strategies.</li></ul></li><li>February 1, 2016: What's New in Version 3.3.1?<ul><li>By popular request, we've created and uploaded a guide with sample interview questions, good responses, and other question prompts around specific work habits and practices. You can find it in lecture 77!<span></span></li></ul></li></ul>", 
    "end_date": null, 
    "title": "Career Hacking: Resume/CV, LinkedIn®, Interviewing, +More", 
    "price": "35.00", 
    "instructors": "Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266590_f175_12.jpg", 
    "course_url": "https://www.udemy.com/golden-gate-bridge/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T16:29:48Z"
}