{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\n\nThis is the Certified Battlefield Resume Methodology (BRM) Federal\nResume Writer course. This is an easy to follow, step-by-step, Federal Resume\nWriting tutorial. The video instruction taught in this course is directly\nlinked to each chapter within the Battlefield Resumes, LLC workbook called\n\"Operation: Federal Resume, 4-Battlefield Phases to a Targeted Federal\nRésumé.\" This course is for Resume Writers, Career Coaches, Career\nCounselors, VA Counselors, DVOPs, LVERs, Department of Labor Veteran assistance\nprograms, University and ROTC Career Counselors, as well as Military Transition\nAssistance counselors.  This program will\nhelp you show veterans that you are serious about understanding them and will demonstrate\nyour desire to assist them. This course will teach you how to help veterans,\ntransitioning active duty military personnel, federal government employees,\ndefense contractors and others in their search for federal employment. You will\nlearn how to help veterans relate their experiences to the civilian workforce\nand how to translate their skills to federal government employment. The\nCertified (BRM) Federal Resume Writer course (C-BRM-FRW) uses an easily\nidentifiable analogy between military doctrine and federal résumé writing. The\nC-BRM-FRW encourages you to use military tactics and strategy when helping\nveterans transition to the civilian workforce. If you want to learn and share the\nsecret to the HR screening process and want your veterans and clients to get “referred”\nto the Hiring Manager, you have to watch this video training program. Bruce\nshows you how the HR office evaluates resumes and categorizes resumes for a\ncertain GS Grade Level, as well as how to ensure that your client’s resume is evaluated\nat the highest salary (GS Grade Level) possible. He also shows you where to\nfind the criteria that the HR office uses when determining if your client’s resume\nshould be “referred” to the Hiring Manager and how to ensure that the same critical\ninformation is included within your client’s resume. Bruce will also walks you\nthrough the Hiring Manager’s evaluation process and how the Federal Government\nPosition Description (PD) is linked to the vacancy announcement, the KSAs, the Questionnaire,\nand the questions asked during the interview. If you are serious about helping\nveterans and you really want to help them get a federal job, the C-BRM-FRW course\nis a requirement and will demonstrate to all veterans that you are dedicated to\ntheir employment effort and have the desire and stamina to help them. Attain\nthe Elite Status of a Certified Battlefield Resume Methodology (BRM) Federal\nResume Writer so you can make sure that your client’s resume is more\ncompetitive than other applicants, as well as prepare them for your federal\ngovernment interview. </p><p><br></p>", 
    "end_date": null, 
    "title": "Certified (BRM) Federal Resume Writer course", 
    "price": "50.00", 
    "instructors": "Bruce Benedict", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447544_0442_6.jpg", 
    "course_url": "https://www.udemy.com/federal-government-resume-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-15T00:07:47Z"
}