{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t            En aquest curs faràs un recorregut per tot el procés de buscar feina: conèixer el mercat laboral, fer un autoanàlisi personal, crear un bon curriculum vitae, conèixer el currículum europeu i el que fa falta per anar a treballar a l&#039;estranger, preparar al carta de presentació i conèixer altres cartes que et poden fer servei, preparar un pla d&#039;acció i les seves tècniques i mètodes per a la cerca de feina, la cerca de feina per internet, xarxes socials com Linkedin, conèixer el procés de selecció, les proves de selecció i l&#039;entrevista, com preparar l&#039;entrevista i les preguntes més freqüents.  </p>  <p>  \t            Tot  això procurant una activa participació de l&#039;usuari ja que d&#039;ell depèn conèixer les seves habilitats i possibilitats per poder preparar correctament les tècniques i materials necessaris per fer més fàcil la possibilitat de trobar feina i ser contractat.  </p>  <p>  \t    Trobaràs vídeos explicant cada tema juntament amb el seu .pdf per acabar de complementar la informació. En alguns casos trobaràs annexes amb informació extra o documents que t&#039;ajudaran a preparar els documents que hauràs d&#039;entregar a les empreses.  </p>  <p>  \t    També trobaràs una agenda laboral fàcilment personalitzable que et facilitarà tot el procés de la cerca de feina.  </p>  <p>  \t    Està estructurat de manera que vagis avançant en el curs a mesura que avancis en la teva cerca de feina des del que hauràs de fer i saber primer i el que necessitaràs saber al final del procés. Trobaràs més de 5h d&#039;informació teòrica i pràctica que et facilitarà la dura tasca de trobar feina.  </p>  <p>  \t    Aquest curs és possiblement, el més complet de la xarxa ja que abasta tot el procés de buscar feina.  </p>", 
    "end_date": null, 
    "title": "Coaching laboral. Prepara't per trobar feina més fàcilment", 
    "price": "20.00", 
    "instructors": "Marta Alerm", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244828_6212_12.jpg", 
    "course_url": "https://www.udemy.com/coaching-laboral-preparat-per-trobar-feina-mes-facilment/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-17T08:26:29Z"
}