{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>                                                              A coach tutors or instructs a person to achieve a specific goal or skill. In baseball, a batting coach only focuses on the mechanics of hitting the ball. They spend time instructing the hitter how to change their swing to improve their performance. They give exercises and goals to the hitter that target the swing of the bat. </p><p> In the office environment, you may see similar coaches helping others improve a skill. They may be sales coaches or customer service coaches. No matter what the area of focus is, a coach specializes on improving one or two areas of development at a time.</p><p>Mentoring has a different purpose and goal. Mentoring is the act of guiding, counseling, and supporting. This is vastly different from coaching. It is fundamentally teaching. However, the objective is slightly different.<br></p><p>Mentorship is more voluntary in nature and is less formal than coaching. The mentor and protégé endeavor on a broad development goal like becoming a leader. Mentoring encompasses many complex areas of development.  </p><p>This Udemy course will show you how to better coach your employees to be high performers. Coaching is a process of relationship building and setting goals. How well you coach relates directly to how well you are able to foster a great working relationship with your employees through understanding them and strategic goal setting.</p><p>An easy-to-understand coaching model taught in this course will guide you through the coaching process. Prepare yourself to change a few things about yourself in order to coach your employees to a higher performance.</p><p><br></p>", 
    "end_date": null, 
    "title": "Coaching Employees For Higher Performance", 
    "price": "30.00", 
    "instructors": "Adam Karchoufa", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/720044_0e14.jpg", 
    "course_url": "https://www.udemy.com/coaching-mentoring-employees-for-higher-performance/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-07T21:09:05Z"
}