{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">UNISCITI A OLTRE 70 STUDENTI CHE HANNO GIA&#039; FREQUENTATO IL CORSO!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">&quot;Senza un&#039;ottima Cover Letter, il vostro CV non lo legge nessuno!!!&quot; </strong>  </p>  <p style=\"\">  \t       La <strong style=\"\">Cover Letter</strong> fornisce la prima impressione di voi ad un datore di lavoro.  </p>  <p style=\"\">  \t       La lettera di introduzione è quindi un documento importantissimo per aiutarvi nella ricerca lavoro all’estero.  </p>  <p style=\"\">  \t       La concorrenza per l’agognato posto di lavoro all’estero è diventata sempre più agguerrita e non potete più buttare giù due righe sole di accompagnamento al vostro CV.  </p>  <p style=\"\">  \t       La <strong style=\"\">Cover Letter</strong> rappresenta il primo ostacolo che dovete superare nella corsa ad ostacoli altresì chiamata ‘ricerca lavoro’.  </p>  <p style=\"\">  \t       Per fortuna vostra la maggior parte dei candidati non ha ancora capito che un’ottima <strong style=\"\">Cover Letter</strong> consente di distinguersi dalla massa di concorrenti.  </p>  <p style=\"\">  \t       Un’ottima Cover Letter fornisce la motivazione necessaria al datore di lavoro (che sta leggendo la centesima domanda di lavoro per un singolo posto….) di continuare verso la lettura del vostro CV.  </p>  <p style=\"\">  \t       La cruda realtà è che una <strong style=\"\">Cover Letter</strong> generica invoglia alla cestinatura dell’intera domanda di lavoro.  </p>  <p style=\"\">  \t       La difficoltà per alcuni di noi Italiani è che scrivere un’ottima Cover Letter in Inglese è reso ancora più difficile dalla relativa poca conoscenza della lingua.  </p>  <p style=\"\">  \t       Essere originali e brillanti in una lingua straniera è difficile soprattutto se non si è a conoscenza del ruolo e della struttura di una Cover Letter e del linguaggio da usare in essa.  </p>  <p style=\"\">  \t       Ho registrato 15 video per un totale di oltre 2 ore per mostrarvi i concetti più importanti per aiutarvi a creare una <strong style=\"\">Cover Letter</strong> che raggiunga l’unico obiettivo veramente importante: invogliare alla lettura del CV.  </p>  <p style=\"\">  \t       Grazie a questi video potrete scrivere con più fiducia in voi stessi una Cover Letter che vi avvicini al lavoro all’estero.  </p>  <p style=\"\">  \t       Fornisco esempi pratici delle frasi che potete usare per rendere la vostra Cover Letter più incisiva ed efficace.  </p>  <p style=\"\">  \t<strong style=\"\">Udemy offre il <span style=\"\">rimborso garantito entro 30 giorni!</span></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Clicca </strong>sul bottone &#039;Segui questo corso&#039;, in alto a destra, <strong style=\"\">adesso</strong>... con ogni ora che passa ti allontani dal tuo futuro lavoro all&#039;estero.  </p>", 
    "end_date": null, 
    "title": "Come scrivere una lettera di presentazione in Inglese", 
    "price": "25.00", 
    "instructors": "Mr Aldo Mencaraglia", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/192036_3b58_3.jpg", 
    "course_url": "https://www.udemy.com/come-scrivere-una-lettera-di-presentazione-in-inglese/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-01T00:56:51Z"
}