{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>La prima cosa da fare quando si vuole cercare <strong style=\"\">lavoro in Francia</strong>, è adattare il proprio CV ai criteri del posto: forma e contenuti di un CV francese infatti non corrispondono a quelli italiani e/o europei. </p><p>Grazie a questo corso vedrai come è fatto un <strong style=\"\">CV alla francese</strong>, imparerai a costruire il tuo per renderlo attraente agli occhi di un recrutatore francese e capirai quali sono gli errori da non fare.</p><p><strong style=\"\">Impariamo Insieme Come Costruire Un CV Alla Francese</strong></p><ul style=\"\"><li>Riceverai le informazioni di base per capire la differenza tra un CV italiano e uno francese</li><li>Imparerai a strutturare il CV in modo che non venga subito cestinato</li><li>Studierai le varie sezioni che compongono il CV e come completarle al meglio.</li></ul><p>Questo corso è dedicato a tutti quelli che vogliono cercare lavoro in Francia e che hanno bisogno di adattare il loro CV ai criteri francesi.</p><p>Le informazioni che troverai sono utilissime <strong style=\"\">anche se non parli ancora francese</strong>! Puoi infatti creare una struttura alla francese, ma in italiano!<br style=\"\"></p><p>Ho strutturato il corso alternando la <strong style=\"\">teoria </strong>alla <strong style=\"\">pratica</strong>: per ogni sezione del CV ci sarà prima un video in cui ti spiego le regole generali da seguire e poi ti farò vedere come metterle in pratica su Word.</p><p>Alla fine del corso troverai inoltre a tua disposizione tre <strong style=\"\">modelli di CV da scaricare</strong> e tanti link utili per raggiungere il tuo obiettivo.</p><p style=\"\">Buon lavoro!</p>", 
    "end_date": null, 
    "title": "Come scrivere un CV \"alla francese\"", 
    "price": "50.00", 
    "instructors": "Elena Italiani", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380160_4e4d_6.jpg", 
    "course_url": "https://www.udemy.com/come-scrivere-un-cv-alla-francese/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T17:27:37Z"
}