{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t <strong style=\"\">UNISCITI A OLTRE 140 STUDENTI CHE HANNO GIA&#039; FREQUENTATO IL CORSO!</strong>  </p>  <p>  \t       Grazie al corso ‘<strong style=\"\">Come </strong><strong style=\"\">Scrivere il Curriculum in Inglese per Trovare Lavoro all&#039;Estero</strong>’ diminuite il rischio di essere eliminati subito perché condivido con voi gli errori più comuni che portano il selezionatore a scartare il vostro <strong style=\"\">CV</strong> e esclamare “next!”, ”avanti il prossimo!”  </p>  <p>  \t            Una volta completata la visione di tutti i moduli potrete rispondere ad un annuncio di lavoro nel mondo anglosassone con più fiducia in voi stessi ed in cosa offrite. Il selezionatore riuscirà più facilmente a concentrarsi su di voi piuttosto che essere distratto dalle “stranezze” del vostro <strong style=\"\">CV</strong>.  </p>  <p>  \t            Il corso consiste di video altamente focalizzati attraverso i quali condivido il mio <strong style=\"\">CV</strong>, mostrandovelo attraverso la registrazione dello schermo del mio computer.  </p>  <p>  \t            In ogni video affronto un aspetto molto specifico della stesura di un <strong style=\"\">CV</strong> per il mondo del lavoro anglosassone. Una volta completata la visione di tutti i video sarete in grado di compilare il vostro <strong style=\"\">CV</strong> secondo le nozioni e gli standard che ogni datore di lavoro si aspetta dai candidati.  </p>  <p>  \t         Attraverso i video che ho preparato per voi vi renderete indipendenti, imparando cosa bisogna fare per compilare un <strong style=\"\">CV in Inglese</strong>.  </p>  <p>  \t         Questo <strong style=\"\">investimento in voi stessi</strong> si ripagherà centinaia se non migliaia di volte durante la vostra carriera all’estero!  </p>  <p>  \t         A chi serve il corso…..  </p>  <ul style=\"\">  \t<li style=\"\">a chi vuole lavorare all’estero</li>  \t<li style=\"\">a chi NON ha un <strong style=\"\">CV in Inglese</strong></li>  \t<li style=\"\">a chi ha un <strong style=\"\">CV Europass in Inglese</strong></li>  \t<li style=\"\">a chi spedisce centinaia di <strong style=\"\">CV in Inglese</strong> all’estero senza risultati positivi</li>  </ul>  <p>  \t         A chi non serve il corso…..  </p>  <ul style=\"\">  \t<li style=\"\">a chi non vuole investire in se stesso</li>  \t<li style=\"\">a chi vuole che qualcuno scriva loro il <strong style=\"\">CV in Inglese</strong></li>  \t<li style=\"\">a chi non vuole trovare lavoro in nazione dove si parla l’Inglese</li>  \t<li style=\"\">a chi ottiene inviti a colloqui di lavoro all’estero facilmente</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Udemy offre il rimborso garantito entro 30 giorni!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Clicca</strong> sul bottone &#039;Segui questo corso&#039;, in alto a destra, <strong style=\"\">adesso</strong>... con ogni ora che passa ti allontani dal tuo futuro lavoro all&#039;estero.  </p>", 
    "end_date": null, 
    "title": "Come scrivere il CV in Inglese per trovare lavoro all'estero", 
    "price": "25.00", 
    "instructors": "Mr Aldo Mencaraglia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/180100_ca3d_6.jpg", 
    "course_url": "https://www.udemy.com/come-scrivere-il-curriculum-in-inglese/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-11T00:23:50Z"
}