{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Commercial awareness means an understanding of organizations and the business world. It's prized by recruiters in every industry sector - it's the <em>NUMBER 1 SKILL</em> employers look for when hiring.</p><p>But it's not something you get taught at school or university. This means people like YOU could be missing out on multiple opportunities to advance your career.</p><p><strong>Boost your commercial awareness - you'll reap IMMEDIATE benefits.</strong></p><p>Commercial awareness gets you hired, and it gets you promoted. </p><p>It's THE key differentiator between those who are successful in their life and career, and those who never fulfil their potential. </p><p>In our unique course, businessman and entrepreneur Ed Thompson gives you a complete overview of commercial awareness. You'll learn skills, models and techniques that will help you both GET a great job, and SOAR when you have one.</p><p>By the end of the course, you will:</p><ul><li>have an essential understanding of all aspects of commercial awareness</li> <li>be significantly more employable </li> <li>understand how to USE commercial awareness to advance your career, bringing immediate benefits both at interviews and on the job</li></ul><p><strong>Our Commercial Awareness course is the ultimate passport to success in your career. </strong></p><p>We'll cover, together, the critical business insight that really matters.<span></span></p><p>First we'll explore what commercial awareness is, and why it's so vital for career success. It's something that's still a LOT more familiar to employers than to (young) job applicants.</p><p>Next, we'll dive deep inside an organization, giving you an essential understanding of how businesses are structured, funded, and operate on a day to day basis.</p><p>Then we'll review organizations in context, further refining your business understanding and helping you make better and more fruitful career decisions -- starting from NOW. </p><p>Finally you'll find out how to apply everything you've learned - to get hired, and/or to excel at the job you're already in. </p><p>Start learning now and begin the ultimate path to career success!</p>", 
    "end_date": null, 
    "title": "Commercial Awareness", 
    "price": "20.00", 
    "instructors": "up timize", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551166_a0f7_2.jpg", 
    "course_url": "https://www.udemy.com/commercial-awareness/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T16:45:01Z"
}