{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Learn how future leaders of the world&#039;s most valuable and iconic companies like Intel and BMW are now using the principles of Conscious Business and Authentic Leadership to create workplaces that truly engage all stakeholders, deliver great products and generate off the charts financial returns.  </p>  <p style=\"\">  \t<strong style=\"\">Go through this step-by-step program to create a purpose-driven, fulfilling career by developing your authentic leadership personality.</strong>  </p>  <p style=\"\">Learn about your Authentic Power, and how to be successful without feeling it is work</p><p style=\"\">Create effective and inspired relationships and business teams</p><p style=\"\">Make a difference with your work and your business</p><p style=\"\">Become a Conscious Leader - wherever you work in an organization</p>      <p style=\"\">  \t<strong style=\"\">Become part of the movement: Change the way we work and conduct business</strong>  </p>  <p><em style=\"\">“The CBI Leadership Program did an outstanding job of helping me transition from a very dim outlook to a positive one. The transition to a new leadership model has created an incredible impact in my team.&quot;<br style=\"\"></em><em style=\"\">H.M. - VP - Intel Corporation</em></p><p style=\"\">  \t  In this free introduction you will understand the methodology and approach of the <em style=\"\">Conscious Business Institute Leadership Program</em>. You will learn why some companies are able to build inspiring cultures that bring out the best in people – and others aren&#039;t.  </p>  <p style=\"\">  \t  You will get an insight into a <em style=\"\">new Model of Success</em>, which is necessary if we want to work and build more inspiring, ethical and sustainable businesses. This introduction of the CBI Leadership Program provides an outline of each program module, what you will take away, and how you can apply the nuggets of wisdom to improve your work &amp; life. This unique program is chosen by corporations including Intel, BMW or Allianz Insurances to develop their future leaders.  </p>  <p style=\"\">  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p style=\"\">  \t  This program transforms the way you work and conduct business. Developed by consciousness, human behavior and neuroscience experts, executives and venture capitalists, this step-by-step program has changed the lives of many hundreds of top executives in the US, Asia, Europe, Australia and Africa.  </p>  <p style=\"\">  \t  Now available online, the Conscious Business Institute Leadership program consists of 5 modules, over 150 lectures and 20 hours of video content, supported by exercises and the unique <em style=\"\">Conscious Business Institute Personality Assessments (Module 1)</em>.  </p>  <p style=\"\">  \t  We developed this program because we, ourselves, sat in our offices at one time, wondering whether there&#039;s a better way to work and succeed. Well – there is! This is the first step-by-step program that helps you and your company transform towards a more conscious, authentic and fulfilling way to succeed.  </p><p style=\"\"><em style=\"\">&quot;I am grateful for the new freedom I have found, the relaxation in my mind and feelings. The greatest accomplishment is that I lost my fear of not being enough, that I gained more self-confidence. I thank you so much for your help with this program.&quot;<br style=\"\"></em><em style=\"\">H.B. - VP - Siemens Corporation</em></p><p style=\"\"><strong style=\"\">After completing this program, we will provide you with an option to make a living by transforming the way we work and do business, yourself.</strong></p>  <p style=\"\">  \t<strong style=\"\">Module 1 </strong>starts with you as an individual. It provides you with a deep aha! of how you tick: your gifts, your talents, your authentic personality, your life purpose, and what keeps you away from combining career success with purpose &amp; fulfillment.  </p>  <p style=\"\">  \t  In <strong style=\"\">Module 2</strong>, you will understand what it takes to build effective and deeply rewarding relationships; how to deal with conflicts and pressure situations, and how to build empowered and engaged teams in any business.  </p>  <p style=\"\">  \t<strong style=\"\">Module 3</strong> determines how you and your business can make a difference in the world, so that you build more of a “movement&quot; than a company – an organization people <em style=\"\">want</em> to be involved with. You will also get a step-by-step approach for building an inspiring business culture in your team - no matter where you work in an organization.</p>  <p style=\"\">  \t  In <strong style=\"\">Module 4</strong>, you will understand how you can run an organization based on Conscious Business principles. What needs to change to keep a company running in a more conscious and sustainable way. You will learn from top leaders how they keep their business inspired, effective, and conscious.</p>  <p style=\"\">  \t<strong style=\"\">Module 5</strong> provides you with the Leadership Model that&#039;s necessary if you want to show up as a Conscious Leader. You will learn about the traits and qualities of a Conscious Leader, and how you can keep a conscious business culture alive in your team.  </p><p style=\"\"><em style=\"\">&quot;I can&#039;t begin to tell you both how grateful I am that I completed the CBI Program. I feel a renewed sense of energy to take on the world with my talents and my purpose.&quot; </em><em style=\"\">Teena H. - Entrepreneur - Australia</em></p>  <p style=\"\">  \t<strong style=\"\">Join a movement of thousands of professionals and executives around the world. Create a purpose-driven and fulfilling career, and help change the way we conduct business in the world. </strong>  </p><p style=\"\">Peter Matthies<br style=\"\"></p><p>What is the target audience:</p><ul style=\"\"><li>Any professional who wants to work and do business in a more inspiring and fulfilling way</li> <li>Entrepreneurs and business leader who want to create more inspiring &amp; engaging business cultures</li> <li>Any business professional who wants to develop authentic leadership skills and emotional intelligence</li><li>Any business executive who wants a fresh approach for dealing with a VUCA business environment (volatility, uncertainty, complexity, ambiguity).</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">What do you need to bring to this course:</p><ul style=\"\"><li>An open mind for new insights &amp; perspectives on business, success &amp; human behavior.</li><li>A willingness to try out new things - even though they might not fit the mold</li><li>A genuine desire to improve the way we operate and work as individuals and within organizations.</li></ul>", 
    "end_date": null, 
    "title": "Conscious Business: Work & Succeed with Purpose & Fulfilment", 
    "price": 0, 
    "instructors": "Peter Matthies", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430134_3730_7.jpg", 
    "course_url": "https://www.udemy.com/conscious-business-introduction/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T17:49:36Z"
}