{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is a \"crash course\" for Federal Resume writing using the Battlefield Resume Methodology. This is an easy to follow, step-by-step, Federal Resume Writing course that will help you to quickly identify the mandatory requirements when submitting a federal resume. The video instruction taught in this course is directly linked to the Battlefield Resumes, LLC workbook called \"Operation: Federal Resume, 4-Battlefield Phases to a Targeted Federal Résumé.\" This course will help all who are in their search of federal employment. If you want to learn the secret to the HR screening process and want to get “referred” to the Hiring Manager, you have to watch this video training program. Bruce, the President of Battlefield Resumes, LLC, shows you how the HR office will evaluate your resume and how they evaluate you for a certain GS Grade Level (salary), as well as how you can ensure that your resume is evaluated at the highest salary (GS Grade Level) possible. He also shows you where to find the criteria that the HR office uses when determining if your resume should be “referred” to the Hiring Manager and how to ensure that the same critical information is included within your resume. Bruce will also walks you through the Hiring Manager’s evaluation process and how the federal government Position Description (PD) is linked to the vacancy announcement, the KSAs, the Questionnaire, and the questions asked during the interview. If you want a federal job and only have limited time available, you have to watch this video \"crash course.\" Make sure that your federal government resume is more competitive than other applicants.</p>", 
    "end_date": null, 
    "title": "Crash Course in Federal Resume Writing", 
    "price": "20.00", 
    "instructors": "Bruce Benedict", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668286_de6f.jpg", 
    "course_url": "https://www.udemy.com/federal-resume-writing-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T23:21:45Z"
}