{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Will Transition From Free To Paid Effective December 23, 2015</strong> <br></p><p>You may have heard of LinkedIn before. But you maybe still wonder what it can do for you.</p>  <p><em><strong>Simply put, LinkedIn can be used to find job opportunities and expand your business.</strong></em></p>  <p>LinkedIn is the world’s largest professional networking site. It currently has almost 400 million users and is a powerful way to make connections with people you would like to work for, do business with or to find new clients. </p>  <p>It is in part a social network, a professional networking site and a job board. It is also a place that people can come together to share their knowledge and expertise and raise their own profile in the industry. </p>  <p><em><strong>And it all starts with a great profile.</strong></em></p>  <p>The Linkedin profile is the story of you and your professional career. It is a testament of your personal brand and status in your field.</p>  <p>The true power of LinkedIn lies in the networks that you can form and the ability to become visible in your industry. LinkedIn is used almost entirely by professionals and decision makers and so it is a great place to find opportunities and to raise your own profile. </p>  <p>You can find success like many people if you are willing to put the work will find that you quickly stand out.</p>  <p>But it all starts with a great profile. With this course you will learn:</p>  <ul><li>How to make a great first impression with your profile</li><li>Tell your professional story with your accomplishments and experience</li><li>Develop your network to unlock opportunities for career and business </li></ul>      <p>Your profile is the first step with success on Linkedin. This course will show you how to make a profile that makes an impact.   </p>", 
    "end_date": null, 
    "title": "Create A Linkedin Profile That Gets You Noticed", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686608_c4e1.jpg", 
    "course_url": "https://www.udemy.com/create-a-linkedin-profile-that-gets-you-noticed/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T01:32:56Z"
}