{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        Often we leave our personal growth to chance. In this course I will talk to you about the importance of creating a personal development plan for focused growth. This practice can be used in your personal and professional life. Create your own career path!  </p>  <p style=\"\">  \t       This course was designed for leaders wanting to bridge current skill sets and future skills, for your prospective growth within a company. This course is divided into six individual sections. The section may include; lectures, quizzes, homework, and examples of draft development plans. The goal of this course is to enable leaders to easily generate a development plan for their career path.  </p>  <p style=\"\">  \t                After the course is completed, you should be able to:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t                ·Understand the importance of creating your own written development plan  \t</p>  \t<p style=\"\">  \t\t                ·Do detective work for a plan  \t</p>  \t<p style=\"\">  \t\t                ·Understand the sections included in a written development plan  \t</p>  \t<p style=\"\">  \t\t                ·Learn types of skills sets and how people learn  \t</p>  \t<p style=\"\">  \t\t                ·Create a list of current strengths and future skills  \t</p>  \t<p style=\"\">  \t\t                ·Create and write a plan for yourself  \t</p>  \t<p style=\"\">  \t\t                · Understand Deadlines/Timelines  \t</p>  \t<p style=\"\">  \t\t             ·Understand the importance of a mentor or coach  \t</p>  </ul>  <p style=\"\">  \t                The course is work at your own pace and has open discussions. If you want a step-by-step process for helping grow your career this is the course for you.  </p>", 
    "end_date": null, 
    "title": "Create your own career path!", 
    "price": "35.00", 
    "instructors": "Sarah Andreas, Billie Jo Dawson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356432_447f_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-career-path/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T20:05:47Z"
}