{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>This is the only course on resume writing you will ever need. No fluff. Real world perspectives from a real world technology industry veteran.</strong></p><p><strong>24th November 2015 Updates: </strong></p><ul><li>Real world job postings to help you get started and stay on track</li><li>Differences between your professional achievements and accomplishments explained</li></ul><p>  \t<strong>Course Bonuses When You Take This Course Now:</strong>  </p>  <ol>  \t<li>Power Resume Framework</li>  \t<li>Proven Resume Templates</li>  \t<li>Effective Resume Keywords</li>  \t<li>Personal Critique of Your Resume</li>  \t<li>Access to Power Resume Mastermind Community</li>  \t<li>Power Resume Focus Session Every Month</li>  </ol>  <p>  \t<strong>Do you want to have a resume that brings in multiple interview offers your way?</strong>  </p>  <p>  \t<strong>Do you want to have a resume that recruiters and hiring managers love?</strong>  </p>  <p>  \t<strong>Listen. Your resume is your <em>best bet</em> to get ahead in your professional career.</strong> Its how you advertise yourself in the employment market.  </p>  <p>  \t    And contrary to what you think, or may have heard – <strong>an irresistible resume is not just necessary for your success – it's mandatory.</strong>  </p>  <p>  \t    My name is Kapil Apshankar. I am a best-selling author, a technology entrepreneur and a career transformation coach. Over the last 15 years I have interviewed thousands of individuals, hired hundreds of them – and in process scanned and read many thousand resumes.  </p>  <p>  \t<strong>When it comes to resumes, I know what works and what doesn't.</strong>  </p>  <p>  \t<strong>In this course I will teach you how you can write your own irresistible resume in sixty minutes or less.</strong> You will learn a proven system that literally helps your resume write itself. Along the way, you will master the Power Resume Framework that I created to crank out irresistible resumes on demand. And I will give you proven resume templates that make writing an irresistible resume a breeze.  </p>  <p>  \t<strong>Join me for this course, and I will help you make you resume sing and shine out like never before.</strong> I look forward to seeing you in the classroom.  </p>", 
    "end_date": null, 
    "title": "Create an Irresistible Resume for Your Dream Job", 
    "price": "20.00", 
    "instructors": "Kapil Apshankar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410548_2a2f_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-irresistible-resume-in-60-minutes-or-less/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T05:33:35Z"
}