{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Dear Future Partner,</strong></p><p>Do you feel like your career is being dictated by your manager, or others that don't see what you love to do? Are you looking for ways to generate a better income? This course will give you that edge above your competition using some proven mind hacks for career growth. It's an authentic, transparent, approach that has actually been proven to work with various career types. </p><p> <strong style=\"\">Here's Why...</strong><strong style=\"\"><br style=\"\"> <br style=\"\"> </strong>I've been a <em style=\"\"><strong style=\"\">Huffington Post Career writer, TLNT The Business of HR career writer, and have lead the build of job recruiting platforms</strong></em>. I will be bringing this full proven knowledge base to you in this course. Inside this course you'll receive educational techniques to grow your career, but also some <strong style=\"\"><em style=\"\">worksheets and playbooks</em></strong> you can put into real action. These resources were developed using real life scenarios that have increased salaries, changed careers, and improved personal branding. The best part is that these resources will not leave your side, and you can always come back to get a refresh. <strong style=\"\"><em style=\"\">These again are proven solutions that have been used across various types of careers</em>.</strong></p><p><strong style=\"\">Key Features...</strong></p><ol style=\"\"><li><strong style=\"\">Roughly 2 Hours Of Content - Planning Tools That Have SIMPLY WORKED</strong></li><li><strong style=\"\">Approachable &amp; Conversational Style To The Curriculum</strong></li><li><strong style=\"\">Content from A Proven Contributor To Career Websites &amp; Blogs</strong></li><li><strong style=\"\">Content From Someone Who Has Made Multiple Successful Career Changes</strong></li></ol><p>I've just outlined the key highlights of why this course will give you a roadmap for true career change. <strong style=\"\">Please</strong> <strong style=\"\">check the full list of topics yourself</strong>. Also, I want you to see the real value of this course before making any investment. This is why <strong style=\"\">I've included a couple free videos you can watch RIGHT NOW.</strong><br style=\"\"></p><p style=\"\"><strong style=\"\">What Else Will You Receive?</strong></p><ol style=\"\"><li><strong style=\"\">Competitive edge over other candidates in your respective field of choice</strong></li><li>Worksheets and blueprints for an action plan</li><li>Strategic consulting on how to move your career upward</li><li>Techniques for a successful interview and salary discussions</li><li>Greater confidence in yourself and career motivation</li><li>Strategic consulting on making yourself indispensible, and fearless</li><li>Real life techniques that have been used successfully for career growth</li><li>Ideas to create your own personal brand</li><li>Potentially more videos and courses over time to build further</li></ol><p><strong style=\"\"></strong> <br style=\"\"> I hope we get to work together to find your best career path.<br style=\"\"></p><p>Patrick</p>", 
    "end_date": null, 
    "title": "Create a Career Plan in 90 days", 
    "price": "20.00", 
    "instructors": "Patrick Richard", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185424_1dc7_5.jpg", 
    "course_url": "https://www.udemy.com/learn-the-secret-sauce-of-making-a-successful-career-move/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-19T20:44:32Z"
}