{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you are like most people it probably happened to you tens of times to send your résumé hoping to run for a job you dreamed of ... <strong>only to never be called and invited for an interview.</strong></p><p>And, you know, <strong>people who receive the résumés usually get tens or hundreds of résumés </strong>for the same position. It is physically impossible for them to read all the résumés <strong></strong>and talk with all the candidates.</p><p>Usually what they do - I know from my own experience, I talked with thousands of people and managed hundreds of interviews in the last 15 years - what they usually do is <strong>they choose the résumés that can be easily understand </strong>and the candidates are interesting.</p><p>Even if they skip some candidates this way, they still have enough of them...</p><p>Now, the way they choose some résumés and ignore others is thet the first ones are... easy to read and understand. And they look <strong>professional</strong>, they are <strong>eye catching.</strong></p><p>Probably you saw many times other people's résumés on internet and thought <em>\"it looks awesome and this guy doesn't even have my experience, but I cannot have a résumé like his - it is too difficult for me and paying a graphic designer would cost a fortune...</em>\"</p><p>This is true... and not quite. </p><p>It is true that paying a designer to design you an eye-catching résumé would cost you a lot of money. </p><p>But it is not true you cannot do it by yourself.</p><p>Since professional looking résumés are sofisticated and radically enhance you the chance to be invited to a discussion for the job you ran for (assuming you have the needed professional experience) having your own professional, eye caching résumé usually helps a lot in<strong> positioning you as an authority</strong> in your and <strong>inspire trust.</strong></p><p>This course is a beginner course on<strong> how to create professional looking résumés to use when running for a job</strong> by using Canva's free résumé design tool. It is intended for people who want to position themselfes and be seen as an authority (like ...\"<em>that guy know what he talks about, look what stunning résumé is he able to send</em>..\")</p><p>You don't need any graphic design experience, just start from zero and create an amazing résumé that looks awesome.<br></p><p>You will learn</p><ul><li>how to create your Canva account,</li><li>how to use the design dashboard,</li><li>how to add images,</li><li>how to format the text areas,</li><li>how to find out already prepared text blocks that look professional,</li><li>how to add shapes and eye catching graphic elements that enhance a résumé,</li><li>how to create a résumé that will make people wanting to know you and find more about you (from my own experience after seing thousands of résumés),</li><li>how to choose the right type of résumé for you and</li><li>how to export your résumé from Canva to a format you can send online</li></ul><p>By taking it, you will be able to understand and master the art of<strong> creating high quality résumés in the step by step demonstrations</strong>. </p><p>In your own pace.</p><p>In this course you will get step by step video explanations to help you understand in a comfortable way all about creating eye catching, professional résumés in minutes, for free and without any previous graphic experience. You just need to know your own professional experience and I assume you know it well.<br></p><p>The entire course can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next... <strong><u>click the Take this Course button top right</u></strong> and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p>Stop struggling with boring résumés everybody ignores and start mastering résumé design in minutes, just like a pro!</p><p><strong>Thank you for reading this and learning about my course </strong>... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE </strong>to get started!<br></p>", 
    "end_date": null, 
    "title": "Create Professional Looking Résumés Even If Just Started!", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642654_3afd_4.jpg", 
    "course_url": "https://www.udemy.com/professional-resumes-with-canva-resume-curriculum-vitae/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T17:58:18Z"
}