{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>LinkedIn is today one of the world´s larget professional network and it´s becoming a necessary tool for those who crave great career opportunities. But first, it is necessary you know how to use it and have a great profile.</p>\n<p><em><strong>Creating an All-Star LinkedIn Profile</strong> </em>is a 2 hours course that will teach you the necessary steps to achieve a fantastic profile.</p>\n<p>I challenge you to perform the steps of this course and see how your profile will skyrocket to the highest level.</p>\n<p>These are the same steps that I used to have my profile in the All-Star level (I prove this in the introduction of the course).</p><p><br><strong>See what you get with this course:</strong><br></p>\n<p>- Learn all the steps to <strong>build your profile and let it at All-Star level.</strong><br>- Discover the <strong>technique of adding several people with few clicks.</strong><br>- Learn how to <strong>build a profile header that sells you and your business.</strong><br>- <strong>Create your profile in other languages</strong> and do not miss more international opportunities.<br>- <strong>Learn tactics to show up in searches.</strong><br>- <strong>Bonus: 22 secrets Forbes discovered that LinkedIn does not tell you.</strong></p>\n<p>These tactics are guaranteed to function even if you are a beginner on LinkedIn.</p>Do not waste time, get the course and start today to jumpstart your career with an All-Star profile!", 
    "end_date": null, 
    "title": "Creating an All-Star LinkedIn Profile", 
    "price": "20.00", 
    "instructors": "DUOSHIRO Learning", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656618_4d8d_2.jpg", 
    "course_url": "https://www.udemy.com/creating-an-all-star-linkedin-profile/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-31T22:59:54Z"
}