{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>O LinkedIn é hoje uma das maiores redes mundiais de profissionais e está se tornando uma ferramenta necessária para aqueles que almejam grandes oportunidades de carreira. Mas primeiro, é necessário você saber usá-la e ter um ótimo perfil.</p><p><strong><em>Criando um Perfil Campeão no LinkedIn</em></strong> é um curso de 2 horas que vai te ensinar os passos necessários para alcançar um perfil fantástico.</p><p>Eu te desafio a realizar os passos desse curso e ver como o seu perfil subirá rapidamente para o nível mais elevado.</p><p><span></span>Estes são os mesmos passos que eu usei para ter o meu perfil em nível Campeão (eu provo isso já na introdução do curso).</p><p><strong>Veja o que você ganha com este curso:</strong></p><ol><li>Aprenda todos os passos para <strong>construir o seu perfil e deixá-lo em nível Campeão</strong>.</li><li>Descubra a <strong>técnica de adicionar</strong><strong> várias pessoas com poucos cliques</strong>.</li><li>Aprenda a como construir um <strong>cabeçalho de perfil que vende você e sua empresa</strong>.</li><li><strong>Crie seu perfil em outros idiomas</strong> e não perca mais oportunidades internacionais.</li><li>Saiba <strong>táticas para aparecer mais nas buscas.</strong></li><li><strong>Bônus: 22 segredos que a Forbes descobriu</strong> e que o LinkedIn não te conta.</li></ol><p>Essas táticas são garantidas de funcionar, mesmo se você é um novato no LinkedIn.</p><p><u></u><strong><em><u>Não perca mais tempo, adquira o curso e comece hoje mesmo a alavancar a sua carreira com um perfil campeão!</u></em></strong></p><p><span>======================================================================</span></p><ul><li><strong>Atualização 06/11/2015 - Melhorias no áudio (remoção de ruídos do ambiente).</strong></li></ul>", 
    "end_date": null, 
    "title": "Criando um Perfil Campeão no LinkedIn", 
    "price": "20.00", 
    "instructors": "DUOSHIRO Learning", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647712_9c81.jpg", 
    "course_url": "https://www.udemy.com/carreira-criando-um-perfil-de-linkedin-de-nivel-campeao/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T11:17:44Z"
}