{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">OVER 1900 STUDENTS HAVE ALREADY BENEFITED FROM THIS COURSE</strong>  </p>  <p style=\"\">  \t    If you want to land a job fast, then you need a high quality resume and strong personal branding that will demonstrate to employers why you deserve an interview. You only have seconds to make a first impression before your resume ends up on the reject pile.  </p>  <p style=\"\">  \t  With this course you will learn what you need to do to make your resume and LI profile stand out from the crowd and impress recruiters. You need to show them your unique selling point; what you bring to the table if they hire you. Fail to do this and you will quickly be looked over.  </p>  <p style=\"\">  \t                    I have a track record in creating executive CVs and resumes that lead to job interviews. I know this because of the great feedback I have had from my clients over the years across multiple industries. Having interviewed 1000s of candidates and shortlisting for multiple jobs, I know how the best resumes deliver outcomes.  </p>  <p style=\"\">  \t                    In this training, I apply over 15 years worth of HR experience to teach you how to create a compelling CV and LI profile that will help you secure your dream job and build professional credibility.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Using a blend of visual resume and LI examples and detailed commentary, I will take you through the creation process step by step so that you see for yourself the value of the advice I am providing. I use real examples of winning resumes and actual linkedin profiles that I have designed for clients.</em></strong>  </p>  <ul style=\"\">  \t<li style=\"\">With +20 modules and well over an hour of materials, you will gain incredible value from this course and come away inspired to create your new resume and Linkedin profile.  </li>  \t<li style=\"\">In addition, I am also giving you some FREE RESOURCES as you will also be able to download some professional resume and cover letter templates as part of the course</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Feedback from my CV clients:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">&quot;Absolutely A+ job!! Results were well above my expectations!!! Thanks Steve&quot; - Micah, Detroit, US</em></li>  \t<li style=\"\"><em style=\"\">&quot;Working with Steve was a pleasure.  I have never seen a resume like this before and I am truly proud to be sending this out to recruiters&quot; - Mark, Texas, US</em></li>  </ul>", 
    "end_date": null, 
    "title": "CV and Resume Job Success", 
    "price": "30.00", 
    "instructors": "Steven Green", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/293130_0d38_4.jpg", 
    "course_url": "https://www.udemy.com/creating-a-powerful-cv-or-resume-that-lands-job-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-03T12:29:50Z"
}