{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>***Last update November 2015***, it includes TRUE CV AND COVER LETTER SAMPLES for the UNITED NATIONS and I also added a Bonus Section with my true sample CV and Cover Letters to stand out of the 10,000+ online applicants to the WORLD BANK Analyst Program.</p><p>This course intends to help students, future students or even young professionals to build their career path so that they maximize their chances of getting an internship at the United Nations, and hopefully later to any of their dream company or organization. During the course, we are going to get through what a young student needs and does not need to achieve his/her goal of getting an internship at the United Nations. You are going to get plenty of ideas on what you could do to boost your CV.<br></p><p>Further than that, you will have access to 2 sample CVs (Bachelor and Master level) and 3 sample Cover Letters (1 Bachelor level, 2 master level for different positions). These are authentic application documents that I have used in the past and thanks to which I got contacted back for 6 out of 7 U.N. internship positions to which I had applied.</p><p>The course is meant to motivate you, and to show you that you too can get an internship at the United Nations in order to boost your future career. </p><p>You will also have a quick overview of the different internship possibilities at the U.N. and of the respective eligibility criteria, as well as of the required document formats for your CV and Cover letter.</p>", 
    "end_date": null, 
    "title": "CV/Resume, Cover Letter: get into the U.N.& World Bank", 
    "price": "20.00", 
    "instructors": "Anja Altberger", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606708_febc_3.jpg", 
    "course_url": "https://www.udemy.com/united-nations-get-an-internship-boost-your-future-career/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T05:37:14Z"
}