{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Si realmente deseas alcanzar un nuevo trabajo o concretar un nuevo proyecto o un nuevo emprendimiento, aquí aprenderás a manejar las herramientas que utilizan todos aquellos que se destacan, que lideran, los triunfadores, las personas de éxito, las que impactan en la sociedad, las que ocupan los mejores lugares de trabajo y encima ganan los mejores sueldos.  </p>  <p style=\"\">  \t  Porqué no puedes ser vos uno de ellos?  </p>  <p style=\"\">  \t  Las herramientas son las mismas que utilizó David para dejar de ser pobre, salir de detrás de las ovejas, donde vivía menospreciado y humillado por su familia, y lo trasladaron a ser millonario, alcanzar el trono, vivir en el Palacio Real, ser el yerno del Rey Saúl y bendecir encima a los que lo maldecían.  </p>  <p style=\"\">  \t  Utilizarlas lo convirtieron a David en un referente, un inspirador de la Iglesia de Jesucristo; no es casualidad  que al Señor Jesús lo llamaban: “Hijo de David”.  </p>  <p style=\"\">  \t  Alcanza un futuro mejor para vos y para tus seres queridos, realmente vale la pena! No te niegues!  </p>  <p style=\"\">  \t  Dice el Gran Libro que “El mundo entero está esperando que los Hijos de Dios se manifiesten” y éste es el tiempo. Si somos la Luz del Mundo, prepárate a subir y ocupa los mejores trabajos, porque la luz siempre se la coloca arriba, en lo alto, para iluminar a los que están abajo. No nos vamos a esconder más teniendo trabajos irrelevantes, mal pagos. Ahora vamos a iluminar y en serio!  </p>  <p style=\"\">  \t  Los siete pasos que te enseñaré son siete clases, siete videos, siete escenarios distintos que te llevarán por el proceso de alcanzar un nuevo y maravilloso objetivo.  Podrás vencer a los Goliat que aparecen en el camino: son las dudas, los miedos, las postergaciones, las frustraciones, las historias viejas que te contaron que “no podés” o “es para otros” o “confórmate con esta realidad” y que de nada te sirvieron hasta hoy.  Te enseñaré los secretos del éxito y los riesgos que tiene alcanzarlos, para cuidarte que no caigas.  </p>  <p style=\"\">  \t  Descubrirás cómo conocer la sabiduría de DIOS.  Tendrás varias autoevaluaciones y siempre podrás escribirnos, que te responderemos. Nunca estarás solo!  </p>  <p style=\"\">  \t  Estas enseñanzas están probadas y aprobadas por miles y miles de hombres y mujeres de distintas edades, pero para aprovecharlas tendrás que ponerlas en práctica y podrás hacerlo instantáneamente.  </p>  <p style=\"\">  \t  Ser Hijos de DIOS nos proyecta a una responsabilidad enorme, la de ser líderes, de ser formadores de opinión, de gobernar, de ordenar lo desordenado. Te reitero: “el mundo está esperando ver la manifestación de los Hijos de DIOS”.  Nunca tuviste una oportunidad más genial de proyectarte a tu futuro, al tuyo, al que vos elijas. Al fin y al cabo, allí vivirás el resto de tus días.  </p>  <p style=\"\">  \t  Vale la pena que inviertas en vos, verdad? Te espero!  </p>", 
    "end_date": null, 
    "title": "Cómo alcanzar un nuevo trabajo", 
    "price": "50.00", 
    "instructors": "ELIAS BAJER", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/102334_1dba_6.jpg", 
    "course_url": "https://www.udemy.com/como-conseguir-un-nuevo-trabajo/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-07T00:05:08Z"
}