{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        This course is based on the <strong style=\"\">D.R.E.A.M. BIG Career Success Intensive</strong> coaching program conducted by Nikki Robinson - <em style=\"\">Career Coach, published Author and Owner of </em><a href=\"http://www.byehighschool.org\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">www.byehighschool.org</a>.  </p>  <p style=\"\">  \t <strong style=\"\"> Build a successful career around the things that make you happy!</strong>  </p>  <p style=\"\">  \t        Our passions, or those things that &quot;give us life&quot;, provide clues about what we&#039;re called to do here on Earth. Instead of graduating from college and working in a position that merely finances your true desires, why not put in the work to make a living doing those things that give you <em style=\"\">true joy and fulfillment</em>?  </p>  <p style=\"\">  \t <strong style=\"\"> This course offers nine tried-and-true steps and 23 focused activities that bring you closer to your dream job as you:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Define</strong></li>  \t<li style=\"\"><strong style=\"\">Research</strong></li>  \t<li style=\"\"><strong style=\"\">Evaluate</strong></li>  \t<li style=\"\"><strong style=\"\">Aim</strong></li>  \t<li style=\"\"><strong style=\"\">Manage</strong></li>  </ul>  <p style=\"\">  \t        Each of those steps lay the foundation for a successful career that makes it easy to jump out of bed with <em style=\"\">energy and inspiration</em> each day... <em style=\"\">even on Monday mornings</em>!  </p>  <p style=\"\">  \t   Plan a satisfying, fulfilling life of work and achievement with the <strong style=\"\">worksheets, videos and support materials included in the D.R.E.A.M. BIG career success course</strong>.  </p>  <p style=\"\">  \t   You get a free copy of my book, <a href=\"http://www.byehighschool.org/brand\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">&#039;Building Passive Income in your Career Field.&#039;</a> This book is one of the top 100, best-selling career guides on Amazon.  </p>  <p style=\"\">  \t        The course content comes from years of my own trial and failure.  </p>  <p style=\"\">  \t   When you enroll today, you receive instant access to valuable information and exercises that&#039;ll <em style=\"\">fast-track</em> you into the career you fantasize about before drifting off to sleep at night.  </p>  <p style=\"\">  \t        The most ambitious of us could probably complete the course in a few days. Others can take up to a month.  </p>  <p style=\"\">  \t        The speed at which you complete this course isn&#039;t important.  </p>  <p style=\"\">  \t <strong style=\"\">What&#039;s important is taking the time to complete each exercise correctly... and taking <em style=\"\">every</em> step of the process seriously.</strong>  </p>  <p style=\"\">  \t        That way you identify your passions, strengths and values. All of which come together to create what some refer to as your &quot;calling&quot; - that which gives your life purpose while also making a positive impact on others.  </p>  <p style=\"\">  \t        There&#039;s an abundance of wealth and success available to you if you aren&#039;t afraid to be pursue your passion.  </p>  <p style=\"\">  \t<em style=\"\">        Taking the D.R.E.A.M. BIG course places you on the path to claiming your piece of the pie.</em>  </p>  <p style=\"\">  \tFor less than the cost of a pair of popular Nike brand shoes, you get all the information you&#039;ll ever need to become whoever you want to be.  </p>  <p style=\"\">  \tInvesting in yourself <em style=\"\">now</em> allows you to have the best home, car, fashion, etc. <em style=\"\">later</em>.  </p>  <p style=\"\">  \t<strong style=\"\">So if you&#039;re ready to enjoy what you do - as opposed to hating life every time you clock in at work - enroll now!</strong>  </p>  <p style=\"\">  \t   Also share this course with friends and family members who desire to do more with their life. Just use the social media buttons to the left. :)  </p>", 
    "end_date": null, 
    "title": "D.R.E.A.M. BIG: Make a Living Doing What Makes You Happy", 
    "price": "30.00", 
    "instructors": "Nikki Robinson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99250_04ab_5.jpg", 
    "course_url": "https://www.udemy.com/dream-big/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-30T00:13:36Z"
}