{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">If you ever wanted to get that elusive dream job, if you ever felt that you always seem to suck on an interview… then this would be the most important letter you&#039;ll ever read.</strong></p><p style=\"\">Hi my name is Red Tolentino…and in the past 8 months. I had 3 jobs (not at the same time) and I quit all of them…</p><p style=\"\">Here&#039;s why this is important to you..</p><p style=\"\">I discovered a secret that allows me to ace any job interview as long as I am qualified for the position. And Im going to share this secret with you.</p><p style=\"\">The first time I used the secret, I got hired immediately, well, maybe I just got lucky I said to myself.</p><p style=\"\">Then I quit my job just to prove that my secret works and will always work…</p><p style=\"\">Then the second time I used it…to my disbelief…it worked again, at that time I knew I was into something…</p><p style=\"\">BUT, ..I just got to do it again! </p><p style=\"\">Should I quit again and see if the secret really works?</p><p style=\"\">This time I I was so scared and I leave the office 4 hour earlier, I went straight to</p><p style=\"\">My room and cried myself to sleep. </p><p style=\"\">The next day, I submit my letter of resignation and never look back.</p><p style=\"\">2 weeks later, I got a job offer after another successful job interview…I didn&#039;t accept the offer because I decided to start my own marketing agency…but the point is, THE SECRET WORKS.</p><p style=\"\">PERIOD</p><p style=\"\">The secret has nothing to do with your education.</p><p style=\"\">It turns out that the result of your job interview… will be all about</p><p style=\"\">THE QUALITY OF YOUR QUESTIONS AND YOUR ANSWERS</p><p style=\"\">And for the first time ever, I am revealing the secret questions, answers and methodology in acing any job interview because I want to give back..</p><p style=\"\">It&#039;s called, <strong style=\"\">DareDevil Job Interview Secrets</strong></p><p style=\"\">Look, I know how it feels to not get your dream job just because you are against a</p><p style=\"\">Quote unquote smarter competitor.</p><p style=\"\"><strong style=\"\">That&#039;s why I created a system that doesn&#039;t require you to be…</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">-A graduate of Harvard, yale or any of those crazy expensive schools</strong></li> <li style=\"\"><strong style=\"\">-You don&#039;t have to be cum laude, suma cumlaude or have any of those awards</strong></li> <li style=\"\"><strong style=\"\">-You don&#039;t have to kiss your employer&#039;s behind just to get accepted</strong></li> <li style=\"\"><strong style=\"\">-You don&#039;t have to be any of that B.S.</strong></li></ul><p style=\"\"><strong style=\"\">Once you join me, you&#039;ll discover..</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">-The ten Gun in your head questions that u need to answer … these 10 are MUST ANSWER questions.</strong></li> <li style=\"\"><strong style=\"\">-The 2 kinds of research that you must do to prepare for a job interview</strong></li> <li style=\"\"><strong style=\"\">-How doing this simple 21 minute routine can transform your life forever</strong></li> <li style=\"\"><strong style=\"\">-The 2 secrets question that will guarantee you the job position if you answer it right..and much much more inside.</strong></li></ul><p style=\"\">To join this course today, click the button that says TAKE THIS COURSE and input your payment details…once done, you&#039;ll have immediate access to the DareDevil Job Interview Secrets course.</p><p style=\"\"><strong style=\"\">I offer a 100% no questions ask, 30 day money back guarantee</strong> , if you don&#039;t like it (which I doubt) , but if for some reason you don&#039;t like it.. maybe you don&#039;t like the color of my slide,,or the pictures..or whatever. Just email support and we&#039;ll give you your money back.</p><p style=\"\">Nothing is stopping you now from getting your dream job.</p><p style=\"\">Imagine this scenario,..</p><p style=\"\"><strong style=\"\">30 days from now, you can either look back, pat yourself in the back for getting your dream job because you study and implement what you learn in this course…</strong></p><p style=\"\">OR</p><p style=\"\"><strong style=\"\">You could just pretend that you didn&#039;t see this opportunity, and wonder forever what would have happened if you only took a chance. </strong>…</p><p style=\"\">My friend the decision is yours… you have nothing to lose by making the decision today…thank you for watching …click TAKE THIS COURSE and Ill see you inside.</p>", 
    "end_date": null, 
    "title": "Dare Devil Job Interview Secrets", 
    "price": "25.00", 
    "instructors": "Red Tolentino", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516594_d4d7_6.jpg", 
    "course_url": "https://www.udemy.com/dd-job-interview-secrets-questions-answers/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T02:53:30Z"
}