{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Die 30 häufigsten Fragen im Vorstellungsgespräch</p><p><strong>… und wie du sie perfekt beantwortest.</strong> <strong>Wer \nkennt sie nicht: die kniffligen Fragen im Vorstellungsgespräch? Doch die\n häufigsten Fragen im Bewerbungsgespräch zu kennen reicht oft nicht aus,\n um sie klar und vor allem überzeugend beantworten zu können. </strong></p><p>Personalchefs wählen ihre Fragen sorgsam aus, testen damit nicht nur \nfachlich, sondern vor allem psychologisch die Eignung des Bewerbers. Dr.\n Markus Rimser ist ein Insider der Recruitingszene, war selbst lange \nZeit Personalchef in internationalen Unternehmen und verrät dir Tipps \nund Tricks für die erfolgreiche Beantwortung der 30 häufigsten Fragen im\n Bewerbungsgespräch.</p><p>In diesem Onlinekurs erfährst du alles über die häufigsten Fragen im \nVorstellungsgespräch: wie ticken Personalchefs? Nach welchen Kriterien \nwählen sie ihre Fragen aus? Was sind die psychologischen und \norganisationsrelevanten Hintergründe der jeweiligen Fragestellungen? \nWelche Antworten werden gerne gehört – und vor allem warum? Aufbauend \nauf den 5 Fragenbereichen</p><ul><ul><li>persönliche Kompetenz</li><li>soziale Kompetenz</li><li>fachliche Kompetenz</li><li>methodische Kompetenz und</li><li>die Passung zum Unternehmen,</li></ul></ul><p>zeigt dir dieser Videokurs, wie du individuelle und überzeugende \nAntworten formulierst, dabei an Selbstsicherheit gewinnst und situativ \nauf die kniffligsten Fragen im Bewerbungsgespräch passende Antworten \nfindest.</p><p>Du erhältst nicht nur ein Training der 30 häufigsten Fragen, sondern \nauch ein vertiefendes e-book zu 140 Fragen im Vorstellungsgespräch … die\n perfekte Vorbereitung auf dein Bewerbungsgespräch ist damit garantiert.</p>", 
    "end_date": null, 
    "title": "Das Bewerbungsgespräch: die 30 häufigsten Fragen", 
    "price": "30.00", 
    "instructors": "Markus Dr. Rimser", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/601290_c617_3.jpg", 
    "course_url": "https://www.udemy.com/die-30-haufigsten-fragen-im-bewerbungsgesprach/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T11:00:54Z"
}