{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Wir kommunizieren den ganzen Tag - nach welchen Spielregeln Kommunikation aber funktioniert, danach fragen wir meistens nicht. Erst wenn es unangenehm wird, wir aus Konflikten keinen Weg mehr finden, wir keinen Draht mehr zu unserem Chef oder unseren Kollegen haben und einfach nicht wissen, wie wir bei Gesprächen, bei denen es um was geht, nicht gleich die Oberhand verlieren, dann suchen wir nach Lösungen. </p><p>In meinem Kurs will ich Dir diese Lösungen bieten. Ich habe gleich zwei wertvolle Bausteine dafür zusammengefügt. Die Defensiv-Rhetorik und die Gewaltfreie Kommunikation. Wo das Erste eher Technik ist, steht das Zweite ganz im Zeichen einer inneren Haltung. Technik &amp; Haltung zusammen ergeben einen hoch effizienten Mix für Kommunikationsherausforderungen gleich welcher Art. </p><p>Im ersten Teil beschäftigen wir uns zuerst mit der Rhetorik. Nein, nicht etwa der Alltagsrhetorik. Es darf schon etwas gepfefferter zugehen. Ich zeige Dir in diesen Lektionen was zu tun ist, wenn es rhetorisch mal wieder droht, in die Hosen zu gehen. Wie Du unfaire und manipulative Angriffe erkennen und mit ihnen umgehen kannst. Wir schauen uns Konzepte an, was Du mit einem Blickkontakt so alles anfangen kannst, Wie Du Pausen für Dich nutzt, Konterstrategien gekonnt ins Ziel bringst und niemals dabei Deinen Status verlierst. Machtspiele, Störer und Manipulationsattacken gehören fortan der Vergangenheit an.</p><ul><li>In zwei großen Kursblöcken präsentiere ich Dir in über 20 Video-Lektion geballtes KnowHow. </li><li>Zum Abschluss habe ich Dir jeweils ein kurzes Quiz angefügt, mit dem Du Dein neues Wissen prüfen kannst. </li><li>Du findest in vielen Lektionen mein Begleitskript mit teilweise weiteren Infos, Grafiken oder Übungen zum downloaden. </li></ul><p>Wenn Dich Deine rhetorischen Fähigkeiten wirklich interessieren, wenn Du besser mit Deinen Gesprächspartnern umgehen können willst und in kritischen Situation stets bei Dir bleiben und Deinem roten Faden folgen möchtest, dann ist mein Kurs sicher eine willkommene Bereicherung. </p><p>Ich wünsche Dir viel Spaß und freue mich über Dein positives Feedback.</p>", 
    "end_date": null, 
    "title": "Defensiv-Rhetorik und Gewaltfreie Kommunikation", 
    "price": "50.00", 
    "instructors": "Michael Kirchhoff", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699806_e2c2.jpg", 
    "course_url": "https://www.udemy.com/defensiv-rhetorik-und-gewaltfreie-kommunikation/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T07:56:17Z"
}