{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong>BENEFITS of THIS COURSE and WHAT YOU WILL LEARN</strong></p><ol><li>You will learn the 12 Career Archetypes - the patterns and tendencies we all bring to career.</li><li>You will be able to <strong>explore many alternative possibilities for fulfilling career paths</strong> that align with the ancient wisdom of your astrological birth chart.  </li><li><strong>You will understand what energies you bring to any career choice.</strong>  </li><li>You will learn the difference between ‘what you do’ daily and ‘who you become’ in the public eye.</li><li>Leave this course with a basic understanding of astrology and how to apply it practically in your life towards a fulfilling and successful career.</li><li>Discover how to <strong>effectively manage your energy</strong> and <strong>efficiently use your gifts</strong> daily</li><li>Learn what energies in your daily environment may stress or exhaust you as well as cause illness.</li><li><strong>You will save time on the path to living your vocational calling</strong>, while gaining confidence stepping in to your highest service on the planet.</li><li><strong>Famous Examples</strong> for every career path</li><li><strong><span></span>Multi-Format learning: Audio, Video, Mindmaps, JPGs, and Keynote presentation</strong></li><li>Guarantee - If you're not fully satisfied with this course in the first 30 days, you will receive a full refund.</li></ol>", 
    "end_date": null, 
    "title": "Discover Your Optimum Career Path with Basic Astrology", 
    "price": "50.00", 
    "instructors": "VerDarLuz CelestiOwl", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694094_e37b_2.jpg", 
    "course_url": "https://www.udemy.com/career-codes-astrology/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T16:15:36Z"
}