{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><p style=\"\">Are you in a job you don’t like? Are you unemployed? Are you in a state  of transition and want to identify what’s next? Do you believe that you were  born to do something extraordinary, but just can’t figure out what it is? </p>  <p style=\"\">Well, I have some really good news for you – <em style=\"\">The Reinvention Workshop</em> will forever change your life. And,  because you’ve made a conscious choice to visit this course, you’ve already  taken your first powerful step towards <strong style=\"\">reinventing  yourself and</strong> becoming who you were born to be. </p>  <p style=\"\"><em style=\"\">The Reinvention Workshop</em> will teach <strong style=\"\">YOU</strong> my proven formula for discovering  your <em style=\"\">WHAT</em> — that is, the ONE thing  you were born to do — and create a powerful plan of action for getting paid  extraordinarily well sharing your unique gift with the world<strong style=\"\">. Learn how to REINVENT yourself.</strong></p>    <p style=\"\"></p>    <p style=\"\">Led by me, Steve Olsher, author of the award-winning books, <em style=\"\">Internet Prophets: The World’s Leading  Experts Reveal How to Profit Online</em>and <em style=\"\">Journey  To You: A Step-by-Step Guide to Becoming Who You Were Born to Be</em>; co-star  of the groundbreaking film, <em style=\"\">The Keeper of  the Keys</em>, alongside Jack Canfield, John Gray, and Marci Shimoff; founder  and host of <em style=\"\">Reinvention Radio</em>; and an  in-demand media guest who has appeared on ABC TV, Fox TV, the WB, CNBC.com, and  more than 200 radio shows including nationally syndicated programs hosted by  Lou Dobbs, Mancow Muller, and Jim Bohannon, <em style=\"\">The  Reinvention Workshop</em> puts fire in your soul! </p>    <p style=\"\"><strong style=\"\">How do you pursue what you love  AND make money doing it?</strong></p>    <p style=\"\"><strong style=\"\">Most people don’t create their  ideal life because they can’t identify what they want to do and don’t feel it’s  possible to make it happen.</strong></p>    <p style=\"\">You will find the answers you need at <em style=\"\">The Reinvention Workshop</em> and gain a clear understanding of your  life’s purpose and be fired up about, and highly focused on, achieving it. I’m  a steadfast believer that we should learn from the trials and tribulations of  those selfless enough to teach. I’ve been fortunate to benefit from the  guidance of incredible mentors — I hope you’ll allow me to mentor you. Over the  past 20 years, I’ve developed and refined the proprietary exercises, theories,  and principles you’ll find at <em style=\"\">The  Reinvention Workshop</em>. </p>  <p style=\"\">Each is crafted from my own often painful, hands-on experience. I’ve  made the mistakes and suffered the inevitable results. You don’t have to. My  unique methodology blends ancient wisdom from a multitude of spiritual leaders,  including Buddha, with revolutionary lessons from modern theorists, such as Dr.  Thomas Gordon, creator of The Four Stages of Learning. These teachings,  combined with my unique exercises and singular approach to realizing permanent,  positive change, form a proven system for ultimate achievement in business and  life. The tools I provide at <em style=\"\">The  Reinvention Workshop</em> will show you powerful shortcuts you can immediately  implement to create the life you deserve and desire while avoiding the pitfalls  of going it alone and transform your life starting right <strong style=\"\">now</strong>.</p>  <p style=\"\"><strong style=\"\">Everyone has natural-born  greatness. Do you know what yours is?</strong></p>    <p style=\"\">Horace Mann said, “A person should be ashamed to die, until (s)he has  made a <strong style=\"\">monumental impact on mankind</strong>.”  How are you going to leave your mark? What will your legacy be? Becoming who  you were meant to be begins with taking the first step. </p>  <p style=\"\">I strongly believe the destination IS the road and that the JOURNEY is  the destination. <em style=\"\">The Reinvention Workshop</em>  is a quest for the most precious of destinations: your true self. Let me guide  you through it. I look forward to helping you reinvent your life and having a  powerful impact on our world. </p>    <p style=\"\">The world is waiting for you!</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Discover The 1 Thing You Were Born To Do In 5 Easy Steps!", 
    "price": "30.00", 
    "instructors": "Steve Olsher", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25557_5692_5.jpg", 
    "course_url": "https://www.udemy.com/the-reinvention-workshop-discover-what-you-were-born-to-do/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-28T14:26:53Z"
}