{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">You Have Probably Been Asking At Least One Of The Following Questions: <br style=\"\">  \t</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">What are my Talents?</strong></li>  \t<li><strong style=\"\">How do I discover my Gifts and Abilities?</strong></li>  \t<li><strong style=\"\">Do I even have any Talents or Gifts?</strong></li>  \t<li><strong style=\"\">What is the process of discovering my Talents?</strong></li>  </ul>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t                      I have good news for you!  </p>  <p>  \t                      No Tests, No Quiz&#039;s, You Can&#039;t Fail.  </p>  <p>  \t                          It&#039;s customized around you, not forcing You to fit into a mold.  </p>  <p>  \t                          It&#039;s based on your input, not preset categories.  </p>  <p>  \t                        Won&#039;t try to put a label on you, or fit you into a box.<br style=\"\">  </p>  <p>  \t                      You&#039;re not too old to finally learn them, and everyone has a Talent, so let&#039;s discover yours.  </p>  <p>  \t<strong style=\"\">How many people go to college and don&#039;t select a major because they don&#039;t have focus, they&#039;re still wondering. That&#039;s 2 years of wandering thru life, spending lots of money because they tell you to not focus yet, (just spend thousands of dollars here for 2 years) until you know what you know what you want to do.</strong><br style=\"\">  </p>  <p>  \t                      In life, you have already applied your Talents and Abilities whether you know it or not. But can you put your talent into words? Can you describe what you are best at in 1-2 sentences, instantly, right now? If not, you are probably still guessing at what your Natural Talents are.  </p>  <p>  \t                          If you can confidently describe what your Natural Talents are without stumbling or guessing, then this method is not for you. But if you&#039;ve wondered what your Natural Gifts are, then keep reading.  </p>  <p>  \t<strong style=\"\">This method is designed to help you discover your Natural Talents and Abilities, &#039;Put them into Words&#039; so that you can go forward with focus to apply your gifts in your career and life. Not just to know what they are, but to open doors and also help others with your Natural Talents and Gifts.</strong>  </p>  <p>  \t                          As You are doing this, You will become an Artist, a Sculptor you will be painting, sculpting, forming the Real You. The image will not be blurry like its been in the past, You will &#039;Finally&#039; know, and be able to put Your Own Label on What Your Talent is. I Guarantee it!  </p>  <h4></h4>  <p>  \t<strong style=\"\">I was tired of searching for what my purpose was, tired of going in circles, what I should focus on. I had many abilities, but where should I direct my energy. If I could find what I was meant to do, what role I could be the best at, then I could build on that instead of only searching for it, starting something only to get distracted when the next shiny object, or the next latest sales pitch caught my emotional buying trigger.  </strong>  </p>  <p>  \t                I wanted to be able to repeat this process if needed, and I hate coming up with an answer, and not be able to prove it. So if I lay a foundation that is solid, and present it in simple, baby-steps so that anyone can follow it and get quality results, then I&#039;ve done well. And that&#039;s what I found out after going through this long, time consuming process, was develop a method that&#039;s repeatable, reliable, and easy.  </p>  <p>  \t<strong style=\"\">I was so happy with the results on what I discovered about my Natural Talents, that I wanted to make it available so that anyone could learn their Natural Talents and Gifts. It worked for me, so I made this step-by-step process that you can follow and Discover Your Natural Talents, Gifts, and Abilities also.</strong>  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Discover Your Natural Talents & Find Job Titles That Match", 
    "price": "20.00", 
    "instructors": "David Reynolds", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342758_ba0b.jpg", 
    "course_url": "https://www.udemy.com/discover-your-natural-talents-abilities-and-gifts/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T20:52:04Z"
}