{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4><strong style=\"\">Join the 600+ students who signed up in the first 24 hours </strong>---</h4><h4><strong style=\"\"><br style=\"\"></strong></h4>  <ul style=\"\">  \t<li>Are you a bit confused and don&#039;t know which direction to go, in relation to your career?</li>  \t<li>Are you unhappy in your job but you don&#039;t know what you want to do?</li>  \t<li>Would you like to have a more meaningful career?`</li>  </ul>  <p>  \t      You are not the only one, I have many clients who have an office job, money, the lifestyle they want, however they feel there is something missing in their life.  </p>  <p>  \t      If you are unhappy in your job, if you know you could be doing something more and you feel you are not reaching your full potential, this is the course for you.  </p>  <p>  \t      21 Days challenge to job satisfaction is a series of videos with fun exercises that will lead you to discover what your dream job is.  </p>  <p>  \t      The videos and exercises will help you to get clarity on what you want to do, what is important for you and what makes you happy.  </p>  <p>  \t      In the course I will ask you questions, these questions are there to make you think and they will help you to discover insights about yourself that maybe you never thought about before.  </p>  <p>  \t      Also you will also discover your personality type and career options for your personality type.  </p>  <p>  \t      The exercises  will help you clarify and find out what you want to do that will make you feel happy and fulfilled.  </p>  <p>  \t    And we will finish by creating a plan that works for you. A plan that will lead you to land the meaningful job and career that makes you happy and fulfilled  </p>  <p>  \t      If you have had enough of feeling unhappy and unsatisfied in your job then enrol this course now, you can start right away.  </p>  <p>  \t      Nobody can make you feel happy, only YOU can.  </p>  <p style=\"\">  \t<strong style=\"\">Enrol this course now</strong>. Click the <em style=\"\">&quot;take this course&quot;</em> button, <em style=\"\">so that you can start creating your own website straight away.</em>  </p>  <p style=\"\">  \t<strong style=\"\">30 days money back guarantee</strong>. Take the course for 30 days and if you are not happy, we will give you the money back, no questions asked.  </p>  <p>  \t      See you on day 1 of the 21 days challenge job satisfaction.  </p>", 
    "end_date": null, 
    "title": "Do What You Love. Discover Your Passion or Dream Career. ", 
    "price": "20.00", 
    "instructors": "Carmen Fernandez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/391108_fec5_5.jpg", 
    "course_url": "https://www.udemy.com/do-what-you-love-wake-up-every-day-loving-what-you-do/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-11T12:01:44Z"
}