{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Dream Job Life – Preview</strong>  </p>  <p>  \tFor 28 years, I have helped thousands of professionals from all levels make profitable career transitions and create prosperous new businesses.  </p>  <p>  \tThis “Preview” Course is actually a “mini course” which includes the first five lectures of our full course…and stands on its own, providing immense value.  </p>  <p>  \tLearn Rules you need to Start Breaking! Rules which were ingrained from Childhood Experience and how these rules have shaped you…and limit you in your connect-ability with others.  </p>  <p>  \tJust get laid off?  Needing to go back to work after years at home or dealing with a family situation?  Want to start your own business but don’t know where to start?  Never waste the opportunity of a good crisis! I will walk you through the “Trough of Transition.” The “Trough of Transition” is something we all go through when change occurs whether it is a career or personal change – understanding what is happening and how to get to the next step.  </p>  <p>  \tThis “Preview” offers valuable information to start you on your journey.  </p>  <p>  \tThe principles taught in this course have been used for innovative job search, creative sales expansion, and inspired business development by hundreds of people.  </p>  <p>  \tAgain, this Preview is immensely valuable on its own, and if you are ready to take the next step toward landing your dream job and ensuring a future of job security by your own design, we invite you to enroll into the full course upon which this preview is based, entitled:  </p>  <p>  \t<strong>Dream Job Lifeline: Get Known, Get Offers, Get Working</strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong>How to Walk Through the Backdoor Into Your Dream Job Life</strong>  </p>", 
    "end_date": null, 
    "title": "Dream Job Lifeline - Preview..  Get Known, Get Working", 
    "price": "20.00", 
    "instructors": "Darrell W. Gurney", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304386_29e0_3.jpg", 
    "course_url": "https://www.udemy.com/dreamjobpreview/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T18:56:50Z"
}