{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Electronics: Resistors in Series S1W5</p><p style=\"\">This Basics Electronics Course will teach you how to solve series resistor circuits. To understand Direct Current (DC) Electronics, you need to master four resistor configurations:</p><ol style=\"\"><li style=\"\">Series Resistor Circuits</li><li style=\"\">Parallel Resistor Circuits</li><li style=\"\">Series-Parallel Resistor Circuits</li><li style=\"\">Complex Resistor Circuits</li></ol><p style=\"\">This course will teach you to master the first category above.</p><p style=\"\"><strong style=\"\">These are the topics covered in this course:</strong></p><ul style=\"\"><li style=\"\">Master and solve series resistor circuits using Ohm&#039;s Law.</li></ul> <ul style=\"\"><li style=\"\">Learn to correctly apply Ohm&#039;s Law to series resistive circuits.</li></ul><ul style=\"\"><li style=\"\">Recognize the “Two Out of Three&quot; rule that will allow you to apply the correct formula to the solution of a circuit.</li></ul><ul style=\"\"><li style=\"\">Understand the correct use of the Ohm&#039;s Law Triangle.</li></ul><ul style=\"\"><li style=\"\">Understand the correct use of the Ohm&#039;s Law Wheel.</li></ul><p style=\"\"><strong style=\"\">In other words, you will understand exactly how to solve series circuit resistor problems!</strong></p>Thiscourse is important if you wish to understand electronics. The analysis of basic series circuits is a fundamental tool that you must master to properly troubleshoot, analyze and maintain electronic equipment. Ohm&#039;s Law states the basic relationships between voltage, current and resistance in an electronic circuit. This information is mandatory for any hobbyist or professional who needs to understand how electronic circuits work. This course is a quality product taught by a college instructor who has been teaching electronics for over twenty years. It is the equivalent of a full week of college level training at a community college or technical university.<p style=\"\"></p><p style=\"\">The primary teaching method is instructor led lectures using PowerPoint slide presentations. Drawings, images and schematics are used to clearly illustrate each electronic principle. There are ten separate lectures that take you through the concepts of Ohm&#039;s Law and series circuits in a clear, simple manner. A number of quizzes are included test your retention of the lecture material.</p><p style=\"\">At the end of this course, you will have a solid grasp of the principles of Ohm&#039;s Law and the application of this law to the solution of electronic circuit problems.</p>", 
    "end_date": null, 
    "title": "Electronics S1W5: Resistors in Series", 
    "price": "25.00", 
    "instructors": "Richard Vannoy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489570_c2d2.jpg", 
    "course_url": "https://www.udemy.com/electronics-week-05/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T16:03:06Z"
}