{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Albert Einstein called our normal state</strong> the <em>“optical delusion of consciousness.</em>\" Almost all of our awareness is processed in our conscious minds. The interesting thing is that 90% of our mental processing is not conscious at all. Like an iceberg, only about 10 percent is apparent. </p><p><strong>Your brain learns in a way entirely foreign to how you've been taught.</strong> That's a bold statement, and we suggest that you suspend your beliefs in traditional learning and teaching methods while you experience this course. This will be to your advantage. </p><p><strong>Brian Walsh wants to share with you</strong> what he has learned from his experience as a corporate trainer working with various cultures, and his training as a hypnotherapist and a practitioner of Neurolinguistic Programming (NLP). A great deal of his study dealt with what lies beyond conscious learning. </p><p><strong>This UDEMY course is built on Brian's live workshop. </strong>In it, you will learn how the brain processes information, and how emotions and beliefs affect learning. You will discover that the way your brain is wired can be altered both intentionally and unintentionally. With this knowledge, you can effectively apply the tools and techniques presented.</p><p><strong>You will be given many tips on how to go beyond conscious learning </strong>to more easily absorb information. The content has been designed to appeal to visual, auditory, and kinesthetic learning styles. </p><p><strong>No matter how well you think you learn, once you've completed this course, you will be able to achieve more, in less time, with less effort. Sign up now.</strong></p><p><strong>Here is a list of the bonuses included:</strong></p><ul><li>PDF: Enriched Learning Glossary </li><li>PDF: Reasons For Unclarity </li><li>Chart: Traditional Learning Vs Enriched Learning </li><li>Enriched Learning Concept Map </li><li>Enriched Learning Crossword Puzzle Answer Key </li><li>PDF: Foreword To Unleashing Your Brilliance By Bob Proctor </li><li>PDF: Brian Walsh Product Descriptions </li><li>MP3: Guided self-hypnosis audio - \"A Self Confidence Boost\"</li><li>MP3: Enriched Learning Workshop (complete audio)</li></ul>", 
    "end_date": null, 
    "title": "Enriched Learning - The Brain-Friendly Route to Success", 
    "price": "20.00", 
    "instructors": "Brian E Walsh PhD", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557610_3dde_3.jpg", 
    "course_url": "https://www.udemy.com/enriched-learning-the-brain-friendly-route-to-success/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T23:44:17Z"
}