{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Want to answer the question: what does it take to succeed as an ESL trainer?</strong></p>\n\n<p>An effective, qualified trainer can not only have a profound effect on their students' lives - both professionally and personally - but can also build a financially rewarding career.</p>\n\n<p>In my ten years as an ESL trainer I've moved from language school L-plater to fully-booked freelancer, and this course details how you can enjoy the same success.</p>\n\n<p>Through a combination of video, audio and text lectures delivered in my trademark sunshine style, I cover the six steps I've identified as necessary to establish a successful solo career as an ESL trainer.  And all compressed into 40 minutes!</p>\n\n<p><strong>Take this course to get your ESL career soaring!</strong></p>\n\n<p><em>\"Jacqueline has been my trainer since 2009, and has worked with me to improve my skills in English communication, specifically in business writing, speaking and presentations. She takes a communicative approach, simulating real-life situations, and has a wealth of knowledge to pull from.\" - Claudia Broghammer, Management Consultant at HR Campus AG</em></p>\n\n<p><em>\"Jacqueline was my colleague at inlingua Chemnitz for three years. In the course of this time I could watch her developing from “just\" a skilful speaker of English into a passionate, TESOL-qualified language trainer who very soon became a favourite with her employer, colleagues and clients.  Her warm, welcoming and open-minded personality as well as her dedication to high quality and goal orientation made her a wonderful and reliable colleague to work with.\" - Anja Pleul, Öffentlich bestellte und allgemein beeidigte Übersetzerin für Englisch / Sprachtrainerin Englisch / DaF</em><em> </em></p>", 
    "end_date": null, 
    "title": "ESL Success - Set Up Your Small Business Today", 
    "price": "20.00", 
    "instructors": "Jacqueline Seidel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475896_ba10_3.jpg", 
    "course_url": "https://www.udemy.com/esl-success/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T10:30:15Z"
}