{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">You want to work for one of these world-wide known companies. You want to be successful and rich by holding one of their highly paid jobs? You want to also boost your career by being able to name one of these well-known companies in your resume?</p><p style=\"\">Who does not like to take such a chance? </p><p style=\"\">Being employed at a big and successful company in Germany, I invite all of you to discover this unique opportunity with me.</p><p style=\"\">But how will it come true?</p><p style=\"\">Follow my course and learn, step-by-step, how to find the perfect job for yourself in Germany or in a German company in your home-country.</p><p style=\"\">Having a deep understanding of the procedures getting a highly paid job on the German labor market, I would like you to be able to profit from this my knowledge.</p><p style=\"\">Here&#039;s what you need to get started on your search for a job in Germany: all the information and advice on what jobs are available in Germany, where to look to find them. The next part is about how to apply for such a job, how to go through the interview procedure and, afterwards, how to manage to settle comfortably in Germany.</p><p style=\"\">How can it be that interesting to work in Germany or for a German company?</p><p style=\"\">Imagine a country whose inhabitants work fewer hours than almost any others, whose workforce is not particularly productive and whose children spend less time at school than most of its neighbors. But the country described above is none other than Germany, Europe&#039;s industrial powerhouse and the world&#039;s second largest exporter; a country whose economy has single-handedly stopped the euro-zone falling back into recession and the only nation rich enough to save the euro.</p><p style=\"\">You can see that Germany has one of the highest salaries within the whole of Europe. Just in Scandinavia you will be able to earn even more.</p><p style=\"\">I am very sure, that you will be able to find the perfect position in Germany and get easily along with the social system and the society itself if you follow all the advices that I have given you.</p><p style=\"\">Of course, if there should be further questions regarding any of the topics that I have talked about in this course, do not hesitate to write me a mail or start a discussion within this course.</p><p style=\"\">All the best for your future and have enormous fun in Germany!</p>", 
    "end_date": null, 
    "title": "Essential tips to get a highly-paid job in a German company", 
    "price": "40.00", 
    "instructors": "Angela Akar", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453478_c1f7.jpg", 
    "course_url": "https://www.udemy.com/essential-tips-and-tools-to-get-a-highly-paid-job-in-germany/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T22:05:13Z"
}