{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    Você já sentiu que seu dia não tem horas o suficiente? Que não termina o que começa?  </p>  <p style=\"\">  \t    O Matando Bob usa dos conhecimentos da psicologia e economia comportamental para identificar a origem destes problemas e matar este procrastinador que habita dentro de você.  </p>  <p style=\"\">  \t    O curso dura 6 semanas e segue a seguinte estrutura:  </p>  <p style=\"\"><strong style=\"\">  \t    1. Mentalidade Produtiva  </strong></p>  <p style=\"\"><strong style=\"\">  \t    2. Primeiro Passo  </strong></p>  <p style=\"\"><strong style=\"\">  \t    3. Dissonância Cognitiva  </strong></p>  <p style=\"\"><strong style=\"\">  \t    4. Ciência da Força de Vontade  </strong></p>  <p style=\"\"><strong style=\"\">  \t    5. Gerenciando Metas de Longo Prazo  </strong></p>  <p style=\"\"><strong style=\"\">  \t    6. Estilo de Vida Saudável</strong>  </p>  <p style=\"\">  \t    Todos esses tópicos são recheados de conceitos e dicas para tornar sua vida mais produtiva.  </p>  <p style=\"\">  \t   <strong style=\"\">Veja uma prévia do nosso conteúdo no texto abaixo:</strong>  </p>  <p style=\"\">  \t ----------------------------------------------------------------------------  </p>  Táticas psicológicas para matar seu procrastinador interno  <p style=\"\">  \t   Por muito tempo acreditei que era um robô. Não sei bem por quê. Faltava empatia, emoção e suavidade.  </p>  <p style=\"\">  \t   Eu não conversava numa voz robótica como o C-3PO. Mas, por algum motivo, esperava que minhas metas fossem a única coisa influenciando minhas decisões e que eu deveria buscá-las como quem executa um código de computador. A única coisa me separando de algo grandioso era o conjunto certo de metas. Infelizmente, eu sou humano, e não é assim que humanos funcionam.  </p>  <p style=\"\">  \t   O que está errado comigo? Eu pensei. Por que estou constantemente agindo contra meus próprios interesses? A resposta se esconde nos genes que herdei do meu ancestral, Bob.  </p>  Introdução à preguiça  <p style=\"\">  \t   Bob era preguiçoso. Você não saberia isso apenas observando. Ele caçava, plantava, pescava, fugia e matava quase diariamente. Mas fazia isso por uma necessidade imediata. Ele adoraria ficar sentado o dia inteiro se isso não o levasse à morte certa. Necessidade o fez agir. Não é porque uma criança com uma arma na cabeça está seguindo ordens que isso signifique que ela não é preguiçosa.  </p>  <p style=\"\">  \t   Mas o motivo que faz Bob preguiçoso é que ação – toda ação – consome muita caloria. E uma vez que a vida depende de manter um saldo positivo de energia armazenada em relação ao que se gasta, gastar calorias com atividades não essenciais seria ridículo.  </p>  <p style=\"\">  \t   Nossos genes carregam a seguinte mensagem:  </p>  <blockquote style=\"\">  \t    “Faça o suficiente para sobreviver, não mais que isso.”  </blockquote>  <p style=\"\">  \t <strong style=\"\">Não é a sobrevivência do mais forte, é a sobrevivência do forte o suficiente.</strong>  </p>  <p style=\"\">  \t   Sim, vivemos em um mundo diferente agora. Caloria é um elemento fácil de se conseguir e, se você elogiar uma mulher pelo seu superávit calórico, provavelmente vai ganhar um tapa. Não existe necessidade de ser protecionista com nossos movimentos. Mais calorias estão apenas a um BigMac de distância.  </p>  O Aspecto Mental  <p style=\"\">  \t   Este instinto reverbera em todos os pontos da nossa vida. Como sabemos, preguiça é algo que vai além do movimento corporal. Somos mentalmente preguiçosos também. O problema com atividades mentais é que raramente enxergamos uma recompensa imediata vinda delas.  </p>    <p style=\"\">  \t   À medida que o corpo evoluiu, criou mecanismos para nos encorajar a levantar e correr quando uma ameaça aparece. A habilidade de sentar e trabalhar não representa para nós um benefício genético.  </p>  <p style=\"\">  \t   Nossa mente é mesquinha, nada boa em calcular valor futuro.  </p>  Existe saída?  <p style=\"\">  \t   Felizmente, psicólogos passam tanto tempo estudando nosso cérebro que aprendemos a burlar nossos instintos para alcançar nossos objetivos.  </p>  <p style=\"\">  \t   Quando você estrutura suas metas de uma forma que a mente vê como cruciais e imediatamente valiosas (alinha seu cérebro para estar no estado de controlá-las), você se torna capaz de direcionar sua capacidade natural para conquistar qualquer tarefa que tenha pela frente. Não importa quão enfadonho isso pareça.  </p>  <p style=\"\">  \t   Vou mostrar minhas técnicas favoritas para aproveitar toda essa capacidade: empregar dissonância cognitiva para forçar seu comportamento a se alinhar aos seus objetivos.  </p>  Dissonância cognitiva  <p style=\"\">  \t   Palavras chiques da psicologia assustam um pouco, vamos simplificar. Dissonância cognitiva é a sensação desconfortável de quando a versão da realidade dentro da sua cabeça não combina com o mundo externo.  </p>  <p style=\"\">  \t   A reação mais comum quando sentimos isso é o auto-engano. Mais confortável do que compreender o problema e fazer algo quanto a ele, é mais confortável nos convencer de que o problema não existe.  </p>  <blockquote style=\"\">  \t    “Ela não pode estar ignorando minhas ligações, ela deve ter perdido o telefone.”  </blockquote>  <p style=\"\">  \t   Certo, amigão.  </p>    <p style=\"\">  \t   “Será que eu atendo?”  </p>  <p style=\"\">  \t   Mas, melhor que se afastar da realidade eliminando a dissonância cognitiva, você vai aprender duas técnicas para amplificar sua dose de realidade. Você vai escancarar essa diferença entre a realidade e sua mente.  </p>  <p style=\"\">  \t   Primeiro, como exemplo de como funciona. Estimular a dissonância cognitiva tem sido amplamente utilizado como técnica de manipulação por profissionais de marketing. Para testar sua influência,pesquisadores executaram um famoso experimento no qual pediam para um pequeno grupo de pessoas selecionadas aleatoriamente para colocar uma plaquinha em seu gramado dizendo <em style=\"\">“Dirija com Segurança”</em>. Praticamente todos concordaram.  </p>  <p style=\"\">  \t   Semanas depois, pesquisadores passaram de porta em porta perguntando se poderiam colocar uma grande placa horrível, encorajando direção segura. Os estudos mostraram que as pessoas que anteriormente tinham aceitado colocar as placas pequenas, eram quatro vezes mais inclinadas a aceitar as placas grandes. Colocar uma placa pequena subconscientemente afirma sua percepção própria como uma pessoa contra direção perigosa. Um pequeno lembrete foi o suficiente para influenciar suas ações semanas depois.  </p>  <p style=\"\">  \t   E, como muitas técnicas de observação que podem ser utilizadas por nós e por outras pessoas, podemos usar dissonância cognitiva para mudar nossos próprios hábitos. Existem duas formas de conquistar isso:  </p>  <ul style=\"\">  \t<li style=\"\">Pela afirmação da nossa identidade, nos encorajando a agir em acordo com ela;</li>  \t<li style=\"\">Registrando nosso comportamento para tornar mais evidente a distância entre o que acreditamos e nossas ações.</li>  </ul>  <p style=\"\">  \t   Essencialmente, são dois lados da mesma moeda. O objetivo é nos forçar a enxergar a realidade da forma mais plana possível, de forma que esse desconforto causado pela dissonância cognitiva consiga fazer sua mágica.  </p>  Afirme sua identidade com comprometimento  <p style=\"\">  \t   Como no exemplo do “Seja um motorista prudente”, você pode encorajar seu comportamento reafirmando desejos que estejam alinhados com ele. Buscando a lembrança de nossas crenças mais abrangentes, tendemos a agir de acordo com elas.  </p>  <p style=\"\">  \t   Isso soa vago, então aqui vai a parte mais importante: <strong style=\"\">coloque seus objetivos no papel</strong>.  </p>  <p style=\"\">  \t   Escrevendo nossos objetivos, não existe onde se esconder. Se concluí-los, você vence. Caso contrário sabe que falhou. Não permitir que o cérebro se sabote é crucial para se manter motivado. Essa é uma prática que pode ser feita de forma privada, mas é infinitamente mais poderosa se tornar isso público.  </p>  <p style=\"\">  \t   Quando executei as 2011 flexões no desafio relatado aqui no PdH, se eu não tivesse tornado a meta publica, me comprometendo de uma forma tão extrema, eu provavelmente não teria conseguido chegar nem na metade do que acabei fazendo.  </p>    <p style=\"\">  \t   Já está passando da hora de usar isso a seu favor  </p>  <p style=\"\">  \t   Anunciar seus planos, metas e crenças para o mundo funciona maravilhosamente para nos motivar a agir no sentido que queremos.  </p>  <p style=\"\">  \t   Em um estudo onde um grupo de pessoas de dieta fizeram seus planos públicos no facebook, seu policiamento com a dieta foi altíssimo. A hipótese é que eles não podiam mais se enganar não escolhendo sua comida cuidadosamente nos seus momentos de fraqueza. O capetinha nos seus ombros, sussurrando, “você nunca ligou para essa dieta mesmo”, foi calado.  </p>  <p style=\"\">  \t   Os objetos da pesquisa declararam em público a importância de sua dieta. Não segui-la seria como reconhecer sua fraqueza e destruir sua identidade.  </p>  Medindo o buraco da realidade  <blockquote style=\"\">  \t    “O que pode ser medido pode ser gerenciado” –Peter Drucker  </blockquote>  <p style=\"\">  \t   Registrar nossas ações é outra forma de revelar o buraco entre nossa auto-percepção e a realidade. Como discutimos acima, é fácil nos enganar com noções vagas. Traduzir essas crenças em medições concretas cria uma enorme mudança de comportamento com quase nenhum esforço.  </p>  <p style=\"\">  \t   Constantemente mantemos ideias vagas como “eu sou um homem trabalhador” ou “eu me alimento de forma saudável” sem realmente examinar nosso comportamento e ver o que sustenta essas ideias. Nos forçando a ver que os fatos alinham com nossa percepção pode ser bem doloroso.  </p>  <p style=\"\">  \t   Continuando com os exemplos da dieta, existe um estudo no qual pesquisadores utilizaram um grupo de voluntários para seguir diferentes planos de dietas. O grupo que se saiu melhor não recebeu instrução alguma. Ao invés disso, pediram que fotografassem toda refeição e besteira que consumissem.  </p>  <p style=\"\">  \t   A dissonância cognitiva entre a autopercepção dos praticantes e a realidade do arquivo repleto de fotos modelaram seu comportamento melhor do que qualquer planejamento alimentar faria.  </p>  <p style=\"\">  \t   Então, como podemos observar esse comportamento com uma perspectiva de produtividade? Medindo nosso tempo.  </p>  <p style=\"\">  \t   Medir nosso tempo é um dos maiores amplificadores de produtividade que já experimentei. ComoSebastian Marshall escreveu uma vez:  </p>  <blockquote style=\"\">  \t    “Se você nunca se mediu, não sabe o tamanho do poder que esse hábito tem. Eu não conseguiria explicar isso adequadamente, você não acreditaria em mim. Pensaria que estou exagerando.”  </blockquote>  <p style=\"\">  \t   Admita, depois disso, você está pensando em dar uma chance.  </p>  Princípios de medição de Tempo    <p style=\"\">  \t   Como o nome da atividade já diz, medir o tempo se baseia basicamente em registrar o que faz com seu tempo. Não existe muito mais o que fazer.  </p>  <p style=\"\">  \t   Se é escrever detalhadamente um diário todas as noites, tudo bem. Se significa preencher uma planilha, está bom também. O simples ato de detalhar seu comportamento vai forçar a examiná-lo e aprender com isso. Essencialmente, todos os conselhos a seguir servem a dois propósitos: permitir que você registre as informações mais úteis com o menor esforço possível.  </p>  <p style=\"\">  \t   Seguem quatro princípios de medição de tempo que se mostraram bem sucedidos para mim e para pessoas que tenho ajudado.  </p>  1. Foque nas coisas certas  <p style=\"\">  \t   Se você não se importa com sua dieta, não escreva o que fez para o café da manhã. Se não se importa com seu sono, não registre quantas horas dormiu. Parece óbvio, mas o impulso de registrar tudo rapidamente se torna esmagador. Mantenha o foco nos hábitos que você quer desenvolver e comportamentos que quer continuar diariamente.  </p>  2. Comece pequeno e vá crescendo  <p style=\"\">  \t   Apesar do objetivo de medir seu tempo ser o desenvolvimento de hábitos melhores, medir o tempo por si só é um hábito. E como todos outros, é importante começar pequeno e ir aumentando com o tempo.  </p>  <p style=\"\">  \t   Por mais tentador que seja registrar tudo, não se sufoque com 20 páginas complicadas para preencher toda noite. Juro que, <strong style=\"\">se sua planilha for como fazer uma pequena monografia, você não dura uma semana.</strong>  </p>  <p style=\"\">  \t   Torne isso o mais simples e fácil possível, para virar algo automático na sua vida. Só assim, se você ainda quiser, adicione mais variáveis.  </p>  3. Nunca pule um dia  <p style=\"\">  \t   O embalo é uma coisa mágica. Se perder um dia, você se prejudica de duas maneiras. Primeiro, você torna a justificativa mais fácil para as próximas vezes. Segundo, você se sabota e torna o processo bem menos eficiente, assim os benefícios começam a não valer o custo.  </p>  <p style=\"\">  \t   O método utilizado por Jerry Seinfield para escrever comédia parte desses dois princípios. Não importa se o que ele produz é bom ou ruim, curto ou longo. Se ele escreve alguma coisa, ele consegue cortar um dia do seu calendário.  </p>  <p style=\"\">  \t   Seinfield afirma que o embalo é a chave para não sair da linha.  </p>  <p style=\"\">  \t   Siga esse conselho. Nunca pule um dia.  </p>  4. Torne as coisas fáceis  <p style=\"\">  \t   Da mesma forma que é importante manter o registro do seu tempo curto. Como mencionado acima, é bem melhor se você preencher seu caderninho com respostas de uma página, do que escrevendo uma monografia.  </p>  <p style=\"\">  \t   Tente manter o maior número de perguntas de Sim/Não que for possível. Preencher com números é bom também.  </p>  <p style=\"\">  \t   Faça tudo o mais direto e objetivo que conseguir. Faça de forma tão simples que quando estiver muito cansado e for pra cama, não queira deixar de fazer.</p>", 
    "end_date": null, 
    "title": "Estratégias de Produtividade", 
    "price": "35.00", 
    "instructors": "Alberto Brandão", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/108506_7cbf_10.jpg", 
    "course_url": "https://www.udemy.com/matandobob/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-21T04:45:19Z"
}