{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\n\nThis is an easy to follow, step-by-step, Federal Resume\nWriting tutorial. The video instruction taught in this tutorial is directly\nlinked to each chapter within the Battlefield Resumes, LLC workbook called\n\"Operation: Federal Resume, 4-Battlefield Phases to a Targeted Federal\nRésumé.\" This tutorial will help veterans, transitioning military\npersonnel, federal government employees, defense contractors and others in\ntheir search for federal employment. This tutorial uses an easily identifiable\nanalogy between military doctrine and federal résumé writing. This training\nencourages you to use military tactics and strategy when transitioning to the\ncivilian workforce. If you want to learn the secret to the HR screening process\nand want to get “referred” to the Hiring Manager, you have to watch this video training\nprogram. Bruce shows you how the HR office evaluates your resume and categorizes\nyou for a certain GS Grade Level, as well as how you can ensure that your\nresume is evaluated at the highest salary (GS Grade Level) possible. He also\nshows you where to find the criteria that the HR office uses when determining\nif your resume should be “referred” to the Hiring Manager and how to ensure\nthat the same critical information is included within your resume. Bruce will also\nwalks you through the Hiring Manager’s evaluation process and how the federal\ngovernment Position Description (PD) is linked to the vacancy announcement, the\nKSAs, the Questionnaire, and the questions asked during the interview. If you\nwant a federal job, this video tutorial is a must and will definitely ensure\nyour resume is more competitive than other applicants, as well as prepare you\nfor your federal government interview. </p>", 
    "end_date": null, 
    "title": "Federal (USAJOBS) Resume Writing Tutorial", 
    "price": "30.00", 
    "instructors": "Bruce Benedict", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655768_df2b.jpg", 
    "course_url": "https://www.udemy.com/federal-usajobs-resume-writing-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T18:47:24Z"
}