{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Why does my workday feel so unfulfilling? Do I need to adjust my current roles and tasks? Do I need to change careers completely? Where do I even start? What if I have no idea what it feels like to be passionate about work? What if I feel completely depleted by my life? Is it possible to have a happier daily life? This online course is designed to help you find answers to questions like these, so that you can make the changes you need to have a happier, more fulfilling life and career. </p>    <p>For most of my adult life, I have been obsessed with understanding what makes people fulfilled by their daily work. Earning a PhD in Organizational Communication, I was constantly seeking to understand how research on happiness and life fulfillment intersected with our careers. As I moved through my own journey, from working as a professor of communication, to a fulfilling career as a professional speaker and life coach, I was able to deeply understand the difficulty of being in a career that didn’t fit, and the fulfillment in finding a path that aligned deeply with my strengths.</p>    <p>This course is not a “feel good” course designed to simply tell you to “find your passion.”  It’s a hands on practical class on how to look carefully into your current career and daily life, so that you can get clear about what’s working and what’s not. Drawing on the work of Marcus Buckingham, research on life satisfaction and the state of <em>flow,</em> I offer you the real, nitty-gritty information on building a career that aligns with what makes you feel alive, interested, engaged and happy. And not surprisingly, when you feel this way, you are far more likely to be successful. It’s your life, you deserve to live a STRONG one! Now let’s get started.</p>", 
    "end_date": null, 
    "title": "Find Your Flow: Discover the Best Life and Career for YOU. ", 
    "price": "35.00", 
    "instructors": "Erin Foley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791778_215b_4.jpg", 
    "course_url": "https://www.udemy.com/find-your-flow-discover-the-best-life-and-career-for-you/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T22:56:29Z"
}