{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span>“Life really begins when you have discovered that you can do anything you want.” - William J Reilly, How to Avoid Work</span>  </p>  <p>  \tThis course is about the hardest part about doing what enjoy for a living: figuring out what you’re passionate about.  </p>  <p>  \t<strong style=\"\">Not knowing what you&#039;re passionate about is a strange symptom of the modern world.</strong> Most of the people and organizations in your environment will discourage you and redirect you to pragmatic and safe things that you don&#039;t really care about. Your &quot;voice of reason&quot; will rattle around your consciousness and convince you out of following your dreams. A million reasons will arise to tell you that you&#039;re neither ready nor capable.  </p>  <p>  \tThis course is meant to shock you out of that.  </p>  <p>  \tLast year, I quit my job at a fast growing tech company to figure out my passion and create things like books, podcasts, courses, and businesses for a living. It took me over twentyfive years to realize I didn&#039;t know what my passion was. Finding it became my primary pursuit, and I read dozens of books to find answers.  </p>  <p>  \tWhat you&#039;ll see in this course are the cream of the crop. Nine exercises that helped me and people I know get closer to doing what they enjoy for a living.  </p>  <p>  \tThe people that will get the most out of this book are the ones that share my perspective that finding something you’re really really into is the most important part of this entire process. Once you find that, the hardest part of this whole thing—getting started—gets a little bit easier.  </p>  <p>  \tBy the end of the course, you will know how to answer the dreaded question &quot;what are you passionate about.&quot; If you&#039;re really committed, you might even have a project that you can start right after you complete the course that might turn into a profitable side project or, maybe even a small business.  </p>  <p>  \t<span><strong style=\"\">Course features</strong> </span>  </p>  <ul style=\"\">  \t<li><span>Crystal clear audio and video (HD)</span></li>  \t<li><span>Professional editing</span></li>  \t<li><span>Transcript for each of the lectures</span></li>  \t<li><span>Unlimited questions via twitter @tonysheng</span></li>  \t<li><span>Access for life</span></li>  </ul>", 
    "end_date": null, 
    "title": "Find Your Passion In Nine Exercises (One Week Bootcamp)", 
    "price": "20.00", 
    "instructors": "Tony Sheng", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411456_7a6d_3.jpg", 
    "course_url": "https://www.udemy.com/find-your-passion/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T21:18:24Z"
}