{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>According to Jobvite's 2013 Social Recruiting Survey, 94% of \n recruiters use or plan to use social media to hire, and 49% of \n them assert that they've found better-quality candidates via social  \nrecruiting.</p>\n\n<p>While Twitter is getting incredibly popular among employers and \nrecruiters, it's largely under-utilized by job seekers.<strong class=\"redactor-inline-converted\"> That's your \nunique chance to get noticed and stand out</strong>. Not many unemployed people \nget Twitter and can use the tool effectively but you will,... with help \nof this course created by me, Ann Smarty.</p>\n\n\n\n\n\n\n\n<p>After years of utilizing Twitter for career growth and personal \nbranding, I've decided to put together this course teaching others how \nto:</p>\n\n\n\n<ul><li>Monitor job opportunities on Twitter</li><li>Discover <strong class=\"redactor-inline-converted\">hidden (unannounced) career growth opportunities</strong> on Twitter</li><li>Build your <strong class=\"redactor-inline-converted\">personal memorable brand</strong> on Twitter to stand out and attract recruiters</li><li>Create job opportunities for yourself</li><li>Get ready for <strong class=\"redactor-inline-converted\">job interviews</strong></li><li>Build <strong class=\"redactor-inline-converted\">business relationships</strong> with future employers and co-workers</li><li><strong class=\"redactor-inline-converted\">Build confidence and expertise</strong> in your industry</li><li><strong>Manage your reputation</strong> to make sure your future employer or interviewer are impressed with your online presence</li></ul>\n\n\n\n<p>You'll learn to use Twitter tools, understand how to use Twitter \nsearch for research and monitoring and realize how to be the first to \nseek the newest career opportunity that comes your way.</p>\n\n\n\n<p>You'll get much more comfortable with your career growth after taking\n this actionable course filled with practical advice and free downloads.\n Good luck!</p>", 
    "end_date": null, 
    "title": "Find a Job Using Twitter: Access Hidden Job Market", 
    "price": "20.00", 
    "instructors": "Ann Smarty", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/845114_66d6.jpg", 
    "course_url": "https://www.udemy.com/find-job-using-twitter-hidden-job-market/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-10T15:52:53Z"
}