{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Identify elements of your purpose to understand what makes a career satisfying for you. We find the elements of your purpose through the study of the 8 Characteristics of Purpose.</p><p><strong>Find your ideal career through understanding your purpose.</strong><br></p><ul><li>Figure out what skills come naturally to you</li><li>Research what you could do for hours without tiring</li><li>Identify what you're good at and love doing</li><li>Remember activities that trump fatigue, illness and bad moods</li></ul><p><strong>A Career That Fits You</strong></p><p>This course is meant to create an ideal career for you by researching your purpose. Whether you transform your current career or launch into a new one, you will do so by understanding yourself better. Your purpose is not meant for just one type of career. Once you understand your purpose, you can apply it to a variety of careers and volunteer opportunities.</p><p>People who take this course are able to utilize skills at work they never knew they had. By displaying a wider range of their skills, one of two things happen: either their current supervisor or boss allows them to move into a better job or new opportunities come from a different company. The heightened self-esteem that naturally results from this course has caused some employees to start their own business.</p><p><strong>Content and Overview</strong><br></p><p>We find your purpose through research. I ask you to delve into personal recollections from both your past and present to view yourself through the filters of the 8 characteristics of purpose.</p><p>To help you with this process, the video segments not only include my description of each of the 8 characteristics, but you'll also see interviews of 8 of my clients who've discovered these characteristics in their lives. They will each explain how they found at least one of their elements of purpose through one of the characteristics. </p><p>The 8 Characteristics of Purpose are built around practical definitions that are simple to identify. With my explanation as well as the 8 interviews, you'll be able to make the connection to examples in your life. </p><p>Once you've identified your 13 Elements of Purpose, you can apply them to your career so that those who matter the most can see you at your best. </p>", 
    "end_date": null, 
    "title": "Find Your Purpose; Transform Your Career", 
    "price": "40.00", 
    "instructors": "Tammi Brannan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312846_1243.jpg", 
    "course_url": "https://www.udemy.com/find-your-purpose-transform-your-career/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T13:10:39Z"
}