{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will help you choose the right career for yourself. Research has found that choosing a career that is a good fit for you will lead to higher work satisfaction, higher work performance and a greater likelihood of staying in that career. </p><p>During this course you will complete use the \"Interest Profiler\" (free) or the \"Self-Directed Search\" (10USD) to assess your work interests and the \"Work Importance Profiler\" (free) to assess your strongest work values. All of these assessments are professionally developed and regularly used by career counselors such as myself. </p><p>While these assessments are available for you to use right now without taking this course, I have found that people often have difficulties navigating the information and assessments on their own and reaping the full benefits of results. And since not everyone, for a number of different reasons, is able to work with a career counselor, I wanted to share what I consider to be the most useful professional information and tools out there that will get you much closer to making a good carer choice. </p><p>After completing your assessments, I will guide you through creating your personal list of occupations that would be a great fit and will then show you ways to research more about these occupations, so that you can gradually narrow your options down until you are able to make a choice. </p><p>To complete both assessments and do the occupation research, you should allow a minimum of two or three afternoons to complete this course and to let the new insights you will be gaining 'sink in'. </p>\n\n\n\n\n\n<p>The videos are either voice-over presentations or screencasts, where I will show you how to navigate several websites. </p>", 
    "end_date": null, 
    "title": "Find a career that fits", 
    "price": 0, 
    "instructors": "Skye Lisman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779790_1135_2.jpg", 
    "course_url": "https://www.udemy.com/making-career-choices/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T07:58:48Z"
}