{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you're considering this course, then you're one of millions of professionals who has experienced the confidence crushing experience of being fired.</p>\n\n<p><strong class=\"redactor-inline-converted\">FACT:</strong> Studies show it's harder to get a job when you are unemployed. Especially, when you've been fired. And, the longer you remain unemployed, the more challenging it is to get hired at the level you were at previously.</p>\n\n<p><strong>In this course, you will learn:</strong></p>\n\n<ul><li>How getting fired impacts your ability to job search effectively.</li><li>Why you need to get very specific with your ex-employer on their reference policies.</li><li>How to to properly answer the question, \"Why were you let go?\"</li><li>Tips for finding employers that will be willing to consider you for hire.</li><li>The must-do steps to help you put this challenging career experience behind you.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Why this course? </strong></p>\n\n<p>Author, J.T. O'Donnell is a career expert with more than 15+ years experience coaching professionals through the devastating effects of being fired. She has coached thousands of professionals on the 8-step process she has defined here, helping them to get past this negative experience so they can get their career confidence back.</p>\n\n<p>Don't let getting fired ruin your life! Instead, invest in yourself and your future and take this course so you can get back to work, move on with your life, and find the career success and satisfaction you want and deserve!</p>", 
    "end_date": null, 
    "title": "Fired To Hired: 8 Steps To Get You Back To Work", 
    "price": "50.00", 
    "instructors": "J.T. O'Donnell", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/877954_ae55.jpg", 
    "course_url": "https://www.udemy.com/fired-to-hired-8-steps-to-get-you-back-to-work/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-14T15:33:56Z"
}