{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Almost all countires restrict rules for fire protection in any workplace, and ensure that these rules are applied on the groud, so fire knowledge is no longer a lexury or extra information.</strong></p><p><strong>Join more than a thousand happy student in the strongest fire safety course on udemy, even if you have zero knowledge about safety or fire, this course is going to take your hand from the simplest fire concept to the experts playground.</strong></p><p><strong></strong></p><p><strong>It the \"SAFETY FIRST\" sign is what you see upon entering any industrai site, no job interview in a decent industrial company can exclude the fire subject. </strong></p><ul><li>A simple yet very strong guide for protection against fire hazards.</li>  \t<li>Understanding of fire concepts such as fire tetrahedron, fire risk assessment &amp; evacuation plans, flash point, etc.</li>  \t<li>Materials free for download includes: <strong>The full course materials, fire inspection checklist, &amp; a guideline for fire evacuation plan.</strong></li>  \t<li>The course structure starts with simple demonstration of fire, and fire chemistry,  developing to fire terminology, fire classes, extinguishers, and with the same simplicity ends up with fire risk assessment and evacuation plans.</li>  \t<li>Why take this course? <strong>Because fire knowledge is not a luxury, it is a life saving.</strong></li>  </ul>", 
    "end_date": null, 
    "title": "Fire Safety: Become A Fire Safety Expert ", 
    "price": "20.00", 
    "instructors": "Mohammed Saeed", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406978_70fc_2.jpg", 
    "course_url": "https://www.udemy.com/fire-safety-a-step-by-step-guide-from-basics-to-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T18:38:30Z"
}