{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You most likely have been in situations like when you go on that special date you want to dress well and present yourself to make a good impression. Or when you go to that party you want to stand out so that people may remember you.</p><p>The job interview is the same way. You need to prepare yourself in a way that is presentable and professional to get the job you want.</p><p>Too many times job seekers feel they do not have a chance in the job and just go through the motions. Or they are so afraid of looking foolish and not performing well they freeze up.</p><p>The truth is you can be the master of your job interview. All it takes is some research, preparation and confidence to make you set apart from other applicants. This course will teach you how to do this.</p><p>In this course you will learn the four steps to make the job search a success. These are:</p><ol><li>Arrival</li><li>Preparation</li><li>First Impression</li><li>Communication</li></ol><p>In the job interview it feels like there is leverage against you. You do not know what the interviewer is thinking or what is going on behind the scenes. This one hour course will show you how to turn that leverage around by putting job interview in your hands. Topics include:</p><ul><li>Researching the right information about the company</li><li>How to prepare to be confident and knowledgeable</li><li>The importance of the arrival</li><li>Why hygiene and appearance can make a difference</li><li>The proper communication styles that give you the edge</li></ul><p>The job interview is the most important part of any job search. It is where both parties meet and evaluate how they both fit with each other. By understanding the four steps, you will know how to approach an interview with confidence and know what to say to take you further into the process.  </p><p></p>", 
    "end_date": null, 
    "title": "Four Steps To A Successful Job Interview", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539286_341a.jpg", 
    "course_url": "https://www.udemy.com/four-steps-to-a-successful-job-interview/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T14:05:21Z"
}