{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Congratulations on getting your new degree.</p><p>This is an exciting time but I am here to start you on the journey of understanding how hiring is done so you can compete in today’s job market.</p>  <p>Typically, the first step in this process is attending a career fair.</p>  <p>These rooms are filled with college recruiters and thousands of students, your competition.</p>  <p>What is worse, is that recruiters often tell candidates that they have no jobs available and that they are just there to represent their company. First of all, that is crazy. Second of all, this is not how hiring is done anyway.</p>  <p>Most graduates want the golden developmental leadership programs, and they should. But, there are few of those jobs and many candidates. This class will teach you how to position yourself for the jobs that the company is actually advertising right now so that you can compete as an experience candidate. </p><p>This is a critical skill set that will help you have a ‘stand out’ conversation with the recruiter.</p>  <p>I am going to teach you how to </p>  <ol><li>How to      get job leads from a career fair</li><li>How to      present your information to recruiters at a career fair</li><li>Resume      customization techniques</li><li>How to      identify core skill mixes to get jobs</li></ol>  <p>You never have to go blindly into a career fair again. Instead, you will have a hyper targeted guerrilla marketing strategy that gets you in and out with maximum success.</p>  <p>There are not many chances a job candidate has for sitting down with an HR representative of a company. This is your chance to really make an impact on a wide array of employers and jobs.</p>  <p>I know many graduates want to compete as new grads, meaning someone with no experience. You are hoping your degree and enthusiasm to learn is enough. But, I am here to tell you that capturing and communicating a matching value to the employer for their open position, and identifying the ones you can compete for as an experienced candidate, is how hiring is done.</p>  <p> I am going to teach you how to do it.</p>  <p><em>I look forward to helping you achieve your career goals.</em></p>  <p>Dr. Karen Gurney</p>", 
    "end_date": null, 
    "title": "Free Resume Writing: New Graduate Resume Strategy", 
    "price": 0, 
    "instructors": "Karen Gurney", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668320_0f84_2.jpg", 
    "course_url": "https://www.udemy.com/new-graduate-career-fair-resume-strategy/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T00:08:32Z"
}