{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>El curso prepara al participante para presentar el examen de certificación ITIL Foundation in IT Service Management.<br></p>  <p>  \t <strong>    Acerca de ITIL®</strong>  </p>  <p>  \t       - Ha sido adoptado globalmente por miles de organizaciones, profesionales y consultores para auxiliarlos en la mejora de servicios de tecnología de información.  </p>  <p>  \t       - Apoya en el logro de mejoras en la calidad a la vez que permite reducción de costos de la entrega de servicios.  </p>  <p>  \t       - Facilita la medición, reporte y mejora del desempeño de los procesos.  </p>  <p>  \t       - Ha demostrado beneficios directos a los proveedores de servicios, a las organizaciones y sus clientes.  </p>  <p>  \t       Existen cuatro niveles de certificación:  </p>  <p>  \t       1. Foundation  </p>  <p>  \t       2. Intermediate  (SOA, OSA, PPO, RCV, MALC)  </p>  <p>  \t       3. Expert  </p>  <p>  \t       4. Master  </p>  <p>  \t       Es mandatorio aprobar el examen de ITIL Foundation para avanzar en la ruta de certificación.  </p>  <p>  \t       ITIL cuenta con el soporte de toda una ruta de certificación, organizaciones de entrenamiento acreditadas (ATO, por sus siglas en Inglés) y con una gran variedad de herramientas de evaluación e implementación.  </p>  <p>  \t       Una certificación en ITIL te permitirá contar con <em>mejores oportunidades labores</em> en el futuro, al ser una certificación bien cotizada en las organizaciones. Durante los últimos 6 años ha permanecido como una de las 10 certificaciones mejor pagadas en las áreas de TI de la región.  </p>  <p>  \t     En +90 sesiones: se presenta la visión que plantea ITIL sobre la Gestión de Servicios de TI. Se ha procurado que cada una de las clases se concentre en un tema específico, con la finalidad de acceder de manera más ágil a cada tema en caso de consultas futuras.  </p>  <p>  \t           Los participantes podrán reconocer la necesidad de:  </p>  <ul>  \t<li>Alinear la estrategia de Gestión de Servicios de TI con los objetivos del negocio.</li>  \t<li>Cambiar el enfoque de implementación de las mejores prácticas, de una orientación a procesos aislados hacia considerar el ciclo de vida del servicio como factor clave para lograr la satisfacción del cliente y del negocio.</li>  </ul>  <p>  \t           Al finalizar el curso, los participantes obtendrán el conocimiento y comprensión de los siguientes temas respecto a ITIL:  </p>  <ul>  \t<li>La Gestión de Servicios como una práctica</li>  \t<li>El Ciclo de Vida del Servicio</li>  \t<li>Principios fundamentales</li>  \t<li>Conceptos Generales</li>  \t<li>Procesos definidos para la gestión de servicios</li>  \t<li>Roles que plantea ITIL</li>  \t<li>Funciones </li>  \t<li>Arquitectura y tecnología</li>  \t<li>Las competencias y entrenamiento necesarios</li>  </ul>  <p>  \t <strong>Nota Importante:</strong> El examen de certificación de ITIL Foundation NO esta incluido en el precio del curso.  </p>  <p>  \t <strong>Cómo lograr la certificación en ITIL Foundation v3</strong>  </p>  <p>  \t     1. Toma el curso de Fundamentos de ITIL v3, +90 sesiones cubriendo la terminología, estructura, conceptos y procesos. Se incluyen vídeos, Notas del Estudiante, Mapas Mentales, guías de estudio y una simulación del examen de certificación.  </p>  <p>  \t     El estudio esta calculado en 20 horas.  </p>  <p>  \t     2. Toma el examen de certificación. Puede ser en linea o presencial. Consulta a nuestros asesores para guiarte en la contratación del examen de certificación. informes@inteli.com.mx  </p>  <p>  \t     Para más información, puedes consultar el sitio web INTELI(.)com(.)mx</p><p><br></p><p>Nota: Los precios están expresados en dólares (USD).</p>", 
    "end_date": null, 
    "title": "Fundamentos de ITIL v3", 
    "price": "25.00", 
    "instructors": "INTELI,  ITIL Experts, Rebeca Gabriela Pimentel Zaragoza", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191072_30ee_10.jpg", 
    "course_url": "https://www.udemy.com/fundamentos-de-itil-v3/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-30T01:49:23Z"
}