{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t                        Are you ready to start your forensic career? Not sure <em style=\"\">how</em> to get started? Are you a recent graduate with a degree in Criminal Justice/Criminology/Administration of Justice? Are you looking to start a new career? If so, then this is the course for YOU!  </p>  <p style=\"\">  \t                      Learn the 10 steps needed to set yourself apart when applying for forensic positions. Learn how to network with forensic professionals, how to enhance your college degree and how the forensic related shows, such as Bones, CSI, and NCIS, help you learn forensic terminology, vocabulary, and the scientific process.  </p>  <p style=\"\">  \t                      This one hour introductory course includes downloadable resources that will help start your forensic career and is delivered in short concise presentations  outlining each step.  </p>  <p style=\"\">  \t        I&#039;m positive these tips will help you get started networking with forensic professionals who can help you build your forensic contact portfolio.  </p>  <p style=\"\">  \t      NEW UPDATES SEPTEMBER 2014  </p>  <p style=\"\">  \t      Added new lectures about the CSI Effect (found in Lecture 6) and a new forensic career path, Veterinary Forensics (found in Lecture 11).  </p>", 
    "end_date": null, 
    "title": "Get Hired! 10 Ways to Start a Forensic Career", 
    "price": "20.00", 
    "instructors": "Terri Armenta", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130632_6853_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-forensic-job-10-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-07T22:23:57Z"
}