{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>A Letter From Me To You</strong></p><p>Hi There,</p><p>I'm Nic and I'm here to help you find the job of your dreams. </p><p><strong>Before starting my career as an Employment Consultant the average time it took me to find a new job was 4 hours</strong>. </p><p>Yes! You did read that right. I'm here to show you the exact strategies I have used so find a new job so quickly. But first, I should probably clear up who this program is for because it won't be for everyone.</p><p>This is a program  designed only for action takers. It's not the sort of course where you sit around watching videos without ever taking action. You will need to do the work. Yes, there are videos (over 30 of them) and I will teach you how to design a resume that gets results, get noticed by prospective employers and find your dream job in 30 days but..................<strong>every single video has action steps you need to complete before you do the next module.</strong></p><p>You will need to blot out time in schedule. The program is intense and is meant to be taken over 30 days. That said, if you have a very limited schedule you may choose to take it over 30 weeks instead. I don't mind but you will need to set time aside to complete the activities.</p><p>I keep the videos short and sweet but the course comes jam packed with resources to help make your job search a success. </p><p><strong>Think 'done for you' templates and scripts, questions and work sheets and additional video resources, all specifically designed to rocket fuel your job search and get results.</strong></p><p>In return you will need to rise to the challenge and complete all  action steps before moving on to the next module. There will be days where you don't want to log on, days where you are tempted to 'give it a miss' and activities that  push you completely out of your comfort zone. It's not called a boot camp for nothing! But if you do the work and see it through you will get results and find the job you love . </p><p><strong>This program is not for everyone. It's only for people willing to turn their career dreams into reality and who are prepared to do the work and take action to make it happen.</strong></p><p> If you prefer to sit around watching 'how to' tutorials while eating marshmallows without taking action, it's not the right fit for you.</p><p>BUT................if you are prepared to do the work, take action and are ready to rocket fuel your job search this is the only program you will ever need and I'd love to see you join the team. I've even created a special Facebook group where you can meet other challengers, grab some extra motivation, network, ask for help and find support during your journey.</p><p><strong>Are you ready to take action and turn your career dreams into reality? YES!  I can't wait to see you in Boot Camp!</strong></p><p>To Your Success</p><p>Nic</p>", 
    "end_date": null, 
    "title": "Get The Job 30 Day Boot Camp Challenge", 
    "price": "20.00", 
    "instructors": "Nicole Coggan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502672_eb37_9.jpg", 
    "course_url": "https://www.udemy.com/get-the-job-30-day-boot-camp-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T07:46:35Z"
}