{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Are you tired of submitting the same boring resume to hundreds of employers with no response regardless of how much time and effort you put into the application and cover letter?</strong></p>\n\n<p>The big problem is that nearly all employers are accustomed to viewing thousands of dry resumes with nothing but text and numbers. With so many applications it is really easy for employers to overlook your qualifications because they are barely paying attention while sifting through an ocean of resumes. To gain a competitive edge you need to stand out. That is why I created this course! In this course you’ll learn how to make a single interactive PDF Resume Portfolio that is guaranteed to draw laser focused attention onto you! Imagine how great you’ll feel when dozens of employers are calling you back for an interview!</p>\n\n<p><strong>You will learn:</strong></p>\n\n<ul><li><strong>Why the old method of submitting resumes does not work!</strong></li><li><strong>Why PDF Resume Portfolios can increase conversions! </strong></li><li><strong>How to install, create, and polish a PDF Resume Portfolio</strong></li><li><strong>And so much more!</strong></li></ul>\n\n<p>I’m Serving over 9,000 students daily! Across more than 130 countries! With more than 150 five star reviews! This course is updated frequently! I will answer all of your questions! There is even a no questions asked 30 day money back guarantee! When you enroll in this course you have instant lifetime access which includes every update and the ability to reach out to me for help! It is time for you to position yourself for success! Just click the “Take This Course” button now and I will see you on the inside my friend!</p><p><strong>I last updated this course on 10APR2016!</strong></p>\n\n<p><strong>UPDATE - 10APR2016: </strong>I updated the intro and outro sections of the course!</p>\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "Get Hired With A Rock Star Interactive PDF Portfolio Resume!", 
    "price": "20.00", 
    "instructors": "Success Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785386_3224.jpg", 
    "course_url": "https://www.udemy.com/get-hired-with-a-rock-star-interactive-pdf-portfolio-resume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T20:46:15Z"
}