{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Did you know that the College Preparation process actually starts when your child is in 9th Grade?</p><p>In this Course, College Preparation Expert -- Michael Mastroianni -- will guide you through the MAZE, nay, the JUNGLE of the College Search, College Preparation and College Admission process.</p>Michael will give you the ROADMAP and massively valuable \"knowledge-gold bars\" in this Course -- so that you and your teen can begin preparing for College NOW.<p>As a parent of a high school student -- would you base one of the most important decisions of your child's life on a 15-minute conference with a High School Counselor? Or a 1-hour meeting in a School Cafeteria?</p><p>The College Search and College Application process can be daunting and overwhelming!</p><p>Let's face it.</p><p>You're going to spend between $20,000-$135,000 on college tuition.</p><p>Before you do, let College Preparation Expert -- Michael Mastroianni -- give you and your child the UNFAIR ADVANTAGE.</p><p>Do you have countless hours to spare -- to gain the know-how to navigate through the maze of websites, search for a college, a financial aid package OR select the right major for your child?</p><p>Michael can prepare your team to navigate the ins and outs of College Admission and Financial aid.</p><p>Section 1 -- Did you know that College Preparation starts in the 9th Grade? Find out WHY and WHAT to do  -- so that you can set up your child for incredible success in the College Application and College Preparation process.</p><p>Section 2 -- Selecting a College and a Major. You'll receive the \"Get Knowledge for College -- Customized College Planning for Parents\" Kit and valuable takeaways from each Lecture.</p><p>Session 3 -- Acing the Admissions Process. Learn about the ACT, the SAT, What Colleges Look for in Applicants, and What College Admissions Options best suit you and your child.</p><p>Session 4 -- A+ Applications. Here's where you get Proven Success Strategies for filling out College Applications, your child can learn tested Interview Skills, write a Winning Resume, write a College Essay that Gets the Admission Director's attention instead of it being DENIED, and make the final College decision a piece of cake.</p><p>Session 5 -- Financial Aid and Scholarships. You'll save hundreds of hours from having to wade through the massive number of college websites and voluminous information about financial aid. This Session alone is worth the entire investment you'll make in this Advanced course.</p><p>Session 6 -- As an outstanding and valuable BONUS, Michael is giving away not only his Tested Principles, Proven Strategies and Tactics on how to successfully apply for and get into the college of your choice, but also how your child can THRIVE and succeed in college.</p><p>This ADVANCED course will bring the vast expertise and knowledge of Michael right to your home. He has helped THOUSANDS of high school students (with their parents) apply for and get accepted into colleges that best suited them.</p><p><br></p>", 
    "end_date": null, 
    "title": "Get Knowledge for College Mastery Course", 
    "price": "30.00", 
    "instructors": "Michael Mastroianni", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544874_b478_3.jpg", 
    "course_url": "https://www.udemy.com/get-knowledge-for-college-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T16:39:50Z"
}