{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>**UPDATE</strong>: Now get an additional course about Resumes completely FREE!</em></p><p><em><em></em></em></p><p><strong>What you get from this Job Interview course:</strong></p><ul><li><strong>Lifetime access to the course</strong></li><li>Access to all updates and new material at no extra charge</li><li><strong>30 day money-back guarantee</strong></li><li>My time to answer any questions or help in every way I can</li><li>Video lectures, printouts, lecture guides, examples, references, and more</li><li>Ability to watch on your computer or mobile device</li><li><strong>A course with Resume review examples completely FREE</strong></li><li>Another Resume Writing course at a big discount</li></ul><p>.</p><p><strong>Why this course is valuable to you:</strong></p><ol><li>It explains the goal of most interviews <em>so you can actually prepare correctly</em></li><li>It explains the different types of interviews <em>so you aren't caught off guard</em></li><li>It shows you how to prepare for interviews <em>so you have confidence and can relax</em></li><li>It shows you how to act during the interviewer <em>so the interviewer is at ease</em></li><li>It gives you many possible interview scenarios <em>so you have an idea of what to expect</em></li><li>It gives you several examples of how to answer questions <em>to get you started</em></li><li><em></em>The course goal is to help you <strong>Get Your Dream Job</strong></li></ol><p>.</p><p><strong>About the course:</strong></p><p>The goal of this course is to help you get a job offer for your dream job. To get great offers you have to ace the interview, so this course shows you how to do that. More than just covering interview etiquette, the course will explain what REALLY matters in interviews from my perspective, and I've been involved in many, many interviews on <em>both </em>sides of the table. The course can help you in your career development so you are more prepared for all interview situations and more likely to get your dream job offer from the interview.</p><p>We will go through some sample interview questions, but the goal of this course is not to provide possible answers for potential interview questions! Instead it is about giving you the tools you need to answer any question you're asked, and make a strong impression regardless of whether you practiced 200 sample questions or not.</p><p><em>I want this course to help you advance and succeed in your career so if you don't find it valuable you can get a full refund for the first 30 days</em></p><p>.</p><p><strong>Who should take this course:</strong></p><ul><li>Students looking for internships</li><li>Students looking for full-time roles</li><li>MBA students</li><li>People interested in Career Development</li><li>Working professionals thinking about a new role or a new company</li><li>Anyone that would like to learn more about interviewing</li></ul><p>.</p><p><strong>Course structure:</strong></p><ol><li>Introduction and Overview</li><li>Interview Basics: Types of, Reasons for, Formats, Types of Questions</li><li>Interview Preparation</li><li>Interview Mastery</li><li>Interview Checklists: Recap and Handout</li><li>Interview Question: Examples worked out</li><li>Next Steps: Landing Your Dream Job &amp; Being Successful</li></ol><p>.</p><p><strong>About me:</strong></p><p>I sure don't have everything figured out, but I've had a lot of experience being interviewed, interviewing others, and helping other folks be successful in their interviews. There is a lot of information out there on how to ace your interview. But in my experience much of it is either very generic (i.e. have a good handshake), or very specific (i.e. an example answer to one possible interview question). The perspective I will share with you is 100% my own and it is based solely on my experience. Everything I give you comes from real-life:</p><ul><li>What has helped me get a lot of great offers</li><li>What I've seen help other people land fantastic jobs</li><li>The mistakes I've seen people make that I've been interviewing</li></ul><p>.</p><p>I'm confident it will help you as well, so why not <strong>Take This Course</strong> <em>today</em> and start knocking your interviews out of the park before somebody else gets that job offer!</p><p>-<em>Andrew</em></p>", 
    "end_date": null, 
    "title": "Get Your Dream Job - Interview Tips, Training & Techniques", 
    "price": "20.00", 
    "instructors": "Andrew Tye", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514294_efc8_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-ace-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T03:32:22Z"
}