{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> <strong>JOIN 2,500+ OTHER STUDENTS LEARNING HOW TO DOUBLE YOUR SALARY IN 4 YEARS!</strong> </p>\n\n<p> <strong></strong>In this course, I'll be teaching you the exact methods that I used to double my salary without 4 years, allowing me to get out of $25,000 of debt, save up 5 years of living expenses and quit my job to start my own business. </p>\n\n\n\n<p> <strong>What is my experience on the topic?</strong> </p>\n\n\n\n<p> Between 2007 and 2013, I was able to double my salary at my full time job. In doing so, I was able to pay off $25,000 of debt, save up 5 years worth of living expenses and quit my job to start my own business. I now have a location independent online business that allows me to work from anywhere and still make a comfortable living. </p>\n\n\n\n<p> <strong>Who is this course for?</strong> </p>\n\n\n\n<p> It's for the person who's looking to raise their income so they can get ahead. It's right for the person who is willing to make big changes in order to succeed financially. It's for you if you have big things you want to do with your life and need financial padding to do so (which is most of us)! </p>\n\n\n\n<p> <strong>Who is this course NOT for?</strong> This course isn't for people who don't have an open mind and aren't willing to put in a whole bunch of good old fashioned hard work. It's not for people who don't have big dreams and it's definitely NOT for people who aren't willing to put in tons of work and sacrifice to make financial success a reality. </p>", 
    "end_date": null, 
    "title": "Get That Big Raise: How to Double Your Salary in 4 Years", 
    "price": "25.00", 
    "instructors": "Kraig Mathias", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460024_2c97_12.jpg", 
    "course_url": "https://www.udemy.com/how-to-double-your-salary-in-4-years-without-kissing-butt/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-26T20:51:10Z"
}