{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This simple and straightforward course will show you how to get your first job in sales - meaning you can join some of the highest paid people on the planet. </p><p><strong>Learn everything you need to get you on a the fast track to a sales career </strong></p><p><strong></strong>What are our students saying:<strong></strong></p><p><strong></strong></p><p><strong>\"</strong><em><strong>This is a fairly short course but to the point!  I'm pleased that it addresses some common beliefs about getting a sales job or fears like what if I don't have any experience.  I\n got interested in this because sales seems to be a skill that once you \nget it you will always depend on yourself, and not someone else, to make\n money.  So this is great for anyone who wants to get into the sales business.\"</strong></em></p><p><strong></strong><strong></strong></p> <ul><li>Learn everything you need to know from scratch, quickly and simply - so you can land your dream job fast</li><li>Discover the best ways to promote yourself - so you stand out from the crowd - making you the 'obvious' choice for any sales role</li><li>Build  strong self-belief and confidence - making you ready and relaxed for an interview</li></ul><p>Salespeople are paid for what they know in practice, rather than what it says they know on paper - in other words <em>anyone</em> can make it in sales, even without the '<em>right</em>' qualifications. This course will steer you into the fast lane of practical knowledge, knowledge that you can immediately put into practice - and ultimately that is what your future employer wants.</p><p> This course is the sum of all my experience as a successful salesperson and salesperson manager, molded in one practical guide.  I've 'walked the talk', and so can you by following the simple steps in this course.</p><p><strong>About the course</strong> </p> <ul><li>I designed this course to be easily understood by absolute beginners - so that anyone, even without sales experience,  can follow the simple steps and get a job in sales </li><li>As you complete each of the course modules, you will grow in confidence  - so you can land your first sales role in the shortest amount of time </li><li>Step-by-step, you will learn how to prepare for that all important interview the easy way using simple examples to build your confidence  and beat the competition - so you get your first job offer faster </li><li>Learn how to be ready for those 'awkward' questions, even if you have no sales experience whatsoever - and so make yourself the prime candidate for any role</li><li>By the end of the course you will have amassed the self-belief and confidence to apply for and get a job in sales</li></ul><p><strong><em>Q: Is it really possible to get a job in sales without sales experience?</em></strong></p><p><strong><em>A: Absolutely! It's all about knowledge and confidence - and by the end of the course you will have the skills and confidence to get a great and well-paid job in sales.</em></strong></p><p><strong><em></em>***And on top of that, Udemy offer a 30 day money back guarantee, so if you decide the course is not for you - you have nothing to lose! But still can make use of all the new skills you have learned.***</strong></p><p><strong><em>Join this simple, fun, guaranteed and action packed course today!</em><em></em></strong><br></p>", 
    "end_date": null, 
    "title": "Get a Job in Sales: Your Fast Track to Career Success", 
    "price": "20.00", 
    "instructors": "Stephen Atkinson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453220_52a5_5.jpg", 
    "course_url": "https://www.udemy.com/get-a-job-in-sales-your-fast-track-to-success/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T16:56:50Z"
}