{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        This is your ultimate guide to answering the top 10 most asked interview questions.  By the end of this course you will be prepared, confident and focused. As a result you will stand out for all the right reasons!  </p><p><strong>**UPDATED OCTOBER 2015**</strong></p>  <p>  \t<strong>Master how to answer the top 10 interview questions today and get the job you deserve.</strong>  </p>  <ul>  \t<li>know your baseline starting point </li>  \t<li>understand and appreciate the top 10 most asked interview questions</li>  \t<li>appreciate why interviewers ask them</li>  \t<li>understand the reasoning behind each question</li>  \t<li>understand and appreciate what makes a poor answer</li>  \t<li>examine in detail examples of poor answers</li>  \t<li>understand and appreciate what makes a skilful answer</li>  \t<li>examine in detail examples of skilful answers</li>  \t<li>describe what key sources of pre-interview there are</li>  \t<li>practice and answer in turn using the unique templates I have designed</li>  \t<li>complete a post course critical learning exercise to see how far you have come</li>  </ul>  <p>  \t<strong>A adaptable, powerful skill set that will see you through any new job or promotion interview</strong>  </p>  <p>  \t      Learning how to answer the most frequently occurring interview questions puts you 'ahead of the pack'. Estimates suggest that there are between 85-160 candidates per job. You owe it to yourself to be the best you can and this course will ensure you are just that.  </p>  <p>  \t<strong>Content &amp; overview</strong>  </p>  <p>  \t      For each of the ten questions I will explain what the interviewer is looking for and why they have asked a particular question. We will then look at poor and skilful answers through general approaches as well as detailed answer breakdown. Finally you can practice and develop your own answers using the unique templates I have provided for each section  </p>  <p>  \t      Included in this course are:  </p>  <ul>  \t<li>12 videos </li>  \t<li>26 lectures</li>  \t<li>10 activities </li>  \t<li>Transcripts and PDF slides </li>  \t<li>Supplementary information </li>  \t<li>Critical reflective learning opportunities - including 'baseline' and conclusion development</li>  </ul>  <p>  \t<strong>This course will provide you with the; tools, skills, techniques and confidence to be 'the candidate of choice'</strong>  </p>", 
    "end_date": null, 
    "title": "Get That Job Today! - How to Answer The Top 10 Interview Qs ", 
    "price": "20.00", 
    "instructors": "Sarah Simpson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400138_8699_5.jpg", 
    "course_url": "https://www.udemy.com/ace-that-interview-answer-the-top-10-questions-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T14:28:29Z"
}