{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>With nearly 400 satisfied students this course is putting people in employment. Now with new lecture on creating a stunning CV/Resume in as little as an hour.<br></p><p>This course is designed to get you back into work by giving you a life-style plan and laying out the path to being offered a job. The course is also a <em>must have</em> if you are looking for promotion or another job to better yourself. Written in everyday language and easy to follow we have included self assessment questionnaires, motivational cards to print off and handy prompt sheets. </p><p>The course will take about 4 hours to complete if you go straight  through but it is much better to take your time and then you will absorb everything, gain confident, self-esteem and success. It's recommended that you watch each lecture and carry out the suggestions and instructions. </p><p>The course is divided into two parts. The first is all about getting your life sorted so you are working 100% towards getting that job. Getting a new daily routine in place and following it will help you focus on getting a job. Part Two is the process of getting that job. This is broken down into three main sections: seeking vacancies, applying and getting the interview: and finally the interview itself.</p><p>Every journey starts with a single step. Take that first step by buying this course right now. And if you work hard and take enthusiastic action you will have a job within 42 days or certainly be on the right track.</p>", 
    "end_date": null, 
    "title": "Get that job you want in 4 hours", 
    "price": "20.00", 
    "instructors": "Mike Leahy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446130_3f8f_6.jpg", 
    "course_url": "https://www.udemy.com/just-the-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T22:06:05Z"
}