{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>You want to get noticed - in the workplace, applying for college, getting an internship, meeting new people or networking at local events.</strong> So many people pass right by us and we don't remember them a moment after they are out of view. Do you blend in with the crowd? </p><p> <strong>Want to learn how to stand out in a way that matters - in a way that gets you noticed?</strong></p><p>Then you are in the right place. Getting noticed requires that you know your greatest abilities and can easily, clearly and professionally share them with those you meet. </p>Most people don't know their greatest abilities and therefore are not able to share them easily, concisely and professionally. They blend in - they look and sound like everyone else. With a powerful, clear and professional branding statement, you will be able to easily share what is best in you with others - in a way that others remember. That starts by knowing yourself well (this course will help with that) and learning the format of a kickass branding statement (this course shares a branding statement template). <p><strong>This course will introduce you to a 3-step process to create and deliver a powerful personal branding statement.</strong></p><ul><li><em><strong>Step 1: Introduction to Branding Statements and the Branding Statement TEMPLATE</strong></em></li><li><em><strong>Step 2: Develop your personal inventory of abilities, passions and values to help you know you and to create the language to use in your Branding Statement.</strong></em></li><li><em><strong>Step 3: Build your branding statement with the TEMPLATE and learn to deliver it confidently and professionally.</strong></em></li></ul><p>This course is presented in 3 sections with 7 video lectures. Your course manual is included in Lecture 1.  Total teaching time is about 40 minutes. However, the videos prepare you to complete the activities and build your branding statement. </p><p>You will participate in activities to better know your unique talents, strengths and passions and interests, to be able to create the language to insert into your personal branding statement template. In a little more an hour,  you could be ready to share you branding statement with others - to share what is best in you to stand out and get noticed.</p><p><strong> Critical to your success is the course manual - be sure to download it. This will include your activities, the branding statement template and examples of branding statements to help you create yours. </strong></p><p>This short course will help you not only be able to create and deliver a powerful personal branding statement, but you will become so much more aware of yourself and your abilities to help you make wiser work and life decisions. You can't succeed in life if you don't know your and who to connect that talents you to the places in work and life that need what you do best.</p><p><strong>PLEASE NOTE - In Lecture 4, you are encouraged to take a free online Talent Assessment to help you articulate your core strengths. This assessment is called 3AboutMe and will require you to leave your name and email so that your personalized results can be sent to you. You are given the web location for this assessment in Lecture 2 - in your course manual. <em>You do not have to use this assessment, though it provides great practical information for you. Instead, you can simply chose from the behavioral words presented on page 8 of your manual to build your list of personal attributes.</em>  </strong></p><p>This course has been prepared by and is hosted by Jay Forte, MS, CPC, ELI-MP. Jay is a certified workplace and life coach, adjunct college professor in entrepreneurship, author and motivational speaker. He works specifically with students, parents and those in the workplace/ career transition. He is the author of <em>The Greatness Zone</em> - a process int story form that shares how to discover and develop your unique abilities so you can learn to build your life and work around what you do best. He writes the<em> Life's Too Big To Play Small </em>blog  and the <em>Ready For Life Blog</em> for parents and teens/young adults. Jay lives in Ft Lauderdale, FL. </p>", 
    "end_date": null, 
    "title": "Get Noticed! 3 Steps To Create A Personal Branding Statement", 
    "price": "20.00", 
    "instructors": "Jay Forte", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535336_a67f.jpg", 
    "course_url": "https://www.udemy.com/get-noticed-3-steps-to-create-a-personal-branding-statement/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T18:06:49Z"
}