{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you need a job? Do you need a career change? Are you sending out resumes, but not getting the responses you are hoping for? If so, then this course is for you! We provide a step-by-step, outside the box approach to help you get past the Human Resources Gatekeepers, allowing you to get the job offers you crave! </p><p>We accomplish this great result by providing you information that is seldomly used by job seekers, but is known to be effective to the rate of 9 out of 10 people using these resources receive the job offer for the position they applied the principles to. These are tips directly from the professionals that do the hiring for big businesses and small businesses alike. These principles are from those professionals that you will be sending your resume to! Who else would you want to take advice from in your job search?</p><p>This course will provide you with information that is not hidden, but very few job seekers have heard of it, and even less have put it into action. Remember that action is what will separate you from your competition in getting the job offer for the positions you are applying to. These principles will take you from the very first step of finding a job posting, to the submission of your resume, and even on to finishing the interview and getting your job offer! </p><p>The lectures within this course include the following material and/or topics:</p><ul style=\"\"><li>When should you look for a job?</li><li>How helping others, and expecting nothing in return, is your best way to find a job when you don&#039;t need one.</li><li>How to analyze job postings and pick out what the business wants to see on your resume.</li><li>What sections and keywords are important for your resume.</li><li>How to find information about the business you want to work for.</li><li>How to find out who you will interview with.</li><li>How to use information you can find on social media within your face-to-face interview.</li><li>How to think like the HR team thinks, and using it to get past the gatekeepers to get an interview with the hiring manager.</li><li>Understanding why it is important to adapt your thinking to that of the Human Resources department, and accepting that they are right whether we agree with their thought process or not.</li><li>Learn how to put all of these principles together and get a job interview.</li><li>How to ace the interview.</li><li>How to answer common interview questions which are designed to trip you up. </li><li>Learn how to get noticed, and how to GET THE JOB OFFER!</li></ul><p>All of this material is something that will be accepted by the majority of businesses you are applying to. If you want more out of your career search, then let&#039;s get started!</p>", 
    "end_date": null, 
    "title": "Get the job YOU want (Dream Job) By Thinking Like HR Does", 
    "price": "20.00", 
    "instructors": "Dr Jeffrey White", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461408_94c9_2.jpg", 
    "course_url": "https://www.udemy.com/get-the-job-you-want-dream-job-by-thinking-like-hr-does/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T13:57:31Z"
}