{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Nothing is guaranteed, but everything is possible: that is the ethos of the Flying Start Job Programme.</p><p>The Flying Start Job Hunt Programme speaks to students in a way that has never been done before: there are home truths, insider tips and a nurturing approach. There is a demand for hard work and a sense of initiative, but also a reassurance that all will be well for those who have the want to succeed and make their own way in the world.</p><p>The reality is that applicants for graduate and entry-level roles are not properly equipped with the skills needed for the applying and interviewing process.</p><p>Programme developer Tim Carrington has built his career over the last decade in the recruitment industry, but not before he worked across several sectors, acquiring skills across the board and taking valuable advice and life lessons from people in all walks of life. A successful business owner with global experience and a passion for helping young people, Tim decided something needed to be done to help our younger generation. </p><p>Tim is keen to ensure he passes on what he can to those just starting out. He is a motivator: dedicated to assuring tomorrow’s workforce is skilled, able and forward-thinking.</p><p>The Flying Start Job Hunt doesn’t set out to replace the conventional careers advisory structures that are in place. In fact, those structures are an essential cornerstone for youth. But, Tim is qualified- with proven results, to offer young job hunters this fresh take on applying for those first roles.</p><p>At the end of the course students are able to fill out the downlaoable form and send it back to him for review. This is all part of the service that the Flying Start Progamme offers. This is about students getting a qulaity experience and one they can thank Tim for later in life.</p>", 
    "end_date": null, 
    "title": "Getting your first job- Learn what Human Resources want", 
    "price": "20.00", 
    "instructors": "Timothy Carrington", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730944_0ec9_2.jpg", 
    "course_url": "https://www.udemy.com/flying-start-job-hunt/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-17T09:35:54Z"
}