{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>When it comes to job searching, most people go to the ¨traditional¨ or published job market the job ads section of the newspapers, job banks, such as Monster or Indeed or recruiting agencies. What most job seekers don´t know is that those job search resources only cover a small percentage, from 10 to 30 percent of all positions available at any time. This fact explains why sometimes is so hard, for well qualified candidates, to find that the job they are looking for.</p><p>That´s why I have created ¨<strong>Job Search Insights: Getting Ahead in the Unpublished Job Market</strong>¨.</p><p>On this video course you will learn the strategies to tap into the unpublished job market where 70 percent of the job market positions are available, including over 80 percent of all six-figure salary positions.</p><p>On this video course you will learn:</p><ul><li>What is the unpublished job market and why you should include it as part of your job search strategy.</li><li>How\nand\nwhere to go to research on a company of interest</li></ul><ul><li>How to use your network to enhance your job search</li><li>Learn the art of informational interviews, one of the least used, but most effective means of getting the information you want about a company, industry or job position.</li><li>How to use five methods to contact your target companies directly, the pros and cons of each and how to identify the right person to contact within you list of target companies.</li></ul>", 
    "end_date": null, 
    "title": "Getting Ahead in the Unpublished Job Market", 
    "price": "20.00", 
    "instructors": "Ramon Torres", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565544_ae23_2.jpg", 
    "course_url": "https://www.udemy.com/job-search-insights-how-to-uncover-the-hidden-job-market/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T23:35:09Z"
}