{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you wish there was step-by-step guide you could follow to get an awesome job in the engineering or technology fields? Well, there is now! Welcome to Your Best Tech Job EVER.</p><p>This course will give you that step-by-step guide so you can stand out, beat the competition, and get strong offers at hot companies in the tech and engineering fields. All without wasting effort on things that don't work.</p><p>I developed this process to get my current job shooting stuff into space for a South African billionaire genius, after having great interviews with top companies like Google, Beats, Apple, the Hyperloop project, Kaiser Permanente and Medtronic, and actually getting multiple offers from several of them. I've also worked directly with job coaches and tech recruiters to make sure these best practices will work for you.</p><p>This is a complete, easy to follow program where each step builds upon the previous step. In this course we'll cover:<br></p><ul><li>How to size yourself up while you prepare to apply</li><li>Doing in-depth research on your company and position</li><li>Creating attention-getting applications</li><li>Skipping the job board and getting straight to the decision-makers</li><li>Various interview types: informational, phone, presentations, whiteboarding, groups, 1:1s, and executive-level</li><li>Timing and managing your interview workflow to make your best impression at each touch point, and maximize the likelihood of getting multiple offers</li></ul><p>Each step has handouts and templates to make this process more effective and more fun, and I'm happy to answer your questions as you go through the course. I've taken the guesswork out of the process so you can focus on being your best.</p><p>In today's job market, great jobs don't always go to the smartest, or most connected, or even the best-looking (which I proved every time I interviewed) - they really come down to preparation and strategy. If you're a decent engineer, and you go through my lectures and do my assignments, you'll be scoring interviews and on your way to an awesome job that might be more interesting, more fulfilling, and help you build your skills and make more money down the road. </p><p>I'm really excited to get started with you, so check out the course description and preview content, and sign up if it's right for you. Let's take the first step towards Your Best Tech Job EVER!</p>", 
    "end_date": null, 
    "title": "Getting Your Best Tech Job EVER.", 
    "price": "20.00", 
    "instructors": "James Biskey", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623954_e211.jpg", 
    "course_url": "https://www.udemy.com/getting-your-best-tech-job-ever/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-27T19:00:03Z"
}