{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>An experienced college professor will share his insights and experience around five topics: 1) finding the right grad schools, 2) the application essay, 3) letters of recommendation, 4) the campus visit, and 5) identifying an advisor.  Each class session will cover the key ideas you need to know to help you find the program that best suits you and launches you into the career you want!</p><p style=\"\">Course Description<br style=\"\"></p>Going to graduate school is a major step, understanding the application and admissions process is key to getting the most out of the experience.  This course aims to help you get into the grad school that is the best fit for you. <p style=\"\"><br style=\"\"></p><p style=\"\">Knowing the Unwritten Rules</p><p style=\"\">Like so many other endeavors, the application and admissions process for graduate school can be mysterious and opaque.  In this class, you&#039;ll learn some behind the scenes tips about how admissions committees think and what you can do to best position yourself for success.<br style=\"\"></p><br style=\"\"><p style=\"\"> Contents and Overview </p><p style=\"\"> This course contains 5 lectures and associated textual material. It&#039;s designed for anyone, regardless of topics and interest areas.<br style=\"\"> </p><p style=\"\">By the end of this course, you&#039;ll have valuable skills that will help you narrow down the list of schools you are going to apply to and prepare your application plan.</p>  <br style=\"\">", 
    "end_date": null, 
    "title": "Getting into Grad School", 
    "price": "20.00", 
    "instructors": "Justin Hollander", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446776_66db_2.jpg", 
    "course_url": "https://www.udemy.com/getting-into-grad-school/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T19:25:37Z"
}