{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">The world of online Resumes and Interviews is cut-throat. Nobody notices you unless you hack your way through the digital filters that are set-up by resume sites, recruiters and interviewers. </p><p style=\"\">In this course I will show you how to get your resumes noticed and get any job you want.</p><p style=\"\">This course is tailored specifically for fresh graduates and people who have no prior work experience other than an internship or small jobs and for those who are dusting off their resume, making a fresh start after a long break from work.</p><p style=\"\">By the end of this course:</p> <ol style=\"\"> <li style=\"\">You will have identified the hot buttons for the job you are applying</li> <li style=\"\">You will have more than one finely crafted resume that will pass through the nastiest digital filters on resume sites and get the immediate attention of recruiters and hiring managers</li> <li style=\"\">You will be super confident and prepared for the interview</li> </ol> <p style=\"\">This course isn&#039;t based on academic theories of resume and cover letter writing. It is based on practical experience working in the industry at small startups, Fortune 100 companies and mentoring fresh graduates and experienced professionals for success.</p><p style=\"\">Along the way I&#039;ve been in the shoes of the interviewee and the interviewer. I&#039;ve observed, studied and understood the reasons why some resumes stands out, stand apart, while others end up in the recycle bin; why some people with less qualifications make a very positive impression while others with the best qualifications don&#039;t. </p><p style=\"\">In this course you will get to know the reasons for each of these contradictions along with tips, tricks and hands-on resume writing and interview preparation to get the job you want.</p>", 
    "end_date": null, 
    "title": "Graduates, get your Resume noticed and get the Job you want!", 
    "price": "50.00", 
    "instructors": "Kiran Davane", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516470_f59b_9.jpg", 
    "course_url": "https://www.udemy.com/buidresume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T00:11:23Z"
}