{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Graduate Job Success</strong></p><p>If you want to get your dream graduate job then this course is for you! It's essential you get your career off to the right start, and differentiating yourself from others is vital. In this course you'll learn everything you need to know from industry insiders. This course isn't just how to ace and interview, or how to write a CV, it's the entire package from choosing which graduate job to apply for, right through to negotiating your salary and accepting the offer. </p><p>Whether you've got experience of applying for jobs before or not we will give you all the tools you need. This graduate job training is packed with real life examples and practical tips, we are confident you'll be getting job offers left right and centre after this course. We've seen so many candidates miss out because of simple mistakes like giving the wrong first impression, or being too nervous, and we want to separate you from that crowd so you stand out a mile as the best candidate.</p><p>We are both highly experienced in the recruitment industry - as recruiters and entrepreneurs, as well as seasoned job-interview-winners. If you're thinking about looking for your dream graduate job then this course is a no-brainer.</p><p><strong>Graduate Job Success covers:</strong></p><ul><li>What to say in a graduate job interview to ace it every time</li><li>What interviewers are really looking for but won't tell you</li><li>How to produce a professional and compelling cover letter</li><li>Creating a CV that stands out from the crowd</li><li>Insider knowledge about assessment centres</li><li>How to answer the hardest interview questions</li><li>Where to look for the best graduate jobs to apply for</li><li><span></span>Getting your online presence perfect</li></ul><p><strong>If you're ready to get the graduate job of your dreams then sign up for our course today!</strong></p>", 
    "end_date": null, 
    "title": "Graduate Job Success", 
    "price": "25.00", 
    "instructors": "Louise Croft, Christabel Sylvester-Bradley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600260_0510.jpg", 
    "course_url": "https://www.udemy.com/graduate-job-recruitment/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T11:15:53Z"
}