{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\">  \t<p style=\"\">  \t\t                  Prerequisite:  Training, Fundamentals of Acting or equivalent experience  \t</p>  \t<p style=\"\">  \t\t                  This course is designed for advanced and professional actors as well as those with only fundamental actor training.  Program content is essential for those seeking to compete for roles in film and television (now or in the future).  The fundamental and advanced concepts in  this program are based on experience not theory and, as such, are not generally taught at most acting studios, colleges, or universities.  \t</p>  \t<p style=\"\">  \t\t                  This program’s content is based on 25 years of <u style=\"\">ongoing</u> successful experience in network television and feature film.  This course teaches you the attitude, approach and preparation, Emmy Winner GregAlan Williams undertakes for every audition--  a winning formula from the heart and soul of a winning actor. This program is essential for:  \t</p>  \t<li style=\"\">*Local Actors with limited access to real training and experienced coaching</li>  \t<li style=\"\">*LA &amp; NY Actors who want to book more roles</li>  \t<li style=\"\">*BFA/MFA Actors seeking career education</li>  \t<li style=\"\">*Stage Actors transitioning to film and television</li>  \t<li style=\"\">*Child Actors and Parents ready for the next level</li>  </ul>", 
    "end_date": null, 
    "title": "GregAlan Williams' Actor’s Guide to Auditioning", 
    "price": "50.00", 
    "instructors": "GregAlan Williams", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374718_53ea_2.jpg", 
    "course_url": "https://www.udemy.com/gregalan-williams-actors-guide-to-auditioning/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T23:18:47Z"
}