{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">¡Bienvenidos!<br style=\"\"> <br style=\"\"> Según un reciente estudio, en el 93% de los puestos de trabajo hay que hablar en público en alguna ocasión. Por ello, saber hacerlo con eficacia y destreza es hoy <strong style=\"\">una de las cualidades más apreciadas en el entorno laboral.</strong><br style=\"\"></p><p style=\"\">Sin embargo, para muchos éstos son momentos de grandes nervios, que nos atenazan, nos secan la boca y nos hacen pasar un mal rato. Con el presente curso de <strong style=\"\">&quot;Hablar en público de forma eficaz&quot;</strong> no sólo vamos a conocer las <strong style=\"\">claves fundamentales</strong> para superar estas barreras, si no que vamos a presentar un buen número de <strong style=\"\">técnicas y trucos prácticos</strong> que te convertirán en un excelente orador, logrando así una efectividad mucho mayor en tus intervenciones. <br style=\"\"> <br style=\"\"> Pero no sólo eso. A diferencia de otros cursos sobre la materia, <strong style=\"\">no nos vamos a centrar exclusivamente en enumerar las distintas técnicas</strong>, si no que realizaremos un recorrido más amplio por diferentes aspectos de las relaciones interpersonales, los estilos comunicativos, el buen uso de la comunicación verbal y el lenguaje, etc. <br style=\"\"> <br style=\"\"> <strong style=\"\"></strong>Y todo ello salpicado de<strong style=\"\"> actividades, vídeos explicativos</strong> <strong style=\"\">y tests de autoevaluación al final de cada módulo del curso</strong> que te aportarán un conocimiento más profundo de la materia. Por ello, te aconsejo que visiones los vídeos y hagas las actividades. Cuando lo hagas verás que los vídeos son también distintos a lo que podemos esperarnos de un curso profesional tradicional, ya que se ha pretendido buscar ejemplos que apoyen y aclaren la teoría de una forma amena e inesperada. Así, nos encontraremos con cortes de películas, de conferencias internacionales, de programas de entretenimiento, de anuncios de la tele...<br style=\"\"> <br style=\"\"> Las actividades, por su parte, no son de obligada realización ni tienen que ser enviadas al tutor para su corrección. Son actividades pensadas para hacerte practicar las técnicas presentadas, o bien para hacerte pensar, para que te pares y reflexiones sobre la materia de estudio, y que lo hagas de una manera diferente a la habitual, mucho más entretenida y también mucho más efectiva. Por supuesto, aunque no sea obligatorio enviarlas, si lo deseas podrás hacerlo siempre que quieras para profundizar en el tema, debatir puntos de vista o pedir mi opinión.<br style=\"\"> <br style=\"\"> <strong style=\"\">En definitiva, te presento un curso diferente, basado en el principio de que otra manera de enseñar es posible.</strong><br style=\"\"> <br style=\"\"> Aconsejo realizar el curso de forma pausada, sin prisa. Leyendo las lecciones con calma, viendo los vídeos presentados y realizando las actividades propuestas.<br style=\"\"> <br style=\"\"> Por último, <strong style=\"\">he completado el curso con dos módulos muy útiles acerca de la comunicación y la asertividad</strong>, que servirán para aportar más claves que podrás aplicar en tus intervenciones en público... y también en cualquier tipo de relación interpersonal que emprendas.<br style=\"\"> <br style=\"\"> Espero que te guste el curso y que te sea de utilidad. ¡Te espero!</p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">Un recorrido completo de aprendizaje de las habilidades comunicativas</strong><br style=\"\"></p><p style=\"\">Este curso se incluye dentro de la serie de cursos dedicados a mejorar nuestras habilidades comunicativas, tanto en el entorno profesional como en el personal. La serie completa la componen:</p><blockquote style=\"\"><ol style=\"\"><li>- Hablar en público de forma eficaz</li><li>- Técnicas de liderazgo: aprende a ser un buen líder</li><li>- Habilidades de negociación y persuasión</li><li>- Habilidades comunicativas (CURSO COMPLETO Hablar en público + Liderazgo + Negociación y persuasión + Comunicación no verbal)</li></ol></blockquote><p style=\"\">Todos los cursos están disponibles en esta plataforma. Si estás interesado en cursar uno o varios de ellos, contacta conmigo para ofrecerte una promoción.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Hablar en público de forma eficaz", 
    "price": "20.00", 
    "instructors": "Antonio Santos", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455762_0ca4_5.jpg", 
    "course_url": "https://www.udemy.com/hablar-en-publico-de-forma-eficaz/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T14:24:34Z"
}