{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t         If you&#039;re not getting the results you want with your resume than this course is for you.  </p>  <p>  \t <em style=\"\">Learn the secrets of writing a GREAT RESUME that will help you land your dream job.</em>  </p>  <p>  \t <strong style=\"\">Learn how to hack your resume to get the results you want!</strong>  </p>  <p>  \t             Resume hacking is the process of creating a resume using techniques and methods to OPTIMIZE YOUR RESUME for the modern day job hunt. These are proven methods directly from the mouth of recruiters and hiring managers. Resume hacking is about getting the results you want and making your overall <em style=\"\">job hunting experience more efficient.</em>  </p>  <p>  \t<strong style=\"\">Why I created this course:</strong>  </p>  <p>  \t                 Not long ago, I couldn’t land an interview to SAVE MY LIFE! I applied to hundreds of jobs only to get the dreaded “Thanks, but no thanks” form letter (or worse, I wouldn’t hear anything at all).  </p>  <p>  \t                 After hundreds of hours of research including interviews with hiring managers, recruiters and headhunters,  I learned how to &quot;hack&quot; my resume and started <em style=\"\"><strong style=\"\">landing interviews and job offers from top companies.</strong></em>  </p>  <p>  \t                 With the information, I’ve helped hundreds of people land their dream jobs by understanding how to create resumes THAT WORK.  </p>  <p>  \t<em style=\"\">   Now its your turn…</em>  </p>  <p>  \t              This course is meant to be a resource to you in your job hunt. It covers the process of writing a great resume IN DETAIL with over 3 hours of content, templates and a variety of external resources. On top of that, I will be available to answer your questions!  </p>  <p>  \t<strong style=\"\">Reviews</strong>  </p>  <p>  \t        Stephanie  </p>  <p>  \t<em style=\"\">As an agency recruiter, I&#039;d like to say THANK YOU for creating this. You nailed what my colleagues and I are continuously telling applicants and friends: we can&#039;t help you if we never see your resume, and we won&#039;t see your resume if you never turn up in our searches because your resume is missing relevant information (or it&#039;s misspelled). I will definitely be sharing this!</em>  </p>  <p>  \t        Meredith  </p>  <p>  \t<em style=\"\">&quot;This is a great course that breaks down a frustrating, complex, and intimidating process into navigable principles. There are concrete examples and action steps so that applying for a job feels less overwhelming and more likely to lead to the job you want.&quot;</em>  </p>  <p>  \t        Joshua  </p>  <p>  \t<em style=\"\">&quot;I feel like this course was written especially for me. I am in my mid 30&#039;s and transitioning careers. TONS of great content in this course. In just the first 10 minutes I had already learned many reasons why I was having trouble with getting call backs for interviews. I highly recommend this course for anyone looking to land those top-tier jobs.&quot;</em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">Limited Time Price</strong></em>  </p>  <p>  \t             For a limited time, this course is being offered for $15, down from the original $25 price. Sign up now to save!  </p>", 
    "end_date": null, 
    "title": "Hack Your Resume to Get The Job You Want", 
    "price": "20.00", 
    "instructors": "Ibrahim Alamin", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119886_5e35_3.jpg", 
    "course_url": "https://www.udemy.com/hackyourresume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T16:55:37Z"
}