{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hello,</p>\n\n<p>Thank you so very much for taking this course! For someone whose central theme in life is gratitude, this means a whole lot to me. Thank you.</p>\n\n\n\n\n\n<p>Communicating effectively is at the core of building a great career or business. At the heart of communication is substance and style. The content you want your audience to know and how you will deliver the content. The combination of great content with memorable delivery is what makes a great speech memorable.</p>\n\n\n\n\n\n<p>Having great content is only 50% of the equation. Having a compelling delivery is the other 50%. In fact researchers would argue that content accounts only for 7% of the equation. That leaves a whopping 93% open for verbal and gestural variety to influence your audience.</p>\n\n\n\n\n\n<p>A course on Public Speaking can be about a lot of different things. It could be a broad overview of everything that goes into the wonderful world of speaking in front of an audience. However, if you are focused on building the right skills to becoming a good speaker, then you need to take a deep dive and learn the components of speaking thoroughly. </p>\n\n\n\n\n\n<p>And that is what this course does. It gives a thorough treatment to one aspect of public speaking. Hand gesturing is a big part of the gestural variety that expert speakers use to convey their information. This course will take you from the very basics to the most advanced concepts in hand gesturing. And that is why this is called a pro-series course.</p>\n\n\n\n\n\n<p>Whether you are just learning to speak in public or you are an experienced speaker, you will find a ton of techniques, tools and even traps to avoid on your way to becoming a polished speaker.</p>\n\n\n\n\n\n<p>I would love for you to build your career or take it to even greater heights by communicating your points of view powerfully and memorably. This course will help you further your communication skills in some unique ways.</p>\n\n\n\n\n\n<p>Join me as we explore the wonderful world of gesturing!</p>\n\n\n\n\n\n<p>Warmly,</p>\n\n\n\n<p>Joseph</p>", 
    "end_date": null, 
    "title": "Hand Gesturing in Public Speaking - a Complete Overview! ", 
    "price": "30.00", 
    "instructors": "Joseph Prabhakar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792554_9d58.jpg", 
    "course_url": "https://www.udemy.com/hand-gesturing-in-public-speaking/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T16:30:12Z"
}