{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    This course is designed for anyone interested in exploring high demand careers in the healthcare industry, whether as a high school student researching the best course to follow after graduation or as a person who is interested in making a career change.  </p>  <p>  \t    Overall, the healthcare industry workforce will need to expand by 30% in the next 15 years to meet the increasing demands for healthcare services, and this means that there will be many employment opportunities in many fields and specialties within healthcare.  In this course we will examine more than 20 rapidly growing careers in the healthcare industry.  We will explore the duties responsibilities of professionals in each career, the educational path one must follow to enter each career, and the projected growth and median income associated with each career.  </p>  <p>  \t    To be successful and effective in the healthcare field takes a special kind of person.  Careers in the healthcare industry are distinct from any other field because of the necessary traits one must possess to be successful and effective, and these traits are essential for all healthcare workers regardless of field or specialty. Healthcare professionals must possess an extraordinary capacity for empathy and compassion because the people with whom they work every day, the sick and injured, are extremely vulnerable.  Healthcare workers must always be aware of and able to follow laws and strict regulations governing patient care, privacy, and ethical treatment.  Healthcare workers must be reliable, organized, and detail oriented because their patients’ lives depend on it.  And healthcare workers must be capable of meeting the challenge of working every day with people in crisis.  </p>  <p>  \t    The healthcare industry is hiring, so let’s begin exploring which career option might be right for you!  </p>", 
    "end_date": null, 
    "title": "High-Demand Health Careers", 
    "price": "20.00", 
    "instructors": "Code Coach, Clay Martin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418894_240a_2.jpg", 
    "course_url": "https://www.udemy.com/high-demand-health-careers/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T02:15:34Z"
}