{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you are a driven Hotel Management student wanting to hear first-hand advice from a seasoned hospitality professional, this course is perfect for you. Without needing to commit more than 1.5hrs of your valuable time, you will quickly learn core traits you need to strive and survive in the hospitality industry, how to handle guest complaints, skills to ensure you are always productive and much more to help you become a stand-out talent in the industry. </p><p><strong>Start behaving and thinking like a seasoned manager early-on in your career.</strong></p><ul><li>Classify tasks to ensure higher efficiency and productivity</li><li>Handle guest complaints graciously</li><li>Begin identifying your future management style</li><li>Build you own career plan</li></ul><p><strong><br></strong></p><p><strong>Connect to &amp; Learn from a Seasoned Hotel Expert</strong></p><p>Learning the skil<strong></strong>ls in this course will allow you to approach your internship like no other trainee they have ever had before. The real-life stories shared in this course are genuine and the topics covered are easy to learn. They have been distilled from years of experience. Equip yourself with the perspective of a seasoned Manager and build up your organisational skills so that you make a great impression on your very first day of work. </p><p>Jobs in Hotels are plentiful but stand-out talents are hard to find. Make sure you equip yourself with this first-hand advice to help you along your career.</p><p><strong>Content and Overview</strong></p><p>Perfect for Hotel Management students and any other driven individuals just beginning their career in Hospitality, I designed this course of 13 lectures and 1.5hrs of video content for you as a means to share the knowledge and advice I wished I could have received when I first started in the Hotel industry. </p><p>Starting with an overview of the industry and highlighting important points of consideration before pursuing it as a career, students will then learn about how pivotal their role is within customer service and start to build their own career plan as to when and where they want to be futher down the line. </p><p>With these basics covered, students will then learn which traits they should focus on nurturing and developing to ensure they survive and thrive in the industry as an individual and as a manager. Students will also learn how best to organise their tasks so as to be a reliable and productive talent in the industry. Lastly, students will learn which mistake to avoid on their road to becoming a manager as well as how to handle guest complaints graciously. <br></p><p>Students completing this course will have a newfound perspective on the industry and be better equipped with guest-service and organisational skills to approach a hectic daily operation in a Hotel. </p><p><strong></strong> </p>", 
    "end_date": null, 
    "title": "Hotel Management Fundamentals: Kickstart Your Career Success", 
    "price": "35.00", 
    "instructors": "Andrea Kjellin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/549848_d62a_3.jpg", 
    "course_url": "https://www.udemy.com/hotelkickstart/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-09T07:56:19Z"
}