{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This  course will help you redesign your job hunting strategies and career path.  You'll make better progress towards the job, career, and income you want. The lessons represent over a decade's worth of research  and first-hand experience with our challenging job market.<br></p><p>  \t                In <strong>less than  two hours</strong>, you can learn how to...  </p>  <ul>  \t<li>Impress  potential employers during interviews and get them to offer you a job.</li>  \t<li>Build a network of professional relationships that will help  you get a better career.</li>  \t<li>Avoid a lot of the frustration and discouragement others experience when looking for a new job.</li>  \t<li>Learn some secrets corporate recruiters have shared about what it takes  to get a job offer.</li><li>Effectively prove that you're qualified for the job.</li></ul><p><strong><br>Over 3,000 students have already enrolled</strong> and are learning how to get a better job and income more quickly!<br></p>  <p><strong>REVIEWS FOR THIS COURSE:</strong><br></p><p>  \t              Read  what some people have said about this course:  </p>  <ul>  \t<li>Dr.  Roger Allen, an <strong>Author</strong>, <strong>Consultant</strong>, and <strong>Executive Coach</strong> said: \"I loved  your course! You've condensed tons of practical content into an extremely  usable guide for anyone who wants to either find a job or improve their skills  and value on the job.\"  \t  \t</li>  \t<li>Shannon Aragon <strong>recently got a great job</strong> and  said, \"This course helped me get motivated and organized to take  action. The content is clearly outlined which made it easy to follow and easy  to understand. The examples throughout the course were very relevant and helped  put my circumstances into perspective.\"  \t  \t</li>  \t<li>Chanchira Trirat <strong>recently completed this course</strong> and   said, \"I have done several courses on Udemy and this has been the most   well  structured and professionally put together course. It is very   clear  that Steve not only knows his subject matter but has a lot of   personal  experience on the topic which makes all the difference.  His   pre-interview preparation could mean the difference between getting the   job or not. Vital for any job searcher.</li><li>And a few others have said, \"Gave me great ideas to help pursue my       career!\"  \t                    \"Great advice about what to expect and how to       transition in my career.\"  \t                    \"Very informative and useful...helps shift  the job hunting mindset.\"</li>  </ul>    <strong><br>BONUS  LESSONS &amp; RESOURCES INCLUDE:</strong><ul><li>How to Survive Unemployment</li>  \t<li>Overcoming  <em>Under</em>employment</li>  \t<li>Advantages/Disadvantages of Contract Employment</li>  \t<li>You can also download all the audio files for  this course to listen to while you're on the go.  </li>  </ul>    <strong><br>FREE PREVIEWS  </strong>  <p>  \t              Click the Preview buttons in the course outline down below to see a free sample of the videos that will teach you how to get a better job faster<strong>.</strong>  </p>    <strong>MONEY-BACK  GUARANTEE  </strong>  <p>  \t              There's a  30-day, no questions asked, <strong>money back guarantee</strong> for this course. If you're not  satisfied, you get all your money back, it's that easy.  </p>    <strong>ENROLL NOW</strong>  <p>  \t              Click the \"<strong>Take This Course</strong>\" button at the top-right of this page to start learning how to find a better job right away.  </p>", 
    "end_date": null, 
    "title": "How to Get Hired Faster: Job Hunting Shortcuts & Hacks", 
    "price": 0, 
    "instructors": "Steve Churchill, Didactable Interactive", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273084_4ae2_35.jpg", 
    "course_url": "https://www.udemy.com/job-hunting/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-01T18:54:43Z"
}