{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Casting Intensive - Everything You need to Go from Start to Part in 30 Days!</strong>  </p>  <p>  \t<strong></strong>Fun, practical online lessons to turbo-charge your Acting Career.  </p>  <p>  \t                  This course is designed for actors of any level (beginner, intermediate, advanced) who are eager to accelerate their acting career. This is not an acting course -- our goal is to offer practical advice to help you to <strong>find casting calls, get parts, and attract the attention of an agent.</strong>  </p>  <p>  \t                  At the end of this course, every participant will be able to perform for, and receive feedback from, a <strong>real professional agent. </strong>Please note: Seminars or classes are for educational purposes only and will not secure or provide opportunity for employment in the field or representation by an agent.  </p>  <p>  \t                  Here&#039;s exactly what you&#039;ll take away from The Casting Academy:  </p>  <ul>  \t<li>The secrets successful actors use to get auditions to the most attractive roles.</li>  \t<li>Get the attention of agents and casting directors.</li>  \t<li>Get an unfair advantage when you audition for parts.</li>  \t<li>Build a fan base using social media.</li>  \t<li>Find hidden casting calls and opportunities that others miss.</li>  \t<li>Make ends meet to make money while you pursue your career.</li>  </ul>  <p>  \t                  This course is taught by Isabelle Dungan, an accomplished working actress in New York City.  </p>  <p>  \t                It doesn&#039;t matter where you live. All courses are online, and the strategies we teach are applicable anywhere in the United States.  </p>  <p>  \t                  The Casting Academy consists of 13 highly practical lessons that are are also designed to be fun and motivational. Many lessons include helpful worksheets and assignments to reinforce each unit. Each lesson is fun and full of enlightening, practical advice for your career.  </p>", 
    "end_date": null, 
    "title": "How to Be an Actor: Nail Auditions and Get Cast Fast!", 
    "price": "20.00", 
    "instructors": "Brian Hecht, Isabelle Dungan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288328_08cb_6.jpg", 
    "course_url": "https://www.udemy.com/castingintensive/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T17:06:22Z"
}