{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">People in sales often work under pressure because their income and job security depend on the amount of merchandise they sell. Some sales representatives are quite successful. Others may have a difficult time meeting goals and quotas.</p><p style=\"\">With this features, there is often change in a person&#039;s sales career. Others may want to transition from another career and try a position in sales.</p><p style=\"\">When seeking a position in sales it all starts with a great resume. This course can get you started on developing a great resume for that ideal sales position.</p><p style=\"\">In this course you will learn:</p><p style=\"\">Important features of the job search in sales</p><p style=\"\">How to structure the resume that tells about you and what you bring.</p><p style=\"\">How to create aspects of your Linkedin profile that are in line with your resume and job search efforts.</p><p style=\"\">The course is meant for anyone seeking a sales career or making a switch in their career. You must make a great first impression with any kind of hiring authority and the way to do this is with a great resume.</p><p style=\"\">In the course we will break down an actual resume and how to craft yours with the different sections. Topics also discussed include keywords, action verbs, and how to express yourself. </p><p style=\"\">The resume is the marketing tool and the item you market is you. To be in sales you must be great at marketing. This course will show you how to create a great resume that sells your skills for a career in sales.</p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "How To Create A Winning Resume For Your Sales Career", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554988_61a0.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-winning-resume-for-your-sales-career/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T01:49:35Z"
}