{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>May 2016 Update:</strong> Over 11,300 people have now taken this course, securing the job of their dreams. Some even at places like IBM.</p>\n\n<p>Stop trying to figure all this stuff out on your own, let me show you step by step, how to find and secure a better job!</p>\n\n<p>My mission is simple…</p>\n\n<p><strong>I will teach you how get a new job within 30 days of purchasing this course.</strong> Or get your money back.</p>\n\n<p>Don't believe me?</p>\n\n<p>Here's what people are saying about this course:</p>\n\n<p><strong><em>\"I got THREE job offers after taking this course\" - Elizabeth Arata McLean</em></strong></p>\n\n<p><strong>\"</strong><strong><em>Andrew is just an amazing guy, he is very engaged and honest. The lessons are well prepared and I enjoyed the way he explains things</em><strong>\" </strong>- Carlos Becerra</strong></p>\n\n<p><strong>\"</strong><strong><em>The Holy Grail of Job Interview - Just got the offer, thanks Andrew! I got the job and position I dreamed of for years\"</em> - Jae Vernon Aquino</strong></p>\n\n<p><strong>\"</strong><strong><em>I'm an HR professional, have hired hundreds of people over the years and think this is one of the most clear and informative pieces I've seen on the topic</em><strong>\"</strong> - Susan Olsen</strong></p>\n\n<p>So let's start with the facts...</p>\n\n<p><strong>FACT #1</strong> - It's still a crappy economy out there and good jobs are hard to come by.</p>\n\n<p><strong>FACT #2</strong> - There is a huge amount of competition for the jobs that do come up.</p>\n\n<p><strong>FACT #3</strong> - You're sick of applying for job after job, without hearing anything back</p>\n\n<p><strong>FACT #4</strong> - You're fed up with people saying things like “It's not what you know, it's who you know\"</p>\n\n<p><strong>FACT #5</strong> - You know you want a new job, but you feel bad for not “figuring it out\" yet</p>\n\n<p><strong>Over the last five years</strong> I have been working in and around this small, yet critical area of career development. I've worked with long term unemployed people, I've interviewed recruitment managers and specialists, I've coached and mentored corporate managers and I've seen pretty much everything there is to see on both sides of the interview desk. I've even published a book on the subject of Military personnel make the transition to civilian life!</p>\n\n<p>Over this time, I have seen thousands of Resumes/CV's, I've observed the major mistakes that bright, intelligent people make in interviews, I've trained countless corporate managers on the selection and filtering process for candidates and now, in one place, I've created a system that you can easily follow to get you a new job in 30 days - or your money back.</p>\n\n<p>Bold claim huh!</p>\n\n<p><strong>So what's inside this course?</strong></p>\n\n<p>In this course you will:</p>\n\n<ol><li>Follow a system where you take advantage of the hidden job market</li><li>Create a killer Resume/CV and cover letter that will WOW the employer</li><li>Prepare for the job interview in systematic way, that will beat the competition almost every time</li><li>Prepare for your interviews with 10 different mock interviews</li><li>Develop an ability to handle the most difficult job interview questions with ease</li><li>Learn how to negotiate salary/pay related questions in a cool, non sucky way</li><li>Boost your confidence and communication skills for every application you go for</li><li>Land a new job in 30 days (or your money back).</li></ol>\n\n<p>This course is specifically targeted at:</p>\n\n<ul><li>People who hate their job and need to get a new one fast</li><li>People who want a job that pays more money</li><li>People who want to work for a better company with better conditions</li><li>People who want to take the next step in their career in a new role</li><li>People who want to change sectors/industries</li><li>People who are ready to work for what they want, but need a guide to follow</li></ul>\n\n<p>This course is not suitable for:</p>\n\n<ul><li>People who want a quick fix without putting any effort in</li><li>People who aren't prepared to watch the entire course and make notes</li><li>People who will put this off for a few weeks. The 30 day money back guarantee starts from the date of purchase.</li><li>People who are not qualified or experienced to pursue the job they want (This is the wrong course to take. Improve your skills and experience first, and then come back)</li></ul>\n\n<p>If you think this course is for you, then go ahead and click <strong>“Take This Course\"</strong> and I'll see you on the other side.</p>\n\n<p><em>If you're still undecided about purchasing this course, then think about this….</em></p>\n\n<p><strong>You take this course and you get a new job in 30 days. </strong></p>\n\n<p>Winner.</p>\n\n<p><strong>You take this course and you DON'T get a new job in 30 days. </strong></p>\n\n<p>Get a full, no questions asked refund, anytime within the first 30 days of purchase.</p>\n\n<p><strong>You like the idea of this course , but don't believe it'll work </strong></p>\n\n<p>Check out some of the reviews that other satisfied people have left for this course. Over 85% of the reviews are 5 stars. FIVE STARS. And if 85% of my clients are wrong - Ask for a refund!</p>\n\n<p><strong>You like the course, but you aren't sure about the instructor</strong></p>\n\n<p>Search for me on twitter and say hi. Let me convince you to purchase this course in person.</p>\n\n<p>Here is a recent review from <strong>25th June 2015 </strong>by Elizabeth:</p>\n\n<p><strong><em>\"I was under qualified for the job - but got the offer anyway!</em></strong></p>\n\n<p><strong><em>This course helped me to prepare for the question that would be asked and how I should answer them. Andrew doesn't provide the answers, that info comes from your own experience. For me this was more about the body language and tone of confidence that interviewers are looking for. I have told so many people about this course. I got three job offers after taking this course! I actually enjoy the interview process now instead of being nervous! Thank you Andrew this course exceeded my expectations!\"</em></strong></p>\n\n<p>..........................................................................................................................................</p>\n\n<p><strong>C'mon, let's make your life better in the next 30 days - click on the blue button that says “Take This Course\"</strong></p>\n\n<p><em>Remember: The clock starts the day you purchase this course. A full “no questions asked\" money back guarantee is in place as part of Udemy's terms and conditions, upto 30 days after you purchase the course. If you purchase this course and sit on it for three months before starting it, the money back guarantee does not apply. And you won't have a new job - duh!</em></p>", 
    "end_date": null, 
    "title": "How to get a new job in 30 days (or get a refund)", 
    "price": "20.00", 
    "instructors": "Andrew Pyle", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23360_d24f_8.jpg", 
    "course_url": "https://www.udemy.com/howtoprepareforaninterview/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-21T19:09:04Z"
}