{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>I know how it feels; I've been there.</p><p>Laying in bed feeling this explainable 'empty hole', a feeling of confusion about what we're actually here for, a feeling that is tugging quietly at our sleeve to tell us that there is something more we should be doing.</p><p>I know how it feels when it seems like everyone else has got their life sorted, like everyone has uncovered this burning 'passion' and purpose for something and yet we havn't found our 'fire' yet.</p><p>But never fear!  I couldn't deal with the growing restlessness and so went on a mammoth journey of personal development, training, self-discovery and learning.  I delved into my past, present and future and slowly began to find my true self, which has now enabled me to build a successful business around my natural professional calling - and I've never been happier.</p><p>In this course, i will provide you with 20+ tutorial videos that present some of the ideas, activities and methods that helped me most along my own journey of 'finding my professional purpose and business niche'.</p><p><br></p><p>This course includes some activities that are focused on self-exploration and self-discovery in order to define, clarify or give clues as to what your natural niche strengths are and what your business purposes may be.</p><p><br></p><p> Trainer: Sarah Cordiner<br></p><p><br></p><p>So do you want to keep feeling lost, empty and confused, or do you want to start living a life of purpose?  Let's get started! </p><p><br></p><p>Sarah X</p><p><br></p>", 
    "end_date": null, 
    "title": "How To Find Your Career & Life Purpose", 
    "price": "50.00", 
    "instructors": "Sarah Cordiner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611532_430c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-uncover-your-professional-purpose-or-business-niche/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T10:03:07Z"
}