{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tIn this course you are going to learn information that will assist you with making a decision to go back as Single Mom while working full-time. Going back to further your education is not always an easy decision to make. When you have the insight on what it takes to pursue your goal, the decision is easier to make. This course will provide over 30 minutes of knowledge on your options for going back to school.  </p>  <p style=\"\">  \tThe course is designed to walk you through every aspect of what making this decision consist of. You will not feel as if you are alone when trying to decide which option is right for you.  In this course we will discuss your option for taking courses. You will learn about available funding to pay for your education. We will discuss the benefits of receiving your degree and how to prepare for whatever option you decide to take.  </p>  <p style=\"\">  \tI am a single mom that went back to school while working full-time in Corporate America to obtain two degrees, I know the feeling of wanting to know which decision will be right for you. Or how will this impact your family once a decision is made. I also know that if I had not made the decision to go back to receive a bachelor’s as well as a master’s degree I would not have made it up the corporate ladder. You have been contemplating the decision long enough. Your wait is over. This course will teach you all you need to know.  </p>", 
    "end_date": null, 
    "title": "How to go back to school as a single-mom while working ", 
    "price": "20.00", 
    "instructors": "Tamara P", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51594_6f83_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-go-back-to-school-as-a-single-mom/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-29T00:19:31Z"
}