{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Earning a living wage is a huge undertaking if you are a waitress or waiter at a restaurant. Most servers struggle with making ends meet. More and more well educated people these days have resorted to working as servers at restaurants. Many people with advanced degrees are unable to land a job that is commiserate with their education. </p><p>If the best you can do is to earn the expected 15% on the total spent by your customers (and many do not even get that!) you are struggling with paying your bills every month. Why not make a few simple changes to how you approach your job? The benefits can be well worth the trouble when you have increased the amount of money in tips that you earn every day. I am not talking about complicated changes here!  </p><p>Servers who earn great tips cultivate a connection with their customers. It really does not take a lot of time to \"connect\" with a stranger. When a connection is formed - however brief it might be - your customers will always be motivated to give you a fatter tip. </p><p>This course in a nutshell explains how to form a connection with your customers that will pay off in the end to help you earn better tips. </p><ul><li><em>Yes, there is a certain way that questions should be asked, <br></em></li><li><em>Yes, there are certain questions that should not be asked. <br></em></li><li><em>Y</em><em>es, there is one mistake that some servers routinely make that kill their chances for good tips.</em></li></ul><p>This course alerts you to pay attention to the \"little stuff\" that counts. Making better tips is more important than ever these days. Best of all, you find greater satisfaction with your job when you start making those fat, juicy tips. </p><p>Other people make good tips. You can too. Starting earning them today. </p><p>P.S. Remember - you get lifetime access to the course and will benefit as new suggestions roll in. </p>", 
    "end_date": null, 
    "title": "How to Make Good Tips as a Server", 
    "price": "20.00", 
    "instructors": "Robert Rodgers PhD", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655112_2aeb_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-good-tips-as-a-server/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T00:45:07Z"
}