{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t                              Are you recently graduated and looking for a job in IT? Maybe you want to get promoted? Career change? Not sure what to do next? Learn the skills you need to find a job in IT - the skills they don&#039;t teach you in school.  </p>  <p style=\"\">  \t                              Find out more about different IT roles from a real life perspective, with examples, tips and tools you need. <strong style=\"\">The course was developed in cooperation with IT Experts and Managers.</strong>  </p>  <p style=\"\">  \t                              You will find <strong style=\"\">interviews with successful IT specialists</strong>, who share their stories and give you a very good idea how to start or advance your career in IT. Learn from the best!  </p>  <p style=\"\">  \t                              There is a section dedicated to <strong style=\"\">passing IT exams</strong>. It is not an easy task, that&#039;s why I decided to include a few videos on that topic as well. Certificates are important and thanks to this course you will know what to expect and how to move on.  </p>  <p style=\"\">  \t                  The section dedicated to <strong style=\"\">IT interviews</strong> will give you unique tips to help you get through all stages of your dream job, including technical interviews!  </p>  <p style=\"\">  \t                              You will find the course has been created in an entertaining way with nice presentations and... animations to give you the best experience possible!  </p>  <p style=\"\">  \t<strong style=\"\">Do you want to stand out from the crowd and get a good job in IT</strong>? This course is for you!  </p>", 
    "end_date": null, 
    "title": "How to get a dream job in IT and pass exams: Boot Camp", 
    "price": "20.00", 
    "instructors": "Marious Kuriata", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244170_5de4_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-dream-job-in-it/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T13:38:43Z"
}