{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong></strong></p><p><strong></strong><strong></strong><strong></strong><strong></strong>The job market has changed in the last few years and become much more competitive due to technology and globalization. That's a problem because the traditional ways of getting a job (good grades, a diploma, a resume) are no longer working, and many students are having a difficult time finding a job when they graduate. This problem is so new, that most universities have not yet been able to adjust to the changing job market either, so they continue to encourage students in <br></p><p><strong>The good news is: There are powerful ways to leverage your university to build the skills and connections to do work that is valuable, fulfilling and fun. There are $1,000's of dollars in resources and opportunities that are underused at most universities just waiting for a clever student to take advantage of them. </strong></p><p>Though you may be nervous about balancing these strategies with their heavy course load and workload. The methods in this course are easy to understand, simple to apply and can sometimes be used to earn course credit for graduation. </p><p>So if you are ready to join the many students who are maximizing the value of their time at university. Then enroll in this course!</p><p>I guarantee that this course will help you build the skills and network that will bring a lifetime of wealth, however you define it. </p>", 
    "end_date": null, 
    "title": "How to make your university pay you to job hunt", 
    "price": "20.00", 
    "instructors": "Kyle Gray", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479492_f05e_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-your-university-pay-you-to-job-hunt/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T02:59:29Z"
}