{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The course will show you how joining the Army can pay for your college tuition. Inside I detail the process of joining the Army and ways you can earn <strong>50%</strong> more money throughout your training. This course will take you through the differences between the Active Duty Army, Army Reserve, and National Guard as well as the Pro's &amp; Con's of each so that you can pick the best choice for your career. As a BONUS, a segment of this course is devoted to explaining Army ROTC and how this program can pay for your school as well as provide additional benefits to your career.</p><p>Today's Army is changing rapidly which makes the process of enlisting into the Army a lot different than it was just a few years ago. There are so many routes and benefits to take in the Army that it can seem overwhelming where to start. In this course I explain a lot of valuable information that can make your career so much better. I've had conversations with fellow soldiers after joining and upon comparing jobs, benefits, rank, etc. they wish they would have taken a little more time to understand what all the Army had to offer before signing up. Luckily for you, I have all the information you need to know without the bias perspective of an Army Recruiter breathing down you neck! So Register for the course your future soldier will thank you!</p>", 
    "end_date": null, 
    "title": "How to Pay for School by Joining The Army", 
    "price": "20.00", 
    "instructors": "Joe Gunther", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510828_aef9_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-pay-for-school-by-joining-the-army/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T11:34:28Z"
}