{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Discover the secret &quot;Hollywood&quot; structure of stories you can adapt to your own story writing. Whatever you&#039;re creating, be it a novel, short story, assignment or script, this structure will ensure you keep your audience at the edge of their seat right til the very end.</p><p><strong style=\"\">Master The Art Of The Story Structure And Make Your Stories Impossible To Resist<span></span></strong></p><ul style=\"\"><li>11 simple steps to story writing mastery,</li><li>follow through using &quot;The Matrix&quot; to explain how the structure works (SPOILERS included!)</li><li>quick and simple course, no BS, no fluff. Done in under an hour.</li></ul><div style=\"\"><strong style=\"\">Spellbind Your Audiences And Have Them Beg To Know What Comes Next!</strong></div><div style=\"\">I&#039;ve always loved story writing. I was one of those kids in school who won awards for creative writing. I loved writing and I still do. Growing up, I lost my way. Only recently have I begun to rediscover my love for writing stories.</div><div style=\"\">I&#039;m sharing with you a structure that I&#039;ve researched that works. If you&#039;ve ever wanted to write a great story, this course is for you. Use this course to write stories for business, an autobiography, sales presentation and watch as your audience succumbs to your storytelling magic.</div><div style=\"\"><strong style=\"\">Content and Overview</strong></div><div style=\"\">I&#039;ve created this course for the time poor storyteller. There&#039;s no need to drag on and on. The 11 lectures are minutes long and to the point. You&#039;ll get it done in one sitting. </div><div style=\"\">If you hate the sound of my voice, that&#039;s cool. I&#039;ve compiled a sheet that you can check off as your going along too.</div><div style=\"\">Share your stories with me too! I&#039;d love to see how you go. Happy storytelling! </div>", 
    "end_date": null, 
    "title": "How To Write Irresistibly Compelling Stories", 
    "price": "20.00", 
    "instructors": "Johnson Kee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460264_6124_3.jpg", 
    "course_url": "https://www.udemy.com/compelling-story/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T02:45:16Z"
}