{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The Guide for Students and Professionals to Land a Solar Job is a course dedicated to helping you get the job you want in the solar industry. If you're a recent graduate or an experienced professional looking to make a career change into the solar field - this class is for you.</p>\n\n<p>Learn how you can do good and make money at the same time by working in this exciting field.</p>\n\n<p>In this course you will: </p>\n\n<ul><li>Learn how solar PV works.</li><li>Find which companies are hiring.</li><li>Discover where to move for the highest concentration of solar companies. </li><li>Explore the many different roles and positions that the solar industry is looking to fill.</li><li>Build a job search plan including networking, resume building, and interview tactics. </li><li>And much more!</li></ul>\n\n<p>Contents and Overview</p>\n\n<p>In over one and half hours of content including lectures, quizzes, and resources, this course covers everything you need to know to get a job in the solar field.</p>\n\n<p>We'll go over the trends in the solar industry, what skill sets are the most marketable, what companies are hiring and where they're located, how to focus on the companies that match your skills and passions, and how to land the job of your dreams.</p>\n\n<p>You will have access to resources that I've spent over three years putting together. They include job sites specific to solar professionals, networks and communities to meet like-minded professionals, and much more.</p>\n\n<p>Upon completion, you will be knowledgeable how solar technology works, the types of organizations that are looking to hire solar professionals, and how to land your solar dream job. </p>\n\n<p>What are the requirements?</p>\n\n<ul><li>Passion for making a living while doing good</li></ul>\n\n<p>Who is the target audience?</p>\n\n<ul><li>Students who are looking for internship programs in the solar industry</li><li>Recent graduates from college or graduate programs focused on renewable energy</li><li>Experienced professionals looking for a career change to a promising field</li></ul>\n\n<p>What am I going to get from this course?</p>\n\n<ul><li>Over 1.5 hours of content</li><li>An understanding of solar technologies</li><li>Insider knowledge of the solar industry</li><li>A list of all the roles that the solar industry is hiring for</li><li>The top companies that are hiring</li><li>An action how to land your dream job</li></ul>\n\n<p>Begin the course today to get the job of tomorrow!<br></p>", 
    "end_date": null, 
    "title": "How To Get a Job in The Solar Industry", 
    "price": "20.00", 
    "instructors": "Yoni Binstock", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608714_186b_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-job-in-the-solar-industry/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T03:00:39Z"
}