{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        Did you know that in 2012:  </p>  <ul style=\"\">  \t<li style=\"\">93% of recruiters used LinkedIn to recruit for permanent and temporary jobs</li>  \t<li style=\"\">77% of all job openings were posted on LinkedIn and 48% were ONLY posted there</li>  </ul>  <p style=\"\">  \t        This means that if you are looking for work, then you need to leverage the power of LinkedIn. With 259 million users in 200 countries and in 20 languages, LinkedIn is THE social media channel for professionals.  </p>  <p style=\"\">  \t  But, like any computer application, using it well is part art, part science. This course will take you through the core aspects of optimising your profile:  </p>  <ul style=\"\">  \t<li style=\"\">systematically working through each section of your LinkedIn profile to make sure that it best reflects who you are and what you do</li>  \t<li style=\"\">making sure that your profile is found in search results by ensuring that it is 100% complete.  Think of this a SEO for your profile!</li>  \t<li style=\"\">providing you with a LinkedIn connection strategy so that when your profile appears in search results, it gets seen</li>  </ul>  <p style=\"\">  \t        The course is made up of 49 modules that will take at least 2 hours to work through.  </p>  <p style=\"\">  \t        So if you&#039;re looking for a job, and you want to use LinkedIn to find it, then this course will show you how to craft a killer profile.  </p>", 
    "end_date": null, 
    "title": "How to... optimise your LinkedIn profile", 
    "price": "20.00", 
    "instructors": "Karen Brown", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38553_7b83_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-optimise-your-linkedin-profile/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-27T22:25:37Z"
}