{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>*Join a community of 950+ Students learning together!</strong>  </p>  <p>  \t<strong>*40 Lectures and close to 2 hours of content!</strong>  </p>  <p>  \t<strong>*Learn from an actual Recruitment Industry Professional!</strong></p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong><u>LEARN THE SECRETS OF AN INDUSTRY INSIDER!</u></strong>  </p>  <p>  \t<strong>  Why Should You Listen to Me?  </strong>  </p>  <p>  \t                                                                                                                                    - I have personally interviewed thousands of candidates face to face, over the telephone and via Skype; as a result I have seen all the great interviewees and seen the worst and will be able to guide you accordingly.</p>  <p>  \t                                                                                                                                    - I have met with and/or spoken to thousands of different hiring managers and have been able to pick their brains to find out the RAW truth on the way they think.  </p>  <p>  \t                                                                                                                                    - I have secured hundreds of job offers for my candidates, I understand what you are going through and how to best guide you through the recruitment process.  </p>  <p>  \t                                                                                                                                    - I have worked with companies of all sizes, with businesses ranging from small 20 people start-ups, all the way through to Global Fortune 500 companies. I have recruited at the Graduate level all the way up to Director level so I'll be able to guide you accordingly.</p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>  Some of the things you will learn:  </strong>  </p>  <p>  \t                                                                                                                                    - Salary Negotiation  </p>  <p>  \t                                                                                                                                    - What mindsets you need to adopt immediately  </p>  <p>  \t                                                                                                                                    - What the Hiring Manager's are thinking  </p>  <p>  \t                                                                                                                                    - How to Prepare for the Interview the right way  </p>  <p>  \t                                                                                                                                    - Guidance on how to best answer common questions  </p>  <p>  \t                                                                                                                                    - What you need to know about the reference checking process  </p>  <p>  \t                                                                                                                                    - How you should dress for the interview  </p>  <p>  \t  - And Much more spread across 40 Lectures!</p>  <p>  \t<strong>    This is what some of my previous candidates have had to say about me:  </strong>  </p>  <p>  \t<em>#1 - I have a pleasure to know Anthony as my recruitment consultant and I can honestly say that he is a rare kind of person who posses all main attributes that will lead to success in finding right company and position that fits your skills and preferences the most. He supported me during the whole recruitment process from the start to the end, gave me an excellent overview of the client expectations and provided useful recommendations. I can highly recommend Anthony as a great specialist and friendly fellow and without a doubt will be pleased to work again in the future.</em>  </p>  <p>  \t<em>#2 - I found Anthony to be very professional and one to excel in his role. I am impressed by his interview preparation. He is helpful towards job seekers and always ready to help candidates to carry out the employment process. I recommend Anthony as an executive recruiter.</em>  </p>  <p>  \t<em>#3 - Anthony was a great help when applying for my current role. The recruitment process was very rigorous and involved a large amount of mediation. He was able to understand my needs and to streamline the process as much as possible. He made a lot of effort to keep me informed at all stages of the application process, as well as keeping in touch afterwards to ensure I settled in well.</em>  </p>  <p>  \t<em>#4 - Anthony is one of the best recruitment agents I've worked with. His communication skills are excellent. I received constant feedback with regards to the status of my application and interview outcomes. I can highly recommend his services.</em>  </p>  <p>  \t<em>#5 - Anthony helped me get my current role. I was impressed by his detail-oriented approach and well-structured &amp; thoughtful candidate interview preparation. On a personal note, I found that Anthony is an inspiring, self motivated and dedicated professional.</em>  </p>  <p>  \t<em><br>  \t</em>  </p>  <p>  \t                                                                                                                                    In summary, my goal is simple. I want to be able to   <strong>guide you </strong>with my <strong>personal experience IN THE INDUSTRY</strong> and share all of my insight with you. I will offer you no nonsense, <strong>100% real world </strong>information.   </p>  <p>  \t<strong>You are backed with a 30 day money back guarantee (No Questions Asked) so there is no risk to you. Sign up today!</strong>  </p>", 
    "end_date": null, 
    "title": "How to Interview for the Job Offer, A Recruiter Reveals All", 
    "price": "50.00", 
    "instructors": "Anthony Kang", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298734_3272_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-interview-land-the-job-and-get-the-job-offer/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-12T00:45:01Z"
}