{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Through history stories have been used throughout the world and cultures, to form realities of our children, express important ideas inside business meetings, to introduce major new inventions, to innovate the way we think and also to influence nations.  </p>  <p>  \t          Consider having the ability to <strong style=\"\">transform any story </strong>you tell into a hypnotic<strong style=\"\"> masterpiece</strong>. Stories inside hypnosis will <em style=\"\">catapult your influence</em> and hypnotic maneuvers onto the level of mastery, <em style=\"\">leaving your clients spell bound</em>.  </p>  <p>  \t          Welcome to our <strong style=\"\">crash course</strong> guide to uncover the secret<em style=\"\"> formula</em> to creating a hypnotic stories on the fly with no scripts. A very overlooked form of hypnosis but something the <strong style=\"\">masters</strong> in this field rely on to <em style=\"\">transform</em> their subjects easily and with instant results.  </p>  <p>  \t<strong style=\"\">What you will learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Hypnotic story break down</li>  \t<li style=\"\">Hypnotic story mindset creation</li>  \t<li style=\"\">How to rely on your own story telling ability that is inside your mind right now</li>  \t<li style=\"\">How to set a clear direction for your transformational story </li>  \t<li style=\"\">The simple dynamics of a good story that can be turned great every time</li>  \t<li style=\"\">How to take a story and make it hypnotic</li>  \t<li style=\"\">Adding simple hypnotic tricks to triple your influence </li>  </ul>  <p>  \t          If you are ready to explore the world of the most powerful hypnotic tool on the earth. You  are about to embark into a hypnotic journey that will leave people in &#039;aw&#039; of your creative ability and hypnotic power. The ultimate in hypnotic persuasion  </p>", 
    "end_date": null, 
    "title": "How To Tell Transformational Hypnotic Stories - Crash Course", 
    "price": "20.00", 
    "instructors": "Scott Jansen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437946_8c98_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-tell-transformational-hypnotic-stories-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T21:26:25Z"
}