{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t                The Institute for Adult Communication is happy to announce a very special program designed specifically for people who want to empower their skills as negotiators. We looked around and found that many women and some men struggle with and often avoid negotiating all together.  </p>  <p style=\"\">  \t                 In our online video series you will learn the specific challenges you'll need to overcome before you can unlock your natural power as a negotiator, you'll learn the tactics that are always being used against you in the market place and how to overcome them. We will also show you how to overcome your fear of negotiating and gain access to the happiness and satisfaction that is only possible when you successfully have your wants and needs met.  </p>  <p style=\"\">  \t                We observe that many women and men are not taking advantage of many business, social or relationship opportunities for higher salaries, greater respect and more intimate connections and as a result, as a group, are suffering via lower salaries, lower life satisfaction, lower levels of support and a lower sense of self esteem and confidence. For women who master at least some skills as negotiators life begins to unfold in powerful, energizing, confidence boosting ways.  </p>  <p style=\"\">  \t<strong style=\"\">This course will provide pathways for you to: </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Have a wholly new and positive perspective on negotiation</li>  \t<li style=\"\">Have more confidence in all your negotiations.</li>  \t<li style=\"\">Have more self esteem.</li>  \t<li style=\"\">Structure more powerful requests.</li>  \t<li style=\"\">Communicate your needs with impact.</li>  \t<li style=\"\">Understand your feminine advantage in any negotiation.</li><li style=\"\">Negotiate from their own instincts and values.</li><li style=\"\">Learn and understand how to listen for women's needs and values in negotiations. </li><li style=\"\">Have Men and women learn to clarify and communicate their own needs much more effectively. </li>  </ul>  <p style=\"\">  \t                \"I Can Negotiate Now!\" is 19 Chapters of training totaling approximately 100 minutes and includes interviews with women who have gained confidence in their negotiating skills and use them to gain mastery and life satisfaction every day. Men can gain insight into how women ask for what they need and what can be done to support their process. </p>  <p style=\"\">  \t                This course will open your mind and heart to experiencing negotiation from the perspective of clarified feminine values and instincts.  It will enable your natural skills as a negotiator that have been living inside in you but have been largely left dormant...until now.</p>", 
    "end_date": null, 
    "title": "How to Negotiate a Higher Salary with Any Employer", 
    "price": "50.00", 
    "instructors": "McCall Jones", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274222_aa50_2.jpg", 
    "course_url": "https://www.udemy.com/icannegotiatenow/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T03:57:32Z"
}