{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>**UPDATED MAY 2016**</strong> Called <em><strong>\"an absolute SHORTCUT for anyone looking to break into startups and business development\"</strong></em></p>\n\n<p>  \t             You want to work with smart people in a fast paced environment where you're learning every day...  </p>\n\n\n\n<p>  \t             You want to be a part of something bigger than yourself and feel your hard work's tangible contribution to your company...  </p>\n\n\n\n<p>  \t             You want to learn how to become an entrepreneur so that you can one day start your own company...  </p>\n\n\n\n<p>  \t <strong>YOU WANT TO WORK FOR A STARTUP!</strong>  </p>\n\n\n\n<p>  \t             There's only one problem...you don't have any technical skills : (  </p>\n\n\n\n<p>  \t <strong>        This course is a <em>step by step guide </em>for people who currently don't possess any technical skills to land the startup job of their dreams.</strong>  </p>\n\n\n\n<p>  \t         And not just any job, but <em>the premier \"business job\"</em> at a startup which is commonly called Business Development.  </p>\n\n\n\n<p>  \t             Here's a few reasons why working in Startup Business Development is so awesome:  </p>\n\n\n\n<ul>  \t<li>You'll touch multiple parts of the company including<em> strategy and growth</em></li>  \t<li>You will build a massive amount of relationships that will carry you throughout your entire career.</li>  \t<li>You'll build an insanely valuable and transferrable skillset of learning how to sell, market, and work with other companies. </li>  \t<li>The trajectory for most business development professionals is <strong>CEO/Founder, Venture Capitalist, or high-paid business development professional</strong></li>  </ul>\n\n\n\n<p>  \t         And guess what...startup business development doesn't require specialized skills as a prerequisite like coding, design, or financial modeling. Everything can be taught and you can excel if you have interpersonal skills and a strong work ethic.  </p>\n\n\n\n<p>  \t         Doesn't sound too shabby right?  </p>\n\n\n\n<p>  \t             This course is the first step by step guide with exact strategies, word-for-word scripts, and proven tactics to land a Startup Business Development Job.  </p>\n\n\n\n<p>  \t <strong>Here is just *some* of what you will learn in this course</strong>  </p>\n\n\n\n<ul>  \t<li>Multiple strategies on how to overcome the common challenge of “not having enough work experience\"</li>  \t<li>A proven approach to demonstrate to the startups you want to work for that you are capable of doing a kickass job</li>  \t<li>The absolute first steps you should take if you know you want to work for a startup, but aren't sure where to get started</li>  \t<li>How to build relationships with people at the startups that you're interested in working for</li>  \t<li>The blueprint for building out a powerful network of influential entrepreneurs</li>  \t<li>The exact conversational topics you should focus on when meeting with entrepreneurs and prospective employers</li>  \t<li>A proven methodology for getting someone you've never met before to meet you in person (worth the cost of this course alone)</li>  \t<li>A step-by-step guide for getting your online presence where it needs to be so startups take you seriously</li>  \t<li>Specific tactics you can employ before, during, and after an interview to stand out from the pack</li>  \t<li>Ways to avoid the online applications forever (and why this is so important)</li>  </ul>\n\n\n\n<p>  \t <strong>      Skeptical whether this course will work for you? </strong>  </p>\n\n\n\n<p>  \t      Just listen to a what a others have said...  </p>\n\n\n\n<p>  \t             \"<em>Unless you're a programmer or have technical talent, breaking into the startup scene is incredibly hard. I really am lucky that I ran into Scott early on in my journey; his teachings about networking, strategy and of course business development were essential in my eventually landing a role leading BD at an awesome startup. He's been so effective in turning his experiences into career lessons that everyone can benefit from, and I can honestly recommend Scott's content, and this course, to anyone looking to grow their career – at a startup or elsewhere.\"</em>  </p>\n\n\n\n<p>  \t             -Ron G, now Biz Dev at Sketchfab (Techstars)  </p>\n\n\n\n<p>  \t <em>    \"I had a pretty successful career in Enterprise Sales in a non-tech industry and eventually got bored of the same ol same ol – so I decided to try and break into the SF start-up scene in a Biz Dev role. Turns out no one in the start-up world cares about what you did before or how successful you were. All they care about is – How can you get them to the next level? I took Scott's “Break Into the Startup World\" course and quickly realized I needed to really prove what I can do and stop talking about it. After several failed interviews and un-returned calls, I finally took Scott's advice...It ended up being a huge success which then led to a consulting gig and finally a full time dream job within 60 days.\"</em>  </p>\n\n\n\n<p>  \t             -Danoosh K, Biz Dev at General Assembly  </p>\n\n\n\n<p>  \t   \t <em>    The course was great! I feel the content can be applied to any arena of business and professionalism. This course is truly road map to reach the industry one wishes to pursue. I would almost suggest you call the course Break into (your dream job).</em>  </p>\n\n\n\n<p>  \t             -Bryan K, World Traveler  </p>\n\n\n\n<p>  \t <strong>  \t </strong>  </p>\n\n\n\n<p>  \t <strong>      Here is An Outline of All the Awesome Things You're Going to Learn</strong>  </p>\n\n\n\n<p>  \t       Module 1: <strong><em>Your Foundation</em></strong>  </p>\n\n\n\n<p>  \t             – Learn why Startup Business Development is so awesome and what it really means so you can speak the language when talking to startups. You'll learn the 3 most common types of business development, the difference between sales and business development, and the proper framework for understanding what business development actually means.  </p>\n\n\n\n<p>  \t       Module 2: <em><strong>Becoming A Successful Business Developer</strong></em>  </p>\n\n\n\n<p>  \t             – The best way to grasp what makes someone successful is to understand the challenges they had to overcome. This module teaches you about the common challenges you'll face as a BD person as well as the DNA of a badass Biz Dev person vs. a weak one. This is critical so you can properly position yourself during the job hunt.  </p>\n\n\n\n<p>  \t       Module 3: <strong><em>Dissecting and Maneuvering Within The Startup Hiring Ecosystem</em></strong>  </p>\n\n\n\n<p>  \t             – The startup hiring process is unique. This is one reason why so many people that take a traditional approach to landing a startup job have unsatisfying results. This module demystifies the startup hiring ecosystem so that you have a framework for the exact steps you need to hack the hiring process.  </p>\n\n\n\n<p>  \t       Module 4: <em><strong>Building A Massive Network of Influential Supporters Who Will Help You</strong></em>  </p>\n\n\n\n<p>  \t             – This module reveals the most critical mindset shift that altered the trajectory of my career. I'll give you the foundation for how to build out a <strong>insanely powerful network of influential people</strong> that hold the keys to you landing your dream job. Nothing gets you faster than where you want to go then people. That will never change. This module teaches you how to attract the right people in your life.  </p>\n\n\n\n<p>  \t       Module 5: <em><strong>Exactly Where You Need to Start</strong></em>  </p>\n\n\n\n<p>  \t             – Even when you know where you want to get,  failing to understand the best place to start can paralyze you from making progress to where you want to go. Module 5 outlines the exact place you should start building out your support network and closing in on the prize.  </p>\n\n\n\n<p>  \t       Module 6: <em><strong>The Definitive Guide to Using and Operating At Events to Get Your Foot in the Door</strong></em>  </p>\n\n\n\n<p>  \t             – One of the best places to meet future members of your support network and even target companies is events. This module outlines how you can maximize events to build relationships with people that will push your goal. Ever wondered how to get someone awesome from an event to grab a coffee with you? This module covers that and much more.  </p>\n\n\n\n<p>  \t       Module 7: <em><strong>The 80/20 Formula to Build A Next-Level Network</strong></em>  </p>\n\n\n\n<p>  \t             – This systems teaches you the exact methodology to systematically cultivate relationships with every and anyone you want to bring in your life. When I decided I wanted to have a career in startups, I made a list of 30 people that I thought could change the trajectory of my career in the New York Tech Scene. This system helped me connect with 20 of them in my first year of adopting it.  </p>\n\n\n\n<p>  \t       Module 8: <em><strong>Strategies to Prove You'll Be An Awesome Hire (EVEN WITH NO CREDENTIALS)</strong></em>  </p>\n\n\n\n<p>  \t             – I've seen people with no experience and no credentials, successfully prove themselves and land jobs using the strategies outlined in this module time and time again.  </p>\n\n\n\n<p>  \t       Module 9: <em><strong>Unconventional Strategies for Getting Your Foot in the Door</strong></em>  </p>\n\n\n\n<p>  \t             – Have you ever noticed that people who take an alternate route to get what they want often get it faster? This module highlights some unconventional, but proven tactics you can employ to converge onto the scene.  </p>\n\n\n\n<p>  \t       Module 10: <em><strong>How to Maximize Inbound Job Opportunities and Hunt Your Dream Job</strong></em>  </p>\n\n\n\n<p>  \t             – Module 10 is all about closing in on your target. We review where you're at, the different ways you can approach landing at the perfect company, and provide actionable strategies you can implement in order to optimize the plan of attack you decide to take.  </p>\n\n\n\n<p>  \t       Module 11: <em><strong>How to Dominate the Interview Process</strong></em>  </p>\n\n\n\n<p>  \t             – This module teaches you how to hack the interview process. You'll learn powerful tactics the road flare strategy, proof approach, and how to get the person that's interviewing you fired up to meet you before you even step in the room.  </p>\n\n\n\n<p>  \t   I want to be clear about who will derive massive momentum from this course...  </p>\n\n\n\n<p>  \t <strong>        This course is for:</strong>  </p>\n\n\n\n<ul>  \t<li>People who want to change their situation and are willing to put the effort in required to accomplish that</li>  \t<li>People interested in getting one of the few coveted, non-technical jobs at a  \t             startup, especially in business development</li>  \t<li>People interested in building out a vast network of influential people that will help them get the things they want in work and life throughout their careers</li>  </ul>\n\n\n\n<p>  \t             This course is not for people who think jobs will magically appear because they bought the course or for people that aren't willing to take steps to change their situation. You need to take action on all the <em><strong>tactics, scripts, and step-by-step maneuvers</strong></em> I'll teach you.  </p>\n\n\n\n<p>  \t    -----Right now you have a choice-----  </p>\n\n\n\n<p>  \t             You can either:  </p>\n\n\n\n<p>  \t <strong>1) </strong>Continue to go at it alone and hope that something works somewhere along the way  </p>\n\n\n\n<p>  \t      or  </p>\n\n\n\n<p>  \t <strong>2)</strong> Invest in yourself to get proven tactics that work so that you can get the fulfilling job you've always wanted without wasting your time.  </p>\n\n\n\n<p>  \t             I'll leave it up to you, but considering <em><strong>we spend half of our waking hours at work</strong></em>, I think investing 2 nights out in a major city in yourself and career is a good move.  </p>\n\n\n\n<p>  \t             No matter who you are, I guarantee you'll learn at least one massively powerful mindset or tactic from this class (see the testimonials above for proof).  </p>\n\n\n\n<p>  \t       I will personally respond to any questions you may have as you go through the material so there's no worry if you're not sure how to take all of the information and apply it to your life.  </p>\n\n\n\n<p>  \t             Talk soon,  </p>\n\n\n\n<p>  \tScott Britton  </p>\n\n\n\n<p>  \t <strong>P.S.</strong> The $297 price is an initial offering to build students and positive reviews.  </p>\n\n\n\n<p>  \t <em>I believe having everything you need to secure the job of your dreams which you'll spend 2,000+ hours at this next year is worth less than $1 a day for the next year </em><em>s</em>o I plan on raising the price in the near future. If you want to take advantage of the initial price, I'd sign up sooner than later (Like now!)  </p>\n\n\n\n<p>  \t <strong>P.S.S</strong> For a limited time, all students will also receive access to interviews with 4 Startup Business Development All Stars where they reveal how they broke into startups without any technical skills.  </p>\n\n\n\n<p>  \t      You'll hear from:  </p>\n\n\n\n<ul>  \t<li>Ryan Jefferey, VP of BD at BellyCard</li>  \t<li>Alex Taub, BD at Dwolla</li>  \t<li>Max Altscuhler, Founder of SalesHacker Conference, formerly VP of BD at AttorneyFee and Udemy</li>  \t<li>Ryan Delk, Growth Lead at Gumroad</li>  </ul>\n\n\n\n<p>  \t      The time to take action is now!  </p>", 
    "end_date": null, 
    "title": "How to Land A Startup Job to Become An Entrepreneur", 
    "price": "50.00", 
    "instructors": "Scott Britton", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145830_e0fb_2.jpg", 
    "course_url": "https://www.udemy.com/startup-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-12T12:42:07Z"
}