{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course covered the following:</p><p>Definition of articles and explanation of what an article is all about. I gave an example of what a written article looks likes. We also looked at the types of articles anyone can write. I gave examples of four types of article. With these in place, the student is expected to understand the meaning of the article and also know the type of articles he or she could write.</p><p>This course went into details to explain the futures of the different articles, with examples. A quiz was issued here, to enable the student, demonstrate understanding of what was taught so far.</p><p>We examined why anyone would want to write, explaining that it's better for a writer to write those things he or she is passionate about. Editorial requirements were discussed as it affects different media establishments. We tried to identify how to identify a writer's audience, including writing what the audience wants.</p><p>We discussed factors to consider before choosing a topic. How to write the topic, where to position the topics or titles. Including underlining of the topics.</p><p>This course discussed how to plan an article. How to sequence your points, while writing, and the need to read and research before writing articles.</p><p>Paragraphs and structure of article writings were elaborated. Highlighting what goes where and why.</p><p>It also discussed the knowledge and skills of writing articles, pointing out the need to write in simple English language or any other language the student writes with. The essence of proof reading was discussed. The need to connect with the reader was mentioned. Tips of writing good articles were highlighted and explained.</p><p>It is expected that the student will benefit immensely from doing this course. After doing this course, the student can be able to write a very sound article.</p>", 
    "end_date": null, 
    "title": "How to write articles", 
    "price": "20.00", 
    "instructors": "Chinedu, Vincent Akuta", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554404_9536_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-articles/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T14:45:04Z"
}