{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p class=\"PIN_1372851796334_hazClick\" style=\"\"><p style=\"\">As surprising as it seems – no one actually buys what you  have to sell – merely because you want to sell it to them.&nbsp; Whether it’s financial planning, consulting  services or IT software – they won’t buy it just because you can show it to  them.&nbsp; But there are two things people do  actually buy.</p>  <p class=\"PIN_1372851796334_hazClick\" style=\"\">The first of these is a solution to a problem.&nbsp; People will buy a service from you because  they believe it will solve particular problems for them – and help them reach  their desired outcome.&nbsp; <strong style=\"\">How</strong> your particular service works may  not really matter to them – as long as it delivers the <strong style=\"\">results</strong> they want.</p><p class=\"PIN_1372851796334_hazClick\" style=\"\"><p style=\"\">The second thing people buy – is actually – <strong style=\"\">you</strong>.</p>  <p style=\"\">Once they’ve decided that they have a problem that they need  fixed – then they come to a decision about <strong style=\"\">who</strong>  could fix it – or <strong style=\"\">help</strong> them fix  it.&nbsp; Now – if you’ve made a point of  telling them all about your business and services – they may feel you’re too  focussed on <strong style=\"\">yourself</strong> and your <strong style=\"\">own</strong> needs to be able to care about <strong style=\"\">them</strong> and to help them.&nbsp; So they’ll think you’re simply trying to sell  them something (which you are!) – and they’ll start to resist in all sorts of  ways.</p>&lt;/p&gt;&lt;/p&gt;", 
    "end_date": null, 
    "title": "How to interview clients to understand their needs.", 
    "price": "20.00", 
    "instructors": "Angus Patterson & David Dowe", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63168_e03b_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-interview-clients-to-understand-their-needs/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-01T10:40:50Z"
}