{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hey guys! Welcome to the \"How to Get Hired\" course. First off, Thanks so much for taking a look at this. It really means a lot.</p><p>For those that don't know me, I have over 10 years of executive recruiting and career coaching experience, but what really put me on the map was when I started my own company called Candidate Advisors two years ago. Candidate Advisors is a nationwide resume writing and career advisory firm that focuses on helping people secure employment.</p><p>In my career I've read over 200,000 resumes, interviewed over 5,000 candidates, and have placed over 1,000 people at different companies all across the United States. I've written resumes for VP's at major brands like Nike and General Electric. I've also placed executives at Nestle Waters, Volvo, &amp; Morgan Stanley to name a few.</p><p>My goal for this course is to give you the confidence and correct information so you can WIN. I'm going to provide you with the blueprint on how to succeed at every stage of the hiring process. This course includes innovative strategies, tactics, and tips that will separate you from the field of competition.</p><p>This course will cover a variety of main topics such as resume &amp; cover letter writing, interviewing, negotiating, how to maximize recruiters, job search strategies, and much more.</p><p>We're living in a very interesting time where companies aren't following the transitional way of identifying and selecting candidates to hire. This course is here to provide you with the framework and knowledge of what to expect and how to handle it, so you won't be surprised by any prospective employer when going through the grueling hiring process.</p><p>Thank you so much for taking this journey with me and for spending your time in participating in this course. <br></p><p>I hope you get everything you expect, and much more.</p><p>-Michael</p>", 
    "end_date": null, 
    "title": "How to Get Hired: Win at every stage of the hiring process.", 
    "price": "20.00", 
    "instructors": "Michael Mohrin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667114_6009_4.jpg", 
    "course_url": "https://www.udemy.com/gethired/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T20:10:41Z"
}