{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span>If you&#039;re frustrated applying for jobs, you&#039;ve come to the right place! Find out why your résumé should be full of !@#$%, the Signs of a Great Résumé.</span>  </p>  <p>  \tScott Vedder is a best-selling author, Fortune 100 recruiter and a pretty funny guy. He&#039;s been recognized by The White House, The Pentagon, the Society for Human Resource Management and many others as a résumé expert.  Scott has developed a simple way to make your résumé speak for itself, using !@#$%, the Signs of a Great Résumé.  Each sign showcases your experience and skills and highlights your greatest achievements and contributions.  </p>  <p>  \t! Any part of your experience that was “amazing!”  </p>  <p>  \t@ Defining points, places, dates and things in your career  </p>  <p>  \t# Numbers that quantify and prove your past successes  </p>  <p>  \t$ The dollar value of your contributions  </p>  <p>  \t% Figures that easily show growth and results  </p>  <p>  \tIn this in this lighthearted, interactive course, Scott shares his best résumé tips and insight from his first-hand experience as a Fortune 100 recruiter.  He also tells some fun stories about applicants who stood out the wrong way on their résumés!  Scott answers the most common questions about résumés so you can get an interview for the job you deserve!  </p>  <p>  \tGet the inside scoop on what recruiters are REALLY looking for on a résumé.  Learn how to write a résumé that speaks for itself.  </p>  <ul style=\"\">  \t<li>Job seekers at any stage of their career, from      any background, in any field can learn to write a résumé that speaks for      itself!</li>  \t<li>Learn from a Fortune 100 recruiter what hiring      managers are REALLY looking for on a résumé.</li>  \t<li>Get an interview for the job you deserve!</li>  \t<li>Get expert insight about how to stand out from      the competition.</li>  \t<li>Understand how to quantify and explain exactly      what makes you the BEST candidate for a job.</li>  \t<li>Veterans learn to tell civilian recruiters      &quot;I am a P.A.T.R.I.O.T.&quot; to highlight the military values and      characteristics that make you a great candidate for the civilian      workplace.</li>  \t<li>Military spouses learn to highlight their      qualifications as “Heroes at Home” and to showcase experience gained while      supporting someone who has served our country.</li>  </ul>  <p>  \tStop applying for jobs and start interviewing for the job of your dreams!  Whether you’re unemployed, underemployed, seeking a promotion or looking for a great new opportunity, the Signs of a Great Résumé can help your résumé speak for itself.  </p>", 
    "end_date": null, 
    "title": "How to Write a Résumé that Speaks For Itself", 
    "price": "20.00", 
    "instructors": "Scott Vedder", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299402_4957_5.jpg", 
    "course_url": "https://www.udemy.com/signsofagreatresume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T00:58:46Z"
}