{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\"><strong style=\"\"><em style=\"\">ADDED BONUSES:</em></strong></span>  </p>  <ul style=\"\">  \t<li><strong style=\"\"></strong><span style=\"\">The Ultimate Advantage Mastermind Guide PDF</span></li>  \t<li>  \t  \t\tBonus Complete AudioBook Version</li></ul>  <p style=\"\">  \t<span style=\"\"><strong style=\"\">How would you like to have your own team of hand-picked advisors committed to your personal success?</strong></span>  </p>  <p style=\"\">  \tWhat could you do with expert advice, wise counsel, and a network of successful people at your fingertips?  </p>  <p style=\"\">  \tYou know the hottest business principle today is “collaboration&quot; not “competition.&quot; What could you do with the collaboration of your own mastermind group?  </p>  <p style=\"\">  \tI don&#039;t know anyone who has become extraordinarily successful who has not utilized the principle of the mastermind group. Whether you&#039;re a small business owner, a personal growth seeker, a consultant, a free-lance worker, a real estate agent, an artist or a corporate employee, you can benefit from being part of a Mastermind Group.  </p>  <p style=\"\">  \t<strong style=\"\">Being part of a Mastermind Group is like having your own board of directors</strong>. Except there&#039;s no hidden agenda - everyone is openly committed to the success of the other members.  </p>  <p style=\"\">  \t<strong style=\"\">In this course you&#039;ll discover:</strong>  </p>  <ul style=\"\">  \t<li>Why you Need a Mastermind Group To Achieve Greater Success</li>  \t<li>How To Start a Mastermind Group Immediately</li>  \t<li>Strategies for Selecting the Right Members of your Group</li>  \t<li>How To Run a Mastermind Group</li>  </ul>  <p style=\"\">  \tThis course is divided into short, actionable segments designed to give you the essentials and get you up and running with your own Mastermind group immediately.  </p>  <p style=\"\">  \tYou may have goals, strategies and tactics for achieving a high level of success, but without a Mastermind group, you&#039;re polishing a Ferrari with no gas in the tank.  </p>  <p style=\"\">  \t<span style=\"\">Success doesn&#039;t require that we&#039;re born in the right place, have the right IQ or have the right degree - <strong style=\"\">but it does require that we take the right action.</strong></span>  </p>  <p style=\"\">  \t<strong style=\"\">Here&#039;s what our students are saying: </strong>  </p>  <p style=\"\">&quot;WORTH $100,000!!!! <em style=\"\">The content in this course is INVALUABLE! I learned how to start a mastermind group from Dan&#039;s teachings and it has forever changed my life and each of the other 11 guys in my mastermind group. With the exception of my faith and family, this has been the most positively LIFE CHANGING thing I have ever experienced. THANKS DAN! You have forever impacted my life and the 100s of thousands I plan to lead!&quot; - </em><span style=\"\"><strong style=\"\">David M.</strong></span></p>  <p style=\"\">  \t<em style=\"\">“I followed Dan&#039;s guide for starting my Mastermind and we&#039;ve been meeting 20 weeks in a row. It&#039;s been pretty transformational in all of our lives - personal and business.&quot;- </em><span style=\"\"><strong style=\"\">Ben L.</strong></span>  </p>  <p style=\"\">  \t<em style=\"\">“Dan&#039;s direct experience and decade long involvement with mastermind groups really shows in this course. The information and advice is solid, and the downloadable PDF is a gem of a resource.&quot;</em> - <span style=\"\"><strong style=\"\">Dereck C.</strong></span>  </p>  <p style=\"\">  \t<span style=\"\">Just click the “<strong style=\"\">Take This Course</strong>&quot; button to get started and we&#039;ll see you on the inside!</span></p>  <p style=\"\">  \tDan Miller  </p>", 
    "end_date": null, 
    "title": "How To Start A Mastermind Group To Create The Work You Love", 
    "price": "20.00", 
    "instructors": "Dan Miller, Joel Widmer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86420_dd26_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-your-mastermind-group/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-31T14:17:13Z"
}