{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tIf I tell you that the difference between getting and not getting a job interview, can be broken down into 3 simple steps - what would you say?  </p>  <p>  \tDo you know that most job applications have failed even before the interviewer viewed the resume?  </p>  <p>  \tThis course is here to help you to not only get into the &quot;consideration list&quot; of the interviewer but also to leave a good impression; and it is broken down into <strong>3 essential steps</strong>.  </p>  <p>  \t<strong>Resume:</strong> The most basic of any job application but yet the most &quot;improperly done&quot; of the other elements.  </p>  <p>  \t<strong>Cover Letter:</strong> After opening the email, what will make you stand-out from the crowd?  </p>  <p>  \t<strong>Email</strong>: Put yourself in the shoes of the interviewer, will you open and read the email that you sent to the interviewer? What will convince the interviewer to open the email out of the many thousands that he/she receive in a day?  </p>  <p>  \tInterviewer is just like us, a human. As a human and at this information age, we tend to make our split second decisions through first impressions. Because time is scarce, we will need to prioritize on things that give us the most benefit. To help us do a preliminary filter, that is when first impressions matter a lot.  </p>  <p>  \tThe course helps you to eliminate that by:  </p>  <p>  \t1) Guiding you on every aspects of resume (eg. what to include, how to structure your content in such a way that you can highlight your specific skills)  </p>  <p>  \t2) What to write and not-to write in your cover letter (this is important because it serves as an extension of resume; this is where you answer the question, &quot;Why Should I Hire You&quot;)  </p>  <p>  \t3) And finally, what will make me click on the email that you sent to me? The enticing subject? Maybe.  </p>  <p>  \tSo are you ready to secure a job interview? Sign Up Now.  </p>  <p>  \t30-Day Money Back Guarantee  </p>", 
    "end_date": null, 
    "title": "How I Got A Job Interview With 3 Steps", 
    "price": "30.00", 
    "instructors": "Erudite Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352918_e0ed.jpg", 
    "course_url": "https://www.udemy.com/secure-job-interview/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T14:21:45Z"
}