{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Having worked on movies and television shows such as <em>Guardians of the Galaxy</em>, <em>Alice Through the Looking Glass</em>, <em>The Walking Dead </em>and <em>Hemlock Grove </em>in visual effects, an active professional in the Hollywood film industry will reveal the tips, tricks and steps to getting a film job in Hollywood. If you have been trying to break into the Hollywood film industry without any luck, this course will provide the tools and key takeaways you need to increase your odds of success in getting into the game.</p>\n\n<p><strong>Understand What it <em>Really</em> Takes to Make it in Hollywood's Competitive Film Industry.</strong></p>\n\n<p>Learn through real-life examples and personal observations about what current professionals in the industry do and what recruiters, studios and producers look for in new hires, as well as tips to preparing the resume and website for a first-timer in the industry.</p>\n\n<p><strong>Why This Course?</strong><br></p>\n\n<ul><li>Taught by a <em>real professional</em> in the industry who worked on <em>actual Hollywood blockbusters</em></li><li>Step-by-step guide with lots of <em>in-depth</em> information</li><li>Debunking of myths about breaking into the industry</li><li>Active discussion is encouraged between students and instructor</li><li>Networking and open collaboration opportunities with instructor and students</li><li>Coaching and mentoring on discussion boards included!</li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong>Learn How to Leverage your Current Experiences, Skills and Passion to Maximize your Chances of Breaking into Hollywood.</strong></p>\n\n<p><strong>You will Learn How: </strong></p>\n\n<ul><li>The film industry phases work</li><li>Various types of entry-level positions get you into different specializations in the film industry</li><li>To climb the job ladders of hierarchy</li><li>To identify your current Experience, Skill and Passion levels</li><li>To gauge where you stand against the professionals in the film industry</li><li>Recruiters, studios and producers hire candidates for most film jobs</li><li>To select the right projects and productions to work for</li><li>To create a film resume and website that makes sense for your position</li><li>Existing online resources and other surprising resources help in getting a job</li><li>To stay in touch with new connections with authenticity and good email etiquette</li><li>Hollywood myths circulate and what really matters in Hollywood</li></ul>\n\n<p><br></p>\n\n<p>Complete with additional resources, a fun and engaging teaching style and - <em>SPOILER ALERT </em>- a wide unpredictable variety of content delivery methods, students who complete the course will also be awarded with a <strong>bonus</strong> section - kind of like that bonus clip is you sit through the entire credits roll at the end of a film.</p>\n\n<p>If you participate in this course, you will walk away becoming more enlightened and empowered with these new insights and knowledge about how the Hollywood industry truly works, which would put you much ahead of the curve of everyone else who is trying to break into Hollywood. </p>\n\n<p>But if you walk away from this page right now, you will always be left wondering what <em>might have</em> and <em>could have </em>been, if you had taken this first step.</p>", 
    "end_date": null, 
    "title": "How to Get a Job in Hollywood (with 1-on-1 mentoring)", 
    "price": "25.00", 
    "instructors": "Vicki Lau", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590932_dfcd_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-job-in-hollywood/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-23T10:43:53Z"
}