{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\t<strong>Over 2000 students enrolled!</strong></p>  <p>\t Great communication means much more than just getting your point across, it means connecting. In this short class, coach Fareed Raja talks about <strong>helpful techniques</strong> for building those important connections that make it easier to come to work every day.</p>  <p>\t He introduces the key <strong>helping behaviors</strong>, the importance of sharing the spotlight and finding mutual interests, and the good impact that <strong>modeling professional behavior</strong> can have on the entire team dynamic.</p>  <p>\t In this course, you will learn about how to emphasize on building deeper connections at your workplace using the following 6 techniques:</p>  <ul>\t<li>Modeling exemplary behavior</li>\t<li>Helping others with challenges</li>\t<li>Finding &amp; sharing commonalities</li>\t<li>Highlighting the work of others</li>\t<li>Sharing insights &amp; opportunities</li>\t<li>Being considerate &amp; thoughtful</li>  </ul>  <p>\t There is a lecture dedicated to each one of these above mentioned techniques. You should take this course if you ever felt the need to network with your colleagues, but hesitated. Or if you are looking to <strong>climb up that corporate ladder</strong> and end up with a <strong>leadership</strong> role at your organization.</p>  <p>\t After taking this course, you will be able to:</p>  <ul>\t<li>Connect at a deeper level with your peers</li>\t<li>Use different tips and techniques to build rapport</li>\t<li>Be able to coach others with a more efficient technique</li>\t<li>Build amazing and long lasting relationships with your network</li>  </ul>  <p>\t I highly recommend taking this free course and be a part of a discussion with me and other students to find out how to <strong>effectively connect</strong> and work and possibly share more ideas.</p>", 
    "end_date": null, 
    "title": "How to Influence Colleagues and Make Friends at Work", 
    "price": "20.00", 
    "instructors": "Fareed Raja", 
    "commitment": "29 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411882_0a7c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-deep-connections-at-work-in-30-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T05:14:43Z"
}