{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        This is <strong style=\"\">your STARTING POINT.</strong>  If you are a budding entrepreneur or someone who has been searching for a new beginning to fulfilling your dreams, <strong style=\"\">this course is for you.</strong>  </p>  <p style=\"\">  \t            I know why you’re here.  How can I say that?  Because I’ve been exactly where you are.  </p>  <p style=\"\">  \t        What I mean by that is, I’ve been at the point where I had the itch, the inner tug that told me there is something more than the everyday punch a clock, nine to five routine.  So, I know what you’re thinking.  <strong style=\"\">You have skills, gifts and abilities and great ideas </strong>to take the leap into the world of an entrepreneur.  </p>  <p style=\"\">  \t            The challenge is… how do you pull the trigger?  Where do you start?  <strong style=\"\">You’ve come to the right place. </strong> There is so much to learn to become a successful entrepreneur and a lot of different routes to get there.  But no one would dispute no matter what path you take, everyone has to take a first step.  </p>  <p style=\"\">  \t  This course is designed to best be experienced over the course of five days.  Beginning with the Introduction and Day One, take time to listen to the course and complete the accompanying Action Sheet and Jumpstart Journal each day.  It&#039;s best to set aside the same time each day ( I find early morning works best of me) for a minimum of 30 minutes.  Gaining the &quot;Entrepreneurial Edge&quot; requires discipline, commitment and time.  </p>  <p style=\"\">  \t<strong style=\"\">In this five day jumpstart, you’ll learn:</strong>  </p>  <ol style=\"\">  \t<li style=\"\">How to define your ultimate dream and get down on paper or in some kind of document.  This is important to making it real.  We’ll talk through the best way to accomplish that.</li>  \t<li style=\"\">How to cut years off your learning curve saving you aggravation, time and most importantly money.  This one tip alone can be a game changer.</li>  \t<li style=\"\">How to map out a step by step plan to take you where you want to go.  We’ll talk our way through a proven method and strategy of insuring that you achieve your goals.</li>  \t<li style=\"\">The key to staying on track once you complete the course.</li>  \t<li style=\"\">Valuable short-cuts and warning signs to look out for as you progress along your journey.</li>  \t<li style=\"\">What role your unique story plays in increasing your chances of achieving your dreams.</li>  </ol>  <p style=\"\">  \t            You can talk about it all you want, but until you take your first step, it’s just that talk.  Don’t waste any more time.  Sign up now and <strong style=\"\">begin this exciting, rewarding journey</strong> that you’ve always dreamed of.  </p>  <p style=\"\">  \t            I look forward to taking this journey with you.  </p>", 
    "end_date": null, 
    "title": "How To Gain The Entrepreneurial Edge & Kickstart Your Dreams", 
    "price": "20.00", 
    "instructors": "Jeff Whitaker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326426_8cbf_5.jpg", 
    "course_url": "https://www.udemy.com/early-morning-entrepreneurial-edge-5-day-jumpstart/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T14:15:44Z"
}