{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> \t      This course is based upon the work of Steve Schwartz, a professional college admission counselor in New York with over a decade of experience. He's the author of a popular guide to college admissions as well as hundreds of articles on the college admissions process (available on <em>Get Into College Blog</em>). He's also the moderator of <em>Reddit's college admissions forum</em>.</p><p>He speaks regularly on various aspects of the college application process to students, parents, and educators at schools and community organizations. He also facilitates interactive seminars and workshops.</p><p>In his experience, test scores and GPA usually aren't enough to guarantee admission. Your college essays play an important role in showing colleges who you are as a person.</p><p><em>In this course, he'll help you craft college essays that showcase your strengths and make them want to accept you.</em></p><p>Because GPAs and standardized test scores don't tell your full story, the college essay is your #1 chance to show admission officers who you are. In these short lessons, you'll learn the role of the college essay in the admission process, choose a topic, develop your unique \"position\" as an applicant, write a rough draft, and ultimately turn it into a polished final draft that you can proudly submit.</p><p>Bonus: As a special thank-you for signing up, you'll also get a free lesson on how to answer the school-specific “Why Do You Want To Go To Our College?\" essay.</p><p>Why wait? <span>This is the most popular college admission course on Udemy, with over 1,000 students and counting</span>. Sign up now to begin developing your story.</p><p>***</p><p><strong>Steve's Story</strong></p><p>Although my GPA and test scores were below the norm, I was accepted to Columbia University in 2002. (Of course, I accepted their offer of admission and <em>loved</em> it there!)</p><p>Why? Because I was a high school superstar. (Best-selling author Cal Newport actually featured me in <em>How to Be a High School Superstar.)</em></p><p><em></em>I wowed them with a college essay about my experiences lobbying government delegates at a United Nations conference in South Africa. (The real UN, not Model UN.)</p><p>Delegates from government and non-profit organizations wrote my letters of recommendation. My résumé described my leadership in a national youth organization advocating sustainable development.</p><p>Soon after Columbia accepted me, friends, neighbors, and people I barely knew began asking for advice on how to improve their college applications.</p><p><em>Since then, I've helped over 1,000 students craft winning college essays and gain admission to the schools of their dreams.</em></p><p><em></em>I can help you, too.</p><p>For more information about me and the services I provide, please email me.</p>", 
    "end_date": null, 
    "title": "How to Write a Successful College Application Essay", 
    "price": "50.00", 
    "instructors": "Steve Schwartz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/102684_474c_7.jpg", 
    "course_url": "https://www.udemy.com/college-application-essay/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-07T18:47:20Z"
}