{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      In this course you will learn everything you need to know for how to become a personal trainer. You will learn everything from the steps needed to get started to ideal strategies to get clients professional marketing companies would use.  </p>  <p style=\"\">  \t<strong style=\"\">How This Course Is Structured</strong>  </p>  <p style=\"\">  \t      This course is divided into two parts. The first part of the course is an interview of Joey Zanca who is a successful MMA and boxing personal trainer in New York city. Joey teaches you everything you need to know from deciding whether this career is right for you to the steps you should take to get your first clients and job as a trainer at a gym.  </p>  <p style=\"\">  \t      The second part of the course is a list of 25 strategies to get clients as a personal trainer without needing the gym to drive you leads. Together, the course will help you start and grow your personal practice as a personal trainer.  </p>  <p style=\"\">  \t<strong style=\"\">Not Sure If The Course Is Right For You?</strong>  </p>  <p style=\"\">  \t      Every Udemy course comes with a 30 day money guarantee. So there is never any risk to take a course. If you are curious, go ahead and sign up now, and see for yourself if the course is helpful to you. If it isn&#039;t just get a refund. But I am confident that you will find value from the course!  </p>", 
    "end_date": null, 
    "title": "How to start a career & become a personal trainer ", 
    "price": "20.00", 
    "instructors": "Alex Genadinik, Joey Zanca", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376330_cd27.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-career-as-a-personal-trainer-get-clients/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-23T15:15:59Z"
}