{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>After just a few weeks I have over 1400 students enrolled on my courses. And I would just like to thank each and every student for signing up. Read on and see how the closing techniques used by sales people the world over can also be used to influence your family, friends and people you work with. </p><p>I've often heard people say \"They are a born salesman. They could sell ice to an Eskimo\" Usually implying that sales skills are mainly the ability to talk. Nothing could be father from the truth. . Yes there are some attributes that will help a sales-person succeed but I firmly believe that sales-people are made.</p><p>Would you go for treatment by a born doctor, particularly if they were untrained and wielding a scalpel. Would you take your car to a born mechanic who hadn't been through an apprenticeship to become capable. No you wouldn't. And sales-people are the same. They need good training in all aspects of the job. Selling is about bringing produces or services together with someone who wants, needs or desires that product and can afford it. People are reticent about making decisions and so the sales-person job is to help them come to that decision. </p><p>This course is created to go through the closing aspect of selling. The part where you do need to nudge the buyer. A bit like a sheepdog driving his flock into a pen, maybe across rough terrain and open country. </p><p>The art of closing is a great skill in life too. It will help you influence people to your way of thinking at home, with friends, in the community and at work. Closing is an art that is associated with selling but in fact one that we can use successfully every day.</p><p>This course covers many different ways to influence others, some you will know and others may be new. You may want to try some and see how successful you are. Remember, closing is an art, And any art needs practice, whether painting, writing or even talking..Conversation is a real art and by dropping some closing techniques in, they will become natural and part of talking. </p><p>I do hope you will take this course and learn from it, whether as a sales-person or as a life skill. <br></p><p><br> </p><p><br></p>", 
    "end_date": null, 
    "title": "How to  Successfully Persuade People and Close Sales", 
    "price": "20.00", 
    "instructors": "Mike Leahy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634586_6b78_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-successfully-persuade-people-and-close-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T08:30:17Z"
}