{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course you will learn how to start or accelerate your career as a business coach, life coach, executive coach or just about any other type of coaching.</p><p>Marc Mawhinney is one of the top experts on coaching. In fact, he is a coach for coaches, and has the #1 podcast in which he interviews a new coach every day!</p><p>In this course, Marc brings you what he learned from all the coaches he&#039;s talked to over time. You will learn his productivity tips, his marketing tips on how to get clients, his strategies on how to find your niche (especially a lucrative niche with clients that can afford to pay fair prices), and much more. </p><p>The secondary instructor in this course is Alex Genadinik who is also a business coach that has helped over 1,000 people in his mobile apps and business coaching practice.</p><p>Together, Alex and Marc bring you the tips you need to become a leading coach (or one of the leading coaches) in your industry.</p><p><strong style=\"\">No Risk To Try The Course</strong></p><p>Every Udemy course comes with a 30-day money back guarantee. So if you aren&#039;t sure whether this course is right for you, there is no risk to giving it a try. If you don&#039;t like it, you can simply get a refund. But we are sure that you will love the course. So go ahead, sign up, and start learning what it will take to make you one of the top coaches!</p>", 
    "end_date": null, 
    "title": "How To Become a Business, Marketing Coach Or Life Coach", 
    "price": "20.00", 
    "instructors": "Alex Genadinik, Marc Mawhinney", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460278_bc28.jpg", 
    "course_url": "https://www.udemy.com/coaching/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T03:15:51Z"
}