{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">This course answers the following questions:</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<ol><li><strong>How can I get a better paying job?<br></strong></li><li><strong>How can I enjoy long-term job security in turbulent times?<br></strong></li><li><strong>How can I become the kind of person that employers are seeking?<br></strong></li><li><strong>I can I earn the kind of money I believe I deserve?<br></strong></li><li><strong>How can I enjoy a variety of job options?<br></strong></li><li><strong>How can I reach the pinnacle of my profession and stay there?<br></strong></li><li><strong>“I want my job to contribute towards the transformation of others”. But how will this happen?<br></strong></li><li><strong>How can I derive job satisfaction from my job?<br></strong></li></ol>\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you are looking for a <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"Quick Fix\"</em></strong> (like exchange your $20,000 salary for a $1m a year salary within one month), <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">this is NOT  the course for you.</em></strong> In this course, I have shared timeless principles that work wherever country you are located, whatever industry you engage and whatever sex or age you are. It works because they are centred on natural laws for success in the workplace, life, and business.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>I have used some of the latest research conducted by credible sources to introduce to you a way of thinking that will reshape your life.</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is structured around identifying the core challenges every employed person faces. that they may not have noticed or even considered. It then provides workable solutions that can be applied for best results.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Sadly most people are so engrossed in making a buck, surviving, or simply living;  that they can get easily be consumed or sidelined by the evolution of the world economic system. The reality is that it does not need to be that way! Everyone has the opportunity to create a better working life that allows you to get paid as much as you deserve, enjoy better-working lives as well as job security and progression. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Even if you know where you want to go you need a roadmap to get you there and if you don’t know you will get the help you need too. This is why this course fits in.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It is designed to reposition you for success so that you become the kind of employee every employer wants and sorts after. With simple step by step process, the course reveals information that enables you to make clear individual plans that empowers you to embark on the road that assures you answers to the 7 questions listed above.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Sign up now and learn how you can shorten the learning curve and reach a better place sooner than you thought was possible!</strong></p>", 
    "end_date": null, 
    "title": "How To Position Yourself For A Better Paying Job In 2016!", 
    "price": "50.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/832378_3dba.jpg", 
    "course_url": "https://www.udemy.com/career-how-to-position-yourself-for-a-better-paying-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-26T13:39:41Z"
}