{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t <strong>Are you looking to get hired for a new job or career and would benefit from Professional advice and support with</strong>:\r\n</p>\r\n<p>\r\n\t       1. How to format and tailor your Resume to really highlight your skills and experience effectively?\r\n</p>\r\n<p>\r\n\t       2. How to make your job application stand out from the crowd and grab an employers&#039; attention?\r\n</p>\r\n<p>\r\n\t       3. What answers to prepare for interview questions?\r\n</p>\r\n<p>\r\n\t       4. What interviewers will ask about your skills and experience?\r\n</p>\r\n<p>\r\n\t       5. How to deliver yourself in an interview for success?\r\n</p>\r\n<p>\r\n\t <strong>Why are these skills important?</strong>\r\n</p>\r\n<p>\r\n\t    Being the most qualified person applying for a job does not automatically equal success, and in today&#039;s competitive job market you have to standout ahead of other people by displaying you are the right fit for the job, which involves knowing how to identify exactly what employers are looking for, how to prepare yourself for an interview, and how to deliver yourself successfully.\r\n</p>\r\n<p>\r\n\t <strong>Why <em>this</em> course?</strong>\r\n</p>\r\n<p>\r\n\t Through mastering a series of powerful techniques in Resume Creation, Tailoring Job Applications, Interview Preparation and Interview Delivery, I have been able to learn unique and powerful skills not taught at school, college or university, that have led to my success as I&#039;ve progressed from being hired as a student over 10 years ago, through to more recently being hired as a senior professional in a number of major organizations.\r\n</p>\r\n<p>\r\n\t This course will teach you powerful skills, techniques and tricks that can be used immediately, and throughout your life, for success in getting you hired ahead of other people. The knowledge you will learn is relevant to any job, within any industry where you have to provide a Resume and Job application or attend a Job interview, and by signing up you get full access to:\r\n</p>\r\n<ul>\r\n\t<li>1.5 hours of short interactive video tutorials on the key learning outcomes shown below</li>\r\n\t<li>More and more Bonus Lectures as they become available</li>\r\n\t<li>The questions area where you can ask me one-on-one questions and get my direct support</li>\r\n\t<li>More and more knowledge for you to come back to throughout your life and career</li>\r\n</ul>\r\n<p>\r\n\t This course has been created combining my experience along with significant Research and knowledge from experts I&#039;ve interviewed in Recruitment, Human Resources, Business Management and Communication, and teaches you the skills, techniques and tricks that are the key to getting hired.\r\n</p>\r\n<p>\r\n\t <strong>What will this course teach you?</strong>\r\n</p>\r\n<p>\r\n\t This course will teach you:\r\n</p>\r\n<p>\r\n\t     - How to identify the language and key words used in a Job description and how you can use these to make your Resume really grab an employers attention and secure you an interview.\r\n</p>\r\n<p>\r\n\t     - Why the front page of your Resume is the most important, and how to format and tailor your Resume to really present your skills and experience for success in getting hired, including a Resume checklist for you to follow.\r\n</p>\r\n<p>\r\n\t     - Why a cover letter is important, and the 5 rules for creating a cover letter so that your job application grabs an employer’s attention in the right way.\r\n</p>\r\n<p>\r\n\t     - Why it&#039;s important to not automatically assume your Resume and Job Application will be seen after you&#039;ve sent it, and the 6 powerful techniques you can use to guarantee your Resume and Job Application gets seen and you standout ahead of the other people applying for the same job as you.\r\n</p>\r\n<p>\r\n\t     - How to harness the power of Recruiters, including 6 Steps you can follow to successfully influence Recruiters to help get you hired (easily skipped if you don&#039;t use Recruiters).\r\n</p>\r\n<p>\r\n\t     - How interviewers will try to trick you with their questions, and how to prepare answers for any interview question you might face. I will share with you a technique that means you no longer have to try and predict all the different specific questions they could ask you.\r\n</p>\r\n<p>\r\n\t     - Why it&#039;s important to give your interview answers certainty, and the 3 simple rules you can follow for preparing answers before the interview that will really demonstrate you are the right candidate for the job you want.\r\n</p>\r\n<p>\r\n\t     - Why it&#039;s important to perform Research about the Organization or Job you are interviewing for, and how you can identify what you need to Research to impress in an interview.\r\n</p>\r\n<p>\r\n\t     - Why the first 60 seconds of an interview are the most important and can actually impact your interview being a success, including 5 things that impact the first impression you create and how to use this knowledge to make sure you create the right first impression for your interview success.\r\n</p>\r\n<p>\r\n\t     - What the trick question is that interviewers like to use at the start of an interview, and how you prepare an answer that will really impress them.\r\n</p>\r\n<p>\r\n\t     - 3 key things to remember when delivering your answers to interview questions, including a powerful trick you can use in the interview to know immediately that you have answered each interview question in enough detail.\r\n</p>\r\n<p>\r\n\t     - What Body Language is and why it&#039;s important for Interview success, including the 6 body language principles you can use for your own success and what types of Body Language to avoid using.\r\n</p>\r\n<p>\r\n\t <strong>How do I know this course will help and offers value for money?</strong>\r\n</p>\r\n<p>\r\n\t <strong></strong>The knowledge within this course is not age, gender, industry, company or job specific, and has been structured into a framework that is easy for you to learn and apply for your own success. Ask yourself this question - <strong>How much money will you earn if you are successful in </strong><strong>getting hired?</strong>\r\n</p>\r\n<p>\r\n\t             You are not just signing up for the video tutorials, I want to help you have success in getting hired, and by signing up for this course you will have access to the Questions and Answer area where you can get ongoing help and support from me directly, and where I will also be publishing more and more Bonus Lectures so you can keep coming back again and again to increase your success throughout your career.\r\n</p>\r\n<p>\r\n\t <strong>So what are you waiting for... </strong>\r\n</p>\r\n<p>\r\n\t              You can also follow me on twitter @1matthewhughes where I regularly share tips and ideas about how to get hired. I look forward to coaching you.\r\n</p>\r\n<p>\r\n\t             Thanks,\r\n</p>\r\n<p>\r\n\t              Matthew Hughes\r\n</p>", 
    "end_date": null, 
    "title": "How to Get Hired", 
    "price": "25.00", 
    "instructors": "Matthew Hughes", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62190_881b_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-hired/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-25T21:27:38Z"
}