{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will enable you as a hypnotherapist to develop your skills in the art of creating tailored suggestions for your hypnotherapy clients regardless of their presenting issue. Not only will it significantly reduce your dependency on generic scripts, it will also enable you to create, and maintain, better rapport with your clients.</p><p>With the help of a unique tool called 'The Suggestions Grid', you'll learn how to enrich your creativity in generating awesome combinations of hypnotic and posthypnotic suggestions for your hypnotherapy clients. </p><p>The duration of each lecture is between 7-12 minutes. However, in order to fully assimilate the level of detail in each lecture, it is essential that students spend time with each set of student exercises. These are also detailed in the course manual. The best way of becoming fully conversant with the methods shown in these lectures, is to construct your own suggestions for issues your current, or previous clients, have presented to you with. This makes it more real and relevant for you.</p><p>It is recommended that you us the video lectures, student exercises, and course manual simultaneously, to incorporate the following into your repertoire as a hypnotherapist: </p><p>Authoritarian and Permissive suggestions, Direct and Indirect suggestions, Positive and Negative suggestions, Descriptive and Abstract suggestions, Contingent suggestions, Law of Reversed Effect, Successive Approximations, Creating a Yes-Set, Asking questions instead of making statements, Binds, and Double Binds.</p><p>This course has a full 30 day money back guarantee. So if you're not happy with any aspect of the course please let me know. If you like what you see, and are enjoying your learning with me, please tell others!</p><p>If there is anything you need further clarification on, please feel free to ask :) </p>", 
    "end_date": null, 
    "title": "Hypnotherapy CPD: Spice Up Your Post/Hypnotic Suggestions", 
    "price": "50.00", 
    "instructors": "Karen Bartle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571208_fe24_5.jpg", 
    "course_url": "https://www.udemy.com/15-great-ways-to-spice-up-your-posthypnotic-suggestions/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-01T23:17:54Z"
}