{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis -Attract Positive Opportunities And Right Thoughts</strong>' By Pradeep Aggarwal , you will learn -</p><p><span></span><b>1.     \n</b>Everything in life begins with thoughts. Your thoughts\nplay a very vital role in determining your personality. Your speech and actions\nare affected by your thoughts greatly. This video course will program your mind\nfor correct thinking, which will help you attract positive opportunities in\nlife.</p><ul><li>\n\nFind how simply by changing the way you think you can change your speech\nand actions.\n\n<b></b>\n\n<b>2.     \n</b><b>How Self Hypnosis Can Help?</b><b></b>\n\n1)     \nSelf\nhypnosis helps change your old and limiting beliefs and thoughts<b></b>\n\n2)     \nSelf\nhypnosis brings more mental alertness<b></b>\n\n3)     \nSelf\nHypnosis helps you a great wave of relaxation refreshing your whole body<b></b>\n\n4)     \nSelf\nhypnosis helps to connect with the deep sources of power and energy within you<b></b>\n\n5)     \nSelf\nhypnosis helps maintain positive attitude <b></b>\n\n6)     \nSelf\nhypnosis treats stress, anxiety, nervousness and depression successfully<b></b>\n\n<b>\n</b><strong></strong></li></ul><p>This course is for those who are unable to attract the right opportunities for their career and growth with the right thought and actions due to negative thoughts and blocks in their mind which is affecting their success.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English including bonuses.</p><p></p>", 
    "end_date": null, 
    "title": "Hypnosis -Attract Positive Opportunities And Right Thoughts ", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579894_b50a_2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-attract-positive-opportunities-and-right-thoughts/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T07:55:08Z"
}