{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> Ever wonder why you always remember that speaker you listened to ten years ago? In this course we'll work together to help you relax and prepare to give exuberant presentations. </p><p>Learning the strategies of public speaking is essential for the growth of any individual, business or brand. Useful strategies for speaking preparation will help professionals and entry-level individuals find a way to ignite their speech delivery. This course utilizes an electric approach to speech delivery that will spark the speaker to develop techniques implemented in the course. </p><p>Together we will look at the symptoms of anxiety that accompanies public speaking (nervous hands, itchy throat, loss of concentration)..Captivate the audience with key engagement techniques.</p><p>The United Stated Department of Labor indicates that the 21st century will call for individuals who are leaders in their fields. The communication industry will need people to utilize innovative strategies to market, promote and build industry standard services and products.</p><p>Suitable for intermediate and advanced speakers, you'll learn key principles for building rapport with any given audience. In this hands-on course you will be able to utilize these speaking techniques to enhance your speech delivery.</p><p>Together we will look at the symptoms of anxiety that accompanies public speaking (nervous hands, itchy throat, loss of concentration). You'll experience captivating warm-ups that build articulation, projection and audience rapport. </p>  <p>You'll have practical implementation of key speaking strategies that will propel you to advance in your speaking skills.</p>", 
    "end_date": null, 
    "title": "Ignite your speaking skills: Captivate the  audience", 
    "price": "30.00", 
    "instructors": "Dr. Allana Da Graca", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231154_082e_6.jpg", 
    "course_url": "https://www.udemy.com/ignite-your-speaking-skills-captivate-the-audience/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T19:30:33Z"
}