{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Often when it comes to our career we are some of the worst salesman of our abilities and skills.  We sell ourselves short in our abilities come review time, or accept less than we are worth out of fear that they will find someone else.  Instead of building ourselves up and selling ourselves for maximum value we accept what is given to us and end up doing twice the work for half the pay.</p><p>One of the most important places you can ever sell yourself is during the interview process for a new job.  It is during this process that you should make an effort to build up yourself and sell your skills to the potential employer by making them feel that if they hire anyone else but you they are going to be losing out on an amazing talent.</p><p>A solid and organized resume is the key to getting the job you want.  Simply put, without a good resume, you will not get noticed.  Without getting noticed, you will not be called for interviews.</p><p><br></p><p>The resume is your formal introduction to the career world.  It discloses your talents to those who are seeking just such talents.  To this aim, it is important not to lose sight of the goal of the resume.  The resume lets the employer know who you are, why he needs you, and where he can reach you so that he can secure an interview with you.  Write your resume to reflect these goals, in a concise, organized and well-phrased document.  Use this organized and well-phrased resume to your advantage at the interview, as the document is, essentially, the first impression that you have made.  This is the manner in which you should view the preparation and presentation of your resume.  Once at the interview, put a smile on your face and pat your resume on the back for the great job both you and it have already done - your dream career is now very near!<br></p>", 
    "end_date": null, 
    "title": "Improve your resume writing skills - Create perfect resume", 
    "price": "20.00", 
    "instructors": "Danilo Stojkovic", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670552_699c_3.jpg", 
    "course_url": "https://www.udemy.com/perfect-resume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T19:29:39Z"
}