{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tInterpersonal hatred is a common obstacle to personal growth and human flourishing, especially when a client has been deeply hurt by another. And although the application of forgiveness as a therapeutic intervention can be very helpful, it must never be required or merely forced on a client, who must be allowed time and assistance in letting go of his or her hatred. This workshop will explain the origin of interpersonal hatred, why people like and hold onto it, and its long-term consequences. It will also offer some practical applications for helping a client overcome hatred.  </p>  <p>  \t<strong style=\"\">Learning Objectives</strong>  </p>  <p>  \tAt the end of this workshop, participants will be able to:  </p>  <ol style=\"\">  \t<li>Explain the difference between anger and hatred.</li>  \t<li>Discuss the origin of interpersonal hatred in splitting of a good mother and a bad mother.</li>  \t<li>Explain the object relations model of overcoming splitting.</li>  \t<li>Explain the conditions under which splitting occurs in normal adults.</li>  \t<li>Identify some common reasons people like interpersonal hatred.</li>  \t<li>Identify the long-term consequences of interpersonal hatred.</li>  \t<li>Discuss praying for enemies as an exercise to overcome splitting.</li>  \t<li>Discuss psychological obstacles, such as pride, to overcoming interpersonal hatred through forgiveness.</li>  </ol>", 
    "end_date": null, 
    "title": "Interpersonal Hatred and Other Barriers to Forgiveness", 
    "price": "50.00", 
    "instructors": "Institute for the Psychological Sciences, Elina Holland", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416896_ed3a_2.jpg", 
    "course_url": "https://www.udemy.com/interpersonal-hatred-and-other-barriers-to-forgiveness/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T01:19:08Z"
}