{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  A course for anyone interested in joining a strategy consulting firm who is curious about how to approach the ‘fit’ or experience part of the interview. Successfully navigating the ‘fit’ or experience interview is essential for a candidate interested in joining a strategy consulting firm. Consulting firms consider the experience interview as important as the case interview when they select candidates to join their firms.  </p>  <p>  \t  This course will cover the different questions asked in a consulting experience interview and will also give specific and detailed recommendations on how to address those questions. Anyone who is considering a move into strategy consulting and therefore needs to be successful in the experience interview should consider this course.  </p>  <p>  \t  The goals of the course are:  </p>  <ul>  \t<li>To provide background on consulting fit interviews, their structure and why strategy consulting firms use them</li>  \t<li>To provide recommendations for answering the different question types in consulting fit interviews</li>  \t<li>To outline the preparation that each candidate should do in order to be successful in consulting fit interviews</li>  </ul>  <p>  \t  This course is lecture based, has 11 lectures and has 60 minutes of video content in total. It is designed for anyone who is considering a move into strategy consulting and therefore needs to be successful in the experience interview.  </p>  <p>  \t  The course has three sections:  </p>  <ul>  \t<li>Introduction to Strategy Consulting Fit Interviews,</li>  \t<li>Answering Specific Fit Questions, and</li>  \t<li>Preparing for Fit Interviews</li>  </ul>  <p>  \t  The main section of the course, Answering Specific Fit Questions, discusses the 4 main types of questions and considers each type individually. For each question type, we give specific examples of what works well and does not work well in a consulting interview. We conclude with specific preparation candidates should consider before interviewing with a consulting firm.  </p>  <p>  \t  The only prerequisite is that students know what a job interview is and now need to prepare to interview for Strategy Consulting roles.  </p>", 
    "end_date": null, 
    "title": "Introductory Consulting Fit Interview Skills", 
    "price": "30.00", 
    "instructors": "Mike Salvaris, Jackson Carroll", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156108_8bbb_3.jpg", 
    "course_url": "https://www.udemy.com/introductory-consulting-fit-interview-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-31T21:25:47Z"
}