{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Regardless of your age or experience level, nailing the interview can be challenging. </p><p>Until now...<br></p><p><strong>Meet the Expert</strong></p><p>J.T. O'Donnell is an HR &amp; Recruiting Expert, with more than 15 years experience. With over 1 MILLION followers on LinkedIn, she is considered a top influencer in the area of job search and career development. Her work has been cited in <em>The Wall Street Journal</em>, <em>The New York Times</em>, <em>Inc</em>, <em>Fast Company</em>, and many other major publications.</p><p>J.T. designed this course based on her thousands of hours helping clients master interviews to land the job they want and deserve!<br></p><p><strong>Here's What You'll Learn</strong></p><p>This comprehensive course breaks down every aspect of interviewing so you can finally feel confident and in control. You'll receive easy to follow, step-by-step instruction that will teach you:</p><ul><li>How to properly prepare for each interview.</li><li>The various types of interviews and what to expect during each one.</li><li>How to make sure you give the right answers to interview questions - every time!</li><li>A list of questions you should ask on the interview that will impress the hiring manager.</li><li>The best way to follow-up after the interview.</li><li>Tips for standing out and beating your competition.</li></ul><p><span></span><br><strong>Why This Course Is So Effective</strong></p><p>The class is broken down into 9 Sections, each with short, informative videos designed to help you quickly master the art of effective interviewing.</p><p>Within a matter of hours, you'll feel like you've been given the inside track on how to make employers fall in love with you.</p><p><strong>Want A Better Job? Then Interview Prep Is A Must-Do</strong></p><p>Don't let a lousy interview cost you the job. This course will give you the confidence you need to WOW employers and dramatically increase the chances you get the job offer. When it comes to interviewing, nobody can do it for you. It's up to YOU to improve your skills so you can impress the hiring manager. </p><p>This course is the key to successfully showcasing your true potential in the interview!<br></p>", 
    "end_date": null, 
    "title": "Job Seeker's Guide To Nailing Every Interview", 
    "price": "50.00", 
    "instructors": "J.T. O'Donnell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/751294_89f5_4.jpg", 
    "course_url": "https://www.udemy.com/job-seekers-guide-to-nailing-every-interview/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T14:53:14Z"
}