{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong>[UPDATED FOR December 2015]</strong></p><p>Is the JOB HUNTING PROCESS letting you down?<br></p><p>Are you scared that you won't ever find a job? You know exactly how to do the job, but you're scared of the job hunting process? Are you sick of filling out form after form of job applications?</p><p>Well, you're not alone.</p><p>I can teach you how to bypass all of that fear, anxiety, and soul-grinding repetitive work. </p><p>In this course - just a few videos - you will learn how to directly contact the Hiring Manager, smoothly pass the phone interview, and get a job offer that's fair to your skills and expertise. </p><p>It's simple. It's easy.</p><p>At the end of the course, you will have an amazing resume, a LinkedIn Profile that's visible to thousands of online Recruiters and HR managers, and your own personal portfolio website.</p><p>This course is anyone who wants to make a positive change in their lives. It is for people willing to work hard to get a higher salary, a better working condition, and more meaning in work.</p><p>And l try to entertain you along the way.</p><p>Take the class now! It's fun, it's EASY. And you will remember the job hunting process FOREVER. You will always have an easy time finding jobs after this course.</p><p>See you in class!</p><p>Click the button to enroll in this course now! Improve your Job and improve your life!</p>", 
    "end_date": null, 
    "title": "Job Hunting Guide", 
    "price": "20.00", 
    "instructors": "Jane Cui", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543406_9f23_5.jpg", 
    "course_url": "https://www.udemy.com/job-search-complete-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T19:15:06Z"
}