{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em style=\"\">Go From Job Seeker to Job FINDER!</em>  </p>  <p>  \tGet insider advice from career experts with almost 40 years of combined experience. You’ll be motivated, inspired and gain the edge you need in today’s market.  Experience a process that goes beyond just the theory of how to find the work you love.  </p>  <p>  \tREADY - This course is one of three in the Job Search Boot Camp series, recorded live by Angela &amp; Jay in 2010.  The two other courses are AIM &amp; GET HIRED!  </p>  <p>  \tThe AIM Course can be found on Udemy at:<br style=\"\">  \t<a href=\"http://www.udemy.com/jsbc-aim\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">http://www.udemy.com/jsbc-aim</a>  </p>  <p>  \tThe GET HIRED! course can be found on Udemy at:<br style=\"\">  \t<a href=\"http://www.udemy.com/jsbc-get-hired\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">http://www.udemy.com/jsbc-get-hired</a>  </p>  <p>  \tWhat you&#039;ll learn in this course:  </p>  <p>  \t- The different types of resume formats and when/why to use them  </p>  <p>  \t- How to write an accomplishments-based resume  </p>  <p>  \t- Various insider tips you need to know to get your resume noticed  </p>  <p>  \t- An easy technique to identify your Unique Promise of Value  </p>  <p>  \t- How to draw attention to your uniqueness in your resume  </p>  <p>  \tWorkbook includes samples, advice and exercises.  </p>  <p>  \t____________________________________________  </p>  <p>  \t<strong style=\"\">Feedback from clients about Jay&#039;s approach to career transition:</strong>  </p>  <p>  \t“Jay provides a good balance of practical advice and positive encouragement.” – M.G., Austin, TX  </p>  <p>  \t“You gave me a jump start after I have been bogged down by doubts and insecurities.” – C.L., Austin, TX  </p>  <p>  \t“Even if you are aware of the wide range of strategies he shares, you’ll come away with more information making it very worthwhile, especially for the short amount of time invested.” – C.S., Austin, TX  </p>  <p>  \t“I wanted to let you know that I accepted a job with NI last week. I’m excited about the opportunity….it’s a great role. Thanks for your help.” – J.L., Austin, TX  </p>  <p>  \t<strong style=\"\">Feedback from clients about Angela&#039;s approach to career transition: </strong>  </p>  <p>  \t“Angela provided me with career transition consulting and my only regret was not finding her sooner! From the help re-writing my resume, to the worksheets that helped me to understand my key competencies (very useful for competency-based interviews), to understanding the importance of networking and LinkedIn. Every piece of information and advice Angela gave me was incredibly helpful and definitely got me out of my job search rut. In addition, her upbeat and positive attitude made it an all around pleasant experience working with her. Angela is the ultimate expert at what she does.” Top qualities: Great Results, Expert, High Integrity – Jamelyn Hart, Austin, TX  </p>  <p>  \t“Angela helped me get a clearer direction in my career path. In our meeting Angela assisted me in narrowing down my fields of interest, suggested some organizations to research, and helped direct me in my action plan. She provided me with several worksheets that were key in revamping my resume. Angela&#039;s career coaching has been invaluable to me, and I see a light at the end of the tunnel now thanks to her!” Top qualities: Personable, Expert, Creative – Debbie Lester, Austin, TX  </p>", 
    "end_date": null, 
    "title": "Job Search Boot Camp: Ready Yourself, Ready Your Resume", 
    "price": "30.00", 
    "instructors": "Angela R Loeb, Jay Markunas", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30634_9d36_3.jpg", 
    "course_url": "https://www.udemy.com/jsbc-ready/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-26T20:55:15Z"
}