{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><strong class=\"redactor-inline-converted\">13,000+ Students </strong>have enrolled in my <strong class=\"redactor-inline-converted\">13 Courses!</strong></li><li>The <strong class=\"redactor-inline-converted\">4.75 Rating</strong><strong class=\"redactor-inline-converted\"> from student reviews </strong>shows the value packed in this course!</li><li><strong class=\"redactor-inline-converted\">Practicality: </strong>Over <strong class=\"redactor-inline-converted\">95 lectures</strong> including <strong class=\"redactor-inline-converted\">PDFs</strong>, <strong class=\"redactor-inline-converted\">Case Studies</strong> and <strong>Action Items</strong> will enable you to put in practice everything you learn!</li></ul>\n\n<p>Accelerating\nyour career twice as fast, achieving up to an 80% dream job application success\nrate or doubling your salary - all of this is possible if you master the job\nhacking process.</p>\n\n<p><strong class=\"redactor-inline-converted\">If you've ever been dissatisfied with\nthe job you're in, wanted a higher salary, had an ambition for climbing the\ncorporate ladder OR simply looked to switch industries, then this course is for\nyou.</strong> Everything will change starting now,\nif you commit to taking action.</p>\n\n\n\n<p>This comprehensive Job Hacking Blueprint will take you\nthrough the whole recruitment process, showing you how to get the essentials\nright, but also exposing you to hacks that will accelerate your progression and\ninstantly separate you from the other candidates.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here's what makes this course different:</strong></p>\n\n\n\n<ul>\n <li><strong class=\"redactor-inline-converted\">The Essential Assets For Job Hunting</strong> are resources you should invest\n     time in prior to your job applications. Having them will make your job\n     application more valuable with the adage of Accomplishment Lists or QR\n     Code Business Cards.</li>\n <li><strong class=\"redactor-inline-converted\">The Quant Resume Blueprint</strong> will show you how to instantly\n     communicate value to employers by focusing on results. It's a step-by-step\n     process which is easy to follow by anyone, including techniques such as\n     the One Liner Sniper or 6 Different Ways To Quantify Accomplishments.</li>\n <li><strong class=\"redactor-inline-converted\">LinkedIn &amp; By-Passing The Recruitment Process</strong>: two sections\n     that focus specifically on building a Superstar LinkedIn Profile and using\n     the platform to discover new job opportunities and EVEN contacting\n     recruiters directly to increase your success rate.</li>\n <li><strong class=\"redactor-inline-converted\">Personal Branding 101</strong> will show you advanced methods to\n     become an authority figure in your domain so that you instantly separate\n     yourself from the other applicants.</li>\n <li><strong class=\"redactor-inline-converted\">The Interview Techniques</strong> are comprehensive and cover everything\n     from how to turn your accomplishments into stories, answering competency\n     questions through the SAR/PAR techniques, as well as other interview steps\n     (e.g. Assessment centres, role-play interviews, psychometric tests)</li>\n <li><strong class=\"redactor-inline-converted\">Intercultural Awareness</strong> addresses the challenges that most\n     non-native English speakers face when applying for jobs in these countries\n     (including myself!). Learn how to maximise your job application success\n     rate and minimise the gap between yourself and native speakers.</li>\n <li><strong class=\"redactor-inline-converted\">Salary Negotiation</strong> <strong class=\"redactor-inline-converted\">Dynamics</strong> put you in\n     contact with the most powerful negotiation tactics that are tailored to\n     salary negotiation so that you know exactly how to get the best deal on\n     the table.</li>\n</ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Bonuses</strong></p>\n\n\n\n<p>Apart from the 13 Sections, this course includes\nadditional materials that will add to your learning experience:</p>\n\n\n\n<ul>\n <li><strong class=\"redactor-inline-converted\">10+ Case Studies</strong> covering real situations that myself/my\n     connections have experienced which reinforce the lecture content</li>\n <li><strong class=\"redactor-inline-converted\">5+ PDFs</strong> which give you tangible resources such as Amazing\n     LinkedIn Summary Examples or Recruiter Networking Scripts</li>\n <li><strong class=\"redactor-inline-converted\">3 Live Resume Transformations</strong> - Resume obtained from my Udemy\n     students which I transform from top to bottom in order to make them\n     results-based masterpieces</li>\n</ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Guarantee</strong></p>\n\n\n\n<p>This course has a 30-day money-back guarantee. Taking\nthis course - the most powerful job interview out there - is a no-brainer and I\nguarantee that once you've improved your interviewing skills, the results will\nmore than make up for the small investment you made to enroll.</p>\n\n\n\n<p>Will you take action and take control of your\nprofessional career? If you want to be more fulfilled on a professional level\nwhilst increasing your salary, then take this course now and join me in the\nvirtual classroom!</p>", 
    "end_date": null, 
    "title": "Job Interview Hacks + Resume, LinkedIn & Salary Negotiation", 
    "price": "40.00", 
    "instructors": "Dragos Stefanescu, Richard Korbut", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691066_a397_5.jpg", 
    "course_url": "https://www.udemy.com/job-interview-blueprint-resume-to-salary-negotiation-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T14:33:50Z"
}