{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                It&#039;s the most important conversation in your career.  </p>  <p>  \t    The job interview.  </p>  <p>  \t                Learn how to tell your story in a way that&#039;s clear, concise and engaging, with instruction from the <strong style=\"\">US National Elevator Pitch Champion</strong>.  As a career coach, Chris Westfall has helped thousands of students, managers, entrepreneurs and executives to create powerful career conversations.  From accountants to z-wave technologists, he&#039;s helped people to overcome their nerves, accelerate the conversation, and transform their careers -  using the strategies outlined in this course!  Whether you&#039;re starting out or seeking a six-figure executive role, you will find new ideas and new approaches on the other side!  Here&#039;s what you can expect:  </p>  <ul style=\"\">  \t<li>over 70 minutes of one-on-one video coaching with career expert, Chris Westfall (the author of <em style=\"\">BulletProof Branding</em> and <em style=\"\">The NEW Elevator Pitch</em>)</li>  \t<li>targeted instruction that goes beyond the basics - find out how to answer the really tough questions!</li>  \t<li>how to prepare for the interview, so you can present your story with confidence</li>  \t<li>change the interview from a one-sided interrogation into a conversation</li>  \t<li>build rapport and relate to the interviewer</li>  \t<li>how to prove you&#039;re a strong candidate, without being pushy, phony, or fake</li>  \t<li>learn how to overcome the negatives in your past - if you have little or no experience - or if you&#039;ve got some experience that you wish you didn&#039;t - then this is the course for you!</li>  \t<li>be confident about telling your story, especially when the stakes are high</li>  \t<li>demonstrate how you can make a difference for the employer</li>  \t<li>find out where you stand in the interview</li>  \t<li>negotiate your salary like a pro</li>  \t<li>several bonus materials: including How to Ask for a Raise, plus written materials to reinforce the videos</li>  </ul>  <p>  \t              It&#039;s all here -  expert advice, easy-to-watch videos, and clear instruction - and not a lot of overwhelming info!  Take your story to the next level, with an internationally-recognized expert, who&#039;s focused on your success.   This course represents the kind of quality you&#039;ve come to expect from Udemy - and the kind of results you expect for yourself.  Why not take the next step, and get closer to your dream job today?  </p>", 
    "end_date": null, 
    "title": "Job Interview Skills: Ace the Interview, Land the Job", 
    "price": "20.00", 
    "instructors": "Chris Westfall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396230_e539_3.jpg", 
    "course_url": "https://www.udemy.com/job-interview-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T01:55:37Z"
}