{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Brand new course: 2,000 students in the first 2 days! (Update: 3,000 in 3 days!-Thanks to all my students!)</strong></p>\n\n<p>\"Excellent course. Simply the most comprehensive course on job interviewing on Udemy.\" - Zoe T (Student)</p>\n\n<p><strong>Master the skills through this comprehensive course that tackles all aspects of job interviewing plus bonus of actual demonstration of 50 of the toughest and most common questions you will be asked</strong>. Learn from a top Udemy instructor with over 13,000 students who is a master of the Job Interview process so you can get hired!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Small investment considering the impact this course can have on your career, Enroll now and own the course forever.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Interviewing is a key skill as many times the best jobs do not go to the most experienced or qualified. They go to people with the best interviewing skills. </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Just too much competition to not be great at Job Interviewing.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Unfortunately, most people are not skilled at interviewing and really hurt their chances to move forward in the interviewing process and get the job offers they desire and deserve.<strong> Not being great at interviewing after working so hard during the job search process is like running a winning race and falling down at the finish line.</strong> All your hard work during the job search should culminate at the interview stage with a job offer for you!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>However, for those who are skilled with job interviewing they will really stand out from the competition and have a much better chance of success!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>THIS COURSE WILL TEACH YOU EVERYTHING YOU NEED SO YOU CAN GET MORE AND BETTER JOB OFFERS!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You will learn:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>How to prepare for any type of interview from classic one-on-one interview to panel interviews, Phone/Skype interviews, Behavioral/Situational interviews, interviews at job fairs and meals even the dreaded stress interview.</li><li>How to succeed in various part of the Interview sequence including screening interviews, qualifying, technical, approval, fit, psychological, and blessing interviews. </li><li>Key basics to nail from the greeting to presenting a professional image.</li><li>Insider tips on what to be aware of in any interview to gain an edge.</li><li>How to succeed in either a structured or unstructured interview.</li><li>Handling both open ended and closed ended questioning. </li><li>How to handle the most common questions that are asked in virtually very interview. Have to get these right every-time and you will learn how.</li><li>How to really shine with the toughest questions you may face.</li><li>How to be great with questions around you and your ability so you can separate yourself from the other candidates.specific </li><li>How to answer questions around team and teamwork.</li><li>How to handle unconformable and possibly illegal questions.</li><li>Next steps to take immediately after the interview that could make all the difference.</li><li>Negotiation strategies so you are paid and compensated what you deserve! This section is worth the price of the course by itself in terms of payback.</li><li>Why the top 50 questions are asked and what the interviewer is really looking for.</li><li>Actual demonstration of answers to specific questions that you can then personalize for yourself so you can nail every question.</li><li>Plus much more!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Get even more</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Lifetime access</strong> to the course so you get updates and new bonus lessons for FREE. Most people will have many jobs and thus many interviews so this course is always here for you when you need it.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Ask questions and I will answer them for you</strong>. Very focused on this to personalize learning. If you have a question l will gladly answer it for you with the goal that it helps with your interviewing success.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>No risk to sign up with 30-day money back guarantee and impact could be life-changing.</strong> Learn from my experience and rapidly move ahead faster with the knowledge I will share with you. </p>\n\n\n\n\n\n<p>Thanks to my professional film crew Devin, Mark, and Mo for their outstanding work!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>What students have said about the Telephone and Skype Job Interview course</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em><strong>\"This course is jam packed with great info to help anyone improve their skills and get positive results in their next interview.\"-Ken Long</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>\"Thorough and Thoroughly enjoyable. The presenter was very upbeat and supportive, speaking from years of experience.</em><em>\"-K Gartner</em><br></strong></p>\n\n\n\n\n\n<p>Many thanks and I appreciate your interest and hope to see you in the course!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>-Steve Ballinger</p>", 
    "end_date": null, 
    "title": "Job Interview Mastery + 50 Questions Demo And Get Hired!", 
    "price": "20.00", 
    "instructors": "Steve Ballinger, MBA", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730594_ff25_3.jpg", 
    "course_url": "https://www.udemy.com/job-interview-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-17T02:16:34Z"
}