{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Tired of sending your Resume into an online black hole? </em></strong></p><p><strong><em>Interviewers explain to you that you do not have the right track record for the job?</em></strong></p><p><strong><em>You are frustrated that the whole process is too slow and you would like to finally get a job</em></strong><strong><em>?</em></strong></p><p><strong><em>Don't worry. You have come to the right place!</em></strong></p><p>We will teach you how to <strong><em>polish your Resume, how to make it SEO friendly </em></strong>(yeah that's right!), and how to bypass hundreds of candidates. Nowadays large firms use applicant tracking systems to screen resumes before a person looks at them. <strong><em>They receive hundreds of resumes</em></strong> for every single position and “robots” help them separate “good” from “not so good” candidates. That is why you need to optimize your Resume for search. If you do that, you are three times more likely to be invited for an interview! Three times! </p><p>Sounds good? Well, that's not everything!</p><p>This course will show you <strong><em>how to spin your experience</em></strong> in a way that Hiring Managers will consider you as the perfect candidate for the job opening that they have. You will be able to set your Resume apart from everyone else's with just a few hours of work.</p><p><strong><em>Most people make the same mistakes and they do not even realize it.</em></strong> They fail to:</p><ul><li>Understand the importance of the job description</li> <li>Tailor their Resume according to the specific job</li> <li>Explain why they will be a great fit with the company </li></ul><p>Learning how to avoid these mistakes will boost your chances significantly. </p><p>Moreover, we will provide you with <strong><em>8 professionally written Resume templates</em></strong> that were used by successful candidates who have careers in Investment Banking, Finance, Marketing and International Management. You can, of course, use their templates and wording when editing your own Resume. </p><p><strong><em>Sometimes the main difference between a successful and an unsuccessful application is your Cover Letter</em></strong>. A page of text that was written by you tells a lot about your skills and motivation to join the company that you are applying for. </p><p>Don't let your Cover Letter keep doors closed for you! Learn how to write a compelling Cover Letter that will make recruiters want to meet you. It is not difficult. In one hour we will explain to you what needs to be included in your Cover Letter and which are the mistakes that you should avoid. <strong><em>You will also receive 6 professionally written Cover Letter templates that you can use as example.</em></strong></p><p>So far so good. But what about interviews? Phone interviews, Live interviews, Group assessments, Difficult interview questions?</p><p>No need to panic. <strong><em>You will gain an “unfair” advantage over other candidates by going through our lessons.</em></strong> You will be completely aware of what to expect in interviews and what will win the job for you at the end of the day.</p><p>But what about the typical interview questions that always come up? Do you feel like your answers are like everybody else's? You wouldn't impress your recruiters by memorizing canned responses that they have heard a million times before. What you need to do is show them that you understand the question, and respond to it in a way that they want to hear. </p><p>Good news! We have done the hard work. After careful research and going through numerous HR blogs, we filtered <strong><em>the 40 most frequently asked interview questions! </em></strong>They fall into six categories (Behavioral questions, Brainteasers, Difficult questions, Guesstimates, Situational and Qualification questions). Each of these questions comes with a suggested answer or solution that you can take into consideration when practicing your own answers. Afterwards, <strong><em>provided that you have doubts, we will gladly review any of your answers</em></strong> if you post them in the Discussion Board or as a personal message (whichever you prefer, of course).</p><p><strong><em>And what about LinkedIn?</em></strong> We have not forgotten LinkedIn given that it is one of the greatest tools that are at disposal to job seekers nowadays. We will show you how to be successful on LinkedIn, how to build your profile in a way that it is <strong><em>30 times (yeah, that's correct!) more likely</em></strong> to get you noticed by recruiters who are looking for people just like you!</p><p>Here are some of the reviews that we have received so far for this course:</p><p><em>“The course is structured and presented very well, and is great for graduate students to get a good grasp on learning how to find their first the job. The instructor's lecture style is engaging and catches the listener's attention easily, and helps the people enrolled in the course to learn very quickly</em>.” <em>Lilia, Udemy Student</em></p><p><em>“I'm really glad I took this course because next year I will be looking for my first job and it really puts a lot of things in perspective. I think that the resume and cover letter advice will be really useful when i have to submit my own applications. good stuff!” </em><em>Jean, Udemy Student</em></p><p>And what if we told you that you will even receive two extra gifts (additional cost of $0 for you) along with this course?</p><p>You will get our courses<strong><em> PowerPoint MasterClass: Beginner to Pro in PowerPoint</em></strong>, provided that you complete this course at 50%, and <strong><em>Beginner to Pro in Excel: Financial Modeling and Valuation, </em></strong>provided that you complete this course at 100%</p><p>Sounds great, right? These practical courses will teach you the technical skills that will really make a difference at your new job.</p><p>Just one more thing. <strong><em>If you still haven't decided whether you would like to take the course, please be aware that it comes with a 30-day money-back-in-full guarantee.</em></strong> This means that you can subscribe, study all of the lectures and decide for yourself whether it was worth it or not. If the answer is “No”, you can click a button and get your money back. No questions asked. So why not try it, right?</p><p><strong><em>After all, what is a well-paid career worth to you? </em></strong></p><p>Your starting salary would be a fraction of the price of this course. Every minute you are not on the job is actually Costing you money… </p><p><strong><em>Take the course and improve your chances of being successful! </em></strong></p><p><strong><em>Onwards and upwards! </em></strong></p>", 
    "end_date": null, 
    "title": "Job Search Success Strategies: Proven Job Hunting Strategies", 
    "price": "20.00", 
    "instructors": "365 Careers", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426760_8a16_3.jpg", 
    "course_url": "https://www.udemy.com/winning-business-finance-job-interviews-the-perfect-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T12:17:40Z"
}