{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Job Interview </strong>is the best way to showcase your inner potential and knowledge. It is a known fact that <strong> </strong>too many job looking aspirants jump right into a full-scale job search without any preparation other than putting together a resume. <strong>A serious mistake!</strong> <em>Although your resume may get you several <strong>job interviews</strong>, but to win job offers, it is important that <strong>you must prepare yourself</strong> further. </em></p><p>The current job market is becoming more competitive, and many interviewers are flooded with too many applications for the available positions. Hence you need to know the basic rules of the <strong>job interview</strong>: what to wear, what to say, and what to do when it's over.</p><p>It's extremely important to<em><strong> distinguish yourself from other candidates in some positive way to make sure you are in the top priority.</strong></em></p><p>Preparing for a <em><strong>job interview</strong></em> isn't difficult, but you need to be aware that it does take time and effort. The two important points you need to remember, and know thoroughly, are: <strong>what they want; </strong>and<strong> what you've got.</strong></p><p><em>So, the basic question in any <strong>job interview</strong> arises when interviewers say they're looking for <strong>'competent' candidates</strong>, what exactly do they mean?</em></p><p>This course <em><strong>Job Interview Guide 2016 </strong>answers the basic question <strong>\"How To Prepare For An Interview\" </strong>by providing several tips and insights which every candidate should understand before attend any <strong>job interview</strong>.<strong> </strong>This course also helps  students who are looking for <strong>Job Interview Tips </strong>along with</em> several insider secrets which the Interviewers use to assess the required candidates.</p><p>This course <strong>Job Interview Guide 2016</strong> explains the following important concepts</p><ul><li><strong>Job Interviews &amp; Types</strong></li><li><strong>How To Prepare For Any Job Interview</strong></li><li><strong>Knowing Your Strengths To Face Any Job Interview</strong></li><li><strong>How To Research About The Company &amp; also details various ways</strong></li><li><strong>Dress Code For Any Job Interview<br></strong></li><li><strong>Body Language For Any Job Interview<br></strong></li><li><strong>Learn Different Job Interview Phases</strong></li><li><strong>How To Approach Any Job Interview &amp; The Important Subjects</strong>( Be Prepared)<strong><br></strong></li><li><strong>How To Answer Ice Breaker Questions Effectively</strong></li><li><strong>How To Answer Tough Questions In Any Job Interview<br></strong></li><li><strong>How To Answer Questions Related To Long Term Unemployment</strong></li><li><strong>Learn To Convert Simple Answers To Effective Answers</strong></li><li><strong>How To Answer Questions Related To Salary Cleverly</strong></li><li><strong>Learn About Questions Which You Can Ask In Any Job Interview</strong></li><li><strong>Learn About Questions Which SHOULDN'T BE Asked In A Job Interview</strong></li><li><strong>Job Interview Closure</strong></li><li><strong>Top Job Interview Questions - Several Important Questions</strong></li><li><strong>Job Interview Tips</strong></li><li><strong>&amp; lot more..</strong></li></ul><p>This course <em><strong>Job Interview Guide</strong></em> comes with a 30 days money back guarantee and also life time updates. So what are you waiting for? Join this course today.<br></p>", 
    "end_date": null, 
    "title": "Job Interview Guide 2016", 
    "price": "20.00", 
    "instructors": "Phanindra Kumar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559210_713a.jpg", 
    "course_url": "https://www.udemy.com/how-to-prepare-for-an-interview-job-interview-tips-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T07:04:20Z"
}