{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Wollen Sie Ihre Karriere nach vorne bringen?</strong>\n\n  </p>\n\n<p><strong>Stehen Sie vor einer Bewerbung?</strong>\n\n  </p>\n\n<p><strong>Wollen Sie sich, Ihre Stärken und Kompetenzen professionell darstellen?</strong>\n\n  </p>\n\n<p> \n\n  </p>\n\n<p>Dann sind Sie in diesem Kurs richtig. Hier erhalten Sie eine exakte und einfache Vorgehensweise, wie Sie Ihre Kompetenzen ermitteln und sie in Bewerbungen, in Jahres- und Bewertungsgespräche aber auch Unterhaltungen mit Vorgesetzten und der Unternehmensführung professionell darstellen.\n\n  </p>\n\n<p> \n\n  </p>\n\n<p>Das sind einige der Vorteile für Sie:\n\n  </p>\n\n<p> \n\n  </p>\n\n<ul><li>Sie gestalten Ihre Bewerbungen professioneller als bisher.\n\n  </li></ul><ul><li>Sie sind exzellent vorbereitet und können sich selbst sehr gut darstellen.\n\n  </li></ul><ul><li> Sie gehen mit einem guten Gefühl in Gespräche und haben weniger Stress dabei.\n\n  </li></ul>\n\n<p> \n\n  </p>\n\n<p>Wer sich beruflich und geschäftlich gut darstellen möchte, der sollte alle seine Kompetenzen kennen und auch in der Lage sein, diese – je nach Situation und Anspruch – nach außen positiv darzustellen:\n\n  </p>\n\n<p> \n\n  </p>\n\n<p><strong>Fachliche Kompetenzen,<br></strong>durch Berufsausbildung, Studium oder Weiterbildung erworben \n\n  \n\n</p><p><strong>Methodische Kompetenzen<br></strong>wie Planen, Organisieren oder Delegieren<br></p><p><strong>Soziale Kompetenzen <br></strong>wie das schnelle Aufbauen von erfolgreichen und produktiven Arbeitsbeziehungen sein, für ein gutes Arbeitsklima zu sorgen, zu motivieren usw. \n\n  \n\n</p><p><strong>Persönliche Kompetenzen <br></strong>reichen von hoher Belastbarkeit und mit Stress gut umgehen zu können bis hin zu Flexibilität, Kreativität oder Lernbereitschaft.\n\n  </p><p>Wenn Sie alle Aufgaben in diesem Kurs bearbeiten, erreichen Sie für sich eine Menge: \n\n  \n\n</p><ul><li> Sie haben Klarheit Klarheit, was Ihren persönlichen Werdegang angeht</li><li>Eine Reflexion Ihrer Stärken, Ihrer Werte und was Sie sonst ausmacht</li><li>Sie haben eine detaillierte Einsicht Ihrer Fertigkeiten</li><li>Und eine Liste mit Ihren Kernkompetenzen </li><li>Sie wissen, wie Sie diese Kompetenzen gut formulieren und belegen können</li><li>Sie haben Ihre Ziele definiert</li><li>Und nächste Schritte festgelegt.\n\n  \n\n</li></ul><p>Der Kurs basiert auf dem Verfahren der Kompetenzenbilanz. Diese wurde 2003 von den Professoren Claas Triebel &amp; Thomas Lang-von Wins in Zusammenarbeit mit dem Zukunftszentrum Tirol entwickelt. Die Kompetenzenbilanz haben inzwischen über 8000 Menschen erfolgreich absolviert. Claas Triebel hat die Entwicklung dieses Kurses begleitet und Materialien zur Verfügung gestellt. \n\n  </p><p>\n\n\n\n</p><p>Viele haben die Notwendigkeit schon erkannt, ihre Kompetenzen und damit sich selbst positiv zu verkaufen und ihre berufliche oder geschäftliche Karriere so maßgeblich gefördert. Können Sie es sich leisten noch zu warten, während die anderen an Ihnen vorbeiziehen, während Sie stehenbleiben und nicht recht vorwärtskommen?\n\n  </p> \n\n<p><strong>Also egal ob Sie sich beruflich umorientieren möchten<br>Oder wieder ins Berufsleben einsteigen wollen</strong>\n\n  <br><strong>Einen neuen Karriereschritt wagen wollen</strong>\n\n  <br><strong>Ihnen eine konkrete Bewerbungssituation bevorsteht</strong>\n\n  <br><strong>Oder einfach eine Bestandsaufnahme machen wollen:</strong>\n\n  </p><p>\n\n\n\n</p><p><strong>Dieser Kurs wird Ihnen dabei helfen.</strong>\n\n  </p><p>Also: werden Sie jetzt aktiv. Belegen Sie heute diesen Kurs und bringen Sie Ihre persönliche Karriere nach vorne.</p>", 
    "end_date": null, 
    "title": "Karrieremanagement: Kompetenzen professionell darstellen", 
    "price": "20.00", 
    "instructors": "Jürgen Wulff", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/875422_4a85.jpg", 
    "course_url": "https://www.udemy.com/karriere-kompetenzen/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-11T17:54:57Z"
}