{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Sie laufen und laufen im Job und kommen doch nicht von der Stelle? \n\n  </p>\n\n<p>Viele Menschen erleben ihr Berufsleben genauso. Sie arbeiten quasi bis zum Umfallen und haben doch das Gefühl, dass ihr Einsatz und ihre Leistung nicht gesehen werden. \n\n  </p>\n\n<p>Sie retten Projekte, aber die Beförderung bekommen andere angeboten. \n\n  </p>\n\n<p>Die Frage nach einer Gehaltserhöhung verhallt Jahr für Jahr ohne konkrete Antwort.\n\n  </p>\n\n<p>Wenn es Ihnen so geht, sind Sie in bester Gesellschaft. Viele meiner Kunden kommen genau mit diesen frustrierenden Erfahrungen zu mir. Die gute Nachricht ist: Sie können diese Situation verändern. <strong class=\"redactor-inline-converted\">Ihre berufliche Situation liegt in Ihrer Hand!</strong></p><p>Ich zeige Ihnen, wie es Ihnen gelingt, \n\n  </p>\n\n<ul><li><strong>dass Ihre Leistung von Vorgesetzten gesehen wird, \n\n  </strong></li><li><strong>wie Sie sich positiv von Kollegen abheben ohne in eine Konkurrenzsituation zu gelangen, \n\n  </strong></li><li><strong>und wie Sie für das Unternehmen einen Mehrwert schaffen und sich für die nächste Karrierestufe qualifizieren! \n\n  </strong></li></ul><p>In diesem Kurs erfahren Sie die acht wichtigsten Strategien, um Ihrer Karriere auf die Sprünge zu helfen. Zögern Sie nicht länger, sondern geben Sie Ihrer Karriere den notwendigen Schub!</p><p> </p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Karrieremanagement: Die besten Erfolgsstrategien ", 
    "price": "20.00", 
    "instructors": "Jürgen Wulff", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792660_beec.jpg", 
    "course_url": "https://www.udemy.com/karriere-erfolgsstrategien/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T17:59:05Z"
}