{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    In today&#039;s world, you need to have a place on the internet that potential employers can see who you are. <strong style=\"\">Your resume is not enough.</strong> You need to show your talents by building a web site that showcases you. This is not difficult, but you need to be shown how, and that&#039;s what this course is all about.  </p>  <p style=\"\">  \t<strong style=\"\">People Just Like You Have Taken This Course and Landed Their Dream Jobs</strong>  </p>  <p style=\"\">  \t  One student wanted to be a journalist in Las Vegas. She used her web site to show what she could do, and she landed the job she was looking for:  </p>  <ul style=\"\">  \t<li style=\"\">&quot;I was able to put video on my web site, and that made all the difference. My resume wasn&#039;t able to do that. I am SO happy I found this course&quot; -- Flori </li>  </ul>  <strong style=\"\"></strong>  <p style=\"\">  \t    Another student used her web site to land modeling gigs. She uploaded photos of herself modeling. She later told me:  </p>  <ul style=\"\">  \t<li style=\"\">&quot;I used my site like a blog and would just post some of my gigs. The best images went into my portfolio. I landed a gig that paid me $1,000 to model clothes for one day. They found me on Google and went right to my site&quot; -- McKell</li>  </ul>  <p style=\"\">  \t<strong style=\"\">    This course works.  </strong>  </p>  <p style=\"\">  \t    Using a rich media experience, this course covers all of the tools necessary to go well beyond the standard resume by implementing a multimedia portfolio that showcases YOU. In just one month, you will have an internet-accessible portfolio that grabs the attention of those looking to pay you money for your skills.  </p>  <p style=\"\">  \t        Today&#039;s employers are media-savvy. They are looking for people on the internet. If you are not showcasing your talents on the internet, you are losing out on a prime opportunity to get a high-paying job.  </p>  <ul style=\"\">  \t<li style=\"\">In this course you will learn how to create a multimedia portfolio.</li>  \t<li style=\"\">Your portfolio will be available to anyone at anytime, day or night, so you are always able to show off to others.</li>  \t<li style=\"\">You will also learn how to produce a video that promotes yourself in the job market. A paper-based resume is only words on a page. Your video gives you the opportunity to SHOW who you are. Potential employers can watch you and get to know you as a human being as opposed to a piece of paper.</li>  </ul>  <p style=\"\">  \t        In the job market, it is all about setting yourself apart from others in a professional way. This course teaches you how to do just that. Your portfolio works on your behalf to give potential employers 24 hour access to you. Let your portfolio do the work for you.  </p>  <p style=\"\">  \t        This course outlines a process that human resource experts and researchers agree should be followed: develop a plan, outline your strengths, present yourself in multimedia, and start a blog on your personal web portfolio. By following the steps in this course, you will accomplish all of this and more.  </p>  <p style=\"\">  \t        The world is moving further and further into the digital world. Don&#039;t be left behind because you didn&#039;t keep up.  </p>", 
    "end_date": null, 
    "title": "Land Your Dream Job by Making a Portfolio Web Site", 
    "price": "20.00", 
    "instructors": "Dr. Dave Harris", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353276_a40d_3.jpg", 
    "course_url": "https://www.udemy.com/digital-portfolio/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T21:01:58Z"
}