{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Take control of the job recruitment process with this course!  </p>  <p>  \t  I want you to land fast the job that you really want. First impressions do count: you need a high quality, impactful CV or resume that tells the employer that you need to be seen and interviewed. This course will help you make all the difference and stand out from the crowd.  </p>  <p>  \t  I have a track record in helping individuals in many countries to create powerful CVs that have led to great job offers. From their feedback and my own experience I know exactly what works: forget the gimmicks or wasting time on cosmetic changes or formatting, I help you focus on what actually matters when your CV is in front of recruiters who have to make a decision about taking your CV to the next stage. I have been there as a recruiter.  </p>  <p>  \t  In this course I have bring all my experience to show you how to create a compelling and outstanding CV which puts you in the driving seat of the recruitment process.  </p>  <p>  \t  Using a combination of detailed commentary and audio visuals I will take you step by step through the process.  </p>  <p>  \t  The course is structured in such a way to help develop that inner confidence so that by end you will feel inspired and ready to take on a new challenge.  </p>  <p>  \t  You will find eight video lectures, a number of on screen capture lectures, PDF documents and a final checklist with your very own ready made plan.  </p>  <p>  \t  I have provided additional BONUS material that you will find invaluable through the recruitment process.  </p>  <p>  \t  So get ready to move forward, onwards and upwards.  </p>  <p>  \t  Please feel free to contact me if I can be of any help.  </p>", 
    "end_date": null, 
    "title": "Land a rewarding and satisfying job and get paid more!", 
    "price": "20.00", 
    "instructors": "Fayaz Shah", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337286_7d28_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-job-winning-resume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T06:46:26Z"
}