{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\t UPDATED 4/22/2015</p>  <p>\t The Bible offends many people today. There is a movement to remove it from public places and quiet our voices. If this is how you feel, this course is not for you. There are many secular options that will meet your personal development needs.</p>  <p>\t ************************************************************************************************</p>  <p>At the end of this course, students will:</p>  <ul>\t<li>Realize that the Bible is full of INFORMATION. What you need is REVELATION. While mentors and teachers are great, there is NONE better for a Christian, than the Holy Spirit.</li>\t<li>Recognize the Bible is a relevant, practical tool for business and leadership training.</li>\t<li>Compare/contrast popular secular ideas with what the Bible says on the same matter.</li>\t<li>Confidently go to the Bible as a first or inclusive resource for real life business and leadership questions, challenges and directions.</li>\t<li>Re-frame your relationship with Jesus from a compartment of your life, to the first place of every part of your life, especially your career or passion.</li>  </ul>  <p>\t I am no Theologian. <strong>I am just like you</strong> - a Christian seeking to grow in the faith. If I can embrace the Word of God seamlessly into my business, then it can be done. If it can be done, <strong>YOU can do it!</strong>  </p>  <p>\t Like everyone else, Christian leaders, and entrepreneurs consume personal and business development via popular Gurus, self-help books, and workshops.</p>  <p>\t<strong>NO GURU NEEDED! Psalms 16:7</strong> \"I bless <em>Adonai</em>, my counselor; at night my inmost being instructs me.\" (CJB)</p>  <p>\t<strong>Luke 6:40</strong> reminds us that a student can be like his teacher but not greater than the teacher. In other words, a teacher/coach/mentor can only carry us as far as they have gone. How is it that we, Christians, do not seek to learn from Jesus, the MASTER Teacher?</p>  <p>\t<strong>Psalms 119:99</strong> \"I have more understanding than all my teachers,because I meditate on your instruction.\" (CJB)</p>  <p>\t The recession/depression of 2006-2010 showed me, a multiple-certified expert in the financial space, that the secular way of doing money and finances was an inferior system, built on sand. That is why it crashed and took so many Christians with it - including me.</p>  <p>\t When I cried to the Lord, He reminded me that as bad as my situation seemed, it was still a merciful place as He graciously did not allow me to endure what I deserved; that my condition was in direct correlation to my actions and omissions.</p>  <p>\t<strong> Romans 13:8 </strong>says, \"Owe no man any debt but love.\" Well, I owed and owed, because the world taught leverage. For example; swiping that little card, and for a tiny bit per month, I could acquire assets beyond my current income. For little to zero down, many owned property they later lost to foreclosures.</p>  <p>\t The Lord patiently taught me over the next months directly from His Word, and as the insights came, I noted them and eventually published them in my book, <strong><em>The Bible on Business</em></strong>, and <strong><em>The Creditors Are Coming</em></strong>.</p>  <p>\t The Bible has tons of practical, relevant tips and strategies for leadership, money, investing, and much more. In addition to my books, this course is designed to help Christians come to the same conclusion - and seek first what God has to say on a matter, before, and even alongside human wisdom.</p>  <p>\t Students to this course are invited (not required) to connect with me in my G+ community for weekly prayer, encouragement and support. The focus of this community is PROFITABLE STEWARDSHIP. PROVING GOD IN 2015.</p>", 
    "end_date": null, 
    "title": "Leadership Secrets from the Bible. No Gurus Needed.", 
    "price": "20.00", 
    "instructors": "CEO Trudy Beerman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303854_ed69_4.jpg", 
    "course_url": "https://www.udemy.com/leadership-secrets-from-the-bible/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-19T19:08:43Z"
}