{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tYou will learn the individual requirements for qualifying to apply to get your <strong style=\"\">Professional CCBA® or CBAP® certification</strong> with a step-by-step application process overview.  </p>  <p style=\"\">  \tThe course provides you with <strong style=\"\">an easy to understand</strong>, <strong style=\"\">pictorial synopsis</strong> with a video explanation of <strong style=\"\">each BABOK® Knowledge Area</strong> to put the purpose and context of each topic into perspective. These video lessons are made up of <strong style=\"\">diagrammatic summaries</strong> of each BABOK® Chapter which highlights the most important parts of each Chapter.  </p>  <p style=\"\">  \tThis course also includes the<strong style=\"\"> CCBA® &amp; CBAP® preparation exam questions covering each chapter of the BABOK® Guide.</strong> This is the best way to prepare for your exam and to be confident that you have covered all of the BABOK® Guide v2.0!  </p>  <p style=\"\">  \tOnce you reviewed all the summary videos you will have a <strong style=\"\">Knowledge Quiz to complete for each Chapter </strong>to test your knowledge! There are Knowledge Quizzes for the following Chapters:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t·General Business Analysis  \t</p>  \t<p style=\"\">  \t\t·Business Analysis Planning &amp; Monitoring  \t</p>  \t<p style=\"\">  \t\t·Elicitation  \t</p>  \t<p style=\"\">  \t\t·Enterprise Analysis  \t</p>  \t<p style=\"\">  \t\t·Requirements Analysis  \t</p>  \t<p style=\"\">  \t\t·Solution Assessment &amp; Validation  \t</p>  \t<p style=\"\">  \t\t·Underlying Competencies  \t</p>  \t<p style=\"\">  \t\t·Techniques  \t</p>  </ul>  <p style=\"\">  \tIf you are interested in passing the CBAP® exam first time, you must do this course! It provides a fantastic overview of the BABOK® and prepares you in an interactive way which makes <strong style=\"\">learning fun and easy</strong>!  </p>  <p style=\"\">  \tThis course is the <strong style=\"\">best starting point</strong> for any Business Analyst that plans to get themselves ready to do the CCBA® or CBAP® certification. It will give you a very quick and thorough understanding of what is involved with learning the BABOK® Guide and it will instantly test your knowledge with similar questions to what you can expect in the real exam.  </p>  <p style=\"\">  \tThe course helps you to make the very detailed BABOK® Guide, which can be very daunting in itself, <strong style=\"\">very straightforward and clear</strong>. Once you finish the course you will have a very comprehensive and knowledgeable level of understanding of the BABOK® Guide and the types of exam questions to expect.  </p>", 
    "end_date": null, 
    "title": "Learn to become a Professional Business Analyst", 
    "price": "50.00", 
    "instructors": "A B", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266074_f63a_5.jpg", 
    "course_url": "https://www.udemy.com/cbap-exam/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T23:19:23Z"
}