{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    Large concerts, major sporting events and music festivals each need hundreds of security guards to run smoothly and successfully. A large number of those guards get hired on a one-off or temporary basis. Most don’t get the chance to develop the event-specific skills and knowledge necessary to really excel in the field. This course aims to fill that knowledge gap by providing a comprehensive introduction to event security.  </p>  <p style=\"\">  \t<strong style=\"\">Learn the Fundamental Skills of Professional Event Security</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Recognize and Locate the Key Features of an Event Space</li>  \t<li style=\"\">Learn the Jargon Used By Event Staff and Security</li>  \t<li style=\"\">Find Prohibited Items By Doing Pat Downs and Bag Searches</li>  \t<li style=\"\">Control Access by Checking Identification and Credentials</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Stand Out From the Crowd</strong>  </p>  <p style=\"\">  \t  Once you know where to look, finding security work at events is relatively easy. With the knowledge and skills in this course, you will not only find work - you will be in demand.  </p>  <p>  \t  Professional event security guards who know the jobs and have good customer service skills always get the best jobs. They get regular work at big concerts, major sporting events, music festivals, even at corporate events.  </p>  <p>  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p>  \t  This course is designed for anyone interested in event security, regardless of how much prior security experience you have. It includes 28 lectures and 5 quizzes, over 90 minutes of content as well as exercises for you to practice on your own.  </p>  <p>  \t  You will learn what steps to take to become an Event Security Professional, including how to find work. You will know how to prepare for work and what to do when you get there. You&#039;ll learn how to perform the main duties of an Event Security Professional, including ID checks, bag searches, pat downs, access control, pit work and roaming. We&#039;ll discuss in concrete terms issues such as professionalism, customer service and how to use a two-way radio.  </p>  <p>  \t  By the end of this course you&#039;ll have more knowledge your first day on the job than many security guards gain in months of event work. You&#039;ll be confident and ready to tackle any task handed to you.  </p>  <p>  \t  If you follow the advice in this course, you&#039;ll advance through the ranks, making a name for yourself in an exciting and ever changing industry.  </p>", 
    "end_date": null, 
    "title": "Learn What It Takes to Be a Real Event Security Professional", 
    "price": "40.00", 
    "instructors": "John Bowman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351476_e63f_3.jpg", 
    "course_url": "https://www.udemy.com/eventsecurityfundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T01:53:09Z"
}