{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>I help people's voices be heard. </strong>We all want to be heard and  this course helps you unleash your unique voice so that your voice can be heard loud and clear in Commercials, Animation and beyond.<strong class=\"redactor-inline-converted\">This course is designed for anyone looking to take their Voice-Over career and reads to the next level.</strong> <em>Has any one ever told you 'You should do Voice-Over?'</em>. So many people have been told this and mistakingly think that a nice voice is all you need to work, but  '<em>HUGE</em> spoiler alert' it is NOT. <strong class=\"redactor-inline-converted\">You need to have a solid, easy-to-use, 'go-to' structure of techniques that you can use over and over again so that your reads pop every time, and I will show you how to do this. </strong>I don't waste half of the course talking about microphones and which gear to buy. Why not? Because a.) that is the easiest part of all of this(***read a little further down in a sec) and b.) even if you have the most expensive gear, if your reads suck <em>you won't book it anyway. </em>c.) you can learn about mic placement and editing in your manuals or on youtube for<em> FREE</em>. The truth is that you don't need the best, most expensive and amazing gear to book V.O. work, but you DO need reads that pop, and that is why I created this course.</p>\n\n<p>Sometimes all you need is an iPhone or smartphone to practice and/or book a job, and I show you how to turn bland and noisy phone recordings into recordings that are punchy and awesome. Another thing that Voice-Over 101 Plus has that no other course has, is the \"Performance Trainer\", a practice tool that makes you stronger and stronger every time that you use it, and you can use it through your smartphone and/or tablet so you can practice anytime and practically anywhere with it! </p>\n\n\n\n\n\n<p>My goal is to de-mystify how to get great Commercial and Animation/Video Game voice-over reads and to make it fun for you at the same time. That is what Voice-Over 101 Plus is what it's all about. Plus, there is a risk-free 30-day money-back guarantee, so you have nothing to lose and everything to gain. It's time to unleash your inner Voice-Over power right now, so try Voice-Over 101 Plus today!<br></p>\n\n\n\n\n\n<p>-Mickey</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>P.S. - I am going to be adding more content to the course with time, so those things will automatically be included in your course as well. If there are any topics you want covered that can help you,I want you to let me know.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>P.S.S. - I want to make sure everyone who is a member of this community feels like they have support so I will be answering questions and being active with making sure you get the most out of the course. If anytime you have questions, I will be making time to answer them. Let's do this! :)</p>", 
    "end_date": null, 
    "title": "Learn top voice-over techniques for commercials and games.", 
    "price": "35.00", 
    "instructors": "Mickey Caputo", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672578_5783_17.jpg", 
    "course_url": "https://www.udemy.com/voiceover101plus/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-17T19:45:28Z"
}