{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Humor is one of those subjects that has a ton of books written about it, by a bunch of people who know very little about how it actually works.</p><p>Even the funniest people often tend to not really know how they do it.</p><p>But this shouldn&#039;t come as a surprise. </p><p>Just because you can speak English, for example, doesn&#039;t mean you know how the systems of the English language work. Most people live their whole lives never knowing or caring what a conjunction or preposition is.</p><p>Well,<strong style=\"\"> I&#039;ve decided to do something I don&#039;t usually do...I&#039;m going to give away the big secret of this course right here in the description.</strong></p><p>Why? </p><p>Because I know if you&#039;ve tried to find a good treatment on humor before you&#039;ve gone through too many books or courses that wasted your time and I wouldn&#039;t blame you if you had given up.</p><p><strong style=\"\">Here&#039;s how humor works:</strong></p><p>Humor is about learning. That&#039;s how I cracked the code. It&#039;s a reward system evolved to get humans to learn faster.</p><p>It&#039;s kind of like an antivirus system for your brain. Except it&#039;s not just in your brain, it&#039;s running on the whole group of proto-humans who are laughing at the guy who just slipped on the mud patch and fell on his you know what.</p><p>That&#039;s how humor started. And it&#039;s come a long way.</p><p>Let&#039;s say you&#039;re in the office, and you&#039;re bored. You&#039;re looking for an opportunity to make a joke. </p><p><strong style=\"\">Here&#039;s the 3 step process I teach in the course:</strong></p><p>1. Figure out the <strong style=\"\">roles of the various people in the room</strong>. Boss/employee. Co-worker/Co-worker. Friend/Frenemy/Enemy. Nerd/Shy One/Loud One/Smelly One. Etc.</p><p>2. Figure out, based on the roles you&#039;ve determined each person in the room is playing (there can be multiple), what, if any, <strong style=\"\">mistakes</strong> that person is making, or has made in the past, or is about to make in the future. (This is the learning part, of why humor evolved).</p><p>3. Figure out how to <strong style=\"\">tell the group</strong> about the mistake that person is making (and remember, it can be your mistake, aka self deprecating humor). Ideally in a <strong style=\"\">novel, unique, or unexpected way,</strong> but this isn&#039;t always necessary. You can also do it non verbally with body language, a prop, something written, a cartoon, etc.</p><p>The funniness of the joke depends on how well you combine these 3 elements. </p><p>So there you have it. </p><p>You might be thinking, OK, then why should I take the course?</p><p>Because you don&#039;t yet have a clear understanding of the kinds of roles that exist, the kinds of mistakes that exist, and the kinds of delivery methods that exist. Until you understand these sub systems, you aren&#039;t going to learn humor that much faster. You&#039;ll starting seeing new patterns, yes, but why spend months or years trying to find the patterns that I&#039;ve already prepared for you inside the course? </p><p>I&#039;ve made some of the videos free preview so you can get a better look of what&#039;s inside. </p><p>One more thing before I go...There is a cool side benefit to having this skills, and this system built into your head, which is that you will be able to deconstruct the humor of your favorite comedians, TV Shows, and just funny people you know and actually understand what is going on. </p><p>I also want to give a silent shout out to one of my mentors who encouraged me to create this course. It took many years to figure out this system and I would have never pursued it if it weren&#039;t for his encouragement. You know who you are. Thank you.</p><p>Also, I probably don&#039;t have to tell you how important having a good sense of humor is. Whether you are at work, at home, dating, teaching, networking, meeting new people, public speaking, etc. But I will tell you one story, about the mentor I met, above, which was a direct result of having a good sense of humor. </p><p>I was at a conference, joking around with a guy running a booth, and made a joke about me being a lefty and that he would never hire me because I was a lefty. Long story short, I ended up getting invited out to dinner, drinks and cigars at prices that made my eyes big, (because at the time I was couch surfing to attend this conference), and talking over my business ideas with a handful of millionaire entrepreneurs. At the end of the night I mentioned this course idea offhand, and out of all the things I talked about it was the one this mentor of mine picked out to encourage me on. </p><p>That&#039;s how things happen sometimes. And if you put this course to work for you, I wouldn&#039;t be surprised if more things start happening for you.</p><p>See you in the course,</p><p>Timothy</p><p>PS</p><p>As a side bonus, for any of you reading this who are accelerated learners, you&#039;ll get the added bonus of being able to make use of much of your general purpose, everyday learning for improving your sense of humor (at the same time, while you sleep, etc) once you understand this system. Why? Because the more you learn, the more you understand mistakes, and the more you understand mistakes and can quickly identify them when in a group, the better you will be able to spontaneously generate humor.</p>", 
    "end_date": null, 
    "title": "Learn Humor Through Systems (No Joke)", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259856_e949_4.jpg", 
    "course_url": "https://www.udemy.com/learn-humor/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-11T20:04:46Z"
}