{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>v2.1 Released on</em><em> August 20, 2015</em></strong>  </p>  <p>  \t<strong>Create More Opportunities and </strong><strong>Present Yourself Powerfully on LinkedIn速</strong>  </p>  <p>  \t              300,000,000+ professionals are active on LinkedIn速--the network is quickly becoming an essential part of every modern professional's career presence. On the other side of Eazl's course on advanced LinkedIn速 profile building, you'll have a profile that <em>increases your visibility</em>, that helps you <em>get found</em> for big opportunities, and that makes you someone that other people want to have in their professional networks. You will quickly be able to:  </p>  <ul>  \t<li>Bring relevant, valuable connections into your professional ecosystem</li>  \t<li><strong>Establish yourself as best in class talent </strong>in your professional arena</li>  \t<li>Differentiate yourself or your organization from competitors</li>  \t<li>Convert online connections to real world relationships</li>  </ul>  <p>  \t                               Eazl's team of recruiters, digital producers, and support staff in San Francisco has leveraged cutting edge research from Harvard, Purdue, Duke, the Gates Foundation, and McKinsey to create a comprehensive suite of resources that you can access for free by enrolling in the course. They include:  </p>  <ul>  \t<li>20+ HD Videos and Step-by-step Tutorials</li>  \t<li>15 Exclusive Guides and Sample Summaries (in downloadable .pdf format)</li>  \t<li>...and more</li>  </ul>  <p>  \t<strong>Get Access to Eazl's Signature Customer Support Team</strong>  </p>  <p>  \t                            During your experience with the course, you'll also have access to Eazl's signature customer support team. We promise that all support inquiries made via email or in the discussions board will be answered within 48 hours.  </p>", 
    "end_date": null, 
    "title": "Learn to Craft and Build Your Personal Brand on LinkedIn速", 
    "price": "25.00", 
    "instructors": "Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287862_1e48_9.jpg", 
    "course_url": "https://www.udemy.com/pointreyesstation/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T01:20:30Z"
}