{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t*****Updated November 2015*****<strong></strong></p><p><strong>Financial Analyst ranks as one of the 100 Best Jobs for 2015 on U.S. News and World Reports Rankings.</strong>  </p>  <p>  \t<em>With a median starting salary of $55K a year and projected job growth of 16% per year this is one of the most in demand and rewarding careers you can have.</em>  </p>  <p>  \tThis course's primary objective is to train you to be a financial analyst for a major corporation.  </p>  <ul>  \t<li>This course is for anyone who just graduated from college or has some work experience and would like to change careers, I have designed the course to give you confidence to get into a rewarding and exciting career.</li>  \t<li>Think of this course as on the job training for a financial analyst.  I will teach you the key terminology, essential job duties and how to perform them, as well as the best way to go about your job search.</li>  \t<li>The course is structured around the monthly, quarterly and annual job duties you will perform including variance analysis, forecasting, budgeting, annual business plan processes and more!</li>  \t<li>Course Materials provided include: PDF training manual, glossary of terms, multiple excel templates, free excel training resources, resume tips and even a sample financial analyst resume.  These materials are designed for you to be able to use as a resource on your new job!</li>  \t<li>This course is NOT geared towards analysis for investing but rather corporate finance.</li>  </ul>", 
    "end_date": null, 
    "title": "Learn to be a Financial Analyst", 
    "price": "20.00", 
    "instructors": "Adriane Hernandez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378032_d937.jpg", 
    "course_url": "https://www.udemy.com/learn-to-be-a-financial-analyst/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-26T15:16:31Z"
}