{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4>The Business of Medicine</h4>  <p>  \t  The Business of Medicine covers essential skills to your success as a physician after completing your medical education.   Medical billing, medical coding, the medical practice revenue cycle, physician contracts, and other topics will be presented in a way you can apply to your practice today.  </p>  <h4>Key post-residency skills covered in the Business of Medicine:</h4>  <p>  \t<strong style=\"\">Physician revenue generation</strong> – Medical billing, medical coding, and the medical practice revenue cycle. Physician Income - This section discusses how physicians are paid in today’s healthcare environment. Compensation models, RVUs (Relative Value Units), and other aspects of physician compensation are covered in detail.  </p>  <p>  \t<strong style=\"\">Medical documentation</strong> – This section covers how medical encounters should be documented so that they comply with the strict guidelines outlined by Medicare and how improved documentation is related to increased compensation and quality.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Hospital documentation</strong> to improve DRG coding in terms of CCs (comorbid or complicating conditions) and MCCs (major comorbid or complicating conditions) is discussed. Improving documentation of CCs and MCCs is a major effort underway in hospitals throughout the United States because of how this documentation can influence hospital payments from Medicare and other insurers.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Measuring physician quality</strong> – This section discusses a few of the ways physician quality is measured like HCAPHS, PQRS, and VBP. The relationship to measured quality and physician compensation is discussed as well.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Physician contracts</strong> – This section covers the basics of physician contracting and a few areas for special attention – non-compete agreements, compensation, and signing bonuses.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Who is this course designed for?</strong>  </p>  <p>  \t  This course is designed for medical students, residents, fellows, and attending physicians. This is a great course for attending physicians who are trying to maximize their productivity and value to a healthcare system.  However, anyone who wishes to learn about how a medical practice functions might enjoy the course.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">What do I need to know to get the most out of this course? </strong>  </p>  <p>  \t  A good knowledge of medical terminology and medical records will be helpful. Most 3rd or 4th year medical students will be well prepared for this course.  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Conflict of interest and disclosures.</strong>  </p>  <p>  \t  The instructor of this course denies any conflict of interest or disclosures with the content material in this course.  </p>", 
    "end_date": null, 
    "title": "Learning the business side of medicine", 
    "price": 0, 
    "instructors": "R Robinson, MD", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253318_b8a5_3.jpg", 
    "course_url": "https://www.udemy.com/business-of-medicine/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-30T17:25:06Z"
}