{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>I've coached over 500 successful students to better jobs - will you be the next?</em></p>\n\n<p><em>LATEST UPDATE: June 2016</em></p>\n\n<p><em>++++++++++++++++++++</em></p>\n\n<p>FINALLY, a <strong>proven system</strong> that shows you exactly how to transform your resume from ordinary to remarkable <strong>in just a few hours.</strong></p>\n\n<p>Join over 500 successful students who've mastered the 3 steps to turn their resume into an interview magnet. </p>\n\n<p>My name is Bain Metcalf. As a headhunter/recruiter, I've worked with <strong>thousands of candidates</strong> hunting for their next job, and I've also worked with <strong>hundreds of hiring managers</strong> for companies of all sizes and industries. </p>\n\n<p>That means I know the insider secrets to landing a great job. I know the <strong>mistakes you don't realize you're making</strong>, and the triggers you need to pull to<strong> land an interview anywhere.</strong> </p>\n\n<p>It IS possible to completely skip the online application black hole and land your dream job. Discover my insider secrets that have helped my students <strong>land jobs at Google, Facebook, Exxon, Goldman Sachs, and 100's more companies:</strong></p>\n\n<p>-Even if you don't have much experience</p>\n\n<p>-Even if you have 'gaps' in your resume</p>\n\n<p>-Even if you're trying to change industries</p>\n\n<p>-Even if you think you don't have many accomplishments worth mentioning</p>\n\n<p><strong>Check out the video testimonials at the beginning of my course to hear recorded proof from successful students.</strong></p>\n\n<p>For most of us, a resume is our <strong>one and only gateway</strong> to a dream job! Yet many job seekers rarely invest much time beyond writing the first draft and blasting it to 25 or more job applications. </p>\n\n<p>Then, the worst part happens...<em>they hear nothing back</em>. </p>\n\n<p>I've made these mistakes myself, and the feeling of silent rejection is horrible. My experience as a headhunter taught me that all of that \"expert advice\" is misleading at best and horrible at worst. In fact, many of these career \"experts\" have no idea how the game is even played anymore!</p>\n\n<p>That's why I created this course. </p>\n\n<p><strong>Inside, you'll learn:</strong></p>\n\n<p>1. The only 2 problems you're actually having with your resume</p>\n\n<p>2. The proven 3-step formula for writing a killer resume that lands interviews time and time again</p>\n\n<p>3. The way companies actually filter and choose resumes to interview</p>\n\n<p>4. 3 Proven, step-by-step methods for getting your resume in the hands of a hiring manager that never involve applying online</p>\n\n<p>And here's the best part.<strong> If for any reason you feel like my course hasn't done exactly what I've promised, you can return it within 30 days for a FULL refund.</strong> No questions asked, and no hassle. That's right - I've removed all of the risk for you so you can focus on investing in yourself without worrying about if my system lives up to the hype. </p>\n\n<p>So what are you waiting for? Let's get started right away! </p>", 
    "end_date": null, 
    "title": "Learn How to Get Your Resume Selected for an Interview", 
    "price": "20.00", 
    "instructors": "Collin Bain Metcalf", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779050_7bf3_3.jpg", 
    "course_url": "https://www.udemy.com/get-more-job-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-01T15:58:09Z"
}