{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t            This course is designed to help recent college graduates and other job seekers learn the skills to land a professional track position. The course is based on three books written by career guru Donald Asher, these books include,<em> Cracking the Hidden Job Market</em>, <em>How to Get Any Job</em>, and the <em>Overnight Resume</em>. The course is structured in 9 easy to follow sections or modules that contain lectures, quizzes and supplemental material.  </p>  <p>  \t      Students will learn:  </p>  <ul>  \t<li>How your major relates to your career options.</li>  \t<li>How to target a job.</li>  \t<li>Why you should pursue only a couple of career ideas at a time.</li>  \t<li>How to prepare the documents needed for an effective job search</li>  \t<li>Why you will need several versions of your resume.</li>  \t<li>What a C.V. is and how it differs from a resume.</li>  \t<li>Why posted job openings are not a very fruitful source of jobs.</li>  \t<li>How to identify the hidden job market.</li>  \t<li>The five types of interviews and how to prepare.</li>  \t<li>How to plan for your interview day.</li>  \t<li>How to practice telling stories using the PAARLA technique.</li>  \t<li>How to effectively negotiate your salary.</li>  \t<li>How to position yourself for your first promotion.</li>  </ul>", 
    "end_date": null, 
    "title": "LifeLaunch! Get a Job. Get a Life.", 
    "price": "20.00", 
    "instructors": "Donald Asher", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301546_c046_6.jpg", 
    "course_url": "https://www.udemy.com/lifelaunch-get-a-job-get-a-life/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T20:08:46Z"
}