{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course presents a practical  and easy-to-learn process <strong>life success formula</strong>. It teaches you how  to know yourself and your world, then to use what you discover to be able to decide how to move through life - you learn how to find your fit in work and life. Most of us lack the clarity to know how to make great decisions about how to move through life - what is for us and what isn't for us. This course will teach you a life process so that you always have the right information to make good work and life decisions - at any age, at any time. This course teaches you the steps to know how to build your life around what you do best.</p><strong><em>This course never looks to tell you who or what you should be. Instead, it teaches a process to help you discover it for yourself.</em> </strong>You become clear about who you are and how to connect what is best in you (your talents, strengths, passions and interests) to today's world to <em>find your fit</em>. <p>This course is taught around the country in high schools, colleges, workplaces, with retirees and for people in work and life transition.<span></span></p><p>This process is delivered through the <strong>Life Possibilities Manual</strong> and <strong>the course lectures/videos</strong>. The lectures support the 6 course sections:</p><ol><li><strong>Orientation </strong>– this section helps you understand the full Life Possibilities Process, its steps, forms and activities. You will be introduced to the Life Possibilities Manual.</li> <li><strong>Perception – Know Yourself</strong> - this module introduces how to know yourself through 6 instructor-facilitated activities (gather information. You will be guided how to complete the activities, then allowed to complete them on your own. What you learn from the activities will be recorded in your Life Possibilities Manual.</li><li><strong>Perception - Know Your World </strong>- this module introduces how to expand what you know of your world through 2 instructor-facilitated activities (gather information). You will be guided how to complete the activities, then allowed to complete them on your own. What you learn from the activities will be recorded in your Life Possibilities Manual.</li><li><strong>Creating Possibilities</strong> – This section introduces a new way to build and edit meaningful possibilities to ensure you always know how to move through work and life. You will be guided through the possibilities creation process then given time to build and edit your own possibilities.</li><li><strong>Building a Performance Plan</strong> – This section introduces a 6-step performance plan to help you build a successful way to implement the possibilities you choose from the Possibilities section. You will be guided in how to complete a performance plan then given time to create your own plan for your selected possibilities.</li><li><strong>BONUS - Building a Personal Branding Statement</strong> - this section offers a bonus lecture on how to use the information gathered in section 2 - Know Yourself - to create a personal branding statement, branding slogan and branding identity. This is critical to know in today's world as it helps you clearly, professionally and efficiently share your greatest abilities in work, college or networking environments.</li></ol><p>The course resources include:</p><ol><li>The Life Possibilities Manual (PDF)</li><li><span></span>6 sections with 20 lectures including 1 bonus lecture</li><li><span></span>Recommended read:  <em>The Greatness Zone - Know Yourself, Find Your Fit, Transform Your World</em> by Jay Forte</li></ol>", 
    "end_date": null, 
    "title": "Life Possibilities - Finding Your Road In Life", 
    "price": "45.00", 
    "instructors": "Jay Forte", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461574_4fc1_2.jpg", 
    "course_url": "https://www.udemy.com/life-possibilities-finding-your-road-in-life/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-28T19:08:11Z"
}