{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">GET NEW COURSE</strong><strong> INTRO OFFER TODAY BECAUSE PRICE WILL INCREASE!  </strong>Want to start a new career as a Certified Life Coach complete with a verifiable certificate of completion but you don’t have thousands to spend? Maybe you want to learn unique life coaching skills to help you earn more money in your current career? Or are you currently a Life Coach and you are not making enough money? Become a Certified Life Coach by Wealth Coach Academy! Join Part 8 of the Life Coach Career Development Training Program.  Keep reading for full details.</p>\n\n<p>******************************************************************************************************************</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Life Coach Certification 8: Part Eight Life Coach Training Course</strong> <strong class=\"redactor-inline-converted\">is for you if:</strong></p>\n\n\n\n<ul><li>You want to learn the skills that it takes to <strong class=\"redactor-inline-converted\">start a career as a Life Coach</strong> but you don't want to spend thousands to <strong class=\"redactor-inline-converted\">become a Certified Life Coach</strong>.</li><li>You want high quality step-by-step <strong class=\"redactor-inline-converted\">life coach training</strong> you won’t find anywhere else that sets you apart so a <strong class=\"redactor-inline-converted\">down-turn in the economy won’t affect your income.</strong></li><li>You want to learn the exact life coaching process that helps clients get results so you <strong class=\"redactor-inline-converted\">don’t have to waste time and money</strong> trying to develop it yourself.</li><li>You want to start a <strong class=\"redactor-inline-converted\">business as a Life Coach</strong> and are looking for a simple plan so you can start making money right away.</li></ul>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why take Life Coach Certification 8: Part Eight Life Coach Training Course?</strong></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Today you will have less doubt about what it takes </strong>to become a Life Coach who helps clients achieve results and therefore earns a great income.</li><li><strong class=\"redactor-inline-converted\">Tomorrow you will feel more confident </strong>as you discover the insider secrets to coaching the <strong class=\"redactor-inline-converted\">top 6 profiles that spend money on Life Coaching</strong>.</li><li><strong class=\"redactor-inline-converted\">Next week things start to happen</strong> because you have a plan in the right order that guides you step-by-step.</li><li><strong class=\"redactor-inline-converted\">PLEASE NOTE:</strong> You only become a Certified Life Coach and receive the certificate of completion when you take this course on Udemy and complete 100% of the course.</li></ul>\n\n\n\n<p>******************************************************************************************************************</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is covered in Life Coach Certification 8: Part Eight Life Coach Training Course?</strong></p>\n\n\n\n<ol><li>Walk away with 10 key points that set you up for success and the inspiration to move you past any blocks that stop you on your Life Coaching journey.</li><li>Imagine being able to anticipate your client's needs! You learn cutting-edge theory that, among other applications, allows you to read the minds of your clients just by their actions and the words they speak.</li><li>Health and wellness problems and the related issues get in the way of people being their best on the job, in their careers or business which impact their ability to earn money. <strong class=\"redactor-inline-converted\">These people spend money on coaching to help them solve health problems!</strong> Using case studies and examples, you learn the Wealthy Life Coaching Model and Process for helping these clients move past blocks.</li><li>Financial problems and the related issues get in the way of people being their best on the job, in their careers or business which impact their ability to earn money. <strong class=\"redactor-inline-converted\">These people spend money on coaching to help them solve financial problems!</strong> Using case studies and examples, you learn the Wealthy Life Coaching Model and Process for helping these clients.</li><li>When people are not successful on the job or in their careers this impacts their ability to get a raise, a promotion or keep their job. <strong class=\"redactor-inline-converted\">These people spend money on coaching to help them solve career related problems!</strong> Using case studies and examples, you learn the Wealthy Life Coaching Model and Process for helping these clients.</li><li>When clients don’t implement what they learned in coaching, they are less likely to achieve their goals. They will blame it on you and quit your coaching program. <strong class=\"redactor-inline-converted\">Learn the Wealth Coach Academy Self-Reflection Formula 8 for getting your clients to achieve greater success which means better testimonials and more referrals.</strong></li><li>Relationship problems and the related issues get in the way of people being their best on the job, in their careers or business which impact their ability to earn money. <strong class=\"redactor-inline-converted\">These people spend money on coaching to help them solve relationship problems!</strong> Using case studies and examples, you learn the Wealthy Life Coaching Model and Process for helping these clients.</li><li><strong class=\"redactor-inline-converted\">Executives spend money on Coaching!</strong> Using case studies and examples, you become skilled, proficient and confident using the Wealthy Life Coaching Model and Process for helping executives move past the issues that are stopping them from achieving their success goals. <strong class=\"redactor-inline-converted\">Don't miss out on this lucrative area of life coaching!</strong></li><li>People who start businesses want to be successful but more often than not, they meet with many obstacles. <strong class=\"redactor-inline-converted\">These people spend money on coaching to help them move past these blocks!</strong> Using case studies and examples, you learn the Wealthy Life Coaching Model and Process for helping clients be successful in business.</li><li>Walk away with the exact steps you need to know to build your coaching career or business the right way!</li></ol>\n\n\n\n<p>Remember, once a member of the course, this living-breathing course that will continually be added to at no additional cost to you!</p>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">How will Life Coach Certification 8: Part Eight Life Coach Training Course Benefit You?</strong></p>\n\n\n\n<ul><li>I know you are busy and I have meticulously created this course with your success in mind. In this<strong class=\"redactor-inline-converted\"> Eighth Life Coach Training course, you learn the L in the</strong> <strong class=\"redactor-inline-converted\">GET RESULTS Life Coach Certification Program</strong>. </li><li>This is no-fluff essential information you need to succeed as a Life Coach; easily and quickly without spending thousands.  You save both time and money! </li><li>Let me show you exactly how to succeed by giving you a <strong class=\"redactor-inline-converted\">life coaching process like no other;</strong> the Wealthy Life Coaching Model.</li><li>You get <strong class=\"redactor-inline-converted\">case studies, insights and step-by-step instruction</strong> that show you how to succeed and help people move past limitations.</li><li>You get the inside track on what you need to do, the <strong class=\"redactor-inline-converted\">exact coaching tools and techniques to apply</strong> plus the exact plan to make it happen in the right order.</li><li>If that's something you would like to achieve, you have selected the right course to begin with. I say begin because once you <strong class=\"redactor-inline-converted\">start learning the GET RESULTS program</strong> you will want to take the entire series.</li><li>If you complete this entire course and implement everything you learn you will have a good solid foundation to build upon; whether you take the other courses or not.</li><li>Remember, <strong class=\"redactor-inline-converted\">it doesn't matter what stage you are at,</strong> I can show you how to make success as a Life Coach happen.</li></ul>\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">When Can You Take Life Coach Certification 8: Part Eight Life Coach Training Course?</strong></p>\n\n\n\n<p>What are you waiting for? <strong class=\"redactor-inline-converted\">Whether this is a new career for you, an addition to your current career or if you are currently a Life Coach, if you’re looking for a Life Coach Certification course that shows you how to become a life coach who is not affected by down-turns in the economy,</strong> then look no further.</p>\n\n\n\n<p>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</p>\n\n\n\n<p>Once a member of the course, you receive lecture updates, my consulting advice and coaching guidance for life; <strong class=\"redactor-inline-converted\">NO COST TO YOU</strong>.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">REMEMBER</strong>: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</p>\n\n\n\n<p>Click on the <strong class=\"redactor-inline-converted\">\"Take This Course\"</strong> button and start learning instantly</p>\n\n\n\n<p>*************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "Life Coach Certification8: Part 8 Life Coach Training (New)", 
    "price": "25.00", 
    "instructors": "Wealth Coach Academy, Louise Anne Maurice", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/767006_b4b8_2.jpg", 
    "course_url": "https://www.udemy.com/life-coach-certification-8-part-eight-life-coach-training/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T21:55:04Z"
}