{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Why LinkedIn?</p><p><strong>You Need LinkedIn To Have A Successful Career!</strong></p><p>With over 380+ million members, a higher return-on-investment than any other social media platform for lead generation; a tool that 94% of recruiters use. EVERYBODY needs to be on LinkedIn.</p><p>If you are a newcomer to the Platform or feel that you haven't been utilising it as you should then this course will change ALL of that for you.</p><p>What You Will Gain as a Result:</p><p>Work with me for 3 weeks going through this course with just ONE lecture per day and you will get....</p><ul><li>A LinkedIn profile that will make people turn their heads online when they look you up</li><li>An <strong>All Star Linkedin profile</strong> that will make a huge impact amongst your network</li><li>A way to set up your profile so that today and in 1 year LinkedIn will STILL be working wonders for you</li><li>Job Offers, Interview requests and/or people interested in learning more about you and YOUR service</li></ul><p>Contents and Overview:</p><p>20 Videos alongside downloadable MP3's covering all the necessary steps that will take you through the 'BASICS' of profile set up...that really aren't that basic at all. As well as all the GOODIES I'll keep updating the course with each month!</p><p>We will discuss the importance of PARTICULAR kinds of:</p><ul><li>A Kick-Ass Profile Picture</li><li>Keyword Headlines</li><li>Optimised summary's</li><li>Adding important links</li><li>How to 'weight' your work experience</li></ul><p>And much more</p><p>You see I was a beginner myself up till 3.5 months ago! I had a profile for years and did nothing with it AT ALL.</p><p>My results in 3.5 months:</p><ul><li>From 500 to almost 4,000 connection on LinkedIn</li><li>Approached by the military for careers advice - 20,000+ troops I have access to</li></ul><p>Asked to be a TedX speaker</p><ul><li>Won £1,000+ worth of work from ONE client</li><li>Contacted by the UK\"s Fastest Growing Recruitment Startup - 40,000+ graduates</li></ul><p>Imagine what is possible for you :)</p><p>There is a SPECIFIC way I'll share with you that I've used to set up my Profile to ensure that when people view my profile; they NEVER forget. I'd love to share these same strategies with you in this course.</p><p>In the space of just 21 days with 1 lecture per day you'll go from an 'inactive or non-existent' LinkedIn to a slick looking profile that will become your online point of reference that will literally transform your career prospects no matter the field you are in!</p><p><strong>Enroll now</strong> and see how i can help you <strong>utilize linkedin to build a successful career</strong> by applying the strategies i teach in this course.</p><p>P.S: One more thing, Your <strong>ability to take action</strong> is <strong>crucial</strong> to <strong>your success</strong>. By taking this course and putting into practice what i teach, you will open the door to opportunities that will change your life!</p><p>To your success!</p><p>Deepak</p>", 
    "end_date": null, 
    "title": "Linkedin Success System: Boost Your Career With Linkedin!", 
    "price": "45.00", 
    "instructors": "Deepak Shukla", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426756_ae8c_5.jpg", 
    "course_url": "https://www.udemy.com/linkedin-uncovered/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T12:07:59Z"
}