{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you looking for a way to demonstrate your work as an online marketer?</p>  <p>As an online marketer or online business owner, you may be looking for new ways to market your business. Many social media sites have been used like Facebook and Twitter for this reason. One site you may have overlooked is Linkedin. Linkedin is the largest social network for business. And after all you do you run a business. </p>  <p>You may think to yourself Linkedin? That is the site where all those corporate types hang out. It is where job seekers go to try and find the next step in their career. It is for those suit and tie wearing corporate types to interact.</p>  <p>But there are advantages to using Linkedin. It is a personal branding machine. It is also the premier site for business to business (B2) activity. It can help you and your business. Many people in online business may miss the benefit of Linkedin. They may work from home making the arduous commute of twenty feet from the kitchen to their work area. But Linkedin can still be an awesome tool and it all starts with a great Linkedin profile.</p>  <p>Section one of the course discusses the importance of identifying the area of work you do.</p>  <p>Section two gets into the importance of online reputation and connecting with business on the internet.</p>  <p>Section three goes over the different  fields of the Linkedin profile and how to complete them.</p>  <p>Section four of the course delves into important aspects of Linkedin you should be aware of as a marketer. </p>  <p>With over 400 million users on the site, Linkedin has the potential to help elevate your business. This course shows you the first step with the Linkedin profile.  </p>", 
    "end_date": null, 
    "title": "Linkedin Profiles For Online Marketers", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754206_70eb.jpg", 
    "course_url": "https://www.udemy.com/linkedin-profiles-for-online-marketers/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T09:51:05Z"
}