{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t          Atualmente, entre promoções, mudanças de funções dentro da mesma empresa e mudanças de emprego e de carreira, uma pessoa pode esperar ter 20 a 30 empregos ao longo da sua vida. Assim o defende o pai da flexigurança, Paul Rasmussen.  </p>  <p style=\"\">  \t          A forma tradicional de procurar emprego não basta para vingar no competitivo mercado de trabalho!  </p>  <p style=\"\">  \t          É tempo de usar todas as ferramentas ao seu alcance para construir a sua marca pessoal e tornar-se o profissional a contratar.  </p>  <p style=\"\">  \t          É tempo de explorar o LinkedIn ao seu máximo! Se não pensa assim ainda, veja as últimas estatísticas do LinkedIn:  </p>  <ul style=\"\">  \t<li>+ de 313 milhões de pessoas usam a rede</li>  \t<li>A cada segundo, a rede tem mais 2 membros</li>  \t<li>É utilizado em 200 países</li>  \t<li>40% dos utilizadores do linkedIn acompanham diariamente a atividade</li>  \t<li>Se incluir uma foto no seu perfil, terá 7 vezes mais visualizações</li>  \t<li>45% dos utilizadores aumentou o networking face a face</li>  \t<li>36,2% dos utilizadores descobriu novas oportunidades de trabalho com o LinkedIn</li>  </ul>  <p style=\"\">  \t          Quase todas as empresas usam o LinkedIn no recrutamento: para recrutar ou para pesquisar o candidato. Os frutos que o LinkedIn permite colher para a sua carreira constroem-se progressivamente.  </p>  <p>  \t        É importante que perceba que, estando presente no Linkedin é um candidato passivo, mesmo que esteja a trabalhar! Uma oportunidade irresistível pode surgir na sua caixa de mensagens a qualquer momento, se souber trabalhar a sua presença, visibilidade e notoriedade.  </p>  <p style=\"\">  \t          É, então, tempo de elevar as suas possibilidades com o LinkedIn!  </p>  <p style=\"\">  \tCom este curso, vai fazê-lo, passo a passo, de forma simples e fácil.  </p>", 
    "end_date": null, 
    "title": "LinkedIn: um aliado na gestão da carreira", 
    "price": "40.00", 
    "instructors": "Cristina Correia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412700_1a9d_4.jpg", 
    "course_url": "https://www.udemy.com/linkedin-um-aliado-na-gestao-da-carreira/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T22:01:46Z"
}