{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t            This course is designed to help active and passive job seekers polish up their profile for their search. If you are looking for a new opportunity or job, this course will help you in your pursuits as we work to polish and optimize your LinkedIn profile.  </p>  <h4><strong style=\"\">    Learn to master your profile on the most popular professional social network.   </strong></h4>  <ul style=\"\">  \t<li><strong style=\"\"><em style=\"\">Leverage</em></strong><strong style=\"\"> </strong>all of LinkedIn&#039;s tools to differentiate you from your competition</li>  \t<li><strong style=\"\"><em style=\"\">Optimize</em></strong> your profile to show up in search results</li>  \t<li><strong style=\"\"><em style=\"\">Structure</em> </strong>your profile to highlight your strengths and personal brand</li>  </ul>  <h4><strong style=\"\">Your LinkedIn™ Profile Is Visible – Polish It</strong></h4>  <p>  \t                                         One&#039;s LinkedIn profile is one of the most visible professional representations of who she or he is. With more than 300 million members and 93% of all recruiters using this networking site, it&#039;s clear that a powerful, polished profile can pay dividends to those willing to invest time in their profiles – and in themselves.  </p>  <h4><strong style=\"\">Content and Overview</strong></h4>  <p>  \t<strong style=\"\">  I want to help you have a cutting-edge, polished LinkedIn profile </strong>that will prepare your for your job search. Those who take this course and actively participate in the lessons should have a <strong style=\"\">much-improved LinkedIn profile</strong> upon completing all lessons. Profiles will be optimized for a job search helping you to get the position you deserve.  </p>  <h4><strong style=\"\">Who should take this course, who shouldn&#039;t?</strong></h4>  <p>  \t                                          This course is designed for beginner and intermediate LinkedIn users who already have a LinkedIn profile that needs to be touched up future opportunities. Those who do not currently have a profile should not take this course until they have registered for a LinkedIn profile. This is a <strong style=\"\">video-based workshop</strong>. Students will get the most out of this by not passively watching the lessons but by actively making edits and updates to their profiles as we move through each element of a fully developed LinkedIn profile.  </p>  <h4><strong style=\"\">How long is this going to take?</strong></h4>  <p>  \t                                        Your online presence is worth taking time to develop and fine-tune. The main sections of this course will take circa two-four hours to complete while making updates to your LinkedIn profile.  </p>  <h4><strong style=\"\">Testimonials</strong></h4>  <p>  \t                      &quot;When it comes to standing out on LinkedIn, it&#039;s the little and often overlooked things that count. <strong style=\"\">Sterling knows better than anyone I&#039;ve met how to optimize your presence</strong> — and that can have enormous payoffs in getting the job you&#039;re looking for!&quot;  </p>  <p>  \t<em style=\"\">– Jon Ogden, Director of Content at MX  </em>  </p>  <p>  \t                    &quot;<strong style=\"\">Sterling is extremely thorough in his analysis and his suggestions</strong> for improvement are concise and easy to follow.&quot;  </p>  <p>  \t<em style=\"\">– Braden Thompson, Marketing and Communication Professional  </em>  </p>  <p>  \t                  &quot;I always have had a LinkedIn profile and like most, I just put down the basics and didn&#039;t invest a lot of time in keeping it up. Sterling evaluated and made recommendations to my linkedIn profile 2 months ago. I still have some work to do based on his analysis, but since I have made some of the changes he recommended my rank in views has increased by about 30%. <strong style=\"\">His knowledge and expertise really helped me better my online presence</strong>.&quot;  </p>  <p>  \t<em style=\"\">– Preston Hopkin, Client Account Executive at AtTask, Inc. </em>  </p>  <p>  \t                  &quot;<strong style=\"\">Sterling did a fantastic job at evaluating, critiquing, and helping me update my LinkedIn profile</strong>. I&#039;ve received tons of compliments on how professional my profile is as well as I&#039;ve noticed a very significant increase in the amount of views I have received since heeding Sterling&#039;s advice and suggestions. I&#039;m very satisfied with my current position and role, however, it has been really nice to see the amount of companies and recruiters that reach out asking for more information from me and if I would have interest in working for them. I can credit a lot of this outreach to the advice received from Sterling. I would highly recommend Sterling for any consulting needs in regards to any of the major social media outlets.&quot;  </p>  <p>  \t<em style=\"\">– Tyson Harding, Project Manager at New Dawn Technologies</em>  </p>", 
    "end_date": null, 
    "title": "LinkedIn workshop: Polish your profile for a job search!", 
    "price": "20.00", 
    "instructors": "Sterling Morris", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361042_011c_4.jpg", 
    "course_url": "https://www.udemy.com/linkedin-workshop-polish-your-profile-for-a-job-search/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T03:04:51Z"
}