{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em><strong>Note: </strong>Course updated on 13 June 2015</em></p>  <p>Start getting job interviews using LinkedIn today. Applying jobs online is a very ineffective way to land your dream job. Don't believe? - Ask yourself, how many job interviews did you get by applying jobs online? <b><i>Honestly, not many.</i></b></p><p><b><i>Good news for you - I landed nearly 20 job interviews in less than a month only using LinkedIn and I will show you how I did it for only $97 today. </i></b>In the last 12 months, I've been invited by over 50 companies for a job interview, simply by optimizing my LinkedIn profile. These companies include IBM, LinkedIn, Oracle, Cisco, McAfee and many more. The video on the top left hand corner can be seen by everyone and you can see the messages I received from companies for real.</p><p><b><i>Bad news for you - The price of this course will increase to $197 by 15 July 2015.</i></b></p><p>+++++++++++++++++++++++++++++++++</p><p>About this course:</p><p><i>Free lifetime access.</i></p><p><i>All future extra lectures and upgrades are always included for free</i></p><p><i>30 day money-back guarantee</i></p><p><b><i>You also get full, free access to my resume writing course - which sells here on Udemy for $99</i></b></p><p><strong>This course will take you step-by-step </strong>through the most successful job search of your life:</p><ol><li>Get in front of hundreds of hiring managers in just a few hours</li><li>Market yourself as a great job candidate</li><li>Save time in your job search</li><li>Communicate with hiring managers using provided, customizable scripts</li><li>Stay organized with a methodical, proven system</li><li>Get lots of interviews</li></ol><p>... and much, much more!</p><p>Take this course right now to land 20 job interviews in less than a month... <i>every hour you delay is costing you money...</i></p><p><b>Don't forget, this course will sell at $197 by 15 July 2015.</b></p><p>See what his students say about:</p><p>I'm only half through the course, and after aplying the advice Tomy gives I already have 2 interviews appointed with great companies. The instructor is very friendly and active, I contacted him with one question and he gave me a response very soon. - Abraham </p><p>This is a great course that I suggest to everyone who is looking for a job at the moment and wants to maximise is chances to find it through an intelligent use of LinkedIn. Following the principles of the sales process, Tomy will teach you a method that is systematic but simple, effective and proven. He is able to put you in the mind of the hiring manager, helping you understand his/her purpose and motivations in order to connect with them and market yourself in the best way. - Giovanni Pitzalis</p><p>Excellent course! I really liked this course because it has everything that you need to create a very professional Linkedin profile. The course achieves what it sets out to teach, the instructor speaks from experience and it's very well prepared, 100% recommended! - Carlos</p><p><strong>Take this course right now..... </strong><em><strong>every hour you delay is costing you time and money...</strong></em></p><p></p><p></p>", 
    "end_date": null, 
    "title": "LinkedIn: How I Got 20 Job Interviews In Less Than a Month", 
    "price": "20.00", 
    "instructors": "Tomy Halim", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286236_81fd_3.jpg", 
    "course_url": "https://www.udemy.com/linkedin-for-jobseekers2/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-22T23:57:21Z"
}