{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Being findable on any website is important, especially on Linkedin. Linkedin People Search is the tool Linkedin provides to find people in a specific industry. When somebody searches your industry, where do you show up? Chances are that if you do not land on the first or second page, you will never be found.</p>    <p>Using my “Linkedin Training: Improve Linkedin Profile for Search” techniques and suggestions, you will be able to rank much higher, perhaps in the top 5, very likely #1 in Linkedin People Search when somebody searches for your specific job or industry.</p>    <p>Take my Linkedin Training course on Linkedin Profile Optimization for Search today and rise to the top of search in no time. It really is that easy.</p>    <p><strong>Check out my other courses:</strong></p>    <ul><li>Introduction to Facebook Pages for Business - FREE</li><li>Introduction to Foursquare for Business - FREE</li><li>Understanding Hashtags in Social Media - FREE</li><li>Getting Started with Wordpress - Free</li></ul>        <p>Take this Linkedin Training course now and improve your Linkedin profile for search.</p><p><strong> UPDATE for 2016</strong> </p><p>Linkedin has changed how they display user profiles in Linkedin People Search but what still remains is what makes a successful profile. Testing profiles that have used the tips suggested in this course still rank well above others who have not implemented what is contained in this course. It does appear that Linkedin is now using more than just the content of your profile to determine ranking. To maximize success, I suggest using the tips I provide in this course in combination with being an active contributor to the Linkedin community.</p>", 
    "end_date": null, 
    "title": "LinkedIn Profile SEO - Rank #1 in People Search", 
    "price": 0, 
    "instructors": "Jerad Hill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15856_d14c_4.jpg", 
    "course_url": "https://www.udemy.com/linkedin-profile-optimization-for-search/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-02T17:56:17Z"
}