{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is for professionals that want to 1) perform a passive job search and 2) get calls from recruiters for jobs without applying. </p><p>\"<em>This class has been great. I completed the class Friday 10/07 night \nand I've had 5 phone calls and about 10 emails since from recruiters. \nIncluding a meet and greet mixer with one company.</em><em>\"</em> Izeko Floyd<span></span><br></p><p>I know this sounds a little crazy but... the thing is...my students and clients get calls every day from these techniques!</p><p>A whopping 75% of my clients get their final job through recruiter calls, not through direct applications. <br></p><p>There are many reasons for this.  I just had a client that had direct applied for a job but when they called they told her they found her on Linkedin. What? Why?..ok...here is why...</p><p>The employers use applicant tracking systems that have created a 'resume black hole' for candidates AND for employers.  So, they increasingly use of 3rd Party Recruiters or search online databases to source their talent. In a way, this makes sense.</p><p>Think about how much Google invests in their search function.  Linkedin and Monster do the same thing...while the employers' talent management systems are static and not designed for search in the first place.<br></p><p>If you are not getting calls on your resume...check out this class and learn these techniques that are easy to implement.</p><p>I explain EXACTLY, with screen shots from recruiter applications, what they are looking for so you can make these tweaks and get calls today!</p><p>Dr. Karen Gurney<br></p>", 
    "end_date": null, 
    "title": "Linkedin: Get Jobs Without Applying", 
    "price": "20.00", 
    "instructors": "Karen Gurney", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640332_dc6f_2.jpg", 
    "course_url": "https://www.udemy.com/get-jobs-without-applying/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T13:24:03Z"
}