{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">LinkedIn sometimes gets treated like the overlooked step child of social media - a lot of people who have a profile don&#039;t think it&#039;s worth having. The only reason they have it is because a friend sent them an invitation, and they haven&#039;t put as much time into it as they have into their Facebook or Twitter.</p><p style=\"\">But what those people don&#039;t realize is that LinkedIn can have a real affect on your career or business.&nbsp;&nbsp;</p><p style=\"\"></p><ul style=\"\"><li style=\"\"><strong style=\"\">75% of recruiters are required to do online research of candidates.</strong><span style=\"\">&nbsp;</span></li><li style=\"\"><span style=\"\"><strong style=\"\">70% of companies have rejected candidates because of what they found.&nbsp;</strong></span><br style=\"\"></li></ul><p style=\"\"></p><p style=\"\">If you own a business, or are looking to start one, you should know that&nbsp;</p><p style=\"\"></p><ul style=\"\"><li style=\"\"><strong style=\"\">97% of consumers use the Internet to research businesses.&nbsp;</strong><br style=\"\"></li></ul><p style=\"\"></p><p style=\"\">Where does LinkedIn fit in?&nbsp;</p><p style=\"\"><span style=\"\">LinkedIn profiles rank high on Google, usually the top 2 or 3 results on page 1.&nbsp;</span><span style=\"\">That means when someone looks you up online, it&#039;s highly likely that they&#039;re going to find your LinkedIn profile. But what type of impression does your profile leave?&nbsp;</span></p><p style=\"\"></p><ul style=\"\"><li style=\"\"><span style=\"\">Will someone come away with an idea of what your unique values are?&nbsp;</span></li><li style=\"\"><span style=\"\">Will a recruiter be able to pinpoint what skills you bring to the table?&nbsp;&nbsp;</span></li><li style=\"\"><span style=\"\">Would someone be able to see why you would be the perfect candidate for a new job opening at their company?</span><br style=\"\"></li><li style=\"\"><span style=\"\">Would someone see you as a thought leader, and take your product or service recommendation?</span></li></ul><p style=\"\"></p><p style=\"\">And what if you&#039;re not on LinkedIn yet? Well, then you just missed an opportunity to get found, tell your story, talk about your strengths, and demonstrate how you can add value. You&#039;ve missed opportunities to build your network, learn from your peers and industry leaders, and build relationships.&nbsp;</p><p style=\"\">This course will teach you how to set your LinkedIn objective, and how to leverage your profile to reach your goal.&nbsp;</p><p style=\"\">After that, I teach you how to develop your LinkedIn brand. There are almost 300 million professionals on LinkedIn. How are you going to differentiate yourself? I will show you how.</p><p style=\"\">I also walk you through LinkedIn&#039;s <strong style=\"\">NEW</strong> layout. &nbsp;I teach you the principles behind LinkedIn so that the next time the layout changes, you still understand how to get the maximum value out of the platform. &nbsp;</p><p style=\"\">Module 5 goes through creating your profile, from what makes an effective headline to how to handle your previous work experience. I also review how to do the keyword research you need to get found for your strengths. I also teach you how to think about the copy and words you use in your profile to leave the impression you want with your reader.&nbsp;</p><p style=\"\">Module 6 explains how to leverage one of the most powerful things about LinkedIn - the network of almost 300 million professionals, 49% of whom have a household income of over $100,000.&nbsp;&nbsp;</p><p style=\"\"></p><ul style=\"\"><li style=\"\"><span style=\"\">How do you make connections?&nbsp;</span></li><li style=\"\"><span style=\"\">How do you invite someone to connect on LinkedIn?&nbsp;</span></li><li style=\"\"><span style=\"\">How do you ask for recommendations?&nbsp;</span></li><li style=\"\"><span style=\"\">What is a LinkedIn group, and how do you use it effectively?</span><br style=\"\"></li></ul><p style=\"\"></p><p style=\"\">The recruitment and career solutions services found in LinkedIn are one of its biggest value adds.&nbsp; How can you best use LinkedIn as a job-seeker? Module 7 will cover this in depth.&nbsp;</p><p style=\"\">                                              </p><p style=\"\">The worksheets in this course provide a practice reinforcement of the concepts in this course.</p><p style=\"\">This course is for anyone who is looking for a new career direction, ways to add value to get a raise, anyone who wants free career insurance, and anyone who has something to sell, or something to say.&nbsp;</p><p style=\"\">By this course today to take control of your online presence, and make an amazing first impression.</p>  ", 
    "end_date": null, 
    "title": "LinkedIn -Excel your Career & Online Presence w Social Media", 
    "price": "35.00", 
    "instructors": "Abha Saraswat", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49700_ac04_4.jpg", 
    "course_url": "https://www.udemy.com/linkedin/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-14T02:51:53Z"
}