{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t   Despite having had two satisfying careers, 12 years in sports promotions and 15 years running a successful business, entrepreneur Dawn Sprong’s life felt empty and without meaning. She had a nagging feeling that there had to be something more to life, so she withdrew from the rat race to begin a search for what is possible.\r\n</p>\r\n<p>\r\n\t   In this course  Dawn discusses her transformation process, and will take you down the path that took her from feeling empty and unfulfilled to a life of joy and fulfillment.\r\n</p>\r\n<p>\r\n\t   She will show you how to step out of the ordinary and step into what is within you—happiness, abundance, and oneness with life. Her &quot;soul&quot; intention is to help you realize how to live the life of your dreams by inspiring you to look deeper within.\r\n</p>\r\n<p>\r\n\t   You’ll learn that your thoughts are like seeds for the garden of your life, and when you plant love, joy and gratitude you’ll yield peace, happiness and affluence.\r\n</p>\r\n<p>\r\n\t   The success of Dawn&#039;s company, MAI Apparel, the Blessing Bracelets, her home, marriage, and what she sees as having every gift of life possible, are actually the result of her retirement from chasing money and materialism.\r\n</p>\r\n<p>\r\n\t   The truth for Dawn is to seek peace, happiness and affluence, and to bring those same gifts to others.\r\n</p>\r\n<p>\r\n\t   This course will take about 76 minutes\r\n</p>\r\n<p>\r\n\t   It includes 17 videos with meaningful text\r\n</p>\r\n<p>\r\n\t   A 16 page work book\r\n</p>\r\n<p>\r\n\t   This course will address many issues such as:\r\n</p>\r\n<p>\r\n\t   Are you worried about how your life is going to work out?<br>\r\n\t     What is the point?<br>\r\n\t     What is possible for you?<br>\r\n\t     How to rise up to your own personal potential from within.<br>\r\n\t     Discover how to like to live the life you were meant to live.<br>\r\n\t        where you feel fulfilled and happy each day.<br>\r\n\t        Where you mix fun with work.<br>\r\n\t        Where you are a positive influence on others.\r\n</p>\r\n<p>\r\n\t Listen to your inner voice.\r\n</p>\r\n<p>\r\n\t In giving you receive.\r\n</p>\r\n<p>\r\n\t You&#039;ll benefit from all this and more at the end of this course, and find that the key to your dream life is right within your grasp.\r\n</p>", 
    "end_date": null, 
    "title": "Live the Life of Your Dreams Now", 
    "price": "40.00", 
    "instructors": "Dawn Sprong", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/152396_09e0_13.jpg", 
    "course_url": "https://www.udemy.com/live-the-life-of-your-dreams/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-24T23:31:38Z"
}