{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t<strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t<strong>MODULE #1: Why Your Profile Means Everything</strong>\r\n</p>\r\n<p>\r\n\t <strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t <strong></strong><strong>In this module, you will discover:</strong>\r\n</p>\r\n<ul>\r\n\t<li><strong>Why LinkedIn is the best Social Media BY FAR, and how to exploit it step by step, </strong>so you get more profile views, connections, endorsements, and clients or jobs!</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>The Kevin Bacon Myth: </strong>Why this movie star has found a permanent place in LinkedIn lingo, and he PROVES that LinkedIn brings you much closer to success than you could have ever suspected.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>5 profile writing mindsets that automatically turn you into a genius writer. </strong>This is the shortcut to writing killer LinkedIn profiles, and you&#039;ll also become a master at writing any other form of advertising within minutes!</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>Top 10 &quot;quick fix&quot; mistakes that are killing your LinkedIn profile</strong>, and what to do about them, so you instantly blow your competition out of the water and stand out like a beacon&hellip;</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>A &quot;works every time&quot; formula for writing profiles</strong> that transforms anyone from ZERO to HERO, within minutes. This formula has existed for over one hundred years, and it is the KEY to persuading other people with your words.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How I learned to get inquires from new clients on autopilot with my profile writing system. </strong>Before learning this simple trick, I was a &quot;hunter&quot; &mdash; always searching for the next client. Afterward, clients routinely contacted me!</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>Why you SHOULDN&#039;T use your resume on LinkedIn, and what to do instead. </strong>Leave this terrible mistake for your competition, the alternative works ten times better and it&#039;s much much easier!</li>\r\n</ul>\r\n<p>\r\n\t <strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t<strong>MODULE #2: How To Increase Your Perceived Value By Getting Inside Your Reader&#039;s Head</strong>\r\n</p>\r\n<p>\r\n\t<strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t <strong></strong><strong>In this module, you will discover:</strong>\r\n</p>\r\n<ul>\r\n\t<li><strong>7 questions that instantly reveal your audience&#039;s innermost desires, and how to use them to seduce your readers. </strong>I use these questions EVERY TIME I start a new project. I swear by them, and they will make your profile writing WAY easier and more effective.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>5 detailed examples for diving straight into your reader&#039;s mind. </strong>I work as hard as possible to leave the guesswork out of this course. You can see how many different types of professionals get inside the minds of their customers&hellip;And we may have already covered your profession too!</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to get all the raw material you need to craft your killer profile,</strong> even if you&#039;re an unemployed raw rookie, and you have NO IDEA what to say in your profile summary.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>The secret weapon that gets your reader interested in you. </strong>When you uncover this simple piece of information about your readers, you will have the power to turn BROWSERS into BUYERS.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>8 practice examples for getting into your readers header.</strong> I go into extreme detail so you master these skills down to the <strong>bone</strong>, and you have everything you need to know to get inside of YOUR target reader&#039;s head and pull their strings like a puppet master!</li>\r\n</ul>\r\n<p>\r\n\t <strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t<strong>MODULE #3: How To Instantly Stand Out On LinkedIn</strong>\r\n</p>\r\n<p>\r\n\t<strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t <strong></strong><strong>In this module, you will discover:</strong>\r\n</p>\r\n<ul>\r\n\t<li><strong>How to create a laser-focused tagline that drags new readers to your profile. </strong>Believe me when I say, it&#039;s the most important part of your LinkedIn profile, and you will thank me for this BIG TIME.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>An easy way to dwarf even the most cut-throat competitors. </strong>It&#039;s a really easy trick that makes you extremely valuable, and it makes you the &quot;obvious choice&quot; when you come up in the searches&hellip;</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>The secret to awakening desire in your reader in less than 2 seconds. </strong>(Hint: there is a certain &quot;trigger word&quot; that jolts your reader into attention within a split-second of viewing your profile. I&#039;ll show you how to find it.)</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>A weird little trick that makes your profile easy to remember, and extremely hard to forget. </strong>The secret lies hidden in your occupation. Say what you do in the right way and your readers will never forget you.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to create an &quot;elevator pitch&quot; for your profile, so readers have a <em>damn-good</em> reason to check out your profile&hellip;<em>in one glance! </em></strong>You may have heard about elevator pitches before but not known when or how to use them, but using them in exactly the right way on LinkedIn is STAGGERINGLY effective.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>The Garbage Man Trick: </strong>The incredible story of how I made a garbage man sound professional and appealing to readers on LinkedIn, and how to make your profile sound AMAZING by comparison.</li>\r\n</ul>\r\n<p>\r\n\t <strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t<strong>MODULE #4: How To Grab Someone&#039;s Attention And Force Them To Read Your Profile.</strong>\r\n</p>\r\n<p>\r\n\t<strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t <strong></strong><strong>In this module, you will discover:</strong>\r\n</p>\r\n<ul>\r\n\t<li><strong>Three quick tips for grabbing your readers&#039; attention, an forcing them to read your profile. </strong>Once you know them, you&#039;ll be able to have your reader&#039;s full, alert attention at will.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>8 of my all-time favourite attention-grabbing headlines</strong>, and how to use them for yourself! (I swipe each of these headlines for 8 different professions, so you quickly get the idea how to steal them yourself!)</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>100 proven cookie-cutter headlines from some of the greatest advertisements in history</strong> that stop readers dead in their tracks, and grab their attention. (Hint: Swipe them for your own attention-getting LinkedIn headlines!)</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>Why <strong>The National Enquirer</strong> possesses the world&#039;s greatest profile writing secrets,</strong> and how you can learn make your reader &quot;urgently curious&quot;, and become &quot;impossible to ignore&quot;, because of this magazine.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to take a GOOD LinkedIn profile&hellip;and make it SENSATIONAL: </strong>A funny lesson I learned from <em>the bearded lady, </em>and how it makes your profile supremely interesting.</li>\r\n</ul>\r\n<p>\r\n\t <strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t<strong>MODULE #5: How To Gain Interest And Pull People Into Your Profile</strong>\r\n</p>\r\n<p>\r\n\t <strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t <strong> In this module, you will discover:</strong>\r\n</p>\r\n<ul>\r\n\t<li><strong>One magic word that ALWAYS gets your reader to mentally commit to reading your profile from start to finish. </strong>No joke, it&#039;s like mental jui-jitsu &mdash; readers instantly shift from skepticism to suspended disbelief and you a fair shot to win them over!</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to intensify your reader&#039;s curiosity about you, and force them to keep reading with the &quot;3-Question Strike&quot;. </strong>This is also a perfect way to get your reader to start agreeing with everything you say, which is easily one of the top 3 persuasion tools in existence!</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>The &quot;Triple Hot-button Strike&quot;: </strong>Similar to the above, except you will poke your reader&#039;s where it hurts, <em>ingeniously</em> using their pet peeves to get them into an emotional state and <em>very interested in you!</em></li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to &quot;make a deal&quot; with your reader that flatters them deeply and guarantees that they will read your entire profile.</strong> This subtle move strokes your reader&#039;s ego in a powerful way &mdash; but ONLY if they keep reading&hellip;</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>The &quot;Why&quot; transition.</strong> This technique ropes your reader deep into your profile summary by taking advantage of the reader&#039;s curiosity. They&#039;re so busy trying to know your secret, they don&#039;t even notice that they have agreed to read your entire profile automatically.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to build interest in your profile with good-old fashioned storytelling. </strong>You will discover why story-telling is still the most powerful persuasive tool in existence, and how to find the &quot;romantic story&quot; behind anything.</li>\r\n</ul>\r\n<p>\r\n\t <strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t<strong>MODULE #6: How To Turn Attention &amp; Interest Into Desire.</strong>\r\n</p>\r\n<p>\r\n\t<strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t <strong></strong><strong>In this module, you will discover:</strong>\r\n</p>\r\n<ul>\r\n\t<li><strong>How to give your reader <em>goosebumps</em> when they read your profile. </strong>This simple trick makes every benefit you mention more powerful, more visceral, and more compelling.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to dramatize any profile description, even if your job is plain old BORING. </strong>(Hint: you can borrow enterainment from other people and things once you know how!)</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>13 different ways to create desire with your profile. </strong>I share various strategies which are PERFECT for certain types of professionals, and others which are better for your profession. Find out which one is right for you!</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to inject flavour and personality into your profile by using the right rhythm and tone. </strong>There is a specific &quot;selling voice&quot; that makes your reader automatically follow your lead all the way to your blue &quot;connect&quot; button.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>A trick that gets your reader to IMAGINE working with you, and enjoying every moment of it. </strong>It&#039;s LITERALLY a form of written hypnosis that puts your reader into a mild trance where they are much more open to your suggestions.</li>\r\n</ul>\r\n<p>\r\n\t <strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t<strong>MODULE #7: Increasing Your Networking Power By Making Your Readers TAKE ACTION!</strong>\r\n</p>\r\n<p>\r\n\t<strong>-------------------------------------------------------------------------------------------------------</strong>\r\n</p>\r\n<p>\r\n\t <strong></strong><strong>In this module, you will discover:</strong>\r\n</p>\r\n<ul>\r\n\t<li><strong>What to do after your reader reads your profile, so they take one step closer to working with you. </strong>If you don&#039;t get in touch with your readers then your LinkedIn profile is worthless, that&#039;s why this tip is INSANELY important.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>How to get your reader to believe everything you say. </strong>Quite often, when you have an excellent track record, <em>people won&#039;t believe you</em> unless you add one proven little line that makes everything better.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>Secret computer symbols that make you stand out:</strong> Which ones they are, and how use them in a super effective way.</li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>The 7 words that you need in your profile create new invitations to connect, almost like magic! </strong>If your reader&#039;s desire is like fuel, these 7 words are like the steering wheel that steer targeted invitations to connect <em>straight to your inbox!</em></li>\r\n</ul>\r\n<ul>\r\n\t<li><strong>7 Real-world profiles deconstructed step-by-step. </strong>Watch me explain 7 different examples so you see how every piece fits in the puzzle, and you&#039;ve got the perspective you need to create your own super-compelling LinkedIn profile.</li>\r\n</ul>\r\n<ul>\r\n\t<li>And much, much more!</li>\r\n</ul>", 
    "end_date": null, 
    "title": "Look Good On LinkedIn", 
    "price": "35.00", 
    "instructors": "Anton Volney", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/116080_0134_7.jpg", 
    "course_url": "https://www.udemy.com/look-good-on-linkedin/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-06T14:39:15Z"
}