{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                                          Let&#039;s face it, we&#039;re all leaders  -- whether at work, with our families or in other relationships. Great leaders, including managers and supervisors, set themselves apart from the others and have an air of prestige about them.  </p>  <p>  \t                                          The iManager® course is made up of 30+ sessions of jam-packed, easy to understand materials that you will immediately apply to distinguish yourself from all other leaders and managers and be in TOP demand!<strong></strong>  </p>  <p>  \t<strong>To celebrate that you utilized udemy today to make this wise investment in your management future, iManage® will provide you with nearly $3,000.00 in extras!  </strong>  </p>  <ol>  \t<li><strong>Half Price!</strong> -- The investment that you made in yourself today in the manager course was at a cost less than one-half that paid  by 1000&#039;s of others.</li>  \t<li><strong>12 Months Email Access!</strong> -- You have gained 12 months direct email access to Rick Roberts, founder of iManage®.   Share your management questions, struggles, successes via email and Rick will get back to you within one business day - guaranteed!  This access is embedded in Rick&#039;s leadership consulting packages and valued at $2,499.00.</li>  \t<li><strong>Two Powerful Programs!</strong> -- Want to really set yourself apart as a dynamite manager?   You have received FREE of charge two powerful, downloadable programs to implement with those you manage.  The proven programs are unique, easy to follow and were personally developed by Rick.  Individually, each manager program is sold for $249, occasionally discounted to $199.  <strong><br>  \t</strong></li>  </ol>", 
    "end_date": null, 
    "title": "Management:  Four EASY Steps to Higher Income and Prestige!!", 
    "price": "30.00", 
    "instructors": "Richard Roberts, MBA", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/300160_fbd8_13.jpg", 
    "course_url": "https://www.udemy.com/imanager/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-14T17:30:17Z"
}