{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hello,</p>\n\n\n\n\n\n<p>Thank you so very much for taking this course! For someone whose central theme in life is gratitude, this means a whole lot to me. Thank you.</p>\n\n\n\n\n\n\n\n<p>After having worked for 20+ years I had the stark realization that I have been successful in some jobs and not so successful in others. In every one of the successful ones, I have had a great boss, which simply meant he/she and I figured out a way to work together, support each other and grow together. We looked after each other’s interests.</p>\n\n\n\n\n\n\n\n<p>Needless to say, the other side of the coin wasn’t as pretty. Embarrassingly so, I did not realize that the reason for not shining through in some jobs were a direct result of having a boss, that I did not particularly enjoy working with. But the real embarrassment came in the form of not recognizing that my boss could be wrong at all. Given my upbringing and cultural background, I just did not want to think that bosses could be wrong as well.</p>\n\n\n\n\n\n\n\n<p>This course is a result of those realizations and exercising my free will to thrive in the situations or find the options which allowed me to grow in my career. From there on, it was no longer about my boss. It was about me and how I should behave with such a boss and the options I had in front of me.</p>\n\n\n\n\n\n\n\n<p>I am not the one to judge a boss. That is clearly not my job. Why he/she behaves in a certain way is not my business. However, the growth trajectory of my jobs is very much my business and that is exactly what this course is all about.</p>\n\n\n\n\n\n\n\n<p>You don’t see this topic being discussed every day. But gaining a thorough understanding of the topic and the options available, you can live a life that is filled with happiness and pursue a career that best suits your personality and temperament.</p>\n\n\n\n\n\n\n\n<p>I will be with you on this journey. Write to me. Hit me up on Twitter. Your job and your growth is your business. Own it. And allow me to facilitate your success.</p>\n\n\n\n\n\n\n\n<p>Thank you again. I am grateful you are taking this course. My very best for your success in this journey.</p>\n\n\n\n\n\n\n\n<p>Joseph Prabhakar</p>\n\n\n\n<p>joe@powercommunication.com</p>\n\n\n\n<p>@jprabhakar</p>", 
    "end_date": null, 
    "title": "Managing your Relationship with your Boss", 
    "price": "30.00", 
    "instructors": "Joseph Prabhakar", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786518_a82f.jpg", 
    "course_url": "https://www.udemy.com/manage-your-boss/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T20:25:51Z"
}