{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you got a Technical Job Interview coming up? </p><p>Don't know where to start? Or maybe you just need a quick refresher to give yourself the <strong>best possible chance</strong> of securing that dream job?</p><p>If you want to land a Data Science or Quantitative Analyst job you've come to the right place.</p><p>By the end of this course you will be well equipped to answer some of the most common and challenging interview questions in Probability, Mathematics, Brain Teasers, and Logic. For example:</p><ul><li>How many ping pong balls can you fit in a jumbo jet?</li><li>How many trailing zeros are there at the end of 1000 factorial?</li><li>What is the expected number of tosses required to get three heads in a row?</li><li>and much more...</li></ul><p>During the course we'll do a deep dive into 24 Technical Interview Questions covering a step-by-step and repeatable approach for each problem.<br></p><p>I designed this course as there are very few, if any, online video resources available to help people prepare for a Technical Job Interview. Whilst books are great, they don't accurately emulate the real interview experience. </p><p>The aim is to present the course as if you and I are sitting in the interview together walking through the question, giving you the opportunity to pause and complete the question yourself when you have enough hints!<br></p><p>So what are you waiting for? Sign up now and make a wise <strong>investment in your career</strong> today!</p>", 
    "end_date": null, 
    "title": "Master Your Technical Interview - TOP Questions & Answers", 
    "price": "20.00", 
    "instructors": "Dr Jahan Zahid", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661948_0ebc_2.jpg", 
    "course_url": "https://www.udemy.com/technical-interview-course/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T11:16:06Z"
}