{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Do you want a new job? Do you want a raise? ABSOLUTELY!  </p>  <p>  \t      I will tell you the secret in four simple words: who do you know?  </p>  <p>  \t      Nowadays, getting ahead is more about who you know, than what you know. Business networking is a must in today&#039;s corporate environment. You must be good in groups, good at meeting people, good at making sales pitches. This is all encompassed under the umbrella term of &quot;Business Networking&quot;.  </p>  <p>  \t      This course is designed to give you the tools you need to be a successful super networker immediately. The course is broken up into five elements of networking for you to learn and practice. Watch the course in the morning, use the tools that night! The five elements will help you whether you are a wallflower or an executive - having good business networking skills is a must for success.  </p>  <p>  \t      The Five Elements Include:  </p>  <ol style=\"\">  \t<li style=\"\">20 Seconds of Awesome</li>  \t<li style=\"\">Engaged Listening</li>  \t<li style=\"\">Killer Whales vs. Friendly Dolphins</li>  \t<li style=\"\">Information Station</li>  \t<li style=\"\">Be The Shark</li>  </ol>  <p>  \t    In this course each element is discussed in detail and students have the opportunity to practice the skills through quizzes, assignments, and homework. There are additional resources and tools given throughout the course and some extra super tips at the end.  </p>  <p>  \t    If you complete this course you will be more comfortable in talking with others and using those great relationships to achieve your professional and personal goals.  </p>  <p>  \tYou will be able to maximize your earnings potential by utilizing these 5 elements to meet more people and network with business movers and shakers. You will be able to get that raise you deserve or a find a better career.  </p>  <p>  \tClick the GREEN button now and Super Charge Your Career with this special networking course.  </p>", 
    "end_date": null, 
    "title": "Maximize Your Earning Potential through Business Networking!", 
    "price": "20.00", 
    "instructors": "Stevie Dawn Blakely", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/379578_4ec2_4.jpg", 
    "course_url": "https://www.udemy.com/maximize-your-earning-potential-through-business-networking/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T01:43:04Z"
}