{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><span>Imagine yourself speaking confidently and authoritatively on any radio program, whether you are the host or the guest.</span></p><p>  \t<span>How to Speak on Radio</span>  </p>  <p>  \tIn this &quot;How to Speak on Radio&quot; course you will learn how to talk effectively and be interviewed on a news or talk radio program. Speaking on the radio is a form of public speaking and most people fear public speaking. This course will help you come across your very best in every interview, so you won&#039;t have to worry about whether you sound nervous or uncomfortable. Students will learn about the following items:  </p>  <p>  \t1. Messaging  </p>  <p>  \t2. Sound bites  </p>  <p>  \t3. Differences between TV and radio  </p>  <p>  \t 4. How to deal with difficult hosts  </p>  <p>  \t5. Ins and outs of talk show callers  </p>  <p>  \t6. ways of getting invited back on the program.  </p>  <p>  \t7. How to sell or promote on every talk show appearance.  </p>  <p>  \tTJ Walker has hosted talk radio shows on 7 different national networks and has been a guest on more than 2000 news talk radio programs. He has also conducted training sessions around the globe for authors and experts about to go on radio tours.  </p><p>Enroll in this course today.</p><p>Course updated on July 29, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p>TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p>What others say:</p><p>“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p>“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p>(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Media Training-Radio: How to Speak Effectively on the Radio", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351072_ce29_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-speak-on-radio/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T17:18:58Z"
}