{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Do you want to expand your friendships, meet someone who can help your career, find yourself at ease with strangers, or increase your business referrals?</strong> This course will teach you how to introduce yourself to strangers, maintain interesting conversations, and learn to sidestep conversation pitfalls. </p><p style=\"\">Meeting new people can lead to a new career, a new romance, more business referrals, and deeper friendships!  You will learn to smoothly and easily:</p><ul style=\"\"><li style=\"\">introduce yourself to strangers</li><li style=\"\">build better business relationships</li><li style=\"\">develop deeper friendships</li><li style=\"\">be at ease attending business and social functions</li></ul><p style=\"\"><strong style=\"\">Deve</strong><strong style=\"\">l</strong><strong style=\"\">op the relationships you want and need</strong><strong style=\"\"> so you can enjoy your time more at parties, conferences, civic/service meetings, ...and anywhere you find yourself in a roomful of strangers.</strong><br style=\"\"></p><p style=\"\">You can become skilled at developing valuable relationships through introductions and good conversations by trying these easy techniques.  Real-life examples are used to teach the course, and cheat-sheets are available to download for even more ideas.  <strong style=\"\"><em style=\"\">The tips and techniques in this course are designed to give you success the FIRST time you try them.</em></strong></p><p style=\"\">The steps are simple, yet many people don&#039;t know what to do in a group of strangers, or they gravitate to people already known at social events. If you want to be the person who skillfully and easily develops new relationships through good conversation, this course is for you.</p><p style=\"\">Learn good introduction and conversation skills; then watch your business and social life dramatically improve!</p>", 
    "end_date": null, 
    "title": "Meet People! ...for business success and lifelong friendship", 
    "price": "25.00", 
    "instructors": "Lorrie Hess", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/316238_a9df_3.jpg", 
    "course_url": "https://www.udemy.com/meet-people-for-business-success-and-lifelong-friendship/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-09T02:14:38Z"
}