{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Mentoring</strong> para profesionales con experiencia, consultores, asesores, autores y cualquier profesional que tiene más de 15 años de experiencia y quiere tener una opción adicional de venta de esa experiencia como nuevo paso profesional o como una actividad de forma esporádica que le permita generar un ingreso adicional. </p><p><em><strong>Hacer este curso implica que vas a poder poner en valor y en venta tu experiencia</strong></em>, esa experiencia que muchas empresas a partir de los 40 años de edad (Aprox) de los profesionales no quieren pagar o lo quieren hacer con costes que permiten muy poco margen de acción.  <br></p><p>En este curso se incluyen videos con la información y estructura adecuada para dar un paso en el mercado que te permite trabajar con las nuevas reglas del juego para aquellos que quiere vender su experiencia y sus ideas.</p><p>El curso está condensado en algo más de 3 horas con toda la información adecuada para dar los primeros pasos con el mentoring.</p><p>El curso Mentoring, Vende tu Experiencia Profesional, está estructurada de la siguiente forma: </p><p>1.- Introducción</p><p>2.- Un enfoque de situación sobre que es lo que sirve actualmente y lo que ha cambiado a la hora de vender tus conocimientos, experiencia e ideas, </p><p>3.- Una definición de lo que puedes vender y como se vende.</p><p>4.- Los puntos claves de un negocio de mentoring</p><p>5.- Cómo encontrar a tus clientes del mentoring</p><p>6.- Cómo es el proceso de venta del mentoring, en qué consiste.</p><p>7.- Cómo utilizar el mentoring como herramienta para poder invertir.</p><p>8.- Consejos finales.</p><p><br></p>", 
    "end_date": null, 
    "title": "Mentoring, Vende tu Experiencia Profesional con Mentoring", 
    "price": "30.00", 
    "instructors": "Mr. Ruben Garcia", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780090_2906_2.jpg", 
    "course_url": "https://www.udemy.com/mentoring-vende-tu-experiencia-profesional-con-mentoring/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T16:16:37Z"
}