{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled ' <strong>Mind Power -10 Tips To Overcome The Habit Of Procrastination.' </strong>By Pradeep Aggarwal you will learn that-<span></span></p><p>Procrastination is not a good habit. People tend to procrastinate or postpone things which they want to do.<br></p><p>In this video course, you will learn 10 simple yet powerful tips to remove procrastination. <strong></strong></p><p>You will be able to completely remove procrastination and complete your job in hand in the given time frame and achieve much better results in your life<br></p><p>You will feel more motivated and confident after the course as you will completely overcome procrastination and increase your self esteem<span><br></span></p><p><span>You will also be able to anchor confidence in your life and instantly relax whenever required .You will overcome procrastination completely.<span><br></span></span></p><p><span><span>All the tips in this course are mind power techniques which are simple and easy to follow. </span></span></p><p><span><span>This course is very useful for students who want to remove their procrastination using just 10 simple tips and techniques<span><br></span></span></span></p><p><span><span><span>This course is for those people who have a habit of delaying things , delaying important tasks, daily tasks and procrastinating everything in their daily and professional life<span><br></span></span></span></span></p><p><span><span><span><span>This course is in English and contains 7 live recorded lectures . Total duration of the course </span></span></span></span></p><p>is more than 30 minutes.</p>", 
    "end_date": null, 
    "title": "Mind Power -10 Tips To Overcome The Habit Of Procrastination", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700568_5aea.jpg", 
    "course_url": "https://www.udemy.com/mind-power-10-tips-to-overcome-the-habit-of-procrastination/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-18T07:29:56Z"
}