{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Graduate job interviews are the gateway to a successful life and career. But each year, 1000s of graduates like YOU are totally underprepared for this critical step. </p><p>It's a competitive battleground, with an average of THIRTY NINE applicants per graduate role. So much so that 1 in 5 graduates are currently unemployed more than six months after university.</p><p><strong>Learn how to be successful in your job interviews – and get your career off to a flying start.</strong> </p><p>Our course gives you the complete guide to nailing your graduate job interviews. </p><p>It's taught by Ed Thompson, a recruiter who has conducted over TWO HUNDRED job interviews, as well as managing corporate internship and apprenticeship programs. </p><p>With this inside knowledge you'll be at a HUGE advantage when it comes to impressing employers and getting the job you want! </p><p>After taking the course you will:</p><ul><li>be confident, instead of nervous, about your job interviews</li><li>know what employers want, and be able to deliver this with ease</li><li>start finding that employers want YOU, not just the other way round</li></ul><p><strong>Together, we'll cover the complete job interview process.</strong></p><p>In our course, you'll find out how to become a superstar graduate interviewee. </p><p>First we'll look at the crucial steps before your interviews – how to set the odds massively in your favor before you even get to the interview stage.</p><p>Then we'll go deep on the interview itself, giving you examples and tools that YOU can use to make a great impression and get that dream job.</p><p>Lastly, we'll look at what to do after your interviews, including when and how to follow up with an employer.</p><p>Start learning now – in under two hours you'll turn yourself into a confident, effective, and highly professional interviewee. </p>", 
    "end_date": null, 
    "title": "Nail Your Graduate Job Interviews", 
    "price": "50.00", 
    "instructors": "up timize", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337528_d8fb_11.jpg", 
    "course_url": "https://www.udemy.com/nail-your-graduate-job-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T14:34:17Z"
}