{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>A complete crash course in salary negotiation designed for college students and recent grads.  You will be equipped with word-for-word scripts and powerful tactics that you can use to confidently and effectively boost your earnings.<br><br><strong>This course will teach you the exact techniques I used to negotiate a $20,000 increase in my salary right after college.</strong></p><ul><li>Uncover the single biggest negotiate mistake you can make</li><li>Debunk the biggest fears about negotiation (No, they won't take away your job offer!)</li><li>Master the best practices of negotiation that no one tells you about</li><li>Role play actual negotiation scenarios with walkthroughs of word-for-word scripts</li><li>Understand how to recover when the negotiation is not going your way</li><li>Go beyond salary, and negotiate for a full comprehensive compensation package including benefits</li><li>Negotiate effectively against the toughest recruiters</li></ul><p><strong><strong><br></strong></strong></p><p><strong><strong>Learning to negotiate is the best investment you can make</strong></strong></p><p><strong><strong></strong></strong>If you boost your salary $5,000 today, in 50 years, you will have an extra $2.2 Million in the bank.  Yes, this sounds crazy!  But, it's the magic of compound interest at work. (Yes, yes, I'm assuming a standard 7% annual interest rate here)<br><br>So, what does it take to boost your lifetime earnings by millions?  Well, honestly, not much... You can complete this course and negotiate a $5,000 raise all in the span of a few hours.<br><br>Now, that's what I call a sweet return on investment!<br><br><strong>This has worked for me.  This has worked for my students.  And this will work for you.</strong><br></p><p>I believe everyone has the potential to successfully negotiate their salary.  And I believe that you are no exception.  I think you can really surprise yourself.<br><br>I certainly surprised myself...<br><br>My name is Max Deutsch, and I recently graduated from Brown University, where I studied behavioral economics, mathematics, and human decision-making.  I developed an obsessive academic and non-academic interest in salary negotiation.  And so, during my senior year at Brown, <strong><em>I was able to negotiate massive six-figure job offers</em></strong> at companies like Yahoo, Blackrock, Intuit, and many others.</p><p>I didn't do anything particularly special, except learn the few important things I needed to say...and then say them.  All it took was a few quick phone conversations and suddenly I had $100,000+ job offers.  In this course, you will learn the exact words I used on these very phone calls. <br><br>And the story doesn't end there...<br><br>For the past two years, I've been teaching college students across the country my advanced salary negotiation techniques, helping my students earn thousands of extra dollars at companies like Google, Facebook, Goldman Sachs, Bain &amp; Company, and many more.  I've personally seen my negotiation system work, not just for me, but for dozens of other students with all kinds of backgrounds.<br><br>I'm confident that this course will give you the tools you need to join this group of students taking control of their income!</p><p>It doesn't matter who you are... You don't need to know anything about negotiation.  You don't need to have ever negotiated before.  You don't even need to have a job offer yet.  Let's just get you prepared to majorly boost your income!<br><br><strong>And, at the end of this course, you will be prepared to effectively negotiate...</strong></p><ul><li>Your salary</li><li>Your signing bonus</li><li>Your relocation bonus</li><li>Your targeted performance bonus</li><li>Your corporate housing</li><li>Your stock compensation (equity)</li><li>Your 401k match</li><li>Sick days</li><li>Vacations days</li><li>Remote working</li><li>Hours in the office</li><li>And much more!</li></ul><p><span></span><br></p><p>Learn everything you need through 16 lectures and 1 hour of my most powerful content.  The course is presented by professional voice actor David Cordeiro to ensure the highest quality learning experience.</p><p><strong>Join the hundreds of students that are taking control of their income and getting paid what they're worth!<br><br></strong><br></p>", 
    "end_date": null, 
    "title": "Negotiate a Six-Figure Salary After College", 
    "price": "30.00", 
    "instructors": "Max Deutsch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616908_85ed_2.jpg", 
    "course_url": "https://www.udemy.com/negotiate/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T23:21:53Z"
}