{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>A good network is the passport to a great job. </p><p>If you don't have a professional network, there's a real danger you'll spend months applying to faceless application forms while your better connected friends get job opportunities falling into their lap! </p><p>Just as bad and just as common - when you're lucky enough to have some existing connections, but you don't really know how to use these to your advantage. </p><p><strong>Networking like a pro is an ESSENTIAL skill in today's job market.</strong></p><p>In our course, entrepreneur and soft skills guru Rommell Wallace walks you through how he became a master networker – and the simple steps YOU can take to do the same. </p><p>By the end of the course, you will:</p><ul><li>be able to make and grab networking opportunities, wherever they are</li> <li>always be well prepared, confident and ultra professional</li> <li>know how to take the pain out of the job search process, by developing a professional network that will help you go further, faster</li></ul><p><strong>Networking Your Future is a complete, 360 degree introduction to the world of professional networking.</strong></p><p>We'll cover, together, how start building a professional network that can be a powerful springboard to your career. </p><p>First we'll cover how to be prepared – the crucial steps to take to make sure YOU can benefit from networking opportunities at any time. </p><p>Then we'll look at the skill of networking itself – from how to present yourself in person, to 21st century networking using various online tools.</p><p>Lastly, we'll focus on how to develop your network over the long term, building and nurturing ongoing, highly valuable professional relationships.</p><p>Start learning now – and grab all the networking knowledge Rommell has learned in his professional career in just half an hour! </p>", 
    "end_date": null, 
    "title": "Networking Your Future", 
    "price": "30.00", 
    "instructors": "up timize", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/549890_b63b_2.jpg", 
    "course_url": "https://www.udemy.com/networking-your-future/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-09T09:02:28Z"
}