{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled ' NLP- Remove Your Fear Of Failure Using NLP Techniques ' By Pradeep Aggarwal you will learn how to eradicate failure from your mind and focus on achieving success in your life using powerful and very simple NLP techniques like Anchoring, Mind Triggers, Circle Of Excellence And Reverse Spin Techniques .</p><p>You will become more confident by the end of the course and let go of the fear of failure, whether it is in sports, job, interview or exams etc . </p><p>Failure is just a state of mind and needs to be removed to become more successful in your life and achieve your goals.</p><p>This course is in English and contains more than 30 minutes of video content designed in 9 lectures.</p><p>This course contains-</p><p>Lecture1:Introduction</p><p>Lecture2:Explaining 4 Different Reasons Why People Have Fear Of Failure</p><p>Lecture3:Learn How To Manage Your Fear Of Failure</p><p>Lecture4:Self Hypnosis Relaxation – Simple Relaxation Technique Self Hypnosis</p><p>Lecture5:Learn How To Use NLP Anchoring Technique To Create An Anchor For Relaxation</p><p>Lecture6:Create An Anchor For Confidence Using NLP Anchoring Technique</p><p>Lecture7:Reverse Spin Technique – Learn How To Reverse The Feeling Of Failure</p><p>Lecture8:Circle Of Excellence Technique To Gain More Confidence</p><p>Lecture9:Summary</p>", 
    "end_date": null, 
    "title": "NLP- Remove Your Fear Of Failure Using NLP Techniques", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556176_3630.jpg", 
    "course_url": "https://www.udemy.com/nlp-remove-your-fear-of-failure-using-nlp-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T10:26:08Z"
}