{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">O objetivo do curso:</strong></p>\n\n<p>Melhorar o seu relacionamento com as pessoas no trabalho pode te levar para um novo nível profissional para que você seja realizado profissionalmente.</p>\n\n\n\n<p>Aprenda <strong class=\"redactor-inline-converted\">o que falar</strong> e <strong class=\"redactor-inline-converted\">como falar</strong> com as pessoas no trabalho para ter a habilidade de fazer a pessoas te tratarem bem, de fazer seu chefe te dar mais reconhecimento pelo seu trabalho, de fazer as pessoas fazerem o que você precisa que elas façam, e ainda vai conseguir trabalhar mais motivado e feliz.</p>\n\n\n\n<p>Esse treinamento é para todo mundo que quer saber como lidar com o chefe, clientes, colegas e equipe.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">A base teórica do curso:</strong></p>\n\n\n\n<p>As táticas ensinadas são baseadas em literaturas de Influência Pessoal, Inteligência Emocional e PNL (programação neuro-linguística) e utiliza os trabalhos de Robert Ciadini, Daniel Goleman, Anthony Robbins e Claudio Naranjo.</p>\n\n<p>Todas as teorias foram aplicadas e testadas para se extrair o que funciona no relacionamento com as pessoas no novo modelo que considera a velocidade das informações, </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Como o curso é dividido:</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Seção 1:</strong> contém aulas sobre linguagem, ou seja, palavras e frases que podem ser usadas para atignir um resultado e também palavras e frases que devem ser evitados.</p>\n\n<p>Vou te dar um exemplo: Quando estamos no trabalho e vamos dar uma opinião em algo que vamos usar o nosso conhecimento, não devemos dizer \"eu acho que...\" porque no significado implícito dessa palavra está que você não tem certeza daquilo que está falando. Experimente trocar o \"eu acho\" por \"eu acredito\". Então você fala \"eu acredito que...\" e aí você dá sua opinião. Comece a notar a diferença na reação das pessoas quando você não só fala menos \"eu acho\" como começa a falar mais \"eu acredito\". São 49 aulas sobre essas palavras e frases.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Seção 2:</strong> Como lidar com pessoas difícieis. Geralmente podemos agrupar as diversas situações em que as pessoas estão sendo difíceis em algumas situações padrão. São 14 aulas nessa seção, cada uma com uma situação para lidar com pessoas difíceis.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Seção 3:</strong> Linguagem corporal. Depois de saber o que falar e como falar pras pessoas, vamos ter 16 aulas de como usar expressões corporais que somam ao efeito das palavras. Juntando as duas coisas o que você fala tem muito mais efeito.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Seção 4:</strong> Sequências de força. São táticas mais avançadas onde é necessário aplicar uma sequência de frases para conseguir um maior resultado. Por exemplo, você não pode mudar como as pessoas são, mas pode muito bem fazer com que as pessoas te tratem como você deseja ser tratado. Por exemplo, teremos uma aula sobre como fazer isso criando 5 frases em uma sequência específica. São 15 aulas com sequências de força para aplicar e cada uma traz um resultado diferente.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Seção 5:</strong> Princípios pessoais. São 7 aulas onde eu mostro os princípios que vão te guiar e possibilitar vencer os desafios de lidar bem com as pessoas no trabalho.</p>\n\n\n\n<p><strong>Seção EXTRA:</strong> Mini-curso de Inteligência Emocional. Em 6 aulas eu conduzo um processo de elevar a sua inteligência emocional. Começamos com uma breve introdução e logo em seguida vemos como ter mais autoconhecimento, passando pelo autogerenciamento, a consciência social e o gerenciamento de relações até chegar no último passo que é a liderança de equipes com inteligência emocional e social.</p>", 
    "end_date": null, 
    "title": "O novo método para melhorar o relacionamento no trabalho", 
    "price": "50.00", 
    "instructors": "Marco Enes", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833008_e3db_4.jpg", 
    "course_url": "https://www.udemy.com/o-novo-metodo-para-melhorar-o-relacionamento-no-trabalho/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T00:20:39Z"
}