{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Applying for an internship or graduate job? You might know the steps involved but most people don't know what it takes to be successful at each stage - what employers are really looking for. <strong>T</strong><strong>his is the abridged version of the complete Insiders Playbook to a Graduate Job.</strong></p><p>My insider knowledge will guide you through each stage (I call them hurdles) to help you win your dream graduate job.</p><p>The course explains <strong>how employers use 12 hurdles to screen out applicants</strong>. They're time poor and risk averse so if you don't fit their \"cookie cutter\" profile, you're rejected. Unless you know what they're looking for!</p><p>There are numerous resources available to students that describe the graduate recruitment process, what to expect in interviews, assessment centers etc. and in general what employers look for. But that’s just <u>general</u> information. It doesn’t tell students what it takes to get that graduate job. And <strong>employers don’t want to give away their secrets of how they really assess candidates.</strong></p><p>That’s what this course does. It goes into depth to explain to students exactly how employers assess and screen candidates at each stage of the process. It provides<strong> insider tips and strategies to make it through each stage - even if a student doesn’t meet the employer’s stated selection criteria</strong>.  </p><p><u>Here are three examples.</u></p><p><strong>1. What Employers Say They Look   For</strong></p><p>\"We look for well-rounded candidates who have successfully balanced   university, work experience and extra-curricular activities, the ability to   work in a team and a desire to learn and drive your own career. Your motivation   to work in our industry\".<br></p><p><strong>What They Don’t Say</strong></p><p>Whether their preferred candidate characteristics are: Analytical vs Creative; Challenge vs Conform; Lead vs Follow; Ambitious vs Steady</p><p><strong><br></strong></p><p><strong>2. Assessment Centres</strong></p><p>\"We use a collection of tests and exercises designed to simulate our business environment. They help identify those candidates with the   most suitable personal attributes, problem solving or teamwork skills so we can   determine who would fit best and excel within the organisation’s structure   and culture\".<br></p><p><strong>What They Don’t Say</strong><br></p><p>Candidates are being constantly assessed and that includes the “informal”   coffee / lunch breaks. You're under scrutiny all the time, regardless what they say. But proactively engaging with managers during breaks is a powerful way to demonstrate your enthusiasm, promote yourself and overcome any performance issues in the   exercises. You can use it to <strong>your</strong> advantage!</p><p><strong><br></strong></p><p><strong>3. Online Application Screening   Questions</strong></p><p>“When organizing a work team, you prefer to choose those who:</p><ul>    <li>         Have        different strengths</li>    <li>         Have        the most technical expertise</li>    <li>         Cooperate        with each other</li>    <li>         Follow        instructions</li>    <li>         Think        like you”</li></ul><p><strong>What They Don’t Say</strong></p><p>This organisation has diversity as a core value and they want   employees who value the different strengths of individuals. This is a deliberate screening question. Answer incorrectly and you will be an automatic rejection at the first   stage.</p><p><br></p><p><strong>Through the course y</strong><strong>ou'll learn how to make it past each of the 12 Hurdles</strong></p><ol><li>Online Application</li><li>Cover Letter</li><li>Resume</li><li>Grades</li><li>Testing</li><li>Cultural Fit</li><li>Screening Interview</li><li>Video Submission</li><li>Assessment Center</li><li>In-Person Interview</li><li>Background Checks</li><li>Job Offer (And yes, how you handle a job offer can see it withdrawn!)</li></ol><p>Nearly every graduate employer uses behavioral questions, so there is a bonus section giving you examples of questions for the <strong>8 most common behavioral skills. And with real life examples of winning answers</strong>.<br></p><p>The course concludes with a 5 point personal action plan.<br></p><p>In total are 90 minutes of short video lectures. Take the ones that are relevant to you now. You can always come back to the course if a new employer has a different set of requirements.</p><p>The course structure is:</p><ul><li>Introduction</li><li>12 Assessment Hurdles</li><li>Behavioral Questions &amp; Winning Answers</li><li>Personal Action Plan</li></ul><p>As a graduate or intern you should take this course to maximize your opportunity to get your dream job. Don't miss out because you didn't know what the employer really wanted. That's learning the hard way!</p><p>We all know competition is fierce for graduate roles so give yourself every advantage and enroll in this course now.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Overcoming The 12 Hurdles To Getting a Graduate Job ", 
    "price": "20.00", 
    "instructors": "Peter Pychtin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670898_ac1b.jpg", 
    "course_url": "https://www.udemy.com/overcoming-the-12-hurdles-to-getting-a-graduate-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-16T06:17:57Z"
}