{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><strong>COURSE LAST REVIEW: JANUARY 2016</strong></strong></p><p><strong>JOIN 1900 STUDENTS IN MY PUBLIC SPEAKING COURSES!</strong></p><p><strong>---------------------------------------------------------------------------------------------------------------------------</strong></p><p><strong>Are you nervous when delivering a presentation? Do you hate speaking before a group?</strong></p><p><strong>How many times you missed an opportunity because you were afraid to talk in front of an audience? </strong></p><p>Fear of public speaking quite a common one (yes, you are not alone) and can seriously hinder your message, your product, you and your career! The good news is that everyone can overcome it and become a successful presenter.</p><p>I have helped thousands of students in the last 20 years, and now I share my knowledge in this course that you can follow when you want, how many times you want in complete privacy.</p><p>Put an end to broken sentences, nervous trembling, sweats and sleepless nights embracing an effective path towards your success. It's not rocket science and everyone can do it! I had exactly the same issues when I started presenting 30 years ago, so I know how it feels. But I also know you can get over it and how to do it. </p><p>You will get:</p><ul><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul><p><strong>Stop be stressed by speaking opportunities, stop squandering them and turn your energy into an asset!</strong></p>", 
    "end_date": null, 
    "title": "Overcome Fear of Public Speaking: turn it into an asset!", 
    "price": "35.00", 
    "instructors": "Paolo Pelloni", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385740_c509_3.jpg", 
    "course_url": "https://www.udemy.com/overcome-fear-of-public-speaking/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T15:18:22Z"
}