{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Did you know it’s <strong>ONLY for 6 seconds</strong> any recruiting manager looks at your resume and that’s why it is a must to have a unique resume to catch utmost attention of the employer within that 6 second span of time. </p>  <p>It’s not easy to present your career in an easy-to-read way that does justice to your experience and is attractive enough to ignite the urge in the recruiter to perk up and reach the phone to make a call to you for an interview. That’s where this course will help. In this course you will learn the tools and techniques which will enable you to create a master piece resume for yourself.</p>  <p>Once you have learnt the tools and techniques of writing a POWER Resume, getting an interview call will become a cake-walk for you. </p>  <p>If you are the one who finds it difficult to write or cannot organize your ideas, thoughts, experiences and qualifications, I can assure you that you will be able to learn to do all these things. In this course I have explained step by step process in creating your resume which is your self-advertising copy, nothing more and nothing less. </p>  <p>Do you know if your resume becomes successful in creating desired amount of mystery in the recruiters mind, they will look forward to meeting you and will be more willing to hire you as their employee?</p>  <p>Let’s face it, when it comes to writing a professional resume or even up-dating one, most of us could all use a bit of help. You might consider hiring a professional (available all over internet now-a-days), to write your resume.  But, do you think anyone else knows you better than you do? Even if you provide complete information to the resume writer, what if there is some change that you might have to make in the resume? And if you know each and everything about resumes and its parts, you can create your own master piece and it’s always up to you how you want to have it updated.</p>  <p>Writing a great resume for yourself will be the stepping stone that lands you a job interview and you will want one that sets you apart from the rest. </p>  <p>It does not matter if you already have a successful career or are just starting out as a fresh graduate, or are looking for a promotion at your current place of employment. If you know the tools and techniques of creating a power resume, YOU will always be a winner and will be able to get as many interview calls from companies of your choice at any point of time. </p>  <p><strong>So, let’s get started to create a new YOU and grab that DREAM job!!</strong></p>", 
    "end_date": null, 
    "title": "P.O.W.E.R Resume System: Proven system to get job interviews", 
    "price": "20.00", 
    "instructors": "Susmita Dutta", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468216_1776_4.jpg", 
    "course_url": "https://www.udemy.com/power-resume-and-cv-writing-that-lands-job-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-05T15:59:19Z"
}