{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course teaches you the decision-making process when setting up a geotechnical numerical model as well as how to add structural elements in soil-structure interaction problems appropriately. It is the first software-neutral e-learning course in this field and is aimed at novice users of the software in both academia and industry. </p><p style=\"\">The first section contains 13 lectures structured in the normal sequence of setting up a geotechnical numerical model, from planning the analysis to reporting the results at the end. The first six lectures focus on setting up the model geometry including rationalising the geometry, the 2D plane strain and axisymmetric assumptions, boundary conditions and mesh generation. This is followed by a self-test quiz with feedback provided on your answers. Another seven lectures then follow covering the input parameters that need to be provided including constitutive model selection and setting up the initial state and subsequent construction stages. We end with the important stages of validating the analysis results and presenting the input and output data in a report. These lectures are also followed by a self-test quiz.</p><p style=\"\">The second section contains five lectures on modelling structural elements, including the different element types and modelling concrete and steel materials. There is also a worked example on deriving input parameters and interpreting output for structural elements in plane strain and axisymmetric models.</p><p style=\"\">All the lectures use videos with 3D graphics and a commentary by our tutor to illustrate many of the complex geometrical concepts that are explained in this course in an engaging way.</p><p style=\"\">On completing this course you will be able to prepare geotechnical numerical analyses more confidently, avoiding many of the common errors of novice users. You will gain valuable skills in geotechnical numerical analysis – a method whose use in geotechnical design is growing rapidly.</p>", 
    "end_date": null, 
    "title": "Perform better geotechnical numerical analysis", 
    "price": 0, 
    "instructors": "(Competency in Geotechnical Analysis)", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431932_8333_4.jpg", 
    "course_url": "https://www.udemy.com/coganproject/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T11:54:20Z"
}