{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>***New highly rated course with 2200+ students!</strong><strong> Grab now at the low introductory price and own forever so always ready for any virtual interview in the future!***</strong></p><p><em>\"This course is jam packed with great info to help anyone improve their skills and get positive results in their next interview.\"-Ken Long<br></em></p><p><em>\"Thorough and Thoroughly enjoyable. The presenter was very upbeat and supportive, speaking from years of experience.</em><em>\"-K Gartner</em></p><p><strong>Interviewing is a key skill that leads to job offers and being great at virtual interviews over mediums such as the telephone or Skype is critical in today's global job market.</strong><br></p><p>Unfortunately, most people are not skilled at this type of interview and really hurt their chances to move forward in the interviewing process and get the job offers they desire and deserve. Not being great at interviewing, particularly virtual interviews, after working so hard during the job search process is like running a winning race and falling down at the finish line. All your hard work during the job search should culminate at the interview stage with a job offer for you!</p><p><em><strong>The only way to do great work is to love what you do. If you haven't found it yet, keep looking. Don't settle. -Steve Jobs</strong></em></p><p> However, for those who are skilled with interviewing in general and particularly with virtual interviewing they will really stand out from the competition and have a much better chance of success!</p><p><strong>THIS COURSE WILL TEACH YOU STEP BY STEP HOW TO SET MORE EFFECTIVE IN VIRTUAL INTERVIEWS THAT</strong><strong> CAN BE THE DIFFERENCE MAKER FOR YOU!</strong></p><p>You will learn:</p><ul><li>How Virtual Interviews can be to your advantage.</li><li>How screening interviews are conducted and how you can ace them.</li><li>That virtual interviews have some similarities and some very big differences compared to traditional face-to-face interviews.</li><li>Key tips to prepare your interview environment and technology so you can focus on being great during the interview.</li><li>Best practices to prepare for the interview from understanding key question categories that are asked to knowing how to talk about your most key things that help promote you.</li><li>Being great on the interview with a combination of being on point while providing vivid and descriptive answers.</li><li>Handling questions around compensation.</li><li>How to be great with each type of interviewer from HR screening interviews to potential Co-Worker interviews and even the Boss of the Hiring Manager.</li></ul>Your instructor will share the best practices learned from many years of interviewing others and putting those techniques to his personal success when sitting on the other side of the desk and will share everything with you.<p><strong></strong></p><p><strong>Get even more:</strong></p><p>Lifetime access to the course so you get updates and new bonus lessons for FREE.</p><p>Ask questions and I will answer them for you. Very focused on this to personalize learning. If you have a question l will gladly answer it for you with the goal that it helps with your interviewing success.</p><p>No risk to sign up and impact could be life-changing. Learn from my experience and rapidly move ahead faster with the knowledge I will share with you. Don't delay.</p><p>Please click the blue TAKE THIS COURSE button in the upper right corner and let's get started.</p><p>Many thanks and I appreciate your interest and hope to see you in the course!</p><p>-Steve Ballinger</p><ul><li><span></span></li></ul>", 
    "end_date": null, 
    "title": "Phone and Skype Interview Mastery: More Job Offers in 2016!", 
    "price": "20.00", 
    "instructors": "Steve Ballinger, MBA", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562796_f520_2.jpg", 
    "course_url": "https://www.udemy.com/phone-and-skype-interview-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T16:31:08Z"
}