{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">JobPrep is a series of modules aim at people who want to get prepared to find their next job or are looking to maximize their salary and advancement prospects in their existing role. </p><p style=\"\">I have been a professional salesperson, Executive Recruiter and Entrepreneur for over 15 years.  As a Recruiter I have interviewed over 8,000 candidates and <strong style=\"\"><em style=\"\">I have read over a quarter of a million resumes</em></strong> - so I have an in-depth understand of the good, the bad and the downright ugly as far as recruitment and resumes are concerned.</p><p style=\"\">The first module - The Resume - will show you <strong style=\"\"><em style=\"\">the best resume structure and content to use</em></strong> to make sure that it gets read and gives you the best possible chance of getting an interview.</p><p style=\"\">We are going to go through <strong style=\"\"><em style=\"\">what the job market is like</em></strong>, why are you looking for another role in the first place, and what alternatives have you got apart from leaving the job you are in.</p><p style=\"\">Next I&#039;m going to share with you <strong style=\"\"><em style=\"\">what employers are really looking for</em></strong> in a candidate. You might be surprised just how many of the criteria you do (or do not) meet!</p><p style=\"\"><span style=\"\"></span>Then we get into the guts of it - <strong style=\"\"><em style=\"\">what does the best resume look like</em></strong>, how is it structured, why do some get read and others just get checked in the bin?</p><p style=\"\"><span style=\"\"></span>I&#039;m also going to give you a fairly long list of the &quot;<strong style=\"\"><em style=\"\">Do&#039;s and Don&#039;ts</em></strong>&quot; when preparing your resume.  The devil is in the detail and sometimes it&#039;s the little things that make all the difference.</p><p style=\"\"><span style=\"\"></span>The Lost Art of the Cover Letter OR how to <strong style=\"\"><em style=\"\">rocket yourself right to the front of the queue</em></strong>!  Why you should take the time to use this as your IMPACT STATEMENT!</p><p style=\"\"><span style=\"\"></span>I&#039;m also going to share with you some simple ideas on where else you can look for a job rather than continuously smashing yourself on the job boards.  There may be some absolute gems right in front of your nose that you never considered. </p><p style=\"\"><strong style=\"\"><em style=\"\">Yes, you&#039;ll get a first class resume from doing this course but the real benefit will come from knowing how to use it, where to use it, and who to use it on!</em></strong></p><p style=\"\">So, let&#039;s prepare for your next job.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Prepare for your next job - How to write a cracking resume!", 
    "price": "20.00", 
    "instructors": "Ken Fowler", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441510_9c9c_5.jpg", 
    "course_url": "https://www.udemy.com/jobprep-the-resume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T21:48:04Z"
}