{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><span style=\"\">Imagine yourself living and working daily in the field of public speaking and presenting. You can coach other executives, politicians, authors and experts on how to give presentations more effectively.</span></p><p style=\"\">  \t<span style=\"\">How to Be a Presentation Trainer</span>  </p>  <p style=\"\">  \tIn this &quot;How to Be a Presentation Trainer&quot; course you will learn how to conduct public speaking and presentation training workshops, seminars, rehearsals and consulting sessions. In addition, you will learn about the business side of presentation training. Being a public speaking coach and presentation trainer can be a highly rewarding profession, when conducted successfully. There is both an art and a science to transforming people from awful or average speakers into great presenters.  </p>  <p style=\"\">  \tTJ Walker has been a presentation trainer for 30 years. He has personally conducted thousands of training sessions on six continents with executives from every industry.  </p><p style=\"\">Sign up today for this course today. </p><p style=\"\">Course updated on July 28, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee. </p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe. </p>", 
    "end_date": null, 
    "title": "Presentation Trainer: Enter the Presentation Training Biz", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342778_5a93_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-presentation-trainer/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T21:36:12Z"
}