{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong><em>     Product Manager salaries start at $69,000 and can go as high as $140,000 with the national US average of $104,000.  Product Management jobs will grow at a rate of 12% over the next decade.  </em></strong>  </p>    <p>  \t<strong><em>2,300+ future product managers have already enrolled - and have left over 30 full 5 star ecstatic reviews.</em></strong>  </p>  <p>  \t<strong><em>     Course fully updated for March 2016</em></strong></p>    <ul>  \t<li>Obliterate the \"What if I can't get the job?\" fear</li>  \t<li>Destroy the fear that you won't qualify for the job</li>  \t<li>Demolish the feeling that you lack experience</li>  </ul>    <p>  \t                                        You've spent hours finding, collecting and analyzing opinions and advice on product management from all over the Internet, but <strong>you have this uneasy feeling that you don't have the complete picture and you don't know how to go from where you are today to landing your first product management job</strong>.  </p>  <p>  \t                                                           What if within a few hours, you can have a <strong>complete picture</strong> of product management and know the <strong>exact steps </strong>to take to launch your product management career.  </p>    <p>  \t                          \"After going through this course and seeing what interview questions to expect and how to answer them I feel much more confident and prepared for getting and performing well during the interview.\"  </p>  <p>  \t                       - Chris Parsons, Student  </p>    <p>  \t                        In just 3 hours, you will learn...  </p>  <ul>  \t<li>What the day-to-day job is like (from actual Product Managers)</li>  \t<li>How to present yourself as the ideal candidate</li>  \t<li>What tools and apps product managers use and how they use it so you can list them on your resume</li>  \t<li>How to flow right into the job by learning the entire product management process</li>  \t<li>How to show that you can add value to the company on Day 1</li>  \t<li>The product manager job description from interviews with actual product managers</li>  \t<li>How to ace the product management interview with the most commonly asked product management interview questions</li>  </ul>    <p>  \t<strong>And more:</strong>  </p>  <ul>  \t<li>You'll also get my personal product management resume template and learn about the critical 'resume killer' to make you shine as the ideal product management candidate.</li>  \t<li>Once you're complete the course, you won't be left to fend for yourself. Instead, you will get <strong>the checklist</strong> of things you can start doing immediately based on what you've learned in the course so you can begin your product management career.</li>  \t<li>You will get a lifetime access to this course, without any limits!</li>  \t<li>This course will be updated frequently and all future updates are absolutely FREE (the price of the course will go up, but you'll always get updates for free)</li>  \t<li>Access to all future interviews with product managers (new interview every month)</li>  \t<li><strong>You always get a 30-day FULL-MONEY BACK GUARANTEE</strong>, so don't hesitate to give yourself the best chance at getting your first product managment job.</li>  </ul>    <p>  \t                       \"This course has done the work to gather all the resources you need to learn everything you need to to land your first product manager job including actual common interview questions. Interviewing is no longer a black box and I understand how I should prepare.\"  </p>  <p>  \t                     - Strife Lim, Student  </p>    <p>  \t<strong> Every day you delay is slowing you down from achieving your dreams of becoming a Product Manager</strong>  </p>  <p>  \t<strong>Enroll now!</strong>  </p>", 
    "end_date": null, 
    "title": "Product Management: Career Preparation for Success", 
    "price": "50.00", 
    "instructors": "Felix Thea", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313174_1000_4.jpg", 
    "course_url": "https://www.udemy.com/product-management-career/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-04T03:40:35Z"
}