{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is designed to provide you with the steps for writing a short analytic report. In addition, the course will offer tips for successful analytic writing and provide you with the opportunity to produce a short analytic report. The course is not, however, designed to teach you how to write. It is aimed at analysts seeking professional development in the field of intelligence or students interested in the field of intelligence. </p><p>At the end of this course, students will be able to: </p><ol><li>Understand what a Short Form Analytic Report is used for and why</li><li>Utilize specific tools to produce clear and concise analysis</li><li>Understand the form of a Short Form Analytic Report</li><li>Produce a Short Form Analytic Report (SFAR)</li><li>Self-evaluate SFAR using provided rubric</li><li>Reproduce SFAR utilizing self-evaluation from rubric and examples of exemplary work</li></ol><p>You should not take this course if you cannot compose a thoughtful and well-structured paragraph that is exemplary in grammar. The course is not designed to teach you how to write or analyze information. The goal of the course is to provide you with tools to present your analysis in a clear and concise manner for Decisionmakers to use in a timely manner. You should take this course if you have an interest in being an analyst, enjoy research, or have a keen ability to analyze information. You will also need to know how to conduct research, think critically, analyze a problem, and have an effective mastery of writing in English.</p><p>We have designed the course to cover the following sections which will require that you write an analytic report and evaluate it using our provided rubric, then compare it against exemplary student work. The course guides you through the process and provides you with the format of a short analytic report in addition to tools for success. </p><ul><li>What is a Short Form Analytic Report and Who Is It For?</li><li>Assemble and Analyze the Information</li><li>Tools for Successful Analytic Writing</li><li>The Form</li><li>Produce a SFAR</li><li>Evaluate, Revise, and Conclude</li></ul>", 
    "end_date": null, 
    "title": "Producing a Short Analytic Report", 
    "price": 0, 
    "instructors": "Mercyhurst University, William Welch", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526096_c8cd.jpg", 
    "course_url": "https://www.udemy.com/producing-a-short-analytic-report/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T15:45:49Z"
}