{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\n\nWe make a tremendous investment to get a college degree. However,\nin general, we don´t put any effort to be a well-rounded person, but would you\nbe surprised to know that in the job market, learning how to manage people, how to get along with all sorts of different personalities is one of the most important skill you may acquire in your life? A recent national survey revealed that 80% of the people who are fired from their jobs were fired because they could not effectively relate to each other. <br></p><p>This course is about learning how to profile people with the intent of having far more productive relationships. <strong>If you are currently working or are about to enter the job market, this course is a must for you. </strong><br></p><p>When learning how to profile people to build better relationships, you will:</p><ul><li>Acquire <strong>skills to identify the different personalities</strong> and how they like to be treated.</li><li>Learn what makes people tick, i.e., <strong>what motivates people to do the things they do.</strong></li><li>Learn to find the best career fit for your type of personality. And if you have a business of your own, <strong>how to hire the right person for the position.</strong></li></ul><p>But wait, there´s more! </p><p>You're investment will yield knowledge in the following areas: </p><ul><li><strong>Profiling without the need of having someone taking a psychological test.</strong></li><li>Personal life. Of course our focus is business oriented, but what you will learn, certainly, will help you <strong>have a better relationship at home with your loved ones.</strong></li><li>Conflict -- you will <strong>learn what to do when there is a conflict in your relationship.</strong> </li></ul><p>This is a course that you won´t take just once, but many times to keep on improving your relationship skills. </p>", 
    "end_date": null, 
    "title": "Profiling People to Build Better Relationship", 
    "price": "30.00", 
    "instructors": "Andrew Matthews, Robert Silva", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599646_aa52_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-read-people/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T18:59:15Z"
}