{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In order for the project to be defined, planned, executed, monitored and controlled, the project scope or the definition of the stakeholder&#039;s needs must be collected and understand; in order for the project to have a clear direction, works is defined; tasks and activities are sequenced and scheduled, cost estimated and quality and performance are being measured and controlled.</p><p><strong style=\"\">Scope</strong> refers to all the work involved in creating the products of the project, and scope management refers to the processes used to define, controlling and creating them. A project scope is breaking down into manageable chunks; we called it deliverables of the project, such as a component of the software product, project charter, or meeting minutes.</p><p>In this course, we will examine why good project scope management is paramount to the project success. Describe the process for developing a project scope statement using the project charter and preliminary scope statement; highlight different techniques to collect user requirements for the products; discuss methodologies involved in constructing a work breakdown structure; explain the importance of scope verification and how it relates to stakeholder&#039;s requirement; understand the difference between scope change and scope creep. Synchronize all these scope management processes allowing the project team to better understand the stakeholder requirements; and equipping the project manager the roadmap to steer the project team to success.</p><p>The bottomline - This course show you how to turn concepts into actions, and helping you to reach your full potential.</p>", 
    "end_date": null, 
    "title": "Project Scope Management", 
    "price": "20.00", 
    "instructors": "Robert Lam, MBA, ITIL, PMP", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498474_8168_2.jpg", 
    "course_url": "https://www.udemy.com/project-scope-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-10T21:32:21Z"
}