{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you’re currently looking for a new job, do you comb the job boards every day with little or no results, applying to positions yet hearing nothing back? </p><p>Are you feeling discouraged and worried about whether you’ll ever find another job? </p><p>Do you wake up in the morning with a feeling of dread, wondering how to productively fill your day?</p>\n\n<p><strong>If you answered “yes\" to any of these questions, you need Project: Job Search. </strong></p>\n\n\n\n<p>This course delivers the most effective job search guidance gathered from HR executives, C-level executives, recruiters, career coaches, outplacement consultants and job seekers, synthesized into what you’ll find here—<em>a defined, action-oriented, end-to-end process</em>.</p>\n\n\n\n<p>This <strong>two-part course</strong> includes everything you need to know to get that job, with <strong>downloadable, easy-to-use tools</strong>. </p>\n\n\n\n<p>In Part I we’ll help you hone your job search materials, including your social media profiles, resume, cover letter, power line, and more. We recommend Part I to anyone who wants to make sure their presentation materials are the best they can be to best support your job search efforts.</p>\n\n\n\n<p>In Part II, we give you methods and strategies to build your network to maximize your chances of having an “in” at the companies you want to work for.</p>\n\n\n\n<p>You’ll also learn highly effective techniques to get in front of decision makers, clever ways to uncover so-called “hidden” jobs -- those jobs that never make it to the job boards -- plus ways to create your <em>own</em> position… And we’ll give you all you need to know to nail those interviews and make the most of negotiations. Part II offers something for every job seeker, so start here if you're confident that your tools are already where you want them to be.</p>\n\n\n\n<p><strong>Don’t waste another day “winging it.” Enroll in Project: Job Search to take your first effective step towards landing your next job.</strong></p>", 
    "end_date": null, 
    "title": "Project: Job Search | Part II | Your Action Plan", 
    "price": "50.00", 
    "instructors": "Nick Mitrakis, Kristen Mitrakis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/817508_42af_3.jpg", 
    "course_url": "https://www.udemy.com/project-job-search-part-ii-your-action-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-09T21:34:57Z"
}