{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>***COURSE UPDATED June 2016*** </p>\n\n<p>Whether you have an upcoming pitch, presentation, speech or meeting - <strong>HOW</strong> you present yourself and your ideas makes <strong>ALL</strong> the difference. It's an essential element of career success - and YOUR key to the most valuable opportunities.</p>\n\n<p><strong>Master the Art of Presentation and Instantly Benefit from an Enhanced Level of Persuasion, Influence and Respect.</strong></p>\n\n<p>Learning from hugely successful course tutor - Keynote speaker and author, <strong>Mark Jeffries</strong> - This “conversational\" and “engaging\" course will raise your level and significantly improve your confidence and delivery for that next presentation or speech.</p>\n\n<p>Mark has spoken in front of more than 180,000 people at conferences and events around the world - within this video-based course, he will share exactly what you need to know to plan, prepare and deliver your next presentation.</p>\n\n<p><strong>Contents and Overview</strong></p>\n\n<p>Mark will take you directly onto the stage of both his OWN performances and behind the scenes, giving you the inside track.</p>\n\n<ul><li>You will also learn how to understand and anticipate the needs of your audience.</li><li>You will see how to take full advantage of the stage - whether big or small.</li><li>Discover 'must-know' facts about microphones and lighting.</li><li>You will be talked through the power of your voice and how little tricks can have a major impact.</li><li>You will be shown the SIX keys to presentation influence AND why TIME really matters (Teach, Inspire, Motivate, Entertain).</li></ul>\n\n<p>Mark will be your mentor and coach guiding you through uses of humor, pace, diction and in a truly unique new approach - you will get to join Mark in a “Live-Read\" Duet - matching Mark in a clever read through of a downloadable PDF.<br></p>\n\n<p>By the end of this course You will have learned how to create, compose and deliver key, memorable messages… to create genuine influence and master the Art of Presentation.</p>", 
    "end_date": null, 
    "title": "Public Speaking Success - The Ultimate Guide", 
    "price": "20.00", 
    "instructors": "Mark Jeffries", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573500_393d_3.jpg", 
    "course_url": "https://www.udemy.com/masterpresenter/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T13:22:37Z"
}