{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Imagine yourself never dreading having to give another speech or presentation. Imagine that public speaking becomes just another minor irritant, like taking out the garbage.</p><p style=\"\">You might not ever get to the point of loving to give speeches or presentations, but after taking this course you will no longer have any fears or nervousness associated with speaking.</p><p style=\"\">***</p><p style=\"\">Public Speaking for People Who Hate Public Speaking  This &quot;Public Speaking for People Who Hate Public Speaking&quot; course is specifically for people who don&#039;t like giving presentations, do not aspire to be world class platform speakers, and who just want to give competent presentations with the least amount of preparation time and fuss possible. This course will teach you how to avoid the most common problems that make most speeches boring and useless. The course will also teach you simple ways of &quot;cheating&quot; to seem more comfortable and polished than you really are. Learning how to give a competent speech or presentation is, at some level, like learning how to write a competent memo or email, anyone can do it with proper training. This course won&#039;t make you love public speaking, but it will reduce the dread you currently face now before every presentation.</p><p style=\"\">Why waste even one more day dreading an upcoming presentation? Enroll in this course today.</p><p style=\"\">Course updated on July 29, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 13,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Public Speaking for People Who Hate Public Speaking", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343316_ed23_2.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-for-people-who-hate-public-speaking/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T15:31:32Z"
}