{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><span style=\"\">Imagine yourself fielding reporters&#039; tough questions at a heated press conference, and you appear perfectly confident, authoritative and on message. You can get the exact messages and quotes you want about your government agency into the news media.</span></p><p style=\"\">  \t<span style=\"\">How to be a Government Spokesperson</span>  </p>  <p style=\"\">  \tIn this &quot;How to be a Government Spokesperson&quot; course you will learn how to communicate to the media effectively as a representative of a government agency or bureau. The media hold government agencies and government officials to a higher level of accountability. As a government spokesperson, you will face greater skepticism and even hostility from the news media.  </p>  <p style=\"\">  \tThis course will teach you four main skills:  </p>  <p style=\"\">  \t1. How to look comfortable, confident and relaxed anytime you go on TV or in front of a camera.  </p>  <p style=\"\">  \t2. How to shape a three-part, thirty second media message for each interview.  </p>  <p style=\"\">  \t3. How to answer reporters&#039; questions in a strategic, focused manner.  </p>  <p style=\"\">  \t4. How to package your messages with sound bites so that you will know in advance exactly what quotes of yours will appear in the final story.  </p>  <p style=\"\">  \tTJ Walker has been a government spokesperson while working as the director of communications for the Florida Department of Banking and Finance and as a press aid to Members of the US Congress.  </p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on July 30, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Public Affairs: How to Be a Government/PIO Spokesperson", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352234_4ba4_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-government-spokesperson/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T19:37:16Z"
}