{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Hello and welcome! </p><p style=\"\">I don&#039;t know about you but when I was at school, the government decided to take grammar lessons off the curriculum. </p><p style=\"\">Fortunately, having both parents as English teachers, this didn&#039;t hold me back too much in my written skills.  Now an English teacher myself, and a total grammar geek, I want to share my knowledge with you, and give you too the opportunity to feel confident with grammatical devices. </p><p style=\"\">Think about it... who is more likely to get the job...the applicant who writes like a pro or the one who puts apostrophes in the wrong places? Which employee is more likely to be asked to do the presentations, write up the important letters, promote the company, deal with the customers, lead training sessions etc.? This successful employee will be you in just a few, easy to follow lectures.</p><p style=\"\">There are many books and courses out there on grammar, and many are simply overwhelming in content. What you have here is the first bite-size grammar course in a series covering aspects of punctuation only. By taking on aspects of grammar one step at a time you are far more likely to succeed and build your confidence! </p><p style=\"\">This course is part of a series on how to increase your chances of success at work by using correct and effective grammar. In this course you will find out about the different types of punctuation that will help you to become a more successful, confident, and competent writer.</p><p style=\"\"> Set out in levels of difficulty, you can progress from simple punctuation skills to advanced, in your own time, anywhere. </p><p style=\"\">With lifetime access, downloadable resources, discussion forums, regular updates, and a Udemy 30 day full refund no questions asked available, what have you got to lose?! </p><p style=\"\">Get started today and become more successful using punctuation straight away.</p>", 
    "end_date": null, 
    "title": "Punctuation Power: Bitesize Grammar for Instant Success!", 
    "price": "20.00", 
    "instructors": "Caroline Lucas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490504_62a7_2.jpg", 
    "course_url": "https://www.udemy.com/grammar-success-using-punctuation-correctly-and-confidently/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T17:01:05Z"
}