{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you not able to convert job interviews into job offers? Or your appraisals into promotion?</p><p>Do you have all of the required qualifications, yet not able to create an unforgettable impression?</p><p>Are you looking for a key which will unlock success in your life?</p><p>What if I tell you that except YOU, nothing else matters when it comes to YOUR success.</p><p>Did you know, people remember you the way you make them feel instead of the words that you actually said. So, if you want to create an unforgettable first impression, it is very important that you prepare yourself with correct tools and techniques before you even go to meet the person in question whom you want to impress or go to the event/interview.</p><p>I have asked this one question to the many decision makers all over the world \"If you would like to see change that will make your organization more productive, what would it be?\"</p><p>And everybody came back with one word and they said ATTITUDE. If a people had a better disposition, they would have a better team coordination, quality would go up, bottom line would go up and obviously, success is bound to follow.</p><p>Did you know that 85% of the time a person gets a job or a promotion is because of the disposition. ONLY 15% depends on how intelligent they are or how many facts and figures they know.</p><p>And almost 100% of the education dollars goes to teach facts and figures which accounts for only 15% of the success, and what we are talking in this course is the 85%. Which is what brings us to a point that it is not our position but our disposition which determines our success.</p><p>Now, once you are standing in front of the person you want to impress, you want to make sure that you connect with them on a personal as well as on a professional level. Ahh!! It is not as simple as it sounds. It is such a gift to give somebody your undivided attention and really share with them and exchange. </p><p>And the way we connect with somebody is the set of tools and techniques that you will learn in this course. Well! Doesn't it feel very awful to receive a limp handshake from somebody? It's the extension of your energy, and when you cut that energy off and kind of dangle it meekly with the person in front of you creates a disconnect. </p><p>So, make sure you master all these technique and attract the feelings of openness and positive vibes all around you… So that anyone in this world genuinely wants to connect with you and be friends with you for the rest of their lives.</p><p>This course will empower you with the entire blueprint, which can transform you into a success magnet. This course will help you create a long lasting impression and they will remember the WAY you made them feel. That's how you become UNFORGETTABLE and a SUCCESS Magnet</p>", 
    "end_date": null, 
    "title": "Pursue Top 1% Career: Become The No. 1 Success Magnet", 
    "price": "20.00", 
    "instructors": "Susmita Dutta", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590412_96c0_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-corporate-winner/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-22T16:28:15Z"
}