{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Everyone has a deep desire to  live a greater life than the one they are currently living. These  desires are called &quot;dreams.&quot; Dreams can make you miserable if they  remain as dreams, taunting you with what your life could be. On the  other hand they can be an inspiration and reason to wake up in the  morning if you know you can reach them. And reaching them is not as  complicated as you think!  </p>  <p>  \t  Find your dream and reach it with &quot;Reach Your Dreams w/ 7 simple steps that you can DO TODAY&quot;!  </p>  <p>  \t  - Discover what your dream is if you are not quite sure.  </p>  <p>  \t  - Easily break your dream down into simple steps and achievable goals.  </p>  <p>  \t  - Give purpose to your dream by making it serve others.  </p>  <p>  \t  - Build an dream insurance plan by creating a safety net who can help you reach your goals.  </p>  <p>  \t  - Grow daily through a personal growth plan.<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Find your dream, and start chasing your dream TODAY with a simple plan!</strong>  </p>  <p>  \t<strong style=\"\"></strong>In  this course you will learn how to identify your dream by discovering  your strengths and passions. After knowing what your dream is, you will  be able to create a plan to achieve your dream and live a life full of  purpose. You will be able to live with passion by sharing your dream  with others. Lastly, you will be able to respond to the unpredictability  of life.  </p>  <p>  \t   In this course you will follow the following steps (1 per day):  </p>  <p>  \t  1. Clarify your dream: Learn how to give life to your dream by defining the details.  </p>  <p>  \t  2. Create a map: Break your dream into small goals on a personal timeline.  </p>  <p>  \t  3. Serve: Give your dream life by making it about a cause greater than yourself.  </p>  <p>  \t  4. Recruit a dream team: Create a safety net for your dream by getting trusted friends involved.  </p>  <p>  \t  5. Cultivate consistency: Make a plan to work on your dream TODAY!  </p>  <p>  \t  6. Grow up: ward: Learn how to grow yourself as your grow your dream.  </p>  <p>  \t  7. Respond: Overcome life&#039;s obstacles as your chase your dream.  </p>  <p>  \t  This course will help you find purpose and meaning for your life on a daily basis. Anyone can do it! Chase your dreams! Achieve your goals!  </p>", 
    "end_date": null, 
    "title": "Reach your dreams w/ 7 simple steps that you can DO TODAY!", 
    "price": "50.00", 
    "instructors": "Paul Ellsworth", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380776_bcf2_2.jpg", 
    "course_url": "https://www.udemy.com/lifeonpurpose7step/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T11:24:54Z"
}