{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Are you just entering into the IT field? </strong>  </p>\n\n<p>  \t<em><strong></strong>Is it time for a change?</em>  </p>\n\n\n\n<p>  \t<strong>Struggling to update your IT resume?</strong><br>  \t<br>  \t<em>Not getting noticed on Dice, Monster, or other IT job boards?</em><br>  \t<br>  \t      What if I told you that you could hire a professional IT resume writer and learn all of his secrets about writing IT resumes that get you noticed by IT Recruiters and Hiring Managers?<br>  \t<br>  \t      Would you be interested in learning about it or just keep on struggling with writing an interview-generating IT resume?<br>  \t<br>  \t      Typical IT Resume Writer Charges <strong>$199</strong>, <strong>$297</strong>, or <strong>More</strong>...<br>  \t<br>  \t      Go on the Internet and do a search for IT Resume Writing and any IT resume writer worth anything will start at $199...<br>  \t<br>  \t      Howdi, my name is Ivan Hurt and I'm a Certified Professional Resume Writer.<br>  \t<br>  \t      I worked as a desktop support tech for over 10 years, until I went through an ugly outsourcing. So, I decided to change careers and become an IT Resume Writer. As an IT Resume Writer, I develop the Refactoring Your IT Resume system that almost guaranteed all of my candidates got called in for an interview.<br>  <br>Why am I sharing this information with you?  </p>\n\n\n\n<p>  \t      Simple, I can't possibly write an IT resume for every IT professional on the planet, so I created this course.  </p>\n\n\n\n<p>  \t  In this course, you will learn  </p>\n\n\n\n<ul>  \t<li><strong>The Real Reason Your Resume Is So Important</strong></li>  \t<li><strong>Why most IT resume writing advice is malarkey</strong></li>  \t<li><strong>3 Things IT Recruiters Want To See In Your IT Resume</strong></li>  \t<li><strong>Finding Keywords For Your IT Resume</strong></li>  \t<li><strong>Why Write A Career Summary Instead Of An Objective</strong></li>  \t<li><strong>Using Your Experience To Your Advantage</strong></li>  \t<li><strong>How To Write Your Experience That Will Make Recruiters Drool</strong></li>  </ul>\n\n\n\n<p>  \tYou also have a <strong>30-day money back guarantee</strong> if you aren't 100% satisfied with our work. Enroll now and land a new IT job.  </p>", 
    "end_date": null, 
    "title": "Refactoring Your IT Resume", 
    "price": "50.00", 
    "instructors": "Ivan Hurt", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412788_d93c_5.jpg", 
    "course_url": "https://www.udemy.com/refactoring-your-it-resume/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T01:15:56Z"
}