{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t  A person&#039;s own name is the single most important word to a person.  Their name is intimately tied to their identity as an individual.  In many ways it defines who we are.\r\n</p>\r\n<p>\r\n\t  Accurately remembering names is one of the simplest yet most important components of interacting with people.  It is a common trait that people who get things done and have a great life, recognize the importance of other people. A key step to recognising the importance of others is using their name.\r\n</p>\r\n<p>\r\n\t  However, remembering names and faces can be a big challenge for many people. Not being able to remember names makes it harder to make new friends and maintain business relationships. It can be both personally and financially costly to not remember a person’s name.\r\n</p>\r\n<p>\r\n\t  People who can remember names, develop better personal relationships with others. We are more likely to trust someone we know and think of them as a friend.  When someone remembers our name, the very thought that we are remembered gives us happiness and satisfaction. As a result we quickly build a relationship of trust with that person.\r\n</p>\r\n<p>\r\n\t  The secret to a happy fulfilling and successful life starts with how we relate to other people.  Remembering a person’s name is the key building block to positive and trusting relationships with other people.\r\n</p>\r\n<p>\r\n\t  Remembering another person’s name is actually simple when you know how.  This course is designed to teach you the skills so you can quickly and easily remember the names of people you have just met.\r\n</p>", 
    "end_date": null, 
    "title": "Remember Names and Faces", 
    "price": "30.00", 
    "instructors": "Damian Andrews", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/194142_54a4_2.jpg", 
    "course_url": "https://www.udemy.com/remember-names-and-faces/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-05T05:45:15Z"
}