{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em style=\"\">Join the Special Skills Academy Community on Udemy!</em></p><p><strong style=\"\">Resume Fundamentals with Resume Hosting Coupon + Tips </strong>training kit // Course updated on May 10th, 2015.</p><p>We strive to give our students more than just education. We provide experience that can be instantly implemented in the real-world. We reach that goal with this course!</p><p><strong style=\"\">In this course with included resume supercharge kit, you&#039;ll get:</strong></p><ul style=\"\"><li>Comprehensive Resume Fundamentals course</li><li>Advice on connecting your resume with LinkedIn® to separate yourself from other professionals</li><li>TIPS on how to avoid the most common resume mistakes</li><li>Tools to supercharge your resume in the real-world as every student of this course receives a coupon for one year of online Resume Hosting.</li></ul><p><strong style=\"\">The</strong> <strong style=\"\">Main goal of the “Resume Fundamentals&quot; course is to provide you with:</strong></p><ul style=\"\"><li>Comprehensive Resume Fundamentals with everything you need to know about resume writing</li><li>How to become more valuable and build a professional and effective resume which will be noticed by employers</li><li>How to highlight your greatest assets, and shift attention away from gaps you might have in your employment history.</li><li>How to literally supercharge your resume. There are dozens of resume building websites offering a combination of free and paid services. Many sites have excellent resume building tools, a wide variety of templates and formatting options, but do not allow you to connect your resume with LinkedIn.</li><li>How to expand your opportunities by publishing your resume online.</li><li>How to prepare keyword-rich and targeted resumes that get results.</li><li>How to effectively connect your online hosted resume with LinkedIn and separate yourself from other professionals.</li><li>How to avoid mistakes using the Special Skills Academy TIPS and TRICKS lecture section.</li></ul><p>Plus, you&#039;ll <strong style=\"\">get tools to supercharge your resume</strong> with the included <strong style=\"\">Resume Hosting coupon</strong>. This entitles you to <em style=\"\">one year of free Resume Hosting</em><em style=\"\">, enabling you to go one step further and implement all learned into your real resume</em>. </p><p>We wish to give our students more than just education and that our learning experience can really be instantly implemented in the real-world.</p><p>Take a look at the course curriculum for more detailed information.</p><p>Enroll today and make your resume more powerful!</p>", 
    "end_date": null, 
    "title": "Resume Fundamentals with Resume Hosting Coupon + Tips", 
    "price": "50.00", 
    "instructors": "Special Skills Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503156_b6bc_4.jpg", 
    "course_url": "https://www.udemy.com/resume-fundamentals-with-resume-hosting-coupon-and-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T17:18:01Z"
}