{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Why writing great Resumes is important:</strong> The hiring rate is very <em><strong>low</strong></em>, and there is a lot of <strong><em>competition </em></strong>- your resume needs to stand out and get read  so you can get an interview!</p><p>.</p><p><strong>Why you should join the Resume Examples course:</strong></p><ul><li>Learn how to avoid common resume mistakes</li><li>Stand out from your peers</li><li>Improve your own resume to help get more interviews</li></ul><p>.</p><p><strong>Who this Resume Course is for:</strong></p><ul><li>Students</li><li>Working Professionals</li><li><span></span>Anyone who is struggling to get interviews</li><li>Everyone who wants to write better resumes</li></ul><p>.</p><p><strong>What you get in this Resume Course:</strong></p><ol><li><strong>Video resume reviews</strong>: over 20 actual resume examples</li><li><strong>Annotated resume reviews</strong> using actual resume examples</li><li><strong>Resume Secrets</strong> course at a big discount</li><li><strong>Interviewing Secrets</strong> course at a big discount</li><li><strong>Access </strong>to closed Facebook group for people to review each other's resumes</li><li>As always, lifetime access to the course and all future lecture additions</li></ol>.<p><strong>Who I am</strong></p><p><strong></strong>I've written hundreds of resumes and been fortunate to get a lot of interviews from them. But I've also reviewed a lot of resumes so I have experience on both sides of the table. In this course I've reviewed other folks resumes so you can see common mistakes from people with all different backgrounds, all over the world, and avoid the same mistakes on your own resumes!</p><p>I want to see you improve your resume and get more interviews!</p><p><span></span>.</p><p><span></span><strong>Why not take the course today and get a head start on all your peers who are trying to get the same job you are?</strong></p><p><strong></strong>-<em>Andrew</em></p>", 
    "end_date": null, 
    "title": "Resume Examples: Learn From Dozens of Actual Resume Reviews!", 
    "price": 0, 
    "instructors": "Andrew Tye", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527020_8d1f_5.jpg", 
    "course_url": "https://www.udemy.com/resume-review-examples/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-12T19:34:58Z"
}