{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you an up and coming graduating student who has no idea how to create a resume or cover letter? </p>\n\n<p><br></p>\n\n\n\n\n\n<p>Are you a industry professional but still have trouble applying yourself toward new jobs and job searches?<br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Maybe you're neither and want to learn the proper ways on how to create a resume and cover letter.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Maybe there's a job fair coming up and you want to brush up on how to best show off your achievements.<br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>This course is for you!</p>\n\n\n\n\n\n<p><br><strong></strong></p>\n\n\n\n\n\n<p><strong>Resumes &amp; Cover Letters Made Simple: Building A Job Brand</strong> is <strong>THE</strong> course to inform you of the in's and out's of resume creation, cover letter creation, broadcast vs cover letter and which one is right for you and more!</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>--<br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>You may be the perfect fit for a job -- but a hiring manager is never \ngoing to find that out if he trashes your resume after a mere glance. \nEven in this age of online professional networking, a great resume is \nstill the foundation of a successful job search.  </p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>In the first part of the course, we shall cover the <strong>Do's</strong> and <strong>Dont's</strong> of a great resume. You will be able to view sample resumes to see best practices and learn the different formats for how to successfully pitch yourself to a potential recruiter. </p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>--</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Ah, the dreaded cover letter. Every time you sit down to write one, you probably browse cover letter examples online, get overwhelmed, and think something to the effect of: <em>Does anyone really read these? Wouldn’t it be so much easier if I could just let my resume speak for itself?</em></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><em>First off</em>: <strong>Yes, I can assure you that cover letters do, in fact, get\n read.</strong> In fact, to some hiring managers, they’re <strong>the most important part\n of your application</strong>. And yes, while it would be easier to let your \nresume speak for itself, if that was the case you’d completely miss the \nopportunity to <strong>t</strong><strong>ell prospective employers who you are</strong>, <strong>showcase why they\n should hire you</strong>, and <strong>stand out above all the other candidates.</strong> </p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>In the second and third parts of the course, you <strong>WILL</strong> be able to learn the difference between a cover letter and a broadcast letter and the opportunities to use both. You <strong>WILL</strong> also learn the proper formatting of a cover letter and the tips/tricks to make sure your application for a job gets viewed as a potential candidate for hire. </p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>--</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>In the last parts of the course, you - the student - will cover the <strong>proper social media outlets </strong>for enhancing your online presence, the <strong>Do's and Dont's of Interviews</strong> and lastly, you will cover how to properly write a thank you note and follow up with references upon request. <br></p>", 
    "end_date": null, 
    "title": "Resumes & Cover Letters Made Simple: Building a Job Brand", 
    "price": "20.00", 
    "instructors": "Ryan Sahadeo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485630_2f99_2.jpg", 
    "course_url": "https://www.udemy.com/resumes-cover-letters-and-you/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T21:44:09Z"
}