{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Once I found myself wanting to change careers. I applied to a ton of places and I would get a handful of calls here and there, and even some job offers, but no call backs from companies that I truly wanted to work for. One day, I bumped into a friend who worked at one of my &quot;dream&quot; companies and asked if she could make a recommendation. She agreed, forwarded it on, but I never ended up hearing back from that employer. After that happened, I knew I needed to improve my resume but I ran into 3 distinct challenges that were particularly frustrating:  </p>  <ol style=\"\">  \t<li style=\"\">I didn&#039;t know how to stand      out. When I searched online for advice I found a ton of career      &quot;experts&quot; contradicting each other. I found this overwhelming      and very confusing. I&#039;m also not a professional writer so I found      improving my bullet points and updating my most recent experience      particularly challenging. </li>  \t<li style=\"\">One thing that I heard      consistently is that I &quot;should&quot; customize my resume for every      company I applied to. Aside from changing my objective statement and      updating a few keywords, I really didn&#039;t know how else I could do this and      whether it was enough since I never got feedback from employers. Plus      customizing my resume for 30-50 different companies was time consuming and      oftentimes painful so I never really did it 100% of the time because I got      lazy.</li>  \t<li style=\"\">Formatting my resume on MS      word was always painful for me because it often took a lot of time to mess      with the borders, spacing, margins, fonts, and I always ended up missing      something.</li>  </ol>  <p style=\"\">  \t      So like many job seekers, I knew if I was able to just get that face-to-face interview, I&#039;d be able to make a lasting impression and get THE job that I REALLY wanted. But my resume didn&#039;t seem to resonate with the companies that I REALLY wanted. And with so many moving pieces I didn&#039;t know where to start and most importantly whether my efforts would truly make a difference in my results.  </p>  <p style=\"\">  \t      Does any of this resonate with you?  </p>  <p style=\"\">  \t      If so, you absolutely need to know more about my intensive Resume Transformation coaching program.  </p>  <p style=\"\">  \t            It’s a simple and proven blueprint that, when put into action, will almost instantly double or even triple the number of interviews you’re getting. And even if your current resume isn’t bringing you any interviews at all… I guarantee you’ll have plenty of face-time with the employers, if you pay attention to the first modules.  </p>  <p style=\"\">  \t            Resume Transformation can help you get a high paying job with a super employer even if your background is less than stellar. How do I know? Because I’ve used the exact same techniques with success – time and time again.  </p>  <p style=\"\">  \t            I’ve intentionally designed the program so that you’ll have plenty of time to learn the material, do the exercises, and ask questions without getting into information overload.  </p>  <p style=\"\">  \t            There are 4 core modules of Resume Transformation – and they’re all you need to get an unfair advantage over your competitors. By the end of module #4, you’ll know everything there is about writing the ultimate resume – and you’ll never have to hire another resume writer for the rest of your life!  </p>  <p style=\"\">  \t     Watch my preview videos below for a small sample of what you&#039;ll be learning in Resume Transformation.  </p>  <p style=\"\">  \t     I&#039;ll see you on the other side!  </p>  <p style=\"\">  \t     -Landon  </p>", 
    "end_date": null, 
    "title": "Resume Transformation: How To Write Unbeatable Résumés", 
    "price": "50.00", 
    "instructors": "Landon Long", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/72856_7d1b_11.jpg", 
    "course_url": "https://www.udemy.com/resume-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-01T23:37:37Z"
}