{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        Do you want to significantly increase your chances for success in your career field of choice, need help successfully making a career switch or just want help updating an outdated resume? The reality is that most of us fall into at least one of these categories and finding the motivation to get started can sometimes be, well, challenging. That, however, doesn&#039;t have to be the case! With <strong style=\"\"><em style=\"\">Resume Writing For Business Professionals</em></strong>, you&#039;ll get step by step instruction from an accomplished Business/Marketing Executive and <em style=\"\">Personal Business and Professional Development Coach!</em>  </p>  <p style=\"\">  \t        I will walk you guys through the process, giving you tips, strategies and professional insider insights that will give your resume the robust attitude it needs to make an impactful impression on potential employers. You will see a big uptick in call back ratios after you follow this course&#039;s steps toward improving your resume. Subsequently, you will be able to narrow your search and seek out only the job openings you are most interested in. You will also learn exactly what to include and what not to include that will take your resume from its previous place in the &quot;No&quot; pile to its rightful place in the <strong style=\"\"><em style=\"\">&quot;Yes&quot;</em> pile!  </strong>  </p>  <p style=\"\">  \t        By the end of this course you will be ready to take your skills and expertise to any employer&#039;s doorstep with confidence knowing that you are putting your best foot forward as the best candidate for the job. So don&#039;t procrastinate for another minute, come join this course by signing up below and lets get started!  </p>", 
    "end_date": null, 
    "title": "Resume Writing That Gets You Paid!", 
    "price": 0, 
    "instructors": "Ed Scotti", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324462_2569_2.jpg", 
    "course_url": "https://www.udemy.com/resume-writing-that-gets-you-paid/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T20:29:46Z"
}