{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>****  Updated April 2016 ****</strong></p>\n\n<p>Your resume or CV is one of the most important documents you'll ever create - your future career and income depend on it! And to some extent your happiness too - after all, you spend a third of your life working and that's too long if you aren't in a job you love.</p>\n\n<p>Yet very few people know how to construct an effective job application, whether it's writing a resume and cover letter or completing an application form. Are you prepared to leave it to chance? <br></p>\n\n<p>In this course, you'll discover exactly how to create a really professional and targeted resume for any job. Follow the 9 easy steps and you'll be writing a great resume and cover letter in no time. Plus you'll learn how to prove to an employer that you can do the job - you'll know how to make yourself stand out and make the employer sit up and take notice.<br></p>\n\n<p>You'll create several files to keep all of your information in one place for easy access and updating. I'll explain the importance of keywords and how to find the right ones for any job or career you are interested in</p>\n\n<p>You'll learn how to create a generic resume for job fairs and job sites and you'll understand exactly how to adapt it, transforming it into a highly targeted document for each specific job, highlighting exactly what the employer is looking for.</p>\n\n<p>Use my template and example to construct a high-quality cover letter. And you'll get easy to use templates for your resume too.<br></p>\n\n<p>Overcome the 3 biggest problems with application forms - explaining why you left a job and why there are gaps in your employment history. And the really big problem - how to fill in a supporting statement, consisting of a huge empty page where you have to convince an employer that you deserve an interview.</p>\n\n<p>Enroll now and by next week you'll be well on the way to a new and better career.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Resume/CV, Cover Letters: 9 Steps to a Better Job", 
    "price": "25.00", 
    "instructors": "Waller Jamison", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618324_f673_2.jpg", 
    "course_url": "https://www.udemy.com/resume-cv-cover-letters-9-steps-to-a-better-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T17:27:01Z"
}