{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em>** Course valued at $500. Special Launch Offer only (limited time)</em>  </p>  <p>  \t<em>** Over 250 students within 24 hours of going live</em>  </p>  <p>  \t                  Are you getting overlooked for new projects and promotions? Are you putting in long hours of hard work, hoping someone will notice?  You are starting to feel undervalued and unappreciated in the office- you are starting to feel invisible. It hurts, because you know you have a lot to offer and you crave to feel fired up at work.  </p>  <p>  \t                  Its time to feel confident and fulfilled at work . <strong>Its time for you to discover your unique talents and confidently communicate your value to get the opportunities you deserve. </strong> Your performance review is the ideal opportunity for you to showcase who you are, why you matter and ask for what you need to take it to the next level of your career.  <em>Isn’t it time to own your awesomeness?  </em>  </p>  <p>  \t<em><br>  \t</em>  </p>  <p>  \t                  I’m Tania DeSa, a leadership coach with an MBA who has acted on these strategies to achieve success across industries, organizations and countries. <strong>I’m going to help you own your awesomeness and stand out in the workplace as top talent.  </strong>  </p>  <p>  \t                  This course will help you:  </p>  <p>  \t                  Get clear on your career direction  </p>  <p>  \t                  Courageously ask for what you want  </p>  <p>  \t                  Decide what you want (and don’t want) in a role  </p>  <p>  \t                  Confidently showcase your talent  </p>  <p>  \t                  Build a stellar relationship with your boss  </p>  <p>  \t                  Fearlessly ask for what you want (and get it)  </p>  <p>  \t                  Measure your success effortlessly throughout the year  </p>  <p>  \t                  Its time to ignite your purpose, own your worth and amplify your impact in the workplace. Its time to build a clear vision for where you want to go and then take action to make that vision a reality.  </p>  <p>  \t                  I want to help you achieve your career ambition. I want to help others see you as the superstar you are.  I will guide you through a step-by-step process of rocking your performance review. <strong>You will hear case studies from my own career, practical advice from Fortune 500 managers, directors and CEOs, and get fill-in-the-blank templates to use in your own performance review.  I’ve consolidated years of experience into a single success system that you can complete in a few lunch hours during the workweek.  </strong>  </p>  <p>  \t                  You CAN rock your performance review to shine as top talent and catapult your career to the next level.  You’re not alone and it doesn’t have to be difficult. What you do matters so let me support you in owning your worth and rising to new levels of greatness at work (and let’s have fun in the process).  </p>  <p>  \t            ** This Course is valued at over $500, but I&#039;m on a mission to help you be seen and heard at work so I&#039;d like to offer the course to you at an over 70% discount**  </p>", 
    "end_date": null, 
    "title": "Rock The Review: Get Promoted as VIP Talent", 
    "price": "50.00", 
    "instructors": "Tania DeSa", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319664_42ea_7.jpg", 
    "course_url": "https://www.udemy.com/rockthereview/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T18:58:57Z"
}