{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    Academyk 360° est un parcours de formation 100% en ligne conçu par des professionnels de l’emploi, qui vous prépare et vous accompagne étape par étape dans votre recherche d’emploi et votre évolution professionnelle.  </p>  <ul style=\"\">  \t<li>Sur une période courte, vous allez passer au crible et d&#039;être préparé à réussir toutes les étapes d’une recherche d’emploi, de l’étude de votre projet professionnel, jusqu&#039;à la signature de votre contrat de travail. <br style=\"\">  \t</li>  \t<li>Vous bénéficierez d’une formation complète, riche de cours théoriques, d&#039;exercices concrets, de modèles de CV, lettre de motivation etc…et de conseils personnalisés d’experts de l’emploi. <br style=\"\">  \t</li>  \t<li>Que vous soyez jeunes diplômés à la recherche d’une première expérience, ou sans emploi, avec le souhait de retrouver un emploi durable, mais encore cadre ou non-cadre en poste, avec l’ambition de donner un nouvel élan à votre carrière, vous bénéficierez grâce à Academyk 360°, d’une formation complète qui vous permettra de raccourcir le chemin vers l’objectif professionnel que vous visez.</li>  </ul>  <p style=\"\">  \t    Être en recherche d&#039;emploi est un processus qui va au-delà de l&#039;envoi d&#039;un CV à un employeur. Nous allons vous apprendre en quelques heures, à professionnaliser votre démarche de recherche d’emploi et à vous positionner en véritable offreur de services.  </p>  <p style=\"\">  \tTout au long de cette formation, vous aurez bien entendu la possibilité d&#039;échanger avec les consultants d&#039;Academyk.  </p>", 
    "end_date": null, 
    "title": "Réussir sa recherche d'emploi et accélérer sa carrière", 
    "price": "20.00", 
    "instructors": "Mathieu Cécé", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415078_1c66_7.jpg", 
    "course_url": "https://www.udemy.com/academyk/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T15:32:19Z"
}