{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><em>This course is written and <strong>presented by a medical doctor with 20 years' experience</strong> in self-improvement training, coaching and counseling.  \t</em></li></ul>\n\n<ul><li> <em> It has been recorded and produced on a <strong>studio quality level</strong>.</em>  </li></ul>\n\n<ul><em></em><li><em>  By enrolling in this course, you will get a lifetime access to the current content, as well as, <strong>BONUS MATERIAL</strong> .  </em></li><em>  \t</em><li><em>No risk involved! Watch our </em><strong><em>PREVIEW VIDEOS</em></strong></li><li><strong><em><strong></strong></em></strong><em>Over <strong>10000 happy students</strong> enrolled in our courses!</em></li><li><em>Over <strong>500 TOP reviews!<br><br></strong></em><br>For the majority of workers asking for a pay raise can be a <strong>nerve-wracking experience</strong>. Even if the company is prospering, you still might feel as if you were being too demanding or bumptious. If the negotiation is not executed in the right manner with the right preparation,<strong> it may lead to embarrassment, distaste and anger</strong>.<br><br>My name is Roy Naraine.<strong> I’m a medical doctor with over 20 years of experience in self-improvement training</strong>. After being continuously bombarded by my students with salary negotiation questions, I decided to create this comprehensive, <strong>7 step guide to increasing your salary</strong>.<br><br>Truth to be told, salary negotiation is not so difficult, as long as you <strong>follow a specific set of rules</strong>. What many people don’t realize is that any kind of negotiation requires a little bit more than just the right arguments. <br><br>In order to succeed you also need to <strong>mentally prepare yourself for the conversation</strong>. You need to be able to <strong>present yourself effectively to inspire and motivate your boss</strong> to acknowledge your request.<br><br>The aim of this short course is to provide you<strong> the right tools for your confrontation</strong> with the boss and allow you to choose the time and atmosphere most conducive to acquiring success.<br><br>Remember, there is no risk involved. In all our productions we always have a few lectures available as free preview videos. Watch them and confirm that this is the course you need.<br><br>Thank you and see you in the first section.<em><strong><br></strong></em></li></ul>", 
    "end_date": null, 
    "title": "Salary Negotiation: A 7-Step Guide to Increasing Your Income", 
    "price": "20.00", 
    "instructors": "Dr. Roy Naraine, Adam Naraine", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764426_b9ec_2.jpg", 
    "course_url": "https://www.udemy.com/salary-negotiation-a-7-step-guide-to-increasing-your-income/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T15:19:04Z"
}