{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Do You Know That?</strong></p>    <p>More then <strong>3 billion</strong> people make a living that is less than <strong>$2.5 a day</strong>. More then <strong>1.3 billion</strong> people live in extreme poverty. When a family has money problems it is easy to get frustrated and upset. Parents also might be more stressed out than usual. They might argue more and worry about how to pay for things. There are a lot of people who commit suicide just because they want to get free of money and family problem. The real man is one who face the problems bravely and find ways to solve those problems not the one who want to get free from problems. Have you ever thought how to solve financial problems as we all know that people are facing problems in finding jobs just because they have no quality education. The best way to solve financial problem is that one should start his/her business. A lot of people are afraid of starting business because they think that they need a lot of money for starting it but the truth is you do not need big amount of money for starting a business.</p><p>This is what we're going to talk about in this course, all the problems mentioned above are common problems of everyone and there are proven methods to solve all of them, the problems are within you, if you change yourself from inside the external conditions are going to be fixed on their own. <strong>It is you who has to change to settle your life and becoming a successful person.</strong><br></p>    <p><strong>Why to start a </strong><strong>business:</strong></p>    <p>If you are having the same money and family problem so what will you do? Will you look for a job or you will start a business? I have seen a lot of people who search for a job instead of starting a business just because they think that they would not be able to run a business but, in reality business is not that difficult, you just need to understand a few core concepts and ideas about business..</p>    <p>In this course I have shared all those strategies and all those points which you need to know before starting your business. In this course you will learn these things in general:</p>    <p>-How to make your family happy if you are having financial problem.</p>    <p>-What to do if you find no job.</p>    <p>-How to start business with low budget.</p>    <p>-Selecting a right business to start.</p>    <p>-How to become successful in your business.</p>    <p>-Who is a successful business man.</p>    <p>-What are the qualities of a successful business man.</p>    <p>-How to grow your business.</p>    <p>-How to deal with people.</p>    <p>-How to read your customers mind.</p>    <p>-How to give time to your family with your business.</p><p>It is going to worth your time and investment, as I've said above you just need to change yourself from the inside and you'll start to see results from the outside. So, what are you waiting for. Enroll now and <strong>Become a successful business person.</strong><br></p>", 
    "end_date": null, 
    "title": "Settle Your life: How To Become Successful Person In Life ", 
    "price": "20.00", 
    "instructors": "Ammar Pervez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632358_70d2_2.jpg", 
    "course_url": "https://www.udemy.com/settle-your-life-how-to-become-successful-person-in-life/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T13:16:06Z"
}