{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You might be in a similar situation I was in a few years ago. You have a college degree but you can't seem to find a job that meets your qualifications. Don't wait for someone to pick you. Pick yourself and use the skills and knowledge you already have to create a better situation for yourself. </p><p>In this course, <strong>I show you how you can earn money every month online with a few easy actions. You'll learn about the mindset you need to develop and the steps you need take to meet your goals.</strong> </p><p>This is something most people forget about or don't know of, even though it's incredibly powerful. </p><p>New lectures will be added continuously where you'll learn in detail the steps to help you get to that extra first $1k / month. It's not difficult <strong>IF</strong> you're persistent and have a deep understanding to <strong>WHY</strong> you want it.</p><p><strong>This is some of what you'll learn in the course:</strong><br></p><ul><li>You'll learn about visualization and how it helped me to get my dream job as a designer half way across the world and how it can work for you as well. <strong>Visualization</strong> is more powerful than most people think. </li><li>If you imagine the life you want on a regular basis, in as much detail as possible, those thoughts slowly transforms into reality and this is something you'll learn more about in the course.</li><li>Day dreaming only gets you so far. The difference between getting to where you want to be and staying where you currently are is <strong>ACTION</strong>. You have to take action on your visualization. Once you know what you want, don't let anything stop you. Go for it with all your heart and be persistent.</li><li>We'll also talk about the importance of choosing your surroundings. <em>\"You are the average of the 5 people you spend the most time with\"</em> - Jim Rohn. Evaluate your surroundings and friends. Are they pushing you forward or are they dragging you down? <strong>Protect your subconscious from negativity because it will decide in which direction you are headed. </strong></li><li><strong>Be prepared to get comfortable being uncomfortable.</strong> A comfortable life is a life of zero personal development. Face your fears and recognize how good it feels to get through it. If something makes you nervous, do it. That's how you'll grow as a person and get to know yourself.</li><li><strong>How do you stand out</strong> from the crowd of thousands of others wanting the same thing as you? This one thing will connect you on a personal and human level with your potential employer, partner or audience.</li><li>How to <strong>figure out what it is YOU want</strong> in a world where we are bombarded with opinions from left and right.</li><li>How to <strong>stop procrastinating and get things done</strong> using this simple trick. Works every time.</li><li>The importance of <strong>building an email list</strong> and how to do it. </li><li>Build credibility and trust in your niche and <strong>become a person of service.</strong></li><li><span>5 steps you can take to <strong>become a happier and more energetic person, guaranteed</strong> (even before that first cup of coffee)</span></li></ul><p>As will all Udemy courses, this comes with a <strong>30 day money back guarantee</strong>. If you're unhappy with the course, simply ask for a refund. The course will evolve continuously with new lectures added based on what you want to know more about. </p><p><strong>Simply post your feedback and questions in the course Discussions, I'll be happy to answer them for you.</strong> </p><p><strong>If you're a college graduate currently working at a job which you are over qualified for, if you want to learn how to generate extra income online every month doing what you enjoy doing or if you're still trying to figure out what it is you want to do in life, this course was made for you. I've been there and I will help you get to where you want to be. </strong></p><p>You've got nothing to lose and everything to gain. Click the <strong>\"Take this course\"</strong> button right now and I'll see you on the inside.</p><p>Marouane<br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Shift Your Mindset: Create the Life You Deserve", 
    "price": "20.00", 
    "instructors": "Marouane Bembli", 
    "commitment": "28 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467488_e34d_10.jpg", 
    "course_url": "https://www.udemy.com/earn-an-extra-1000-online/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T17:28:09Z"
}