{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span>Business networking doesn&#039;t have to be difficult. Doing it comfortably and effectively is not as hard as you might think. The trick is to understand the process of networking.</span>  </p>  <p>  \t<span>Anyone can learn to network easily and make connections to improve their career, get more business or expand their professional connections. </span><span>It&#039;s not about personality... it&#039;s about the process. Understand the process and you know exactly what to do and when to do it. That means no more guesswork. No more wondering what to say. No more struggle to spit out an uncomfortable &#039;elevator speech&#039;. Follow the process and make connections faster, more easily and more comfortably than ever before.</span>  </p>  <p>  \t<span>There are 5 Keys to Networking Success and you&#039;ll learn what they are in this new way to approach professional networking. I make it simple to learn, and easy to use. You&#039;ll have a path to follow as soon as your done watching the lessons.</span>  </p>  <p>  \t<span></span><strong style=\"\">Do you know you should be networking but you avoid it?</strong>  </p>  <p>  \t<strong style=\"\"> Is meeting people uncomfortable and stressful for you?</strong>  </p>  <p>  \t<strong style=\"\"> Are you trying to meet people professionally but you&#039;re just not getting the results you want?</strong>  </p>  <p>  \t<strong style=\"\"> Do you collect business cards but aren&#039;t getting enough leads or referrals?</strong>  </p>  <p>  \t<strong style=\"\"> Have you spent too much of your time following up with people you&#039;ve met only to get no reply to your emails or no return calls from your voice mails?</strong>  </p>  <p>  \t    You are not crazy... there is a reason this is happening. It may just be that you are fighting the networking process instead of working with it. In order to be successful in today&#039;s information overload, instant gratitude business environment you need a secret weapon.  </p>  <p>  \t    That weapon is the networking process itself. You can&#039;t improve what you don&#039;t understand. By understanding what is really happening when you networking and meet people professionally you can create an effective strategy to get follow up meetings, build relationships and make more money.  </p>  <p>  \t<span>In this course you will...</span>  </p>  <ul style=\"\">  \t<li>Discover the 5 Stages of Networking so you can create a strategy to succeed.</li>  \t<li>Learn the 3 Pivotal Moments in the process that will help you connect with people faster than ever before.</li>  \t<li>Create confidence by knowing what to focus on to draw people into conversations.</li>  \t<li>Find out the secret to networking that no one tells you about in business school.</li>  </ul>  <p>  \t    This course is full of useful information that will allow you to learn to network more effectively and truly connect with people who matter to your business. This can help you open doors to opportunities like never before... even if you&#039;ve hated networking before. This fresh new approach to meeting people and developing professional relationships will show you how to free yourself from the anxiety of networking events and put you on the path to becoming a networking master!  </p>", 
    "end_date": null, 
    "title": "Simple Networking Secrets", 
    "price": "20.00", 
    "instructors": "Eric Byrd", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/239552_222f_3.jpg", 
    "course_url": "https://www.udemy.com/networking-secrets-revealed/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-08T17:22:52Z"
}