{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Descripción del curso</strong></p><p>Este curso te muestra de forma practica como realizar procedimientos estadísticos básicos en el programa SPSS, aprenderás por ti mismo a utilizar el software y realizar tus propias pruebas de estadística con ejemplos en variables continuas y categóricas.</p><p><strong>Audiencia</strong></p><p>Recomiendo el curso para cualquier persona que quiera aprender por primera vez el software SPSS o aquellos que quieran refrescar sus conocimientos en el uso del mismo.</p><p>El curso puede ser de gran utilidad para aquellos que de forma continua tienen que analizar datos por motivo de trabajo, o bien tienen que realizar algún tipo de reporte para propósitos de tesis en niveles de licenciatura y posgrado en cualquier área del conocimiento.</p><p>Durante el curso aprenderás a realizar las pruebas estadísticas descritas en el temario paso por paso, así como “tips\" útiles; si ya cuentas con alguna experiencia utilizando el software, el curso aún puede serte de utilidad para revisar temas específicos que nos revises frecuentemente.</p><p><strong>Temas incluidos</strong></p><p>Aprenderás desde los primeros videos como realizar las pruebas estadísticas utilizadas mas comúnmente y su interpretación; los principales temas del curso incluyen:</p><ol><li>Creación de la matriz de datos.</li><li>Seleccionar un grupo de casos en SPSS.</li><li>Ponderar casos en SPSS.</li><li>Transformación de datos en una variable.</li><li>Estadística descriptiva de variables categóricas.</li><li>Estadística descriptiva de variables continuas.</li><li>Pruebas de Chi cuadrado</li><li>Prueba de McNemar.</li><li>Prueba Q de Cochran.</li><li>Índice de Kappa.</li><li>U de Mann-Whitney.</li><li>t de Student para muestras Independientes.</li><li>Wilcoxon Signed Rank Test.</li><li>t de student para muestras Dependientes.</li><li>Anova de 1 vía.</li><li>Prueba de Kruskal-Wallis.</li><li>Anova Medidas Repetidas.</li><li>Prueba de Friedman.</li><li>Correlación de Pearson y Spearman.</li><li>Correlación Parcial de Pearson y Spearman.</li><li>Histogramas.</li><li>Gráficos de linea.</li><li>Gráficos de barra.</li><li>Scatterplots.</li><li>Boxplots.</li><li>Conclusiones.</li></ol><p><strong></strong></p><p><strong>Material adicional</strong></p><p>La mayoría de videos del curso se acompaña de archivos complementarios que puedes descargar con formatos *.sav (formato SPSS), y ocasionalmente en formatos *.doc (Word), o *.xls (Excel), esto con la finalidad que cuentes con las bases de datos que se utilizaron para realizar el vídeo y con las que podrás los ejercicios presentados en las diferentes lecciones.</p><p><strong>Duración del curso</strong></p><p>El curso tiene una duración aproximada 5 horas; el orden de los temas presentados puede modificarse de acuerdo a tus necesidades de análisis y revisión de temas específicos.</p><p><strong>Beneficios</strong></p><p>Al terminar este curso podrás realizar los análisis estadísticos más comúnmente utilizados para evaluar variables continuas y categóricas y su interpretación.</p><p>Podrías realizar los principales tipos de gráficos que mejor representen la información en tu análisis de datos y editar gráficos ya existentes.</p><p>Habrás aprendido un grupo importante de habilidades/destrezas analíticas que te darán una ventaja competitiva importante en tu trabajo.</p>", 
    "end_date": null, 
    "title": "SPSS, se experto en análisis estadístico (basico-intermedio)", 
    "price": "25.00", 
    "instructors": "Ernesto Roldan Valadez", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552984_b1a7_8.jpg", 
    "course_url": "https://www.udemy.com/spss-analisis-estadistico-basico-practico-y-efectivo/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T03:07:16Z"
}