{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Discover the untold secrets of top comedians. This <strong>in-depth program</strong> covers everything from your very first time on stage to how to take an established comedy career to the next level.<br>The Stand-Up Comedy Mastery Program strikes a balance in teaching the <strong>exact steps</strong> new comedians need to write and perform comedy for the very first time while also drilling down and teaching <strong>advanced strategies veteran comedians use </strong>to write and perform killer material, become more financially successful, and create a name for themselves in the industry.<br>There are over 13 hours of videos on writing stand-up comedy, performing comedy, and marketing yourself as a comedian in the 3-part Stand-Up Comedy Mastery Program.<br>The course begins by creating a foundation for new comedians. Not only does it provide <strong>easily applicable, step-by-step strategy</strong>, but it will shatter many of the misconceptions new comedians have that prevent them from breaking out of open mics and keeping them from experiencing the pure joy of packed crowds and rolling laughter.<br>Writing modules dive into both the <strong>tangible and intangible aspects of a comedian's material</strong>. You'll learn multiple strategies for how to kick off the writing process, punch up your material, and expand your ideas into hilarious stories.</p>\n\n<p><br></p>\n\n\n\n<p>*****TESTIMONIALS*****</p>\n\n<p><br>“This is one of those courses that <strong>covers the ba</strong><strong>sics and goes beyond</strong>. It gives you the box and then tells you what is outside of it. I am not sure if it is ahead of its time, but it is DEFINITELY TIME FOR IT!\"</p>\n\n<p>~Dave Johnson- Award-winning Comedy/Magician, clients include various conventions and Fortune 500 companies.</p>\n\n<p>*****</p>\n\n<p><br>\"This course offered much insight to the creative mind of the comedian. ###strong/strong###. They've found a way to put the creative process in measurable terms. This course is mandatory for all people wanting to have a career as a stand-up artist.\"<br>~Nick Olivas- Lewis and Floorwax Show, 103,5 Fox FM<br>******</p>\n\n<p><br>“You're my new hero. This course is a much-needed resource for the thousands of comedians (including me!) who need <strong>no-nonsense, practical advice for generating ideas, fine-tuning material, overcoming challenges, developing an original style, and mapping out a career.</strong>\"<br>~Paula Johnson- Co-Producer, The Joke Gym, Los Angeles</p>\n\n<p><br>******<br>Faster &amp; Funnier is a must for anyone serious about making a career in comedy. It has <strong>valuable insights to creating and performing original material</strong>. I found the course easy to understand and implement the recommended strategies. Thanks for putting this together, it has helped me become a better comedian.<br>~Dickey Bill Wagner- Producer, Host, and Headliner<br>*****</p>\n\n<p><br>Jared breaks down what the pros are doing and how you can achieve amazing results on stage. I've read many stand-up comedy books. This is the only book that has given me a deeper understanding of why comedy works and how to use that knowledge to further my career.<br>~Comedian Ellery Allexis- Actor, Comedian, Producer, and Host<br></p>", 
    "end_date": null, 
    "title": "Stand-Up Comedy Mastery Program - Writing Mastery", 
    "price": "50.00", 
    "instructors": "Jared Volle", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806896_f646_2.jpg", 
    "course_url": "https://www.udemy.com/stand-up-comedy-mastery-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-29T04:35:51Z"
}