{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>***This is Part 2 of the Stand-Up Comedy Mastery Program***</p><p>Part 2 of the Stand-Up Comedy Mastery Program focuses on performance mastery. In Part 2 - Performance Mastery, you'll learn performance skills that are critical to success on stage. You'll learn how to take your written material and effectively translate it onto the stage.</p><p><br></p><p>SECTION 1: VENUE GUIDE</p><p>In section 1, we'll show you exactly how to find places to perform all over the country. Find local shows where you can get consistent stage-time (even if you're new or under 21) or book performances from the other side of the country. You'll learn exactly how to find available shows, approach bookers, and get stage time. <br></p><p>You'll also discover how to break out of open-mic performances and get invited to exclusive shows. Learn critical skills for performing high-level shows, such as material selection and time-allotment. </p><p>Discover how to be successful in all types of venues: Comedy clubs, bars, outdoor shows, churches, and corporate shows. </p><p><br></p><p>SECTION 2: UNSTOPPABLE STAGE PRESENSE</p><p>In this section, you'll learn exactly how to prepare for your performance. You'll be introduced to \"performance variables,\" that professional comedians use to effectively translate their written material into a live, spoken performance. </p><p>You'll discover how to give your performance a natural flow, how to (and when to) use profanity, how to write an effective intro to create audience anticipation, and a simple mistake that puts the audience to sleep 5 seconds into your performance. </p><p><br></p><p>SECTION 3: DEALING WITH THE UNEXPECTED</p><p>In this section, you'll learn how to create momentum throughout your performance to keep the audience engaged, whether you're performing for 2 minutes or 2 hours. You'll discover how professional comedians handle unplanned interruptions to create massive laughter.</p><p>Next, you'll discover the 4 strategies for dealing with loud audiences. Learn exact steps on how to capture the audience's attention. </p><p>Last, you'll learn a simple trick that can turn any bombed joke into a roaring laughter. </p><p><br></p><p>*****ABOUT JARED VOLLE*****</p><p>Jared is a professional comedian and creativity trainer. He was a finalist in the Great American Comedy Festival and has been an opener for top-comedians like Kyle Cease (#1 Comedy Central Special of 2008, 10 Things I Hate About You, Not Another Teen Movie) and Louis Anderson (#92 on the \"100 Greatest Comedians of All-Time\" List by Comedy Central). He received a master's in Creativity &amp; Innovation in 2014, and has since developed several programs designed to increase comedians' creativity.</p><p><br></p><p>*****TESTIMONIALS*****</p><p>“This is one of those courses that <strong>covers the basics and goes beyond</strong>. It gives you the box and then tells you what is outside of it. I am not sure if it is ahead of its time, but it is DEFINITELY TIME FOR IT!\"</p><p>~Dave Johnson- Award-winning Comedy/Magician, clients include various conventions and Fortune 500 companies.</p><p>*****</p><p>\"This course offered much insight to the creative mind of the comedian. <strong>This information is not only brilliant but also intuitive</strong>. They've found a way to put the creative process in measurable terms. This course is mandatory for all people wanting to have a career as a stand-up artist.\"</p><p>~Nick Olivas- Lewis and Floorwax Show, 103,5 Fox FM</p><p>******</p><p>“You're my new hero. This course is a much-needed resource for the thousands of comedians (including me!) who need <strong>no-nonsense, practical advice for generating ideas, fine-tuning material, overcoming challenges, developing an original style, and mapping out a career.</strong>\"</p><p>~Paula Johnson- Co-Producer, The Joke Gym, Los Angeles</p><p>******</p><p>Faster &amp; Funnier is a must for anyone serious about making a career in comedy. It has <strong>valuable insights to creating and performing original material</strong>. I found the course easy to understand and implement the recommended strategies. Thanks for putting this together, it has helped me become a better comedian.</p><p>~Dickey Bill Wagner- Producer, Host, and Headliner</p><p>*****</p><p><strong>This course has brought a new dimension to my understanding of comedy</strong>. Jared breaks down what the pros are doing and how you can achieve amazing results on stage. I've read many stand-up comedy books. This is the only book that has given me a deeper understanding of why comedy works and how to use that knowledge to further my career.</p><p>~Comedian Ellery Allexis- Actor, Comedian, Producer, and Host</p>", 
    "end_date": null, 
    "title": "Stand-Up Comedy Mastery Program - Performance Mastery", 
    "price": "50.00", 
    "instructors": "Jared Volle", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/762094_a160_3.jpg", 
    "course_url": "https://www.udemy.com/stand-up-comedy-mastery-program-performance-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-14T07:47:52Z"
}