{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t    The 7 Day Career Challenge is a fun, practical, completely interactive and original course that will get you the job you deserve.\r\n</p>\r\n<p>\r\n\t    The 7 Day Career challenge will walk you through the process of finding, getting and keeping your dream job.\r\n</p>\r\n<p>\r\n\t    Each day builds your confidence as you add to your career tool kit.\r\n</p>\r\n<p>\r\n\t    You will consistently expand your horizons, moving towards your dream job all the time.\r\n</p>\r\n<p>\r\n\t    There is a carefully constructed series of simple daily tasks, with complete instructions of how to do them. The tasks are fun and easy to do, each one designed to get you closer and closer to your ideal job.\r\n</p>\r\n<p>\r\n\t    The 7 Day Career Challenge is an animated course and you will share your journey with Hannah, who will do the tasks with you.\r\n</p>\r\n<p>\r\n\t    This an extremely effective course to follow your dream career path.\r\n</p>\r\n<p>\r\n\t    The 7 Day Career Challenge has been put together by experts in career coaching, recruitment and strategic marketing.\r\n</p>\r\n<p>\r\n\t    It is packed full of tips, advice and simple, easy to follow instructions.\r\n</p>\r\n<p>\r\n\t    This course is all you will need to land your dream job and start living the life you want to live.\r\n</p>\r\n<p>\r\n\t    You can take as long as you like to complete the 7 days, coming back to each new day when you are ready to move on to the next stage.\r\n</p>\r\n<p>\r\n\t    You don’t need any experience. You just need the determination to complete the tasks.\r\n</p>\r\n<p>\r\n\t The 7 Day Career Challenge is narrated by <strong>Peter Cornwell</strong>, with the voice of Hannah provided by <strong>Marilyn Jennings</strong>.\r\n</p>", 
    "end_date": null, 
    "title": "Step by Step Guide to Land YOUR Dream Job", 
    "price": "40.00", 
    "instructors": "Mr Shaun Van Wyk, Mr Matthew Jennings", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137982_916a_7.jpg", 
    "course_url": "https://www.udemy.com/get-a-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-26T07:13:54Z"
}