{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>How great would it be if you could <strong>jump out of bed everyday </strong>to go to your dream job or see your business make way more money?</p><p>Unfortunately, that's not the way life is for most people because they make some <strong>fatal mistakes and fail to do one simple thing that can help you crush it.</strong></p><p>Think about it… Do you ever wake up not wanting to go to work the next day? Or try a bunch of different things but still don't see your business taking off? I was there too… Over and over again, I used to wake up and press snooze, not wanting to go into work. Even when I tried starting my own company and I was super passionate and inspired, that energy started to fade as my business was not taking off!</p><p><strong>There's a problem you need to know… </strong>Most people don't realize that they are the average of the 5 people they surround themselves with most, and as a result they spend time with people who hold them back instead of propelling them forward. </p><p><strong>Fortunately</strong> for you, if done right, you can use this very problem to your advantage. Through using the tactics and guidance provided in this course, you'll be able to easily attract mentors into your life that will change the game!</p><p>Using the same steps I outline in the course I</p><ul><li>Got a dream job via a Cold Email where I got paid to travel and teach entrepreneurs in Hong Kong, Amsterdam and Munich as a 21 year old college student </li><li>Landed deals for my company with Fortune 500 companies</li><li>Worked with some of the most promising startups via the world's premier startup accelerator, Techstars</li><li>And more...</li></ul><p>No matter what it is you want to achieve, your not going to get there alone. In the words of Sir Isaac Newton, “if I have seen further it is by standing on the shoulders of giants.\" <strong>This course teaches you how to find giants who have your success in mind and presents an actionable system to turn those role models into mentors. </strong></p><p>Attracting life-changing mentors isn't something you shouldn't leave up to chance. It is one of the most effective ways to make more money with your business or land your dream job and live the life you've always dreamed of. Using this course, you'll be able to make it happen fast. </p><em>(This course is backed by Udemy's 30-day money back guarantee so you have literally nothing to lose). </em>", 
    "end_date": null, 
    "title": "Step-by-Step Guide to Attracting Life Changing Mentors", 
    "price": "45.00", 
    "instructors": "Sam Hysell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555522_e3b4.jpg", 
    "course_url": "https://www.udemy.com/attracting-mentors/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T16:42:49Z"
}