{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    A course for anyone interested in joining a strategy consulting firm who is wondering about how to tailor their CV, how strategy consulting firms review CVs and how to successfully write a CV for strategy consulting. A CV is mandatory for applying to any professional role and there are specific factors to consider when you develop a CV to apply specifically to strategy consulting firms.  </p>  <p>  \t    This course will cover the different sections of a CV for consulting and give specific and detailed recommendations on what to include in those sections.  Anyone who is considering a move into strategy consulting and therefore needs a strong CV to get an interview should consider this course.  </p>  <p>  \t    The goals of the course are:  </p>  <ul>  \t<li>To provide background on CVs for applying to consulting, their structure and why strategy consulting firms use them,</li>  \t<li>To provide recommendations for what to include in each distinct section of a consulting CV, and</li>  \t<li>To provide recommendations to candidates for strengthening their CVs in advance of applying to consulting firms.</li>  </ul>  <p>  \t  The course is lecture based, has 9 lectures and has 45 minutes of video content in total.  It is designed for anyone who is considering a move into strategy consulting and therefore needs a strong CV to get an interview.  </p>  <p>  \t    The course has three sections:  </p>  <ul>  \t<li>Introduction to CVs for Strategy Consulting,</li>  \t<li>Consulting CVs by Section, and</li>  \t<li>Developing your CV</li>  </ul>  <p>  \t    The main section of the course, Consulting CVs by Section, breaks the CV down into 3 subsections and considers each individually.  For each CV subsection, we give specific examples of what works well and does not work well on a consulting CV.  We conclude with specific advice that can be applied to the entire CV.  </p>  <p>  \t    The only prerequisite is that students have written a CV before and now need to tailor that CV to apply to Strategy Consulting roles.  </p>", 
    "end_date": null, 
    "title": "Successful CVs for Strategy Consulting", 
    "price": "20.00", 
    "instructors": "Mike Salvaris, Jackson Carroll", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156102_ade0_2.jpg", 
    "course_url": "https://www.udemy.com/successful-cvs-for-strategy-consulting/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-31T21:22:43Z"
}