{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Over 600 students have already enrolled</strong> and are committed to their success in 2015!  </p>  <p>  \t<strong>Are you ready for SUCCESS in 2015?</strong>  Are tired of spinning your wheels and not getting ahead?  Are you ready to make the money you deserve to make?  Have the relationships you want?  Feel good about your health &amp; wellness?  Are you ready to take 2015 by the horns and start living the life that you deserve?  </p>  <p>  \t              If so, you've found the right course!  </p>  <p>  \t<strong>  You have lifetime access to this course and a 30 day money back guarantee!  </strong>  </p>  <p>  \t              In this course, you will:  </p>  <ul>  \t<li>Learn about the success mindset that you MUST to have to achieve success in your life  </li>  \t<li>You will create your Personal Strategic Vision for your life (not just learn about it...actually CREATE it!)</li>  \t<li>You will learn some wild and crazy information about goals and why they are SO awesome and effective</li>  \t<li>You will create your 2015 yearly and quarterly goals</li>  \t<li>You will identify and implement systems so that you will achieve your goals</li>  </ul>  <p>  \t              This course is under 1 hour - by design.  I want you to invest a small amount of time to get MASSIVE results.  </p>  <p>  \t              This course is self-paced and has exercises throughout.  Do the lectures in order.  Every lesson builds off of the previous one.  </p>  <p>  \t              This course has an unconditional <strong>30 day money back guarantee</strong>, so there is <strong>ZERO risk</strong> to enrolling in this course!  </p>", 
    "end_date": null, 
    "title": "Take Control of Your Life: Mindset, Goals, and More", 
    "price": "20.00", 
    "instructors": "Nikki Lee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364962_4fba_5.jpg", 
    "course_url": "https://www.udemy.com/are-you-ready-for-success/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-07T03:25:28Z"
}