{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Course Description</strong></p><p style=\"\">Our goal is to improve your speech performance, increase your confidence and credibility, enhance communication, reduce fear in all of those critical speaking opportunities that make a difference in your life:</p><li style=\"\"> Job interviews</li><li style=\"\"> Teaching</li><li style=\"\"> Public speaking</li><li style=\"\"> Auditions</li><li style=\"\"> Committee meetings</li><li style=\"\"> Professional presentations.</li><li style=\"\"></li><p style=\"\"><strong style=\"\">This is a Speech Class taught from an actor&#039;s perspective.  </strong>This is a course of exercises and thought related to enhancing your speaking abilities, taught from an actor&#039;s perspective. Ed Desiato, the co-instructor, is a graduate of the New York Academy and has been active in theater and television all his life. Ed introduces us to classical voice training and shares his secrets of speech that have been so critical to his success in life.</p><p style=\"\"><strong style=\"\">Content and Overview</strong> </p><p style=\"\">Our goal is for you be understood, to build confidence in your ability to communicate, and reduce anxiety. We recognize how critical it is to your success for you to be a relaxed and confident communicator, as a presenter, lecturer or member of a panel, or being interviewed, evaluated or auditioned, your speech, how you present yourself could determine your future.</p><p style=\"\">The course design is divided into two parts: Part 1 is comprised of videos with actor instructor Ed Desiato interacting with students in almost a classical training approach. We demonstrate breathing exercises and talk about the physical making of sound as voice and how to enrich that sound. There is also a video of class work with students covering phonetics as an introduction to voice training, diction or pronunciation. These are actual student teacher lecture demonstrations. There are videos using tongue twisters to combine breathing and diction. There is a video of a student reading from a prepared text that we provide.</p><p style=\"\">These four videos demonstrate what happens in “speech class&quot; as a way to familiarize you with some of the theory and how the teacher corrects and prompts the student. You&#039;ll be seeing three students edited throughout the classroom lectures.</p><p style=\"\">We also include lectures on body language, fear of public speaking, and mindfulness training.</p><p style=\"\">In part 2 we&#039;ve designed for you a daily practice that progresses over a 20 day period in which we&#039;ve incorporated all of the elements of training seen in Part 1. We wanted to give you a structure to encourage you to actually do the work, like piano lessons, you&#039;ll have to actually do the exercises. It&#039;s only then that you&#039;ll start to see a noticeable difference in you communication. </p><p style=\"\">You will be asked to make a recording of your voice. You can use your phone if you like. You&#039;ll be given sample paragraphs to read for your voice sample. </p><p style=\"\">You&#039;ll be able to use that recording as a base line of how you speak now before the course, and compare it to another recording we&#039;ll suggest you do at the end of this course. These recordings will be a before and after record of your improvement.</p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><li style=\"\"> 1 hour and 32 min of classroom and lecture videos </li><li style=\"\"> 27 audio practice files</li><li style=\"\"> 13 PDF documents of essays, suggested readings and lecture explanations</li><li style=\"\"> 20 day practicum of speech and mindfulness training exercises </li><li style=\"\"> Suitable to those in the teaching, sales, business and acting professions</li>", 
    "end_date": null, 
    "title": "Take Lessons from an Actor -- Speech & Confidence Training", 
    "price": "25.00", 
    "instructors": "Gene Williams, Edmund Desiato", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424486_ceb9.jpg", 
    "course_url": "https://www.udemy.com/take-lessons-from-an-actor-speak-with-confidence-class/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T01:42:04Z"
}