{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    In my life, I&#039;ve achieved a variety of personal goals thanks to direct support from a professional network of great people who have helped me along the way. From getting my private pilot certificate to starting my own business, I couldn&#039;t have done it without the connections I&#039;ve built. I believe wholeheartedly in Proverbs 15:22 that says &quot;Without counsel plans fail, but with many advisers they succeed.&quot; When successful people say that they didn&#039;t do it &quot;on their own&quot;, they&#039;re only half-right. Sure, many people helped them on their way, but those people didn&#039;t magically appear. YOU have to find the right people and then YOU need to connect with those people.  </p>  <p>  \t    This course takes you through process for targeted networking success:  </p>  <ul style=\"\">  \t<li>Step One: Identify the right people to connect with.</li>  \t<li>Step Two: Contact those people.</li>  \t<li>Step Three: Keep and grow your network.</li>  </ul>  <p>  \t    I pledge to teach you what I know. I’m not going to pretend to know something when I really don’t. Everything I tell you in this course is from what I’ve learned through experience.  I used targeted networking when I was in high school and I still use it today as I am currently in college.  As millennials, we are at the beginning of our professional careers and it is important to start networking smart as we build the connections that will shape our future.  Whether you’re just getting started in high school, or just graduating college, targeted networking is an extra weapon in your arsenal as you strive to reach your goals.  </p>  <p>  \t    As you take this course, please don’t hesitate to contact me with any questions!  I truly believe the methods and ideas you get from this course will benefit you in the long-run.  Some of it may seem like common sense, but you’re sure to learn something new or find a spark of inspiration!  Have fun, be creative, good luck, and God bless!  </p>", 
    "end_date": null, 
    "title": "Targeted Networking: A new approach for millennials!", 
    "price": 0, 
    "instructors": "John T Hill", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346552_46c2_2.jpg", 
    "course_url": "https://www.udemy.com/targetednetworking/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-16T20:02:01Z"
}