{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>I have created this course for all those students, business and tech geeks out there who wants to take the time to figure out how to use technology to their benefit or at least obtain sufficient knowledge to be able to effectively interpret any tech they come across. This is an ultimate guide on becoming Tech Savvy in all aspects of life, In order not to be left behind or at the mercy of those who know more, it is essential that we all work to become more tech savvy.</p>\n\n<p><em>At the end of this course, you will be able to optimise yourself in your career, business, and entrepreneurial skills. </em></p>\n\n\n\n\n\n<p>I have made this course as CLEAR and CONCISE as possible to SAVE YOU TIME.</p>\n\n\n\n\n\n<p>The course is split into a few sections: </p>\n\n\n\n\n\n<ol><li>First, we go over the basics</li><li>Second, we focus on essential, core, critical skills &amp; personal development</li><li>Third, we focus on career, entrepreneurship &amp; business strategy</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">In this course, you will find all the tools/ methods easy to understand, and you will be doing it confidently without any hesitation to reach your goals.</em></p>\n\n\n\n\n\n<p>Join this course to get everything you need to start and grow your tech savviness in this modern world.<br>This course does come with a 30-day money back guarantee. So what do you have to lose?</p>\n\n\n\n\n\n<p>Take this course NOW and I will see you on the inside.</p>", 
    "end_date": null, 
    "title": "Technology Savvy: How to become Tech Savvy", 
    "price": "25.00", 
    "instructors": "Anas Khan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776148_eec7.jpg", 
    "course_url": "https://www.udemy.com/tech-savvy/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T16:10:06Z"
}