{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Resume writing is difficult in every profession. Your resume must grab the attention of the hiring manager. Your resume only has 7 seconds to stand out from all the other resumes. In this course, I will help you develop a resume that will make your resume stand out no matter what type of profession you are in.</p>\n\n<p><strong>Do you want to have a resume that brings you multiple interview offers?</strong></p>\n\n<p><strong>Do you want to have a resume that recruiters and hiring managers love?</strong></p>\n\n<p><strong>Your resume is your <em>best bet</em> to get ahead in your professional career.</strong> It is how you advertise yourself in the employment market</p>\n\n<p>As a former recruiter that worked for a leading employment agency, I reviewed thousands of resumes. I will show you what hiring managers are looking and how you can the results you want. <br></p>\n\n<p><strong>Why you should join the course:</strong></p><ul><li>Learn how to avoid common resume mistakes.</li><li>Stand out from other people looking for a job.</li><li>Insider secrets revealed about to create a cover letter and reference form.</li><li>Learn how to get your resume listed on the first page of a job website. </li><li>And much more !</li></ul><p><strong><em>With this course, you will learn everything you need to effectively find a job.</em></strong><br></p>\n\n<div><strong>Enroll Today and transform your resume.</strong><br></div><div><p><em><strong>Included: </strong>30 day, no questions asked, full money back guarantee from Udemy</em> if you are not happy with the course. <br></p><p>See you in the course !!</p><p><br></p><p><br></p></div>\n\n<p>.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The Complete Resume And Job Search Course 2016.", 
    "price": "20.00", 
    "instructors": "Devon Campbell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587928_c738_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-resume-/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T23:16:14Z"
}