{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong>This course is for you if you are finishing university or college soon and not exactly sure what to do next...</strong></p>  <p>The course content is from Unigrad and is presented by Andrea Culligan. Andrea has helped thousands of students find careers, and hundreds of employers hire students, over her almost 20 yrs career in the graduate industry.  This course shares the valuable insights and tips relating to finding the grad job you want.</p><p>An award winning entrepreneur, Andrea has heard so many fears, questions and challenges from both students and employers.  The content included in this course aims to alleviate the fears students have about finding a job when you graduate, help you find out little bit more about yourself, find opportunities you never thought you were available, understand what employers really want, create resumes even without employment experience, interview with confidence and ultimately get the grad job you want.</p>  <p>Key topics covered:</p>  <ul><li><strong>Personal Brand</strong> - help you understand more about yourself and develop yours</li><li><strong>Brand Communication</strong> - Understand the channels for promoting yourself and how to use them</li><li><strong>Presentation skills </strong>- demonstrate how to present the best version of yourself to potential employers and get the job you want</li><li><strong>Resume, cover letter and your personal pitch</strong> - Understand what documents and tools you will need and how to prepare them </li><li><strong>Interview skills - </strong>how to prepare for interviews and give yourself the best chance of success in whatever you want to do</li><li><strong>Build confidence</strong> - in the transition from University to work</li><li><strong>How to choose your future</strong> - demonstrate simple step-by-step processes to help you work through want to do with your future, who to work for and in which industry.</li></ul>              <p><br></p><p>Use the various worksheets and checklists to prepare yourself for the best future you can imagine. Get the inside knowledge on interview processes and how to get yourself ready and confident. </p><p>This course is well presented with easy to follow lectures and simple supporting documents and reference materials. The comprehensive set of checklists and action plans are designed to help you achieve the best results possible for your future.<br></p>  <p>We know that you will gain huge value from this course, but if for any reason you are not entirely satisfied, this course has a 30 day money back guaranteed.</p>", 
    "end_date": null, 
    "title": "The ultimate guide to getting the Graduate job you want ", 
    "price": "50.00", 
    "instructors": "Unigrad Jobs", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728668_b16d_3.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-guide-to-getting-the-graduate-job-you-want/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T01:57:41Z"
}