{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t When it comes to learn how to face challenging situations, the available literature and resources teach how to use cognitive and mental strategies to develop Self-Confidence.\r\n</p>\r\n<p>\r\n\t   However, that is not enough.\r\n</p>\r\n<p>\r\n\t   Self-confidence starts in our bodies and is linked to our deep memory and non-verbal experiences we had as child.\r\n</p>\r\n<p>\r\n\t   If you just prepare yourself through mental strategies, you are very likely experience mental blanks, confusion and difficulties to organize your thinking when facing a challenging situation. You know that feeling when the answers seem to vanish from your mind no matter how much you have studied or prepared yourself for an exam or interview. This is a neurophysiologic process and to address it you have to work on a neurophysiologic level.\r\n</p>\r\n<p>\r\n\t  This course aims to teach you how to prepare yourself, from a neurophysiologic level, to face and succeed challenging situations such as exams and interviews.\r\n</p>\r\n<p>\r\n\t  With the techniques and information we teach in this course you will be able to make the best use of all your skills and knowledge.\r\n</p>\r\n<p>\r\n\t  The most important part in this course is practicing the exercises. They will make the difference. The more your practice, the more you will get results.\r\n</p>\r\n<p>\r\n\t  The course is structured in Video lectures, Quizzes and Self-Awareness activities.\r\n</p>\r\n<p>\r\n\t      Section 1: you will explore your own reactions;\r\n</p>\r\n<p>\r\n\t Section 2: you will learn about how your system reacts in a challenging situations;\r\n</p>\r\n<p>\r\n\t Section 3 I&#039;ll be more specific on how to address that.\r\n</p>\r\n<p>\r\n\t  If you want to improve you capacity of facing challenging situations and develop a embodied self-confidence, this course can really help you.\r\n</p>\r\n<p>\r\n\t  If you have deeper self-confidence issues you might need to get the help of a good psychotherapist, and this course will be of great support for your change.\r\n</p>\r\n<p>\r\n\t  This course talks about the body, this wonderful and still neglected resource, and how to use your body for your personal development.\r\n</p>", 
    "end_date": null, 
    "title": "The mastery of embodied self-confidence", 
    "price": "45.00", 
    "instructors": "Fernando Aguiar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99370_7023_8.jpg", 
    "course_url": "https://www.udemy.com/facing-exams-and-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-30T08:46:36Z"
}