{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>This course is a complete blueprint for landing a dream job teaching English in China.  I will guide you step-by-step into getting an easy-to-find, dream job lifestyle.</strong></p><p>You will...</p><ul><li><strong>HAVE TONS OF FREE TIME</strong> - you will find a position where you will only spend 14-16 hours per week on work...total!</li><li>Get over 200 days off per year</li><li>Work only 3-4 days/week (most of which are half days)</li><li>Get two, 2-month breaks off per year (over 4 months free per year)</li><li>Have a free apartment (say good-bye to paying rent &amp; utilities)</li><li>Travel the world</li><li>Make a difference and have a meaningful &amp; fulfilling job</li></ul><p>This is not a fantasy, it is so real and a <em>hidden gem</em>!  I've been doing this for years and have helped many of my friends to find their dream jobs.</p><p><strong>The best part of it all is that it is actually quite easy to find a position, you just need to know where to look. And I will show you.</strong></p><p> Simply put, there is tons of demand for foreign English teachers in China and not nearly enough supply. The schools don't know how to find teachers and most people outside China don't even know this dream job lifestyle exists.  Because of that, if you meet the basic requirements mentioned here and follow the instructions in the course, you will most likely be choosing between a variety of job offers and be living the dream job lifestyle in China in no time.</p><p><strong><br></strong></p><p><strong>How long will it take?</strong><br></p><p>It depends on how motivated you are to get to your dream job!  You will be guided through the entire process of deciding where you want to live, finding and contacting schools, accepting a position, getting your visa and transitioning into China.  The entire process can be done over a couple weeks or a few months, depending on how quickly you go through it and the time of year. It's really up to you and when the start date of your work is.</p><p><br></p><p><strong>When is the best time to take this course?</strong><br></p><p>You really can begin at any time. You could begin teaching in either the fall semester (starting in September) or the Spring semester (starting in late February or early March) and hiring goes on year-round because there is always great need (though peak hiring is March to August and November to December). It is even possible to be hired in the middle of the semester. So, the best time to start on this is <strong>right now</strong><strong>!</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "The Complete Guide to Landing a Dream Job Teaching in China", 
    "price": "20.00", 
    "instructors": "Prof. Richard Kronick", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563310_f109_4.jpg", 
    "course_url": "https://www.udemy.com/the-complete-guide-to-landing-a-dream-job-teaching-in-china/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T03:32:28Z"
}