{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Bodhih’s The  RABBIT HOLE APPROACH To Time Management workshop is probably the most unconventional time management workshop that you can find in the world today.</p>\n\n<p>It is a workshop that is packed with a divergent and radical cluster of time management approaches that will make you question the status quo, both from a universal as well as a personal perspective. Getting More Done, Having More Free Time, Living Effortlessly, Producing Results and Enjoying Life are all things that constantly figure on people’s wish lists. This workshop ensures that you tick those things from your wish list, with just a four hour time investment from anywhere you like. In keeping with the credentials that Bodhih carries of being an ISO organization certified by the elite German body TÜV SÜD and having produced results in the personal development space for over 1000 organizations across the world, this workshop is about practical application and learning through experience.</p>\n\n\n\n\n\n<p>It is structured in a manner that takes the learner from understanding what their current time paradigms are, to helping them think and work with time effortlessly and finally providing learners with step by step and applicable methods of bringing more time into their lives. This short yet intensive strategic time management course has been a life changer for learners across age groups and domains. It is the outcome of the shocking observation that the world is flooded with books and programs that talk about managing time and yet most people can’t seem to find the time to do the things that they love to do. Actual Methods Of Creating More Time, Using States Like Laziness And Peak States, Getting Out Of The Rat Race and Enhancing The Quality Of Your Life Effortlessly are just a few of the outcomes you will achieve through this program.</p>", 
    "end_date": null, 
    "title": "The RABBIT HOLE APPROACH To Time Management", 
    "price": "50.00", 
    "instructors": "Training Organization Bodhih Training Solutions", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834312_e7bb_3.jpg", 
    "course_url": "https://www.udemy.com/strategic-time-management/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-28T09:55:55Z"
}