{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><em style=\"\">Can I Show</em> You The Easiest Way To <strong style=\"\">Covert Use Hypnotic Methods</strong> That Are <strong style=\"\">SO</strong> Powerful You Can Instantly DROP A Subject Into An <em style=\"\">Unexpected</em> Trance In Moments !</p><p style=\"\">Imagine having the ability to use simple covert hypnotic tricks to illicit powerful conversational trances. This program is designed to show you what it takes to master <strong style=\"\">hypnotic memories</strong> and create hidden hallucination that your client can experience in seconds. You have at your finger tips a very secret and effective concept to either show people the power of hypnosis or use formally in a hypnotic interaction.</p><p style=\"\"><strong style=\"\">You will be introduced to :</strong></p><ol style=\"\"><li style=\"\">What is conversational hypnosis</li><li style=\"\">What is covert and hidden trances </li><li style=\"\">How to use conversational postulates to start the trance process</li><li style=\"\">How to adjust your VOICE to create unexpected trance on the spot</li><li style=\"\">How to master gathering attention so people hang off every word you say</li><li style=\"\">THE REVIV. memory method</li><li style=\"\">Eliciting powerful memories that a client can experienced as if were real again</li></ol>If you were looking for a simple and effective idea based on conversational hypnosis and are SICK of learning language patterns. THIS is for you. No language patterns will be needed.", 
    "end_date": null, 
    "title": "The Amazing Guide To Covert And Conversational Trance", 
    "price": "20.00", 
    "instructors": "Scott Jansen", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564846_67ca.jpg", 
    "course_url": "https://www.udemy.com/conversational-hypnosis-covert-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T04:02:42Z"
}