{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">“The Art of the Job Search&quot; is a course targeted toward</strong> corporate professionals (early, mid, and executive) who feel stuck in their current work, who want to make a career move, who are in between jobs, or who are looking to jump back into the workforce after a career break. You want to make a move, but you aren&#039;t sure where to start, you don&#039;t have a lot of time, or you just want a few ideas to launch your job search in the right direction. It doesn&#039;t matter what level you are in the working world. Whether you are a few years out of college, a working mom or dad looking for flexible work, or a mid-career professional or senior executive looking to for your next big opportunity – this course will help you Get Energized, Get Connected, and Get Hired.</p><p><strong style=\"\">In this course, you aren&#039;t just going to sit back and listen to the course. This is your personalized &amp; customized &#039;choose your own adventure&#039; job search. </strong>You can go deep on some modules, and skip others so you are focusing on what will make the most difference in your job search. Together, we will APPLY simple, proven and practical tools and techniques using your own downloadable interactive playbook designed to help you gain clarity in your job search, develop and pitch your market offering, network and interview like a pro, and navigate offers, and finally get hired. </p><p><strong style=\"\">You will use the proven and tested: Ideal Work Lab Get Hired Method as your roadmap.  This method has four parts: </strong></p><ul style=\"\"><li>Discover Self where we reflect your true self, understand work flow, design ideal work lanes, conquer roadblocks, and launch your best resume and LinkedIn profile</li><li>Go Explore we focus on finding your future work &amp; companies and describing your brand</li><li>Take Action is all about networking, strategically making offers in the hidden job market, and building experience</li><li>Get Hired we focus on interviewing, navigating offers, and on boarding</li></ul><p><strong style=\"\">At the end of the course, you will have greater clarity and confidence about what you offer the job market, you will feel powerful in networking and connecting in the job market, and these skills will help you not ONLY &quot;Get Hired&quot;, but also feel more energized, empowered, and engaged in work &amp; life.  </strong></p><p><strong style=\"\">What you get: </strong></p><ul style=\"\"><li><em style=\"\">Lifetime access to this career changing curriculum </em></li><li><em style=\"\">Free downloadable personalized workbook for all things related to job search - saving you time and increasing your efficiency in your job search </em></li><li><em style=\"\">Complimentary webinars </em></li><li><em style=\"\">Access to Ideal Work Lab extended community </em></li></ul><p><strong style=\"\">A Few Testimonials: </strong></p><p> <em style=\"\">&quot;Your advice to look at what we&#039;ve already done, and identify when and where and by what that spark of interest and energy ignited, and to build on that recognition instead of focusing forward into that fog--well, for me it&#039;s a whole new way of thinking.&quot; Wendy </em></p><p><em style=\"\">&quot;I participated in Kara&#039;s powerful e-course, “How to Discover, Invent, and Launch your Ideal Work &amp; Life&quot; several months ago and was thrilled with the content and online delivery. I am currently participating in the weekly &quot;Get Hired in 2015&quot; series and again, am impressed with the amount of helpful information that is provided in each session.&quot; Jo-Ann</em></p><p><strong style=\"\">Giving Back &amp; Paying it Forward: </strong></p><p><em style=\"\">A portion of the proceeds from this course will be donated quarterly to the non-profit: The Cara Program, based in Chicago, Illinois. The Cara Program has evolved as not only a best-in-class job training and placement provider for individuals affected by homelessness and poverty, but also a vehicle for true life transformation.</em></p>", 
    "end_date": null, 
    "title": "The Art of the Job Search", 
    "price": "50.00", 
    "instructors": "Kara Smith", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428132_31e3_15.jpg", 
    "course_url": "https://www.udemy.com/theartofthejobsearch/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T23:47:36Z"
}