{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><span style=\"\">Imagine yourself training small and large groups of people how to do what you do best. Your expertise will now be sold in the form of training experiences you deliver to clients in-person and virtually.</span></p><p style=\"\">  \t<span style=\"\">How to Be a Trainer</span>  </p>  <p style=\"\">  \tIn this &quot;How to Be a Trainer&quot; course you will learn how to conduct training sessions to help people build new skills or develop new areas of expertise. A good trainer mush be a good teacher, coach, public speaker and consultant. This course will teach you various aspects of the profession with special emphasis on how to conduct training sessions. The number one blunder most beginning trainers is dumping too much data in a boring manner to their students or trainees. A good trainer focuses on measurable results in terms of new skills and competences displayed by the trainees, not by how many boxes of content that can be checked off during a day.  </p>  <p style=\"\">  \tTJ Walker is the founding trainer of Media Training Worldwide. Walker has conducted thousands of media training, crisis communications training and public speaking training workshops all over the globe for 30 years.  </p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on July 30, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "The Training Business: How to Be a Trainer", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351128_effa_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-trainer/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T18:13:55Z"
}