{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><span><strong>Join One of the Web's Leading Professional Development Communities</strong></span></em></p><p><em>Course version 3.1 released August 15th, 2015</em></p>  <p>  \t<strong>Create an American Style Resume to <em>Win that Dream job</em> </strong>  </p>  <p>  \t<strong></strong>Looking to stand out from the crowd? You already know how transformational an opportunity with an organization like Google, P&amp;G, Facebook, and other mulitnational companies can be for your career (and for your life). In this project-based course, you'll move step by step through the process of creating an absolutely stunning resume for yourself. As a participant in the course, you'll get lifetime access to:  </p>  <ul>  \t<li>Beautifully produced video lectures presented in HD and designed by Eazl's team of recruiters, researchers, and animators based in San Francisco</li>  \t<li>A professional community led by former a former Bay Area Fortune 500 Recruiter Davis Jones</li>  \t<li>4 American-style resume templates used by people paying $1500/resume</li>  \t<li>A library of 20+ professionally-written and formatted resumes for candidates with a variety of backgrounds that you can use as you build your own resume</li>  \t<li>A downloadable <em>Power Language Tool</em> to help you design powerful resume content</li>  \t<li>A downloadable step by step resume building guide</li>  </ul>  <p>  \t<strong>  Lifetime Access to Frequently Updated Material  </strong>  </p>  <p>  \t                            This course is consistently updated by Eazl's San Francisco-based team. If you need to prepare for a job hunt in the future, you can instantly come back and access the highest quality, most up-to-date resume writing strategies right here. For life.  </p>", 
    "end_date": null, 
    "title": "The Resume Project: Build the Ultimate American Style Resume", 
    "price": "30.00", 
    "instructors": "Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325784_32e2_7.jpg", 
    "course_url": "https://www.udemy.com/bay-bridge/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T16:53:30Z"
}