{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Special Introductory Offer!!</strong></p><p><strong>**Updated October 2015**</strong></p><p>This course is designed to help you wake up to the gigantic world of Internet Business!  By using an Internet Business, we aim to accomplish freedom in three key areas: Income, Time, and Location.  When we achieve those three freedoms, we can overhaul our lifestyle to include doing things that we want to be able to do, with whom we want and where we want to do them.  </p><p>The Internet Business lifestyle allows us to escape the traditional 9-to-5 working pattern that robs us of time, motivation and happiness.  Rather, we learn how to build a business around things that we are good at doing and that we love to do, so work feels like play.  And when that change happens to the way we generate income, then life changes 100%.</p><p>This course will teach you how to reprioritize your life and become conscious of living your perfect lifestyle.  It will teach you about some of the millions of ways you can create an income online and use productive methods to get more done in less time.</p><p>You will learn how to spot ideas based on quick research, how to build a 12-step sales page that converts traffic to paying buyers, a blog plan to quickly add lots of content to your site, how to build a website in minutes using WordPress, how to spot best selling products on Amazon and Aliexpress, and more!</p>", 
    "end_date": null, 
    "title": "The Lifestyle Overhaul Course Intro To Home Based Businesses", 
    "price": "20.00", 
    "instructors": "Michael Naus", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575494_d0f6_2.jpg", 
    "course_url": "https://www.udemy.com/the-lifestyle-overhaul-course-building-internet-business-and-freedom/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T09:32:39Z"
}