{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is a <strong>must-take for any graduate ready to apply</strong> for a graduate program or for a recent graduate position. Internship applicants will also find it invaluable as you learn how to overcome the 12 hurdles of the graduate recruitment process.  What you learn will surprise and even shock you. <strong>Insider knowledge from an international graduate recruitment expert </strong>will help you overcome the hurdles to win your dream graduate job.</p>  <p>The course explains how employers go about graduate recruitment and what they really look for. It includes how they assess graduates and a <strong>detailed explanation of the 12 hurdles used by employers to screen out applicants.</strong> There are examples of questions and answers to the 8 most popular behavioral skills assessed by employers. There are self-assessment exercises to understand where you need to strengthen your application. And the course includes<strong> work around strategies to overcome the 14 most common graduate job application pitfalls</strong>. The course concludes with a 5 point personal action plan.</p>  <p>The course is more than two hours of insights, tips and insider knowledge from the leading international expert in graduate recruitment.<strong> You can pick and choose which modules that are relevant to you. You will learn</strong><strong> the secrets of employers</strong>.</p>  <p>The course structure is:</p>  <ul><li>Introduction</li><li>What Employers Look For and Why You Don’t Get Through</li><li>How Do You Rate?</li><li>12 Assessment Hurdles</li><li>Behavioral Questions &amp; Winning Answers   </li><li>Work Arounds</li><li>Personal Action Plan</li></ul>                <p>As a graduate or intern you should take this course to maximize your opportunity to get your ideal job. Whether you’re a top graduate looking for that edge in a highly competitive graduate program. Or a graduate who is unsure why they haven’t been successful and wants to turn that around. Or someone who needs insider help to get beyond first base and win that graduate job. </p><p>Competition for graduate roles is fierce.<strong> If you don't take this course, chances are your competitor has!</strong><span></span></p>", 
    "end_date": null, 
    "title": "The Insider's Playbook: Getting That Graduate Job", 
    "price": "25.00", 
    "instructors": "Peter Pychtin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650796_3418_7.jpg", 
    "course_url": "https://www.udemy.com/the-insiders-playbook-getting-that-graduate-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T01:31:03Z"
}