{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Unhappy with your work? Are you finding that it’s bleeding into your life? Looking for jobs, but keep running into dead ends? </p>  <p>Many people are in this situation. They feel that they have “peaked” in life and can’t move their career forward, so they settle to get by.</p>  <p>But those same people know that if they could just make $10,000 or $20,000 more a year they could improve their quality of life, pay the bills and not live paycheck-to-paycheck. Even more importantly, have money saved for a rainy day, for vacation, or to give back to their communities.</p>  <p>I am here to tell you DON’T SETTLE.</p>  <p>In fact, it’s been proven that feeling trapped at your job can lower your quality of life. I know this first hand. After years of working in retail I decided to make key changes in my life. After making these changes I started to notice doors were opening for me that I never saw before.</p>  <p>When I got my first corporate job where I didn’t have to work weekends, I was surprised. I was making over $33,000 extra a year. I was able to pay my bills and celebrated by taking my first vacation in years!</p>  <p>Now, I know this all sounds too good to be true but I promise you, it isn’t. The skills that I am going to teach you in this class are going to help you elevate your current abilities and gain some fundamental tools to help you become more marketable. </p>  <p>I teach people just like you how to gain the skill sets necessary to become a strong contender for better jobs in this three-step program: rewrite your resume, provide valuable interviewing skills, surefire techniques to impress your next employer.</p>  <p>What are you waiting for?</p>", 
    "end_date": null, 
    "title": "The Secret Formula On How I Double My Salary", 
    "price": "20.00", 
    "instructors": "Odian Levy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577244_f0ff.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-the-job-you-always-wanted/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T09:14:05Z"
}