{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Resume? I need no stinkin resume!</em></strong><br></p><p>As an entrepreneur you are not really seeking a new job. Having a resume can be critical for any professional. It can benefit particularly small business owners in order to be able to share their professional experience with potential clients and peers.</p>  <p>If you have a good business idea and are looking to start your own business, you need a business plan in order to get started. You should also have a resume written as if you are applying to be a business owner of the organization you wish to start. Your qualifications, career goals, education and prior experience should be aligned with your business. It can be a good complement to your business plan.</p>  <p>You will come in contact with vendors, independent contractors, and clients who will want to know your background. Your professional resume can be tweaked to show how the service you provide to customers and clients including metrics that show results.</p>  <p>You may have an opportunity to branch out into another business, start a new location of your existing business, partner with another company, or even have an opportunity to go work for a larger company in your field. It is best to have a prepared resume, and keep updating it or customizing it for specific audiences as necessary. </p>  <p>This course will show the importance of the resume for an entrepreneur in areas like:</p>  <p>Dealing with others as part of the business like potential investors and vendors</p>  <p>Finding freelance or part time work with fluctuations of income</p>  <p>Making the transition of becoming an entrepreneur or employee</p>  <p>The resume is a showcase of your skills and accomplishments. This course shows how the entrepreneur can showcase these in a resume.</p>", 
    "end_date": null, 
    "title": "The Entrepreneur's Resume: Resumes For Business Owners ", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691674_0d78.jpg", 
    "course_url": "https://www.udemy.com/the-entrepreneurs-resume-resumes-for-business-owners/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T02:50:22Z"
}