{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description</strong>\n\n  </p>\n\n<p>\n\n  </p>\n\n\n\n\n\n<p>Learn everything you need to know when attacking the technical interview, and getting that 15-20% raise!\n\n  </p>\n\n\n\n\n\n<p>In this course I will show you how you can exploit certain techniques interviewers aren’t aware of, so you can ace the technical interview.  We will talk in detail about building your technical resume, types of interviews you’ll encounter, interview preparation, techniques to use on technical interview day, post action steps, and much more.\n\n  </p>\n\n\n\n\n\n<p>I will thoroughly explain how technical interviewers think, and what types of questions they ask, this way you can easily pick them apart.  I even include an overview of my resume, and provide examples of how I would answer questions when being interviewed, based on my own experience when interviewing.\n\n  </p>\n\n\n\n\n\n<p>In this course you will also learn how to build your interview capital, and use psychological warfare as a tool to get them to be impressed by you.  I go into tips on how to change your mind, and thoughts regarding technical interviews. \n\n  </p>\n\n\n\n\n\n<p>Nothing is kept secret. I reveal all I know regarding interviews, and even put my resume on screen to go over it together… new lectures will be added to the course constantly – at no extra cost to you! This is a course that will continue to grow and grow.\n\n  </p>\n\n\n\n\n\n<p>Take this course now and learn from my 13+ years of experience both as an interviewer and someone looking for that 20% pay bump.  Avoid the most common pitfalls that plague those developers that go into an interview thinking they know it all</p>\n\n\n\n\n\n<p>\n\n  </p>\n\n\n\n\n\n<p><strong>You get:</strong>\n\n  </p>\n\n\n\n\n\n<p>1.      Unlimited access at no extra costs, ever\n\n  </p>\n\n\n\n\n\n<p>2.      All future additional lectures, bonuses, etc. in this course are always free\n\n  </p>\n\n\n\n\n\n<p>3.      There’s an unconditional pledge from me, never any questions asked full 30 day money back in full guarantee\n\n  </p>\n\n\n\n\n\n<p>4.      My help is always available to you if you get stuck or have a question – I make it a point to reply always\n\n  </p>\n\n\n\n\n\n<p><strong> </strong>\n\n  </p>\n\n\n\n\n\n<p>Can’t wait to see you in my course!\n\n  </p>\n\n\n\n\n\n<p><strong> </strong>\n\n  </p>\n\n\n\n\n\n<p><strong> </strong>\n\n  </p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The Technical Interview Preparation Workshop", 
    "price": "30.00", 
    "instructors": "Alex Luy, PMP, CSSLP", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/844832_ffdb.jpg", 
    "course_url": "https://www.udemy.com/technical-interview/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-10T10:09:29Z"
}