{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>We all face times in our lives where we have to make challenging, sometimes life-altering decisions. We might be choosing or switching careers, or picking a college major. We might be going through a divorce or other moment of crisis. Sometimes it can simply be recognition of a lack of fulfillment and purpose in our personal and professional lives.</p><p><strong style=\"\">Discover Your Passions and Your Ideal Career Using the Methods of the World&#039;s #1 Career and Job-Hunting Book, “What Color is Your Parachute?&quot;</strong></p><ul style=\"\"><li>Gain a new understanding of yourself, who you are, and the unique talents, skills and gifts you already have.</li><li>Be able to describe in detail what your ideal job would look like, and what are the gifts you have to offer the world.</li><li>Develop the ability to explain clearly to a prospective employer what makes you uniquely fitted to help them achieve their goals.</li></ul><p><strong style=\"\">Self Inventory as a Path to Employment and Career Fulfillment</strong></p><p>Too often, career search begins with looking for employment vacancies; scanning the job markets and trying to figure out how to best “fit in&quot;, writing a resume, searching employment ads, and replying and waiting for responses. </p><p>This is what I refer to as the “Traditional Method&quot; of career search. </p><p>But not all career search methods are created equal. In fact, as outlined in my book, most job hunters and career changers would be shocked to see just how ineffective the Traditional Method of job hunting really is. And when a job is acquired, too often that job isn&#039;t one that we find fulfilling, that truly aligns with our skills and knowledge and passions.</p><p>For over 40 years, I&#039;ve been offering an alternative – one that really works, one that has been helped up to 10 million people. And it all begins with the information in this course, which I call “self inventory&quot;.</p><p>Why would a career search start with self-inventory? It&#039;s simple, really - because the best answer to “What shall I do?&quot; flows from knowing “Who you are&quot;.</p><p>By the end of this course, you will have a new understanding of yourself, and your unique talents, skills and gifts. You will know what your ideal job looks like, to you. You will be able to explain clearly to an employer what makes you uniquely qualified to help them achieve their goals.</p><p>You will stop acting as a “job beggar&quot;, and instead will see yourself as a “resource&quot; – ready to search for the employer for whom you will already be a perfect fit. </p><p>You do need to know that you will need to do a lot of writing (or audio recording) of yourself. There is a lot of material here. There is a handout or exercise for each of this course&#039;s seven parts. This will take time, though you can do it in a week, if you do one unit each day. And it is important to do all the units in this course.</p><p>But if you stick with it, by the end of the course you will have a picture of who you most fully are. A picture of a job that will give voice to all you are. And where you would shine, because it uses the best of who you are.</p><p>And you will be well on your way to the career of your dreams.</p>", 
    "end_date": null, 
    "title": "The eParachute Introduction to Your Career and Job Search", 
    "price": "50.00", 
    "instructors": "Richard N. Bolles", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531602_2e59.jpg", 
    "course_url": "https://www.udemy.com/the-eparachute-introduction-to-your-career-and-job-search/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T20:24:18Z"
}