{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Imagine using natural unconscious signals and signs in the body to induce a deep hynotic trance in your clients with only conversation.  </p>  <p style=\"\">  \t  Do you realize that a subjects nerves , feeling scared and worried about hypnosis can be used as a door way into a trance quicker than when not used. Imagine hearing this from a subject &quot; I&#039;m nervous about going into hypnosis&quot; and knowing how to use this statement to put them into hypnosis before they could resist you. The ideas and method will show you an advanced way taught to beginners of how to induce trance in clients even if they resist you.  </p>  <p style=\"\">  \t  - In depth look into unconscious moments and sensation  </p>  <p style=\"\">  \t  - How to direct attention to allow trance to grow  </p>  <p style=\"\">  \t  - using unconscious signals to recognize trance  </p>  <p style=\"\">  \t  - Interacting with unconscious signals  </p>  <p style=\"\">  \t  - using powerful suggestions types to direct the therapy  </p>  <p style=\"\">  \t  - The echo and pause that only masters use and know  </p>  <p style=\"\">  \t  - How to deepen trance with no words  </p>  <p style=\"\">  \t  - How to create trance with no formal induction  </p>  <p style=\"\">  \t  - Utilizing nerves , fear and anxiety to help trance begin  </p>  <p style=\"\">  \t  - Testing your clients after hypnosis  </p>  <p style=\"\">  \t  - Attaching a positive therapy outcome to your trance work  </p>  <p style=\"\">  \t  - Proving to clients that hypnosis occurred  </p>  <p style=\"\">  \t  - Knowing exactly what to say when a client responds  </p>  <p style=\"\">  \t  - How to say less than formal hypnosis  </p>  <p style=\"\">  \t  If your a coach or therapist and get worried about when clients state they feel anxious or nervous this simple guide will show you what and how to deal with it .  </p>  <p style=\"\">  \t  never be stuck for what to do or say and by the end of this training you will hope that all your clients are nervous before they visit you  </p>", 
    "end_date": null, 
    "title": "The Untaught Master Hypnotist Secret", 
    "price": "20.00", 
    "instructors": "Scott Jansen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365470_8423_2.jpg", 
    "course_url": "https://www.udemy.com/spotting-unconscious-moments-to-trick-the-mind-into-trance/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T01:37:04Z"
}