{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is a complete guide in how to create your own training business from scratch.</p><p><strong>Since launch in September 2015, we have enjoyed many 5 star reviews.</strong></p><p><strong>So if you are looking for a new career, or want to reach your full potential in 2016, this course is for you.</strong></p><p>At the end of the course you will feel confident in opening your own training business and starting a new career.</p><p>We include a personal goal setting lecture to get you started with your professional and personal goals.</p><p><strong>We include</strong>:</p><p>Build your own training business from scratch for under $50, this is a complete A-Z guide, sharing our 20 years plus expertise and is our <strong>Platform one Virtual Services,</strong> Signature      e learning course.</p><p>Where to find your own clients and develop your unique brand, know how to negotiate and how to develop your unique unique selling points.</p><p>Learn the principles of how adults learn and how to create inspiring learning packages, what to charge and what contracts to get repeat business from.</p><p>Find the secret sauce that makes training enjoyable and effective, be confident in discussing clients needs, available solutions and walk the talk</p><p>Choose between e learning and face to face options, offer a blended approach to potential clients.</p><p>Share your expertise online and join the growing number of teachers, trainers and facilitators who have joined this growing industry.</p><p>Benefit from our 20 years plus experience in creating and delivering training, we are sharing our stories with you.</p><p>Start delivering training today with our off the shelf products</p><p>Become an authority on adult learning by studying our <strong>50 plus lectures</strong></p><p>Over four and a half hours of film and a wide variety of films, presentations, quizzes. cartoons, ebooks, work books and a project that takes you through the whole process.</p><p>We share everything we know about creating great training and how to deliver content both face to face and online!</p><p>If you have skills and knowledge of a niche area or wish to share your expereince, this course will show you how to gain an income from becoming a proessional trainer.</p><p>WE LOOK FORWARD TO WORKING WITH YOU, TO GROW YOUR BUSINESS!</p>", 
    "end_date": null, 
    "title": "Train the trainer, complete A-Z guide both online and class", 
    "price": "50.00", 
    "instructors": "Platform One Virtual Services", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585222_dde7_5.jpg", 
    "course_url": "https://www.udemy.com/create-and-build-your-own-training-business-for-under-50/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T09:52:56Z"
}