{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Getting a job can be really hard work – especially if you feel you haven't got the skills to make you stand out above the other applicants. </p><p><strong>*** Course updated January 2016***</strong><strong></strong><br></p><p>Or perhaps you've just left school or college and feel you haven't got enough experience to get the job you want.</p><p><strong>So how can this course help you change that?</strong><br></p><p><strong>First of all,</strong> you'll see exactly what is meant by transferable skills and then you'll find out exactly which skills employers most want. </p><p>This will help you focus on improving your own skills in those areas, giving you the edge in the job market</p><p><strong>You'll discover that you probably have a great many more transferable skills than you realize</strong> – you are using complex skills all the time, but because they are second nature, you don't consider them to be valuable.</p><p>In the course, you'll identify a list of skills you have gained from different areas of your life.</p><p><strong>Improving Your Skills</strong></p><p>Of course, while some of your skills will be at a high level, not all of them will be good enough for certain jobs. But it doesn't have to be difficult or expensive to get those skills to a higher level. You'll discover several simple ways in which you can develop your skills or gain new ones with little just a bit of free time and a few resources.</p><p><strong>What Skills Do You Need for Your Ideal Job?</strong></p><p>You'll  learn a quick and easy way to find out exactly which skills are needed for any job.</p><p><strong>Taking Action</strong></p><p>Once you know what you need to do, you can use the worksheets to  create your own action plan to develop all the transferable skills you need.</p><p><strong>Using Your Skills to Get a Job</strong></p>When your skills have reached the right level, you need to be able to show employers that you have got what it takes to do the job. Many people fall down at this stage – just writing that you are a great team player with excellent communication skills is meaningless – it's just your opinion. You'll learn to word your CV, resume or application in a way that will prove that you do have the skills, improving your chances of success in the job market.", 
    "end_date": null, 
    "title": "Transferable Skills: Boost your Confidence, Get a Better Job", 
    "price": "20.00", 
    "instructors": "Waller Jamison", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506902_34cb_2.jpg", 
    "course_url": "https://www.udemy.com/transferable-skills-boost-your-confidence-get-a-better-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T07:59:44Z"
}