{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul>  \t<li>Course Fully Updated on March 6th, 2015</li>  </ul>  <p>  \t                        In 2015, <strong>getting a job has never been easier</strong> and I'm here to show you how to get<strong> 3 - 6 interviews a week.  </strong>  </p>  <p>  \t                        Most people job hunt by applying online which is the <strong>worst possible way to find a job.</strong> But that's all most people know because we're simply <strong>never taught how top performing job hunters look for jobs.  </strong>  </p>  <p>  \t                        After I graduated university, I couldn't believe how <strong>hard</strong> it was to find a job. I spent hours upon hours everyday applying to jobs, writing emails, customizing cover letters and getting very little results.  </p>  <p>  \t                        But then an acquaintance told me something brilliant, <em>\"the people that find the best jobs are not necessarily</em><em> the ones that are the smartest or best qualified, they're the ones that know how to job hunt best.\"</em> They were right, and that one phrase changed my life completely.  </p>  <p>  \t                        I spent years in recruitment and HR, networked with the best career coaches, read all the top books on job hunting and researched everything I could get my hands on. I developed some amazing unique out-of-the-box job hunting strategies that worked quite well, but <strong>one strategy</strong> in particular had unbelievable results. Almost every student I worked with, no matter the background,<strong> was able to get 3 - 6 interviews within 72 hours</strong> if they simply followed the steps of this strategy.  </p>  <p>  \t                        This entire course outlines this exact job hunting strategy that has produced these incredible results.  </p>  <p>  \t                        It all revolves around<strong> bypassing HR, creating a powerful online first impression </strong>by using a variety of digital tools <strong>and applying directly to people who are responsible for hiring you.  </strong>  </p>  <p>  \t<strong>        You will be able to get 3 - 6 interviews a week after you watch this course</strong>, you simply cannot fail because it's so incredibly simple and effective. To ensure your success, I'm here for you, you don't have to do this alone. With the purchase of this course, <strong>I'll give you my cell phone number</strong> so you can always call me to chat. You can also email me and I'll respond within 24 hours or we can always set up a video conference call via Google hangouts.  </p>  <p>  \t                        I spend hours and hours answering emails and talking to my students on the phone. I get to help people everyday with my expertise and make a difference. I love what I do and I'm going to do everything I can and give you everything I got to make sure you succeed.  </p>  <p>  \t                  Have a wonderful day!  </p>  <p>  \t                  - Jerry  </p>", 
    "end_date": null, 
    "title": "Triple Your Job Interviews - My Huge Job Interview Secret", 
    "price": "25.00", 
    "instructors": "Jerry Jay Hunter", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369160_8c49_4.jpg", 
    "course_url": "https://www.udemy.com/triple-your-job-interviews/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T21:50:32Z"
}