{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong><em>Justificación del curso</em></strong>  </p>  <p>  \t   La situación actual de crisis económica internacional, presenta un panorama lleno de dificultades a la hora de encontrar empleo. Tanto si se trata del primer empleo, como si se trata de reincorporarse al mercado laboral o simplemente de aspirar a un puesto mejor que el actual.  </p>  <p>  \t <strong>Se dice</strong>, y con razón, <strong>que cada vez será más necesario disponer de una buena formación</strong>, pero <strong>qué valor tiene ésta si con frecuencia olvidamos aquellos otros aspectos que en todo proceso de selección de personal, y de forma consciente o inconsciente, nos señalan como candidato/a ideal</strong>, o por el contrario nos alejan de ese puesto de trabajo anhelado.  </p>  <p>  \t   La entrevista de trabajo, es el momento de mostrar tus mejores <strong>habilidades personales</strong>, tus <strong>destrezas comunicativas</strong>, en definitiva, es el momento de saber manejarse con eficiencia y poner en valor tu candidatura, ofreciendo una <strong>comunicación personal 100% acorde al objetivo, conseguir el puesto de trabajo</strong>.  </p>  <p>  \t<strong><em>¿Qué aprenderás?</em></strong>  </p>  <p>  \t   Para ello, a lo largo de este curso conocerás y dominarás todas las <strong>herramientas de Comunicación No Verbal que juegan un papel absolutamente clave en toda entrevista de trabajo</strong>, y que, en la mayoría de los casos, son dejadas de lado por los entrevistados, principalmente debido a su desconocimiento.  </p>  <p>  \t   Estas herramientas son:  </p>  <ul>  \t<li><strong>Lenguaje corporal</strong></li>  \t<li><strong>Protocolo personal</strong></li>  \t<li><strong>Imagen externa</strong></li>  </ul>  <p>  \t   Cada una de estas áreas se explican en secciones diferentes, profundizando en cada uno de los aspectos que las componen y en todo momento dirigidos al caso concreto de una entrevista de trabajo.  </p>  <p>  \t   Al mismo tiempo, en la última sección, y como complemento perfecto a las secciones anteriores, conocerás aquellas <strong>técnicas que te ayudarán a reducir el posible nerviosismo</strong> que te pueda producir acudir a una entrevista.  </p>  <p>  \t   El <strong>conocimiento y dominio de las herramientas de Comunicación No Verbal</strong> que se exponen a lo largo del curso, <strong>harán que la seguridad y confianza en ti mismo aumenten</strong> de una manera exponencial, <strong>y consecuentemente lo haga el poder de influencia sobre tu entrevistador.</strong>  </p>  <p>  \t <strong><em>¿Por qué Comunicación No Verbal?</em></strong>  </p>  <p>  \t   Porque es una realidad que el <strong>impacto que la Comunicación No Verbal</strong> tiene <strong>sobre el total de tu comunicación</strong> es de alrededor de un <strong>90%</strong>. El 10% restante es el impacto que tienen tus palabras. Es decir, <strong>cómo digas las cosas en una entrevista de trabajo, importa mucho más que lo que digas en sí</strong>.  </p>  <p>  \t<strong><em>¿Por qué realizar este curso?</em></strong>  </p>  <p>  \t  Porque <strong>no comunicar es imposible</strong>. Desde el minuto uno en el que aparezcas en el despacho o edificio donde se desarrollará la entrevista, tus movimientos, tus gestos, tu vestimenta, tu postura corporal, tu saber estar... estarán dando una información clave de ti, sin necesidad de que digas una sola palabra. Toda esta &quot;información silenciosa&quot; que transmites será determinante en la valoración y opinión que el entrevistador tenga de ti.  </p>  <p>  \t  Eres tú quien debe decidir qué imagen transmitir a tu entrevistador y saber qué herramientas de Comunicación No Verbal tienes que poner en marcha para conseguirlo.  </p>", 
    "end_date": null, 
    "title": "Tu Comunicación e Imagen Personal en una Entrevista Laboral", 
    "price": "35.00", 
    "instructors": "Marina Fernández", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67918_1971_11.jpg", 
    "course_url": "https://www.udemy.com/tu-comunicacion-e-imagen-personal-en-una-entrevista-laboral/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-22T08:23:46Z"
}