{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    Welcome to &quot;Turning your Passions into Paychecks&quot;<br style=\"\">  \t<br style=\"\">  \t  I designed this course to help you articulate your career goals and best compete for internships or jobs that blend financial rewards with social impact and environmental stewardship.  This course is designed to democratize access to top career advice.  This means I want to make top career advice accessible to professionals who can&#039;t afford to hire a good career coach, and to students whose career center staff might not be well-versed in 21st Century impact internships and jobs available beyond on-campus recruiting programs.<br style=\"\">  </p>  <p>  \t  This course is a blend of my career coaching experience at Brown University and at the Indiana University Kelley School of Business, as well as of the content development with my co-founder, Dr. Mark Albion (Faculty Founder of Net Impact) through our B Corps, More Than Money Careers:  </p>  <ul style=\"\">  \t<li><strong style=\"\">Week 1 and 2</strong> of this course will help you GET CLEAR by articulating your  own unique motivated skills, work/life priorities, as well as  prioritizing which passions you want to turn into paychecks.</li>  \t<li><strong style=\"\">Week 3 and 4</strong> will focus on helping you GET CONNECTED to the most  relevant resources and contacts based on the unique goals and passions  you have chosen to prioritize through the GET CLEAR portion of this  course. </li>  \t<li><strong style=\"\">Week 5 and 6</strong> will focus on helping you GET HIRED by gaining access to 21st Century job searching advice as well as insights from cognitive neuroscience to help you tailor your resume to fit  each job description, and how to convert applications into interviews  and interviews into offers.</li>  </ul>  <p>  \t     Throughout this course, you will be required to complete deliverables  and post them on the discussion board so you can receive feedback and  ideas on how you can make the process of turning your passions into paychecks faster and easier.<br style=\"\">  \t<br style=\"\">  \tPlease use the discussion area to post any questions or suggestions you might have!  </p>", 
    "end_date": null, 
    "title": "Turning your Passions into Paychecks", 
    "price": "50.00", 
    "instructors": "Dr. Mrim Boutla", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396122_fa55.jpg", 
    "course_url": "https://www.udemy.com/passions2paychecks/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-16T22:19:02Z"
}