{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ol><strong><em>\"Good introductory course or facilitation or how to me a more effective \nspeaker. Quality, actionable concepts and materials.  I appreciate the \nopportunity to add a badge to LinkedIn profile to demonstrate that you \nhave this marketable skill.\"</em><br>-Mi Tay<br><br>Learn how to earn more money by using skills you already have! </strong><br><strong><br>How? Public Speaking? Assertiveness training? Negotiation skill? <br><br>Even simpler: Facilitation.</strong><br><br>I have facilitated mid-to-large group events for well over 15 years, and have learned the secrets that pros use to communicate without fear, as well as persuade their audiences to change their beliefs and behaviors. I used these secrets to leverage the skills I already had and become a professional facilitator full time. <br><br>When I began almost 2 decades ago I thought that speech and debate would be a good way to start with this line of work- <strong>I WAS SO WRONG</strong>. I learned that debate and public speaking are an <strong>OK START</strong>- but not enough to change my audience's behavior<em>. </em><strong>ONLY FACILITATION </strong>engages an audience's attention in such a way that they change belief &amp; behavior.<strong><br></strong><br>In this course I will share with you the skills and principles that professional facilitators use. These tools will help <strong>YOU </strong>overcome hurdles at work, \nand get <strong>YOUR CAREER</strong> on track, potentially opening doors to you that were\n previously closed, and help <strong>YOU</strong> to communicate at work <em>with confidence.</em><em><br><br></em><em><strong>This course contains over 30 lessons</strong> <strong>and TWO HOURS </strong><strong>of video, worksheets, section review exams, activities, and challenges. </strong></em><br><br>There are 3 main sections, so that the course can be broken up and watched easily over the course of two days during an average commute to work and back, or continuously while on a flight. The activities, quizzes, and essays still require outside time- but should not take more than a total of one hour. <br><br><strong>AT THE END OF THE COURSE</strong><strong> YOU </strong>will receive an official Udemy certificate of completion to prove to your peers, managers, and recruiters that you are bettering yourself professionally, and prepared to help with the task of team/behavior building. <em>In essence, this is a sign that your professional arrow is pointing <strong>UP</strong>.<br><br></em><strong>To know if this course is right for you, ask yourself:</strong><br><li>Do you struggle with confidence in front of groups, even though you are an expert in your field? </li><li>Do you wish you knew a way to help peers listen to and understand your good ideas?</li><li>Do you sometimes fear the spotlight- even at times when your leadership is critical to your project's success?</li></ol><p>If you answered \"yes\" to any of these questions, then <strong>WHAT ARE YOU WAITING FOR?</strong> </p><p><strong>JOIN US and change your abilities- and potentially your job/career/life- for the better.</strong><br></p>", 
    "end_date": null, 
    "title": "Using Faciliation In Speaking And Engage Without Lecturing", 
    "price": "30.00", 
    "instructors": "Seth Estrada", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614340_31bb_3.jpg", 
    "course_url": "https://www.udemy.com/facilitation-in-speaking-and-engage-without-lecturing/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T01:17:54Z"
}