{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t          This is a wonderful course that is dedicated to your Core Values for your Dream Job. You start off this course with an inspirational quote by Marilyn Strong, author of the book &quot;Getting Paid to Pay Attention&quot;.  Next, you will learn what Values are and then study 39 Core Values for your Dream Job.  After this, you will complete an exercise to determine your Top 5 Core Values and then write a reflection based on this exercise.  The course is only about 30 minutes long and consists of 6 video tutorials.  Don’t let the length fool you; it’s packed with great information.  I hope you enjoy this wonderful course and the insightful exercises. Here is what you will find in this course:  </p>  <ul style=\"\">  \t<li style=\"\">an understanding of what Values are,</li>  \t<li style=\"\">a thorough investigation of the 39 Core Values needed for your Dream Job,</li>  \t<li style=\"\">various jobs that link to these Values,</li>  \t<li style=\"\">4 inspirational &amp; interactive exercises that will help you explore your Values,</li>  \t<li style=\"\">6 time-tested, dynamic, fun, creative, engaging, and insightful VIDEO TUTORIALS; approximately 30 minutes of information.</li>  \t<li style=\"\">Communication with other like-minded Dream Job Explorers on Udemy &amp; Facebook,</li>  \t<li style=\"\">E-mail support from David!</li>  \t<li style=\"\">Discounts off private coaching sessions with David!</li>  \t<li style=\"\">Discounts off future courses!</li>  </ul>  <p style=\"\">  \t      By the end of this course, you will have  </p>  <ul style=\"\">  \t<li style=\"\">understood what Values are,</li>  \t<li style=\"\">explored the 39 Core Values needed for your Dream Job,</li>  \t<li style=\"\">listed your Top 5 Core Values,</li>  \t<li style=\"\">written reflections on your Top 5 Core Values,</li>  \t<li style=\"\">understood why you must have these 5 Core Values for your Dream Job,</li>  \t<li style=\"\">be shown where to search for your Dream Jobs.</li>  </ul>", 
    "end_date": null, 
    "title": "Values For Your Dream Job", 
    "price": "20.00", 
    "instructors": "David Langer B.Ed", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287896_c60f_2.jpg", 
    "course_url": "https://www.udemy.com/values-for-your-dream-job/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T02:39:46Z"
}