{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>ULTIMA REVISIONE: GENNAIO 2016</strong></p><p><strong>UNISCITI A OLTRE 130 STUDENTI ITALIANI!</strong></p><p>------------------------------------------------------------------------------------------------------------</p><p><strong></strong></p><p><strong>Sei nervosa/o quando devi tenere una presentazione? Odi parlare in pubblico?</strong></p><p><strong>Quante volte hai perso un'opportunità per la tensione di parlare in fronte ad una platea?</strong></p><p>La paura di parlare in pubblico (glossofobia) è abbastanza comune (si, non sei certo la/il sola/o) e può seriamente affliggere i tuoi messaggi, il tuo prodotto e la tua carriera! La buona notizia è che chiunque può vincerla e diventare un oratore di successo.</p><p>Ho aiutato migliaia di persone negli ultimi 20 anni, ed in questo corso ora condivido quello che ho imparato. Un comodo video corso che puoi seguire quando vuoi, quante volte vuoi, in completa privacy.</p><p>Metti fine alla voce incerta, postura tremolante, sudore e notti insonni! Inizia un percorso che trasformerà un limite in una capacità. Tutti possono farlo, io incontrai esattamente gli stessi problemi quando iniziai a tenere presentazioni oltre 30 anni fa, so come ci si sente, ma so anche puoi superarlo e come farlo. </p><p>Otterrai:</p><ul><li><em>Accesso completo per tutta la vita</em></li><li><em>Tutti gli aggiornamenti futuri inclusi</em></li><li><em>Garanzia soddisfatti o pienamente rimborsato per 30 giorni - la mia promessa personale per il tuo successo!</em></li></ul><p><strong>Smetti di vivere le occasioni di parlare in pubblico come fonte di stress e cogli le grandi occasioni di comunicazione che ti possono offrire: trasforma la tensione nervosa in energia positiva!</strong></p>", 
    "end_date": null, 
    "title": "Vinci la paura di parlare in pubblico: tramutala in successo", 
    "price": "35.00", 
    "instructors": "Paolo Pelloni", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537198_1d6d_2.jpg", 
    "course_url": "https://www.udemy.com/vinci-la-paura-di-parlare-in-pubblico-tramutala-in-successo/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-25T16:39:29Z"
}