{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t            &quot;Talent + Technique  </p>  <p>  \t              Tracy, I love Udemy and constantly take different courses.   Yours is  my favorite course I&#039;ve taken so far.       Your delivery is so  engaging...the perfect example of the techniques you teach.      Udemy  should require all instructors to watch this course before filming their  first course!      Well done!&quot;  </p>  <p>  \t<strong style=\"\">&quot;Amazing Tracy, thank you.</strong>  </p>  <p>  \t        My goodness Tracy,  your videos are precious nuggets. I cannot sufficiently express my  gratitude; your videos have been useful, no question. I love your  conversational manner, your detailed voice techniques, and your relevant  examples. Rest assured I will be practicing your vocal exercises  everyday. Hopefully from now on, I&#039;ll be able to drive all my words  &amp; sentences to the END as I now know not to assume that my audience  knows what I know! The fact that you offer to critique your students&#039;  voice reflects on your passion for what you do and your unconditional  generosity. It is rare to find a teacher that has such a BIG HEART. I am  very touched; you are the best.  High quality videos, a highly experienced teacher, highly recommended!!  Thank you very much Tracy, Alex from Australia&quot;  </p>  <p>  \t  Want to create an engaging and dynamic voice on Video, Webinars and Podcast?  </p>  <p>  \t  Want to keep your listeners and viewers engaged until the end, leaving them wanting more and ensuring you will captivate them beyond measure?  </p>  <p>  \t  Do you find your voice sounding flat?  Maybe stiff and uninteresting?  </p>  <p>  \t  Every 90 seconds the viewer or listener can check out of watching or listening to you.  So it&#039;s essential that you captivate at every turn.  The voice, the most powerful and often times most underused instrument can do just that, captivate your audience so there is no question they will stay engaged with you.  </p>  <p>  \t        Voice Techniques for Video, Webinar, Podcast Success will teach you step by step exactly how to create an engaging  and dynamic voice that will keep your audience captivated even if they never see your face.  </p>  <p>  \t                    Voice improvement training is a set of techniques that once you learn them, you can apply to your speaking in videos, podcast and even real life pitches and presentations.  The result, a more engaging and interesting voice.  The key, learning the techniques so you know the steps and in turn deliver all voice content like a pro.  In this course you will learn technique that you can apply right away and other techniques that you can continue to work on for longer term, continued improvement.  </p>  <p>  \t                    This course, Voice Technique for Video, Webinar and Podcast Success is full of video trainings, audio trainings and pdf&#039;s that walk you step by step through each and every one of the vocal techniques that will have your audience engaged.  </p>  <p>  \t                    Many videos in the course also have documents that will help you learn and master the techniques with ease.  All of the material includes specific examples for you to follow and all of the training is delivered with a language that will make the steps easy for anyone to master.  </p>  <p>  \t                    The course will take several hours to complete, watching the videos.  The application of the technique can start immediately and the more you practice and apply the principles the faster the results will become a part of who you are.  You will see immediate results by just adding an element or two and a total transformation over time by adding in all the techniques the course delivers.  </p>  <p>  \t                    Everything is video now.  The statistics and research on video are astounding.  It does not matter if you are seen or not, the results must be captivating.  The voice is the most powerful weapon a person has, this course will teach you to use it effectively like never before.  Videos, Youtube videos, video training, courses, webinars, tele-seminars even podcast or live presentations, no matter what the medium, you will achieve dramatic impact after you&#039;ve studied this course.  </p>  <p>  \t                  The step by step training in this course includes:  </p>  <p>  \t                  Vocal variety  </p>  <p>  \t                  Pitch  </p>  <p>  \t                  Pacing  </p>  <p>  \t                  Speed Shifts  </p>  <p>  \t                  Volume  </p>  <p>  \t                  Volume adjustments  </p>  <p>  \t                  Articulation  </p>  <p>  \t                  Stress  </p>  <p>  \t                  Intonation  </p>  <p>  \t                  Script Delivery  </p>  <p>  \t                  Organic Delivery vs. Technique  </p>  <p>  \t                  Practicing  </p>  <p>  \t                  Preparation  </p>  <p>  \t                  and more...  </p>  <p>  \t                  Everything you need to create a captivating and engaging voice that will dramatically improve your relationships with others, your video presence and engagement and your income is included in these 60 lessons, with new material added on a regular basis and constant interaction with instructor.  </p>  <p>  \t                I update this course on a regular basis.  I have currently updated the course two times in November and December and have added a number of videos, pdf&#039;s and audios.  I will continue to update the course on a regular basis, adding more content and exercises for your success.  </p>  <p>  \t                I&#039;m always available in the discussions and via private message.  I&#039;m also happy to take a look at any of your video&#039;s and give you personal feedback on specific areas you can improve on.  </p>  <p>  \t                This course has a 30 day money back guarantee.  I&#039;ve been in this industry for many years and have developed a system that works.  However, because I&#039;ve been in this industry for years I have learned that some learners prefer different teaching styles.  I guarantee my work because I&#039;ve seen success after success over the years with my many private clients in numerous industries, all over the world.  </p>", 
    "end_date": null, 
    "title": "Voice Technique for Video, Webinar, Podcast Success", 
    "price": "50.00", 
    "instructors": "Tracy Goodwin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334422_1c80_3.jpg", 
    "course_url": "https://www.udemy.com/voice-technique-for-video-webinar-podcast-success/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T00:18:06Z"
}