{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Maybe you have never thought of leadership as a game before but consider that is exactly what it is. Just like any other game there are rules, players, and goals. You can easily measure the progress and you can certainly know when you are winning or losing. And just like any other game you can learn, practice and master it. </p><p>In this course I will teach you the basic rules and practices of becoming and being seen as leader. I will teach you the fundamentals. This is what you need to know in order to win. You can use what you learn here and apply it in order to be successful in any leadership goal or outcome. This course will no doubt empower any career path you decide to take. </p><p>By the end of this course you will be able to </p><ul><li>Know and cultivate the #1 thing you need to become an effective and successful leader</li><li>Influence, motivate, and inspire others</li><li>Be seen as a powerful and effective leader</li><li>Create meaningful relationships with powerful people</li><li>Get a clear picture of where you want to go and how to get there</li></ul><p></p><p>This will prepare you to do the big work ahead of you - I make sure you are ready and capable to achieve what you want.</p><p>This course is going to be most appealing to someone who is ready to step powerfully into their leadership and is willing to do the work necessary to do so. Someone who is interested in growing and expanding so they can be the best they can be. Someone who has a vision for themselves and their lives and knows they cannot do it alone. Understands the value of inspiring and influencing others. Someone who wants to take advantage of learning as a tool to empower themselves to become a powerful and effective leader.</p><p>The only thing that prepares you to being a leader is being a leader. There is no book you will read, no video to watch, or no program to attend. You can read about playing tennis but it is not until you get on the court with a racket in your hand and someone throwing you a ball will you understand how to play, get better, and master it. Unless you get out on the court and start doing the actions a leader does you will not be one.</p><p>Sign up now and become the leader you know you were born to be. </p><p></p>", 
    "end_date": null, 
    "title": "Win at the Game of Leadership!", 
    "price": "45.00", 
    "instructors": "Colleen Schell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456426_ce3a_4.jpg", 
    "course_url": "https://www.udemy.com/winleadership/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T03:52:57Z"
}