{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Everyone needs a job, but without knowing how to get your foot in the door, you will never be able to <strong>market your greatest commodity: yourself</strong>.  I have heard many say, \"I have applied for several jobs and never get an interview.\"  </p>\n\n<p>It all begins with your cover letter and resume.  While I do not always get the job, I have always gotten the interview, even over those more skilled than I. Why?  <em>Because resume writing is an art, and I have learned that art.</em></p>\n\n<p><em><strong>What you will learn</strong></em></p>\n\n<p>In just 27 short lectures, you will learn how to write, design, and format your resume in the best way possible to sell yourself.( Selling yourself is what you need to do daily: you sell yourself to your date, your boss, your child, your prospective employee, your friend, and even to yourself! )</p>\n\n<ul><li>General Knowledge: words to avoid, how to show your skills, and writing with flair</li><li>Content: what to include and what not to include, details to sell your skills, and how to write each section</li><li>Design and Layout: general guidelines, use of formatting, and samples</li></ul>\n\n<p><strong><em>Who should take this course</em></strong></p>\n\n<p>If you are just entering the job market or thinking about switching to a new field, but are unsure whether you can make it in a new market, then this course is for you!  It doesn't matter whether you have lots of experience or little to no experience in your desired field, you can make a resume to help you stand out. </p>\n\n<p><strong>Additional Services I provide</strong></p>\n\n<p>As an experienced educator, I know that everyone can benefit from individualized learning.  So with all my courses, I provide practice throughout the course where you can opt to receive <em>individualized feedback from me. </em> </p>\n\n<p>This course can be <em>tailored to fit your needs.</em>  If you just want to just listen to the videos, then you can.  But you also have the opportunity to practice your skills and/or receive feedback. </p>", 
    "end_date": null, 
    "title": "Writing the Resume: Get your Foot in the Door", 
    "price": "25.00", 
    "instructors": "Katie Chambers", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525494_d8d2_3.jpg", 
    "course_url": "https://www.udemy.com/tutorwithkatie-resumewritingcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T22:40:16Z"
}