{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t         \"Product Manager\"  </p>  <p>  \t                             It's the best role within a fast-growing technology company: think big about products, design user experiences, build product experiments, work with brilliant designers and engineers, and see your product change the lives of millions of people.  </p>  <p>  \t                          Do you have what it takes to get hired as a PM at Google, Facebook, Twitter, Yammer, or your dream company?  </p>  <p>  \t                              This course will dive into...  </p>  <ul>  \t<li>what Product Managers actually do in this world of lean, data-informed product development</li>  \t<li>how to frame your resume and prior experience to keep a recruiter's attention</li>  \t<li> and the thought process for real product management interview questions.</li>  </ul>  <p>  \t<strong>Five-star ratings across the board for this course. I am committed to helping you become a good product manager and land your dream job.</strong>  </p>  <p>  \t<strong>Ready to become a Product Manager?</strong>  </p>  <p>  \t \"<strong>Everything you need to know!\"</strong>  </p>  <p>  \t                      \"Jason's class is a very comprehensive overview of everything you need to know to apply and get hired as a product manager.  </p>  <p>  \t                        It really helps you understand what the position is about and what kind of responsibilities you can expect. It also prepares you for product management interviews and forces you to really think about interview questions.  </p>  <p>  \t                        I got a position as an Associate Product Manager a few weeks after I took this class!\" - Pauline M.  </p>  <p>  \t<strong>\"Honest. Well thought out. Great resource.\" </strong>  </p>  <p>  \t                     \"Jason does a fantastic job of providing insight to every aspect of successfully getting hired as a Product Manager. The practice interview (quiz) questions are exactly what everyone interviewing right now should practice.\" - Rahul C.  </p>  <p>  \t\"<strong>This course helped me get my first Product Manager role in SF\"</strong>  </p>  <p>  \t<strong>\"</strong>If you're interested in successfully transitioning into product management from a tech or non-tech background. This course will give you a robust and comprehensive lay of the land.  </p>  <p>  \t                    The course introduces you to the specific skills you need to succeed as a PM, the business language you need to be fluent in to communicate with key stakeholder and the interview questions you need to practice for your interview.  </p>  <p>  \t                    Jason's course helped me secure my first PM position at a mega digital publication company by providing hands-on experience in finding the right jobs, impressing the employer on the first impression, nailing the interview and even securing compensation well above what I would have expected!\" - Mohit B.  </p>", 
    "end_date": null, 
    "title": "You're Hired: How to Get a Job in Product Management", 
    "price": "25.00", 
    "instructors": "Jason Shah", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/89744_2760_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-job-in-product-management/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-08T17:12:09Z"
}