{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Updated  December 2015, setting goals for 2016!</p><p><strong>Start your new career in 2016 and become a successful event planner</strong></p><p>We are Leap Training and our aim is to create inspiring learning products that support people to take up new opportunities and get moving in new directions.</p><p><strong>Are you full of ideas and not sure where to start?</strong></p><p><strong>Do you want an additional income stream?</strong></p><p><strong>Considering the possibility of a new career as an Event Planner?</strong></p><p><strong>We are Leap training and we have over 1000 students currently studying this course on Udemy. We look forward to working with you!</strong></p><p>This course is an A-Z of how to become a confident event manager, so if you are looking for a new career or just want some new challenges this is the course for you.</p><p>Using a wide choice of inspiring  learning materials, including professionally crafted films, E Books, Power-point presentations and our three Leap Training, course tutors you will start your journey on planning and delivering your own event.</p><p>Event management or event planning is a growth business, that has small start up costs, follow our detailed guide and get started!</p><p>We consider how to plan, create great themes, manage the practicalities including how to sort out audio visuals and we spend time looking at where potential sources of income are.</p><p>We spend time looking at a step by step guide to promoting your event; utilising the best of on-line tools and your own natural networks. Event planning can cover products launch, party, music promotion, even a training course so the possibilities are endless.</p><p>So if you are looking for a new career or additional income streams becoming an Event Planner could next step.</p><p>We anticipate the course will take you over 2 hours to complete.</p><p>We have designed the course around an actual event that you need to deliver. So our toolkit of resources will support you in your journey. We have placed a specific emphasis on marketing your course and offer multiple solutions to get your event monetised.</p><p>Why choose a Leap training course?, as established educators we have worked alongside our event management colleagues to craft a course that both inspires and engages. Using the very best of event management tools as well as personal development tools like our Leap Training signature Career Workbook.</p><p>This course is designed for both newbies to event planning as well as existing event planners that are looking for new ideas.</p><p>Meet Jo our experienced event planner and learn her tips and guidance for beginners.</p><p>Covering all aspects of event planning we include over 40 mins of films plus a wide range of downloadable tools and documents.</p><p>Although we have used an example of planning and delivering a music event the training course will also be useful for any event planning, including weddings, training and party events.</p><p>Leap Training have over 2000 customers on Udemy and are looking forward to developing more courses that lead individuals onto new choices and opportunities.</p><p>Our courses are unique to us and are not available elsewhere</p>", 
    "end_date": null, 
    "title": "Your guide to event planning", 
    "price": "40.00", 
    "instructors": "Leap  Training Institute", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444720_fc89_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-plan-and-deliver-great-events/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T11:35:03Z"
}