{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p></p><p><span>You probably know that doing a job search involves things  like tweaking your resume, sharpening your interview skills, networking and  improving your LinkedIn profile.</span><br style=\"\"></p>  <p>But, as you can tell from the title, this program isn’t  about all those practical things you must do to find a new job.</p>  <p>It can’t be… not with section titles like “Get  Closer To The Divine” and “Access Your Inner Wisdom.” &nbsp;</p>  <p><strong style=\"\">Why You Need This Program</strong><span><br style=\"\"></span><span>It&#039;s true, you won&#039;t get advice on how many pages your resume should be or the best way to answer interview questions like, &quot;What&#039;s your greatest weakness?&quot; &nbsp;(Which is the kind of information I&#039;ve included in two books, hundreds of articles and my other career-related courses on Udemy.) &nbsp;Y</span><span>et, the holistic and  philosophical concepts in </span><em style=\"\">Your Job Search Is A Spiritual Journey</em><span> will  definitely speed results &amp; make your life more meaningful.</span></p>  <p>That&#039;s because when you have clarity, you speak with  more clarity about what you want, and people respond to you better because it’s clear to them what you want.</p>  <p>It’s also because when you emanate positive energy and  joyful intent, you become more attractive to others.&nbsp; They want to be around you.&nbsp; They want to help you.&nbsp; They want to hire you.</p>  <p>This program is meant to supplement your job search  efforts.&nbsp; The videos are all under 5  minutes long, so you can dip in and get some quick inspiration.&nbsp; Each section comes with exercises that are designed  to make the information more interactive and to help you process the concepts  at a more personal level.</p>  <p>During the program, you will see how to:</p><p></p><ul style=\"\"><li><span>Release and reframe the dissatisfaction from your past  or current employment situation</span></li><li><span>Use the practice of gratitude to your advantage</span></li><li><span>Gain clarity about your wants and needs in regard to  success</span></li><li><span>Quickly assess your own uniqueness</span></li><li><span>Think creatively about your options for doing  meaningful work in the world</span></li><li><span>Build some support for yourself during your job search  and the career path ahead</span></li><li><span>Get some easy-to-use tools to access your inner  wisdom and set your vision into motion</span></li></ul><p></p>  <p><strong style=\"\">Conscious Career</strong><span><br style=\"\"></span><span>Everything you go through in  your life, including your job search, is part of your spiritual journey.&nbsp; In this program, we will look at how you can  use your job search to open your eyes and see who you really are and what  you’re meant to be doing with your life.</span></p><p>This program is for you if want a &quot;Conscious Career&quot;... which means choosing and doing work that is in alignment with your authentic self. &nbsp;</p><p>And it&#039;s for you whether you are currently looking for a job or thinking of looking for something new. &nbsp;Either way, you will find inspiration and support to keep you moving forward.&nbsp;</p>  <p><strong style=\"\">Note:</strong>&nbsp; References are made to various spiritual  traditions throughout this course because it is recognized that many spiritual  roads lead to Divine Truth.&nbsp; No one  particular religion or philosophy is preferred or recommended.</p><p></p>  ", 
    "end_date": null, 
    "title": "Your Job Search Is A Spiritual Journey", 
    "price": 0, 
    "instructors": "Angela R Loeb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48424_ab4a_8.jpg", 
    "course_url": "https://www.udemy.com/your-job-search/", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-03T18:22:17Z"
}