{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t <em>Σημείωση: <br>\r\n\t </em><em>Η τιμή που αναγράφεται είναι σε δολάρια ΗΠΑ, ενώ το πραγματικό κόστος σε ευρώ είναι χαμηλότερο. </em>\r\n</p>\r\n<p>\r\n\t <em><br>\r\n\t </em>\r\n</p>\r\n<p>\r\n\t <strong>3+ ώρες σεμιναρίου, σημειώσεις, βεβαίωση παρακολούθησης μόνο με 36€ !</strong><br>\r\n\t <em>[ 49 δολάρια ΗΠΑ ~ 36 ευρώ ]</em>\r\n</p>\r\n<p>\r\n\t <strong>ΓΙΑΤΙ ΝΑ ΠΑΡΑΚΟΛΟΥΘΗΣΩ ΑΥΤΟ ΤΟ WEBINAR;</strong>\r\n</p>\r\n<p>\r\n\t Το βιογραφικό είναι το μόνο τμήμα της διαδικασίας εύρεσης εργασίας που <strong>εξαρτάται 100% από τον ίδιο τον υποψήφιο</strong>!\r\n</p>\r\n<p>\r\n\t Δεν μπορούμε να ελέγξουμε τη διαθεσιμότητα θέσεων, δεν μπορούμε να ελέγξουμε ποιος επιλέγεται για συνέντευξη, δεν μπορούμε να ελέγξουμε τι θα μας ρωτήσουν στη συνέντευξη. Μπορούμε όμως να ελέγξουμε την πρώτη εντύπωση που θα κάνουμε σε κάποιον εργοδότη ώστε να κερδίσουμε μία συνέντευξη.\r\n</p>\r\n<p>\r\n\t Ένα καλό βιογραφικό είναι το εισιτήριο που μας βάζει στον αγώνα εύρεσης εργασίας και θα μας οδηγήσει σε μία συνέντευξη. <strong>Ένα βιογραφικό σωστά στημένο και γραμμένο μπορεί να μας οδηγήσει στην κατάκτηση μιας θέσης εργασίας, ενώ ένα μέτριο βιογραφικό μας αποκλείει από τον αγώνα για τη διεκδίκησή της!</strong>\r\n</p>\r\n<p>\r\n\t Για να διεκδικήσει ένας υποψήφιος μία θέση εργασίας θα πρέπει να επικοινωνήσει τι διαφορετικό κομίζει που τον/την κάνει να ξεχωρίζει από το πλήθος των υπολοίπων υποψηφίων. Θα πρέπει το βιογραφικό να είναι μοναδικό όπως μοναδική είναι η προσωπικότητα και εμπειρία του καθενός. Θα πρέπει να σηματοδοτήσει τη μοναδική αξία που μπορεί να φέρει σε μία εταιρεία και την ικανότητά του να ανταπεξέλθει στις απαιτήσεις της θέσης που τον ενδιαφέρει - και θα πρέπει να το καταφέρει αυτό μέσα στα ελάχιστα δευτερόλεπτα που αφιερώνει ένας εργοδότης για την ανάγνωση ενός βιογραφικού!\r\n</p>\r\n<p>\r\n\t Για το λόγο αυτό η κάθε προσπάθεια για κάθε θέση πρέπει να είναι μοναδική ώστε να ξεχωρίσει από τους δεκάδες - συχνά και εκατοντάδες ή χιλιάδες - υποψηφίους!\r\n</p>\r\n<p>\r\n\t Ίσως ακούγεται υπερβολικό, αλλά αν το σκεφτούμε λίγο περισσότερο ίσως και να μην είναι: <strong>ένα καλό βιογραφικό μπορεί να ορίσει την ζωή μας, μιας και είναι αυτό που είτε θα μας ανοίξει το δρόμο προς μία θέση εργασίας είτε μπορεί να μας αποκλείσει από το πρώτο κιόλας βήμα</strong>. Και αυτό το πρώτο βήμα είναι απαραίτητο ώστε να βρούμε μία θέση εργασίας, να βελτιώσουμε τη ζωή μας τώρα και να χτίσουμε σιγά-σιγά και το μέλλον μας.\r\n</p>\r\n<p>\r\n\t Το όφελος που θα έχετε επενδύοντας 3 ώρες και 36€ είναι εξαιρετικά μεγάλο, μιας και θα είστε σε θέση να βελτιώσετε το βιογραφικό σας και να διεκδικήσετε με περισσότερες αξιώσεις μία θέση εργασίας.\r\n</p>\r\n<p>\r\n\t <strong>ΔΙΑΤΙΘΕΤΑΙ ΒΕΒΑΙΩΣΗ ΠΑΡΑΚΟΛΟΥΘΗΣΗΣ</strong>\r\n</p>", 
    "end_date": null, 
    "title": "Σύνταξη βιογραφικού (CV, resume)", 
    "price": "50.00", 
    "instructors": "Δημήτρης Διαμαντής", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35057_fe33_6.jpg", 
    "course_url": "https://www.udemy.com/resumewebinar/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-08T09:49:04Z"
}