{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>لماذا يحظى البعض بفرص مقابلات عمل بوقت أسرع وشكل آكبر من زملائهم الذين يتمتعون بنفس المؤهلات والخبرات؟ </p><p>كيف يصطاد مدراء موارد البشرية الكفاءات والخبرات؟ </p><p>إذا كان التوظيف هو لعبة ترويج، فكيف تروج لنفسك في سوق العمل؟ ما المستند الذي يخلق صورتك الذهنية في عقول مدراء الشركات؟ نعم ... إنها السيرة الذاتية.</p><p>تسمى باللغة العربية السيرة الذاتية وفي اللغة الإنجليزية الأمريكية Resume أو Bio Data أما في أوربا وبريطانيا فتدعى Curriculum Vitae ، استخدمت في الماضي للدلالة على ملخص لحرفيتك المهنية وخبرتك العملية ومؤهلاتك العلمية التي تساعد رب العمل على معرفتك مهنياً للحكم على مدى ملائمتك لمواصفات الوظيفة المطلوبة. أما حالياً يستدل بها مدير الموارد البشرية على مدى مقدرتك على الإنجاز المتميز لمتطلبات العمل بهدف إيصال الشركة للرؤية التي تطمح إليها وتحقيق الأهداف التي تصبو إليها.</p><p style=\"\">أنت بحاجة لمعرفة كيف تجيد التعبير الكتابي عن إنجازاتك (أو الإنجازات الممكن تحقيقها بفضل دراستك وشحذك لمهاراتك)، والتعبير عن مهاراتك وقدراتك ومواهبك بطريقة تميزك عن بقية المتقدمين للعمل.</p><p style=\"\">ستتعرف معنا على التحضيرات اللازمة لصياغة السيرة الذاتية، وعلى أنواع السير الذاتية، حيث يمكن تصنيف السيرة الذاتية من حيث المحتويات إلى ثلاث فئات رئيسية:</p><p style=\"\">الأولى: سيرة ذاتية تعرض تسلسل زمني لتاريخك المهني Chronological، حيث تبدأ من آخر خبرات عملك وتنتهي بأول عمل لك في سوق العمل. </p><p style=\"\">الثانية: سيرة ذاتية تركز على الدور الذي تسعى لتأديته في العمل Functional، حيث توجه نظر القارئ إلى ما يمكنك تأديته والقيام به في العمل. </p><p style=\"\">الثالثة: سيرة ذاتية تدمج ما بين التسلسل الزمني والدور الذي تسعى لتأديته Combined resume.</p><p style=\"\">ويتضمن البرنامج لشرح مفصل للعناوين الرئيسة المستخدمة في السير الذاتية مثل (بيانات التواصل معك، الأهداف، لمحة سريعة / إضاءات، فقرة الإنجازات Accomplishments، الجدارات Capabilities، الخبرة الوظيفية Employment، المؤهلات العلمية Education، المهارات Skills، الدورات التدريبية والمؤتمرات والندوات Training, Conferences, and Seminars، التراخيص والشهادات Licenses and Certificates، شهادات التكريم والشكر Honors and Awards، المؤلفات المنشورة Publications، المواهب Talents، العضويات Memberships، البيانات الشخصية Personal، العمل التطوعي Volunteer Work، والبيانات الأخرى Other، والمراجع References</p><p style=\"\">وسيتم إعطاؤكم عدة نماذج استرشادية، مثل: </p><p style=\"\">نموذج موجه لإظهار المهنية أكثر من الخبرة العملية</p><p style=\"\">نموذج موجه لإظهار الخبرة العملية مع سجل الإنجازات</p><p style=\"\">نموذج موجه لوظائف المشاريع/ المؤقتة/ مهام محددة</p><p style=\"\">إضافة إلى إمكانية تحميل كافة محتويات البرنامج التدريبي للفائدة في أي وقت وزمن</p>", 
    "end_date": null, 
    "title": "السير الذاتية: صياغتها وأنواعها واستخداماتها وعناوين أقسامها", 
    "price": "20.00", 
    "instructors": "Sobhi Akbik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473624_68b0_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-your-cv-arabic-languag/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-11T16:47:21Z"
}