{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    Presentation Skills are an essential aspect in the career life. Presentations are a type of verbal communication given by a person, the presenter, who stands in front of an audience to present and discuss a subject, thought, or an idea, using a variety of tools and mediums to achieve a certain objective. The course starts with an introduction about presentation. It explains the difference between presentation and speeches. As knowing the audience is a valued aspect in the equation of presentation, it clarifies the speaker/audience relationship; the nature of your audience has a direct effect on the content of the presentation. Then, coming to the practical part, it trains the students how to prepare the presentation in 5 steps and integrate the 3-E’s Model. The course offers an in-depth process of each of the five steps. After fulfilling the 5 steps, the course tells the student how to deliver it with confidence and professionalism. It also identifies and differentiates the different types of presenters. Furthermore, it demonstrates the difference between verbal and non-verbal communication. It recommends efficient and appealing tricks; text, design, colors, etc. Finally, it provides you with instructions of how to handle difficult questions.  </p>  <p>  \t  تعتبر مهارات العرض و التقديم جزء حيوي و أساسي في مجال العمل. ﺗﻌﺘﺒﺮ ﻣﻬﺎﺭﺍﺕ ﺍﻟﻌﺮﺽ ﻭ ﺍﻟﺘﻘﺪﻳﻢ ﺟﺰﺀ ﺣﻴﻮﻱ ﻭ ﺃﺳﺎﺳﻲ ﻓﻲ ﻣﺠﺎﻝ ﺍﻟﻌﻤﻞ. ﺍﻟﻌﺮﺽ ﺍﻟﺘﻘﺪﻳﻤﻲ: ﻫﻮ ﺃﻥ ﻳﻘﻒ ﺍﻟﺸﺨﺺ ﺃﻣﺎﻡ ﺟﻤﻬﻮﺭ ﻟﺘﻘﺪﻳﻢ ﻣﻮﺿﻮﻉ ﻣُﻋﻴﻦ ﺃﻭ ﻓﻜﺮﺓ ﻣﺎ، ﻭﻳﺴﺘﺨﺪﻡ ﻓﻲ ﺳﺒﻴﻞ ﺫﻟﻚ ﺑﻌﺾ ﺍﻷﺩﻭﺍﺕ ﻭﺍﻟﻤﻬﺎﺭﺍﺕ ﺣﺘﻰ ﻳﺘﻤﻜﻦ ﻣﻦ ﺍﻟﻮﺻﻮﻝ ﻟﻬﺪﻓﻪ. ﻳﺒﺪﺃ ﺍﻟبرنامج التعليمي ﺑﺘﻌﺮﻳﻒ ﺍﻟﻌﺮﺽ ﺍﻟﺘﻘﺪﻳﻤﻲ ﺛﻢ ﻳﺸﺮﺡ ﺍﻻﺧﺘﻼﻑ.ﺑﻴﻦ ﺍﻟﻌﺮﺽ ﺍﻟﺘﻘﺪﻳﻤﻲ ﻭ ﺍﻟﺨﻄﺎﺏ ﺍﻟﻌﺎﻡ. العروض التقديمية هي موضوعات قد يتم عرضها في مجال العلوم، إدارة الأعمال، أو الأمور التقنية. والجمهور في العروض التقديمية أكثر تخصصاً من الجمهور في الخطابات العامة. قد تستخدم العروض التقديمية عندما تقوم بشرح توقعاتك لحركة السوق في المُستقبل، عندما تُعطي تدريباً، أو عندما تمثل شركتك في مُعاملات تجارية، إلخ. علما بأن الجمهور جانب مهم في معادلة العرض التقديمي البرنامج التعليمي ﻳشرح ﺍﻟﻌﻼﻗﺔ ﺑﻴﻦ المحاضر ﻭ ﺍﻟحضور بالتفصيل و خاصة أن لطبيعة الجمهور تأثير مباشر على محتوى العرض التقديمي. يفصل البرنامج التعليمي بعض أنواع الجمهور الذين قد تقابلهم أثناء إلقائك للعرض التقديمي و طريقة التعامل مع كل نوع. ﻳﺄﺧﺬﻙ البرنامج ﺧﻄﻮﺓ ﺑﺨﻄﻮﺓ ﻹﻋﺪﺍﺩ ﻭ ﺗﻘﺪﻳﻢ ﻋﺮﺽ ﺗﻘﺪﻳمي ﺷﻴﻖ ﻭ ﻣﻤﺘﻊ ﻭ ﻣﻔﻴﺪ. ﺑﻌﺪ ﺍﺗﺒﺎﻉ ﺍﻟﺨﻤﺲ ﺧﻄﻮﺍﺕ ﻓﻲ ﺇﻋﺪﺍﺩ ﺍﻟﻌﺮﺽ ﻭ ﻧﻤﻮﺫﺝ ﺍﻝ3 ﺕ, ﻳﺸﺮﺡ ﺍﻟﻜﻮﺭﺱ ﻛﻴﻔﻴﺔ التقديم ﺑﻜﻞ ﺛﻘﺔ ﻭ ﺍﺣﺘﺮﺍﻓﻴﺔ. كما يوضح الأسباب التي تؤدي إلي التوتر من الحديث إلي الجمهور و كيفية التغلب عليها و كيفية الاسترخاء قبل القيام بالعرض. و يشرح خطوات لعمل بروفة ناجحة مثمرة. البرنامج يشرح أجزاء العرض التقديمي الناجح وما يجب و لا يجب وضعه في العرض. و يشرح أهمية المساعدات البصرية و كيفية استخدامها بمهارة. و كيف يمكن الحفاظ علي انتباه الجمهور أثناء العرض. ﺑﺎﻹﺿﺎﻓﺔ ﺇﻟﻲ ﺗﻮﺿﻴﺢ ﺃﻧﻮﺍﻉ ﺍﻟﻤﻘﺪﻣﻴﻦ ﺍﻟﻤﺨﺘﻠﻔﻴﻦ. ﺍﻟﻜﻮﺭﺱ ﺃﻳﻀﺎ ﻳﻔﺮﻕ ﺑﻴﻦ ﻟﻐﺔ ﺍﻟﺠﺴﺪ ﻭ ﻟﻐﺔ ﺍﻟﻠﺴﺎﻥ. ﻭ ﺍﺧﻴﺮﺍ, ﺍﻟﻜﻮﺭﺱ ﻳﻌﺮﺽ ﻟﻚ ﺑﻌﺾ ﺍﻟﺘﻮﺻﻴﺎﺕ ﻣﻦ ﺃﺟﻞ ﺗﺤﺴﻴﻦ ﺍﻟﻌﺮﺽ: ﻣﺜﺎﻝ ﺍﻟﻨﺺ, ﺍﻷﻟﻮﺍﻥ, ﻭ ﺍﻟﺘﺼﻤﻴﻢ, ﺇﻟﻲ ﺃﺧﺮﻩ ﺛﻢ ﻳﻮﻓﺮ ﺑﻌﺾ ﺍﻟﻨﺼﺎﺋﺢ ﻟﻤﻮﺍﺟﻬﺔ ﺍﻷﺳﺌﻠﺔ ﺍﻟﺼﻌﺒﺔ و ماذا إذا كنت لا تعرف الإجابة أو لم يكن لديك وقت كافي للإجابة علي جميع الأسئلة.  </p>", 
    "end_date": null, 
    "title": "مهارات العرض و التقديم", 
    "price": "25.00", 
    "instructors": "Tatweer International", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295721_d159_3.jpg", 
    "course_url": "https://www.udemy.com/giving_successful_presentations_ar/", 
    "currency": "USD", 
    "subject_name": [
        "Career Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-07T10:05:51Z"
}