{
    "selfpaced": false, 
    "topic_name": [
        "Nutrition & Wellness"
    ], 
    "description": "\n\n                    \n                    \n                    20% of the global population has a disability, which means most of us will have an experience of disability in our lives, whether it be personally, through our family and friends, or in our workplaces and communities. But what is disability?  It’s often assumed that people with disabilities can’t have a good life. But what is a good life?\n\nIn this course, and its sister course Working with Disability, we’ll reflect on how disability is part of who we are as human beings. These courses will give you and your fellow learners the opportunity to think through and work with some of the big issues facing societies, governments and disabled people.\n\nView or download the course trailer video with audio description\n\nThink through disability\n\nWe know that the way we think about and understand things shapes the way we act. In this course we’ll explore the ways disability is understood and challenge you to think about what it means to have a good life.\n\nTo begin, you will reflect on what a good life means for you and hear from other people with and without disabilities about their views on what a good life means for them. As you move through the topics, you will engage in thinking about and discussing contemporary disability issues such as disability politics, history and disability across the life course. At the end of the course we will challenge you to consider how a good life might be enabled for all.\n\nLearn in a variety of ways\n\nIn this free online course, you can choose your pathway through the materials. Resources and strategies to support your learning include:\n\n\n  written, audio and visual resources (transcripts and audio descriptions/files provided)\n  stories from people with disabilities\n  interviews with leading disability studies experts\n  Talking Points to help guide online comments\n  a glossary of terms\n  a Learner Guide, Mel, who will show you how she has worked through the course material\n  an opportunity to take your learning further through activities to extend and expand your knowledge.\n\n\nWe encourage you to work through the course week-by-week in order to participate fully in the class discussions. However, once you enrol, materials will continue to be available to you after the course officially ends, so that you have the option to work at your own pace.\n\nWe also hope to hear from you. As we strive to improve the course and enable ease of access for all, we have multiple opportunities for you to provide feedback about the accessibility of the materials and the effectiveness of the course design.\n\nGain vital skills and knowledge\n\nBy the end of this course you will be able to:\n\n\n  identify how understandings of people with disabilities have changed over time\n  critically reflect on changing understandings of disability\n  identify core concepts in the social understanding of disability\n  appreciate the intersections between individual, social, political and cultural aspects of disability\n  understand what a good life might mean for a diversity of people, including people with disabilities.\n\n\n\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Disability and a Good Life: Thinking through Disability", 
    "price": 0, 
    "instructors": "Louisa Smith, Kelley Johnson and Leanne Dowse", 
    "institution_name": [
        "University of New South Wales"
    ], 
    "commitment": "5 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/thinking-through-disability?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-16T00:00:00Z"
}