{
    "selfpaced": false, 
    "topic_name": [
        "Nutrition & Wellness"
    ], 
    "description": "\n\n                    \n                    \n                    In the last few decades physical exercise has become well established as a tool to prevent and treat disease. Perceptions within the healthcare sector of exercise and its prescription as a treatment have changed dramatically in recent years.\n\nUnderstand the evolution of exercise prescription and its use today\n\nIn this free online course evidence of the role of exercise in the treatment of a variety of clinical populations including people with cardiovascular disease, mental health problems, paediatric conditions and cancer will be studied.\n\nOver two weeks discover the benefits of exercise in both preventing and treating diseases and enhance your confidence in exercise prescription as a treatment.\n\n\n  \n    Week 1: Explore research on the benefits of physical activity; the evidence that has informed exercise prescription guidelines and safety considerations.\n  \n  \n    Week 2: Learn how physiological adaptations to exercise translate to improved health outcomes and the evidence that supports exercise prescription in several common clinical populations.\n  \n\n\nLearn with physiology and physiotherapy experts\n\nThroughout the course there will be an opportunity to engage with researchers, healthcare professionals and exercise prescription experts from the Discipline of Physiotherapy at Trinity College Dublin.\n\n\n                                    ", 
    "end_date": "2016-06-20T00:00:00Z", 
    "title": "Exercise Prescription for the Prevention and Treatment of Disease", 
    "price": 0, 
    "instructors": "Aine Kelly and Cuisle Forde", 
    "institution_name": [
        "Trinity College Dublin"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/exercise-prescription?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}