{
    "selfpaced": false, 
    "topic_name": [
        "Nutrition & Wellness"
    ], 
    "description": "\n\n                    \n                    \n                    \r\nEver wondered what really makes a healthy diet? In Food, Nutrition &amp; Your Health you will learn the basic concepts of nutrition, as well as how to follow a diet that will protect you from various health problems.\r\nStarting with the building blocks of basic nutrition, you will learn how these can impact your digestion, energy and health. Find out how eating disorders develop, including the genetic, cultural and psychological factors involved. Finally, you will learn about various diets, including the social and biological factors that have contributed to their evolution.\r\nWhat will I learn?\r\n\r\nAn outline of the chemistry of the basic nutrients, how they are ingested, digested, absorbed and finally egested\r\nVarious ethnic and geographic factors relating to diet\r\nWhat metabolism is and how food is utilised to build up body tissues\r\nHow the body is affected by:\r\n\r\nUnder-nutrition\r\nOver-nutrition\r\nObesity, and how it contributes to morbidity and mortality\r\n\r\nThe biological and psychological factors responsible for abnormal eating patterns\r\nThe characteristics of anorexia and bulimia\r\nThe various other eating disorders commonly observed\r\nThe underlying nutritional fallacies of some of the fad diets\r\nAn understanding of why some diets are good and what the nutritional and health benefits of these are\r\nHow to construct a healthful menu\r\n\r\nThis course requires approximately 2 - 4 hours of study per week, but can vary depending on the student. This includes watching videos, and taking quizzes and assessments.\r\nIf you pass this course you'll receive a Certificate of Achievement. While this certificate isn't a formal qualification or credit, you can use it to demonstrate your interest in learning about this area to potential employers or educational institutions.\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nDietitian\r\nFood service manager\r\nMedical nutritional therapist\r\nNutritionist\r\nWorkplace health adviser\r\nCommunity health adviser\r\nHealth program manager\r\nHealth promotion practitioner\r\nPublic health nutrition policy adviser\r\nAllied health assistant\r\nFood service professional\r\nDietary assistant\r\nNutrition assistant\r\n\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: BASIC NUTRITION\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: DIETARY INTAKE\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: EATING DISORDERS\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: HEALTHFUL NUTRITION\r\n\r\n\r\n\r\n\n                                    ", 
    "end_date": "2016-02-08T00:00:00Z", 
    "title": "Food, Nutrition & Your Health", 
    "price": 0, 
    "instructors": "Dr. Nicholas Vardaxis", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.open2study.com//node/1781", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open2Study"
    ], 
    "start_date": "2016-01-11T00:00:00Z"
}