{
    "selfpaced": false, 
    "topic_name": [
        "Nutrition & Wellness"
    ], 
    "description": "\n\n                    \n                    \n                    This free online course will help you understand the scientific basis of human nutrition, and current nutrition concepts and controversies.\n\nIt draws on world-leading nutrition experts, to demystify the complex and often conflicting messages we hear about diet and health from sources like the media, food industry and scientific community.\n\nMake informed choices about your own diet and wellbeing\n\nYou’ll gain the skills to evaluate nutrition information from varied sources, and apply that knowledge to make informed choices about your own lifestyle, diet and wellbeing.\n\nEach week, we’ll look at a different theme:\n\n•\tThe makings of a ‘healthy diet’: What are the principal constituents of food? Which components of your diet can promote wellbeing and reduce the risk of diseases?\n\n•\tWhy do we eat what we eat? What are the ‘drivers’ that influence our food choices? How do we make sense of available nutrition information?\n\n•\tFood and disease: Can you really eat your way to health?\n\n•\tNutrition fads, myths and the plain truth: Is there such a thing as a ‘miracle’ diet? Do ‘superfoods’ exist? Or are our genes to be blamed for our current nutritional habits?\n\nLearn with nutrition experts and share your own experiences\n\nYour guides for this course will be nutrition experts from the University of Aberdeen, who will provide the most up-to-date, science-based information. You will also draw on your own experiences, and share hints and tips with other learners through course discussions.\n\n\n                                    ", 
    "end_date": "2016-10-03T00:00:00Z", 
    "title": "Nutrition and Wellbeing", 
    "price": 0, 
    "instructors": "Alex Johnstone and Alex Mavroeidi", 
    "institution_name": [
        "University of Aberdeen"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "http://www.futurelearn.com/courses/nutrition-wellbeing?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-05T00:00:00Z"
}