{
    "selfpaced": false, 
    "topic_name": [
        "Nutrition & Wellness"
    ], 
    "description": "\n\n                    \n                    \n                    Alguna vez te preguntaste: ¿por qué se hinchan los pies después de una boda?, ¿Cuánta agua hay que beber al día?, ¿cuánta agua es demasiada?, ¿Por qué beber agua era una forma de tortura en la edad media?, ¿Cómo terminar un maratón sin deshidratarte?, ¿Por qué los médicos pueden llegar a prescribir dietas pobres en frutas y verduras?, ¿Debes tomar suplementos de fósforo para la memoria?, ¿Cómo retrasar el envejecimiento?, y, sobre todo…  ¿por qué murió el campeón del concurso de bebedores de cerveza?\n\nEste curso es una introducción a la fisiología (funcionamiento normal) y patología (enfermedades) de los riñones: Comenzando con los mecanismos que mantienen el equilibrio del agua, de la sal, del potasio, del fósforo, de la vitamina D, de la eritropoietina (si, esa, ¡la EPO de los escándalos del deporte!) y, sobre todo, de la hormona antienvejecimiento Klotho, el curso te permitirá conocer mejor el funcionamiento de los riñones y aplicar estos conocimientos a tu vida cotidiana.\n\nNo son necesarios conocimientos previos de Medicina. Acompáñanos en este viaje a la fisiología renal y su impacto sobre la salud y la enfermedad.\n\n                                    ", 
    "end_date": "2016-04-26T00:00:00Z", 
    "title": "Renal701x: Fisiopatología renal y enigmas de la vida cotidiana", 
    "price": 0, 
    "instructors": "Alberto Ortiz Arduan and Maria Vanessa Perez Gomez", 
    "institution_name": [
        "Universidad Autónoma de Madrid"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.edx.org/course/fisiopatologia-renal-y-enigmas-de-la-uamx-renal701x", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-03-01T00:00:00Z"
}