{
    "selfpaced": false, 
    "topic_name": [
        "Nutrition & Wellness"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/meatweeat\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/meatweeat-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    meatweeat-001\n                                                                    meatweeat-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    The average American is now at least three generations\nremoved from production agriculture. \nThis leads to the disconnection between how the public views agriculture\nand how scientists and producers view it, resulting in consumer distrust of\nscience and commercial food production. \nIt is this lack of trust which leads to consumer confusion and the urge\nto grasp at multiple solutions.  However\na growing number of consumers in developed countries are aspiring to “know\nwhere their food comes from”.  Animal agriculture\nneeds to explain the technology which will be used to sustainably feed 9\nbillion people by 2050. \n\nLectures will cover all aspects of muscle foods production,\nprocessing, preparation, cooking and storage. \nAdditionally, the role of muscle foods in a balanced diet will be\naddressed as will issues which contribute to consumers limiting or eliminating\nmeat from their diets.\n\n                                            Syllabus\n                        Week 1: U.S. history, production systems, and comparison\nwith international systemsWeek 2: Humane slaughter and muscle compositionWeek 3: U.S. inspection and food safety Week 4: U.S. grading, fabrication, bulk purchasing, and\npackagingWeek 5: Palatability, cooking &amp; processingWeek 6: The healthfulness of meat in the diet, growth\npromoting technologies &amp; sustainabilityWeek 7: Final Week - work on peer evaluations\n                                    ", 
    "end_date": "2015-06-08T00:00:00Z", 
    "title": "The Meat We Eat", 
    "price": 0, 
    "instructors": "Chad Carr", 
    "institution_name": [
        "University of Florida"
    ], 
    "commitment": "5-7 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/course/meatweeat", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-04-20T00:00:00Z"
}