{
    "selfpaced": false, 
    "topic_name": [
        "Nutrition & Wellness"
    ], 
    "description": "\n\n                    \n                    \n                    The New Nordic Diet is a new food culture developed in 2009-13 with key emphasis on gastronomy, health, and environment. Major research in its effect on acceptability, behaviour and learning skills, and disease prevention have been conducted by the OPUS centre at the University of Copenhagen and the people behind the award-winning restaurant Noma in Copenhagen.\n\nThis course will give the participants the opportunity to experience a healthy and palatable new food and eating concept diet “The New Nordic Diet” and an understanding of how food and diets can affect mental and physical health and ensure the foundation for a healthier life style for future generations with a regional based diet and food culture.  \n\nIn Denmark “the Nordic cuisine”, has expanded from food eaten at the award-winning Copenhagen restaurant Noma to home-made dishes of local ingredients of whole-grain rye bread, root vegetables, berries, fresh fish and seaweed.\n\n                                            Syllabus\n                        Developing a New Meal SystemIn this first module you will be introduced to The New Nordic Diet project. You will hear about the background for this project, the definition of the signatures and principles behind which are considered to be fundamental of this new meal system. \n\nThe New Nordic Diet is based on Nordic ingredients, at the same time taking account of the, health and well-being of the individual and environmental sustainability. Also the pleasure of eating and challenges for accepting new healthy components of a New Nordic Diet will be illustrated. Based on these principles leading chefs working with the Nordic kitchen and academic staffs from our university will guide you through this module’s lectures.The OPUS School Meal StudyIn this module we will investigate how the OPUS School Meal Study was designed and how the investigators examined the effect of the New Nordic Diet school meals on the well-being, development academic performance, body composition as well as their risk of developing lifestyle diseases such as type 2 diabetes, osteoporosis and cardiovascular diseases. The study compared the New Nordic Diet with the current situation in schools (packed lunch from home and/or school canteens/small shops etc.).The OPUS Supermarket InterventionIn this module, we'll be looking at the effect of New Nordic Diet on adults. We will study the effect of eating the New Nordic Diet (NND) and an Average Danish Diet (ADD), respectively, in terms of body weight, body composition (fat) and risk factors for cardiovascular diseases and type 2-diabetes. You will learn about problems, barriers and benefits associated with two types of diet, focusing in particular on shopping, cooking and eating, meal structure and diet composition. Moreover, drop-out rate and the subject’s compliance with the principles behind the diet are discussed. \n\nInvestigate the New Nordic Diet – from Food to HealthIn this last module's lectures we will concentrate on the health of the New Nordic Diet, focus on the effects published so far from four different studies and on the potential factors and foods affecting the outcomes. \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "The New Nordic Diet - from Gastronomy to Health ", 
    "price": 0, 
    "instructors": "Arne Astrup", 
    "institution_name": [
        "University of Copenhagen"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Health & Medicine"
    ], 
    "course_url": "https://www.coursera.org/learn/new-nordic-diet", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}