{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">Instructor Info</strong></em>  </p>  <p>  \t  Corazon Bryant always had an artistic bone in her body. When she was only 2 years old, she would make detailed drawings on her mother&#039;s wall. Her mother loved the drawings so much, she decided to keep them. With the encouragement of her mother, she continued drawing and she only got better as time when by. When Corazon was in middle and high school, she earned money making portraits for her classmates and even for her teachers. She pursued a college degree in Media Arts &amp; Animation and later worked for architectural and entertainment companies such as Camm Productions, ID DI Design, and PDT International. She also had an opportunity to do some freelance work for Mega Pickle Entertainment. While working as a 3D artist, she had a chance to teach 3D animation classes in an A+ school. This is when she found her true love - which is not only to talk about 3D endlessly but to also inspire greatness in young upcoming artists. Corazon is currently working on a new project called Victory 3D with fellow industry-experienced artists to provide an affordable and effective learning system that will make it easier for students to get a job in the 3D industry.  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Course Info</em></strong><br style=\"\">  </p>  <p>  \t  Are you curious about how realistic 3D characters like Gollum from the movie Lord of the Rings are made? Have you ever played a video game with outstanding graphics and wondered how such detailed characters are created? Are you currently going to school right now but want to speed up your learning curve so you can get ahead of your peers? Are you a traditional artist and want to apply your sculpting skills digitally? Do you want to know about the latest 3d industry workflow and become a better 3D artist?  </p>  <p>  \t      If you answered yes to any of these questions, then &quot;3D Character Creation: Sculpting in Zbrush&quot; is the course just for you.  </p>  <p>  \t      In this amazing course, professional 3d artist/instructor Corazon Bryant will show you how to use the brushes in ZBrush to create believable muscle structure and anatomy. You will then move on to sculpting folds and wrinkles for your character&#039;s cloth. Corazon will discuss the characteristics of cloth and show you her technique on adding fabric details. You will also gain knowledge on building armor with wear and tear just like you see in video games and movies. Main tools that will be used are Dynamesh, Extract tool, Layers, Deformation, Panel Loops, Polygroup, Masking, and Transformation tools.  </p>  <p>  \t      By the end of this course, you will be able to create your very own 3D character from scratch. Have fun with this tutorial and there will be more to come from Victory 3D!  </p>  <p>  \t      Please like us at www.facebook.com/victory3d<br style=\"\">  \t   Sign up for our newsletter and be the first to know about our newest tutorials by going to www.victory3d.com  </p>", 
    "end_date": null, 
    "title": "3D Character Creation: Sculpting in Zbrush", 
    "price": "20.00", 
    "instructors": "Victory 3D", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207382_c6bf_3.jpg", 
    "course_url": "https://www.udemy.com/charactersculpting/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T17:58:55Z"
}