{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t         Welcome to 3DTraining.com&#039;s Quick Start Video Series: If you are a beginner looking to learn Autodesk 3ds Max, these videos will give you a quick overview of the software to help you decide if you seriously want to pursue a career in 3D.  </p>  <p>  \t         In this project-based course you will learn:  </p>  <ul style=\"\">  \t<li>Autodesk 3ds Max&#039;s Core Interface and Navigation</li>  \t<li>3D Workflows (modeling, materials, lighting &amp; rendering)</li>  \t<li>Design your own 3D Logo and get started towards your 3D career!</li>  </ul>  <p>  \t         After this course, you will have created a personalized 3D Logo that walks you through step by step how to work on a project from start to finish such as modeling, materials, lighting &amp; rendering.  </p>  <p>  \t         Included in this course is a link to download the 30 day trial version of 3ds Max (Courtesy of Autodesk) and approx 60 minutes of training video provided by 3DTraining.com. The average student will complete this course in approximately 2-4 hours.  </p>  <p>  \t         And if you enjoy your experience working in the software and you are interested in professional training to find work in this field visit our site and sign up for a free one hour intro class for more information.  </p>  <p>  \t         Also when you visit our site, don&#039;t forget to check out our company news page<a href=\"http://3dtraining.com/asp/about_company_news.aspx\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"></a> to see how the 3DTraining.com unique training methodology has helped our students launch a successful career in the 3D industry.  </p>", 
    "end_date": null, 
    "title": "3D Logo Design using Autodesk 3ds Max", 
    "price": 0, 
    "instructors": "3DTraining .com", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234324_0bb0_9.jpg", 
    "course_url": "https://www.udemy.com/3dsmax_3dtraining_quickstart/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-30T22:20:49Z"
}