{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  This AutoDesk Mudbox training video from Infinite Skills is your guide to this powerful software, used to sculpt 3D characters and models. Designed for the beginner, you will learn from the ground up how to apply the various tools and techniques available, to achieve the best results possible. You will follow a single project through from start to finish, with each step building on the previous, until you have a completed model.  </p>  <p>  \t<br>  \t  You will start learning Mudbox 2012 with a tour of the interface, but quickly move into some basic techniques for sculpting and painting. Once the groundwork has been laid, Brian takes you through the creation of a model from the ground up, with each section introducing a new tool or technique. Through the course of this video tutorial, you will build the entire body, from toes to fingers to hair, in intimate detail. This tutorial is as much an anatomy lesson as it is a software training course! You will paint your model, create accessories, pose it and finally prepare it for export to 3DS Max and rendering.<br>  \t<br>  \t  By the completion of this computer based training video on Mudbox 2012, you will deeply understand the sculpting process for a 3D model. You will be familiar with the tools available in this software, and how to use them to achieve the result you want. More than 9GB of working files are provided by the author, allowing you to work alongside him each step of the way.  </p>", 
    "end_date": null, 
    "title": "3D Modeling In Mudbox - A Definitive Mudbox Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107552_2779_10.jpg", 
    "course_url": "https://www.udemy.com/3d-modeling-in-mudbox/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-18T13:45:43Z"
}