{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t                  Welcome to 3DTraining.com&#039;s Hands-on Workshop Video Series. If you are a beginner looking to learn Autodesk Maya, these videos will give you a quick overview of the software to help you decide if you seriously want to pursue a career in 3D.  </p>  <p>  \t                  In this project-based course you will learn:  </p>  <ul>  \t<li>Autodesk Maya&#039;s Core Interface and Navigation</li>  \t<li>3D Workflows (Project Planning, Modeling, Materials, Textures, Lighting, Rendering)</li>  \t<li>Design your own 3D Interior Design project and sign up to attend a complimentary 4 hour live-online session with a 3DTi Professional Instructor! </li>  </ul>  <p>  \t              This course walks you through step by step how to work on a project from start to finish such as project planning, modeling, materials, lighting &amp; rendering. After this course, you will have created your own architectural visualization.  </p>  <p>  \t                  Included in this course is a link to download the 30 day trial version of Maya (Courtesy of Autodesk), approximately 120 minutes of training video provided by 3DTraining.com, and a link to sign up for a 4 hour live-online training session with a 3DTraining.com Instructor (convenient night and weekend schedules available). The average student will complete this course in approximately 8-12 hours (including live-online class).  </p>  <p>  \t              If you enjoy your experience working in the software and you are interested in professional training to find work in this field visit our site and sign up for a free one hour intro class for more information.  </p>  <p>  \t                  Also when you visit our site, don&#039;t forget to check out our company news page to see how the 3DTraining.com unique training methodology has helped many students launch a successful career in the 3D industry.  </p>", 
    "end_date": null, 
    "title": "3D Maya Hands-on Workshop + 4 hour live-online training", 
    "price": "50.00", 
    "instructors": "3DTraining .com", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257258_6805_4.jpg", 
    "course_url": "https://www.udemy.com/maya_3d_workshop/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-07T20:02:20Z"
}