{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Have you been hearing a lot about 3D printing recently? Are you curious about why this technology is becoming so popular? Want to learn how you can benefit from 3D printing? In this course we will teach you all the basics of 3D Printing! Thanks to advances in desktop 3D printing, this incredible technology is now becoming commercial available for everyone to enjoy. If you are interested in buying your own 3D printer for personal use or for learning how to prototype products for clients, this is an expansive industry with tons of possibilities! 3D Printing Basics is a beginner level course designed for anyone who wants to start learning about 3D Printing but has no idea what 3D printing is or where to begin! You do NOT need a 3D printer or a subscription to a CAD software to take this course! By the end of these lessons you should have a solid understanding of where you can implement this technology and why you should buy a 3D printer! Throughout the course you will learn entry-level concepts behind 3D printing, the different kinds of 3D printers, various 3D printing materials and when to use them, and even some tips and techniques for how you can use 3D printing at home! This course does NOT teach about how to operate a 3D printer or how to design 3D models with 3D CAD softwares. If you want to learn about 3D printer operations or how to use 3D CAD softwares to design your own 3D models, you can continue on with the rest of our curriculum! Our additional courses cover more advanced topics, such as 3D printer operations and 3D modeling. CAD Softwares we cover include programs like TinkerCAD, AutoCAD,123D, Solidworks, Rhinoceros, and more! Enroll in Airscrew Academy's 3D Printing Basics to start learning about 3D printing today!</p>", 
    "end_date": null, 
    "title": "3D Printing Basics", 
    "price": 0, 
    "instructors": "Airscrew Academy", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346876_c9eb_4.jpg", 
    "course_url": "https://www.udemy.com/3d-printing-basics/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T02:22:17Z"
}