{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>I wish I could convey to you the feeling I get when I hold a physical object in my hand<br>that was conceived in my mind a few hours prior. Human beings were designed with<br>an innate desire to create, invent, and solve problems, and 3D printing technology allows us to experience this in an amazingly unique way. Possibly you have witnessed a 3D printer working its magic as it seemingly created something out of nothing. In order for 3D printers to work, there must first be a carefully designed 3D model that the printer can use. In less than four hours, you can become the designer, creating your own quality, custom, print-ready models!</p>\n\n<p>In this course, you will follow along with step-by-step lessons that guide you through<br>the process of creating print-ready 3D models with the amazing SketchUp Make<br>software. After teaching many different CAD software packages over the<br>past 12 years, the SketchUp Make software was chosen for this course because of its ease of use for beginners and its relatively low learning curve. I have had students as young as age 10, as well as adult learners, successfully create complex models in a very short period of time with these free 3D modeling tools. My teaching methods<br>allow you to explore the use of the tools in a way that you will feel confident in branching out to create your own custom models fast.</p>\n\n\n\n\n\n<p>After exploring the main drawing tools in SketchUp, you will tackle projects where you create your own customized models such as nameplates, key/luggage tags, and custom USB flash drives. You will learn to identify and avoid problems such as overhangs that cause serious issues with many 3D models, leading to print failure. You will convert your files to the correct format for most 3D printers, and will be given information and advice on where to get your files printed. I'm excited to help you get started with this amazing technology, and can't wait to see the amazing<br>products you will design!</p>", 
    "end_date": null, 
    "title": "3D Printing Quickstart with SketchUp Make", 
    "price": "20.00", 
    "instructors": "Jared Murphy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765782_3b8c_6.jpg", 
    "course_url": "https://www.udemy.com/3d-printing-quickstart-with-sketchup-make/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T20:19:10Z"
}