{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Meu nome é <strong>Tito Petri</strong>, estudo e trabalho com o <strong>3D Studio Max</strong> desde <strong>2002</strong>, com a versão <strong>4.2</strong>.</p><p>Durante quase dez anos, ensinei o Max para <strong>centenas de alunos</strong>, dando aulas presenciais em uma grande escola de computação gráfica de São Paulo.</p><p>Desenvolvi este curso pois ao longo destes anos percebi quais eram as grandes dificuldades para se aprender e utilizar o <strong>3dsmax</strong> de forma prática e eficiente.</p><p>Como o Max possui muitos recursos, comandos, menus e ferramentas, resolvi organizar de forma <strong>prática </strong>e <strong>metódica </strong>todas as <strong>idéias principais</strong> para se aprender o software de forma clara e correta. </p><p>Neste curso reuni o que é principal e mais importante para se trabalhar com o Max. Seguindo estas aulas, o aluno em pouco tempo estará apto a desenvolver suas próprias <strong>modelagens </strong>(tanto modelos geométricos quanto orgânicos), a entender todo o processo de <strong>mapeamento </strong>e <strong>texturização </strong>dos objetos, e como configurar os modelos da melhor forma para receber a <strong>animação</strong>, e entender todas as ferramentas necessárias para se criar a movimentação. Além de conhecer também a parte da <strong>simulação física</strong> e efeitos especiais de <strong>partículas</strong>.</p><p>Com estas aulas, procuro <strong>abreviar </strong>um pouco para o aluno o <strong>processo de aprendizado</strong> do 3D Studio Max, para que todos consigam aprender animação 3D de uma forma mais divertida, prática e rápida.</p><p>...</p><p>*O curso reune mais de 150 aulas, para ver a listagem <strong>COMPLETA</strong> das aulas, clique em <strong>Grade curricular completa </strong>ao final da lista.</p><p>...</p><p>**Os alunos inscritos neste curso podem tirar suas duvidas com o professor atraves do forum de duvidas do curso.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "3D Studio Max - Curso Completo", 
    "price": "30.00", 
    "instructors": "Tito Petri", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650268_1318.jpg", 
    "course_url": "https://www.udemy.com/3dstudiomax/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-25T10:29:09Z"
}