{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>  Здравствуйте!  </strong>  </p>  <p>  \t        Этот курс направлен на людей которые впервые покупает <strong>3D принтер </strong>себе или ребенку и хотят освоить этот отличный инструмент творчества быстро и без лишних затрат на приложения. <br>  \t<strong>Autodesk 123 Design</strong> это бесплатное, но достаточно мощное средство геометрического моделирования. В своем курсе мы подробно, на русском языке, рассказали о всех базовых возможностях и дали несколько практических примеров по принципу от простого к сложному (разные шахматные фигуры).  </p>  <p>  \t          Мы используем материалы этого курса в обучении школьников начиная с 3-ого класса и доказали, что возраст и имеющиеся навыки рисования практически не имеют значения. Главное иметь идею, что вы хотите распечатать на 3D принтере, а этот курс и удобное средство моделирования Autodesk 123D Design помогут вам это сделать.  </p>  <p>  \t<strong>    Witbox Maker School</strong> зародилась вместе с появлением испанского 3D принтера Witbox от компании BQ. Линейка интернет курсов 3DMaker START возникла вместе с принтером для самостоятельной сборки BQ Prusa i3 Hephestos, который призван существенно увеличить количество новых пользователей 3D принтеров в мире благодаря доступности, простате сборке и высокому качеству.  </p>  <p>  \t<strong>Важно по оплате курса:</strong>  </p>  <p>  \tУ<span>читывая валютные колебания, </span>если вы просто хотите пройти курс, то, пожалуйста, запрашивайте купоны для оплаты через преподавателей курса. Мы не можем постоянно менять цену на сайте, но и не хотим наживаться на курсе валют.  </p>  <p>  \t            Если вы собираетесь покупать Prusa i3 Hephestos у партнеров Witbox Russia (официальный дистрибьютор BQ в России) , то, пожалуйста, запросите купон на скидку для этого курса.  </p>  <p>  \t            Если вы участвуете в &quot;Воркшоп по сборке Prusa i3 Hephestos&quot;, то этот курс достаётся вам бесплатно по специальному купону, как и другие курсы линейки 3DMaker START  </p>", 
    "end_date": null, 
    "title": "3DMaker START: Autodesk 123d для моделирования под 3D печать", 
    "price": "20.00", 
    "instructors": "Alexey Samoylov, Евгений Ваньков", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363294_c9fc_4.jpg", 
    "course_url": "https://www.udemy.com/autodesk-123d-design-start/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T03:44:28Z"
}