{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>*Course Updated 03/03/2016 </strong>- now contains resources for moving on to more advanced techniques after finishing this course.  </p><p>*Much more content coming soon (advanced techniques for arch viz, interior renderings with V-Ray, animation, etc)</p><p><strong>*I'll be your technical support </strong>-<strong> </strong>I answer questions every day in the discussion area, and I always respond to your private messages.  In these advanced computer programs, you will inevitably run into technical problems.  I am always here to answer all your questions and help you troubleshoot.  You can't find another course anywhere that gives you this much training, from a practicing professional, who is also at your beckon call to help, for such a reasonable price.  </p><p><strong>*Recent Student Feedback</strong></p>  <p>  \t      \"The Missing Link  </p>  <p>  \t      Having done numerous on-line 3D courses I am always looking for new ways of doing things to speed up production and modeling. The course although basic is very well structured with very few ambiguities. What Adam outlines in the Intro clip is what you should achieve relatively easily by the end of the course. . The only downside is that he hasn't done more advanced Visualisation courses yet. When they do come on stream I will no doubt enroll as his skill and experience within the industry comes through in his presentation.\"  NOTE: I do, in fact, have some more advanced classes now.  </p>  <p>  \t    \"This course is perfect for the beginners in 3ds max and V-ray. The information is clear and easy to understand. The course was a blast...\"  </p>    <p>  \t<strong>About 3ds Max and V-Ray:</strong>  </p>  <p>  \t                  Knowing how to use these two programs together is a valuable skill. Seriously, I taught myself how to use these programs many years ago, and now I get paid quite well for my expertise.  3d is not just my hobby, it is also how I support my family.  You can learn, and start a career in 3d too.  Everything you need to get started is in this course.  I will take you through 3ds Max and V-Ray from the very beginning, and by the end you will be well on your way to creating your own images and filling up your portfolio with polished work.  Keep in mind, you <strong>do not </strong>typically need formal training to get a job in 3D.  What it takes is an awesome portfolio, so let's get started on yours.  </p>  <p>  \t<strong>Some Questions To Ask Yourself:</strong>  </p>  <ul>  \t<li><strong></strong><strong>Are you currently in a job you do not enjoy?</strong><em>Jobs in 3d are seriously fun and rewarding!</em></li>  \t<li>  \t  \t\t<strong>    Are you an architecture student who feels overwhelmed sometimes trying to learn complicated software just to present your design properly?</strong> <em>This course can get you up and running QUICK!  Plus, you'll learn it the right way, from a pro.</em>  \t  \t</li>  \t<li>  \t  \t\t<strong>    Are you a SketchUp user who is no longer satisfied with the modeling / rendering capabilities of SketchUp, and are ready to take your 3d skills to the next level?</strong> <em>SketchUp is great at what it does, but it falls short when it comes to making flashy, photoreal images.  Also, bring your sketchUp with you, then learn to import it into 3ds Max and render with V-Ray, the best render engine out there.</em>  \t  \t</li>  \t<li>  \t  \t\t<strong>    Are you a practicing architect that needs a better way to portray your designs to clients? </strong><em>You've come to the right place.  I am an expert at just that.</em>  \t  \t</li>  \t<li>  \t  \t\t<strong>Maybe you're a gamer who wants to create your own game assets?  </strong><em>Even you should learn 3ds Max.  It is the industry standard for video games, and I personally have used it for asset creation for my unity 3d games.  </em>  \t  \t</li>  </ul>  <p>  \t<strong>Course Structure</strong>  </p>  <ul>  \t<li>For absolute beginners, I will show you how to get the software as a free trial and start finding your way around.  I will also go over how to customize your UI for a professional workflow, because why learn the slow way to do things, right?  I'll also share with you my custom UI files.  Of course, you can skip all of this if you are more seasoned.</li>  \t<li>Next we will start with the basics of modeling.  I will show you different techniques, and we will begin to work on our project.  Again, files will be provided if you want / need them.</li>  \t<li>With modeling down, we will go into V-Ray and start playing with lighting, materials, cameras, render settings, etc.</li>  \t<li>Finally, we will learn how to enhance our images with Photoshop.  I give some great post-processing tips in this course.</li>  \t<li>By the end you will be able to create architectural renderings on your own with a completely professional setup and workflow.  Then it is your turn to start practicing your skills, creating beautiful work, building a portfolio and landing a job.</li><li>AFTER THE INITIAL PROJECT - once you have completed your first project and learned the basics, I will then move into more advanced techniques (also, there is fully professional interior V-Ray project coming soon that students will be able to learn along with -- this is for more advanced users, or people who are ready to move on from the initial 6 hrs of instruction)</li>  </ul>  <p>  \t<strong>How Will This Course Benefit You?</strong>  </p>  <p>  \t    If you are a beginner, this class will be a great overview of how to get up and running.  It will cut out all the stuff you do not need and show you exactly the workflow necessary to work like a pro.  </p>  <p>  \t    If you are a veteran user, take this course to polish your V-Ray skills, and also to streamline your workflow.  I show so many tips and tricks that I use everyday to pump out arch viz projects fast and on budget.  There is no need to sacrifice quality and creativity if you can fly through the project quickly and on budget.  I'll show you how.  </p><p>COMING SOON: If you feel like you have mastered the basics, I have now added more advanced / obscure techniques that can really help your images to stand out, and much more will be coming soon, including a professional V-Ray interior shot that is completely photoreal.</p>  <p>  \t<strong>Ready To Sign Up?</strong>  </p>  <p>  \t                  What are you waiting for?  If you're still not sure, check out the preview videos.  Also, check out my profile to the left and see some of my portfolio.  Cool, right?  Wan't to make some of your own images?  Let's get started.  6 hrs is all you need to get started, then take the skills I share and practice, practice, practice.  </p>  <p>  \t                  Remember, I will provide the files and download links that you need for everything.  My models are included.  Come with nothing, leave with a finished project and a great knowledge base.  </p>  <p>  \t<strong>Start Your Love Affair With 3d Today!</strong>  </p>  <p>  \t                  PURCHASE THE COURSE.  </p>  <p>  \t                  *If the price isn't right, keep an eye out for Udemy promotions and coupon codes around the web, but I think a 6 hr training for $64 is a pretty good deal.  Sure beats a semester at community college :)  </p>  <p>  \t            *30 day money back guarantee, no questions asked!  (If you hate it, get a refund)  </p>  <p>  \t                  -Adam Zollinger  </p>  <p>  \t                  Professional (self-taught and ready to teach you) 3d Artist  </p>", 
    "end_date": null, 
    "title": "3ds Max + V-Ray: 3ds Max PRO in 6 hrs", 
    "price": "30.00", 
    "instructors": "Adam Zollinger", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/269778_a286_16.jpg", 
    "course_url": "https://www.udemy.com/intro-to-architectural-visualization-using-3ds-max-and-v-ray_zillus/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-28T00:15:51Z"
}