{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t                    This course is about mastering visualization with 3d max and V-ray. It is aimed at the professional level seeking students. In this course we will use real world materials coupled with the V-ray render.  </p>  <p>  \t                    This course is not overloaded with small details, its straight to the point with concise and clear explanations. It is structured according the methodology of 3ds max and V-ray. It covers different levels of explanation.  </p>  <p>  \t                These course will also cover detail explanations of the V-ray render engine as well as advanced material creation. It is important to master these tools for a greater visualization realism. All interested in seeking a professional lessons should get engaged because in short amount of time they will attain higher level of knowledge regarding realism in computer rendering.  </p>  <p>  \t            This course is intended for those students that are seeking advanced level of modelling and visualization.  </p>  <p>  \t            V-ray render engine will be used in the beginning only as a basic render and later on we will explain the advanced settings to attain maximum picture optimization, as we will later explain material settings of the V-ray materials. Today V-ray render engine is considered one of the most efficient render on the field of different types of visualizations. So in this tutorial you will get a chance to start and learn some of it&#039;s amazing features.  </p>  <p>  \t        This course will also cover advanced modelling techniques like hard surface modelling, which as a tool is used widely in the movie industry.  </p>  <p>  \t  Total time to master interior visualization in this tutorial is about three hours and in that time we will cover basic and advanced aspects of the 3ds max and V-ray.<br style=\"\">  </p>  <p>  \t        Structure of the course is simple and efficient with start to end clear explanations.  </p>  <p>  \t        I encourage all those students that look for something different to go ahead and take this course so they will gain more knowledge in visualization process.  </p>", 
    "end_date": null, 
    "title": "3ds Max + V-ray 3.0 Visualization 3+ hours", 
    "price": "20.00", 
    "instructors": "Benjat Isufi", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363106_1588_4.jpg", 
    "course_url": "https://www.udemy.com/3d-visualization/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T14:47:04Z"
}