{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>**</strong>Taught by a practicing professional</p><p>**The teacher is always available to help</p><p>**More real world examples / demonstrations to follow</p><p>**Get early access now before pricing goes up</p><p>**Join this course and get HUGE discounts on other courses from this instructor</p><p><br></p><p><strong>Improve Your 3d Materials Workflow -- Achieve Photorealism</strong><br></p><p>This course will dive into the details of 3d materials, showing you all the important tips and tricks necessary to achieve photorealism.  The course will be demonstrated within 3ds Max, and the textures will primarily be created using V-Ray materials.  Other types of shaders will also be demonstrated, but the class generally teaches you principles that can be applied across several different platforms.  You will learn settings, shader types, map creation, etc., all while seeing real time demonstrations of materials being created and rendered.</p><p><strong>In short, take this course if you want to vastly improve your ability to create photoreal textures, and streamline your workflow.</strong></p><p>Here are some of the benefits of this course:</p><ul><li>You will learn the professional way to do things, making you fast and efficient</li><li>The quality of your materials will immediately begin to improve as you apply my professional tips and tricks</li><li>Your renderings will take on a much more photo-realistic look, as materials are one of the most important elements for realism</li><li>You gain a deep knowledge and familiarity with V-Ray (and equivalent render engines) and its settings.</li><li>After taking this course, you will understand many principles that you can then experiment with to make your images more professional</li><li>The instructor is great at supporting the students by answering all questions and offering valuable feedback</li><li>By joining this course you will also get discounted access to all the other courses offered by this instructor <strong>(see coupons in bonus section)</strong></li><li>And so much more...</li></ul><p><strong></strong></p><p><strong>Join the class TODAY</strong></p><p>and get instant access to the class.  You will join a community of over 7,000 total students (across all my courses) who have been satisfied with their 3d learning. And remember, I work hard to support all these students effectively by answering questions and helping them solve their problems.  Here is a comment from a satisfied student:</p><p><em>\"I must begin saying that over time Adam has gotten better at creating courses and explaining everything in a simplest manner possible.</em></p><p><em>1. Overall video and audio quality was great.</em></p><p><em>2. The amount of information was just enough and the quality of it all was amazing. I learned more than i expected to.</em></p><p><em>Bought it almost as soon as i could knowing that it will for sure be worth it. I'm already planning on recommending it to some people that would love this course and i already can't wait for a course on lighting.</em></p><p><em>Great job on the course!\"</em></p><p><strong>SEE YOU IN CLASS</strong></p><p>-Adam Z</p>", 
    "end_date": null, 
    "title": "3ds Max + V-Ray: Create Advanced 3d Materials", 
    "price": "20.00", 
    "instructors": "Adam Zollinger", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548512_339d.jpg", 
    "course_url": "https://www.udemy.com/learn-vray-basic-materials-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-08T00:02:29Z"
}