{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t                           ***Course last updated on 12/15/14***  </p>  <p style=\"\">  \t           ***<strong style=\"\">MUDBOX</strong> workflow lectures just added***  </p>  <p style=\"\">  \t                           ***More lectures coming soon***  </p>  <p style=\"\">  \t                     ***30 day money back gaurantee, no questions asked.***  </p>  <p style=\"\">  \t <strong style=\"\">WHAT OTHERS ARE SAYING</strong>  </p>  <p style=\"\">  \t <em style=\"\">&quot;I&#039;ve been watching the first chapters and I like the way Adam teaches. His way of teaching is easy to follow and understand&quot;</em>  </p>  <p style=\"\">  \t <em style=\"\">&quot;I wanted to learn more about modeling in Max and I did. The course also has a lot of added bonuses I wasn&#039;t expecting. Wasn&#039;t too familiar with Vray or Mudbox before. Both are good tools, and they are covered here. The instructor knows what he is doing. The sound is good and he is easy to follow.&quot;</em>  </p>  <p style=\"\">  \t <strong style=\"\">HIGH DETAIL / HIGH POLY MODELING IN 3DS MAX</strong>  </p>  <p style=\"\">  \t             I do architectural visualization using 3ds Max, so I work on making furniture every day.  It is often one of the most challenging parts of my job.  In this course, I want to teach you all the various techniques and workflows that I use.  You will not only learn how to model furniture, but you will also be educated in the art of poly modeling, and creating high-detail assets in general.  This is a valuable skill to have in 3d as it often gives your images that extra realism that it needs to become truly &quot;photo real&quot;.  </p>  <p style=\"\">  \t             *As an added bonus, if you know how to make models like these, you can actually sell them to other people online.  There is a huge market for them.  The course covers the info you need to do that as well, but most importantly it is about being a great modeler.  </p>  <p style=\"\">  \t             *Many lectures and new techniques are continually being added.  This course is intended to be a true masterclass for furniture modeling, so there are many different techniques and workflows to discuss.  As the curriculum is built upon, the price will go up, so get in early.  </p>  <p style=\"\">  \t <strong style=\"\">WHY THIS COURSE?</strong>  </p>  <p style=\"\">  \t   First of all, it is cheap!  Secondly, you learn a ton about modeling from a practicing professional.  There are so many bonuses in this course, including the Mudbox workflow, Photoshop painting, V-Ray materials and rendering setup, and so much more.  Plus, you get all my poly modeling techniques along with special tips using cloth modifier and other unique workflows.  There is a ton of bang for your buck in this course.  There is something here for everyone, and if you follow the course you will definitely leave with a modeling toolbox that is overflowing with options.  </p>  <p style=\"\">  \t <strong style=\"\">COURSE STRUCTURE</strong>  </p>  <p style=\"\">  \t                                 This class focuses on the modeling of high-poly / high-detail furniture.  This is something that people in the industry need every day.  If you look around the web you will find many architectural renderings that are full of stunning, immaculately modeled, furniture.  In this course, I will take you through the process, step by step, on how to create these kinds of models.  Follow along with me, and by the end you will have created an organic chair model that looks great.  Even better, you will have the skills necessary to create all the custom furniture you need, and sell it online to others if you see fit.  I will also provide my files for download so you can tinker with, adjust, study, or sell my model if you like.  </p>  <p style=\"\">  \t             After I have taken you through the modeling of a chair step by step, we will then get into additional techniques and workflows that will be helpful to anyone trying to create photo real models.  </p>  <p style=\"\">  \t             In this course we will go over:  </p>  <ol style=\"\">  \t<li style=\"\">Creating the basic shape of a modern chair.</li>  \t<li style=\"\">Using the shell modifier, symmetry, turbosmooth, and poly-modeling techniques to get closer to a finished model.</li>  \t<li style=\"\">UVW unwrapping furniture using basic 3ds Max tools.</li>  \t<li style=\"\">Painting a custom map in Photoshop.</li>  \t<li style=\"\">Applying texture maps in 3ds Max, using V-Ray materials.</li>  \t<li style=\"\">Setting up a studio shot for your furniture piece.</li>  \t<li style=\"\">Post-processing your rendering using V-Ray render elements and Photoshop. ***A nice thumbnail image makes for nice sales.</li>  </ol>  <p style=\"\">  \t <strong style=\"\">BONUS TECHNIQUES</strong>  </p>  <ol style=\"\">  \t<li style=\"\">Using the cut tool to model in wrinkles.</li>  \t<li style=\"\">Using the cloth modifier to achieve natural folds and bends in our models</li>  \t<li style=\"\">Using 3ds Max Graphite modeling tools</li>  \t<li style=\"\">Added fur and fringe to our furniture with V-Ray fur (COMING SOON)</li>  \t<li style=\"\">3ds Max to Mudbox to 3ds Max workflow for ultra real models</li>  </ol>  <p style=\"\">  \t                                 Along with all of this, you will pick up nice little tips and tricks along the way as well.  You will be able to see how a practicing professional does the job.  </p>  <p style=\"\">  \t                             After you have mastered the art of creating good furniture using 3ds Max, and rendered a beautiful thumbnail using V-Ray, I will show you where to upload your models if you want to sell them, and give you the insight necessary to stand out from the crowd.  </p>  <p style=\"\">  \t <strong style=\"\">Join The Course Today</strong>  </p>  <p style=\"\">  \t                             Whether you want to learn how to model high-poly furniture for your own personal projects, or if you are interested in creating content to sell, it doesn&#039;t matter, this class has the info you need.  By the end you will feel comfortable using poly tools with 3ds Max to create just about anything you can imagine.  Sign Up Today!  </p>  <p style=\"\">  \t <strong style=\"\">IMPORTANT:</strong> This course is fully refundable for 30 days, no questions asked.  There is no risk to you in signing up for this course.  Try it.  If you hate it, get a refund.  </p>  <p style=\"\">  \t                             *More lectures will be added to the course in the coming months in order to keep the class up to date.  As the course expands, so will the price.  Get in early so you can have access to all the lectures as they become available.  </p>  <p style=\"\">  \t                             See you in class.  </p>", 
    "end_date": null, 
    "title": "3ds Max Advanced Modeling - Furniture", 
    "price": "20.00", 
    "instructors": "Adam Zollinger", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/271440_0470_9.jpg", 
    "course_url": "https://www.udemy.com/3ds-max-create-3d-furniture-in-3ds-max-for-selling-online/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-30T04:44:38Z"
}