{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn how to create a game-engine ready grenade by using 3Ds Max 2016 and Substance Painter. This free hard-surface tutorial is covered with full commentary and without fast forwarding! </p><p>Starting with the scene setup in 3Ds Max, you will learn how to set up reference images and determining the right size for our object. We will then continue with the actual low and high-poly modeling part in which we make use of advanced actions, modifiers and tools to help us create our grenade. After the modeling process we will jump straight into the UVW editor and focus on the importance of an optimized UV-Layout to get the maximum out of our texture.</p><p>In the Substance Painter part we will then bake our normal map as well as other important support maps. Right after that you will learn how to create an ultra realistic texture for our grenade. Starting with a basic introduction to Substance Painter we go over layers, fill layers and smart materials and understand in which cases they make sense to use. After that we will create our base layer materials and work in combination with procedural textures, masks and generators to form up the wear and tear on our grenade resulting in a photo realistic appearance. </p><p><strong>Files included:</strong><br></p><p>- Reference images essential to start working on the grenade.<br>- Low and highpoly files if you just want to tag along for the Substance Painter course</p><p><br></p>", 
    "end_date": null, 
    "title": "3Ds Max 2016 & Substance Painter: get skilled and efficient!", 
    "price": 0, 
    "instructors": "Tim Bergholz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635374_575c_4.jpg", 
    "course_url": "https://www.udemy.com/3ds-max-2016-substance-painter-create-a-grenade/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T23:50:11Z"
}