{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>This is a two part class.</strong></p><p><strong>In part 1</strong> you'll learn how to create information graphics that use data and reveal stories through animation. You'll learn how to go from data/reporting to an engaging and animated information graphic.</p><p><strong>What you will learn</strong></p><ul><li>An overview of the approach to starting with a set of data and assets</li><li>Figuring out the story and whats important or interesting about the data</li><li>Creating a hierarchy of interesting elements and an organizational scheme</li><li>Writing a script</li><li>Creating the final storyboard</li></ul><p>We'll also cover things like best practices and some tips to keep in mind as you work on your project.</p><p><strong>What you will make</strong></p><p>Students will make a storyboard for an animated information graphic.</p><p><strong>In part 2 </strong>you will get started on how to model, render, animate, and visualize data using the power of 3-dimensional design, and give a foundational overview of the 3D software package, <em>Autodesk Maya</em>. Graham has been using this software to create a wide variety of information design projects at <em>The</em> <em>New York Times,</em> and will relate these skills to work created in the journalism environment and beyond.<br></p><p><strong>What you will learn</strong></p><li>The Maya interface</li><li>How to model in 3D</li><li>How to animate in 3D</li><li>How to render in 3D</li><li>How to use data in 3D</li><p><strong><br></strong></p><p><strong>What you will make</strong></p><p>Students will model, render, and animate a simple thermos as a way to learn the fundamentals.</p><p><strong>WHO THIS CLASS IS FOR</strong></p><p>This class is for anyone interested in data, information graphics, animation, and visual storytelling. If you are a designer, journalist, animator or simply interested in how this kind of work comes together, this class is for you!</p>", 
    "end_date": null, 
    "title": "A Complete Guide to Creating Animated Information Graphics", 
    "price": "50.00", 
    "instructors": "Graham Roberts", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690506_ab6a_2.jpg", 
    "course_url": "https://www.udemy.com/animated-information-graphics/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T19:42:21Z"
}