{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course is an absolute beginner&#039;s entry point to learning the foundations of smooth, solid animation.  We will cover the exact, step-by-step approach that is needed to consistently make great looking animations every time.  The example we will be using is a Jack O&#039;Lantern turning in 3D space.  This will help us learn what it takes to make an animated drawing look &quot;three dimensional,&quot; as well as how to make the animation look smooth and clean.</p><p>We will cover one of the 12 animation principles, &quot;easing,&quot; that will serve as a foundation for all animation education moving forward.  This is a relatively quick course to complete, to get you up and running in no time.  After completing this course, you will be on your way to creating the animations you&#039;ve always wanted to.</p><p>There are absolutely no prerequisites for this course or required software.  Any drawing software with layers will do.  If you prefer traditional materials, you can also use pencil, paper, and a lightbox.  If you&#039;re a Nintendo fan, use the DS or 3DS Flipbook software!  Anything works, as we are covering the general animation principles in this course, and not the specifics of a particular piece of software.</p><p>The course is structured in a very straight-forward manner, beginning with the first few frames as sketches and moving through inking and coloring.</p><p>Included with the video lessons are step-by-step breakdowns in image format for easy reference.  </p><p>If you&#039;re curious about animation, or are frustrated with your own attempts at making animated drawings, this course will help you understand the basics and help guide you to approach animation in a structured, efficient, and pragmatic way that will produce clean, smooth results every time.</p><p>This course serves as the starting point for any new animator, whether you want to get into video game animation, character animation, movie animation, TV animation, Flash animation, web animation, YouTube animation, or your own independent projects.</p>", 
    "end_date": null, 
    "title": "Absolute Beginner's Entry into 2D Animation", 
    "price": "20.00", 
    "instructors": "Jeff Mumm", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535694_e8c5_3.jpg", 
    "course_url": "https://www.udemy.com/absolute-beginners-entry-into-animation/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T00:31:20Z"
}