{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em><strong>Course Launched 24th March 2016 - Latest After Effects CC 2016</strong></em><br></p>\n\n<p>This is a unique course on Udemy. And the only course where you will learn about Expressions while building animated infographics.</p>\n\n\n\n<p> The focus of the animations is based on Graphs such as bar, line and pie charts – with different methods to create animations.</p>\n\n\n\n\n\n<p>You will learn:</p>\n\n\n\n\n\n<ol><li>How to use expressions to link different properties such as rotation and position</li><li>How to use expressions to control effects to create complex animations</li><li>How to display values through expressions</li></ol>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Expressions are very useful (when used wisely) and will enable you to create more complicated animations while saving a lot on keyframing.</p>\n\n\n\n\n\n<p> You will learn the ins and out to creating infographics. You will also go through 3 major infographics graphs styles that will build your skills to create any animated infographic element or bar charts.</p>\n\n\n\n\n\n<p> This is a project-based course where you will have all the project files to practice and review. You will be also able to follow along.</p>\n\n\n\n\n\n<p> If you are new to After Effects, this course is your opportunity to understand and practice Expressions while building useful and practical animations.</p>\n\n\n\n\n\n<p><strong></strong><em></em><u></u><sub></sub><sup></sup><br></p>", 
    "end_date": null, 
    "title": "Adobe After Effects Expressions: Create Motion Infographics", 
    "price": "20.00", 
    "instructors": "Louay Zambarakji", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780118_6c09_3.jpg", 
    "course_url": "https://www.udemy.com/adobe-after-effects-expressions-create-motion-infographics/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T16:51:08Z"
}