{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Lower thirds in After Effects are in high demands. Some sites are selling thousands of projects every day. Almost every video or documentary, even short movies will require lower third. It is and has been a trending market.</p>  <p>Not only you get to firmly understand how to build lower thirds in After Effects but also learn how the animations have been created and DOWNLAOD the Project for your personal or commercial use.</p>  <p>Depending on what you want to achieve, this course is intended for you to accomplish the following:</p>  <ul><li>Learn how to create lower thirds – and it’s not about just creating animations. </li><li>Learn how to package After effects Projects so that any user can easily change and manipulate the animations</li><li>Understand how the lower third package offered in this course is build and how to easily make changes</li><li>Use the downloadable Project offered in this course to create your own for your work</li><li>Repackage the same Project for resale.</li></ul>          <p>A firm Understanding of how to build Projects for resale and how to create animations and compositions that can be changed by almost anybody is necessary for your success mainly if you want to resell the product (of course after making some changes)</p>  <p>It is also important to understand how the animations have been created if you want to use them at their full potential, make changes and implement them in your own work.</p>  <p>This course offers you the ability, understanding and the complete creation process of commercial Projects.</p>    <p><strong>Content and Overview</strong></p>  <p>You start by understanding the most needed operations as pre-comps, Color control and Time remap among others.</p>  <p>You move on to learn how to organize your project and package it professionally.</p>  <p>You will start building from scratch the Clean Lower Third Theme and you will create 12 full animations and the presentation animation.</p>  <p>You can download the Project files and follow along and use the same project file to create your own lower third package.</p>", 
    "end_date": null, 
    "title": "Adobe After Effects CC - Create Lower Third Text Animation", 
    "price": "20.00", 
    "instructors": "Louay Zambarakji", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658870_8958_5.jpg", 
    "course_url": "https://www.udemy.com/master-lower-third-text-animation-in-after-affects/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T12:55:31Z"
}