{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>This course will teach you how to create animated motion graphic elements on any logo, object or vector item! </strong>Master Adobe After Effects while having fun.<strong> </strong>Watch the above \npromo video for detailed explanation and a preview of what's inside and what animation you are going to prepare!.<span></span></p><p><strong>Learn on-trend After Effects motion graphic animation! </strong></p><p><strong></strong>In this class I want to show you a quick and effective workflow allowing you to make an amazing looking liquidy-displaced text animation with After Effects CC. You could compare it to a paint bucket which would be spilled over text with random colors and made it complete. This animation can be great for any kind of youtube video, text animation, logo intro and more! During the class you will learn essential After Effects techniques as well as advanced tricks on how to top-up and make any animation a little more interesting. You will work with Track Mattes, Outlining, Shape Layers, the Pen Tool, Effects, Keyframes...so<strong> it's action-packed material!</strong></p><p><strong>The class doesn't require any prior Adobe After Effects CC knowledge</strong> and will let you dive straight into <strong>motion graphic design</strong> and teach you valuable skills and keyboard shortcuts along the way!</p><p><strong>Some of the amazing fun stuff we will touch on:</strong></p><ul><li>On-Trend design animations</li><li>Working with shape layers</li><li>After Effects keyboard shortcuts</li><li>Using keyframes for animation build-ups.</li><li>Working with several effects on our layers and compositions</li><li>How to utilize precomposing for design, grouping and sorting</li><li>...and many many more!</li></ul><p><strong>I'm ready if you are - let's dive intro Adobe After Effects and start the work...<strong>Enroll now!</strong></strong></p>", 
    "end_date": null, 
    "title": "Adobe After Effects: Liquid Text Animation in After Effects", 
    "price": 0, 
    "instructors": "Andrzej Pach", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/795614_816a_5.jpg", 
    "course_url": "https://www.udemy.com/after-effects-liquid-text-animation/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T08:40:00Z"
}