{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn the concepts, tools, methods and properties that you need to create stunning 3D animations within Adobe After Effects.</p><p>3D is essential to creating animations. Many avoid 3D all together thinking it is difficult and hard to work with. </p><p>The Truth: it is Not. </p><p>3D elements are excellently introduced in this organized and unique course and are easy to learn and practice.</p><p><strong>Learn the important methods and properties in After Effects 3D:</strong></p><ul><li>Master Cameras: Styles, Presets, Modes, Parameters </li><li>Work with Lights and understand their effects </li><li>Optimize Orthographic Views</li><li>Create Shadows using the elements that make shadows appear</li><li>Learn Multi-planning within the 3D space – an essential concept to using 3D</li></ul><p><strong><br></strong></p><p><strong>A unique approach to learning 3D:</strong></p><p>This course is unique in its approach to 3D. You will learn each element separately and in-depth. You will master every element before moving to the next. Separating the learning experience for each element will allow you to focus on the details that make or break your 3D experience. </p><p>You will also fully understand how to work with the views. Mastering and optimizing the orthographic views will make a genuine pro. It is then that you will start ‘seeing’ 3D as easy and simple.</p><p><strong>Content and overview</strong></p><p>You will start by noting the similarities and differences between 3D and 2D and discovering orientation and rotation and how to use them. </p><p>You will learn about multi-planning how to fake it in 2D and how to use it in 3D. This very important step will cement your understanding of 3D in After Effects and will allow you to start manipulating your views in readiness to adding Cameras and Lights.</p><p>Moving on to cameras: An in-depth overview of Cameras in After Effects. The different type of Cameras and how they affect your scenes and animations. Mastering Cameras and all its parameters, options, setting dialogue will finalize the conceptual (and practical) learning for 3D.</p><p>One of the most impressive features in After Effects is the ability to create lights, mixing 2D and 3D and getting amazing effects. You will get a detailed explanation and practical overview of the Lights system in After effects and how to use them with Text Animations or lighting up still scenes.</p><p>Much more is covered in this course – Such as shadows, depth of field, falloffs and much more.</p><p><strong>Are you ready to take Your After Effects Skills to the Next Level – The 3D Level?</strong></p><p>Join in and Welcome</p>", 
    "end_date": null, 
    "title": "Adobe After Effects - Master 3D Animation - Complete Course", 
    "price": "20.00", 
    "instructors": "Louay Zambarakji", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715404_a756_5.jpg", 
    "course_url": "https://www.udemy.com/after-effects-3d-animation-motion-graphics/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T09:47:20Z"
}