{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course I want to guide you through a nice technique for making a modern &amp; trendy typography project in <strong style=\"\">After Effects</strong> which you can easily learn for Yourself and replicate. You will learn how to form, build and reveal a word or logo using custom created lines and giving them a seamless motion. The course is perfect for any beginner to gain essential motion design skills, and more advanced users to learn a new animation technique which will sure come in handy. After Effects is the #1 program when it comes to complete animations and no matter wether you use After Effects CS6 or After Effects CC the animation will work perfectly on both versions. This animation could be used to reveal some text to make an animated <strong style=\"\">kinetic typography</strong> video, to reveal an object / shape or anything you imagine.</p><p>Newbie friendly! Learn After Effects basics in no time. This course doesn't require any prior knowledge and will let you dive straight into <strong style=\"\">motion graphic design</strong> and teach you valuable skills and keyboard shortcuts along the way! It's always useful to learn Adobe suite programs, and harnessing after effects may be the best thing you can do in the ever chaning video animation world.</p><p><strong style=\"\">Biggest benefits of the class:</strong></p><ul style=\"\"><li style=\"\">Keybord shortcut usage displayed</li><li style=\"\">No experience or knowledge required</li><li style=\"\">You will understand kinetic typography a bit</li><li style=\"\">You will complete a project and render it out</li><li style=\"\">Learn a quick and fun workflow in After Effects</li><li style=\"\">Get familiar with AE CS6 and AE CC overall</li><li style=\"\">Valuable tricks and techniques you can use in future designs</li><li style=\"\">Allows you to get familar with motion graphic design and hopefully start loving it!</li></ul><strong style=\"\"></strong><strong style=\"\">We will be using and covering topics like:</strong><ul style=\"\"><li style=\"\">Precomposing objects</li><li style=\"\">Keyframing animations</li><li style=\"\">Working with the Pen Tool</li><li style=\"\">Usage of the graph editor to ease our animation</li><li style=\"\">Adding various properties to layers to enhance their visual appearance</li></ul><span></span><p>I'm ready if you are - let's dive intro after effects and start the work... <strong style=\"\">Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "After Effects Beginner - Typography Reveal in After Effects", 
    "price": "20.00", 
    "instructors": "Andrzej Pach", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550868_6562_14.jpg", 
    "course_url": "https://www.udemy.com/after-effects-animation-typography-reveal-in-after-effects/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T08:30:51Z"
}