{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>You are most probably aware that Slide Show Projects are very much in demand. Be it for Re-sale, professional and business use, documentaries, movies or explainers. Know how to create, structure and re-use a Slide Show Project will make look more pro and grow your skills in After Effects.</p><p>This is a Project Course where will build a definite useful project: Creating a Slide Show. This is a practical course where you will be able to download the After Effects project file and use it for your work be it commercial or personal.</p><p>You will learn how a slide show project is build and how to use it for personal or commercial benefits. It is a model project that you can later modulate to have 20, 30 or 100 slides depending on your needs.</p><p>You will tackle some of the most essential aspects of a Slide Show Project among others:</p><ol><li>Getting Images ready in Photoshop and how to import them into After Effects</li><li>How to sequence your Slide Show the professional way</li><li>How to Create Image Pre-Compositions</li><li>How to Create and Insert lower thirds</li><li>And Of course how to Create Slide Animations simple and complex ones</li></ol><p><br></p><p>The main concept of this course is to cover all the steps that are required to Create a structured and modular slide show that you can use and re-use, grow or reduce and change any slide animation.</p><p>You will start by understanding the various methods to import your photos. Move on to create the structure within the After Effects Project. The next Step will be to create the slide animations and how to move from one slide to another.</p><p>There be a thorough on Sequencing and creating images or movies pre-comps the professional way.</p><p>Adding lower thirds will come in just to demonstrate how you can add messages on each slide.</p><p>The last part we will deal with packaging for re-sale or personal use.</p><p>Join the course now.</p>", 
    "end_date": null, 
    "title": "After Effects: Create Slide Shows - Build a Complete Project", 
    "price": "20.00", 
    "instructors": "Louay Zambarakji", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752624_0370_3.jpg", 
    "course_url": "https://www.udemy.com/after-effects-tutorial-slide-show/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-04T17:47:23Z"
}