{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This a Unique course to learn 2D Character (Cartoon or Photographic) animation methods and techniques. It’s all about Puppeteering a character and/or rigging graphics.</p><p>Learn and Master the concepts and tools that you will need to build full <strong>2D Character animations</strong> in After Effects CC. </p><p>Learning 2D Character animation in After Effects with the two most important techniques is an asset for everyone who wants to work in After Effects. </p><p><strong>Master the Puppeteering tool and couple it with the rigging method to create exciting animation: </strong></p><ul><li>Understand the concept of Puppeteering in After Effects </li><li>Master the Pin tool and create Pins in strategic points</li><li>Discover how to use the Puppet Overlap Tool and create levels for your flat characters</li><li>Explore of Puppet Starch tool and stiffen areas of you character </li></ul><p><strong> </strong></p><p><strong>Acquiring the 2D Character Animation Skills is Essential and Important when you want to work in After Effects. </strong></p><p>You will cover the Puppeteering methods and techniques in After Effects and Master the three essential tools and all parameters that will make a character animate smoothly. </p><p>You will also learn how to use pro-plugin to rig your puppet to create forward kinetics that will allow you more control.</p><p>You will cover how shape layers are rigged and learn how to animate a rigged complex shape. You will then be able to animate any complex shape.</p><p>With these fundamental techniques animating a Character be it cartoon or photographic will be easy and animations are created fast. </p><p><strong>Among Others you will cover:</strong></p><p>The Puppet Tool including the Puppet Pin and Mesh, How to Record an Animation with Motion Sketching for Puppet Pins and Motion Sketching for layers. You will also cover how to smoothen your animation and how to apply the wiggler effect to a Puppet Pin.</p><p>You will cover Keyframing Pins and create simple and complex animations.</p><p>In every Character there will be need to stiffen certain areas and overlap others, you will cover these two aspects very thoroughly.</p><p>Rigging is a method of linking layer in Forward Kinetics and animating from base to extremity: this subject will be covered in full. </p><p>Going more pro and using an important plugin to rig Puppet pins is covered as the last resource required to become a pro in 2D Character animation.</p><p>Join this Course and I wish you happy Puppet Show!!</p>", 
    "end_date": null, 
    "title": "After Effects: Master 2D Character Animation - Puppet & Rig", 
    "price": "20.00", 
    "instructors": "Louay Zambarakji", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/763418_6bb9_3.jpg", 
    "course_url": "https://www.udemy.com/after-effects-2d-character-animation-course/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-15T18:32:16Z"
}