{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t <strong>Bring your videos to life with this great course on creating amazing lower thirds. </strong><strong><br>  \t </strong>  </p>  <p>  \t <strong><em>What is a lower third?</em></strong>  </p>  <p>  \t A lower third is one of those cool titles that shows up on the bottom of a video screen - usually during an interview. It tells the viewer who is speaking and gives them credibility with more information. The professional titles found in this course are similar to top notch news broadcasts, music videos, and oscar-winning documentaries!  </p>  <p>  \t You'll learn how to make 10 specific lower thirds with perfectly paced step by step lessons. Use the skills learned in this course to create your own professional titles. <strong><em>There are an infinite number of possibilities.</em></strong>  </p>  <p>  \t <strong><em>As a bonus, you'll receive the project files for all 10 lower thirds so you can easily customize them without even having to know After Effects!</em></strong>  </p>  <p>  \t Using Adobe After Effects (either on Mac or PC), this course is great for beginners as well as professional video creators. Things we'll be covering include:  </p>  <ul>  \t<li><strong>Special Effects<br>  \t </strong></li>  \t<li><strong>Motion Graphics<br>  \t </strong></li>  \t<li><strong>Using Keyframes<br>  \t </strong></li>  \t<li><strong>Custom Transitions<br>  \t </strong></li>  \t<li><strong>Title Placement<br>  \t </strong></li>  \t<li><strong>And So Much More!</strong></li>  </ul>  <p>  \t <strong>Download a free trial of </strong>Adobe After Effects from the Adobe website to follow along in the course!</p>", 
    "end_date": null, 
    "title": "After Effects: Make 11 Fun After Effects Video Titles", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42482_4bdc_7.jpg", 
    "course_url": "https://www.udemy.com/lowerthirds/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-20T00:14:20Z"
}