{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This Materials in Unreal Engine 4 course will give you a thorough understanding of creating materials inside of the UE4 engine. Starting with the basics and getting to know the interface and understanding the different types of materials is going to be what we discuss in Volume one. We will also look at the types of materials you can create using the engine. We'll have a PBR material overview to learn what physically based materials are.</p><p>We'll also cover the material blends and domains and find out the differences between each one. Next up, we'll look at the shading models that we will create during the course. The last part of volume one will be a more intermediate level of creating a computer screen  material with different components and even creating a material function. Volume 2 will go over just materials, where we will firstly look at creating a basic skin shader and understand what subsurface scattering is. The second material will be a car material which will use the clear coat model and look at creating material attributes. We will then make an ocean shader and then lastly create a slightly advanced material where we will create a dynamic material there has a weather like function to it with snow, rain and dryness.</p><p><strong>(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong></p><p><strong>More about the Instructor:</strong></p><p>Since graduating university in 2015, Kyle has contributed to multiple small game projects. In addition, during his time at University he contributed as an assistant lecturer while learning and exploring his passion for 3d modeling, sculpting, texturing, and video game design. Currently Kyle is pursuing a Masters in Games Development at University.<br></p>", 
    "end_date": null, 
    "title": "An Introduction to Creating Realistic Materials in UE4", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662770_9fdd_2.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-an-introduction-to-creating-realistic-materials-in-ue4/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T06:32:03Z"
}