{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course, instructor Chad Morgan will go through the basics in writing scripts in Maya in both MEL and Python. We will begin by discussing the difference between MEL and Python, why there are two different languages, and the pros and cons to each. We will show you how to bring up the scripting reference which will allow you to search the commands and their parameters so you can learn to create your own scripts. We demonstrate the syntax on both MEL and Python commands in Maya, including passing arguments to them. </p><p>We will demonstrate how to create procedures and definitions, what variables are and how to create them, and how to pass variables between procedures and definitions. Following that, we will show, in both MEL and in Python, some of the more common functions in programming. The first are iterators, which allow us to perform the same task over lists of objects and comes in several forms. The second function common to all programming languages is the conditional statement, which allows us to test conditions before executing code and allowing us to branch the program depending on what conditions are met. We finish by demonstrating how to save and reload your scripts in both languages.</p><p><strong>(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)<br></strong></p><p><strong>More about the Instructor:</strong></p><p>Chad Robert Morgan started his career at LucasArts where, as a newbie to the industry, was fortunate enough to work with some very talented mentors who taught him how to use Maya. Since then, Chad has been trying to pay it forward by sharing what he has learned, first by giving lectures at Autodesk Master Classes, then publishing an article in 3D World magazine, posting tutorials on YouTube, and finally teaming up with 3dmotive. Chad currently lives in Lake Forest, CA with his wife Carol and his son Xander.<br></p>", 
    "end_date": null, 
    "title": "An Introduction to Scripting in Maya", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662762_7cd7.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-an-introduction-to-scripting-in-maya/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T06:29:49Z"
}