{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course was originally created for students participating in <strong>Skills Ontario's</strong><strong> </strong>Animation Challenge (similar to the <em>11 Second Club</em>), as a way to quickly get them comfortable with both the fundamentals of traditional animation as well as practical knowledge of Toon Boom's software. To do this, the course is designed to walk through the completion of a scene starting from analyzing dialogue, to story-boarding, to creating actual animation, while being sure to emphasize the core principles of animation.</p><p>With this in mind, the course is best suited for animation students that are either new to the medium, or those looking to bring their traditional skills to the digital realm, using Toon Boom. While there are many videos available online that feature Toon Boom's software, most of them focus on cut-out style animation, or puppets, rather than traditional frame-by-frame style animation. After getting many remarks from even industry pros surprised that Toon Boom can actually not only support traditional animation, but do it amazingly well, I felt it high time for some video tutorials focussing on the basics.</p><p>This course features Toon Boom's <strong>Storyboard Pro</strong>, and <strong>Harmony 11</strong>, industry standards in animation software. Although, to keep up with all the version changes, I've made sure to focus on features that are also available in both older and newer versions of Harmony as well Toon Boom's former <strong>Animate</strong> and <strong>Animate Pro</strong> applications. And for those absolute beginners, there's still plenty of information that can be used, whether you're still drawing with a pencil, or deciding what type of software to pick up for your next animated project.</p><p>This course includes 19, <strong>densely-packed</strong> lessons, over the span of exactly an hour.<br></p><p>A great way to <em>fast-track</em> your working knowledge of both animation and Toon Boom basics!</p>", 
    "end_date": null, 
    "title": "Animating Traditionally with Toon Boom", 
    "price": "20.00", 
    "instructors": "Apollo Okamura", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612244_155a_5.jpg", 
    "course_url": "https://www.udemy.com/animating-traditionally-with-toon-boom/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T23:27:15Z"
}