{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>O Curso de Animação Básica - do Roteiro à Edição Final apresenta processos usados por produtoras de animação para conseguir criar a melhor história produzida da melhor forma. São conceitos e ferramentas usadas quando uma grande equipe está envolvida mas que também são fundamentais para projetos menores.</p>\n\n\n\n<p>Você vai aprender todos esses conceitos básicos que envolvem a profissão do animador digital de forma prática, acompanhando a produção de um curta-metragem de animação. Também vai aprender a usar diversos softwares usados em cada uma das etapas. Saiba como integrá-los para garantir mais velocidade, autonomia e qualidade ao trabalho.</p>\n\n\n\n\n\n<p>Serão 11 módulos dividos em 28 vídeo-aulas.</p>\n\n<p>1 - Editorial</p>\n\n<p>2 - Roteiro</p>\n\n<p>3 - Concept Art</p>\n\n<p>4 - Storyboard</p>\n\n<p>5 - Animatic</p>\n\n<p>6 - Layout</p>\n\n<p>7 - Personagens</p>\n\n<p>8 - Animação</p>\n\n<p>9 - Composição</p>\n\n<p>10 - Finalização</p>\n\n<p>11 - Edição Final</p>\n\n\n\n\n\n<p>Tanto para animadores entusiastas como aspirantes a profissionais, o Curso de Animação Básica - do Roteiro à Edição Final é uma ótima forma de conhecer como trabalhar um filme de animação buscando um resultado agradável para o espectador. Traz um panorama de mercado e ilustra caminhos para seguir adiante numa das carreiras mais gratificantes e promissoras da indústria criativa.</p>", 
    "end_date": null, 
    "title": "Animação Básica - do Roteiro à Edição Final", 
    "price": "30.00", 
    "instructors": "Marcus Corrêa", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709244_b678_2.jpg", 
    "course_url": "https://www.udemy.com/curso-de-animacao-basica/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T02:50:55Z"
}