{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t In this tutorial we will start by modeling our building in ArchiCAD using our AutoCAD imported plan. We will talk about many aspects of modeling in ArchiCAD such as adding walls, windows, doors, creating stairs, copying and injecting data and ...  </p>  <p style=\"\">  \t Although this part is done completely in ArchiCAD but most off the procedure is the same in Autodesk Revit. We will then add some other elements in 3Ds max after importing our model.  </p>  <p style=\"\">  \t We will use 3Ds max to model most of our furniture including the bases for Marvelous Designer. A combination of spline modeling as well as high poly modeling and surfacing will be used.  </p>  <p style=\"\">  \t All of our resting furniture will be built in Marvelous Designer, which will include importing and exporting to and from Marvelous Designer, simulating techniques, decimation in MeshLab and ...  </p>  <p style=\"\">  \t We will then continue to adding some shaders to our objects in 3Ds max and V-ray. A combination of V-ray material, V-ray Blend material, V-ray 2-sided material, V-ray displacement and some other materials will be used.  </p>  <p style=\"\">  \t For the lighting process we will learn techniques on when and how to use different V-ray lights and ways to optimize those lights to get a reasonable render time.  </p>  <p style=\"\">  \t In the rendering stage we will try to use some of the new features of V-ray 3.0 to speed up rendering and also simpler ways to get rid of artifacts. A whole bunch of render elements will be exported out including light select element, Multi Matte, reflection, refraction, GI, lighting, shadow and a few more to be used in Photoshop.  </p>  <p style=\"\">  \t The last part of this tutorial will be compositing in Photoshop. We&#039;ll use every single render element that we exported out from V-ray to come up with the final image that you can see.  </p>  <p style=\"\">  \t The full size image can be seen <a href=\"http://shlece.com/wp-content/uploads/2014/03/Architectural-Interior-Visualization-in-V-ray-3.0.jpg\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Here</a> !  </p>  <p style=\"\">  \t A more detailed breakdown  is as follows,  </p>  <p style=\"\">  \t        Difficulty Level : Advanced  </p>  <p style=\"\">  \t        Main Software Used  in,  </p>  <p style=\"\">  \t        Modeling, Simulation : ArchiCAD, 3Ds Max, Marvelous Designer, MeshLab (free)  </p>  <p style=\"\">  \t        Rendering : V-ray 3.0  </p>  <p style=\"\">  \t        Post Production : Photoshop  </p>  <p style=\"\">  \t        The tutorial will cover,  </p>  <p style=\"\">  \t        In Modeling :  </p>  <ul style=\"\">  \t<li style=\"\">Customizing the UI using scripts.</li>  \t<li style=\"\">Using Marvelous Designer to model every piece of resting furniture; all the couches , sofas, pillows, chair.</li>  \t<li style=\"\">Spline modeling in conjunction with some modifiers , including ; tables, the floor lamp,  vases, wall clock.</li>  \t<li style=\"\">Using V-ray fur for the floor carpet.</li>  \t<li style=\"\">Using ATree free script to create flowers and plants.</li>  \t<li style=\"\">Using V-ray displacement to create cutouts.</li>  \t<li style=\"\">Optimizing V-ray displacement to areas that are seen through the camera for memory optimization.</li>  \t<li style=\"\">Using  ArchiCAD  to model the building and refining in 3Ds Max.</li>  \t<li style=\"\">Using some free scripts to place books in bookshelf randomly.</li>  \t<li style=\"\">Using Animation tools to scatter objects on our models.</li>  \t<li style=\"\">Using graphite modeling tool-set</li>  </ul>  <p style=\"\">  \t        In Shading :  </p>  <ul style=\"\">  \t<li style=\"\">Using V-ray blend to create complex materials .</li>  \t<li style=\"\">Using quick scripts to interactively see the results of complex textures without the need of full rendering.</li>  \t<li style=\"\">Using V-ray 2 sided to create translucency for objects.</li>  \t<li style=\"\">Creating worn out edges with the use of V-ray displacement and V-ray Dirt.</li>  \t<li style=\"\">Optimizing all scene materials to have the best quality n the least rendering time.</li>  \t<li style=\"\">Most of the materials in the scene are made of complicated shading networks</li>  </ul>  <p style=\"\">  \t        In Rendering:  </p>  <ul style=\"\">  \t<li style=\"\">Using V-ray 3.0&#039;s new features that will help in rendering this scene faster and modifiable.</li>  \t<li style=\"\">make use of all different V-ray lights and how to optimize those and a general lighting solution which will work in many interior scenes.</li>  \t<li style=\"\">Rendering many different render passes including masks for all materials, separating lights, reflection, refraction and ....</li>  </ul>  <p style=\"\">  \t        In compositing:  </p>  <ul style=\"\">  \t<li style=\"\">Layering all our different passes together to achieve a result we want.</li>  \t<li style=\"\">Changing the individual lights effect in our scene without the need to re-rendering.</li>  \t<li style=\"\">Color correcting many of our elements with ease using the masks that we rendered out.</li>  \t<li style=\"\">Adding extra texture to some objects and learn how to blend them nicely with the scene.</li>  </ul>  <p style=\"\">  \t       The full size image can be seen <a href=\"http://shlece.com/wp-content/uploads/2014/03/Architectural-Interior-Visualization-in-V-ray-3.0.jpg\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Here</a> !  </p>  <p style=\"\">  \t You&#039;ll get all the lessons plus every single asset that was used in creating this tutorial including models, textures, renders, Photoshop files, ...  </p>  <p style=\"\">  \t The running time of the course is above 7 hours and you should be able to complete the course in 20-30 hours based on your previous knowledge/experience in the taught software.  </p>  <p style=\"\">  \t This course is recommended for those who want to learn every step needed to visualize an interior scene from scratch to be able to produce a photo-realistic looking image.  </p>  <p style=\"\">  \t<em style=\"\">If you feel there’s something in the tutorial that needs more explanation or a part that has been missed, you may write to me at anytime and I’ll be adding an update to the tutorial which you’ll be able to download.</em>  </p>  <p style=\"\">  \t<em style=\"\">If you had any question please contact me  :)</em>  </p>", 
    "end_date": null, 
    "title": "Architectural Interior Visualization in 3Ds max & V-Ray 3.0", 
    "price": "50.00", 
    "instructors": "Ashkan Moezzi", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230808_0b28_6.jpg", 
    "course_url": "https://www.udemy.com/architectural-interior-visualization-in-3ds-max-v-ray-30/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T13:26:50Z"
}