{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tDeze cursus geeft een compleet overzicht van Cinema4D voor het modelleren, animeren en renderen van gebouwen en architectuur.  </p>  <p>  \t  Aan de hand van een recente versie van Maxon Cinema4D (r13 of hoger), leren we hoe deze software werkt, maken we enkele eenvoudige modellen om de manier van modelleren te leren kennen. Deze modellen worden dan verder verfijnd met materialen en belichting om ze dan foto-realistisch te renderen. Het is evenwel niet de bedoeling om de volledige modellering van het gebouw te behandelen, omdat we er van uitgaan dat architecten dit in CAD of BIM software maken, zoals ArchiCAD, VectorWorks of SketchUp.  </p>  <p>  \t  We gaan in op de basis principes van animatie en passen dit toe via een zonnestudie en een camera traject. Tenslotte introduceren we ook enkele van de krachtige, meer dynamische manieren om geometrie of beweging te maken.  </p>  <p>  \tDe cursus bestaat uit een reeks video tutorials, doorheen verschillende thema&#039;s. In het begin van de cursus krijg je een kort overzicht van de workflow, die nadien, in de volgende secties, meer in detail uitgewerkt wordt.  </p>  <p>  \tOp het einde van deze cursus ben je in staat om een 3D model van een gebouw, gemaakt in CAD of BIM software te integreren in fotorealistische beelden of een korte animatiefilm.  </p>", 
    "end_date": null, 
    "title": "Architectuur Visualisatie met Cinema 4D", 
    "price": "20.00", 
    "instructors": "Stefan Boeykens", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340420_c8c9_3.jpg", 
    "course_url": "https://www.udemy.com/architectuur-visualisatie-met-cinema-4d/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T10:17:44Z"
}