{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t          Art Fundamentals: Drawing and Painting Essentials covers the key foundational principles that underly artwork and it&#039;s creation. You&#039;ll discover the core fundamentals you need to know in order to be effective at learning to draw and paint, be it digital or traditional. Whether you&#039;re an aspiring concept artist, illustrator or comic artist, or you want to create beautiful paintings or manga illustrations from your imagination - this course is designed for artists of all levels.  </p>  <p style=\"\">  \t<strong style=\"\">Master The Essential Foundational Principles Of Drawing and Painting</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Learn how images are built, from 2D shapes to final finished paintings</li>  \t<li style=\"\">Understand how looseness, line weights and penmanship impact your artwork </li>  \t<li style=\"\">Grasp the fundamentals of a strong art workflow, and the real goal of a &quot;rough&quot;</li>  \t<li style=\"\">Gain insight on moving from vision to implementation, and reaching your idea</li>  \t<li style=\"\">Recognise the empirical patterns apparent in all artwork</li>  \t<li style=\"\">Learn to differentiate between art studies and art creation, and make real progress</li>  \t<li style=\"\">Embrace true 3D drawing by learning to &quot;Draw Through&quot;</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Learn Why Appealing Art Looks The Way It Does, And How To Do It</strong>  </p>  <p style=\"\">  \t          Professional concept artists, illustrators and painters have a deep understanding of how images are made - not just surface level things like &quot;how to draw a head&quot; or &quot;How to paint a sky&quot;, but the in-depth background understanding of why an image looks good, and feels good to look at. I&#039;ll show you the important fundamentals you need to know in order to have strong foundations in principles of creating art, whether you want to draw, paint, create comics, design concept art or illustrate manga.  </p>  <p style=\"\">  \t          Art Fundamentals: Drawing and Painting Essentials is the first course of a series, which covers every facet of art creation for imaginative representational realism - drawing and painting realism from your imagination. This course is designed for imaginative and creative people who want to draw and paint from their minds, no matter the style or medium.  </p>  <p style=\"\">  \t          I&#039;ve designed this course to be easily understood, and allow for efficient learning. Primarily focused on digital tools, most principles apply equally to traditional art tools as well, and you&#039;ll quickly see how you can switch between mediums easily. This first course covers the absolute foundations of imagery, and is a necessary step before moving onto other courses such as Perspective, Light and Form, Color, Composition, Anatomy, Character Design, Environment Design, Industrial Design and many more.  </p>  <p style=\"\">  \t          Upon completing this course, you&#039;ll have a rock solid grasp of how art is made - both in terms of workflow, and fundamental principles. You&#039;ll be ready to approach studying other topics with the right artistic mindset, and a comprehensive set of skills.  </p>", 
    "end_date": null, 
    "title": "Art Fundamentals: Drawing and Painting Essentials", 
    "price": "50.00", 
    "instructors": "Scott Harris", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358948_0eaf_3.jpg", 
    "course_url": "https://www.udemy.com/art-fundamentals-drawing-and-painting-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T08:02:02Z"
}