{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>**Course materials are last updated on November 22nd, 2014- A community of nearly 250 enrolled students** Available at $15 for a limited time</strong>  </p>  <p>  \t      Nowadays, the animation industry is booming and the demand for animators is increasing day by day. It has not been easy to find a proper animation training for beginners. Adobe&#039;s Flash is one of the most popular animation tool currently in the market. Adobe Flash is a multimedia and software program used for creating vector graphics and animation. Flash is also used for streaming videos. Adobe Flash is mostly popular for 2D animation. Adobe Flash Player makes the Flash content accessible on various operating systems such as Windows, OS X and Linux, and is available free of charge for common web browsers. Flash contents can also be viewed within mobile platforms. Latest version of Flash Player is compatible with 3D plugins as well. This course is designed for beginners and no prior animation knowledge is required to take this course. The course takes a step-by-step approach to start from the very basic and jump into the advanced flash animation techniques. You can become a master of animation using this course and take your learning to the next level. This course demonstrates basic and advanced animation concepts including designing characters, tracing characters, creating joints, working with outlines, accessorizing character, using replacement animation, rigging characters in flash, rigging replacement animation, and rigging characters using the bone tool. More advanced flash animation topics will be added to this course by next month which will add dialogues, stories and facial expressions to this cartoon animation course. Cartoon animation has made easy throughout this course. If you always wanted to become a full-time or part-time cartoon animator, then you should consider taking this course. Just like our other courses, most of the flash animation/cartoon animation tutorial videos are available for free for a limited time. Don&#039;t forget to enroll and take this life-changing step towards your passion for animation.  </p>", 
    "end_date": null, 
    "title": "Become Expert 2D Animator from scratch using Flash Animation", 
    "price": "20.00", 
    "instructors": "QAEversity .", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350272_4c3f.jpg", 
    "course_url": "https://www.udemy.com/become-expert-2d-animator-from-scratch-using-flash-animation/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T00:22:19Z"
}