{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>When I was <strong>12 years old</strong>, my parents took me on <em>“The Magic of Disney Animation\"</em> tour at Walt Disney World, where <strong>I saw REAL Disney Animators</strong> creating real Disney Animation. Less than 10 years later, at the age of 22, <strong>I became one of the youngest animators ever hired by Walt Disney Animation</strong>. </p><p>That day, I was just a child who formed a dream of working as an animator for Disney. That dream turned into a goal, and <strong>that goal turned into a burning desire</strong> that wouldn't let me stop until I achieved it.</p><p>This isn't just a course on “how to animate\" or \"how to become a character animator\". <strong>This is a course on how to achieve your biggest dreams!</strong> </p><p>I've reverse engineered the steps I used to turn the dream of a 12 year old into reality. You'll learn what it takes to <strong>get your Dream Job</strong> at an animation studio, and how to <strong>keep that job</strong>.<span></span></p><p>Of course I'll teach you about the <strong>12 Principles of Animation</strong> (the fundamental principles that ALL animation is based on), in fact I'll help you <strong>turn all 12 Principles into Habits</strong>. </p><p>But I'll ALSO teach you about yourself:<strong> How to motivate yourself</strong> to reach those big dreams, and <strong>how to STAY motivated</strong> even when everyone around you tells you to give up.</p><p>You should have a <strong>basic grasp of animation</strong>, and be able to use animation software such as <strong>Blender 3D</strong>, <strong>Maya</strong>, <strong>3DS Max</strong>, or <strong>any of the 2D animation packages</strong>.</p><p>The techniques and practices taught in this course can be applied to <strong>any</strong> form of animation, but <strong>you will need to practice</strong> them throughout the course.</p><p>I explain the concepts clearly, and there are video clips of each exercise being performed or animated, so you can follow along.</p><p>The course is <strong>12 weeks long</strong>, and requires you to do a small animation exercise every single day. It is broken into sections by week, with each week having 7 videos (one for each day of the week) plus a quiz at the end of each week.</p><p>There were many 'dark days' where even I lost faith and felt like giving up on my dream of being a professional character animator.</p><p>Now, in my mid-30's, I've worked for Disney, Fox Studios, and I run my own film and animation company - as well as an online animation community. I've managed to live and work in 7 countries around the world on everything from Feature Films, to Television Commercials, Video Games, and even Scientific Research. It's time to share my knowledge.</p><p>I'm here to tell you that <strong>you SHOULD Dream big</strong>, and <strong>you CAN reach your Dream Job </strong>as a character animator in games, film, television, or any area you desire.</p><p>Join me for <strong>12 weeks of mentoring, motivation, and animation training</strong>.</p><p>I'll see you on the other side.</p>", 
    "end_date": null, 
    "title": "Become a Professional Character Animator", 
    "price": "20.00", 
    "instructors": "DJ Nicke", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540274_bfd7_4.jpg", 
    "course_url": "https://www.udemy.com/become-a-professional-character-animator/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T14:35:17Z"
}