{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p class=\"max\">  \t   BIM Training. The rollout of BIM (Building Information Modelling) across the built environment industry is continuing apace. Obtain the knowledge and develop the skills to meet the current and forthcoming requirements with BIM Training Course.  </p>  <p>  \tThis is a beginners training course in the management principles for Building Information Modelling (BIM) projects.  </p>  <p>  \tLooking to redirect your career by managing BIM projects? Or maybe you’re seeking career enhancement in your current firm or want to become more competitive in the job market. Be one of the first to understand the requirements to operate BIM.  </p>  <p>  \tThe <strong>BIM Training </strong>course is one of THE most comprehensive, cost-effective BIM courses you’ll find on the web.  </p>  <p>  \tIt’s a one-stop-shop for everything you need to start putting together professional building information management systems that engage clients and other construction industry professionals, call them to action, and ultimately boost your career in this new and increasing used area!  </p>  <p>  \tIf you’re looking for a genuinely effective course that equips you to understand BIM and enhancing your career in the process, this is guaranteed to be the number one course for you.  </p>  <p class=\"max\">  \t            By outlining the fundamentals of Building Information Modelling (BIM), these tutorials provide clear road map for construction and design practitioners eager to learn the requirements to operate and work in this environment. Understand BIM’s drivers and impacts, key standards, and how to implement it to achieve your projects objectives.  </p>", 
    "end_date": null, 
    "title": "BIM Training", 
    "price": "30.00", 
    "instructors": "PAUL UGWU", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/100536_4997_4.jpg", 
    "course_url": "https://www.udemy.com/bim-training/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-02T17:02:46Z"
}