{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  Please contact me in order to get a coupon for the course. I WILL TRY TO SAVE YOU MONEY AND BEAT ANY INTERNET OR UDEMY PROMO COUPON.</p><p style=\"\">BIM is said to be one of the most exciting and disruptive processes and technologies in the industry today! By the time you finish this course you will have a much better understanding of how to manage BIM and BIM deliverables. We teach you to recognize the importance of BIM, define common BIM terms, and using BIM as a a collaboration tool. We will discuss benefits and go into detail about collaborative models.  We will discuss what successful BIM looks like and discuss how you can assess your project or company BIM needs. We discuss common tools and applications and how to select and manage these tools. All this and more in BIM Management -Process Planning Implementation Part 1. As part of this course I am offering Office Hours where registered students can ask me questions relating to the material. As a consultant I usually charge 75 dollars per hour but this service comes free with the course. Office hours will be limited and will be set by the instructor. Please contact me for details. </p><p style=\"\">Part 2 is a seperate course that goes even further into detail on topics covered in this course. It will be released shortly as its own course. It covers detailed spefics on BIM contract negotiations, subcontractor BIM negotiations and more Supplemental material from Part 1 on Project and company level BIM.</p><p style=\"\">Please contact me in order to get a coupon for both courses. I WILL TRY TO SAVE YOU MONEY AND BEAT ANY INTERNET OR UDEMY PROMO COUPON. </p><p style=\"\">KEY WORDS; bim, vdc, autodesk, revit, cad, 3d</p>", 
    "end_date": null, 
    "title": "BIM Training & Management - Learn the BIM Process today!", 
    "price": "35.00", 
    "instructors": "PJ M. Pena", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436872_097f_2.jpg", 
    "course_url": "https://www.udemy.com/bim-management-process-planning-implementation-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T20:10:44Z"
}