{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Over 4,200 students and a 5 star average don't lie, join us inside and learn the powerful techniques shown in Blender Unleashed!!!</strong></p><p><span></span>\"Brandon is easy to listen too, which always helps, and the course goes into enough detail without bogging you down. All videos are high quality and clear too. If you are looking for a way into Blender, this is the course for you!\" - Daniel Trevenna</p><p>\"Brandon,  thanks  for  putting this all together. I'm brand new  to Blender and have   learned so  much in just the few hours I've been  here.\" - Jeremiah  Dickens</p>\"I love the format and the spread of the tutorials. They are really short and to the point. Thank you.\" - Nashnir\"I've been using a mixture of books, YouTube, and this course to learn  Blender and so far I've found your course to be the most efficient  method of them all.\" - Lee Wasilenko<ul><p><strong>Do you want to create stunning works of art with Blender?</strong></p></ul>  <ul>  \t<li>Are you a complete beginner to the world of 3d art?</li>  \t<li>Do you dream of creating your own 3d illustrations?</li>  \t<li>Are you an indie filmmaker?</li>  \t<li>Ready to add 3d skills to your production pipeline?</li>  \t<li>Want to start a career in computer animation?</li>  \t<li>Have you tried to learn Blender in the past, but failed?</li>  \t<li>Are you ready to move to Blender but don't know where to start?</li>  </ul>  <p><strong>If you answered yes to any of these questions then this course was designed specifically for you.</strong> It is guaranteed to unlock your potential to becoming a  professional 3d illustrator, visual effects artist, professional animator, or indie game developer.  </p>        <ul>  \t<ul>  \t\t<li>Great for complete beginners to 3d</li>  \t\t<li>Designed for people who need to migrate from other 3d software</li>  \t\t<li>Immediately practical to you and your projects</li>  \t\t<li>A comprehensive course covering all the basics in Blender</li>  \t\t<li>Covers Blender's user interface, modeling, texturing, lighting, and rendering</li></ul></ul>  <p><strong>By the end of this course you will have mastered the fundamentals of Blender and be confident in your ability to tackle bigger challenges.  </strong></p>      <p>  \t<strong>The best part? You won't have to spend a dime on software to get started.</strong>  </p>  <p>  \t                                                                      Blender is 100% open source software and free to download. So you can get started immediately after getting this course. But  don't  make the mistake of thinking Blender lacks any of the professional punch found  in  the so-called \"standard\" industry software.  </p>    <ul>  \t<ul>  \t\t<li>Blender is maintained by a global community of artists and engineers</li>  \t\t<li>Always up to date with new features month to month</li>  \t\t<li>Free upgrades to the software for life</li>  \t\t<li>There's always help from the community when you need it</li>  \t</ul>  </ul>  <p>  \t                      As you grow as an artist Blender grows with you. Free yourself from the constraints of locking into expensive software and embrace the power of the open source community.  </p>  <p>  \t<strong>By purchasing this course today you are locked in at and will never have to pay another dime. Future updates to the course are yours completely free of charge.</strong>  </p>    <p>  \t<strong>No experience? No problem.</strong>  </p>  <p>  \t                                                            I understand how hard it can be to hit the ground running when you're  trying something new. But I'm here to put your  mind at ease and simplify the learning curve.  </p>    <ul>  \t<ul>  \t\t<li>Detailed and No Fluff</li>  \t\t<li>Designed for you to take at your own pace</li>  \t\t<li>Explanation of the why along with the how to</li>  \t\t<li>Provides you with an entire scene built from the ground up</li>  \t</ul>  </ul>  <p>  \t                                                                                 This course will take you from being a curious spectator from the outside looking in to a valued member of the 3d arts community and giving you the tools necessary to ensure success in your creative goals.  </p>  <p>  \t<strong>Are you ready to unleash your creative potential? Then get this course now and start mastering Blender!  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Blender Unleashed: Master 3d Fundamentals Quickly", 
    "price": "35.00", 
    "instructors": "Brandon Hix", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238040_04b4_10.jpg", 
    "course_url": "https://www.udemy.com/blender-3d-unleashed/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-05T21:47:28Z"
}