{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Entdecken Sie die Möglichkeiten von Blender 2.7! Sebastian König ist zertifizierter Blender-Experte und zeigt Ihnen Film für Film, wie Blender funktioniert. Sie lernen den kompletten 3D-Workflow kennen: Modelling, Texturing, Beleuchtung und Rendering mit der Cycles-Engine. Fortgeschrittene Workshops zu Kamera-Tracking, Rigging, 3D-Simulation und ein Ausflug in die Welt des Animationsfilms bieten umfassendes Praxiswissen für alle Blender-Enthusiasten.</p>\n\n<ul><li><strong>Die Schulung mit dem beliebten Blender Foundation Certified Trainer</strong></li><li><strong>3D-Modelle erstellen, texturieren und perfekt ausgeben</strong></li><li><strong>Charakter-Design, Animation, Simulation, Camera-Tracking</strong></li></ul>\n\n<p><br>Sebastian König ist selbstständiger 3D-Artist und Blender Foundation Certified Trainer. Sein Spezialgebiet sind 3D-Visualisierung und Visual Effects. Er ist einer der führenden Blender-Trainer und vermittelt sein Wissen in Video-Tutorials oder als Dozent und freier Trainer in Privat- und Firmenschulungen. Als Freelancer arbeitet er hauptsächlich mit der Open-Source-Software Blender, den Creative-Programmen Premiere Pro und After Effects sowie dem Matchmoving-Programm Syntheyes. Seine Fähigkeiten im Bereich Motion Tracking und Compositing stellte er in dem offiziellen Blender-Film »Tears of Steel« (2012) unter Beweis.</p>", 
    "end_date": null, 
    "title": "Blender 2.7 – Das umfassende Training", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589570_422a.jpg", 
    "course_url": "https://www.udemy.com/blender-27-das-umfassende-training/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T16:20:32Z"
}