{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Do you want to learn how to create hyper detailed hard surfaced and organic 3d models ready for films, games, or illustrations?</strong></p><p>This course shows you how to use subdivision surface modeling techniques to conquer any modeling challenge set before you. Once you have mastered this powerful workflow you will be able to use it as a cornerstone for all of your future 3d modeling projects.</p><p><strong>Learn how to harness the power of Blender's subdivision surface modifier in conjunction with timeless procedural modeling skills to build realistic looking 3d models.</strong></p><ul><li>Learn the basics of subdivision surface modeling</li><li>Master Blender's modifier stack</li><li>Add procedural modeling techniques to your creative arsenal</li><li>Discover secrets for success as I share my experience</li><li>Watch as I walk you through the process step by step</li></ul><p><strong>Each real world project demonstrated real-time with practical solutions.</strong></p><p>The best way to learn is to do! Each project in this course is demonstrated real time as I walk you through my thinking process as I make decisions for how to solve problems and create practical solutions. All of the .blend files are provided for each lecture as I progress through the projects so you can pick up wherever you need to and follow along. Start at the beginning or pick up in the middle and learn how to develop your own skills with the hands on training inside this course.</p><p>After following the workflow outlined in this course you'll be able to take a proof or a concept and develop a plan for how to achieve the results you need using subdivision surface modeling.</p><p><strong>Content and Overview</strong><br></p><p>Starting with a brief overview of the subdivision surface workflow I'll then share my process for building out hi-res 3d models for a 3d illustration. Each project builds on the last providing stepping stones for learning more advanced techniques after mastering the basics.</p><p><span>Each project starts with an overview of the intended goals from the concept. Then I show you how to build each model starting with the creation of a base mesh and refining it with the sub-d process into a final model. Along the way I'll share my tips for success and how to avoid problems as you work on your own modeling projects.</span></p><p><strong>Upcoming Features</strong></p><ul><li><strong>An accompanying e-book</strong> - complete with a helpful breakdown of the concept for the projects in the course and a reference for keyboard shortcuts</li><li><strong>New lectures</strong> - The course will be continually expanded with new lectures and projects where I answer your questions and continue to demonstrate sub-d modeling techniques</li></ul><p>Purchase this course today and learn how to implement subdivision surface modeling for your own projects immediately!</p>", 
    "end_date": null, 
    "title": "Blender Unleashed: Mastering Subdivision Surface Modeling", 
    "price": "35.00", 
    "instructors": "Brandon Hix", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570204_c1fa_13.jpg", 
    "course_url": "https://www.udemy.com/blender-unleashed-mastering-subdivision-surface-modeling/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T15:03:31Z"
}