{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong>Character Design MADE EASY with Anime Studio Pro</strong><br></p><p style=\"\">==================================================================</p><p style=\"\"><strong>What is this course about?</strong></p><p style=\"\">========================</p><p style=\"\">This course is about those who have <strong>no natural drawing ability but want to draw anyway</strong>. It is also about <strong>turning a sloppy drawing into a refined piece</strong> that is <strong>ready to rig</strong> and subsequently animate.</p><p style=\"\">Drawing for those who lack the natural ability can be a struggle. If you however do have some natural ability when it comes to drawing, this course will translate to you on a different level. Anime Studio Pro makes it as easy as humanly possible to draw what you imagine. The drawing tools are simple but unlike anything else out there. Once you master their tools, it's a matter of playing it smart and using a reference image to achieve the character you want.<strong> IT IS THAT SIMPLE.</strong></p><p style=\"\">=======================</p><p style=\"\"><strong>What material is included?</strong></p><p style=\"\">=======================</p><p style=\"\">This course like our others is a no fluff, straight to the core, course. In it we dive right in to actually using the tools Anime Studio offers to draw our characters. <strong>Each character we draw is free for you to use commercially for any of your projects! </strong></p><p style=\"\">We are constantly drawing in Anime Studio and as a result we will be constantly updating this course. At the moment there are 4 ready to rig characters for you to follow along with and or use. But as you check back we will be updating the course with more and more characters and start building an Anime Studio character design community. </p><p style=\"\">=======================</p><p style=\"\"><strong>Why take this course?</strong></p><p style=\"\">=======================</p><p style=\"\">In this course we will walk you through step-by-step how to draw and organize a character ready for animation. We will talk about why Anime Studio Pro works for character animation and demonstrate how we use it as a premiere drawing tool. These lectures are gold for those who have had trouble in the past drawing digitally but even more so as we continue to update, these lectures will give you the experience in character design you have been missing!</p><p style=\"\">++++++++++++++++++++++++++++</p><p style=\"\"><strong>Is this course right for me?</strong></p><p style=\"\">++++++++++++++++++++++++++++</p><p style=\"\">This course might not be right for you if you are already a well equipped digital artist. But even if you are comfortable at drawing you can still learn how we make ready to rig characters that utilize Anime Studio to its full extent.</p><p style=\"\">I hope you will join us in the ever increasing world of character design!</p>", 
    "end_date": null, 
    "title": "Character Design MADE EASY with Anime Studio Pro", 
    "price": "20.00", 
    "instructors": "Jeremy Alexander, McCoy Buck", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553876_6232_4.jpg", 
    "course_url": "https://www.udemy.com/character-design-made-easy-with-anime-studio-pro/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T01:13:24Z"
}