{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\">Character Rigging Made Easy with Anime Studio Pro</strong><br style=\"\"></p><p>==================================================================</p><p><strong style=\"\">What is this course about?</strong></p><p>========================</p><p><strong style=\"\"></strong>This course is for those who have <strong style=\"\">created a character in Anime Studio or any other drawing software</strong> and want to take it to the next level by <strong style=\"\">rigging it</strong>. Take your character design and give it a <strong style=\"\">professional rig</strong> using the <strong style=\"\">techniques</strong> and <strong style=\"\">tools</strong> taught here. </p><p>Rigging for those who do not understand the tools and how to use them in Anime Studio can be a struggle. If you however do have some knowledge of rigging we will take you to the next level and teach you all you can to unlock the potential of your rig. Anime Studio Pro makes it as easy as humanly possible to rig your character. The rigging tools are simple but unlike anything else out there. Once you master their tools, it&#039;s a matter of playing it smart and tweaking a couple things here and there to give yourself a ready to animate rig. <strong style=\"\">IT IS THAT SIMPLE.</strong></p><p>=======================</p><p><strong style=\"\">What material is included?</strong></p><p>=======================</p><p>This course like my others is a no fluff, straight to the core, course. In it I dive right in to actually using the tools Anime Studio offers to rig our characters. Each character I rig is free for you to use commercially for any of your projects!</p><p>I am constantly rigging in Anime Studio and as a result I will be constantly updating this course. At the moment there is one fully rigged character for you to follow along with and or use. But as you check back I will be updating the course with more and more characters and start building an Anime Studio character design community.</p><p>=======================</p><p><strong style=\"\">Why take this course?</strong></p><p>=======================</p><p>In this course I will walk you through step-by-step how to rig and organize a character ready for animation. These lectures are gold for those who have had trouble in the past with their 2D rig but even more so as we continue to update, these lectures will give you the experience in character rigging you have been missing!</p>=======================<p><strong style=\"\">Is this course right for me?</strong></p><p>=======================<br style=\"\"></p><p>This course might not be right for you if you are already a well equipped Animator with a full knowledge of rigging. But even if you are comfortable at rigging you can still learn how we make ready to animate characters that utilize Anime Studio to its full extent.</p><p>I hope you will join us in the ever increasing world of character rigging!</p>", 
    "end_date": null, 
    "title": "Character Rigging MADE EASY with Anime Studio Pro", 
    "price": "20.00", 
    "instructors": "McCoy Buck", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588006_451c_2.jpg", 
    "course_url": "https://www.udemy.com/character-rigging-made-easy-in-anime-studio/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T01:51:22Z"
}