{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Questo corso riguarda la grafica 3D con lo scopo di realizzare un video animato per il campo della motion graphics utilizzando Cinema4D.\n\n  </p>\n\n<p>  Al suo interno sono presi come esempio 2 dadi che rotolano, per passare attraverso le fasi principali di produzione partendo da zero. In questo modo sarà possibile per i principianti muoversi nel campo della grafica 3D.\n\n  </p>\n\n\n\n<p> Non occorre essere esperti nella terminologia: all' interno del corso sono presenti comandi specifici con nomi specifici, ma il corso è focalizzato principalmente sui processi di produzione piuttosto he sui singoli comandi o le singole versioni dei softwares. Perciò permetterà di applicare le conoscenze acquisite su qualsiasi contesto analogo.\n\n  </p>\n\n\n\n<p> Il corso è organizzato tramite video e sono disponibili per il download le texture utilizzate all' interno del progetto.\n\n  </p>\n\n\n\n<p> Il tempo necessario per terminare il corso è di 1 settimana.\n\n  </p>\n\n\n\n<p> Il corso è diviso in 2 aree principali: la prima mostra come realizzare un rendering statico, la seconda come animare oggetti e costruire un video.\n\n  </p>\n\n\n\n<p>Perciò gli argomenti iniziali sono relativi alla modellazione e al texturing, per passare successivamente al rigging, animazione e rendering di sequenze animate.\n\n  </p>\n\n\n\n<p>I softwares utilizzati sono:\n\n  </p>\n\n\n\n<p> \n\n  - Cinema 4D: modellazione, illuminazione, cineprese, materiali e animazione.\n\n  </p>\n\n\n\n<p>- Photoshop, Mudbox: texturing\n\n  </p>\n\n\n\n<p>- After Effects, Premiere: Compositing e editing.\n\n  </p>\n\n\n\n<p> \n\n  Questo corso illustrerà tutto ciò che occorre per realizzare una animazione 3D e, soprattutto, nella modalità più semplice possibile. Perciò il risultato finale è garantito al 100%: Quello che vedi, lo imparerai. </p>", 
    "end_date": null, 
    "title": "Cinema 4D - Corso Base Vol.1 (italiano)", 
    "price": "30.00", 
    "instructors": "Francesco Ugolini", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/820940_17f1_2.jpg", 
    "course_url": "https://www.udemy.com/cinema-4d-corso-base-volume-1-italiano/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T13:56:54Z"
}