{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<ul><li><strong>Do you want to create 3D Models?</strong></li><li><strong>How about adding 3D Animations to your videos?</strong></li><li><strong>Did you try to learn 3D Animation and it was just too confusing?</strong></li><li><strong>Or maybe you want to learn the basics of D</strong><strong>esigning in 3D?</strong></li></ul><p>If you ever wanted to learn how to add 3d objects to you videos, or how to create cool looking 3d videos - you will love this course.</p><p>If you are an experienced video editor or a new inexperienced editor, you probably have a drive to always make your videos look better and more professional. for me adding 3D elements into my video was always a way to make better videos. with this course I am going to give you the tools to do the same.<br></p><p>In this course I am going to teach you how to create and add 3d designs into your video with ease. The software we will be using is Cinema 4D. this is one of the leading 3d modeling and animation softwares out there. In fact it is so much used that if you have After Effects on you computer you already have it, as it comes with the new versions of After Effects.</p><p>This course has everything you need to get up and start running with Cinema 4D. The course has different modules with a total of more than 40 lessons. in total that is more than 5.5 hours of video taking you from beginning to end through 6 different designs. </p><p>The projects we will create are very versatile and they are things I created for my own use so it is not some design that no one used - they are real life projects. you will also get 33 Cinema 4D file that will take you through the whole evolution of the designs lesson by lesson.</p><p>You will also learn how to Design, Animate and import into After Effects and color correct, using the different design tools, using selection tools, using animation tools, keyframing, creating repeating animations and the list goes on and on and on. </p><p>if you are subscribed to my courses you already know, i am going to add more content to this course as time goes along to share more tips, tricks and designs with you. </p><p>so start creating amazing 3d animation and take this course now.</p><p>i’ll see you in the course.</p>", 
    "end_date": null, 
    "title": "CINEMA 4D Unleashed - Master 3D Fundamentals", 
    "price": "20.00", 
    "instructors": "Uri Soglowek", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692964_9a22.jpg", 
    "course_url": "https://www.udemy.com/cinema-4d-unleashed-master-3d-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T13:12:21Z"
}