{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t El objetivo de este curso es adentrase a un nivel mas avanzado, ver la animación a través de módulos mas complejos como Mograph, Thinking Particles y dinámicas, los más indicados a la hora de crear motion graphics. También se hace una introducción al modulo o flujo de trabajo expresso que nos servirá a la hora de programa algunas animaciones mas complejas de partículas.  </p>  <p>  \t CINEMA 4D Studio es lo mejor para ofrecer a los artistas profesionales del 3D. Si quiere hacer gráficos avanzados en 3D pero necesita un apoyo para asegurarse de crear asombrosos gráficos de forma rápida y fácil, entonces esta es la opción ideal.  </p>  <p>  \t Este curso está impartido por Edgar Suárez, licenciado en bellas artes, audiovisual y diseño por la escuela de arte Fernando Estévez. Su trabajo abarca un campo amplio de las artes visuales como motion graphics, compositing, diseño gráfico, fotografía, edición y postproducción de video. Ha desarrollado su actividad en empresas  como Intricate Production S.L. donde ha trabajado como freelance illustrator y digital compositor y 3D. Ha trabajado como operador Cinema 4D en Hankook. Actualmente trabaja como grafista en Zeppelin TV.  </p>  <p>  \t En el curso cubriremos los siguientes temas:  </p>  <ul>  \t<li>Conectores</li>  \t<li>Simulaciones físicas</li>  \t<li>Simulaciones complejas</li>  \t<li>Simulación de pelo</li>  \t<li>Sistemas de partículas en Cinema 4D</li>  \t<li>Fuerzas y partículas</li>  \t<li>Herramientas MoGraph</li>  \t<li>Herramienta MoSpline</li>  \t<li>Poly FX</li>  \t<li>Thinking particles </li>  </ul>", 
    "end_date": null, 
    "title": "Cinema 4D Avanzado", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176976_dd96.jpg", 
    "course_url": "https://www.udemy.com/cinema-4d-avanzado/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-05T00:27:37Z"
}