{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>A very unique Blender 3D course about the creation of environments, taught by environment artist Rob Tuytel. Through out each of the many lessons you are introduced to the powerful and free Blender 3D program. After becoming familiar with the Blender user interface, students will learn how to create a landscape design from scratch. Additional videos in this series teach students how to apply materials, lights and even advanced node systems to their models. Finally, this series will show students how to make an organization plan and create a very advanced environment scene including buildings and characters.</p>\n\n<p>The final course scene was rated well on Artstation with more than 215 + likes. Find out what makes an artwork special and be part\nof the developing process.<br></p>\n\n<p><strong>You will learn:</strong></p>\n\n<p>We start with installing Blender and making some simple objects. We get in touch with the Blender interface and I will show the most used buttons in this course. </p>\n\n<p>We continue with making a fence and add a simple wood texture. You will get in touch with the UV image editor and learn how to apply textures on your model. Then I will explain the material editor and show how nodes work. You will learn how to make a simple shader combination to add moss on the fence. I will also show some other shaders like transparency and translucency.</p>\n\n<p>After these lessons we start with the building process, first making a simple building, but after making some progress we will start creating more advanced buildings, including ornaments. </p>\n\n<p>After completing the buildings, we start with the nature part and I will explain how to make grass, flowers, weed, rocks and trees. We will use 'The Grove 3D' to generate trees. After the nature part we will make a landscape scene and add all the objects including a sand path with water puddles. </p>\n\n<p>After the nature chapter we will focus on atmosphere and lighting, using the point and sun lamp to make a light setup. We will also use an environment map to light the scene. In the end we will use some atmosphere fog to create mist in the scene.</p>\n\n<p>Then it's time to create the final scene, we start from scratch and use a scene map as a reference and make a rough setup. From that point we build the scene and face all the challenges that comes with environment modeling. In the end we do a final review and finalize the scene.</p>\n\n<p><strong>This course is recorded in blender 2.75 and 2.76b. We will use the cycles render engine</strong></p>", 
    "end_date": null, 
    "title": "Creating 3D environments in Blender", 
    "price": "35.00", 
    "instructors": "Rob Tuytel", 
    "commitment": "33.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683198_ef78_4.jpg", 
    "course_url": "https://www.udemy.com/blender-environments/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T09:40:59Z"
}