{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Want to take your Logo design to the next level??<br>Then this course is for you!</strong></p>\n\n<p>During this course I will show you how to create 3D Objects in this case text from a curve generated from Illustrator, We will also look at generating 3D text within Maya itself.<br>Finally I will show you how to add materials, set up a basic three point light system and render out using Mental ray, this course on <strong class=\"redactor-inline-converted\">Creating Logos - A Maya Online Course Custom Logo and Text</strong> is a must!</p><p><strong class=\"redactor-inline-converted\">So Exactly what do I learn from this course?</strong></p><ul><li>Import EPS curves from Illustrator into maya and generate Geometry we can work with from it</li><li>Set up a scene, and keep it clean</li><li>Install Mental ray for rendering</li><li>Add material types both Maya and Mental ray materials</li><li>Set up a basic lighting set up</li><li>Create a basic animation and out put the sequence to be composited in After effects</li><li>Generat text directly inside of Maya</li><li>Extrude, add edge loops, merge vertexes and a host of other things</li></ul><p>This course is very thorough and cover quite a lot for such a short course giving you the info fast!</p><p><em><strong>Take the Creating Logos - A Maya Online Course Custom Logo and Text course today!</strong></em></p><p><em class=\"redactor-inline-converted\">I hope you enjoy this course and get a lot out of it<br>All the best<br>The Monster-Training Team</em><br></p>", 
    "end_date": null, 
    "title": "Creating Logos - A Maya Online Course Custom Logo and Text", 
    "price": "20.00", 
    "instructors": "David Newton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/849306_5bf2_2.jpg", 
    "course_url": "https://www.udemy.com/creating-logos-in-maya-online-course-custom-logo-and-maya-text/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T20:18:36Z"
}