{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  En este curso de Modelado y Texturizado de Nave Espacial aprenderemos a realizar un modelo completo mediante software de modelado y pintura 3D. Realizaremos todo el proceso creativo, partiendo de un boceto inicial, para lograr una imagen final de apariencia realista.  </p>  <p>  \tMaya es una potente solución integrada de modelado 3D, animación, efectos y renderización. Dado que Maya se basa en una arquitectura abierta, es posible programar o aplicar guiones sobre sus trabajos utilizando una API (Interfaz de programación de aplicaciones) extensa y bien documentada, o uno o dos lenguajes de programación integrados. Esto, combinado con el mejor conjunto de herramientas 3D del sector, hace de Maya una solución que le permitirá hacer realidad sus ideas creativas. Combinando una interfaz intuitiva del usuario con una suite de herramientas creativas de alto rendimiento, el software de esculpido digital y pintura de texturas Autodesk® Mudbox™ ofrece a los profesionales del modelado 3D la capacidad para crear recursos 3D orgánicos e inorgánicos altamente detallados de manera rápida y fácil.  </p>  <p>  \tEste curso está impartido por Jose Luis Quirós. Con más de 15 años de experiencia en producciones audiovisuales y en 3D, comenzó de forma autodidacta y gracias a la carrera profesional de diseño industrial creó mis primeros modelos 3D; estudió 3ds max, maya y softimage. Ha trabajado en largometrajes de animación, videojuegos, publicidad y cine y ha dirigido proyectos como los Marcatoons y participado en cinco largometrajes, el último de ellos nominado a los premios Goya.  </p>", 
    "end_date": null, 
    "title": "Crea una nave espacial en 3D", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177596_d44f.jpg", 
    "course_url": "https://www.udemy.com/crea-una-nave-espacial-en-3d/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T00:33:10Z"
}