{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course you will learn a powerful new workflow between Creating a 2D composition in photoshop and animating your artwork in after effects.</p>\n<p>We take a first lesson to explain the process of creating a matte painting of your composition in photoshop then we jump right into creating our project, by learning how to use photoshop projects in after effects , we learn ways to position our layers, Animating a flying bird , using our camera for animation and working with particles to create a realistic Snow from the scratch and finally rendering our project in after effects also for bonuses we will show you how to work with adobe audition and adobe premiere pro to edit and Mix a very Cool soundtrack for our project to bring our animation to life .</p>\n<p>This course is full of helpful tool for getting some of the toughest part of the photoshop and after effects working easy for you, issues like , animating a bird wings, camera movement, working with particles are explained in depth so you can let your creativity flow.</p>\n<p>This course is assuming you have intermediate experience in photoshop and after effects , however we take a step by step approach so you can follow along. If you have never used photoshop or after effects and you are interested to animate your artworks this course will show you how to start and where to focus on. by the end of this course you have a good knowledge of creating and animating your projects.</p>", 
    "end_date": null, 
    "title": "Create and Animate your Photo-Composition in Photoshop & AE", 
    "price": "20.00", 
    "instructors": "Soli Art", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715444_9c86.jpg", 
    "course_url": "https://www.udemy.com/creating-and-animating-photo-composition-in-photoshop-after-effects/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T10:47:23Z"
}