{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>\"You aren't just going to learn here how to shoot the video, how to use the software, how to animate 3D figures. No. You'll learn all that plus how to write a script, how to market your video (and your business), and how to hire an illustrator. This is truly a comprehensive course. The instructor breaks everything down in small, easy-to-understand steps so as not to overwhelm you.\" </em></p><p>- Sally Apokedak, just one of 3500+ students who have taken this course on Udemy.</p><p><br></p><p><strong>Hey there :)</strong></p><p>It's Dave here, the instructor of this Udemy course, and it's great to meet you.</p>  <p>  \t    Over the next 30 days, I'd like to help you fulfil your dream to help thousands of people around the world through your business, and be recognised and remembered as someone who really cared for those they served. Not only that, I'm going to help you (hopefully) make some money in the process.</p>  <p>  \t    You got into business to help people, right? I know, your heart is in the right place. But intent alone is just not enough today to get people to take that very first step into your shop, offline or not. There are just so many businesses vying for attention.  </p>  <p>  \t    You need some way to communicate your passion that makes you stand apart from everyone else, and that's where I come in: to help you humanise your brand, and to show people that you love them, and truly care about their future.</p>  <p>  \t    Now, a 3D explainer video for your Business may sound complex but with 11.5 hours of carefully scripted training, this course breaks down everything from the very basics no matter what your experience level.  </p>  <p>  \t    Learn how the professionals work by exploring how to easily build engaging 3D worlds, control a camera in 3D space and animate a 3D model of a product in living and breathing places. Think Toy Story with a pleasing sales pitch at the end.</p>  <p>  \t    Learn how to write a script that converts, how to represent your customer's true wants/needs in animation, and timeless triggers in marketing to motivate your customer to buy from you. Merge sales material with Pixar-like storytelling so your prospects feel understood AND entertained.</p>  <p>  \t    And that's not all. Build your knowledge in 6 Adobe programs, all available in Adobe's 30 day free trial. Increase your own personal marketable value and even resell your unique 3D demo video services to an explosion of entrepreneurs right now, desperate to set their website apart.  </p>  <p>  \t    Join the 3500+ community of Animation Creatives today and start bringing boring brands to life!  </p>", 
    "end_date": null, 
    "title": "Create a Brilliant 3D Explainer Video for Your Business", 
    "price": "50.00", 
    "instructors": "David Hawkins", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320012_60ad_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-brilliant-3d-demo-video-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T08:37:22Z"
}