{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t     In this course , create your animated short, I introduce you to story developing skills , 3Ds max 2014 modeling, rigging, animation, rendering, After Effects cs6 basic composting and Adobe premiere cs6 Editing skills. Designed for the beginner, it starts with the basics to get you started and later it gets more practical developing your production skills on all stages and the steps needed to create animated shorts.  </p>  <p style=\"\">  \t     Starting with the building blocks you will need to be successful and achieve your goals. In pre-production you will be introduced to concept, story and script writing, storyboard and animatic. In the production stage, you will develop modeling, texturing, rigging, and character animating skills. Finally, in the post production, we will place lights, cameras, render the scenes and do the composting and editing.  </p>  <p style=\"\">  \t     A multiple skill and software course is at your hands to master. It&#039;s an All in One Production Course.  </p>  <p style=\"\">  \t      Projects are provided for you to learn by applying techniques directly throughout the training course. By the end of this course, you will be well informed and trained in the animated shorts creation process.  </p>  <p style=\"\">  \t<span style=\" color:inherit;\">The Best Way to know the workflow and create your Animated shorts. </span>  </p>  <h5 style=\"\"><span style=\" color:inherit;\">Multiple Resources for you to Start making your animation Right Away. </span><span style=\" color:inherit;\">You can do it!</span></h5>  <p style=\"\">  \t     Finally, you can create your animated short depending on yourself.  If you&#039;ve always wanted to know how to make your own animation, or wanted a simple and comprehensive way to guide you through out the production process, this course is definitely for you.  </p>  <h5 style=\"\">Gear up and prepare yourself for Deep dive!!</h5>  <p style=\"\">  \t  *Note: Software versions used 3Ds max 2014 and Adobe cs6 (Audition - Photoshop - After effects - Premier)  </p>", 
    "end_date": null, 
    "title": "Create Your Animated Short", 
    "price": "20.00", 
    "instructors": "Jasim Oqaili", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/216938_ef4e_7.jpg", 
    "course_url": "https://www.udemy.com/create-your-animated-short/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-13T05:03:12Z"
}