{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t En este tutorial se va a modelar el personaje de un pulpo a partir de un esqueleto realizado con Zspheres. Posteriormente lo dotaremos de detalle utilizando los métodos de esculpido y la creación de alphas personalizados en Photoshop.  </p>  <p>  \t Zbrush  es un software de modelado 3d , escultura y pintura digital que constituye un nuevo paradigma dentro del ámbito de la creación de imágenes de síntesis gracias al original planteamiento de su proceso creativo .<br>  \t <br>  \t Este curso es impartido por Daniel Bertó, dedicado a mundo del 3D desde hace más de diez años, dentro de su curriculum académico podemos destacar, un Master en Infoarquitectura, un Master en Modelado y Animación de personajes, un Master en Mudbox, así como la Carrera de Dirección de Cine Digital y efectos especiales THX. Su experiencia laboral comienza en el campo de la infoarquitectura , y posteriormente en la publicidad, los videojuegos y la dirección de un Teaser Trailer en 3D, donde dirigió un equipo de once personas y en el que coordinó los departamentos de modelado, texturizado, iluminación y render.  </p>  <p>  \tEn este curso cubriremos los siguientes puntos:  </p>  <ul>  \t<li>Creación y uso de Zspheres</li>  \t<li>Uso de adaptative skin</li>  \t<li>Esculpido y detallado del modelo</li>  \t<li>Creación de alphas en Photoshop</li>  \t<li>Uso de ruido</li>  \t<li>Adición de detalles superficiales</li>  </ul>", 
    "end_date": null, 
    "title": "Crea un pulpo con ZBrush", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184216_4991.jpg", 
    "course_url": "https://www.udemy.com/crea-un-pulpo-con-zbrush/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-17T21:32:20Z"
}