{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t                              Un semplice esempio può bastare per comprendere l'<strong>enorme potenzialità dei Blocchi Dinamici</strong>: in questo video corso, tra gli esempi di costruzione di  blocchi Dinamici, troverete una porta finestra con balconi e questa avrà 19 possibilità di modifica in larghezza, 37 in altezza e quattro combinazioni di apertura dei balconi; in pratica, in un unico blocco Dinamico riusciamo a gestire, in modo molto semplice, <strong>l</strong><strong>'equivalente di 2812 blocchi statici</strong>. </p>\n\n<p>  \t                              Per chi lavora nell'ambito meccanico, architettonico, elettrico e impiantistico dove si devono gestire progetti con <strong>molti simboli </strong>conoscere l'ambiente dei blocchi Dinamici può far <strong>risparmiare un'enorme quantità di tempo</strong> e, sopratutto, <strong>semplificare la gestione delle librerie dei propri simboli in quanto ne riduce drasticamente il numero.</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t              Ogni lezione è stata realizzata per farvi apprendere tutte le tecniche per costruire Blocchi Dinamici: conoscerete <strong>cosa sono i Parametri e le Azioni</strong>, come assegnarli alle geometrie del blocco; <strong>numerosi esempi passo-passo su come realizzare blocchi dinamici dai più semplici ai più complessi</strong>  utilizzando i due metodi: <strong>Parametri e Azioni</strong> e <strong>Vincoli Parametrici </strong>e, sopratutto, sfruttando le superfici associative di Autocad <strong>si riuscirà a costruire blocchi dinamici 3D completamente parametrici.</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Con l’acquisto di questo Video Corso l’accesso a tutto il materiale didattico a <strong>tempo indeterminato (per sempre) su ogni piattaforma: pc, tv, tablet, smartphone...</strong>, proprio come un canale on-demand e avrete, inoltre,  la <strong>possibilità di scaricare</strong> i disegni di esempio in formato GIF e, inoltre<strong>,</strong><strong> </strong><strong>tutte le Video Lezioni del corso in </strong><strong>formato Alta Definizione</strong> in questo modo diventeranno davvero vostre e le avrete sempre disponibili e consultabili in ogni momento, indipendentemente dal collegamento Internet.<br></p>\n\n\n\n\n\n\n\n\n\n<p>Il corso sarà continuamente aggiornato con nuove e inedite lezioni, tutto questo senza alcuna variazioni di prezzo.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tIl prezzo del video corso è IVA compresa.  </p>", 
    "end_date": null, 
    "title": "Creare Blocchi Dinamici 2D e 3D in AutoCAD - Dynamic Blocks ", 
    "price": "50.00", 
    "instructors": "Gelindo Parisotto", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359882_4f23_4.jpg", 
    "course_url": "https://www.udemy.com/creare-blocchi-dinamici-2d-e-3d-in-autocad-dynamic-blocks/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T18:24:20Z"
}