{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t En este curso de creación de plantas y árboles con Paint Effects aprenderemos a realizar un entorno realista 3D con las técnicas más avanzadas de generación de plantas y shaders. Estudiaremos todo el proceso creativo para, partiendo de cero, lograr una imagen final de apariencia realista, con unos sencillos y claros pasos al alcance de todos.  </p>  <p>  \t Maya es una potente solución integrada de modelado 3D, animación, efectos y renderización. Dado que Maya se basa en una arquitectura abierta, es posible programar o aplicar guiones sobre sus trabajos utilizando una API (Interfaz de programación de aplicaciones) extensa y bien documentada, o uno o dos lenguajes de programación integrados. Esto, combinado con el mejor conjunto de herramientas 3D del sector, hace de Maya una solución que le permitirá hacer realidad sus ideas creativas.  </p>  <p>  \t Este curso está impartido por Jose Luis Quirós. Con más de 15 años de experiencia en producciones audiovisuales y en 3D, comenzó de forma autodidacta y gracias a la carrera profesional de diseño industrial creó mis primeros modelos 3D; estudió 3ds max, maya y softimage. Ha trabajado en largometrajes de animación, videojuegos, publicidad y cine y ha dirigido proyectos como los Marcatoons y participado en cinco largometrajes, el último de ellos nominado a los premios Goya.  </p>  <p>  \t Estos son lo temas que cubriremos en el curso:  </p>  <ul>  \t<li>Herramienta Paint effects</li>  \t<li>Creación de plantas</li>  \t<li>Configuración de Paint effects</li>  \t<li>Creación de árboles mediante pinceladas con Paint effects</li>  \t<li>Materiales Mental Ray aplicables a geometrías creadas con Paint effects</li>  \t<li>Global Illumination (GI) en Mental Ray</li>  \t<li>Renderizado de una escena</li>  </ul>", 
    "end_date": null, 
    "title": "Creación de plantas 3D", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176988_ce7d.jpg", 
    "course_url": "https://www.udemy.com/creacion-de-plantas-3d/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-05T00:39:37Z"
}