{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t            Hola, mi nombre es Marcelo Francisco Bisciglia, soy Técnico e Ingeniero Mecánico. Tengo más de 25 años de experiencia en Diseño Mecánico y 15 años con SolidWorks®.  </p>  <p style=\"\">  \t            Aquí te presento un curso para <strong style=\"\">aprender a utilizar sin problemas</strong>, el software <strong style=\"\">SolidWorks</strong>, el de mayor crecimiento entre los diseñadores industriales en el mundo. Mediante <strong style=\"\">un lenguaje muy simple y preciso</strong>, fruto de mi experiencia, podrás empezar a dominar las importantes herramientas de diseño por modelado de sólidos, que te permitirán abrirte paso en el mundo del Diseño 3D.  </p>  <p style=\"\">  \t            Esta es una posibilidad única para dar libertad absoluta a tus ideas y sueños constructivos. Déjame guiarte mediante los videos, te mostraré cómo afianzarte aplicando de forma óptima cada comando, <strong style=\"\">con muchos ejercicios prácticos</strong> verás cómo en pocos videocursos, tus miedos a lo desconocido, se traduce en energía y potencia en tu mente para proyectar esas ideas que soñaste hacerlas realidad. <strong style=\"\">Incluye una guía y archivos (bases) para una correcta realización de los ejercicios, para descargarla, ir al panel lateral derecho.  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">Ya sea que tengas una empresa, sueñes con tenerla o quieres el trabajo en esa gran fábrica. Aquí está el inicio a tu gran carrera!!!.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">AutoCAD es un software muy utilizado por los diseñadores, pero carente de herramientas específicas para desarrollo de productos como sí los tiene el SolidWorks. Las industrias están demandando gran cantidad de profesionales conocedores del SolidWorks. Coloca &quot;<em style=\"\">trabajos con SolidWorks</em>&quot; en tu buscador web y verás todas las oportunidades laborales que te estás perdiendo.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Hoy día, capacitarse en Diseño con SolidWorks, tiene un costo muy importante en dinero (entre 300 y 500 Dólares) y en tiempo (entre 20 y 40 horas, en grupos de 20 a 30 personas, compartiendo PC con otros integrantes). Aprovecha este curso personalizado, a costo muy accesible y muy flexible a tus tiempos disponibles.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">No necesitas conocimientos previos en diseño, solamente de Windows</strong>.  </p>  <p style=\"\">  \t            Temas a tratar en los 14 ejercicios planteados en los videos:  </p>  <ul style=\"\">  \t<li style=\"\">Interfaz del programa y barras de herramientas.</li>  \t<li style=\"\">Creación de piezas, croquis, cota inteligente, extruir material, relaciones de croquis, equidistanciar entidades, extruir corte, manejo de operaciones, redondeos y matriz de operaciones.</li>  \t<li style=\"\">Vaciado, asistente para taladros, revolución, corte de revolución, simetría, barrido, recubrir, cúpula, hélice, rosca e imagen de croquis.</li>  \t<li style=\"\">Importar archivos de AutoCAD (DWG).</li>  \t<li style=\"\">Ensamblajes y relaciones de posición.</li>  \t<li style=\"\">Representación en planos de dibujo (conjunto y fabricación): Vistas, paleta de visualización, globos, lista de materiales, propiedades personalizadas y vínculo entre plano de conjunto y de fabricación.</li>  </ul>", 
    "end_date": null, 
    "title": "Curso de SolidWorks", 
    "price": "40.00", 
    "instructors": "Marcelo Francisco Bisciglia", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284504_aa22_9.jpg", 
    "course_url": "https://www.udemy.com/curso-de-solidworks/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-20T14:47:49Z"
}