{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\"></strong><strong style=\"\">Make your ideas come true by knowing how people can hel</strong><strong style=\"\">p</strong>.</p><p>You are reading this because you either have an idea for a short film or full-length animation project for yourself, or…</p><p>Because you are just <strong style=\"\">curious </strong>and wanted to know what was all that hype of “Direct and Produce Animation”. Well, give me a couple of seconds to see if I can get you more curious. </p><p><strong style=\"\">Everyone has ideas</strong>. Right? Well, that&#039;s the good part. The bad part is that most of those ideas live only inside the mind of the holder. Never making it to born into reality.</p><p>Why? Because people prefer to scratch their heads or their bellies because it feels good.</p><p>Think about it, most don&#039;t know that they can produce them without sitting on a computer or knowing anything about animation. Yes. That&#039;s a fact<strong style=\"\">. There are successful producers running big studios who don&#039;t know how to draw or animate and yet, </strong>they materialize ideas because they know how the different departments work. They know how to guide people.</p><p>So, I ask you…</p><p>What does it take to get your<strong style=\"\"> idea realized</strong>? To have it <strong style=\"\">come true</strong>? And how can you do it in <strong style=\"\">less time</strong>?</p><p>Animation is a very long process that can be shortened if you know a little weird secret: </p><p><strong style=\"\">People want to help.</strong></p><p>But the big question is: Do you know how they can help?</p><p>What If one of your friends, loves to work with sound and likes your project? How can he help?</p><p>And artists? Or photographers? I bet you know a photographer, and until now, you didn&#039;t know a photographer could help with animation. How? Well, by applying composition principles of photography to your shots and a bunch of cinematography concepts. That photographer can make your animation look awesome.</p><p>When you have an idea for a project and you know how to animate, you can do what most people do.</p><p>Go SOLO mode. YEAH! RIGHT ON!</p><p>I don&#039;t know if it&#039;s to show off all their abilities and say: I did it all by myself! Or if they just didn&#039;t know that people around them wanted to help, but neither any of them knew it could be done faster.</p><p>Imagine you have this<strong style=\"\"> idea for a story</strong>, or even a quick joke or gag that you want to transform into animation, into a living and breathing thing that could go viral on the internet.</p><p>You say to yourself: “Hey, this joke could be an awesome 30 second short film and could make many people laugh”. Ha! Making people laugh is one of the most generous things anyone can do for someone else. But we are not talking about comedy, we are talking about that idea of the joke and the possibility of creating an animation out of it.</p><p>If you don&#039;t know how to use a computer or don&#039;t know how to walk and talk, you will definitely think deep inside you: “Oh man… I wish I could walk and talk so I could learn how to use a computer to then make this animation”.</p><p>Well, good news, I bet you can use a computer and can walk and talk (or at least you know how to communicate.) </p><p><strong style=\"\">Knowing how to communicate and how each department works</strong> in an animation feature film production, is what can make this Idea a reality.</p><p>Or maybe you just read all that and said: Hey… Mr. Bald (because I&#039;m bald… AND I&#039;M LOVING IT!), I&#039;m an animator, stop preaching on what I can or can&#039;t do”.</p><p>Well, then I have something to tell you…</p><ul style=\"\"><li>Being an animator</li><li>Knowing how to direct and produce your projects</li><li>And how to find and work with people who is waiting for a chance to help…</li></ul><p>Can make your life easier. You could cut in half the time it takes to finish on your own.</p><p>And not only that… but you also get THE BEST VERSION OF YOUR STORY.</p><p>And that, my friend… it&#039;s priceless.</p><p>You: “<em style=\"\">Hey, we are not friends, ok?</em>” Me: “<em style=\"\">Of course we are, we just don&#039;t know each other</em>”</p><p>(Drum roll please… prrrrrrrrrrrrrrrrrrrrrrrrrRRRRR PPSSS!)</p><p>So anyway,<strong style=\"\"> knowing how to direct and produce can make any idea come true</strong>. And the cool part is, you don&#039;t even need to know how to draw or animate. How cool is that!</p><p><strong style=\"\">Enroll today</strong> and start making your ideas a reality in half the time.</p><p>Check the free lessons so you can have a taste of it. If you like it, enroll, and if you don&#039;t like it after you enroll… </p><p>Hey. Chill out. $H^% happens. Just kidding! You can have your money back with no questions asked!</p><p>You have 30 days to decide. So what are you waiting for? <strong style=\"\">Enroll now!</strong></p><p>Or… check the free lessons <strong style=\"\">NOW</strong>!</p><p>Or don&#039;t do anything… <strong style=\"\">NOW</strong>!</p><p>Whatever you feel like doing… <strong style=\"\">DO IT NOW</strong>!</p><p><em style=\"\">(I&#039;m crossing my fingers to have you as my new student… thinking “C&#039;mon C&#039;mon C&#039;mon C&#039;mon….”)</em></p><p>Whatever you decide… I hope you have a nice day. Cheers! : D</p>", 
    "end_date": null, 
    "title": "Direct and Produce Animation", 
    "price": "50.00", 
    "instructors": "2D Animation 101 Courses", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434722_013d_6.jpg", 
    "course_url": "https://www.udemy.com/direct-and-produce-animation/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T04:48:48Z"
}