{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">Start making your own animated videos today!</strong></em><br style=\"\"></p><p style=\"\">After Effects is an amazing program that can help you create motion graphics, visual effects, and titles that make your videos better, but it can be intimidating to try out. In this 60-minute course, you&#039;ll learn the magic of keyframes - the basis of creating motion graphics in After Effects.</p><p style=\"\">You&#039;ll take the title card that you created in the first Dive into After Effects: Understanding the Basics course, and you&#039;ll introduce each element of your title card in a unique way. These include motion, scale, opacity, and rotation animations; trim path animations; and 3D transitions.</p><p style=\"\">This class is perfect for video creators, designers, and everyone who wants to learn After Effects in an non-intimidating way. We recommend taking the Dive into After Effects: Understanding the Basics course first. By the end of the class, you&#039;ll have the basic knowledge to start animating graphics and dive even further into the world of After Effects.</p><p><strong style=\"\">ASSIGNMENT</strong></p><p>Animate a title card for your brand (or your favorite brand) within After Effects. This assignment will teach you how to use keyframes to introduce different elements (text, images, shapes) to the audience. If you are brand new to After Effects, take the first <u style=\"\"><strong style=\"\">course</strong></u> in the Dive Into After Effects series to learn how to design your own title card directly within After Effects</p><p><strong style=\"\">DELIVERABLE</strong></p><p>Upload an animated GIF of your animated title card or post a link to your title card hosted on YouTube of Vimeo. We&#039;ll learn how to do so in the course.</p>", 
    "end_date": null, 
    "title": "Dive Into Adobe After Effects 2: Learn to Animate Graphics", 
    "price": "20.00", 
    "instructors": "Phil Ebiner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492186_835e_2.jpg", 
    "course_url": "https://www.udemy.com/adobe-after-effects-course-tutorial-for-beginners-animating-keyframes/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-02T22:51:05Z"
}