{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>If you are worried about <strong>your audience</strong>, and want them to have a good time when they see your videos, then this course might get your interest.<br></p><p>The problem I see in <strong>a lot of training online</strong>, is that they only use a<strong> simple PowerPoint presentation</strong>, and that it’s pretty boring to watch.</p><p>So, what if you offered that <strong>same information</strong>, but in a <strong>more entertaining way? </strong></p><p>Well, you would get more customers, more viewers, more students, and that could mean, <strong>more money.</strong></p><p>Hey, <strong>people go to where the fun is.</strong> Right? It's the Law of Human Nature.</p><p>It’s true, delivering an amazing product can take you some time, but, if you are willing to do it, you will be able to offer the same information everybody is giving, but they will choose you because of the way you present it.</p><p>Sounds nice?</p><p>And because I know, for experience, that <strong>time is of the essence</strong>, I decided to include some lessons explaining my personal workflow to get things done <strong>more efficiently and faster</strong>, maintaining great quality.</p><p>That is, by <strong>producing a lot of videos at the same time</strong>, using a process called <strong>ASSEMBLY LINE.</strong></p><p>Interested?</p><p>Buy with confidence. After buying, if for any reason, you decide that this course is not helpful for you, no worries, you can get <strong>your money back with no questions</strong> asked thanks to the <strong>30-Day Money Back Guarantee</strong>.</p><p>So enroll today!</p><p><strong>In this course you will:</strong></p><ul><li>Learn how to create Dynamic and Engaging Presentations</li><li>Learn how to Create and Animate Texts and Images in the popular Visual Effects software Adobe After Effects</li><li>Have access to the Project Files so you can follow along</li><li>Access to 2 very powerful and useful plug ins FOR FREE</li></ul><p><strong>Enroll Now!</strong></p><p><strong>Or check the free lessons!</strong></p>", 
    "end_date": null, 
    "title": "Engage Your Audience with Animated Presentations in AE", 
    "price": "50.00", 
    "instructors": "2D Animation 101 Courses", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636112_f1eb_3.jpg", 
    "course_url": "https://www.udemy.com/engage-your-audience-with-animations-in-after-effects/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T19:14:48Z"
}