{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn <strong>3 different techniques</strong> to <strong>create 2D long flat shadows</strong> and add them to your motion graphic compositions. We will take a look and create those popular long shadows which are very popular amongst the designers creating on the current flat design trend. You don't even need to have a project to work on - I have created a few sample animations which you can work on by downloading the attached project file.</p><p>The shadows will be dynamic, which means they will react to any movement that will be going on in your composition. I will show you how to save them as a preset for future use, how to link the shadow itself to a null object and much more handy quick tips like that.</p><p><strong>A few benefits of this class:</strong></p><ul><li>Get started with After Effects the right way, learn essential tools &amp; a proper workflow</li><li>I will touch on topics like precomposing, growing bounds, effects, simple expressions and more</li><li>We will use the repeater, work on shape layers, create shapes, duplicate layers etc.</li><li>We will be using only build-in effects</li><li>You will learn 3 different techniques to use</li><li>We will save animation presets for future use</li><li>Modernize your compositions - use it for any project</li><li>Learn to have fun inside of After Effects with a new technique</li></ul><p>...What are you waiting for? Enroll now and let us start applying modern flat shadows to our animations!</p>", 
    "end_date": null, 
    "title": "FREE After Effects Basics -2D Flat Shadows in After Effects ", 
    "price": 0, 
    "instructors": "Andrzej Pach", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635694_3e22_5.jpg", 
    "course_url": "https://www.udemy.com/after-effects-basics-flat-shadows-in-after-effects/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T08:12:12Z"
}