{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course explores the amazingly powerful 3D Coat. If you've wanted to explore 3D but been confused by which program to learn I highly recommend 3D Coat. It is so easy, yet so incredibly powerful that you can start having fun without immediately worrying about technicalities.</p><p><strong>Some positive feedback from current students:</strong></p><p>\"This is an excellent course and I really enjoy your teaching style. I've been over section 2 at least 10 times now and there's so much gold in there. As a musician there's noway I could listen to a topic over and over if the instructor was monotonous, condescending or other, but you speak easily and naturally with highly relevant content and an excellent commend of the subject. By working in an almost free form fashion and uncovering limitations and mistakes in both program and design makes the course much more useful and educational.\" </p><p>--------------------------</p><p>\"Wow, first of all, I MUST say: I'm 14 lectures in and after the 1st or 2nd ... this series is truly awesome. Feel free to quote me on that. I've even told all my design friends about it.\"</p><p>--------------------------</p><p>\"Nobody has put anything together that's quite like this. Some of Javis Jones' tuts are great, but you also add a tremendously strong elements of ideation and practical, captivating design-dev skills along with how the tools work ... kudos, my friend. Also wanted to say: good vocal/video pacing as well, very engaging, never-ever boring!\"</p><p>--------------------------</p><p>\"Such a creative way to use the tools. I am learning new methods for designing complex shapes and I am only about 4 lessons in. I really have to thank you and I am so glad I purchased this course. I've been in a bit of a rut with 3D - Coat, wanting to use it but putting it off and sticking with what I am comfortable with (polygon modelling in MODO) but you have really opened my eyes with your course. Thank you so much\"<span></span><br></p><p><br></p><p>--------------------------<br></p><p><br></p><p>We begin the course looking at a variety of ways to create 3D forms. There are lots of tools to use, but we focus on a select few and discover how easy it can be to go from zero to hero - literally!</p><p>But I don't want to be guilty of just giving you some marketing blurb. Let's keep it real. Some of these tools can be self explanatory and may not merit a whole video related to it. However, what this video series provides is a real world peak into some of the deeper issues you may encounter. I include a video where I have a memory overload and then i explain why it happened because its a typical error you will run into as you start adding lots of geometry. I look into global space issues which occur and break symmetry from time to time as you use certain tools and look at ways of creating smoothness without losing the form which seems to be typical in a voxel based environment - and lots of other little details which can ruin your day if you are not aware of them. </p><p>After I explain our little group of tools, I've tried to make the series project based. I explain my process and at one point get inspired by a small detail which totally changed the direction of the model to great success I think.</p><p>This speaks very highly of 3D Coat . It is very flexible to the creative process and extremely forgiving, allowing you complete fluidity as you work. Z Brush gets all the press, but I am telling you as someone who has been committed to 3d for 20 years, 3D Coat is a special program and the quality of your work will improve massively. </p><p>But not only that the level of your frustration will correspondingly decline.</p><p>Even if you do not learn the program from me, put the effort in and learn this amazing product for your own sake. </p><p>I am a professional who has worked in countless commercials and have taught 3D and visual effects for 10 years using Maya and Z Brush, both excellent products. </p><p> 3D Coat is my secret weapon of choice.   You will not regret the time you invest in these videos where I explore many interesting workflows to achieve form and structure which are simple unrivaled in any other program.</p>", 
    "end_date": null, 
    "title": "Hard Surface Modeling and Sculpting Course in 3D Coat", 
    "price": "20.00", 
    "instructors": "Scott Turner", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420672_ad42_3.jpg", 
    "course_url": "https://www.udemy.com/3d-coat-robots/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T23:25:53Z"
}