{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t      In this course, instructor Stephen Wells will be taking us through the process of refining the final model of this Hard Surface Tank. Starting with our basic blockout model, we&#039;ll go indepth by covering the UVW unwrapping process using Roadkill. Next, we&#039;ll dive into detailing our mesh as we open ZBrush and cover the sculpting process. In ZBrush, we&#039;ll learn to create custom alphas and sculpt much more of the extra details not covered in the original blockout phase - including weapons, turrets, machine guns, armor, and more.<br style=\"\">  \t<br style=\"\">  \t  Using ZBrush, we&#039;ll also learn to create our custom textures and materials as we learn polypainting, as well as adding details such as rust and grime. Lastly, well cover the final presentation of the model as we learn to render and present the tank model while utilizing Maya, ZBrush and the Marmoset Toolbag.  </p>  <p style=\"\">  \t       (Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)  </p>  <hr style=\"\">  <p style=\"\">  \t<u style=\"\"><strong style=\"\">More about the Instructor:</strong></u>  </p>  <p style=\"\">  \t    Stephen Wells is an expert 3D modeler for characters, props, vehicles, weapons and environments and have created both high and low polygon assets for game productions. He has over 20 years experience in creating a variety of game assets for several different genres (fantasy, sci-fi, combat, superheroes, horror, etc) using 3ds Max, Maya, Photoshop, ZBrush, Mudbox, Topogun, and XNormal. As an enthusiastic instructor, he loves creating video tutorials on a wide variety of subjects to help students better their skillsets.  </p>", 
    "end_date": null, 
    "title": "Hard Surface Vehicle Detailing and Texturing", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260312_ee37_2.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-hard-surface-vehicle-detailing-and-texturing/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-12T23:31:23Z"
}