{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Ever wanted to make cool animations but don't think you are creative enough?  Or ever wanted to learn \"how to make money online\" but not interested in mumbo jumbo sales pages? Learn a real skill that provides real value to businesses-- no creativity needed.  Our course will introduce you to the basic elements of motion graphics and teach you how to apply these simple motion recipes to lucrative logo animations.</p><p>There are many different ways to make money with motion graphics.  In my eyes, the top three are: 1. Explainer Videos (advanced); 2. MicroVideos for social media (moderate); and 3. Living Logos (beginner).  Most people begin their After Effects career attempting to create a difficult long form explainer video- which almost always leads to frustration and burnout.  Instead, it's better to begin with simple projects and build slowly from there.  Which is why we recommend starting with Living logos.  </p><p>Living logos are the easiest (and most immediately profitable) form of motion graphics to begin.  Unlike explainer videos which require in depth knowledge of the entire After Effects Application, Living Logos only require you to master a few simple workflows.  So instead of overloading you with unnecessary information (especially if you are not naturally creative and do not intend to pursue any other forms of motion graphics beyond Living Logos), this course instead focuses on the bare bones.  The basic building blocks of animation that you can immediately apply to paying Living Logo projects.</p><p>Extras:</p><ul><li>Content will always be up to date.</li><li>Access simple looping GIFs that explain common After Effects obstacles</li></ul>", 
    "end_date": null, 
    "title": "How to Animate Logos for Companies & Brands", 
    "price": 0, 
    "instructors": "Michael McGreal", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/666300_2345_6.jpg", 
    "course_url": "https://www.udemy.com/living-logos-animation-simple-after-effects/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T00:11:08Z"
}