{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    En este curso de Iluminación Avanzada con V-Ray / Maya aprenderemos a utilizar el potente motor de render con todas sus opciones de cámaras físicas, luces específicas-V-Ray, Iluminación Global y HDRI. Realizaremos prácticas de Iluminación en exteriores, mediante VRay-Sun y en interiores mediante GI, para obtener unos conocimientos idóneos en el desarrollo de producción usando V-Ray avanzada con VRAY.  </p>  <p>  \tMaya es una potente solución integrada de modelado 3D, animación, efectos y renderización. Dado que Maya se basa en una arquitectura abierta, es posible programar o aplicar guiones sobre sus trabajos utilizando una API (Interfaz de programación de aplicaciones) extensa y bien documentada, o uno o dos lenguajes de programación integrados. Esto, combinado con el mejor conjunto de herramientas 3D del sector, hace de Maya una solución que le permitirá hacer realidad sus ideas creativas.  </p>  <p>  \tEste curso está impartido por Jose Luis Quirós. Con más de 15 años de experiencia en producciones audiovisuales y en 3D, comenzó de forma autodidacta y gracias a la carrera profesional de diseño industrial creó mis primeros modelos 3D; estudió 3ds max, maya y softimage. Ha trabajado en largometrajes de animación, videojuegos, publicidad y cine y ha dirigido proyectos como los Marcatoons y participado en cinco largometrajes, el último de ellos nominado a los premios Goya.  </p>  <p>  \tEn este curso cubriremos los siguientes módulos:  </p>  <ul>  \t<li>Subdivision ImageSamples</li>  \t<li>Luces Vray</li>  \t<li>HDRI</li>  \t<li>Cámaras físicas</li>  \t<li>Vray Sun y Vray Sky</li>  \t<li>GI</li>  \t<li>Materiales Vray</li>  \t<li>Render elements</li>  </ul>", 
    "end_date": null, 
    "title": "Iluminación avanzada VRAY", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177556_6f7a.jpg", 
    "course_url": "https://www.udemy.com/iluminacion-avanzada-vray/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-05T23:12:54Z"
}