{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>POSSIBILITIES ARE ENDLESS IN 3D</strong></p><p>3D modeling is part of a huge industry that includes; movies, television, product design, video games and many more. As a 3D modeler it is your job to take a conceptual design (pencil and paper) and build it in 3D space within the computer (Maya). The magic that you will feel and master as your model begins to take life is something that you will want to experience many times over.</p><p><strong>BEGIN WITH THE BASICS</strong></p><p>This course will quickly introduce you to the basics that you will use to build your career upon. The basics aren't something that you will learn and then forget, but they will stick with you from day one throughout the rest of your career. You will learn to master 3D space and working with primitive shapes that will take a on a life of their own as you breathe life into them pulling, pushing and twisting the geometry wherever your imagination takes you.</p><p><strong>Some of the topics you will master during this course will include:</strong></p><ul><li>Basic 3D Concepts</li><li>Working with Basic Primitive Shapes (Cubes)</li><li>Accessing Sub-Component Modes of Your Shapes to Build Complex Model</li><li>Common 3D Modeling Tools Found in Maya</li><li>and more...</li></ul><p><br></p><p>After mastering the basics you will then move on to creating a portfolio ready model. Through the step-by-step instruction you will take the knowledge you are mastering and create this model from scratch, starting with nothing more then a 3D cylinder.</p><p><strong>Join this course and begin your journey from novice 3D modeler to paid professional. the journey maybe long at times but well worth the time invested!</strong></p>", 
    "end_date": null, 
    "title": "Intro to Mastering 3D Box Modeling Techniques with Maya 2014", 
    "price": 0, 
    "instructors": "Kyle Pew", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737242_f692_4.jpg", 
    "course_url": "https://www.udemy.com/intro-to-mastering-3d-box-modeling-techniques-with-maya-2014/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T21:07:06Z"
}