{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>How do designers and engineers come up with great ideas and make them real?</strong></p>\n\n<p>Ideas are a dime a dozen. But taking ideas for new products or inventions from concept to reality requires more than just inspiration. It takes methodical processes--processes that can ensure predicted functional results. It requires, over time, a number of iterations to be modified and fine tuned. In other words, it takes a series of specific steps to turn a good idea into an equally good end product. </p>\n\n\n\n\n\n<p>Design Thinking is a set of methods used to help analyze and define a potential solution to a problem--a product or new invention--from the perspective of the people who will ultimately use it. Design thinking aims to ensure that, in the process of turning an idea into reality, the end result is actually useful--that it solves the problem it’s trying to solve. </p>\n\n\n\n\n\n<p>There are a lot viewpoints on Design Thinking. IDEO U, for one, provides a comprehensive set of examples supporting Design Thinking. Before you dive into this course, take a moment to familiarize yourself with IDEO U’s definition and processes related to Design Thinking.</p>\n\n<p><strong class=\"redactor-inline-converted\">About Autodesk Fusion 360</strong></p>\n\n\n\n<p>Fusion 360 is a cloud-based 3D visualization CAD/CAM tool for collaborative product development. Fusion 360 enables exploration and iteration on product ideas and collaboration within a distributed product development team. Most importantly, Autodesk Fusion 360 combines organic shape modelling, mechanical design, and manufacturing in one comprehensive package. Students, educators, enthusiasts, and startups are all entitled to a free license of Autodesk Fusion 360.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course structure</strong></p>\n\n\n\n<p>The course is made up of four sections, each consisting of three to eight lectures. It is designed to facilitate learning at your own pace. Using the suggested timeline, you should be able to finish the entire course in four to six weeks.</p>\n\n\n\n\n\n\n\n\n\n\n\n<h4></h4>", 
    "end_date": null, 
    "title": "Introduction to Design for Innovation using Fusion 360", 
    "price": 0, 
    "instructors": "Autodesk Education, Akshay Sharma", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/865854_63e9.jpg", 
    "course_url": "https://www.udemy.com/design-for-innovation-using-fusion-360-water/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T15:26:57Z"
}