{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>How to Model in 123D Design for Makers, Designers, and Entrepreneurs is an online course that will take you step by step through learning tools and principles that will allow you to bring your ideas to life.</p><p>At the end of this course, you will have gained a new skill that is growing in demand in multiple industries. I will help you gain vital experience to further your career or break the mold to create your own designs. Whether you want to design buildings, develop products, or generate digital entertainment, How to Model in 123D Design will give you the freedom to produce your very own creations.<br></p><p>You have the opportunity to practice your skills as you learn in each section. In this course, you can learn at your own pace and repeat videos to give you a deep and thorough understanding of each lesson. Not only is this course designed to help you master 123D design, but it gives you the fundamentals of 3D modelling that smoothly translate into other professional design softwares. <br></p><p>Step-by-step, we will go over the cornerstones of 123D Design by creating a fun robot that embodies all of the main tools in the program. In addition, I have included Bonus Designs for you to strengthen what you learn in the course.</p><p>I'll see you in the course!</p><p><br></p><p>-Ken<br><br></p><p><br></p><p><br><br></p>", 
    "end_date": null, 
    "title": "Intro to 3D Design for Makers, Designers, and Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Ken Palamara", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489734_be18_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-model-in-123d/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T20:03:39Z"
}