{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">In this series, we&#039;re going to delve into Knald - a new map-generating program for creating normals, displacement, cavity, ambient occlusion and more. We&#039;ll start by examining the interface thoroughly, going through the different panels before jumping into the real magic behind Knald. We&#039;ll examine importing several images to use as our base for generating all the different types of maps as well as examining the &#039;integrator&#039; controls for varying the intensity, scale and more. We&#039;ll be able to view and review each of these maps in the 3D Preview panel on our custom models to make sure we have the look we need. We&#039;ll then examine the effects the maps on layers in Photoshop to see what effects we can emphasize as needed before applying the final maps in the 3D program of our choice.</p><p style=\"\">(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</p><p style=\"\">More about the Instructor:</p><p style=\"\">Stephen Wells is an expert 3D modeler for characters, props, vehicles, weapons and environments and have created both high and low polygon assets for game productions. He has over 20 years experience in creating a variety of game assets for several different genres (fantasy, sci-fi, combat, superheroes, horror, etc) using 3ds Max, Maya, Photoshop, ZBrush, Mudbox, Topogun, and xNormal. As an enthusiastic instructor, he loves creating video tutorials on a wide variety of subjects to help students better their skillsets.</p>", 
    "end_date": null, 
    "title": "Introduction to Knald for Materials and Texturing in 3d", 
    "price": 0, 
    "instructors": "3dmotive LLC", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441764_af01.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-introduction-to-knald-for-materials-and-texturing-in-3d/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T06:38:11Z"
}