{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>JOIN 230+ STUDENTS TO LEARN BASIC KINETIC TYPOGRAPHY ANIMATIONS AND JUMP INTO THE VIDEO EDITING INDUSTRY!</strong></p><p><span></span></p><p>Use PowerPoint as Your video editing software and start making beautiful <strong>kinetic typography</strong> videos that will make the message You have to share with Your audience much more entertaining to watch.</p><p>-------------------------------------------------------------------------------------------------------------------  <br><strong>This Design Course Will Teach You How To Make Kinetic Typography Videos in PowerPoint!</strong></p><ul><li>You will enhance your graphic design skills</li> <li>You will use rarely known PPT techniques</li> <li>Synchronize a voice over to a animation</li> <li>Learn to make custom transitions between slides</li> <li>It will take you less than 1h to complete!</li></ul><p>Powerpoint allows to export presentations to video, so you can create promo videos, animation sequences, content for YouTube, a clip for a music video and get creative the way you always wanted and powerpoint will be your guide - all with help of this detailed walkthrough on how to make kinetic typography videos using only PowerPoint! I will take you by hand and start with a empty presentation file until we have a ready to export finished animation sequence.</p><p>-------------------------------------------------------------------------------------------------------------------  <br><strong><br>There are THREE pillars on which this course is standing:</strong></p><ol><li>Give you high quality videos,</li><li>Share valuable tips &amp; tricks rare to be known for regular Powerpoint users,</li><li>Be entertaining to watch.</li></ol><p>I want to make sure that after taking this class you not only have spent time on it but really did obtain a new skill which will help you produce high quality animations with PowerPoint. </p><p>-------------------------------------------------------------------------------------------------------------------  <br><strong><br>I prepared a short assignment</strong> <strong>for every participant</strong>, to make a animation along with me, even if it will be a very short one (4 words) so you learn by doing and real powerpoint usage. Afterwards we can discuss and share feedback on it inside of the discussion boards! </p><p>-------------------------------------------------------------------------------------------------------------------  <br><br>I hope you will enjoy the course and feel free to enroll if you feed that this course may be beneficial for you! <strong>Don't wait to sign up. ENROLL NOW!</strong><br></p>", 
    "end_date": null, 
    "title": "Kinetic Typography in PowerPoint 2013 Animate in Powerpoint", 
    "price": "20.00", 
    "instructors": "Andrzej Pach", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451062_1523_10.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-kinetic-typography/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T09:01:43Z"
}