{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><em>Ever wanted to add motion to your video titles and text? </em></strong></p><p>Kinetic typography is everywhere nowadays - in films, commercials, music videos, online courses. This 'motion typography' makes your videos look more professional and engaging. While it seems complicated, creating your own kinetic typography videos in Adobe After Effects is quite simple when broken down into the basic animations that are actually happening.</p><p>That's what this course is all about - breaking down a complicated motion graphics video, and teaching you how to animate each type of text animation.</p><p><strong>What will you be able to do with this course?</strong><br></p><ul><li>Use traditional cuts to introduce new words</li><li>Reveal text with scale and position animation</li><li>Rotate and flip text onto the screen</li><li>Revolve text onto the screen (like they do in so many commercials!)</li><li>Improve animations with motion blur, easy ease, and graph editing</li><li>Export and upload your videos</li><li>Much more!</li></ul><p>If you've ever wanted to jump right into creating kinetic typography videos, but didn't know how - this is the perfect course for you. </p><p><strong>How does this course work?</strong><br></p><p>This course is taught using Adobe After Effects. We used the latest Creative Cloud version of After Effects, but you can use any previous version (CS6 or earlier) because the process is the same. In this course, we dive right into creating kinetic typography in After Effects. While it will be easier to follow along if you have some experience with After Effects, it is not a requirement. If this course goes too quickly or seems too advanced for you, try enrolling in our full Kinetic Typography or Complete Adobe After Effects courses, which are for complete After Effects beginners.</p><p>Throughout this course, you will be working on your own kinetic typography project. Each lesson breaks down one scene from the sample video, going over a new technique in revealing text (cut, scale, position, and rotation animations). </p><p><strong>What bonuses are included in this course?</strong><br></p><p>Follow along by using the downloadable After Effects project file. This way, you can follow along with everything we do in the course.</p><p><strong>Why should you enroll?</strong><br></p><p>You should enroll if you want to quickly learn the basic building blocks of creating advanced and intricate text animations. Phil, the instructor, is always available to help out - as if you were in a live course. So if you ever get stuck or need something explained, you will find an answer. By the way, Phil has taught over 100,000 students here on Udemy and really knows how to explain complex ideas - like motion typography - to beginners like you.</p><p>We can't wait to see you in the course!</p>", 
    "end_date": null, 
    "title": "Kinetic Typography Crash Course - Create Motion Graphic Text", 
    "price": 0, 
    "instructors": "Phil Ebiner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709152_e475.jpg", 
    "course_url": "https://www.udemy.com/kinetic-typography-crash-course/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T00:11:42Z"
}