{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  In this intermediate level course, instructor Ryan Ribot will be focusing on sculpting a High Resolution character asset using ZBrush. The focus of this course will include sculpting processes, stylized anatomy, modularity, and basic design fundamentals to create a stylized character model. Not only will we dive heavily into the anatomy of the character by ensuring that the form is sound and accurate, but we&#039;ll cover each and every aspect of the armor creation one-by-one from head to toe. By the end of this course you should have a strong understanding of the steps towards creating your own high quality ZBrush models. If you&#039;ve been looking for a complete crash course in learning to sculpt digital characters using ZBrush, this course is for you!  </p>  <p style=\"\">  \t          (Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)  </p>  <hr style=\"\">  <p style=\"\">  \t<u style=\"\"><strong style=\"\">More about the Instructor:</strong></u>  </p>  <p style=\"\">  \t  An adopted son of San Francisco and the Academy of Art University, Ryan Ribot lives a small apartment with 3 cats and a Wacom. Currently working as a texture artist and character modeler with Telltale Games, Ryan spends most of his time painting and sculpting. ZBrush, Photoshop, and Maya are like breathing to him, and he is always looking to share his knowledge. Ryan has been teaching for several years, and is experienced as both an instructor and an industry professional.  </p>", 
    "end_date": null, 
    "title": "Learn to Sculpt a Stylized Character for Games with ZBrush", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359660_289c.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-learn-to-sculpt-a-stylized-character-for-games-with-zbrush/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T17:55:50Z"
}