{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>*** The final Course Price Increase occurred on January 1, 2016 -- increasing to $30 ***</p><p>*** Please Note: A Course Price Increase Occurred On October 1, 2015 from $10 to $20 ***</p><p>Computer-Aided Design, or CAD, is a 21st century skill that anyone can learn... and a skill that everyone <em>should</em> learn. From artists to engineers, from 6-year-olds to 90-year-olds, CAD is software that helps a wide range of users create 3D objects on screen -- toys, buildings, vehicles, animated movie characters, video games, and more. Artists use CAD to design jewelry, furniture, and sculptures. Engineers use CAD to design the latest technology product you see in the stores, and architects use it to design skyscrapers and houses. Animators use CAD to create those wonderful CG (Computer Generated) special effects and characters you see in today's cutting-edge movies, and video game designers use CAD to bring to life other-worldly scenes and heroes and villains for today's favorite games. And hobbyists around the world have discovered CAD as the primary source for creating anything they wish to make with one of today's popular cutting-edge tools, the 3D printer.</p><p>CAD is not difficult to learn. As a matter of fact, it could be argued that CAD makes creating things easier. It's in the name -- Computer-Aided Design. You'll be using your Computer (or laptop) to Design things where the software will Aid you in your work. Can't draw a perfect circle or a believable cube? Don't worry - let CAD do the hard work for you. Have an image in your head that you're having trouble getting out on paper? Let CAD guide your hands and help you draw straight lines and nice curves and bring that image to life on screen.</p><p>CAD doesn't have to be expensive either -- the days of $1000 or $10,000 for a CAD application are over. Today, free CAD applications exist, and one of the best ones out there is called Tinkercad. It's free, it's colorful and easy to use, and best of all it doesn't have hundreds of buttons and toolbars and requires weeks or months to master. By the time you're done with this course, you'll have a solid grasp of Tinkercad's features and tools and be ready to start creating 3D models that will amaze you (and your friends, family, and co-workers). </p><p>Nothing special is required other than a computer, a mouse (although a laptop's touchpad is okay, too), an Internet connection and a web browser. Tinkercad is used by novices and expert CAD users; novices will find Tinkercad's simple interface and controls easy to learn and use, and expert CAD users will find Tinkercad is a stream-lined CAD app that skips the complex tools and gets them faster to their desired end result.</p><p>You'll find this course broken down into short, focused lessons. Once you've learned all the tools and features that Tinkercad offers, follow along by creating some of the sample projects that are created in the course. The course will be updated as new features are added to Tinkercad, so check back here when you discover a newly added tool and get a quick tutorial on how it works.</p><p>You're going to love learning CAD. It's one of those skills that once learned will open up all kinds of opportunities. Many employers like seeing CAD skills on a resume, and students can find all sorts of uses for it when it comes to special assignments and projects. Hobbyists will discover the power of CAD and how it can help take their hobbies to a new level. </p><p>Learn CAD and your imagination will have a real tool that it can use to do amazing things.</p>", 
    "end_date": null, 
    "title": "Learn and Master Computer-Aided Design (CAD) With Tinkercad", 
    "price": "30.00", 
    "instructors": "James Floyd Kelly", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558800_19f7_3.jpg", 
    "course_url": "https://www.udemy.com/learn-and-master-computer-aided-design-cad-with-tinkercad/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-19T18:02:50Z"
}