{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  In this course, Ryan Ribot we will be teaching the necessary skills to prepare and hand paint a 3D Character for game production. To begin, he will focus on the process of setting up topology and UVs, as this is an important process to understand as a texture artist. Following this, the real fun begins: we will dive right into skin tones and simple principles of rendering volume and color variations, and finally, we will learn about other materials such as wood, leather, and cloth to close out with. All of this will be done using a combination of 3D Coat, Photoshop and Maya, with a final output in Marmoset 2.  </p>  <p style=\"\">  \t        (Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)  </p>  <hr style=\"\">  <p style=\"\">  \t<u style=\"\"><strong style=\"\">More about the Instructor:</strong></u>  </p>  <p style=\"\">  An adopted son of San Francisco and the Academy of Art University, Ryan Ribot lives a small apartment with 3 cats and a Wacom. Currently working as a texture artist and character modeler with Telltale Games, Ryan spends most of his time painting and sculpting. ZBrush, Photoshop, and Maya are like breathing to him, and he is always looking to share his knowledge. Ryan has been teaching for several years, and is experienced as both an instructor and an industry professional.  </p>", 
    "end_date": null, 
    "title": "Learn to Unwrap and Texture a Stylized Character for Games", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371876_e97b.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-learn-to-unwrap-and-texture-a-stylized-character-for-games/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T23:36:51Z"
}