{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>With Blendshape Creation in Maya, instructor Chad Robert Morgan gives us a detailed look on how to use blendshapes, including how to create blendshapes nodes, adding new targets, and how to create targets. We highlight common pitfalls to avoid that can break your blendshapes, and tips for making your blendshape workflow more efficient and easy to edit. We will see how we can combine blendshapes with skinclusters to combine joint animation with blendshapes, as well as how to ensure the correct order of your inputs so they will work correctly.</p><p>We also look at an optional method using Mudbox to create blendshapes as sculpt layers and link it with Maya using OneClick. We use the Paint Blendshape Weights tool to paint out the influence of a blendshape and use it to split one target into multiple blendshapes. Learn pro tips like using wrap deformers to create mirror shapes and extra Maya tools found in Bonus Tools from Autodesk to create corrective blendshapes. See the updates from the new tools found in Maya 2016, which will allow us to create blendshapes without target meshes. Lastly, we learn how to export our blendshapes from Maya via FBX and import the blendshapes and the animation into Unreal 4.<br></p><p><strong>(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong></p><p>More about the Instructor:</p><p>Chad Robert Morgan started  his career at LucasArts where, as a newbie to the industry, was fortunate  enough to work with some very talented mentors who taught him how to use Maya. Since then, Chad has been trying to pay it forward by sharing what he has  learned, first by giving lectures at Autodesk Master Classes, then publishing  an article in 3D World magazine, posting tutorials on YouTube, and finally teaming  up with 3dmotive.  Working at  LucasArts, Chad worked on the games <em>Obi-wan,  Starfighter, </em>and <em>Gladius</em>. Chad  has also worked for ReelFX on the direct-to-dvd movie <em>G.I. Joe – Valor vs. Venom,</em> and then moved on to Double Helix  where he worked for ten years on such titles like <em>Strider, Killer Instinct, Front Mission : Evolved, </em>and <em>Silent Hill : Homecoming</em>. Chad is  currently a freelance technical artist, working with clients such as Whitemoon  Dreams, as well as developing his own independent game and video titles under  his own company, Spectral Ink Productions.</p>", 
    "end_date": null, 
    "title": "Learn to Create Blendshapes in Maya for Animation", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711186_2ea4.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-learn-to-create-blendshapes-in-maya-for-animation/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T21:25:04Z"
}