{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>During this course<strong> You will learn to build professional looking Human Walk Cycle</strong> and be ready for next type of locomotion: run, sneak, quadruped motion.</p><p>You will need to download free modified Norman rig by following the provided link.</p><p>To achieve best result<strong> I expect the student get over the course in a week or two</strong>.&nbsp; But to get at ease animating walk cycle may take longer. <strong>Repetition is Mother of Learning!</strong></p><p>This is 100% Video course and I suggest that a Student will watch the Lecture by little segments and try to repeat explained procedure. When the process is clear, You may advance to the next segment until the whole Lecture is over. Then I recommend repeating the lecture without watching it. When the topic of the lecture is learned, You should advance to the next.<strong> Don't rush. </strong>This course is taught in deliberately slow pace, so the student will have time to listen, watch and work on his/her shot, following directions.<strong><br></strong></p><p>My method of presenting material is proven during many years of teaching Animation at Academy of Art University of San Francisco, where I teach students of different skills and backgrounds. <strong>This course is a must</strong> for any aspiring Animator without $15-17K tuition at his/her disposal (or even with). Learning to animate a walk is an essential part of Animation skill.<br></p>\r\n", 
    "end_date": null, 
    "title": "Learn to animate. Part 2. \"Human Walk Cycle\".", 
    "price": "20.00", 
    "instructors": "Michael Berenstein", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/55163_7a44_6.jpg", 
    "course_url": "https://www.udemy.com/learn-to-be-an-animator-part-2-human-walk-cycle/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-20T01:04:46Z"
}