{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>Have you ever had an idea, a story, or even a character that you wanted to see animated? Maybe you’ve even gotten as far as writing a story, or drawn out the characters. Well, now what do you do? Welcome to </span><strong>Learn Toon Boom Animate &amp; How to Create Your Own Cartoons!</strong><span> In this course, I’ll show you the essentials for creating your own animation, using the professional software, Toon Boom Animate 3.</span>  </p>  <p>  \t<strong>In this course, you&#039;ll learn to:</strong>  </p>  <li> Create, and animate your own 2D digital puppet!</li>  <li>Animate your character, and even give them a simple walk cycle</li>  <li>Make your scenes look complex, by using simple camera moves.</li>  <li> Make your characters talk, using Toon Boom&#039;s automatic lipsync</li>  <li>Add Photoshop, and Illustrator files to your animations</li>  <li> and much, much more!</li>  <br>  <p>  \t                                              Toon Boom is an industry leader in creating 2D animation software, and <strong>has been used for animating The Simpsons, Family Guy, Bob’s Burgers, Sponge Bob Square Pants</strong>, and even Disney’s The Frog Princess.  </p>  <p>  \t<strong>In 2D animation, there are basically 2 types of animation</strong>, full animation, also referred to as hand-drawn, or “Disney” animation, wherein each frame of animation is drawn… think classic Bugs Bunny cartoons. The second type of animation is called limited animation, also referred to as cut-out, or Flash animation… most prime-time animation, <em>The Simpsons</em>, etc. use cut-out animation. <strong>The major focus of this course is cut-out animation</strong>, where we will create, rig, and animate a 2D digital puppet… our main character, Bob.  </p>  <p>  \t<strong>For the traditional animator</strong>, Toon Boom software has the feeling of animation software, built for animators. Throughout the course, I’ll be showing you the different tools and windows, all of which are based on traditional animation terms like pegs, fields, color cards, onionskin, light tables, and more.  </p>  <p>  \t<strong>For the more seasoned digital animator</strong>, if you’re familiar with working with programs like Flash, throughout the course I’ll be demonstrating how Toon Boom Animate differs and what makes it a powerful program. Just one example, <strong>Animate has a camera that works in 3D space</strong>. Imagine setting up a multiplane scene in just minutes, without you having to install any additional plugins or software!  </p>  <p>  \t                                            The best part of this course? Even <strong>if you don’t own Toon Boom Animate, you can download a FREE fully functioning demo</strong>. Toon Boom creates PLEs (Personal Learning Editions) for virtually all of their software.  </p>  <p>  \t<br>  \t<em>So, if you’re ready to learn how to animate, purchase this course and let’s get started!</em>  </p>", 
    "end_date": null, 
    "title": "Learn 2D Animation w/ Toon Boom & Create Your Own Cartoons!", 
    "price": "20.00", 
    "instructors": "Tony Ross", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204792_e65b_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-your-own-cartoons/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-24T22:56:36Z"
}