{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><br></strong></p>\n\n<p><strong>\"UPDATE APRIL 2016......10 new lectures and over an hour of additional content added for the April update including new material lectures and applying textures guide.\"</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>\"Enrole in this course today to begin your learning journey in becoming a 3D blender artist. Take the first step in creating 3D assets for games, animations, movies and advertisement and add a new skill set.\"</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>With over 13 hours of content and 50 challenges to complete Blender 3D for beginners aims to take you from being the first timer all to way being able to create your own model, texture it, create animations and even export your creation to other software (ex unity) for creating games or even as a means of creating a NEW FORM OF INCOME!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Learn Blender and the following subject sections:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Blender interface and navigation</p>\n\n\n\n<ul><li>In this section of the course we introduce you to blender for the first time. You will learn how the course is structured and how it benefits you as the learner. This section introduces the blender interface and how to use all of the navigation and selection tools that are required to learn to become a 3D modelling artist.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>Modelling</p>\n\n\n\n<ul><li>In this section, we go over the topic that blender is best at, 3D modelling. Here, you will learn how to create 3D Models either from scratch or by using one of blenders pre installed primitive objects. We will learn how to use object mode to change our objects properties (such as size and scale) in relation to the world around it, and edit mode which focuses on changing the actual shape and form of the object. We will be using all of the core modelling techniques for our designs and introducing many of blenders modifier tools which can be used to enhance our creations.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>Texture and materials</p>\n\n\n\n<ul><li>In this section, we cover how to apply different materials and textures to the models that have been created. Textures are used to change the visual appearance of our mesh by mapping colours and patterns onto its surfaces. Materials are used to determine how our object will react to any light sources that hit it. Applying your materials correctly can make your object look identical to its real world counterpart. We will be using two of blenders rendering engines in this section. The blender render engine creates basic textures suitable for exporting models into other software platforms such as unity or unreal engine. Cycles render is an engine used to create the best materials and textures possible for creating beautiful rendered scenes and animations, but is less optimized for exporting, especially to game engines.</li></ul>\n\n<p><br></p>\n\n<p>Rigging</p>\n\n<ul><li>This section focuses on the pre production stage of animations, which is the rigging of objects in your scene. Rigging is the creation of a skeleton or armature that is used to help move models in ways similar to their real world counterparts. For example an armature for a human model would allow us to control the model at the joints like puppet strings, allowing us to move our model in the same way that our bodies do in real life. We will go over how to construct a full rig with skeleton bones, control and ik bones, and the weight painting tool which will allow us to change the influence of each bone on our model.</li></ul><p><br></p>\n\n<p>Animation</p><ul><li>In this section of the course, we bring our creations to life by learning how to create animations by using tools such as the timeline, Graph editor and dope sheet. We will learn about keyframes and you can use these to create your animations the quick and easy way while with the help of the graph editor and dope sheet you can change where these keyframes are used in your animation and how the keyframes interact with each other, giving you complete control other your animations. This section will also go over how to render images and animations so that you can add them to your own portfolio of work. </li></ul><p><br></p><p>Exporting</p><ul><li>The basic does and don'ts of successfully exporting your creations to other software platforms such as unity 5.</li></ul><p><br></p><p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>THIS COURSE IS SUBJECT TO 30 DAY MONEY GARUNTEE, WHERE IF YOU ARE NOT HAPPY WITH ANYTHING ABOUT THE COURSE YOU CAN ALWAYS GET YOUR MONEY BACK.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>THIS COURSE IS ALSO SUBJECT TO BAILY COURSE 'IMPROVING FOR THE COMMUNITY SCHEME'. IF THEIR IS A TOPIC THAT STUDENTS WOULD LIKE COVERED IN THE COURSE, THEN WE WILL EITHER LOOK TO INCLUDE IT IN THE COURSE WITH THE NEXT COURSE UPDATE OR ADD IT TO A FUTURE COURSE.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Learn Blender 3D  - Become a 3D artist and create 50 models", 
    "price": "25.00", 
    "instructors": "Joe Baily", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644614_d6c4.jpg", 
    "course_url": "https://www.udemy.com/blender-3d-for-beginners-becoming-a-3d-artist/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T11:16:56Z"
}