{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t       This course is for all those who have heard a lot about 3d printing, but often wondered on how can they without any earlier experience of working on 3d modeling software&#039;s, can really take these tools in their own hands to 3D model &amp; print their designs.  </p>  <p style=\"\">  \t       You will learn modeling for 3d printing from scratch to finish, this in not any other 3d modeling course which will just give you  an idea about how 3d modeling is done. And then leave you midway without actually demonstrating on how to prepare a 3d model for 3d printing  </p>  <p style=\"\">  \t <strong style=\"\">  Preparing a 3D model for 3D printing has many basic prerequisites like</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Setting the  model to real world dimensions in mm, inches, cm or  ft</li>  \t<li style=\"\">Making sure the model is water tight, providing wall thickness, removing of non           manifold    faces, overlapping faces , etc.</li>  \t<li style=\"\">Exporting the model in a file format which is accepted by 3d printers</li>  </ul>  <p style=\"\">  \t       You will learn all these steps, in addition this course will also show you how  to print and sell your models in  3d printing market places like shapeways, thingiverse, sculpteo, and <strong style=\"\">make them a source of cash flow,</strong> requiring your minimum attention &amp; time once you are done with uploading your models.  </p>  <p style=\"\">  \t<strong style=\"\">The best benefit of this course is</strong> that you will learn all this without any need of buying a costly 3d modelling software. You will see me using some very popular and powerful open source, 3d modelling &amp; printing software&#039;s like Blender 3D, Netfabb.  </p>  <p style=\"\">  \t       No lengthy &amp; tiring 3D modeling sessions, when there are abundant tricks, commands, &amp; inbuilt software tools to get our desired results with precision accuracy and tiny fraction of time.  </p>  <p style=\"\">  \t       Using every tool at our disposal to best of our advantage, creating your first 3d printable design in less than  5 minutes.  </p>  <p style=\"\">  \t   In 1.5 hours of lectures you will gain the core syrup of my 8 years of experience in 3D modeling, and the  tricks &amp; tools i have learnt over this period.  </p>  <p style=\"\">  \t       If you take this course,  i will also offer you support if you get stuck somewhere in designing your models for 3d print.  </p>", 
    "end_date": null, 
    "title": "Learn modeling for 3D Printing using Blender 3D, Netfabb", 
    "price": "20.00", 
    "instructors": "Abhishek Singh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255614_5e5b_4.jpg", 
    "course_url": "https://www.udemy.com/learn-modeling-for-3d-printing-and-make-money/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-04T13:00:12Z"
}