{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Interested in 3D modelling? Maybe some simple rigging, then join me on this beginner level modelling course as we create a simple paint rig.</p>\n\n<p>This course is designed to walk you through each step in the modelling process.</p>\n\n<p>Firstly we start by creating a basic shape we then add an array and curve modifier to quickly form our tracks. Later on we add some drivers to control the rotation and movement of these tracks.</p>\n\n<p>Next we begin modelling the body of the rig. Again we slowly form the body by adding the different meshes available in Blender.</p>\n\n<p>Next we move onto and form the stabilizers that can be rotated and placed laying on the ground. This is achieved by selecting pivot points or their origin points and adding drivers to control their rotation.</p>\n\n<p>We go through the very fast and effective process of mirroring objects to speed up the modelling process and achieve perfect symmetry.</p>\n\n<p>When the modelling process is complete we add a simple armature. The armature begins as a single bone until eventually after editing and adding bones controls the movement of the boom and stabilizers.</p>\n\n<p>Next we parent these objects to the armature or separate bones and again we add drivers to control their movements and rotation.</p>\n\n<p>Finally we create a simple short animation to demonstrate the rig in motion.</p>\n\n<p>So jump on into this modelling course and discover just how easy it is to pick up Blender.</p>", 
    "end_date": null, 
    "title": "Learn 3D Modelling & Rigging in Blender", 
    "price": "20.00", 
    "instructors": "Thomas Mc Donald", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783800_1974_9.jpg", 
    "course_url": "https://www.udemy.com/learn-3d-modelling-rigging/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-06T07:08:49Z"
}