{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tIn this series, we&#039;ll be introduced to the world of Fibermesh in Zbrush. We&#039;ll first use Fibermesh on a simple plane and using some of the many groom brushes to &#039;brush&#039; the hairs. We&#039;ll then move onto adjusting hairs with symmetry as well as doing some polypainting on the hairs for colour. We&#039;ll then go over some hair styling ideas for what we might want to create for our main Horn Head mesh by examining some painted hair layers in Photoshop. Once we decide on a style, we&#039;ll then use Fibermesh to start to create each hair element (beard, stubble, goatee, etc) individually and then we&#039;ll use the groom brushes to add more natural variations to the fibers/hairs we create.  </p>  <p style=\"\">  \tFinally, we&#039;ll use polypainting to color and tint the hair on the Horn Head&#039;s face to something more naturalistic and complimentary to the character. A final render to see how it all turns out and then looking at the render pass in Photoshop will complete our whirlwind introduction to Fibermesh!  </p>  <p style=\"\">  \t    (Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)  </p>  <hr style=\"\">  <p style=\"\">  \t<u style=\"\"><strong style=\"\">More about the Instructor:</strong></u>  </p>  <p style=\"\">  \t      Stephen Wells is an expert 3D modeler for characters, props, vehicles, weapons and environments and have created both high and low polygon assets for game productions. He has over 20 years experience in creating a variety of game assets for several different genres (fantasy, sci-fi, combat, superheroes, horror, etc) using 3ds Max, Maya, Photoshop, ZBrush, Mudbox, Topogun, and xNormal. As an enthusiastic instructor, he loves creating video tutorials on a wide variety of subjects to help students better their skillsets.  </p>", 
    "end_date": null, 
    "title": "Learn to Sculpt Hair and Fur with ZBrush's Fibermesh", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400790_72bd.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-learn-to-sculpt-hair-and-fur-with-zbrushs-fibermesh/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T04:49:48Z"
}