{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>3D modelling and animation skills are in huge demand in many industries, such as the games industry, the <strong style=\"\">animation industry</strong>, <strong style=\"\">advertising</strong>, <strong style=\"\">architectural </strong>and <strong style=\"\">medical visualization</strong>... the list goes on and on. Incredibly, despite the rather hefty price tag for the leading commercial 3D suites, such as 3D Studio Max or Maya, for instance, there is a <strong style=\"\">gorgeous</strong>, <strong style=\"\">feature rich</strong>, <strong style=\"\">industry grade 3D modelling and animation suite</strong>, which is completely free and open source: introducing <strong style=\"\">Blender </strong>3D.</p><p>Blender 3D can be used for literally <strong style=\"\">any 3D project or task you could imagine</strong>, and has been extensively by seasoned professionals and companies all around the world. From creating a feature length animated film, to animating and rendering 30 second ad for a retail client, to modelling, texturing and animating 3D game levels and environments, you can use Blender to do it all in style -- and much, much more besides...</p><p> In this comprehensive, yet fun and engaging introduction to 3D modelling, UV mapping, texturing, animating and rendering in Blender, you will learn how to:</p><ol style=\"\"><li style=\"\">Work with Blenders non-standard, yet uniquely optimized and powerful interface.</li><li style=\"\">Model your own 3D meshes, using a variety of optimal modelling techniques and workflows.</li><li style=\"\">UV Map objects using Projection and Unwrapping.</li><li style=\"\">Texture 3D models, and work with materials.</li><li style=\"\">Configure scene lighting.</li><li style=\"\">Use Blenders powerful animation tools to animate objects and scenes.</li><li style=\"\">Work with ambient and atmospheric rendering effects in Blender.</li><li style=\"\">Render still images and video sequences, using the two shipped rendering engines in Blender.</li><li style=\"\">Perform basic simulations using the built in game engine.</li></ol><p><strong style=\"\">By the end of this course, you will know how to use Blender, and how to bring you own 3D creations to live, whatever form they may take.</strong> The only limit is your imagination, so what your waiting for!? Sign up now, and start bringing your imagination to life on the computer screen with Blender!</p>", 
    "end_date": null, 
    "title": "Learn 3D Modelling & Animation from Scratch with Blender 3D", 
    "price": "20.00", 
    "instructors": "Richard Sneyd", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399414_8069_11.jpg", 
    "course_url": "https://www.udemy.com/learn-3d-modelling-animation-from-scratch-with-blender-3d/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T21:58:09Z"
}