{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t   It can be hard feeling completely lost when you already know the fundamentals and the software is the only thing getting in your way. Pulling your hair out because your speed and process have been thrown out the door. Knowing what you want to create but getting nowhere trying to accomplish it.  </p>  <p style=\"\">  \t <br style=\"\">  \t     Most tutorials for learning 3ds max are fundamentals video that are long and drawn out covering topics that you already understand, you&#039;re just looking for the information on how to transfer the skills you already have from working in Maya. The amount of time you spend trying to scan through tons of beginner videos to understand some of the more advanced techniques you might be using are overlooked, or in some cases aren&#039;t even available in 3ds max. This becomes irritating and wastes your time. <br style=\"\">  \t <br style=\"\">  \t     This video series is designed to get you up to speed inside of 3ds max and have you wondering why it ever seemed so hard to transfer between software in the first place. All of the main tools and techniques that are uses in everyday video game art development (modeling, unwrapping, and baking) will be explained and cross referenced to what you would use inside of Maya. So if your in need of getting up to speed inside of 3ds max for a new job position or are a student that is looking to increase his or her resume to become more attractive to employers this video series is just for you.  </p>", 
    "end_date": null, 
    "title": "Learning 3ds Max after knowing Maya : Modeling", 
    "price": "20.00", 
    "instructors": "Bradley Wascher", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/115776_b722_7.jpg", 
    "course_url": "https://www.udemy.com/learning-3ds-max-after-knowing-maya-modeling/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-05T22:37:48Z"
}