{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t      This video based Maxon Cinema 4D R14 training course from Infinite Skills teaches you the basic tools you will need to create 3D models in this software. Chris is an educator and also uses Cinema 4D for his business, creating graphics solutions for TV, film and businesses. He uses this real-world experience to show you how to actually use Cinema 4D for your day to day 3D modeling needs.  </p>  <p>  \t<br style=\"\">  \t      You will start out with a tour of the interface and lessons on understanding what 3D objects are. Once you have learned the basics, this course jumps right into teaching you how to create 3D objects using Splines, extrusion, sweeping and lathing. You will learn what Nurbs are, how to create basic 3D components using The Knife, Bevel, Bridge and other Cinema 4D tools. You will be taught how to utilize lighting, add textures to your models, and animate them. This video based tutorial also covers rendering your models and a chapter on using Mograph, then concludes with a project to build a model of a robot.<br style=\"\">  \t<br style=\"\">  \t      When you have completed this computer training course for Maxon Cinema 4D, you will understand the tools and techniques available to you for creating, animating and rendering 3D models with this software. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Learning Maxon Cinema 4D - A Beginners Training Course", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224066_2c4c_6.jpg", 
    "course_url": "https://www.udemy.com/learning-maxon-cinema-4d-a-beginners-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T15:10:32Z"
}