{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Blender is a fantastic platform which enables you to make AAA-quality models which can be exported to any game engine, 3D printer, or other software. Here are some of the reasons <strong class=\"redactor-inline-converted\">why you want to learn Blender with this online tutorial...</strong></p>\n\n<ul><li>Create assets for video games.</li><li>Make unique 3D printed gifts.</li><li>Design your dream house, car, etc</li><li>Express yourself through 3D artwork.</li></ul>\n\n\n\n<p>Learn how to create 3D Models and Assets for games using Blender, the free-to-use 3D production suite. <strong class=\"redactor-inline-converted\">We start super simple</strong> so you'll be ok with little or no experience. With our online tutorials, you'll be amazed what you can achieve.</p>\n\n\n\n<p>Ben Tristem is one of Udemy's top instructors, and Michael Bridges is an experienced 3D artist. Together Ben and Michael will provide world-class support, encouragement and plenty of challenges.</p>\n\n\n\n<p>The course is <strong class=\"redactor-inline-converted\">project-based</strong>, so you will applying your new skills immediately to real 3D models. All the project files will be included, as well as additional references and resources - you'll never get stuck. There are talking-head videos, powerful diagrams, quality screencasts and more.</p>\n\n\n\n<p>  \t      For each model you build you will follow this process...  </p>\n\n\n\n<ul>  \t<li><strong class=\"redactor-inline-converted\">Be challenged</strong> to build the entire model yourself.</li>  \t<li><strong class=\"redactor-inline-converted\">Be shown</strong> step-by step how to build it.</li>  \t<li><strong class=\"redactor-inline-converted\">Apply your knowledge</strong> regularly.</li>  </ul>\n\n\n\n<p>  \t      You will get full <strong class=\"redactor-inline-converted\">lifetime access</strong> for a single one-off fee. The creators are qualified and experienced with modelling and coding, so are able to explain complex concepts clearly, as well as entertain along the way.   \t  \t      By the end of the course you'll be very confident in the basics of 3D modelling and rendering, and hungry to learn more.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">If you're a complete beginner, we'll teach you all the modelling fundamentals you'll need.</strong> If you're an artist, we'll teach you to bring your assets to life. If you're a coder, we'll teach you modelling and design principles.</p>\n\n\n\n<p><strong>Note</strong>: access to this course comes with an optional, free community site where you can share games and 3D models, as well as connect with other students.<br></p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">Dive in now, you won't be disappointed!</strong>  </p>", 
    "end_date": null, 
    "title": "Learn 3D Modelling - The Complete Blender Creator Course", 
    "price": "45.00", 
    "instructors": "Ben Tristem, Michael Bridges", 
    "commitment": "37.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438522_500f_3.jpg", 
    "course_url": "https://www.udemy.com/blendertutorial/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T12:26:07Z"
}