{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tThis Maxon Cinema 4D R15 training course from Infinite Skills teaches you the basic tools and techniques needed to create 3D models in this 3D modeling software. This course is designed for the absolute beginner, meaning no experience with Maxon Cinema 4D or 3D modeling is required to get the most out of this course.  </p>  <p>  \t<br style=\"\">  \tYou will start out by touring the interface and learning the project settings for starting a new project. You will then be taught to understand 3D objects, including lessons on building a chair and table. Chris will teach you how to create 3D objects using Splines, extrusion, sweeping, and lathing. This video tutorial will teach you to create basic 3D components using the Knife, Bridge, and other Cinema 4D tools. You will learn about modeling objects and deformers while working with the Boole object, Instance objects, and the Spline wrap. Chris will teach you how to utilize lighting, add textures to your models, and animate and render them. Lastly, you will learn about MoGraph and how use the Cloner, MoText, and Random Effector.<br style=\"\">  \t<br style=\"\">  \tBy the completion of this video based training course, you will be fully knowledgeable in creating your own 3D models, as well as animating and rendering them using Cinema 4D. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Learning Cinema 4D - Mastering Cinema 4D Made Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222110_70b5_6.jpg", 
    "course_url": "https://www.udemy.com/cinema-4d-infiniteskills/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-18T19:42:25Z"
}