{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Learn Digital Compositing in Nuke from experienced Hollywood VFX Artist (20 years) and Trainer Aaron Estrada using professional grade media and digital assets.</p><p style=\"\">Compositing is the art and science of combining multiple images into a single seamless result. It a cornerstone of Visual Effects and one of the most important skills every budding Visual Effects artist should get exposure to.</p><p style=\"\">Nuke is arguably the most powerful compositing software package on the market, and the current de-facto industry standard. It&#039;s safe to say that if you do not know Nuke, you will have a very difficult time getting a job as a Feature or Television compositing artist.</p><p style=\"\">NK101 is designed to teach students both compositing and Nuke at a high level regardless of previous compositing experience. Using Nuke 9 as our playground for exploration, we start at the beginning and cover every aspect of modern compositing, step by step. If you are new to Nuke or Compositing, this is where you should start.</p><p style=\"\">Each lesson covers practical aspects of Digital Compositing Theory and its application in Nuke. The lesson ends with a practical tutorial / assignment, where students may practice the skills demonstrated in the lecture.</p><p style=\"\">NK101 includes approximately 16 hours of video training. Please also allot 3-4 hours per lesson for completing the assignments.</p><p style=\"\">NukeX is now free for personal, non-commercial work so you may get a license directly from The Foundry for free to use on your assignments.</p>", 
    "end_date": null, 
    "title": "Learn Digital Compositing in Nuke - NK101", 
    "price": "50.00", 
    "instructors": "Aaron Estrada", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434844_dd6d_3.jpg", 
    "course_url": "https://www.udemy.com/learn-digital-compositing-in-nuke-nk101/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T10:31:13Z"
}