{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Do you want to learn how to create 3D models from the ground up? Are you interested in attaining a skill set that could open the doors to potential new professions? Or are you looking to explore your creative side? Then this course could be the answer to all of those questions.</p><p>The complete modelling course teaches you how to use laptop as a 3D paintbrush to create stunning models using Blenders 3D modelling software. We take you from the ground up on how to use the blender interface to your advantage and use the tools at your disposal to create what you want.</p><p>This course is divided into a series of sections where each section focuses on a few of blenders modelling tools and uses those tools to help create a model that you can use for whatever you desire. Each section is divided up into two phases. The educational phase introduces specific tools and modifiers in blender and how to use them. The Project phase takes the techniques learnt in the educational phase and uses them to create either a model or a scene.</p><p>The modelling course has 5+ hours of content with more to be added down the line.</p><p><strong>What can I do after completing this course?</strong></p><p>Completing this course will help to advance your modelling skills, take what you learn from this course and expand your knowledge with courses on animation, character rigging, sculpting and so on. Or, apply your skills and begin making your own portfolio to help get your foot in the door in one of these professions:</p><ul><li>3D Artist</li><li>Game Design</li><li>Animation</li><li>Scene creation</li><li>Architectual design</li><li>Advertising</li><li>3D printing</li></ul><p><strong>What does this course cover?</strong></p><ul><li>Object Manipulation (location, rotation and scale)</li><li>Adding and Subtracting geometry.</li><li>Duplication</li><li>Scene Creation</li><li>Bezier Curves</li><li>3D Text Creation</li><li>Modifiers</li></ul><p><strong>What does this course not cover?</strong></p><ul><li>Materials</li><li>Rigging</li><li>Sculpting</li><li>Animation</li></ul>", 
    "end_date": null, 
    "title": "Learn Blender 3D - The complete modelling course", 
    "price": "20.00", 
    "instructors": "Joe Baily", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705180_b989.jpg", 
    "course_url": "https://www.udemy.com/learn-blender-3d-the-complete-modelling-course/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T19:25:06Z"
}