{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    In this course, instructor Stephen Wells is going to walk us through the process of learning the UV Unwrapping tools located within Maya.  To start he will be showing us the basics of UVs and manipulating them in the UV Texture Editor using a simple box primitive shape.  From there he will cover the Auto unwrap tools to begin teaching how to create custom UV layouts.  Next, he will be covering how to move, cut, and weld edges within the UV Texture window, as well as aligning UVs while walking through the unwrapping of a hose object, and  within the final three videos of the course he will be combining all of the features listed above while walking through the unwrapping of various organic and hard-edged objects such as an axe, shark, and human head.  </p>  <p>  \t            (Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)  </p>  <hr style=\"\">  <p>  \t<u style=\"\"><strong style=\"\">More about the Instructor:</strong></u>  </p>  <p>  \t    Stephen Wells is an expert 3D modeler for characters, props, vehicles, weapons and environments and have created both high and low polygon assets for game productions. He has over 20 years experience in creating a variety of game assets for several different genres (fantasy, sci-fi, combat, superheroes, horror, etc) using 3ds Max, Maya, Photoshop, ZBrush, Mudbox, Topogun, and xNormal. As an enthusiastic instructor, he loves creating video tutorials on a wide variety of subjects to help students better their skillsets.  </p>", 
    "end_date": null, 
    "title": "Learn to Master UV Unwrapping in Maya", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371880_cee1.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-learn-to-master-uv-unwrapping-in-maya/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T07:43:28Z"
}