{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Explore the wonderful world of Autodesk Maya with this comprehensive introductory course. Maya is an industry standard 3d application used to create movies, games and graphics. In this course you will learn to create your own stunning imagery. </p>\n\n<p><strong class=\"redactor-inline-converted\">Learn the fundamentals of Autodesk Maya</strong></p>\n\n\n\n\n\n\n\n<ul><li>Install Maya</li><li>Learn the Maya UI</li><li>Model and texture realistic objects</li><li>Animate you models</li><li>Light and render your animations so they look great!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Benefits of Learning Maya for Beginners</strong></p>\n\n\n\n\n\n\n\n<p>Maya is an industry standard application that is used by many high-end productions. By learning it you make yourself more employable. It has a flexible and wide toolset that can help you create high quality work quicker. This course is specifically designed to ease you into Maya, showing you the most common and powerful tools. It is a project based course that will teach you practical skills that you can use in your own work. This course comes with all the project files you need and work in progress files incase you get stuck.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Structure of this course</strong></p>\n\n\n\n<p>This course has five sections:</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">How to install Maya</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Maya Fundamentals</strong></p>\n\n\n\n<p>In this section you take your first look at Maya and the user interface. You will learn the different editors and the basics of create objects and manipulating them</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Toy Train Project</strong></p>\n\n\n\n<p>In this section you will create a toy train model and animate it along a path. You will learn how to light your train and apply materials to it. You will finish by rendering out your animation and view it.</p>\n\n<p><strong class=\"redactor-inline-converted\">Wizard Desktop Project </strong></p>\n\n<p>In this project you will create a desktop scene that you can customise and make your own! Dive deeper into the modelling tools and create a series of objects to create your scene. You will learn about texturing your objects and look at various different shaders to make different materials. You will also learn some more advanced lighting techniques and learn how to add atmosphere to your scene and render out a final image. This project is flexible enough to let you be creative with your own composition, lighting and look.</p>\n\n<p><strong class=\"redactor-inline-converted\">Maya reference </strong></p>\n\n<p>I have created this section to cover additional tools and settings which are extremely useful. </p>", 
    "end_date": null, 
    "title": "Learn Maya - A Beginners guide to Creating Realistic Scenes", 
    "price": "35.00", 
    "instructors": "Bhaumik Patel", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/732578_e509_5.jpg", 
    "course_url": "https://www.udemy.com/learn-maya-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T11:18:26Z"
}