{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course, we'll dissect the process for creating Quick Time Event driven animations in Maya. After exploring the fundamental needs of basic character locomotion and interaction, we'll prepare and export our animations to Unreal 4. Within UE4 we'll set up a playable environment where the characters will move from player control to executing QTE driven animations based on player input following on screen button notifications. Upon finishing this two volume series you'll have a better understanding of the Maya to UE4 animation process, Blueprints, Events and Matinee, pHAT and setting up keyframe to ragdoll execution.</p><p><strong style=\"\">(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong></p><p>More about the Instructor:</p><p>Matt Tardiff has worked as an animator on various projects from cartoons to video games. A few years ago he jumped in the adventure that is freelance and the academic world. At Full Sail University in Winter Park, Florida, he jumps on tables, topples over cabinets and uses props, reference, Maya, UE4 and straight keyframe techniques to help future animators learn how to utilize both art and tech to bring their creations to life in the engine. He also works as an animator/director etc. under his own company, Hummingbird and the Lotus. We're currently working on a Metroidvania PC titled Run Lulu Run to be released in 2016.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learn to Create Quick-Time and Matinee Events in UE4", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570514_316e.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-learn-to-create-quick-time-and-matinee-events-in-ue4/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T22:06:50Z"
}