{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Be able to make your game, movie or trailer titles whole other level. In this course you will learn how. I have packed some of the best tips that I use in my projects, to really improve a title text with a retro theme that can easily be adapted in other themes.<br><br>In this step by step course I will go through how I made the lightning effect with a frame by frame animation in Illustrator. How I did the text from scratch and finish up everything in After Effects to put everything togather and some thoughts on how I think around my design choices.</p><p>Many have asked why I chose Illustrator for frame by frame animation when Adobe Animation or Adobe Photoshop might be better. I chose Illustrator because I wanted to be able to scale and use the vectors. And I think there is a lot more people that knows Illustrator than Adobe Animation that has the same features.  </p><p><br></p><p><strong>This course is for the people</strong> that want to get to the next level of design and particular around the hard matter of typogrophy in motion. </p><p><strong>This is not for the people</strong> that haven't got some basic knowledge about After Effects. These tips of frame by frame animation takes time and practice to be good at, take some time and practice the tips I give you.<br><br></p><p>Enroll today and show me some epic animations!</p>", 
    "end_date": null, 
    "title": "Make an amazing retro title in After Effects", 
    "price": "20.00", 
    "instructors": "Mr Marcus Melin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789992_a3f3.jpg", 
    "course_url": "https://www.udemy.com/amazing-retro-title-in-after-effects/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T19:37:16Z"
}