{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tThis Adobe Edge Animate CC training course from Infinite Skills  teaches you about the tools and functions available in this web development tool. This Edge Animate course is designed for the absolute beginner, meaning no previous experience with Adobe Edge or Edge Animate is required.  </p>  <p>  \t<br style=\"\">  \tYou start by learning the basics of the interface, such as how to arrange your workspace, use the code panel, and learn various shortcut keys. Tony will show you how to import images and teach you about Photoshop and Illustrator integration. This video tutorial will cover topics including the code panel, exploring type, basic animation, creating and editing symbols, and creating labels and setting shape colors. You will learn how to create labels for buttons, import button images, and add text to buttons. Tony will also show you how to create a drop-menu, add sound to buttons, and control audio volume. Finally, you will learn responsive staging and scaling, how to create, import, and export and share a template, and export files for HTML and WordPress.<br style=\"\">  \t<br style=\"\">  \tOnce you have completed this video based training course, you will have a complete understanding of how to use the tools and functions available to you in Edge Animate to create animated, interactive content for your web projects. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Master Adobe Edge Animate CC - Edge Animate Made Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191794_bfe4_6.jpg", 
    "course_url": "https://www.udemy.com/master-adobe-edge-animate-cc-edge-animate-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-31T17:11:13Z"
}