{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Updated 2 January 2016 - Added a new section - How to use the Built in Transitions</strong></p><p>Learn the Basic and Advanced Concepts, tools, function and methods in Adobe After Effects that you will need to build a fully functional transitions project- fit for resale. </p>  <p>Or Simply learn how to create transitions for your personal use and implement them in your projects or at work.</p>  <p><strong>This Course Comes Complete with 30 Transitions + and all the Project Files to copy, amend, or repackage.</strong></p>  <ul><li>Linear Transitions using different shapes </li><li>Circle Transitions and pop up videos</li><li>Path and Masks Transitions </li><li>Trim Path, Wipes… Transitions</li><li>And much more…</li></ul>          <p><strong>Upgrade Your Skills:</strong></p>  <p>After Effects presents a wide range of applications. Transitions is one of them. Mastering this unique skill is effective and rewarding. You will become a proficient in understanding how transitions work, which tools and methods to use and how to rapidly create them. </p>  <p><strong>Enhance your Videos:</strong></p>  <p>If for professional or personal use using smooth or eye catching transitions, will always make your videos even more professional.</p>  <ul><li>You will master how to transit from one scene to another. </li><li>How the transitions have been created and how to implement the it in your video. Professionally.</li><li>Implement directly the transition in your video</li></ul>    <p><em>Download the project files and </em></p>          <ul><li>Change and amend any transition you want</li><li>Create new transitions depending on your requirement</li><li>Step by Step guide on how the transitions have been created.</li></ul><p>I use step by step procedure to teach you how to exactly create the transitions. I also teach you how to control colors globally and make the changes you desire. I will help you all the way even after you complete the course!</p>  <p><strong> Sell your Transition's Package</strong></p>  <p>Transitions in After Effects are in high demands. Some sites are selling thousands of projects every day. Almost every video or documentary, even short movies will require Transitions. It is and has been a trending market.</p>    <p>Not only you get to firmly understand how to build Transitions in After Effects but also learn how the animations have been created and DOWNLAOD the Projects for your personal or commercial use.</p>", 
    "end_date": null, 
    "title": "Master Transitions in Adobe After Effects - Complete Course", 
    "price": 0, 
    "instructors": "Louay Zambarakji", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/671010_e060_3.jpg", 
    "course_url": "https://www.udemy.com/after-effects-transitions/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-16T09:50:29Z"
}