{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t               Award-winning master animator, author and teacher <strong class=\"redactor-inline-converted\">Tony White</strong> offers 29 outstanding online tutorials on the core principles and techniques of <strong class=\"redactor-inline-converted\">2D animation</strong>. Through extensive illustrated text-based lectures and over <strong class=\"redactor-inline-converted\">4 hours</strong> of over-the-shoulder, <em class=\"redactor-inline-converted\">apprentice-style</em> video tutorials, Tony offers the finest foundation material possible in here presenting \"<strong class=\"redactor-inline-converted\">Mastering 2D Animation: 01</strong>\"!  </p>\n\n<p>  \t     Each of Tony's tutorials embrace a comprehensive, step-by-step, apprentice-style of instruction, using both <strong class=\"redactor-inline-converted\">classically hand-drawn techniques</strong> and <strong>vector digital </strong>ones. <em></em>Students should note that the core principles of movement taught in this course material however can always be applied to ALL forms of animation - from '3D' to 'Stop-frame', from 'Cut-out' to 'Claymation'! </p><p><em>(Note: The digital elements of this course are demonstrated using <strong>ToonBoom Studio</strong>. However, ToonBoom Technologies have since replaced 'Studio' with 'Harmony Essentials'. So students are strongly advised to obtain a rudimentary knowledge of this software before studying the digital aspects in this course. That way they will be better able to translate the 'Studio' instructions with the 'Harmony Essentials' ones without too much trouble.)</em>  </p>\n\n\n\n<p>  \t               Tony believes the<em class=\"redactor-inline-converted\"> 'apprenticeship' </em>style of teaching is the ONLY way to really learn animation and that the instruction offered by some of the big, for-profit animation schools and colleges around the world is entirely inadequate for the modern professional world. Consequently, by literally drawing from his own early apprenticeship experiences with three of the finest master animators of all-time - <strong class=\"redactor-inline-converted\">Richard Williams</strong> (3 times Oscar winner), <strong class=\"redactor-inline-converted\">Ken Harris</strong> (Warner Brothers) &amp; <strong class=\"redactor-inline-converted\">Art Babbit</strong> (Disney) - Tony has crafted here a series of unique and defining courses that are knowledgeable, accessible and perfectly suited to studies in a home-based environment.</p>", 
    "end_date": null, 
    "title": "Mastering 2D Animation: 01", 
    "price": "40.00", 
    "instructors": "Tony White", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21526_e7a3_11.jpg", 
    "course_url": "https://www.udemy.com/2d-academy-animation-101/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-20T19:36:20Z"
}