{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course, we will go through the whole process from start to finish and create a fully animated 3D Matte painting using Autodesk Maya, Adobe Photoshop and Adobe Aftereffects. we will go through the essential techniques for 3D matte painting from creating the matte painting using still images in photoshop to modeling, animation and rendering in maya and then final compositing in aftereffects.</p><p><strong>14 HD Lectures with over 1.37 hours of content. </strong></p><p><strong>Topics Covered In This Course:</strong></p> <ul> <li>Photoshop Setup and Painting</li> <li>Exporting Image Elements In Photoshop</li> <li>Camera Setup In Maya</li> <li>Modeling for Projection In Maya</li> <li>Camera Animation In Maya</li> <li>Texturing for Projection In Maya</li> <li>Shader Setup In Maya</li> <li>Compositing In Aftereffects</li> <li>Creating Lens Flare In Aftereffects</li> <li>Creating Atmospheric Effect in Aftereffects</li> <li>Colour Correction in Aftereffects</li> </ul> <p><strong>Who Should Take This Course:</strong></p><p>Any one is interested in creating stunning 3d matte painting using solid methods then he/she should consider this course, by the end of this course you will be able to transform any still image into outstanding matte painting fully animated.</p><p>However this course is not designed for people who can't use Maya, Photoshop or Aftereffects. but if you have a basic working knowledge with the softwares and their shortcuts then you should be ready to take it.</p><p><strong>Why Learning 3D Projection Is Important:</strong></p><p><strong>Here is a few reasons:</strong></p><p>1- Huge time saving, instead of modelling everything in 3d you can heavily cheat and get amazing results.</p><p>2- Used in movies, TV and commercials, so you can expand your reach.</p><p>3- Used in corporate videos.</p><p>4- Bring any still image to life.</p><p>5- Big time saver for your projects.</p><p>6- Great addition if you are creating video presentations.</p><p><em>I'm sure there is a million other reasons why you should consider learning this amazing approach.</em> </p><p>Just to make sure you are not left alone, at the end of the course I offer two assignments for the students and everyone can pick the assignment that matches there current level and after they do the assignment they can upload the video to vimeo and post it on the discussion so I can take a look at it and give you feedback, this way you will learn much quicker!</p><p><strong>If you are very excited like me then take this course and lets get started!</strong> </p>", 
    "end_date": null, 
    "title": "Mastering Camera Projection in Maya", 
    "price": "20.00", 
    "instructors": "Mohammad Sadeh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480096_6169.jpg", 
    "course_url": "https://www.udemy.com/mastering-camera-projection-in-maya-part-1-matte-painting/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-19T03:02:38Z"
}