{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  En este tutorial se va a modelar al conocido personaje Freezer de la saga Dragon Ball Z. Se creará el personaje mediante el sistema de Zspheres y con simetría, se creara el tipo de Skin mas apropiado para nuestro modelo, y se trabajará la posición final mediante el Plugin Transpose Master.  </p>  <p>  \t  Zbrush es un software de modelado 3d , escultura y pintura digital que constituye un nuevo paradigma dentro del ámbito de la creación de imágenes de síntesis gracias al original planteamiento de su proceso creativo .  </p>  <p>  \t  Este curso es impartido por Daniel Bertó, dedicado a mundo del 3D desde hace más de diez años, dentro de su curriculum académico podemos destacar, un Master en Infoarquitectura, un Master en Modelado y Animación de personajes, un Master en Mudbox, así como la Carrera de Dirección de Cine Digital y efectos especiales THX. Su experiencia laboral comienza en el campo de la infoarquitectura , y posteriormente en la publicidad, los videojuegos y la dirección de un Teaser Trailer en 3D, donde dirigió un equipo de once personas y en el que coordinó los departamentos de modelado, texturizado, iluminación y render.  </p>  <p>  \t  En el curso cubriremos los siguientes puntos:  </p>  <ul style=\"\">  \t<li>Uso de referencias</li>  \t<li>Uso de Zspheres</li>  \t<li>Adaptative skin</li>  \t<li>Esculpido de los elementos</li>  \t<li>Uso de Dynamesh</li>  \t<li>Esculpido de detalles y accesorios</li>  \t<li>Texturizado</li>  \t<li>Uso de Transpose Master para colocar la pose final.</li>  </ul>", 
    "end_date": null, 
    "title": "Modela a Freezer con ZBrush", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184218_a8a4_2.jpg", 
    "course_url": "https://www.udemy.com/modela-a-freezer-con-zbrush/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-17T21:34:46Z"
}