{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tAnimation is a booming industry nowadays. Its been used to create movies, advertisement and even military simulation. With the technology today, you can make the quality animation like the one you&#039;ve seen in the cinema with your home PC. <br style=\"\">  </p>  <p>  \tA lot of times people dont really understand what to do to be an animator. Most of the people i know stop being an animator after a while. Not because they are not good. Its just not like what they expected. A lot of schools and workshop nowadays are pricey and will take quite a while. Normally it will take around 1-3 years, and the animation wont usually start until the second year. After the school, you will need a lot of years to finally grasping the concept of animation. Stop wasting your money and time. Dont spend a lot of time and money then finally regret your decision. Gain an insight on animation before you decide to spend your time and money by taking this course. If you are a student who are looking where to start, or you are an artist in another field who need to do a simple animation than this course is for you.  </p>  <p>  \t    This course will teach you how to create animation from scratch. The course will be in 2 parts. First part will teach you how to create animation using templates. At this stage, a lot of things are automated. Creating animation can be done within minutes. Second part will teach you basic knowledge about animation without using templates. You will gain an insight on how to create or modify the animation from part 1. Both part will take around 30 minutes. Yes, its that fast.  </p>  <p>  \t    This course will be using Autodesk Maya 2013, but animation is about art more than software. You can use the knowledge throughout any other software.  </p>", 
    "end_date": null, 
    "title": "Model,Rig & Animate done within minutes using Autodesk Maya ", 
    "price": "50.00", 
    "instructors": "Learn Animation", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/212070_ff39_3.jpg", 
    "course_url": "https://www.udemy.com/modelrig-animate-done-within-minutes-using-autodesk-maya/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-07T05:58:41Z"
}