{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>The motion graphics for beginners course is designed to cater for graphic design student who wish to step into screen design and animation as an extension to their existing graphic design skills. In addition, it is also aimed at developing moving image students who want to develop skills in motion graphics &amp; effects production as a first step at understanding how industry standard software works. There is the opportunities for enthusiast to gain a foundation knowledge of both the theory and practice behind digital animation as well as  the processes of production and would offer anyone wishing to study the subject area a beginners guide to production.</p>    <p>Motion graphics are becoming a more integral part of graphic design and moving image/Tv production and the course would offer opportunities for people working in various aspects of the creative industry to gain more relevant skills that reflect an ever evolving industry. </p>    <p>At the end of the course you will be able to;</p>  <ul><li>organise and plan a motion graphics  project from idea generation through to the production stages</li><li>Competently use software for the production of motion graphics work (Adobe After Effects &amp; Apple Motion) at a foundation or beginners level</li><li>Understand and gain experience of digital animation through practical workshops</li></ul>        <p>The course will also guide you though; </p>    <ul><li>the research an idea generation stages</li><li>Current practice and work that the industry is producing for tv, web and film in order to inspire and influence your own creative development.</li><li>The preproduction stages; understanding why and how work is produced along side the planning.</li><li>The digital production stage from a practical perspective; resulting in a finished portfolio piece of work</li></ul>          <p>This will help you understand and gain experience of the subject area in order to complete and pass the course. After completing the study program you will have gained essential skills and experience in motion graphic productions and will be ready to undertake small assignments in this new and evolving creative arena. </p>    <p>By focusing on the processes of production at a foundation level (basic fundamentals of production) the course will offer you a chance to concentrate your already creative abilities by channelling your ideas through a digital medium. The end result of all your studies will be a physical production piece for your portfolio. Hopefully, in turn, this will help you progress your creativity, digital skills and develop more opportunities within your current or developing career avenue.</p>", 
    "end_date": null, 
    "title": "Motion graphics for beginners ", 
    "price": "20.00", 
    "instructors": "Antony Lee", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750472_0a63_2.jpg", 
    "course_url": "https://www.udemy.com/motion-graphics-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T20:20:26Z"
}