{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  En este curso de introducción a Autodesk MUDBOX aprenderemos a realizar escultura y pintura en 3D, en tiempo real. Daremos un repaso a todas las herramientas del software y, mediante ejemplos prácticos, iremos desarrollando todas las habilidades de pintura y escultura, para finalizar con la extracción de mapas realizados durante el Curso.  </p>  <p>  \t Combinando una interfaz intuitiva del usuario con una suite de herramientas creativas de alto rendimiento, el software de esculpido digital y pintura de texturas Autodesk® Mudbox™ ofrece a los profesionales del modelado 3D la capacidad para crear recursos 3D orgánicos e inorgánicos altamente detallados de manera rápida y fácil.  </p>  <p>  \t Este curso está impartido por Jose Luis Quirós. Con más de 15 años de experiencia en producciones audiovisuales y en 3D, comenzó de forma autodidacta y gracias a la carrera profesional de diseño industrial creó mis primeros modelos 3D; estudió 3ds max, maya y softimage. Ha trabajado en largometrajes de animación, videojuegos, publicidad y cine y ha dirigido proyectos como los Marcatoons y participado en cinco largometrajes, el último de ellos nominado a los premios Goya.  </p>  <p>  \t En este curso cubriremos los siguientes temas:  </p>  <ul>  \t<li>Familiariazarse con el programa</li>  \t<li>Layout</li>  \t<li>Navegación en el interface</li>  \t<li>Importación de objetos</li>  \t<li>Conceptos de escultura 3D</li>  \t<li>Modelado práctico y detallado del modelo</li>  \t<li>Esqueletos y poses</li>  \t<li>Curvas</li>  \t<li>Materiales</li>  \t<li>Luces y render</li>  \t<li>Conceptos de pintura 3D</li>  \t<li>Pintado del modelo</li>  \t<li>Extracción de mapas</li>  </ul>", 
    "end_date": null, 
    "title": "Mudbox", 
    "price": "35.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177578_cb9c.jpg", 
    "course_url": "https://www.udemy.com/mudbox-digital/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-05T23:53:31Z"
}