{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  En este curso veremos como trabajar rotoscopia e integración con Nuke.  </p>  <ul style=\"\">  \t<li>Por un lado vamos a iniciarnos en la rotoscopia con sencillos ejemplos que nos ayudaran a modificar nuestros vídeos mediante el nodo de roto en Nuke usando sus alphas. </li>  \t<li>Por otro lado veremos como integrar un chroma dentro de nuestra escena renderizada en 3Ds Max. </li>  \t<li>Con unos sencillos pasos también haremos que nos de la sensación de que está dentro de ella, jugando con las capas, para lograr una integración muy real. </li>  \t<li>También veremos las nuevas novedades que nos trae el software Nuke de The Foundry, en su versión 8. Veremos como han conseguido un mejor workflow tanto de color, como de geometría o motion graphics. </li>  </ul>  <p>  \tNuke es un software de composición digital producido y distribuido por The Foundry. Se utiliza para la post-producción en el cine y la televisión. Los usuarios de NUKE incluyen a Digital Domain, DreamWorks Animation, Sony Pictures Imageworks, Sony Pictures Animation, Framestore, Weta Digital e Industrial Light &amp; Magic. NUKE ha sido utilizado en producciones como Avatar, Mr. Nobody, El curioso caso de Benjamin Button, King Kong, Jumper, I, Robot, Resident Evil: Extinction, Tron: Legacy, Alicia en el país de las maravillas y Cisne Negro, etc...  </p>  <p>  \tEste curso es impartido por Enrique Pesqueira, diseñador gráfico 3D con un master en infoarquitectura hiperrealista. Ha trabajado como infografista y delineante proyectista durante los últimos 5 años en distintos estudios de arquitectura y en 2013 obtuvo el 3Dmax certificate.  </p>", 
    "end_date": null, 
    "title": "Nuke", 
    "price": "40.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188634_18f5_2.jpg", 
    "course_url": "https://www.udemy.com/nuke-trazos/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-25T18:27:29Z"
}