{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<strong></strong><p><strong></strong><strong></strong></p><p><em>\"Excellent Introduction to Animation. Loved this course! Kristen is very thorough in her instruction and shows multiple ways to accomplish the various tasks included in the animation process. She discusses everything from where to get video to drawing techniques and final presentation. This was a fun course and I recommend it to anyone interested in learning the basics of animation in Photoshop or a similar program.\" <br>-Deborah Wojcicki<br></em></p><p><strong></strong></p><p><strong><em></em>Course Last Updated: February 23, 2016. 11AM GMT+1.</strong></p><p><strong>Are you ready to take your videos to the next level? </strong></p><p>This easy to follow course will help you make original, custom animations using <em>Adobe Photoshop </em>that look professional and can be used as stand-alone movies (without needing any other software) or in combination with other video, animation, and multimedia software programs for a full range of effects and purposes. <strong>FREE 30 day trials of Photoshop are available at Adobe's website.</strong></p><p>In this course you will learn my very favorite animation and video rotoscoping techniques to create powerful multimedia projects ranging from laughably simple (think stick figures waving) to more sophisticated and complex (such as my own award-winning series of films screened internationally in film festivals and online since 2002.)</p><p><strong>In this course you'll learn step by step how to:</strong></p><ul><li>Harness the power of Photoshop to create simple or complex frame by frame animations, with or without using Photoshop's timeline.</li><li>Easily turn a regular video into a stop-motion animated video by making simple frame rate adjustments.</li><li>Apply a full range of effects to your video to create animated elements or a stand-alone animation even if you CAN'T DRAW.</li><li>Coax Photoshop to animate objects and layers for you (without having to draw anything) by making position, size, and opacity changes, to name just a few possibilities.</li><li>Craft multiple effects at once to create more complex final animations by using multiple layers.</li><li>Capture complex movements by bringing in video, drawing right over it, and (optionally) throwing the video guide out so all that is left is your new animation with its sophisticated movements. (That's rotoscoping!)</li></ul>I start from the very beginning using Adobe Photoshop. Free 30 day trials of <em>Photoshop</em> are available from Adobe's website BUT many of the techniques I show you in this course (such as frame by frame animation) can be achieved in virtually any imaging software combined with your favorite video editing program.<span></span><p><br><strong>All of my techniques are explained so you will 100% understand how they work.</strong> You can then decide how much time you will spend on each animation which will then affect your end results. </p><p>I'm a tenured Associate Professor of Digital Media and the Program Director of Film &amp; Digital Media at The American University of Rome and a practicing award-winning multimedia artist.</p><p>I have over 15 years of experience teaching students all over the world using my tried and true custom approach (turning complex information into something simple, memorable, easy-to-understand in as short amount of time as possible) to ensure that <strong>you get the most important, relevant, and useful information that can be applied immediately to your art, work, and everyday life. </strong></p><p>New bonus lectures and resources will continue to be added and timely design advice will be provided in the discussion forum. I love to help and always respond to inquiries and discussions ASAP. </p><p><strong>Please Note: All students who enroll in this course also will receive periodic free and discounted access to my other top-rated current and upcoming courses.</strong></p><p>You have a 30-day, 100% money-back guarantee with no questions asked so you have nothing to lose. I make myself available so you will have access to me if you have questions or need specific feedback along the way. </p>Empower yourself now by enrolling in this animating in Photoshop course and join our growing learning community! Click the \"Take This Course\" button in the upper right corner and let's get started building your animation, multimedia, and video skills today.", 
    "end_date": null, 
    "title": "Photoshop: Quick and Easy Animation Like a Professional", 
    "price": "20.00", 
    "instructors": "Kristen Palana", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597196_1bf5_6.jpg", 
    "course_url": "https://www.udemy.com/animate-in-photoshop-easy-video-rotoscoping-animating/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T05:58:37Z"
}