{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Haben Sie sich schon jemals gefragt, wie Sie Ihre Ideen mit einem einfach zu verwendenden und dennoch leistungsfähigen und flexiblen CAD-Paket entwickeln können?</strong></p>\n\n<p>In diesem Kurs erlernen Sie die ersten Schritte beim Produktdesign mit Autodesk Fusion 360. Sie erfahren, wie Sie Ihren Ideen Form geben, wie Sie Bauteile und Baugruppen modellieren und wie Sie im letzten Schritt Zeichnungen und Visualisierungen erzeugen und Ihre Modelle für die Fertigung mit einer CNC-Maschine oder einem 3D-Drucker aufbereiten.</p>\n\n\n\n<p>Fusion 360 ist ein cloudbasiertes CAD/CAM-Tool für die kollaborative Produktentwicklung. Mit Fusion 360 können Sie Ihre Produktideen erkunden, verschiedene Varianten durchprobieren und im Team zusammenarbeiten, selbst wenn die Projektbeteiligten über die ganze Welt verstreut sind. Vor allem aber kombiniert Autodesk Fusion 360 die Modellierung von organischen Formen, die mechanische Konstruktion und die Fertigung in einem umfassenden Softwarepaket. Besuchen Sie auch die offizielle Website von Autodesk Fusion 360 und laden Sie die Software herunter, um mehr über Fusion 360 zu erfahren. Studenten, Lehrkräfte, Hobbyanwender und Start-up-Unternehmen (denen noch keine kommerzielle Produktversion zur Verfügung steht) haben Anspruch auf eine kostenlose Lizenz.</p>\n\n\n\n<p><strong>Nach Abschluss des Kurses werden Sie die nötigen Kenntnisse besitzen, um Ihr eigenes Produkt von der Idee bis zum Prototyp zu entwickeln.</strong></p>\n\n\n\n<p>Der Kurs besteht aus insgesamt vier Stunden Videolektionen und enthält darüber hinaus schriftliche Unterlagen mit Schritt-für-Schritt-Anweisungen sowie Datensätze. Durchschnittlich benötigt ein Teilnehmer etwa 16 Stunden, um den Kurs durchzuarbeiten. Installieren Sie Autodesk Fusion 360 und beginnen Sie gleich mit dem Lernen!</p>\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "Produktdesign in Fusion 360: Von der Idee zum Prototyp", 
    "price": 0, 
    "instructors": "Autodesk Education", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796406_757a_2.jpg", 
    "course_url": "https://www.udemy.com/produktdesign-in-fusion-360-von-der-idee-zum-prototyp/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T23:40:55Z"
}