{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>******* Major upgrades to the course completed as of June 9, 2016 ******* </strong></p><p><strong>Check the announcements section for more details.</strong></p><p><strong>Ever wonder how to develop your idea with an easy to use yet powerful and flexible CAD package?</strong><br></p>\n\n<p>  \t    In this course a student will get started with product design in Autodesk Fusion 360. During the course you will learn how to sculpt your idea, then move to parts and assembly modelling, and, as a final steps, create drawings, renderings and prepare for manufacturing on CNC machine or 3D printer. </p>\n\n<p>Fusion 360 is a cloud-based CAD/CAM tool for collaborative product development. Fusion 360 enables exploration and iteration on product ideas and collaboration within distributed product development team. Most importantly, Autodesk Fusion 360 combines organic shapes modelling, mechanical design and manufacturing in one comprehensive package. We encourage you to learn more about Autodesk Fusion 360 at the official website as well as download the product. Students, educators, enthusiasts and startups (no commercial product available yet) are entitled for a free licence.</p>\n\n<p>  \t<strong>After completion of the course, you will be able to design your own product from idea to prototype. </strong>  </p>\n\n<p>  \t    The course contains 4 hours of video lessons, written step-by-step instructions and datasets. On average, a student needs around 16 - 24 hours to complete the course. Install Autodesk Fusion 360 and Start Learning Now!  </p>", 
    "end_date": null, 
    "title": "Product Design in Autodesk Fusion 360 from idea to prototype", 
    "price": 0, 
    "instructors": "Autodesk Education", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368874_196c_2.jpg", 
    "course_url": "https://www.udemy.com/product-design-fusion-360/", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T15:22:18Z"
}