{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Stop your “I don’t have time for this” and animate quickly, using a powerful technique that helps you animate with just a few clicks and drags.</strong>  </p>  <p>  \tThe most common reason why people neglect to pursue something in their lives is because the lack of time. Lots of work, lots of things to do.  </p>  <p>  \tThat’s the very reason why millions of people love to learn how to do things faster and easier.  </p>  <p>  \t<strong style=\"\">But how can you do something if there is no such way yet?</strong>  </p>  <p>  \tFrustration hurts, but I had to overcome it. And better yet, help others to avoid it.  </p>  <p>  \tWhen I started to take a bit of my sleep time to start a project in animation, I just knew it was going to take me forever, and after the frustration of dropping the project for a couple of months, I came back for revenge! (Not in the negative way, more like in an EPIC WAY!)  </p>  <p>  \tIt was after watching a couple of tutorials for After Effects on Video Copilot that I learned the power of expressions. Got me inspired. There could actually be a way to solve this!  </p>  <p>  \tAs you know, there is no spoiler in saying this, but yes, I found a way. HOORAY!  </p>  <p>  \t<strong style=\"\">Finally, a solution!</strong>  </p>  <p>  \tThat solution is what this course is about. Teaching you how to speed up your animation time with an advanced technique: Rigged Characters.  </p>  <p>  \tRigging characters has been used since a couple of years ago, but what I teach you here is how to automate the movements by using expressions (Java code and lots math) inside After Effects to give you the ability to move your characters with just clicks and drags.  </p>  <p>  \tJust check 1 hour of free lessons to see if you find the techniques interesting.  </p>  <p>  \t<strong style=\"\">“What options do I have for animating a character?”</strong>  </p>  <p>  \tPicture this. You have a project in your mind, let’s say, a 2 minute animation. You have the plot in your mind, it’s a good story and you even have the main characters drawn and ready.  </p>  <p>  \tYou know how to use After Effects, because you went to Video Copilot and learned the basics for free.  </p>  <p>  \t<strong style=\"\">Option 1: Puppet tool</strong>  </p>  <p>  \t<strong style=\"\"></strong><span>You could put your drawings inside After Effects and put a couple of puppet pins, so you can move the character by changing the position of the pins. Right? </span>Well that<span> takes a lot of time to animate, it’s faster than drawing frame-by-frame, but still takes a lot of time.</span>  </p>  <p>  \t<strong style=\"\">Option 2: Cut out animation</strong>  </p>  <p>  \tMaybe you don’t know about the puppet tool technique and you just split the character into the different parts of the body. The arms, the legs, the body and the head. Everything in a separate layer. Animating that “rig” takes a lot of time too. Maybe it’s faster than classical animation but it won&#039;t be as fast as a few clicks and drags to change the position.  </p>  <p>  \tWhat can you do to make it super fast?  </p>  <p>  \t<strong style=\"\">Option 3: Advanced Rigging</strong>  </p>  <p>  \tUsing a powerful rig that calculates everything for you so you only have to make a few clicks and drags to change the position of your character.  </p>  <p>  \tIt’s so easy that you will remember when you played with toys  </p>  <p>  \tHave you ever played with toys? If you wanted to raise the hand of your Action Figure or your Barbie, all you had to do was to take the hand and raise it right? Imagine if animating was that simple.  </p>  <p>  \tWell, this is what this course is going to teach you. How to change body positions in a snap.  </p>  <p>  \t<strong style=\"\">When you find a solution, everybody wants to know it</strong>  </p>  <p>  \tAfter I came up with this technique, I brought it to the studio I work for (I do motion graphics for commercials), and they went crazy. They started to ask me for lots of tips because I knew that the secret to be faster in animation was by using expressions.  </p>  <p>  \tAnybody who knows how to use After Effects knows that the secret to speed up your work is by automating with expressions. And the only way I could help everybody, was by organizing the process and create a couple of videos.  </p>  <p>  \tThat’s when the idea for this course was born.  </p>  <p>  \t<strong style=\"\">Rigged Characters are the common way to speed your animation, everybody knows that</strong>  </p>  <p>  \tRigged Characters are what most professionals under a schedule use. I’m talking about Nickelodeon, Disney TV. They all use techniques to rig characters and animate faster.  </p>  <p>  \tBut until now, there was no way you could achieve all this in After Effects, you had to do your animation in Toon Boom, or Animate Studio. What about us? The After Effects Community?  </p>  <p>  \tWell, this is my contribution. An Advanced Rig that helps you control your character easily and quickly, all inside After Effects.  </p>  <p>  \tIf you haven’t checked yet, take a look at 1 hour of free lessons and see for yourself how easy you can achieve this rig, and how it can help you to animate faster.  </p>  <p>  \t<strong style=\"\">“It all sounds great, but, What level of knowledge do I need?”</strong>  </p>  <p>  \tBecause I know there is a lot of people who doesn’t know how to use After Effects, I made an update and included a tour of the software. Everyone is getting it now. And if you are a veteran user, you might discover some advanced little tips that can help you cut your work time in half.  </p>  <p>  \t<em style=\"\">Check the reviews.</em>  </p>  <p>  \tAnimating faster is not only something people with little time need, but also big studios who work under a schedule. This course will help you achieve faster times, deliver work earlier and stay ahead of schedule.  </p>  <p>  \t<strong style=\"\">“What if I don’t understand something? What if I need help?”</strong>  </p>  <p>  \tIf you have a question, just ask me and I try to reach as fast as possible. I answer all questions, mostly on the same day. I check my inbox twice a day.  </p>  <p>  \tAnd just so you know, this course has had tons of modifications thanks to the many questions I received. Many lessons have been re recorded so anyone can understand the concepts. Really, any doubt you have is actually a way to help improve this course.  </p>  <p>  \t<strong style=\"\">Check the free lessons now!</strong>  </p>  <p>  \t<span>What are you waiting for? Preview the free hour of video lessons and if you believe this course is what you were looking for, enroll for the complete 4.5 hour course and discover the secret techniques that can help you cut your working time in half.</span>  </p>  <p>  \tInside you will find the project files to follow along and easy to follow instructions to achieve this powerful technique.  </p>  <p>  \t<strong style=\"\">Enroll today!</strong>  </p>", 
    "end_date": null, 
    "title": "Save Time in Character Animation for After Effects", 
    "price": "50.00", 
    "instructors": "2D Animation 101 Courses", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326862_2b2d_3.jpg", 
    "course_url": "https://www.udemy.com/2d-character-animation-puppet-in-after-effects/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-25T07:40:03Z"
}