{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tFor this course, we explore Dynamesh sculpting in ZBrush and we&#039;re continuing our cosmic entity series by working on Tsathoggua, one of the Old Gods and rival of Cthulhu. We&#039;ll be delving into dyamesh by first adding basic foundational shapes, and then expanding on those foundations to further create the warty details that best fit this frog-like creature. We&#039;ll then use a combination of alphas, layers and several different brushes to achieve all the final details that make up the swampish visage that is none other than Tsathoggua!  </p>  <p>  \t      (Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)  </p>  <hr style=\"\">  <p>  \t<u style=\"\"><strong style=\"\">More about the Instructor:</strong></u>  </p>  <p>  \t    Stephen Wells is an expert 3D modeler for characters, props, vehicles, weapons and environments and have created both high and low polygon assets for game productions. He has over 20 years experience in creating a variety of game assets for several different genres (fantasy, sci-fi, combat, superheroes, horror, etc) using 3ds Max, Maya, Photoshop, ZBrush, Mudbox, Topogun, and xNormal. As an enthusiastic instructor, he loves creating video tutorials on a wide variety of subjects to help students better their skillsets.  </p>", 
    "end_date": null, 
    "title": "Sculpting CG Creatures in ZBrush: Tsathoggua", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400782_bf2c.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-sculpting-cg-creatures-in-zbrush-tsathoggua/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T04:43:17Z"
}