{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tIn this course we jump into the worlds of ZBrush dynamesh sculpting and H.P. Lovecraft at the same time! We tackle the Old God, Cthulhu, by starting with a simple dynamesh sphere and using several techniques, we pull and push and sculpt a basic shape for Cthulhu&#039;s head and make a quick torso and temporary tentacles. We then expand our repertoire in creating more detail sculpting by using a variety of brushes, alphas, layers and some finesse to get a final fantastic sculpt of one of Lovecraft&#039;s faves: Cthulhu!  </p>  <p style=\"\">  \t      (Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)  </p>  <hr style=\"\">  <p style=\"\">  \t<u style=\"\"><strong style=\"\">More about the Instructor:</strong></u>  </p>  <p style=\"\">  \tStephen Wells is an expert 3D modeler for characters, props, vehicles, weapons and environments and have created both high and low polygon assets for game productions. He has over 20 years experience in creating a variety of game assets for several different genres (fantasy, sci-fi, combat, superheroes, horror, etc) using 3ds Max, Maya, Photoshop, ZBrush, Mudbox, Topogun, and xNormal. As an enthusiastic instructor, he loves creating video tutorials on a wide variety of subjects to help students better their skillsets.  </p>", 
    "end_date": null, 
    "title": "Sculpting CG Creatures in ZBrush: Cthulhu", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390194_12df.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-sculpting-cg-creatures-in-zbrush-cthulhu/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T07:44:18Z"
}