{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  In this series, we take on one of the very oddest creatures of the Cthulhu pantheon: the Elder Thing! We&#039;ll be using Dynamesh for the entire alien entity but we&#039;re going to pull some &quot;Frankensteining&quot; - that is, we&#039;re going to be creating different parts of the creature in different files to refine and finesse them before adding them to a singular IMM brush so that we can &#039;sew&#039; together all the different elements into one cohesive, yet awesomely monstrous creature! We&#039;ll be running the gamut for detailing using brushes, alphas, layers and the IMM brush to end up with a very unique entity that would make Lovecraft proud!  </p>  <p style=\"\">  \t(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)  </p>  <hr style=\"\">  <p style=\"\">  \t<u style=\"\"><strong style=\"\">More about the Instructor:</strong></u>  </p>  <p style=\"\">  \t  Stephen Wells is an expert 3D modeler for characters, props, vehicles, weapons and environments and have created both high and low polygon assets for game productions. He has over 20 years experience in creating a variety of game assets for several different genres (fantasy, sci-fi, combat, superheroes, horror, etc) using 3ds Max, Maya, Photoshop, ZBrush, Mudbox, Topogun, and xNormal. As an enthusiastic instructor, he loves creating video tutorials on a wide variety of subjects to help students better their skillsets.  </p>", 
    "end_date": null, 
    "title": "Sculpting CG Creatures in ZBrush: Elder Thing", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400784_4abd.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-sculpting-cg-creatures-in-zbrush-elder-thing/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T04:48:33Z"
}