{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t You know how to use SketchUp to create 3D models of your projects, but you need to create a 2D presentation of your model in order to communicate your design to other people. With SketchUp Pro, you have the ultimate tool for creating just that; LayOut.  </p>  <p>  \t LayOut is the companion program that comes with SketchUp Pro. It takes your 3D model and creates 2D snapshots of your model and places them onto &quot;pages&quot; so you can add dimensions, annotations, and other information in order to create a complete set of construction documents.  </p>  <p>  \t This course gives you a complete introduction to LayOut, teaching you all the basics you need to know in order to create a presentation of your model. In addition, you&#039;ll learn how to prepare your SketchUp model for LayOut. Have complete control over the look of you LayOut viewports by properly organizing your SketchUp model and creating scenes.  </p>  <p>  \t After learning how to create a LayOut document, you&#039;ll also learn advanced techniques in SketchUp for creating section cuts, hatch patterns, and poche effects.  </p>  <p>  \t This video course includes the SketchUp to LayOut PDF ebook which has all of the lessons from this video course, and other valuable tutorials which you can follow. You&#039;ll also get the CAD hatch material library and style library so you can apply traditional hatch patterns to your model.  </p>  <p>  \t By the end of this course, you&#039;ll have a complete understanding of how to create a SketchUp model specifically for LayOut, as well as how to create a full set of construction documents inside LayOut.  </p>", 
    "end_date": null, 
    "title": "SketchUp to LayOut ", 
    "price": "50.00", 
    "instructors": "Matt Donley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22985_10a6_7.jpg", 
    "course_url": "https://www.udemy.com/sketchuptolayout/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-16T00:52:12Z"
}