{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>SOLIDWORKS is the world leader in 3D software for product development and design. With SOLIDWORKS you can create manufacturing-ready parts and assemblies, as well as detailed drawings and bills of materials.</p><p>This course will take you from zero experience in 3D Modeling to a professional who can build 3D parts and assemblies, and turn them into production ready manufacturing drawings.</p><p>This SolidWorks Essentials course is encouraged for anyone new to SolidWorks. Whether you have migrated from 2D CAD, another 3D system, or have no experience with CAD at all this course is suited for you. Starting from the very basics of the program, the course develops looking at modelling essentials required for day to day use of the software, right through to some advanced topics for automating designs. </p><p>This course, also focus on 2D drawings aspect of the package, goes in depth into setting up drawing sheets, creating drawing views and applying dimension schemes. Time is spent customizing drawing borders for company specific requirements.</p><p>By quickly getting up to speed, as well as using best modeling practices, the SolidWorks Essentials course ultimately ensures maximum efficiency and productivity for all SolidWorks users. New CAD users, seasoned users of other CAD systems and veteran SolidWorks users can all benefit from Essentials training. Real life case studies are used to illustrate processes, teaching everything you need to know for building models of parts and assemblies, and making drawings of those parts and assemblies.</p><p>In this course we'll show students how to create manufacturing-ready parts and assemblies in SOLIDWORKS. We'll begin with simple 2D sketching and the software's sketch-editing tools as we provide step-by-step instruction on building 3D geometry from 2D sketches.<br></p><p>So at the end of this course you will be able to grab any real life object and make a 2d sketch for it, then convert that sketch to 3D Model that will be ready to manufacture.</p>", 
    "end_date": null, 
    "title": "SOLIDWORKS: Turn 2D Sketches into 3D Models", 
    "price": "20.00", 
    "instructors": "Ashraf Al-Madhoun", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698862_ac41.jpg", 
    "course_url": "https://www.udemy.com/solidworks-make-2d-sketches-and-turn-them-to-3d-models/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-16T06:01:26Z"
}