{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>LATEST</em>: New update on April 2016... </p>\n\n<p>This is a streamlined course to take from knowing nothing about SOLIDWORKS to give you all the knowledge and skills needed to become a certified SOLIDWORKS associate. This course should enable you to, with confidence, use SOLIDWORKS to design your next innovation. After this course, you can proudly list your SOLIDWORKS skills in your resume.</p>\n\n<p>THIS COURSE IS NOT A SHORTCUT TO GET THE CERTIFICATE. We are following a learn-by-doing approach for you to truly master all the skills needed for the certification test.</p>\n\n<p>==================</p>\n\n<p><strong>About this course:</strong></p>\n\n<p>With this course, you will get:</p>\n\n<ul><li>Full, free lifetime access to 72 lectures (increasing over time).</li><li>All future extra lectures and upgrades will always be free.</li><li>Unconditional Udemy 30 days <strong>money back guarantee </strong>- We are sure you would love the course though :)</li><li>Regular free bonuses additions to increase your knowledge. - lots of fun topics!</li></ul>\n\n<p>Today, you can start your journey to becoming a SOLIDWORKS professional with ZERO prior experience!</p>\n\n<p>I stress that you need no prior experience and there is nothing to buy or pay for!!! You will only need SOLIDWORKS itself.<br></p>\n\n<p><strong><br></strong></p>\n\n<p><strong>Why our course?!</strong><br></p>\n\n<ul><li>We are following the learning by doing approach which is proven the best for learning software like SOLIDWORKS.</li><li>We have <strong>enlarged the interface</strong> icons in our screencasts to make our videos more eye-friendly. We even enlarged the mouse cursor!!</li><li>We use annotations in all our lectures for easier follow-up.</li><li>We made our videos short and concentrated in one or few aspects to make them easier for reference. We also designed each lecture to be a stand-alone lecture.</li></ul>\n\n\n\n<p><br></p>\n\n<p><strong>You will learn:</strong></p>\n\n<ul><li>How to navigate through SOLIDWORKS interface.</li><li>How to sketch with different sketch commands.</li><li>How to define sketches using relations or distances.</li><li>How to use more than 10 different features to create 3D models. (extruded boss and cut, fillet, chamfers, revolved boss and cut, swept boss and cut, lofted boss and cut)</li><li>How to create additional reference planes.</li><li>How to modify given parts to match design needs.</li><li>How to explore different materials for your models.</li><li>How to find your model's mass, volume, and center of gravity.</li><li>How to assemble different parts into an assembly file.</li><li>How to generate drawings from parts and models.</li><li>How to interpret different drawing annotations.</li></ul>\n\n<p>Click the 'take this course' button, top right, now... Every hour you delay is costing you great creations and skills :)<br></p>\n\n<p>Tayseer Almattar</p>", 
    "end_date": null, 
    "title": "SOLIDWORKS Course: Become a Certified Associate Today!", 
    "price": "25.00", 
    "instructors": "Tayseer Almattar", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551930_3c01_2.jpg", 
    "course_url": "https://www.udemy.com/solidwokrs-go-from-nothing-to-certified-associate-level/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T17:25:04Z"
}