{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Learn to create amazing speed scultps in 30 minutes or less with ZBrush!</strong></p><p>Lunch crunches is a term used by the studios, it is basically a way to expand and speed up your skills by not being bound by references only your imagination. Using Zbrush we will create a speed sculpt in 30 Minutes or less.</p><p><strong class=\"redactor-inline-converted\">Why?</strong><br>Well there is a few reasons, one being it speeds up your Zbrush skills, two you are not restricted by references, three it helps train your imagination and sparks new ideas and concepts.</p><p><strong class=\"redactor-inline-converted\">Beneifts<br></strong>Take this course and benefit from  unleashing your imagination</p><p><strong>Course Structure</strong></p><ol><li>This course is laid out in three parts for newbies to ZBrush I have included a quick start guide to ZBrush</li><li>Part two we focus only on the tools we will use for creating speed sculpts this will give you a good foundation to create your own style, this part of the course we will create a sculpt from start to finish going slowely over each step.</li><li>FInal part of the course full steam ahead I will do a sculpt from start to finish in 23 minutes!</li></ol><p><em>I hope you enjoy this course and it helps you move forwards, I feel this course is a great motivator for bigger projects!. A lot of people get swamped by the complexities of projects this course how ever get you creating from the get go!!</em></p><p>All the best<br>The Monster-training team</p>", 
    "end_date": null, 
    "title": "Speed Lunch Crunches for Beginners to Pixelogics ZBrush", 
    "price": "20.00", 
    "instructors": "David Newton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841248_dd19.jpg", 
    "course_url": "https://www.udemy.com/speed-lunch-crunches-for-beginners-to-pixelogics-zbrush/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-06T12:49:02Z"
}