{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t              A to Z of Stop motion essentials. Includes every detail and training on a variety of stop motion animations apart from in depth knowledge about any equipment or software involved in its execution. With special stress on how to do it on a budget.  </p>  <p>  \t      STOP MOTION ANIMATION is either perceived to be too easy by some, until they try a hand at it, or too difficult, until they try a hand at it. The art of Stop Motion animation is neither too difficult nor too easy. It is just too interesting.  </p>  <p>  \t      In this course you shall be guided on every nuance you need to know to be able to execute almost every type of Stop Motion Animation.  </p>  <p>  \t      We shall cover every step in details, ranging from what and how a story for stop motion animation should be and how does it differ from other forms of story telling. We cover how to create an environment that finally leads to the execution of that story.  </p>  <p>  \t      We learn every essential technology involved in the production of a stop motion animation and even discuss a few trade secrets, tips and tricks.  </p>  <p>  \t      The language of the course is simple English, and we have not tried to come off as hard core geeks who use unfathomable words. And even if we do mention such words here and there, we always follow it with explanation and relevance.  </p>  <p>  \t      the HIGHLIGHT OF THIS COURSE is that you not only learn how to make a great stop motion animation but also become comfortable and then confidant in VIDEO EDITING ON ADOBE PREMIERE PRO CS6 and LEARN PHOTOGRAPHY ON DSLR WITH IN DEPTH UNDERSTANDING OF MANUAL SETTINGS. This course will make you a master in things that may open more creative doors for you in the field of media.  </p>  <p>  \t      You could complete the course in 1 day if you wanted, but we recommend you take it slow and take at least 7 days to complete this course.  </p>  <p>  \t      The structure of the course is like a seed that grows into a tree. Every following lecture will make more sense as you go along and seem effortlessly organic.  </p>  <p>  \t      Stop Motion animation, if used intelligently, if really charming and amazing. But the best part about this animation is, that you don&#039;t even need to be a professional animator to be able to execute this. It will just be a shame to not know this one.  </p>", 
    "end_date": null, 
    "title": "Stop Motion Essentials", 
    "price": "35.00", 
    "instructors": "Ms. Prerna Siddharth", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295687_3954_2.jpg", 
    "course_url": "https://www.udemy.com/stop-motion-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-07T08:06:48Z"
}