{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t            The world needs makers, builders and designers! Your ideas <strong><em>could really change the world</em></strong>. With some really cool ideas, a modification of some &#039;thing&#039; that exists, or even a new spin on an old object, the world of rapid prototyping has opened doors for the everyday thinker/tinkerer to bring his or her ideas to market. Let me show you how to take your ideas, model them, prototype them, and sell them online!  </p>  <p>  \t    In this course we will look at how to design and create real 3D printed objects and designs. The course material is based on the fastest developing trend in technology &quot;3D Printing&quot;. If you have a natural curiosity for tinkering, building, or engineering your own designs, this is a course in bringing those designs to life, and to market!  </p>  <p>  \t            The lectures in this course will provide you with the background knowledge you need to design in 3D covering skills like; modeling, meshing, extruding, rapid prototyping, 3D printing, and more. All of the materials in this course are based on developing real-world experience in designing printable products and selling them online.  </p>  <p>  \t<strong>*Even if you don&#039;t have access to your own personal 3D printer, I will show you several options to handle this <em>small </em>problem.* </strong>  </p>  <p>  \t<strong>You DO have options for getting your ideas printed for prototyping before they go to market! </strong>  </p>  <p>  \t            The course is comprehensive in nature and starts with an overview of what 3D printing technology is, some of the leaders in this space, and how the process works. As the course progresses, students will see how simple ideas can quickly come to a design, and how those designs can be printed within hours. Further, I will show you how to create an online store and sales system for marketing and selling your ideas. A start to finish process of idea -&gt; design -&gt; prototype -&gt; product for sale.  </p>  <p>  \t            The course can be taken in small bits, and could easily be completed in a few days. If you stop to work through the projects, it could easily take up to two weeks. Move as you see fit through the projects based on your comfort and experience level.  </p>  <p>  \t            The course is updated frequently as new projects, technologies and trends become available. Last updated October 14, 2014.  </p>", 
    "end_date": null, 
    "title": "Think it, make it, sell it! 3D Printing for Fun and Profit!", 
    "price": "25.00", 
    "instructors": "Jonathan Jarc, M.Ed", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302500_86e2_5.jpg", 
    "course_url": "https://www.udemy.com/think-it-make-it-sell-it/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:41:14Z"
}