{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t                 &lt;p&gt;  </p>  <p>  \tAprende los principios básicos de animación tradicional, y las herramientas que necesitarás para crear <span>animaciones de calidad profesional con el excelente software especializado para animación.</span>  </p>  <p>  \t<strong style=\"\">Desarrolla animaciones de calidad profesional en TVP animation 10 con este tutorial orientado <span>a principiantes</span></strong>  </p>  <ul style=\"\">  \t<li><span>Introducción al software TVP animation 10</span></li>  \t<li><span>los principios básicos de la animación tradicional</span></li>  \t<li><span>Elaboración de una animación básica (La pelota que rebota)</span></li>  \t<li><span>Acabado final del producto animado</span></li>  </ul>  <p>  \t<strong style=\"\"><span>Poderosas habilidades en tus manos de animador</span></strong>  </p>  <p>  \tAprenderás<span> principios básicos y fundamentales, desarrollados a través de la historia de la animación, </span><span>los cuales te permitirán crear excelentes animaciones de calidad profesional con cualquier software, </span><span>con cualquier estilo y técnica de animación.</span>  </p>  <p>  \tLa industria de la animación requiere de animadores que dominen el arte de animación, mas no, de estudiantes <span>que sepan usar softwares solamente. Los softwares solo son herramientas, pero el conocimiento de los fundamentos </span><span>los aprenderás con este curso.</span>  </p>  <p>  \tPodrás moverte libremente en cualquier campo laboral ligado a la animación, incluso puedes liderar un equipo <span>bajo tu mando ya que conocerás todo el proceso que implica realizar contenidos animados. </span>  </p>  <p>  \t<span><strong style=\"\">Contenidos e Información general</strong></span>  </p>  <p>  \tHe diseñado este curso con videos explicativos paso a paso y de facil entendimiento. Orientado a aquellos <span>que se inician en el mundo de la animación con mas de 58 minutos en video tutoriales, entre explicaciones teóricas </span><span>y el desarrollo de un ejercicio esencial en el tema de la animación.</span>  </p>  <p>  \tComenzarás viendo cómo utilizar el software TVP animation 10 para realizar las animaciones, y con explicaciones <span>de los principios de animación involucrados en el ejercicio establecido por este curso. para culminar dando un </span><span>acabado profesional gracias el delineado y pintado, así como la también la creación del fondo para la acción a animarse.</span>  </p>  <p>  \tAl completar este curso ud. será capaz de realizar animaciones de objetos sencillos con un acabado profesional <span>como vemos en algunos programas de TV de animación. También podrá aplicar lo aprendido con diferentes estilos y tecnicas </span><span>tales como: animación con after effects en motion graphics, stop motion, animación por recortes y animación 3d.</span>  </p>  <p>  \t    &lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "TVP animation 10", 
    "price": "20.00", 
    "instructors": "Daniel Peña Bieberach", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174590_b7c0_2.jpg", 
    "course_url": "https://www.udemy.com/animacion-tradicional/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-28T19:51:59Z"
}