{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t                                This course is for any artist who is looking to thrive by sharing their doodles, sketches, characters &amp; designs with one of the largest growing game development communities in the world. Get access to millions of paying developers and essentially your potential clients who need game assets from talented artists like yourself.  Help others create the projects of their dreams by providing them with your best dream creations. Your imagination is the limit.  </p>  <p style=\"\">  \t<strong style=\"\">What You Will Learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">How to take your doodles and sketches and turn them into Monthly Revenue</li>  \t<li style=\"\">How to look at your art and be able to break it down into simple 3D shapes</li>  \t<li style=\"\">Learn specific modeling techniques used for game development and design</li>  \t<li style=\"\">Learn Step by Step process on how to build 3D geometry from your sketches</li>  \t<li style=\"\">How to unwrap your 3D models and draw textures in Photoshop</li>  \t<li style=\"\">How to bring your characters to life in the leading animation package</li>  \t<li style=\"\">How to export your 3D animated model and set it up inside a game engine</li>  \t<li style=\"\">How to take your creations and submit them for sale using required tools</li>  </ul>  <p style=\"\">  \t                                I will show you a step by step process that I use to create and submit 3D assets to the Unity Asset Store. I spent the last 15 years learning all the necessary tools &amp; techniques and will now teach you how you can do the same with this easy to follow online course.  </p>  <p style=\"\">  \t              As you go through the course I suggest breaking it down into 3 days, 3 sections at a time. The entire course is 10 hours and 20 min. long, and segmenting 3 sections per day will require about 3:30 hours. You are of course welcome to also just squeeze the whole thing in one weekend which will quickly send you on your own way to selling your own assets. We all learn differently so find your own comfortable speed ... and Lets Begin!  </p>", 
    "end_date": null, 
    "title": "Unity 3D & Maya: Create & Submit Art to Unity Asset Store", 
    "price": "40.00", 
    "instructors": "Alan Balodi", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412622_6b91_4.jpg", 
    "course_url": "https://www.udemy.com/unity-3d-and-maya-create-and-submit-art-to-unity-asset-store/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T20:27:03Z"
}