{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn how to design beautiful video transitions and prepare a template file in After Effects. This course will teach you a complete workflow of preparing, arranging and creating animations as a template. <strong>Project Files</strong> of the actual transitions are included, ready for your usage!</p><p><strong>This course teaches you how to DESIGN TRANSITIONS and prepare an AFTER EFFECTS TEMPLATE for sale or reuse. </strong><br></p><p>After Effects allows you to create engaging animations and motion graphics. The program is very versatile and learning how to properly use it will allow you to enhance your video projects and take on freelance jobs for your clients. <strong>After Effects </strong>skills, video editing and animation is highly in demand, so as creating short transition interruptions during videos. </p><p><strong>Some of the things that will be covered during the course:</strong><br></p><ul><li>Create a After Effects template</li><li>Create several interesting video transitions</li><li>Learn how to use and edit transitions for your videos</li><li>Lean how designers make AE templates for sale</li><li>Keyboard shortcuts and often used After Effects tricks</li></ul><p>...and a lot more After Effects tricks while preparing this design. </p><p><strong></strong><strong>Why should you learn to make Transitions?</strong></p><ul><li>Every video designer / youtubber uses them</li><li>It's an trending market with high demand</li><li>They are quick to prepare, customizable</li><li>Quick &amp; fun workflow in After Effects</li><li>You can use them for private projects</li><li>You can earn money with them</li><li>They enhance any kind of video</li></ul><p>...these are only the few perks which transitions bring to your videos and projects.</p><p><strong>Sell your Template and learn After Effects along the way:</strong></p><p>Don't wait for anyone and start doing <strong>After Effects</strong> projects today! The techniques which I teach will allow you to use the program in a wide range of projects. The animations are trendy, good looking and in high demand for video creators, youtubers, designers, etc. Once you do your initial projects you will get a hang of it and make After Effects one of your primary design tools.</p><p>So what are you waiting for...<strong>Enroll Now!</strong><br></p>", 
    "end_date": null, 
    "title": "Video Transitions in After Effects. After Effects Template", 
    "price": "20.00", 
    "instructors": "Andrzej Pach", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702832_b993_3.jpg", 
    "course_url": "https://www.udemy.com/after-effects-video-transitions/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T11:26:59Z"
}