{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Learn Hardsurface modelling techniques suitable for Beginners to advanced users</strong><br><strong></strong></p><p>Welcome to this fully featured course in ZBrush with a focus on Hard Surface modelling using the new ZRemodeller tool within Zbrush!<strong></strong></p><p><strong></strong>During this course you will learn a pletherer of techniques, these will all drive towards creating Hard Surface objects we will create a robot from scratch (Although it could be anything) and along the way learn loads of cool things!</p><p><strong>Some of the things you will learn in ZBrush:</strong></p><ul><li>A full knowledge of the ZRemodeller tool, we use this exclusively to build the robot, I have tried to do the whole thing with this tool, so see how great it is and I am sure you will see the full potential.</li><li>Mesh extractions and cleanup using ZRemesher.</li><li>Quick look at transpose for moving and posing our creations.</li><li>We will look at the ZProject tool.</li><li>Learn to apply materials and colour to our sculpt.</li><li>Set up the lightbox for your own custom alphas and materials.</li><li>Set up and understand Doc size, Custom views via Zapp link and the render settings.</li></ul><p><strong>In Photoshop we will learn:</strong></p><ul><li>Learn to composite the exported images</li><li>Learn about masking and layer masking</li><li>Working in a non distructive manner</li><li>We will look at filters and adjustment layers</li><li>Applying textures and detailing using the layer options</li><li>Applying text and warping to fit</li><li>Plus much more...</li></ul><p><strong>Finally I hope you enjoy the course please let me know if you need any help on your journey through ZBrush and Photoshop...</strong></p><p><em>Happy modelling</em></p><p><em>All the best<br>David Newton</em></p>", 
    "end_date": null, 
    "title": "ZBrush and Photoshop Course on Hard Surface modelling", 
    "price": "40.00", 
    "instructors": "David Newton", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693004_4987.jpg", 
    "course_url": "https://www.udemy.com/zbrush-hard-surface-modelling-with-zremodeller-and-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T13:57:42Z"
}