{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>В этом курсе вы научитесь создавать 2D-анимацию с использованием программы Synfig Studio.</p><p>Synfig Studio это свободная программа для Windows, Linux and Mac OSX. На сегодняшний день Synfig Studio является одним из самых мощных бесплатных инструментов для создания анимации. Вы хотите сделать свой собственный мультфильм? Или просто анимированную открытку? Или сделать анимацию к игре? Synfig Studio поможет вам в этом!</p><p> <strong style=\"\">Научитесь создавать свою собственную анимацию</strong></p><ul style=\"\"><li>Изучите все основные принципы работы с программой Synfig Studio</li><li>Научитесь собирать и анимировать героев мультфильма</li></ul><p><strong style=\"\"></strong></p><p><strong style=\"\">Простая и эффективная техника анимации</strong></p><p>В этом курсе мы будем мы будем рассматривать технику анимации с использованием растровых изображений. Такой метод анимации называется «перекладка» или «спрайтовый». Эта техника известна как наиболее быстрый и эффективный способ производства анимации. Одновременно с этим анимация перекладкой остаётся мощным выразительным средством и используется многими мультипликаторами для создания прекрасных творений. </p><p>Курс предназначен для тех, кто хочет изучить программу Synfig Studio за короткое время. Он одинаково подходит как тем, кто только начинает знакомство с анимацией, так и уже сформировавшимся специалистам, которые желают овладеть свободным программным обеспечением для создания анимации в технике &quot;перекладка&quot;.</p><p><strong style=\"\">Содержание курса</strong></p><p>Курс состоит из 9 лекций, которые позволят вам изучить процесс начиная с самых азов интерфейса программы и заканчивая техникой анимации персонажей при помощи скелетов.</p><p>В состав курса включены все файлы примеров, использующиеся при объяснении материала, что позволяет самостоятельно повторить все демонстрируемые упражнения. Также, у вас есть возможность скачать лекции себе на компьютер для просмотра &quot;оффлайн&quot;. </p>", 
    "end_date": null, 
    "title": "Создание анимации в Synfig Studio", 
    "price": "20.00", 
    "instructors": "Konstantin Dmitriev, Nikolai Mamashev", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121616_72ea_9.jpg", 
    "course_url": "https://www.udemy.com/synfig-studio-cutout-animation-ru/", 
    "currency": "USD", 
    "subject_name": [
        "3D & Animation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-18T12:33:06Z"
}