{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is a course created by +Acumen, an organization committed to creating social change.  We think individual leadership is a key component to making a difference and are thrilled to present Seth Godin’s exclusive Leadership Workshop.  This is the first in a series of +Acumen master classes built with incredible instructors and experts.  Stay tuned. </p>  <p><strong>Leadership is a choice.</strong>  It happens when someone steps up and causes a change to happen.  It happens when someone enrolls other people to help them make that change.</p>  <p>In this interactive online workshop, Seth Godin will walk you through the steps to make the choice to lead. </p><ul><li>You’ll explore what the leadership choice is capable of accomplishing, what it means, and how to get there. </li><li> You’ll learn to distinguish between leaders and managers, paint a picture of where you want your leadership journey to go, and motivate people to join you in your cause. </li><li> Perhaps most importantly, you’ll learn that you can lead even when you don’t have formal authority.</li></ul>   <p><br></p><p>The course is built around <strong>9 surprising leadership principles that challenge conventional wisdom</strong>. Through a series of videos and interactive exercises, Seth will introduce you to ideas that will help you lead people to dance on the edge of possibility. You’ll learn why authority is different than responsibility, why future change makers need to master leadership rather than management, and why new types of work demand new types of leadership. </p><p><strong>This course is an active journey of self-reflection.</strong>  You should be prepared to roll up your sleeves and reflect on your priorities and the type of change you want to make, regardless of where you sit in an organization.  You’ll leave the experience with a Leadership Notebook documenting your ideas for getting started.<br></p>", 
    "end_date": null, 
    "title": "+Acumen Presents: Seth Godin's Leadership Workshop", 
    "price": "40.00", 
    "instructors": "+Acumen Courses, Seth Godin", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/751602_52ec.jpg", 
    "course_url": "https://www.udemy.com/seth-godins-leadership-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T19:42:04Z"
}