{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  It is no longer enough to just have technical skills when most tasks are now structured around teams.  </p>  <p>  \t  It is no longer enough to work long hours and hope for your boss to notice your contributions.  </p>  <div>  \t  Whether you’re a working professional who strives to obtain a job promotion or a student participating in group projects, you will find that leadership skills play a huge role in your success. This X-factor determines the difference between you and any other soul willing to slave more hours than you.  </div>  <div>  \t<br>  \t<div>  \t\tLeadership has become an essential skill that is greatly valued in every single industry.  \t</div>  \t<div>  \t\t<br>  \t\t<p>  \t\t\tMost believe that you need to have the spirit of a leader within you, from the minute you&#039;re born. Sure, some are born with that incredible confidence to lead, but does that mean confidence and beliefs cannot be changed or obtained?  \t\t</p>  \t\t<div>  \t\t\t  There is a leader within you, your neighbour, your gardener and your mother!  \t\t</div>  \t\t<div>  \t\t\t<br>  \t\t\t<p>  \t\t\t\tIt&#039;s in everyone. But how many choose to hone it?  \t\t\t</p>  \t\t\t<p>  \t\t\t\t  You can make a difference to the people in your life. But first, you need to choose to take a step forward, to understand that leadership is a skill that can be acquired and improved upon.  \t\t\t</p>  \t\t\t<div>  \t\t\t\t  Steve Jobs, Mother Teresa, Martin Luther King and Mahatma Gandhi are examples of extraordinary leaders who have touched the lives of many.  \t\t\t\t<p>  \t\t\t\t\t  All of them came from humble backgrounds, but they constantly sought to improve themselves and overcome obstacles.  \t\t\t\t</p>  \t\t\t\t<div>  \t\t\t\t\t  Roshan Thiran is the Founder and CEO of Leaderonomics, a social enterprise dedicated to providing access to leadership development to everyone of all ages.  \t\t\t\t</div>  \t\t\t\t<div>  \t\t\t\t\t<br>  \t\t\t\t\t<p>  \t\t\t\t\t\tHe has won multiple awards in business and leadership development and hopes to reach out to others who want to become an effective leader.  \t\t\t\t\t</p>  \t\t\t\t\t<p>  \t\t\t\t\t\t  The short clips in this course will bring you through typical work scenarios where you can understand and learn to apply leadership techniques. With Roshan’s guidance, you will realize that leadership can be practiced very frequently in your life.  \t\t\t\t\t</p>  \t\t\t\t\t<p>  \t\t\t\t\t\t  Through this 22 video course, you will receive precious nuggets of advice on how to become a leader in your own right. Armed with these practical skills, you can now thrive in your organisation and make a positive difference!  \t\t\t\t\t</p>  \t\t\t\t\t<p>  \t\t\t\t\t\t  You can be a leader, and the time to take action is NOW!  \t\t\t\t\t</p>  \t\t\t\t</div>  \t\t\t</div>  \t\t</div>  \t</div>  </div>", 
    "end_date": null, 
    "title": "22 Practical Lessons in Leadership", 
    "price": "45.00", 
    "instructors": "Street Smart University", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288066_cc0d_5.jpg", 
    "course_url": "https://www.udemy.com/22-practical-lessons-in-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T09:59:33Z"
}