{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    Welcome to the 30 Day Journey to Spiritual Health. I pray that you will  </p>  <p style=\"\">  \t    experience massive spiritual breakthroughs. Each step of progress will be  </p>  <p style=\"\">  \t    based on God’s amazing grace and your hard work. Yes, hard work is always  </p>  <p style=\"\">  \t    part of any real change in our lives. We are not victims of a breakthrough, we  </p>  <p style=\"\">  \t    are participants.  </p>  <p style=\"\">  \t    In the book entitled Crossing Your Next Threshold, the concept of blood on  </p>  <p style=\"\">  \t    the threshold is a compelling illustration. This concept refers to the need for  </p>  <p style=\"\">  \t    substantial sacrifice for any real progress. God’s plan for our lives is amazing  </p>  <p style=\"\">  \t    but it must be seized by faith and courageous follow-through. Hebrews chapter  </p>  <p style=\"\">  \t    11 speaks so clearly about the heroes of the faith who accomplished great  </p>  <p style=\"\">  \t    exploits by faith. I believe that you will begin this faith journey as well. Only  </p>  <p style=\"\">  \t    God knows the ultimate plans for your life. He knows your destiny and divine  </p>  <p style=\"\">  \t    potential.  </p>  <p style=\"\">  \t    I’m sure that you are wondering if this journey will make a difference in your life  </p>  <p style=\"\">  \t    or anyone else’s. The answer is absolutely, yes. Progress will really depend  </p>  <p style=\"\">  \t    on a very willing God who loves you and your commitment. The more time you  </p>  <p style=\"\">  \t    invest in your journey the more you will get out of it. Don’t forget that Jesus is the  </p>  <p style=\"\">  \t    author and perfecter of your faith. (Hebrews 12:2) “Let us fix our eyes on Jesus,  </p>  <p style=\"\">  \t    the author and perfecter of our faith, who for the joy set before him endured the  </p>  <p style=\"\">  \t    cross, scorning its shame, and sat down at the right hand of the throne of God.”  </p>  <p style=\"\">  \t    If you need more than thirty days to complete this journey, don’t worry about it.  </p>  <p style=\"\">  \t    This is not a horse race. Take as much time as you need. Each day is built on  </p>  <p style=\"\">  \t    important precepts and truths that need to be digested through prayer, thought,  </p>  <p style=\"\">  \t    and discussion with friends or family. If you can take someone on this journey  </p>  <p style=\"\">  \t    with you, the ride could be much more rewarding. Consider  </p>  <p style=\"\">  \t    us your coaches for a spiritual makeover. We are committed in prayer to your  </p>  <p style=\"\">  \t    breakthrough. Are you ready? Lets jump in to the 30 Day Journey.  </p>", 
    "end_date": null, 
    "title": "30 Day Journey to Spiritual Health", 
    "price": "50.00", 
    "instructors": "Paul Goulet", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118932_a363_2.jpg", 
    "course_url": "https://www.udemy.com/30-day-journey-to-spiritual-health/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-12T21:59:31Z"
}