{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                    Welcome to Leap Training  Improve your Leadership Skills and achieve your Goals<strong style=\"\"></strong></p>  <p>  \t<strong style=\"\">Join our 800 plus students in improving their Leadership skills</strong>!  </p><p>Lets start achieving your full Leadership potential!</p>  <p>Limited offer price! Price is now at $125.00, will be increased on 1st September 2015.</p>  <p>  \t    Join our 800 plus students in Jump-starting their career and increasing their earnings to their full potential. Achieve all of your Leadership Goals and start shaping your future.</p>  <p>  \t      So If you feel you are are stuck in the wrong job, or are you dreading Monday mornings, struggling to manage your team or want to apply for those higher paid management roles then this is the course for you.  </p><p>If you want to lead with your true leadership potential and start grabbing those promotions, or want to lead your own show, this course shows you how. <strong style=\"\">Start achieving those leadership goals now.</strong></p>  <p>  \t                    Leadership skills are in short supply within our local communities, workplaces and nations. If you wish to have your voice heard and want to start leading others then this course provides you with an opportunity to consider new ways of using a leadership style in communicating.  </p><p>We include career planning, top tips for Leaders, workshops for Appreciative Enquiries, powerful communication techniques and lots more including: a typical leadership scenario that demonstrates the difficulties of leading team members and managing challenging conversations. We meet <strong style=\"\">Sam</strong> who is facing some challenges within his team meetings.</p><p>Watch how Sam uses his leadership skills to deal with a very reluctant team.</p>  <p>  \t                    Containing Leap Training films that are developed to inspire and provoke new thought, we work together throughout the course looking at  Sam&#039;s choices in leading his team.  </p>  <p>  \t                    In addition to the films  we have professional Powerpoint presentations, quizzes, lectures and briefings  that test your knowledge and support you in developing your skills.  </p><p>We include top 5 Leadership tips. Lateral and Creative thinking and a complete career building workbook for you to download.</p><p>Look out for our brand new riddle section.</p><p><em style=\"\">I dig small holes and build bridges of gold, yet some of you fear me?</em></p><p><em style=\"\">Answer in the lateral thinking section!</em></p>  <p>  \t                    This course will take just over 1 and a half hour to complete.  </p>  <p>  \t                    Throughout the course we will be considering different leadership styles and choices in communication methods, including being able to get to the root of the problem by asking precise questions.  </p>  <p>  \t                     Most of the content is visual and audio so if written  English is an issue you will enjoy the interactivity of the films.  </p>  <p>  \t                    We are aiming to provoke new thought and inspire you to look in new directions for your next leadership challenge. We include a n exciting  new E career workbook for you to develop your new career, or apply for that promotion.  </p>  <p>  \t                    The ethos of the course is to support you to develop your own authentic style of leadership.  </p>  <p>  \t            AS A BONUS WE ARE INCLUDING AN ADDITIONAL LECTURE ON HOW TO PLAN AND DELIVER POWERFUL PRESENTATIONS.  </p>  <p>  \tPacked full of quality content you will be challenged and inspired to look at new Leadership communication styles. We include tips and hints on managing challenging conversations and an additional workshop on Appreciative Inquiry is included so if you wish to provide workshops to improve quality, its all here ready to go!  </p>  <p>  \t                    Look out for our other UDEMY Courses as we are creating new ones on a monthly basis.  </p>  <p>  \t    SO if you are undervalued in your current role and want to start working and earning to your full potential start our course today and the limited offer price and Jumpstart your career TODAY.  </p>  <p>  \t    We have over 20 Years experience in delivering inspiring training and engaging professionally shot films, this course engages students in real life scenarios, we meet Sams team as they struggle to improve their performance.  </p>  <p>  \t    We look forward to working with you.  </p>", 
    "end_date": null, 
    "title": "Achieve all of your leadership Goals", 
    "price": "40.00", 
    "instructors": "Leap  Training Institute, Lucian Evans", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356152_d2e7_5.jpg", 
    "course_url": "https://www.udemy.com/jumpstart-your-career-udemy-course-leadership-management/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T14:08:28Z"
}