{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t         Si quieres <strong style=\"\">Gestión de Equipos</strong>, <strong style=\"\">Superar Retos</strong> con mayor eficacia, Aprender el <strong style=\"\">Método Coach </strong>de como Plantear <strong style=\"\">Metas</strong> de manera Irresistible, <strong style=\"\">Disponer de más tiempo</strong>, <strong style=\"\">Eliminar Miedos</strong> <strong style=\"\">y Barreras </strong>que te impiden desarrollar tu potencial... ¡<strong style=\"\">Este Es Tu Curso</strong>!.  </p>  <p>  \t         Incluye Videos, Material PDF descargable, Herramientas Potenciadoras, Preguntas de Reflexión, Historias de Éxito Inpiradoras.  </p>  <p>  \t      Aquí te <strong style=\"\">revelaré</strong> el <strong style=\"\">Secreto del Exito</strong> que ya mucha gente me ha aprendido en mis formaciones a miles de personas.  </p>  <p>  \t      Este <strong style=\"\">Primer Curso de Coaching en Habilidades Directivas y Liderazgo</strong> consta de 4 temas, más de 10 horas entre videos y Trabajos personales del alumno.  </p>  <p>  \t         Es la primera toma de contacto que Todo <strong style=\"\">Emprendedor, Trabajador por cuenta Ajena o Networker </strong>debe de conocer.  </p>  <p>  \t             El Curso Gratis de Coaching aporta <strong style=\"\">Videos Formativos</strong> así como <strong style=\"\">Herramientas</strong> que el alumno utilizará para sus posteriores aplicaciones una vez acabada la formación.  </p>  <p>  \t             Potenciamos el aprendizaje con <strong style=\"\">Casos de Éxito</strong> así como <strong style=\"\">Enlace a Videos de Coaching y Crecimiento Personal</strong> relacionados con la formación trabajada.  </p>  <p>  \t             Este curso es un Primer Paso en Coaching con 3 horas  formativas entre Videos, Desarrollo, Herramientas e Implementación de la  formación.  </p>  <p>  \t   Con este curso podrá alcanzar mejoras tales como:  </p>  <ul style=\"\">  \t<li>Aprender a trabajar sus <strong style=\"\">Objetivos</strong></li>  \t<li>Mejorar la <strong style=\"\">Atmósfera</strong> de trabajo en su empresa</li>  \t<li>Gestionar mejor su <strong style=\"\">Tiempo</strong></li>  \t<li><strong style=\"\">Disfrutar</strong> en su puesto de trabajo</li>  \t<li>Aprender los inicios de la metodología <strong style=\"\">Coaching</strong></li>  \t<li>Potenciar sus <strong style=\"\">Talentos</strong></li>  \t<li>Encontrar el significado a su día a día</li>  \t<li>Descubrir <strong style=\"\">Líderes</strong> en su entorno</li>  \t<li>Obtener <strong style=\"\">Beneficios Inmediatos</strong></li>  \t<li>Generar <strong style=\"\">Actitud</strong> motivadora e inspiradora</li>  \t<li>Aprovechar las <strong style=\"\">Oportunidades</strong></li>  \t<li>Potenciar el <strong style=\"\">Lider</strong> que lleva dentro</li>  \t<li>Aprender nuevas <strong style=\"\">Tecnicas Coach</strong></li>  \t<li><strong style=\"\">Motivar</strong> a su entorno</li>  \t<li>Alcanzar sus <strong style=\"\">Metas</strong> de manera consistente</li>  </ul>  <p>  \t   Para influir en nuestra Empresa. en nuestro Entorno, en nuestras Vidas necesitamos <strong style=\"\">Trabajar en Nosotros Mismos</strong>... ¿de qué manera? ...  </p>  <p>  \t <strong style=\"\">Es muy Sencillo</strong>: Usted necesita Aprender a conocerse  mejor, Descubrir sus Talentos, Cambiar sus Creencias Limitantes, Superar  los Miedos, Reconozcer el Trabajo  de los demás, Amplíe su Red de  Contactos, sea un Imán de Atracción para sus Clientes.  </p>  <p>  \t Es frecuente ver gente que emplea tiempo y dinero  en Mejorar   Habilidades para jugar mejor al tenis, saber dos idiomas o  manejar con   soltura un PC pero sin embargo sus vidas Personales y Laborales están   destrozadas y  su Estima por los suelos. Entonces, ¿de que vale saber   hablar chino,  si le da vergüenza hablar con gente extraña?.  </p>  <p>  \t ¿Cuántas veces ha invertido en mejorar su COMUNICACIÓN, gestionar su   agenda de manera eficaz, ampliar RELACIONES, cambiar su ACTITUD en   momentos difíciles…?.  </p>  <p>  \t   Cuando conoce sus <strong style=\"\">CAPACIDADES</strong>, sus <strong style=\"\">PUNTOS FUERTES</strong>, sus <strong style=\"\">VALORES</strong>, al fin y  al cabo cuando conoce su <strong style=\"\">POTENCIAL</strong> y lo aprovecha, llegan los <strong style=\"\"> RESULTADOS</strong> <strong style=\"\">DESEADOS</strong>. ¿Sabe por qué? Por que cuando está satisfecho por  dentro, eso es un reflejo a su entorno.  </p>  <h5><em style=\"\">                Las decisiones que tome hoy, serán los resultados del mañana (Jim Rohn)</em></h5>  <p>  \t   ¡El Poder de la Atracción está muy bien, pero <strong style=\"\">NECESITA</strong> <strong style=\"\">ACCIÓN</strong>, para que lleguen los resultados!.  </p>  <p>  \t   Desde hace años soy una <strong style=\"\">AYUDA</strong> para que miles de personas puedan <strong style=\"\">ALCANZAR</strong> sus <strong style=\"\">SUEÑOS</strong> y por azar o por destino usted está hoy aquí.  </p>  <p>  \t ¡De el Paso Ya y Entre en Accion, Cambie Su Futuro, Su Destino!.  </p>  <p>  \t <strong style=\"\">Miles</strong> de Personas ya han pasado por este curso en diferentes paises tales como España, Uruguay, Chile, Mejico, Colombia, Suiza. ¿A qué Esperas para Tomar Acción?.  </p>  <p>  \t         Aprovecha la oportunidad de Crecer con el Mejor Coach del Momento. Conoce al Coach Francisco Lopez<a href=\"http://youtu.be/XiWHzgBUOgU\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"><br style=\"\">  \t </a>  </p>", 
    "end_date": null, 
    "title": "Aprende Coaching Habilidades Directivas y Liderazgo Modulo 1", 
    "price": "50.00", 
    "instructors": "Francisco Lopez", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208564_f47c_6.jpg", 
    "course_url": "https://www.udemy.com/aprende-coaching-habilidades-directivas-y-liderazgo-modulo-1/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-01T07:51:35Z"
}