{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>¿Sabías que el <strong>éxito</strong> de tu vida, tus <strong>relaciones</strong> y tu <strong>abundancia</strong> financiera depende un 80% de tus pensamientos y creencias y un 20% de tus acciones?<br></p><p>Autoliderazgo es camino para que aprendas a construir la vida que deseas. Todo inicia en la calidad de tus creencias, pensamientos y conocimiento que son los que te llevan a tomar acciones y éstas a los resultados que obtienes. Hoy eres resultado del proceso anterior. Este curso te ayuda a reflexionar en ello, crear un práctico plan de acción y avanzar hacia una mejor calidad de vida tanto personas, como social y laboral. Aprender a ir por resultados más que sólo fantasear con una vida mejor. </p><p>He logrado la vida que deseo y hoy te comparto este curso porque deseo que más y más personas realicen sus sueños y sus metas. El poder es tuyo y tú decides, yo te muestro un camino probado en cientos de personas, y deseo que seas un nuevo testimonio de éxito. Tan seguro estoy de lo que digo que si no te es útil tienes una garantía de devolución de 30 días. Si lo aplicas, ¡mejoras! <br>Soy Guido Rosas y he dictado más de 1000 conferencias de Autoliderazgo en diversos países de habla hispana y Estados Unidos; hoy te comparto la experiencia probada para que tú logres obtener una vida mucho mejor a la actual en las áreas que tú elijas.<br></p><p>Salvador Torres, uno de los estudiantes, opina: <em>No hay duda que me queda un sabor de boca placentero, pues este curso es\n magnífico, no solo en contenido, sino en la calidad humana que percibo \nen el Instructor, Lic. Guido Rosas,  mis humildes felicitaciones para \nUsted, por este material tan valioso que nos pone al alcance de todo \naquel que desea superarse. Gracias por compartir</em><em></em></p><p><strong><em>Actualizado en Enero 2016</em></strong></p><p>  \t<strong>Autoliderazgo</strong> es un curso teórico práctico que te lleva a un práctico plan de acción hacia una mejora de tus <strong>resultados</strong>.  </p>  <p>  \t<strong>¡Toma las riendas de tu vida y construye la vida que deseas para ti!</strong>  </p>  <p>  \t    Si te hicieron creer que lo mejor no era para ti, que tenías que vivir la vida que te tocó vivir y que tienes que resignarte a vivir la vida que puedas tener sin que te guste, empieza a cuestionar tus creencias obsoletas. <strong>Es momento de generar un cambio a favor y asumir tu Autoliderazgo.</strong></p>  <p>  \tEmpodérate hacia una vida mejor desarrollando tu <strong>Autoliderazgo</strong>. No pienses en que mejorarás... aprende y mejora.</p>  <p>  \t    En este curso:  </p>  <ul>  \t<li>Comprenderás la importancia de la calidad de tus pensamientos y el impacto en los resultados de tu vida.</li>  \t<li>Aprenderás a escuchar tus creencias limitantes y cómo convertirlas en <strong>creencias constructivas</strong>.</li>  \t<li>Comprenderás la importancia de tus acciones y cómo tomar un mejor camino para reaccionar menos y accionar más a favor de las cosas que deseas lograr.</li>  \t<li>Aprenderás a construir <strong>metas posibles y alcanzables </strong>dentro de tus capacidades y creencias. </li>  \t<li>Te conocerás más a ti mismo.</li>  \t<li>Podrás diseñar un plan de acción para alcanzar mucho mejores resultados en tus proyectos y desarrollo de nuevas metas. </li>  \t<li>En pocas palabras: <strong><em>Tendrás las herramientas para construirte una vida mucho mejor de la que vives el día de hoy.</em></strong></li>  </ul>  <p>  \t    El curso <strong>Autoliderazgo</strong> te lleva paso a paso hacia un práctico plan de acción para lograr mejoras en tu vida tanto a nivel personal, como familiar y con mejores resultados de negocios.  </p>  <p>  \t    Asume tu <strong>liderazgo personal</strong> y <strong>toma las riendas de tu vida</strong> hacia la <strong>vida</strong> que tú desees.  </p>  <p>Con el curso te regalo el libro electrónico de <strong>Autoliderazgo</strong> del cual se han vendido más de 10,000 ejemplares impresos en el mundo de habla hispana.  </p>  <p>  \t<strong>Autoliderazgo</strong>, un curso con herramientas prácticas que ha sido dictado para miles de personas en diversos países del Continente Americano, ahora está a tu alcance en cualquier país del mundo. Lo más importante es que en tu poder está la decisión de seguir pensando que mejorarás o tomar acción para mejorar tu vida y tus resultados.</p>", 
    "end_date": null, 
    "title": "Autoliderazgo - Construye la vida que TÚ deseas. ", 
    "price": "40.00", 
    "instructors": "Guido Rosas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325086_4eb6_4.jpg", 
    "course_url": "https://www.udemy.com/autoliderazgo1/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T19:03:52Z"
}