{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>As a leader today, your success or failure will be measured by the performance of your team. More than ever before, business is looking for leaders who have the skills and abilities to guide and nurture their people to perform above and beyond expectations and, most importantly, to deliver results. Learn the skills required to build the foundations for becoming a transformational leader.<br></p><p><strong>Master the basic skills required to lead and motivate your team to perform over and above expectations.</strong></p><ul><li>Learn what leadership is.</li><li>Understand the different leadership styles.</li><li>Develop your emotional intelligence &amp; learn why this is the number 1 tool in the modern leaders toolkit.</li><li>Discover the most common mistakes made by leaders and learn how to avoid them.</li><li>Find out how to motivate your team to support your goals.</li></ul><p><strong>Stand out from the crowd and become the leader both your management and team want to work with.</strong></p><p>Learning the skills to become a transformational leader who can successfully lead and support his or her people, will allow you to develop your leadership expertise and expand your career opportunities. This course will provide you with the foundation to grow and further develop your own personal leadership style.</p><p>Good leaders who are able to support and motivate their teams to perform and deliver results are in great demand in today's competitive business world. The intrinsic qualities of a transformational leader are needed in today's fast-paced, and often uncertain, world of business to support the organisation in the pursuit of their vision by engaging with and getting the best from their people.   </p><p><strong>Content and overview</strong></p><p>Suitable for managers and production personnel who are transitioning to a leadership role, or anybody with an interest in leading a team, this course with 22 lectures and two hours of content will give you the knowledge and skills to become a transformational leader. </p><p>Starting with a discussion on what leadership really is, we move into an examination of the elements of leadership and how they influence each other so you have the background knowledge to support the rest of the course.</p><p>A look at the different leadership styles and a tool to help you to make choices on the appropriate leadership style for particular situations will lead into a lecture on transformational leadership and its importance in business today. A whole section is devoted to emotional intelligence as this is the key to becoming a successful leader in the business world today.</p><p>We will take a look at what it is like to be a leader and some of the common mistakes leaders make so you will be able to avoid them. The course is wrapped up with a section on what to do to support and motivate your people and get them to dip into their discretionary effort, as this is the goal of all good leaders.</p><p>When you complete the course you will have the knowledge and the tools to start to apply the skills practically in your leadership role. </p><p>I look forward to working with you as we develop and enhance your leadership skills.</p>", 
    "end_date": null, 
    "title": "Be a leader", 
    "price": "25.00", 
    "instructors": "James Johnstone", 
    "commitment": null, 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581004_646d.jpg", 
    "course_url": "https://www.udemy.com/leadership-how-to-be-an-effective-leader/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T10:59:33Z"
}