{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">At Coach Approach Ministries, we believe that coaching can have a great impact on ministry. It is our mission to teach coaching to leaders throughout the body of Christ to strengthen their ability to help people move forward. </p><p style=\"\"><em style=\"\">“Coaching doesn&#039;t replace anything we do in ministry. It augments everything we do in ministry.&quot; – Arden Adamson, retired director of Coaching for the Assembly of God</em></p><p style=\"\">In this course, we will lay a solid foundation for you as a Christian Coach. The course is divided into three sections:</p> <ul style=\"\"><li style=\"\">An introduction to the concept of coaching</li><li style=\"\">An introduction to the skills of coaching</li><li style=\"\">And a primer on how to get started as a coach</li></ul> <p style=\"\">For over a decade, we have trained pastors, small group leaders, teachers, denominational leaders, youth pastors, and more how to coach. Our materials were designed by pioneers in the field, who continue to have a high impact on leaders in both the secular business market and Christian ministry.</p><p style=\"\">We have built in a great way to interact with other students in the course, and by the end, you will have developed some good resources that will help you as you begin to coach.</p><p style=\"\">The course is built around 2 hours of professionally captured video teaching with a pair of great teachers who bring a relational dynamic to the class. You will not listen to a monotonous talking head but will instead feel engaged in a classroom setting.</p><p style=\"\">You could finish this class in a few hours, but we encourage you to engage deeper. Spend some time interacting in our discussion questions. Turn off the video and try coaching someone with the skills you have learned so far.</p><p style=\"\">We hope you will join us as a Christian Coach because we believe that this is a powerful tool that will move the Kingdom of God forward!</p>", 
    "end_date": null, 
    "title": "CAM 101 Introduction to Christian Coaching", 
    "price": "50.00", 
    "instructors": "Brian Miller, Chad Hall, Bill Copper", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552666_4974_7.jpg", 
    "course_url": "https://www.udemy.com/cam-101-introduction-to-christian-coaching/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T18:42:42Z"
}