{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong>Como Inspirar a tu Audiencia es un curso para aprender a hablar, motivar y convencer a tu público, ya sea para presentar, vender tus ideas o dirigir y gestionar a tu equipo. En este curso conocerás las claves para conseguir los mejores resultados, a través de la técnica, de tus presentaciones en público. Esta serie de vídeo píldoras te ayudarán de forma práctica y fácil a aplicar las técnicas necesarias para influir en tu audiencia de forma positiva, inspiradora y motivadora.</p><p>En este fantástico curso aprenderás a:</p><p><span></span></p><ol><li>Dejar huella cuando hablas en público y superar esos nervios para poder disfrutar de tu presentación</li><li>Preparar rápida y eficazmente tus presentaciones</li><li>Hacer que tus mensajes perduren</li><li>Influir siendo tú</li><li>Inspirar a los demás con técnicas eficaces y probadas de persuasión</li><li>Construir una oratoria que persuada y movilice, con las técnicas de <em>storytelling</em> y otras que te enseñarán a estructurar discursos y presentaciones emocionalmente impactantes.</li><li>Tus soportes visuales serán memorables e impactantes.</li></ol><p>En esto curso tratarás <strong>qué significa</strong> inspirar e influir a alguien – cómo hacer que tu comunicación sea clara, creíble y relevante para tu audiencia. Llevarás un método eficiente de preparación que te ayudará a ahorrar tiempo y diseñar presentaciones en que a tu audiencia le apetezca participar.</p>", 
    "end_date": null, 
    "title": "Como Inspirar a tu Audiencia", 
    "price": "20.00", 
    "instructors": "ARENET SOCIEDAD LIMITADA", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389320_1662_2.jpg", 
    "course_url": "https://www.udemy.com/como-inspirar-a-tu-audiencia/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T09:12:56Z"
}