{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>A Conferência Fábrica, realizada pela Terceira Igreja Batista de Brasília, tem por objetivo desenvolver e ampliar a visão de líderes e formadores de opinião cristãos no sentido de construir uma igreja relevante e contextualizada. Os temas escolhidos e os palestrantes convidados concentram-se em estimular um processo de crescimento que envolva três ações diante do desafio proposto: descobrir, capacitar e produzir. </p><p>A edição de 2015 da Conferência Fábrica contou com os seguintes preletores:</p><p><strong style=\"\">Bill Hybels:</strong></p><p>Fundador e pastor senior da Willow Creek Community Church, em South Barrington, Illinois, uma das igrejas com maior alcance dos Estados Unidos. Essa igreja tem sido listada como a mais influente da América nos últimos anos. Além disso, Hybels é o fundador da Willow Creek Association e criador do The Global Leadership Summit, conferência anual sobre liderança que acontece em Chicago e em várias partes do mundo. Hybels também é escritor e tem vários livros publicados, principalmente na área de liderança cristã.</p><p></p><p><strong style=\"\">Troy Gramling:</strong></p><p>Pastor principal da Potential Church, em Fort Lauderdale, Florida. O Pastor Troy tem liderado esse igreja a um rápido e impressionante crescimento, servindo hoje a uma média de 14.000 pessoas por fim de semana nos oito campi da igreja. O Pastor Troy é referência em desenvolvimento de liderança e é conhecido pela criatividade que usa nas suas palestras.</p><p></p><p><strong style=\"\">Chris Mendez:</strong></p><p>Chris Mendez é pastor da Hillsong Church e, nos últimos anos, foi o responsável pela gerência das extensões de sua igreja na cidade de Sidney, Australia. Hoje, ele é o responsável pela implementação da Hillsong Church na América Latina, que será feita inicialmente em Buenos Aires, Argentina e, depois, em São Paulo, Brasil.</p><p></p><p><strong style=\"\">Elias Dantas:</strong></p><p>Pastor, diretor executivo de relacionamentos internacionais e professor de Estudos Pastorais no Alliance Theological Seminary, Nyack, em Nova Iorque. Presidente do Center For Studies in Global Christianity (Centro para Estudos em Cristianismo Global), uma organização sem fins lucrativos que estuda o desenvolvimento do Cristianismo no mundo e as iniciativas cristãs em 32 países. Além de tudo isso, Elias Dantas é também o fundador do Global Kindom Partnership Network, uma rede de relacionamentos que envolve pastores das maiores igrejas do mundo com o propósito de cooperação mútua em favor da expansão do evangelho. Apesar de ser brasileiro, Elias tem uma parte do coração americana, já que, desde 1987, os EUA fazem parte de sua história, no estudo e depois no trabalho, onde atua até hoje com o coração pelo mundo todo.</p>", 
    "end_date": null, 
    "title": "Conferência Fábrica 2015", 
    "price": "30.00", 
    "instructors": "Terceira Igreja Batista de Brasília", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539478_df66.jpg", 
    "course_url": "https://www.udemy.com/conferencia-fabrica-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T19:52:37Z"
}