{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Course Description</strong></p>\n\n<p>Covering powerful Neuro-Linguistic Programming techniques, this online workshop will enable you to have the inner resources and communication skills to manage conflict and feel calm and empowered in a difficult situation. </p>\n\n<p><strong class=\"redactor-inline-converted\">Knowing The Why As Well As The How</strong></p>\n\n<p>When you are in a situation where there is a difference of opinion you will filter the information coming at you and interpret it in a certain way. The information will be filtered based on things that have happened to you in the past, your own beliefs and how much you care about the subject being discussed. You may then form a negative opinion or start to see the situation in a negative light which in turn may make you start to feel irritated, anxious, deflated, angry or perhaps frustrated. This will then affect you physically as start to feel tense. You may twitch, cross your arms, pace, find yourself leaning forward, your body tense or your breathing start to get more rapid. This will all then have an impact on your behaviour and then the way that you filter the next bit of information is now also affected by how you feel and the cycle continues!</p>\n\n\n\n<p>Now imagine that at the same time this is all going on for the other person – not surprising then that a conflict may ensue?</p>\n\n<p>This course covers easily applied and highly effective ways to counter this filtering, calm the situation, protect yourself from negative emotions and behaviours, recognise the conflict trigger points and enable a positive resolution to any difficult situation.</p>\n\n<p><strong class=\"redactor-inline-converted\">Who is this course for?</strong></p>\n\n<p>If any of the following apply to you, then we know that you will get an enormous amount from this course. <br></p>\n\n\n\n\n\n\n\n\n\n<p>Do you tend to avoid difficult situations?  <br></p>\n\n<p>Do you have beliefs about yourself that mean you often don’t say what you mean in the fear of causing conflict? <br></p>\n\n\n\n\n\n<p>Do you find that people sometimes take what you say the wrong way? <br></p>\n\n<p>Do you find yourself making a decision against your will so as to avoid an argument? </p>\n\n\n\n<p>Do you feel anxious when faced with conflict? </p>\n\n\n\n<p>Do you sometimes kick yourself that you didn’t put your view across effectively? </p>\n\n\n\n<p>Do you see debate as conflict and know this doesn't help you achieve what you want? </p>\n\n\n\n<p>Do you find yourself just going with the flow rather than speaking up about what you really want? </p>\n\n\n\n<p>Do you find that some people make you feel dis-empowered and anxious? </p>\n\n<p>Do you have to manage conflict situations within your team? </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What will I get from this course?</strong></p>\n\n<p>Through 2 hours of video lessons covering 14 areas you will learn directly from Jo Wilson and Andy Coley who are experienced and global quality NLP trainers and Communication and Confidence Experts and who have worked with thousands of individuals and hundreds of companies to empower and facilitate their growth and enhance their communication and conflict management skills.</p>\n\n<p>This course will challenge you to step back and really think how you can apply everything you learn to your own environment and relationships through interactive quizzes and exercises.</p>\n\n<p>You will cover </p>\n\n<ul><li>The foundations of Neuro-Linguistic Programming</li><li>What is conflict and how does it occur?</li><li>Understanding the dynamics of the situation</li><li>How to recognise what is going on for you and how to control your emotional state</li><li>How to be clear on what you want from the situation and how to steer it to a positive results</li><li>Understanding the other person and their point of view</li><li>Calming and Influencing the situation</li><li>How to listen effectively to get to the root of the problem</li><li>How to break “bad news”</li><li>How to step back from the emotion and give empowering advice</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n<p><strong>What are the requirements?</strong></p><p>An openness and willingness to learn</p>", 
    "end_date": null, 
    "title": "Conflict Management Using Key NLP Skills", 
    "price": "35.00", 
    "instructors": "Beyond Training Solutions", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799152_664b.jpg", 
    "course_url": "https://www.udemy.com/conflict-management-using-key-nlp-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-20T22:54:34Z"
}