{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Grab this course at it's current discounted price before it goes back to $97 soon!</p><p>In the past few decades, psychologists and business people alike have discovered that successful problem solvers tend to use the same type of process to identify and implement the solutions to their problems. This process works for any kind of problem, large or small.</p><p>The Creative Problem Solving course will give participants an overview of the entire creative problem solving process, as well as key problem solving tools that they can use every day. Skills such as brainstorming, information gathering, analyzing data, and identifying resources will be covered throughout the workshop.</p><p><strong>Learning Objectives:</strong></p><ul><li>Understand problems and the creative problem solving process</li><li>Indentify types of information to gather and key questions to ask in problem solving</li><li>Identify the importance of defining a problem correctly</li><li>Identify and use four different problem definition tools</li><li>Write concrete problem statements</li><li>Use basic brainstorming tools to generate ideas for solutions</li><li>Evaluate potential solutions against criteria, including cost/benefit analysis and group voting</li><li>Perform a final analysis to select a solution</li><li>Understand the roles that fact and intuition play in selecting a solution</li><li>Understand the need to refine the shortlist and redefine it</li><li>Understand how to identify the tasks and resources necessary to implement solutions</li><li>Evaluate and adapt solutions to reality</li></ul>", 
    "end_date": null, 
    "title": "Creative Problem Solving Skills", 
    "price": "30.00", 
    "instructors": "Adam Karchoufa", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564370_8ea5.jpg", 
    "course_url": "https://www.udemy.com/creative-problem-solving-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T12:57:12Z"
}