{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Leadership is the <strong>process of influencing other experts</strong> to work beside you to bring forth a desired vision - whether it be an improvement project, career change or startup business.</p><p>Your first objective is to <strong>become someone worthy of supporting</strong>, because people buy into your leadership ability long before they fully embrace your vision for a better experience. <strong>DiSC Personality Types (DPT</strong>) <strong>Leadership Training For Career Change</strong> is designed to prepare you for this personal transformation.</p><p>Here are just <strong>7 factors</strong> that\nthis leadership training will mature in you to sharpen your vision and expand your\ninfluence:</p><ol><li><strong>Character</strong> – Who You Are Consistently</li><li><strong>Relationships</strong> – Who You Know That Matters</li><li><strong>Knowledge</strong> – What You Know (particularly about yourself)</li><li><strong>Intuition</strong> – What You See When There's No Physical Evidence</li><li><strong>Experience</strong> – Where You’ve Been and The Wisdom You've Gained</li><li><strong>Past Success</strong> – What You’ve Done To Make Things Happen</li><li><strong>Ability</strong> – What You Can Do Today... With What You Already Have</li></ol><p>Throughout the course, I ask an important question over and over again.</p><p><strong>Who and What will help you reach your next milestone?</strong></p><p>This answer can be found in the 7 factors\nlisted above. However, to uncover the answer you must go through a <strong>process\nof self-discovery </strong>which I'll facilitate using DiSC Personality Insights, as well as leadership and biblical principles<strong>.</strong> </p><p>Self-discovery makes you aware of your <strong>Unique Combination of Powers (UCP)</strong> and helps you to appreciate the tremendous value that others can contribute to your advancement.</p><p>We'll explore <strong>the teachings of\nsome of the greatest minds</strong> to ever discuss leadership, self-knowledge and quality of life. I'll simplify and then connect the many lessons to the 4 DiSC Personality Types, creating a foundation for positive interaction and teamwork.</p><p>As we shape\nyou into the person who can attract the right people and influence right action, <strong>almost on\ndemand,</strong><strong> </strong>others will notice the quality of your leadership skills. This will open the door to many profitable working relationships.</p><p>Just imagine <strong>how much easier life will be</strong> when you have a legion of supporters to join you in the quest for victory, because in helping you WIN they WIN also.</p><p>If you're ready to <strong>become a mighty influencer and position yourself to move in the direction of the Career Change</strong> which could significantly improve your quality of life, click <strong>Take This Course</strong>.</p><p>P.S.</p><p>The <strong>leadership training and DiSC Personality Insights that you'll learn in this course</strong> will allow you to not only get your JOY back, but also releases the MOJO you need to stay focused long enough to bring forth real progress. </p><p>In your current job, business or startup business in the making, how you:</p><ul><li>manage your time and energy</li><li>choose the right work</li><li>build upon your strengths</li><li>choose what to do next</li><li>make effective decisions</li></ul><p><br></p><p>...determines who will come along you to bring what you see in your mind into reality. Your <strong>d</strong><strong>emonstration of the 7 Factors and 5 Skills</strong> (i just mentioned) influences people like no other process! </p><p>Let's get started!</p><p><strong>Click Take This Course</strong></p>", 
    "end_date": null, 
    "title": "DiSC Personality Types Leadership Training For Career Change", 
    "price": "30.00", 
    "instructors": "Algernon A. Tucker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599208_64b3_33.jpg", 
    "course_url": "https://www.udemy.com/personal-power-goals-success-system-find-and-achieve-purpose/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T10:44:41Z"
}