{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You will learn a practical yet truly transformational model of leadership based on decades of experience and a unique blend of theories: Emotional Intelligence (EQ), Family Systems theory, Dr. John Wallen's interpersonal communication model, Dr. Daryl Conner's change management theory, and others. The course is an engaging blend of videos and quizzes. You will be able to immediately apply your learning to having the effect you want at work and in your personal relationships. </p><p><strong>Boost your EQ and Leadership Quickly Using: </strong></p>  <ul><li>Dr. Edwin Freidman's Self-Differentiated Leadership</li><li>Dr. John Wallen's Interpersonal Gap and Four Behavioral skills</li><li>The implications of neuroscience for EQ</li><li>Goal Alignment and other practical Organization Development methods</li></ul><p><strong>Youmust be the change you want to see in the world</strong></p><p>Those are Gandhi's words, and he knew what he was talking about. To transform your organization you must first start with yourself. People respond to leaders who have the humility to work on themselves throughout their lives, and if you sincerely do so with quality guidance you will enhance your strengths and smooth your edges. There are many places to start, such as working on a balance of taking clear concise stands with tuning in and effectively connecting with others. By doing so you will more effectively get business results.</p><p>There are many additional benefits to increasing your emotional intelligence. Dr. Daniel Goleman has documented a long list, ranging from increased earnings, to satisfaction in personal life, to effectiveness in job performance. You can take a step down that same path through the information and advice offered in this course.           \t</p><p><strong>Contents and Overview</strong>  </p><p>  \t  This course is challenging but relatively quick, containing 10 lectures and approximately 100 minutes of video content. There are short quizzes after each segment to drive learning home. It's designed for anyone, regardless of experience level, who is in or wishes to be in a leadership position in an organization, with the added benefit of skills that also apply to improving personal relationships. </p>", 
    "end_date": null, 
    "title": "Emotional Intelligence for Leadership", 
    "price": "25.00", 
    "instructors": "Gilmore Crosby", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292180_f927_5.jpg", 
    "course_url": "https://www.udemy.com/emotionally-intelligent-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T07:21:31Z"
}