{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The key to successful leadership is emotional intelligence.</p><p>More than 3000 studies on Emotional Intelligence (EI)  have shown that it significantly contributes\nto both professional and personal success.</p><p>The term Emotional Intelligence was a popularized by  Daniel Goleman. His theory tell you what you need to do. I will tell you how to\ndo it.</p><p>In this course we will seek to develop those emotional\nqualities that will make you stand out as a leader through helping you become\nmore effective at managing yourself and others.<br></p><p>“When dealing with people, remember that you are not dealing\nwith creatures of logic but creatures of emotion,” - Dale Carnegie, author of the\nworld renowned book; “How to Win Friends and Influence People” a book which promotes the development EI.</p><p>The Great News is that you can drastically increase your EI and\ndoing so is the very focus of this course.</p><p>Developing your EI will yield all kinds of great results, not\nonly for yourself, but the teams you lead, your family, friends and those\npeople in your life and the organisation you serve. Within this course, we’ll\nshare specific tips and strategies for developing your emotional intelligence.</p><p>While this course touches on the skills and knowledge that you\nneed to be a great leader, it importantly explores in detail the attitudes and\nhabits that are the elements which really impact performance. Never before has\nemotional intelligence and leadership been brought together in this way to help\nyou develop your team's performance.</p><p>This is because other proponents of life change focus only on a\nsymptom like having more confidence or propose some magic pill formula that\nwill supposedly turn your life around.<br></p><p> What they fail to\naddress are the driving forces behind your ability, actions, mental states and\nyour ability to stick to those lifestyle changes in this first place. In other\nwords they focus on knowledge and skills but not the attitudes and values.</p><p> Understanding this is key to the type of\ntransformation will help you accomplish in this course. The kind of\ntransformations that will make you a highly effective individual and leader.</p><p>EI is the closest thing to a magic pill that I have found, but\nI will be honest enough to say that it will take some time and focus on your\npart but the benefits are staggering.</p><p>Advantages of developing your Emotional Intelligence:</p><ul><li>improved communication with others</li><li>improved relatiomships</li><li>better empathy skills</li><li>how to live with integrity</li><li>gain the respect of others</li><li>improve career prospects</li><li>dealing with change more confidently</li><li>less susceptibility to falling prey to power dynamics</li><li>feeling more confident and positive</li><li>reduced stress levels</li><li>increased creativity</li><li>regaining control of your life</li></ul><p>This course will support the above claims with both theoretical\nand practical evidence that EI and your performance in general as a leader are\nconnected and that rather than being another here-today-gone-tomorrow fad.</p><p> EI is here to stay and more and more organizations are investing large sums into Emotional Intelligence testing and training because they are wising up the many benefits that doing so will attract. EI development on a personal, professional, and\norganizational level will lead to a sustainable high productivity successful\ndriven and achieving experience.<br></p><p>We will explore the competencies, skills, attitudes which it takes to become an effective leader. Have a look at the <strong>Curriculum\n</strong>to see what we which topics you go through in this course.</p><p>Success in any field is not a matter of chance, nor thing to be\nwished for and waited on. It is a thing to be achieved through Patience,\nBelief, Confidence and Performance which are all by products of EI. If you wish\nleave that rut in your life and gain incredible success through the development of the mentioned areas, then you are welcomed to enroll in this course to get to your long lasting change under way. </p>", 
    "end_date": null, 
    "title": "Emotional Intelligence: How To Be A Highly Effective Leader", 
    "price": "30.00", 
    "instructors": "Loud Media Group", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689056_bac4_4.jpg", 
    "course_url": "https://www.udemy.com/emotional-intelligence-how-to-be-a-highly-effective-leader/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T18:03:33Z"
}