{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course you will learn how to become a successful entrepreneur. You will learn how to train your mind to be the mind of an entrepreneur, and you will learn tactics and strategies for how to behave and the kinds of people to surround yourself with.</p><p><strong style=\"\">Who This Course Is For</strong></p><p>This training is for people who are either dreaming of starting a business, or are in the early stages of starting a business. The course doesn&#039;t discriminate in who you are so this is equally a course for young people (maybe teen entrepreneurs) or older people, men and women, and people of all shapes and sizes.</p><p>The strategies I teach here are universal, and will help anyone in the beginning stage of their Entrepreneurship journey.</p><p><strong style=\"\">How This Course Is Structured</strong></p><p>First I explain what is an entrepreneur, and what it means to truly be an entrepreneur, and how to ultimately become successful. After that I discuss the psychology of a smart entrepreneur, and the common characteristics that will help you be more successful.</p><p>I also explain what mistakes to avoid.</p><p><strong style=\"\">Still Wondering If The Course Is Right For You? There Is No Risk To Try</strong></p><p>Every Udemy course comes with a 30-day money back guarantee. So if you don&#039;t get what you hoped out of the course, you can get a full refund. But I am sure you will love the course, so go ahead, sign up, and start becoming the best entrepreneur you can be, starting today.</p>", 
    "end_date": null, 
    "title": "Entrepreneurship practices that bring you closer to success", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447178_04dd_2.jpg", 
    "course_url": "https://www.udemy.com/entrepreneurship-skills-psychology-to-be-an-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T11:51:20Z"
}