{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Sound leadership skills are the foundation for success in all workplace environments. The skill of effective leadership practices has been found to enhance work environments that contribute to engaged employees and high performance. </p><p>In my 30+ years I have found theses techniques as a very practical tools to enhance anyones Leadership abilities. This course teaches very practical foundational leadership skills that anyone can develop in order to successfully build and hone their Leadership skills. Thus creating a greater chance of success and promotion.</p><p><span><strong>The Instructor</strong></span></p><p>Alan Strudwick has been training and facilitating Business Development Training's, Seminars and Workshops for over 30 years. Ranging from large international corporations down to the single owner and franchises.</p><p><strong>What are the requirements?</strong></p><ul><li>You need to be keen and be inspired to apply leadership skills to your everyday life.</li><li>A deep down feeling to become an outstanding leader</li><li>A sense of destiny to fulfil your purpose in life.</li></ul><p><strong>What am I going to get from this course?</strong></p><ul><li>Lectures and 1.5 hours of content!</li><li>By the end of this course, you will have practical techniques and tools to improve your leadership skills.</li><li>You will learn how to bring leadership practices into your workplace.</li><li>You will have learnt techniques that will allow you to be a leader of influence</li></ul><p><strong>What is the target audience?</strong></p><ul><li>This course is for anyone:-<ul><li>The Novice</li><li>The new Manager / Supervior</li><li>The Seasoned Management </li><li>The Expert Leader</li></ul></li><li>This course is for those who:-<ul><li>Want to build upon their leadership skills no matter what level</li></ul><ul><li>May be in a position of influence. </li><li>Have a sense of purpose to be a leader</li></ul></li></ul>", 
    "end_date": null, 
    "title": "Foundational Leadership", 
    "price": "20.00", 
    "instructors": "Alan Strudwick", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759238_256c.jpg", 
    "course_url": "https://www.udemy.com/foundational-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T03:34:10Z"
}