{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Great leaders are not born, they are trained. </p><p>This course explores the additional secret skills that separate good leaders from great leaders. The skills that enables great leaders to inspire others just by being who they are.</p><p>It is important that a leader have passion, lead by example, be organised, delegate, take ownership, be responsible, communicate well, be brave, be honest, be a great listener and know their people.  However, these skills alone, do not make a great leader.</p><p>What separates good leaders from great leaders?</p><p>First, great leaders have a structure. There is a process they follow. For many great leaders this process is unconscious and they may not even know they are doing it, however there is a structure and great leaders follow this structure whether they are aware of it or not.</p><p>Second great leaders use four secret skills. These four secret skills are what separates good leaders from great leaders. What enables an ordinary person to rise up and stand for something more? What enables someone to inspire others with a purpose beyond the ordinary? In addition to passion and the other items listed above, a great leader uses the four secret skills. </p><p>At the completion of this course you to will be able to implement the same structure and use the four secret skills of great leaders in your daily life.  Leading is not just about changing the world or driving organisations. Great leading is needed everywhere. How do you inspire your children to do their homework and make a positive contribution to the world? How do you lead your family in a crisis? In almost every situation the ability to be a great leader will enable you to shine like the sun. To stand out and make the world a better place.</p>", 
    "end_date": null, 
    "title": "Four Secret Leadership Skills", 
    "price": "20.00", 
    "instructors": "Damian Andrews", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636230_5805.jpg", 
    "course_url": "https://www.udemy.com/four-secret-leadership-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T22:45:30Z"
}