{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>As you probably know that we all are seeking for success. We want to win in every single game we play.  </p><p> I have read countless books on how to be successful. </p><p>Most of them talk the same. The rules that some people applied and they worked, don’t necessarily mean that they will work for us too.  <br></p><p>We are either in search of the next best technique or secret information or we start with enthusiasm and we stop.  </p><p>The loop continues.  <br></p><p>We tend to over-complicated problems and, therefore, the solutions and often end up in vicious cycles and take the long route or get lost altogether.  <br></p><p>Most of us don't need to learn more strategies, we need the right mindset to put what we already know into action.  <br></p><p>We don’t need to learn cool skills or techniques at first. </p><p>Those things are built upon some of the foundation skills such as your mindset and behavior.  <br></p><p>The course is about how people can build or train themselves to be much more effective in their personal and professional lives.<br></p><p>Regardless if you are a CEO,  small business owner, parent, or someone who simply wants to make a difference,  you will learn to master powerful distinctions that you can apply immediately to resolve the challenges that you are presently up against.   <br></p><p>This course is not just for CEO’s or high-level executives.  <br></p><p>Anyone wanting to be more effective and solve challenges, will benefit immensely from this course if they apply the information.</p><p>You will unstuck yourself from an invisible chain you are holding yourself with.  </p><p>This course is about how you can be an exceptional winner.  <br></p><p>You will know the real strategies  to win in your professional as well as personal life.   <br></p><p>You are not going to get a dose of nice motivational thoughts.  <br></p><p>Instead, you will find straight to the point advice.  </p><p>You must be honest to yourself while learning this course.  </p><p>Facts don’t lie.   <br></p><p>You will be made aware of the fact over and over again.   <br></p><p>This course is a journey from being coward to fearless.   <br></p><p>Stop being a coward.   <br></p><p>Wherever you are in your life so far,  it’s because of your decisions you have taken in your life.  <br></p><p>This course will help you to decide to be more powerful.   <br></p><p>If you are desperate to win in your life,  this is the right course for you.   <br></p><p>This is not a theory course.</p><p>This is not a motivational mumbo-jumbo course.   <br></p><p>You will know what is right. <br></p><p>The results in your life have no sympathy for you.   <br></p><p>You want real answers.   <br></p><p>Find those answers from this course.   <br></p><p>I, as an instructor and coach,  will tell you what no one else can dare to tell you and will show you what no one else can show to you.  </p><p>This course is the result of life coaching with highly committed people to create powerful results in their life.  </p><p>You too will get powerful results after  doing this course and implement what you will learn.  <br></p><p>Now, it’s your choice to be an average or a winner.  <br></p><p>Now, I will meet you on the other side of the enrollment.<br></p><span></span>", 
    "end_date": null, 
    "title": "How to be a badass winner in your business?", 
    "price": "20.00", 
    "instructors": "Mayur Bardolia", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780064_0990_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-badass-winner/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T15:32:11Z"
}