{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The Timecentre model can be beneficial to everyone in any local community. This course is all about explaining a Timecentre fully, and how exactly this system can be successfully created and operated in your local area.</p><p>Simply, a Timecentre is centred around a local community, which enables the residents to become active and engaged in that community.  It is a model that allows members of the community to earn an alternate currency (called Time Credits) through giving their time and helping out with the running of any community group or activity in the area.</p><p>This model traditionally revolves around a physical place within that local community, such as a community centre.  This allows the centre to become the social hub of the area, and a place to hold the community groups and activities that people can make use of by giving and receiving Time Credits.</p><p>In this course, we will explain this Timecentre model in more detail, and provide a breakdown of the 11 main steps you should take in order to implement a Timecentre.  We aim to help you set up a Timecentre in your local community, enabling the people in your community to become more engaged and involved with helping each other.</p><p>This course makes it easy to start up your own Timecentre, through providing you with all of the information in a simple, step-by-step format.  We also provide downloadable, and reusable, documents that make up the framework of a Timecentre. You can base your Timecentre upon this framework, and edit these examples for your own use. This would therefore make it easier for you to initiate this local system and run long-term. </p><p>The course takes a step-by-step, predominantly video lecture format, with informative breakdowns and simplifications of each of our steps. </p><p>This course shouldn't take a hugely long time to complete, although it would be beneficial to take your time with each of the steps, and make sure you fully understand what to do. Therefore, you may benefit from going over the course more than once, to get the most out of it. </p><p>You should take this course if you want to understand what a Timecentre is, the history of Timecentres, and if you want to learn how you can utilise this model and create your own Timecentre as a social hub in your local community. </p><p>You should also take this course if you want to see the positive impacts that comes with an active community. And particularly if you want to be the one to provide for your local community. This course contains a lot of inspiration for how you can engage your community through a Timecentre, assisting to helping one another to reap the benefits of a helpful, inclusive local society. </p><p>People of all levels can take this course, whether you are an expert about community benefit companies, volunteering and helping out in your local area, or whether you are a beginner who wants to learn more. </p><p>However, the course would probably be more helpful for people who class themselves more as beginners in community matters, and for those who would like to understand the Timecentre model in more detail.</p>", 
    "end_date": null, 
    "title": "How To Set Up a Timecentre in Your Local Community", 
    "price": "20.00", 
    "instructors": "Dawn Davies", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478918_06a2_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-set-up-a-timecentre-in-your-local-community/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-17T11:57:11Z"
}