{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Leadership is not for the select few at the top. In highly effective organizations, there are leaders at every level. No matter your business position, you can apply the guidelines of Intent Based Leadership and create environments where people contribute and feel valued. <br></p><p>This self-paced course will teach you how to implement the basic principles of Intent-Based Leadership in your organization. Our hope is you will take what you learn from this course and use it to help others become the leaders they were meant to be. In doing so, you'll be become the leader you were meant to be.</p><p><strong>6 Principles of Intent-Based Leadership:</strong></p><ol><li>Our objective is to achieve greatness, not avoid errors.</li><li>In order to achieve greatness, we need people to think.</li><li>For people to think, leaders must give control, not take control.\n<ul><li>At an individual level, leaders move people up the Ladder of Leadership by giving intent, not instructions.</li><li>At the organizational level, leaders push authority to information not information to authority.</li></ul></li><li>To ensure successful distribution of control, the two supporting pillars of technical competence and organizational clarity must be in place.</li><li>Our focus is to change the environment, not the people.</li><li>One way we do this is to act our way to new thinking, not think our way to new action.</li></ol><p><strong>Objectives:</strong></p><ul><li>Think afresh about what leadership means.</li><li>Practice language that empowers your people.</li><li>Understand organizational design in the context of how to push decision making downward.</li><li>Commit to change behaviors tomorrow.</li></ul><p><strong>What you will learn from taking the course:</strong></p><ul><li>How to create an environment where people actively engage and think.</li><li>Have a personal commitment to talk with to their co-workers in an empowering way.</li><li>Implement the idea of leadership as creating more leaders – not more followers.</li><li>Implement the idea of leadership as giving control – not taking control.</li></ul>", 
    "end_date": null, 
    "title": "Intent Based Leadership", 
    "price": "20.00", 
    "instructors": "Navanas Institute", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660122_f282_2.jpg", 
    "course_url": "https://www.udemy.com/intent-based-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T15:57:40Z"
}