{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t     The ability to communicate effectively may be the most important quality one can possess. This self-paced educational training program is designed to re-energize you to learn how to become a better leader and communicator at home, in the workplace, and in society. This program was designed in part to help develop one’s success mindset to allow for a healthier and happier life.  </p>  <p style=\"\">  \t     The program comes with an Introduction where Dr. Rich explains how to maximize the learning opportunities in the program as well as a conclusion that provides information on how to best apply learning in both the short and long term. Attendees will learn insights, strategies, and ‘how to’ applications in lessons  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t     ·Introduction to the Program  \t</p>  \t<p style=\"\">  \t\t     ·Vision, Mission, and Guiding Principles Statements  \t</p>  \t<p style=\"\">  \t\t     ·Leadership  \t</p>  \t<p style=\"\">  \t\t     ·Communication  \t</p>  \t<p style=\"\">  \t\t     ·Goal Attainment  \t</p>  \t<p style=\"\">  \t\t     ·Time Management  \t</p>  \t<p style=\"\">  \t\t     ·Putting it All Together  \t</p>  </ul>  <p style=\"\">  \t     In this content narrated education and training program that exceeds 6-hours, Dr. Rich Schuttler addresses each area in a manner that is easy-to-understand. He offers success tips and implementation strategies that he has used for over 25-years for his own success and for those he teaches, coaches, and mentors. The content is rich in tools and examples to allow you to think and learn to apply immediately to your own settings. By completing this program, you can expect to have a better understanding of how to be more productive and set a better example for others to emulate.  </p>  <p style=\"\">  \t     Dr. Rich takes everyday applications that many of the most successful people apply and distills them down to easy-to-understand pieces of information so you can apply them immediately. Concepts from years of research and a wide-variety of personal and professional experiences provide the foundation for a sound and systematic curriculum that is ideal for anyone wanting to be a better person – professionally or personally.  </p>", 
    "end_date": null, 
    "title": "Leadership and Communication Mastery", 
    "price": "20.00", 
    "instructors": "Dr. Rich Schuttler", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208998_9999_4.jpg", 
    "course_url": "https://www.udemy.com/leadership-and-communication-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-01T23:53:23Z"
}