{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Ignite is a leadership development course for teens that <strong style=\"\">focuses on character and integrity, helping young men and women to become powerful and positive influencers of those around them. </strong></p><p>By tackling issues like <strong style=\"\">pride</strong>, <strong style=\"\">fear</strong>, <strong style=\"\">personal vision</strong> and the importance of cultivating certain <strong style=\"\">daily habits</strong>, IGNITE helps participants discover and define their purpose. It also builds confidence and helps each person discover they are a leader, and their influence of others extends beyond what they may currently realize. Ignite will challenge every participant to love and serve others as Jesus did, which means leading and bringing out the greatness in others as He did. With their focus on leading like Jesus, they will begin to have a greater impact in their home, school, church, community, and the world.</p><p>IGNITE is a six session course, and each session can be done in 35 – 45 minutes.</p><p>Each lesson contains compelling videos, Scripture references, quizzes, and thought-provoking questions.</p><p>At the end of these six sessions, each student will not only understand that they are an influencer, but will build a solid foundation and gain practical knowledge on how to grow as a leader.</p>", 
    "end_date": null, 
    "title": "Lead Like Jesus: 6 Ways to Grow Your Influence and Impact", 
    "price": "35.00", 
    "instructors": "Lead Like Jesus", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505496_9954_7.jpg", 
    "course_url": "https://www.udemy.com/igniteleadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T20:36:19Z"
}