{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>When I was asked to facilitate a three-hour experience at a leadership retreat, intended to provide tools and information which would assist people in developing their mentoring skills - I knew I had the content to support their success! For years I've been preparing supervisors and managers for their transitions from one level of an organization to a leadership role. My course, \"Team Lead and Supervisor Readiness\" became the basis for this 15 page coaching and mentoring guide: LEAD YOURSELF FIRST.</p><p>Many times people are put in leadership positions without the benefit of training that highlights the competencies required to succeed as a leader. Or, people attend concept training and leave with an overwhelming feeling of, \"Now what?\", working hard and with good intentions, but lacking effectiveness in their roles. I wrote this guide so people would have a step-by-step action planner to build their foundation for leadership. </p><p>Even if you don't think you want to fill a leadership role, but want to develop the self awareness and actions to be an employee with maximum value in your organization, this course will help you achieve your goal. How can I be so sure? Because thousands of participants have participated in my face-to-face trainings and thanked me for the information and tools I provide. </p><p>This information has even helped people become more effective leaders in their own families...some say my courses have saved them thousands of dollars in counseling fees!</p><p>Purchase the course now and receive:</p><p>1. The 15 page guide that will challenge you to raise your self-awareness, establish a leadership mindset, and establish the habits of leadership. </p><ul><li>Goal and action planner</li><li>Values/Driver identifier and recognition of sacrifice impact</li><li>Qualities and Skills analysis </li><li>Your Leadership Legacy Challenge</li><li>Personal and Social Competencies worksheets - potential life-changer</li><li>Employee coaching planner</li><li>Daily Leadership Check List</li><li>Relationship builder tools</li><li>Coaching techniques and worksheets</li></ul><p>2. Video coaching sessions from me to you, just like I would talk with you if you hired me as your performance coach. </p><p>The perfect time for leadership training is before you become a leader. The second most perfect time for leadership training is RIGHT NOW! I promise this course will create value for you and a return on your investment that could open up your career path. </p>", 
    "end_date": null, 
    "title": "Lead Yourself First! A Leadership Guide for Mentors", 
    "price": "45.00", 
    "instructors": "Catherine Goggia", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660086_d150_4.jpg", 
    "course_url": "https://www.udemy.com/lead-yourself-first-a-leadership-guide-for-mentors/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T15:12:59Z"
}