{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>Are you a manager?</em></p><p><em>Are you in sales?</em></p><p><em>Or are you a parent?</em></p><p>Then you've got conflict!</p><p>Sure, it would be great to live a life free from conflict. But when you're reading or watching a story, it can get boring quickly if there's no challenge for the hero to overcome. </p><p>Besides, life is full of conflicts, whether you like it or not. </p><p>There is conflict at home. You and your spouse or roommate will not always agree on everything. There will be times that he or she might not even be willing to compromise one inch. </p><p>There will be conflict at work. Coworkers won't cooperate. Customers will complain. Your boss will find fault with your best efforts.</p><p>And even when you're by yourself, you can't always avoid conflict. The car can break down. You might get a migraine. Or your appointment might stand you up.</p><p>The key to properly handling conflict is not to run and hide. It's not to become combative. Rather, it is best dealt with by using a good set of tools.</p><p>This course will help provide those tools. </p><p>You'll get short lectures with clear points. You'll hear real life examples of the principles. And you can easily access any of the lessons at any time. The whole course takes just an hour and a half - so you can get up to speed in one afternoon!<br></p><p><strong>Here's what this course will do for you - in as little as one hour!</strong></p><ul><strong></strong><li>You'll anticipate conflict and plan effectively for it</li><li>Make peace while making progress</li><li>Communicate with power and clarity</li><li>Learn to get along with anyone - <em>even if you don't like him or her!</em></li><li>Create an environment that empowers people and minimizes conflict</li><li>Help you see whether to fight - or let it go</li><li>And much more!</li></ul><p>If any of this would benefit you, enroll now. Don't wait another hour to strengthen your people skills. </p><p>If you're new to leadership, this will keep you from quitting after the first month.</p><p>If you've been a leader for a while, these tools might sharpen your ability to handle conflict more constructively.</p><p>And if you're already good at dealing with conflict, this is something you can give someone who isn't.</p><p>Now let's get started, shall we? You've got nothing to lose with our 30 day money back guarantee. Enroll now! Your new life is waiting.</p><p><br></p><p><strong></strong><br></p>", 
    "end_date": null, 
    "title": "Learn to Effectively Deal With Conflict in Just One Hour", 
    "price": "20.00", 
    "instructors": "Frank McKinley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660658_3b60_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-effectively-deal-with-conflict-in-just-one-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T02:13:01Z"
}