{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Most people view leadership as simply an opportunity to make others follow you blindly or without question, no matter the goal or task.</p><p>This belief allows people to falsely believe that leadership is about the leader, and not about those being led.</p><p>Not fully understanding what leadership is we naively put too much emphasis on what the leader cares about, and doing only what the leader says.</p><p>This is the very root of bad leadership.</p><p>Real, effective, common-sense based leadership is never about the leader at all!</p><p>A real leader pours him/herself into the people they lead &amp; adds real value to their lives as much as possible.</p><p>It's all about the people being led, not the leader.</p><p>The Legacy Leader Blueprint is a course that lays the groundwork for a lifetime of transformative common-sense leadership; A leadership philosophy that allows everyday people to create:</p><ul><li>More leaders</li><li>More opportunities for others success</li><li>More solutions &amp; creative free thinking</li><li>A life of significance &amp; purpose leading to more time &amp; economic freedom</li></ul><p></p><p>We've all experienced ineffective leadership in our lives. Think of a time in your life when someone was put into a leadership position but they were not ready for it.</p><p>This course highlights why this is such common problem and how we can break through this misconception, begin a lifetime journey of significant growth, &amp; start producing dramatic results.</p><p>It's all about learning how to be Calm, Confident, Consistent, &amp; Courageous in every aspect of your life.</p><p>By the end of this course you will understand Transformative Leadership which leads to the following benefits:</p><ul><li>A more fulfilling personal life</li><li>Unlimited business growth</li><li>Higher team performance</li><li>Increase sales &amp; customer satisfaction</li><li>Genuine loyalty &amp; commitment</li><li>Increased initiative, accountability, &amp; motivation</li><li>The potential to make a significant dent in your universe</li></ul>", 
    "end_date": null, 
    "title": "Legacy Leader Blueprint", 
    "price": "50.00", 
    "instructors": "Richard Rierson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513082_cb14.jpg", 
    "course_url": "https://www.udemy.com/legacy-leader-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T19:59:25Z"
}