{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t Liderazgo I, es el primero de tres seminarios en los que hago una revisión profunda al concepto de Líder. En el trabajaremos sobre cuál es el momento en el que las habilidades que diferencian al Líder -de el jefe- han de empezar a manifestarse.  </p>  <p>  \t Es habitual que ese momento pase desapercibido o que no se le preste la debida atención intentando, más tarde, “re-conducir” la situación. Por este motivo y a pesar de toda la formación que existe sobre liderazgo, es frecuente que no se consigan los resultados que se desean.  </p>  <p>  \t En este seminario, no sólo identificará con claridad ese momento, sino que verá con detalle los cambios que es necesario introducir para iniciar el camino de liderazgo con la máxima solidez:  </p>  <ul style=\"\">  \t<li>Aplicar una nueva perspectiva a su trabajo.</li>  \t<li>Manejar con habilidad la relación con la Dirección.</li>  \t<li>La dirección de las personas.</li>  \t<li>La necesidad de vender.</li>  </ul>  <p>  \t También trabajará en profundidad sobre la figura de los mandos medios en las empresas. Figura que no siempre es bien entendida ni bien gestionada, lo que acarrea graves consecuencias y que se encuentra en la base de muchos fracasos empresariales.  </p>  <p>  \t Para concluir, todo lo trabajado, le permitirá:  </p>  <ol style=\"\">  \t<li>Trazar un plan de acción a la hora de seleccionar a las personas para nuevos puestos en su empresa.</li>  \t<li>Prepararse adecuadamente en las distintas áreas antes (o a la vez) que asume su nueva responsabilidad profesional.</li>  \t<li>Identificar qué áreas de mejora ha de trabajar (en el caso de que ya haya pasado el “momento de iniciación” al liderazgo), para re-conducir su carrera profesional; o la de cualquier persona a su cargo.</li>  </ol>  <p>  \t Como resumen, en este seminario le propongo mirar un tema del que tanto se ha hablado y escrito DESDE una NUEVA POSICIÓN, a veces sorprendente. Esto le facilitará ENTENDER al Líder desde otro ángulo, mucho más efectivo en lo profesional y en lo personal.  </p>  <p>  \t Expresado en otros términos es un Camino de Iniciación al Liderazgo.  </p>", 
    "end_date": null, 
    "title": "Liderazgo I. Iniciación del Camino del Líder.", 
    "price": "20.00", 
    "instructors": "Javier Redondo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/218250_7f9e_3.jpg", 
    "course_url": "https://www.udemy.com/liderazgo-1-iniciacion-del-camino-del-lider/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-14T10:29:29Z"
}