{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Este Curso Puede Convertirte en un Líder de Excelencia...</strong>  </p>  <p>  \t<strong style=\"\">Convertirte en Líder de Excelencia = Mejor Salario, Mejores puestos en la Organización, Mejor Desarrollo y Estatus Profesional </strong>  </p>  <p>  \t<strong style=\"\">Líderes Reales de Excelencia en Tu Organización: Mayor Eficiencia y resultados, Estructura organizacional efectiva y orientada a la excelencia = Alcanzar la VISION de la Organización</strong>  </p>  <p>  \t<strong style=\"\">Un Líder de Excelencia es invaluable para cualquier Organización (y gana más)</strong>  </p>  <p>  \t<strong style=\"\">Cómo Convertirte en un Líder de Excelencia y cómo convertir a tus asociados en Líderes de Excelencia = Tomando este Curso y aplicando lo que aquí te comparto.</strong>  </p>  <p>  \t<strong style=\"\">Tu puedes medir efectivamente la eficacia de Tu liderazgo y el de tus asociados, aquí te explico cómo.</strong>  </p>  <p>  \t<strong style=\"\">¿Porqué tomar este curso conmigo?, Porque tengo más de 15 años de experiencia desarrollando e impulsando lideres en la Industria Automotriz, una de las Industrias más demandantes. </strong>  </p>  <p>  \t<strong style=\"\">Porque los Líderes que he formado están ya en puestos de mayor Autoridad y Sueldo, algunos incluso han sido invitados a tomar posiciones de Autoridad en Corporativos de E.U. </strong>  </p>  <p>  \t<strong style=\"\"></strong><strong style=\"\">Porque he liderado y administrado proyectos de mas de USD 5M y recibido reconocimientos por parte de CEO De Corporativo Internacional.</strong>  </p>  <p>  \t<strong style=\"\">Porque tengo la experiencia, el expertise y la capacidad de transmitirte lo que NO encontrarás en ningún otro curso de Liderazgo.</strong>  </p>  <p>  \t<strong style=\"\">Este curso es TOTALMENTE ORIGINAL. </strong>  </p>  <p>  \t<strong style=\"\">¡Compruebalo! tienes garantía de devolución de 30 dias. No tienes nada que perder y MUCHO que ganar.</strong>  </p>  <p>  \t<strong style=\"\">Inscribete Hoy Mismo </strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">&quot;Interesante y enriquecedor el contenido del Curso. Dinámico con ejercicios vivenciales, equilibrado entre los conceptos técnicos y los requerimientos humanos para lograr ser Líderes. Manuel muestra un conocimiento profundo del tema en lo teórico y en la práctica, y demuestra un interés genuino por compartir lo que sabe. Gracias por la oportunidad de crecer&quot;</strong></em>  </p>  <p>  \t                                      Juan Carlos Amezcua M., EEDUCA Consultores  </p>  <p>  \t                                      ****  </p>  <p>  \t<strong style=\"\">        ¿Quieres convertirte en alguien invaluable en tu trabajo u Organización?  </strong>  </p>  <p>  \t                            Inscribete YA!  </p>  <p>  \t<br style=\"\">  </p>  <p>  </p>", 
    "end_date": null, 
    "title": "Liderazgo de Excelencia. Desarrolla y Mide Tu Liderazgo", 
    "price": "30.00", 
    "instructors": "I.E. Manuel Echeverría", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198952_5b4a_9.jpg", 
    "course_url": "https://www.udemy.com/leadership_by_competencies/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T20:30:37Z"
}