{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        My course provides an overview of how your brain works when confronted with the threat or fear of conflict. I'll explain why it's important to understand the dance that the brain orchestrates between conflict and your emotions.  And how you can better manage this dance particularly when challenged by reactive emotions that could lead to conflict  </p>  <p style=\"\">Additional materials are included to expand on the subjects discussed in each lecture, giving you an opportunity to broaden your knowledge for managing conflict.  \t\t\t\t\t        </p><p style=\"\">During the last half of the course I'll share with a set of skills that have proved effective for minimizing conflict and help you get through a rough patch when conflict seems inevitable.   Ultimately, the goal for the course give you the tools you need to cultivate habits that minimize conflict and improve your chances for making the best of bad situations at work and home. </p><p style=\"\"> Here are a few of the skills you'll learn:</p><p style=\"\"><strong style=\"\">• </strong>How to move beyond disagreeing so easily. </p><p style=\"\">• Managing strong emotions, like anger, frustration and contempt. </p><p style=\"\"><strong style=\"\">• </strong>How to examine a bad experience to bring out the positive upside.</p><p style=\"\"><strong style=\"\">• </strong>Avoid negative reactions toward people and events that are annoying. </p><p style=\"\"><strong style=\"\">•</strong> Learn how to minimize misinterpretation of your words. </p><p style=\"\">• Techniques to prevent people from ruining your day. </p><p style=\"\"><strong style=\"\">• </strong>How to quite the voices inside your head that divert your attention. </p><p style=\"\"><strong style=\"\">•</strong> You'll learn proven techniques for integrating  new skills into your daily life </p><p style=\"\">Learning and applying the skills included in the course will boost your confidence and ability to manage conflict with greater ease and calm.</p>", 
    "end_date": null, 
    "title": "Managing Conflict:  It's Really About Knowing How", 
    "price": "20.00", 
    "instructors": "Roy H. Aiken", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299752_6dab_2.jpg", 
    "course_url": "https://www.udemy.com/managing-conflict-its-really-about-knowing-how/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T19:03:26Z"
}