{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Pure Coaching</strong></p><p>Verbal Aikido training is the most powerful, quick and cost effective way to enhance interpersonal relationships, increase team engagement and create a modern team culture.</p>\n\n<p>This is it..... The Final installments of the 7 Modules of James MacNeil's Verbal Aikido series called <strong class=\"redactor-inline-converted\">Mastering Communications for Ultimate Networking Success</strong>.</p>\n\n<p>These videos are designed to build the trust and confidence required in order to manage the new demands of today’s organizations focusing on <em>Network Marketing, Affiliate Marketing, Direct Sales and Businesses. </em></p>\n\n<p><strong class=\"redactor-inline-converted\">Pure Coaching</strong> is designed to learn the concepts, skills and insights necessary to draw the genius out of your team by assisting them in unlocking their potential.  Provide tools for transformation and empowerment for both the attendee and their team.</p>\n\n<ul><li>What is coaching? What is a Pure Coach?  </li><li>Core Pillars of Coaching.  </li><li>Complete Values assessment and then a full review the output from the values assessment</li><li>Review of the 3 levels of listening revolving around Subjective, Objective and Intuitive  </li><li>The Million Dollar questions are covered and how they can be used to pull the Genius out of you and your team.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><em>In Module 7 – Pure Coaching: we will be focused on the following:</em></strong></p>\n\n<ul><li>What is coaching?</li><li>Why is coaching so powerful?</li><li>What is coaching not?</li><li>Learn the roots of coaching</li></ul>\n\n<ul><li>Review the challenges to being a Master Coach</li><li>Understand the Coach’s conundrum</li><li>See your first glimpse of the 5-Million Dollar questions</li></ul>\n\n<ul><li>The Magic Wand is revealed</li><li>Review Life’s Big 7</li><li>Revisit the 5-Million Dollar Coaching Questions</li></ul>\n\n<ul><li>Digging deeper into the power of the 5-Million Dollar Coaching questions</li></ul>\n\n<p>\"<strong class=\"redactor-inline-converted\">Mastering Communication for Ultimate Network Success</strong>\" is a powerful communications and business leadership training course focused on rapidly growing your organization and maximize profits. The non-confrontational philosophy of Aikido prepares anyone to stay grounded, mentally ready and able to handle any situation or interaction regardless of the circumstances to remain empowered and in control.</p>", 
    "end_date": null, 
    "title": "Mastering Communications for Ultimate Networking Success #7", 
    "price": "50.00", 
    "instructors": "James MacNeil", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728424_5ed6_4.jpg", 
    "course_url": "https://www.udemy.com/mastering-communications-for-ultimate-networking-success-7/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T20:54:36Z"
}