{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      In this course I will walk you through how you can effectively use and match four different leadership styles.  </p>  <p style=\"\">  \t      Throughout the years I have seen so many leaders waste their time and talent by not matching their leadership style effectively, resulting in high costs, both financially as well as health and relationship wise.  </p>  <p style=\"\">  \t      Through clearly explained videos and downloadable materials I will walk you through step by step how to identify the different competence levels of your followers and match your leadership effectively.</p>  <p style=\"\">  \t<strong style=\"\">Learn How To Effectively Match Your Leadership Style - Step By Step</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Recognize the four different competence levels</li>  \t<li style=\"\">Understand the need for four different leadership styles</li>  \t<li style=\"\">Free up their time and energy by leading more effectively</li>  \t<li style=\"\">Increase the motivation of your followers</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Built on 20 years experience and more than 2000 hours of research</strong>  </p>  <p style=\"\">  \t      When I found my trainees struggling to adapt their leadership effectively I could not find an easy, practical material to teach them this.  </p>  <p style=\"\">  \t      So based on my background as a teacher, 20 years of working with leaders across the world and extensive research, I created that material.  </p>  <p style=\"\">  \t      Managers, leaders and human resource workers have since told me how simple it is to understand, how it gives them several &quot;Aha!&quot;-moments and how they use it as a continuing reference in their work.  </p>  <p style=\"\">  \t      In this course you will learn to recognize the four different competence levels and how they affect your leadership.  </p>  <p style=\"\">  \t      You will gain an understanding of the need for the four different leadership styles and how to use them effectively.  </p>  <p style=\"\">  \t      I will teach you how to free up their time and energy by leading each team member or follower they way they need to be led to achieve their full potential.  </p>  <p style=\"\">  \t      You will get vital keys to increasing the motivation and efforts of your team members.  </p>", 
    "end_date": null, 
    "title": "Matched Leadership: How to Use Leadership Styles Effectively", 
    "price": "45.00", 
    "instructors": "Markus Amanto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/344418_c07c_3.jpg", 
    "course_url": "https://www.udemy.com/matched-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-14T19:29:13Z"
}