{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Menschen lesen und sie richtig einschätzen können, ist ein nicht zu überschätzender Vorteil, wenn man seine Kommunikationsangebote passend anbieten möchte und zielgerichtet mit ganz gleich wem ins Gespräch kommen will. </p><p>Eine Methode, die schlank genug ist, dass man mit ihr im Alltag spielerisch aus der Hüfte schießen kann, aber die dennoch aussagekräftig genug ist, um Dein Gegenüber perfekt lesen und einschätzen zu können, ist die Psychographie. Schnell weißt Du mehr als alle Anderen auch nur erahnen und präziser als jeder andere kannst Du Deine Kommunikationsziele auch ins Rennen bringen. </p><p>Das ist Teil I meines Doppelpacks, den Du hier als Kurs belegen kannst. </p><p>In Teil II beschäftigen wir uns nicht nur mit dem \"Profiling\" sondern mit den ganz konkreten Möglichkeiten der Diplomatie. Eine Technik die Spaß macht zu erlernen und das passende Vehikel ist, gerade Erkanntes auch rhetorisch Deinem Gegenüber anzubieten. </p><ul><li>In insgesamt 24 Video-Lektionen marschieren wir gemeinsam durch diese beiden großen Themen: Diplomatie &amp; Psychographie. </li><li>Du findest zu fast jeder Lektion mein Handout als Download</li><li>Zum Abschluss habe ich Dir wieder ein kleines Quiz zusammengestellt. Hier kannst Du Dein Wissen prüfen. </li><li>Für Rückfragen bin ich während des Kurses jederzeit für Dich ansprechbar. </li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Menschen lesen und diplomatisch verhandeln mit System", 
    "price": "50.00", 
    "instructors": "Michael Kirchhoff", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/720462_6266.jpg", 
    "course_url": "https://www.udemy.com/menschen-lesen-und-diplomatisch-verhandeln-mit-system/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T06:54:43Z"
}