{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This is an entry level course suitable for any person in a position of leadership or management. Highly suitable for team leaders and business owners. This course will explain the general principles behind influencing outcomes. It will teach the students that there are nine core tactics of influence that can be deployed. They will also learn that the tactics have an effectiveness order and there should be used in a certain way to achieved the best results. They will also learn how to combine and mix tactics to greatly improve the opportunity to influence an outcome in their favour. The course will last between 30-45 minutes and includes a document handout to help with the learn process. It is structured into 4 sections. The basic introduction, the nine tactics are then explained in detail, with a closing section which is a summary and overview. </p><p style=\"\">Here are five great reasons to sign up for this course.</p><p style=\"\">1. Learn how influencing others can help you in all areas of your life</p><p style=\"\">2. Learn the nine tactics of influence, so you can see them when others are using them</p><p style=\"\">3. Learn the effectiveness order of the tactics so that you use them in the most effective way.</p><p style=\"\">4. Learn how to stack, combine and blend different tactics to dramatically improve your opportunities for a favourable outcome.</p><p style=\"\">5. Learn which tactics are the best to use based on the situation or circumstances you are in.</p><p style=\"\">If you are in a position of leadership, if you manager a team or run your own business this course will help you understand how to greatly improve your ability to influence others to get the desired outcomes.</p>", 
    "end_date": null, 
    "title": "Nine Tactics of Influence", 
    "price": "20.00", 
    "instructors": "Ian Dickson", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520218_de8f_4.jpg", 
    "course_url": "https://www.udemy.com/nine-tactics-of-influence/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T12:21:18Z"
}