{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Voici la seule formation en ligne qui vous explique de A à Z comment structurer votre discours pour être efficace dans la transmission de vos messages.</strong>  </p>  <p style=\"\">  \t  Ma méthode unique, c’est un moyen simple et ultra performant d’acquérir les outils indispensables pour être efficace, impactant et convaincant quand vous prenez la parole devant un public.  </p>  <p style=\"\">  \t  Si lorsque vous êtes devant un auditoire vous avez le sentiment de  </p>  <ul style=\"\">  \t<li>Ne pas être suffisamment clair</li>  \t<li>Ne pas être vraiment concis</li>  \t<li>Perdre le fil, vous embrouiller</li>  </ul>  <p style=\"\">  \t  En trois mots, de ne pas avoir trouvé comment être suffisamment prêt pour être compris, voici ce que je vous promets : à l&#039;issue de ce cours, vous aurez les techniques et les outils pour structurer votre message, être efficace et impactant et dire exactement ce que vous avez envie de dire. J’ai formé plus de 1000 personnes à la prise de parole en public et je les ai tous vus progresser dès la première demi-journée. Soyez en certains : les résultats sont immédiats !  </p>  <p style=\"\">  \t  Vous apprendrez par exemple avec moi la technique du &quot;jetez-rassemblez-supprimez&quot; pour structurer votre message, la bonne manière de raconter une anecdote, les 6 techniques d&#039;accroche pour commencer votre intervention, et bien d&#039;autres choses...  </p>  <p style=\"\">  \t  J&#039;ai structuré ce cours autour de trois grandes thématiques :  </p>  <span>  <ol style=\"\">  \t<li><span>Comme</span><span>nt organiser vos idées pour que votre public reparte avec vos trois grands messages</span></li>  \t<li><span>Les te</span><span>chniques pour mettre en valeur et donner du relief à vos messages grâce à des outils simples et très facilement applicables</span></li>  \t<li><span>Commen</span><span>t débuter pour donner à votre public l&#039;envie d&#039;écouter la suite grâce aux techniques d&#039;accroche</span></li>  </ol>  </span>  <ul style=\"\">  </ul>  <p style=\"\">  \t  Une heure de cours en vidéo, des exercices pratiques au cours desquels vous allez plonger directement dans votre thématique, des documents synthétiques et des rappels réguliers : vous quitterez ce cours avec infiniment plus de confiance en vos capacités à convaincre.  </p>", 
    "end_date": null, 
    "title": "Prendre la parole en public : structurez votre message", 
    "price": "20.00", 
    "instructors": "Pascal Haumont", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414046_2abc_2.jpg", 
    "course_url": "https://www.udemy.com/prendre-la-parole-en-public-structurez-votre-message/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T11:30:00Z"
}