{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Le scénario se répète de la même manière à chaque fois : <strong style=\"\">vous devez prendre la parole en public et cela vous stresse</strong>. Vous ne savez pas vraiment comment vous préparer et vous sentez une grosse boule à l&#039;estomac au moment de vous retrouver face au public. <strong style=\"\">Les premières secondes sont difficiles</strong> : vous cherchez un peu vos mots, vous ne savez pas quoi faire de vos mains et votre voix tremble un peu.</p><p style=\"\"><strong style=\"\">Vous avez tendance à évacuer un peu vos idées</strong> en allant peut-être trop vite et vous vous retrouvez à la fin de votre prise de parole plutôt frustré(e). On vous dit « c&#039;était bien » mais <strong style=\"\">ça ne vous satisfait pas</strong>.</p><p style=\"\"><strong style=\"\">Vous êtes loin d&#039;être seul(e)</strong> ! Tout le monde a eu le trac avant de parler, tout le monde a trouvé ça compliqué de mettre à la fois son corps, son visage, sa voix et ses mots au service de son message, <strong style=\"\">tout le monde a déjà ressenti de la gêne à l&#039;idée d&#039;être jugé par le public</strong>…</p><p style=\"\">En réalité, il faut bien comprendre que ça n&#039;a jamais été facile pour personne.Mais certaines et certains ont eu le tempérament pour prendre les choses en main : ce sont celles et ceux qui ont compris que <strong style=\"\">sans un travail spécifique sur leur posture, sur leur voix et sur les bons mots à utiliser, ils resteraient au point mort quand d&#039;autres remporteront l&#039;adhésion de leur public</strong>.Peut-être est-ce votre cas, peut-être avez-vous cherché la bonne méthode, les bons conseils pour progresser. Mais peut-être vous êtes vous heurté à ce qu&#039;on vous a rabâché depuis toujours : il y a des gens qui sont bons à l&#039;oral et d&#039;autres qui ne le sont pas. C&#039;est comme ça.</p><p style=\"\">C&#039;est faux !</p><p style=\"\">Parce qu&#039;<strong style=\"\">on ne naît pas orateur : on le devient</strong>. C&#039;est ce que j&#039;ai compris il y a des années, à l&#039;époque où j&#039;étais ingénieur en informatique et où je me suis penché sur la question. Mes lectures, les formations que j&#039;ai suivies et la pratique du théâtre et de l&#039;improvisation théâtrale m&#039;ont porté pour progresser plus que je ne l&#039;espérais.</p><p style=\"\">Grâce à cette expérience et aux 1000 stagiaires que j&#039;ai formés au cours de ces cinq années, j&#039;ai créé <strong style=\"\">cette méthode qui s&#039;appuie sur du pratique : je vous donne des vrais trucs que vous ne trouvez pas ailleurs pour progresser</strong>. Cette formation en ligne est <strong style=\"\">la seule qui aborde de manière complète tous les aspects de la transmission efficace d&#039;un message</strong>. Elle vous fera faire <strong style=\"\">un bond en crédibilité</strong> et <strong style=\"\">vous assurera de convaincre votre auditoire</strong>.</p><p style=\"\">Je vous livre tout ça <strong style=\"\">en vidéo</strong>, avec <strong style=\"\">des exemples concrets</strong>, <strong style=\"\">des exercices efficaces</strong> et <strong style=\"\">des techniques facilement applicables</strong>.</p><p style=\"\">Vous y verrez par exemple :</p><ul style=\"\"><li style=\"\">les 3 choses à mettre en place <strong style=\"\">avant même de parler</strong></li><li style=\"\">ce qu&#039;il faut <strong style=\"\">faire de vos mains</strong> quand vous vous exprimez</li><li style=\"\">comment <strong style=\"\">il faut respirer</strong> pour avoir une voix qui fait autorité</li><li style=\"\">la différence essentielle entre <strong style=\"\">le rythme et la rapidité</strong></li><li style=\"\">comment <strong style=\"\">éliminer vos tics de langage</strong></li><li style=\"\">comment appliquer la méthode du <strong style=\"\">« je vais dire – je dis – j&#039;ai dit »</strong></li><li style=\"\"><strong style=\"\">les mots à éviter à tout prix</strong> pour être crédible</li><li style=\"\">comment il faut <strong style=\"\">commencer pour accrocher votre auditoire</strong></li></ul>", 
    "end_date": null, 
    "title": "Prendre la parole en public : jouez votre rôle avec talent", 
    "price": "25.00", 
    "instructors": "Pascal Haumont", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527688_51b8.jpg", 
    "course_url": "https://www.udemy.com/prendre-la-parole-en-public-jouez-votre-role-avec-talent/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T22:50:59Z"
}