{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li> This course is written and presented by the author of the groundbreaking book (Random House) and audio set (Sounds True Audios), <em>Be Heard Now! Tap Into Your Inner Speaker and Communicate with Ease</em>, </li></ul><p><strong></strong>Imagine standing in front of any audience, feeling               absolutely at ease and enjoying their rapt attention. Whether you have public speaking anxiety or simply want   to express yourself with greater clarity, this program will effortlessly transform the way you communicate to groups and individuals by focusing on the<strong> </strong>essential first   step missing in conventional public speaking trainings — true attunement between leader and listeners. Our relationship-based approach gives you all the support you need to discover how to express yourself clearly and influence others in your own unique style.</p><p>This course is designed for experienced speakers as well as beginners with a message and information that improves the lives of others. Through 21 five-minute interactive lectures each transmitting a critical leadership skill keyed to upcoming interactions in your day, you will practice and internalize how to:</p><ul><li>Attune with groups instantly and compel rapt attention without performing, every time.</li><li>Listen as you speak and \"speak into the listening\" so that your listeners feel seen.</li><li>Develop your natural magnetism to improve the quality and clarity of your business presentations and relationships.</li><li>Ease any\nanxiety around speaking in public.</li><li>Find\ncomfort in natural silence.</li><li>Be an enlightened leader in your everyday life.\n\n\n </li></ul>", 
    "end_date": null, 
    "title": "Public Speaking Ease Through Luminous Listening", 
    "price": "35.00", 
    "instructors": "Lee Glickstein", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687536_5a23_3.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-ease-through-luminous-listening/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T23:50:55Z"
}