{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>¡Más de 4200 ESTUDIANTES! Curso actualizado </strong>en Junio del 2015<br></p><p><strong>¿Será que en secreto deseas obtener </strong><strong>mas de la vida? </strong>Para muchos puedes parecer feliz y exitoso, pero internamente sabes que aún no has expresado tu potencial completo. Y te duele cuando te das cuenta de esto.</p><p>Tal vez nunca has pedido ese aumento bien merecido. O siempre has evitado hacer una presentación en un cuarto lleno de personas importantes. Has permanecido  \"detrás del escenario\". Competente, pero completamente invisible.</p><p>Pero hay un murmullo en tu cabeza que te pide que hables. <strong>Quieres salir de tu elemento. </strong>¿Y tu mensaje? Sabes que tienes uno – sin embargo, hay algo que no te deja hacerlo en grande y brillar tan fuerte como lo podrías hacer. ¿Qué es eso?</p><p>La respuesta es: eso es diferente para cada uno. Pero la buena noticia es que no es tan difícil  encontrar esa caja, abrirla y dejar que las mariposas vuelen.</p><p>¿Pero tú qué ganas con esto? ¿Es fama? ¿Es Dinero? ¿Más reconocimiento profesional? Sí, todo eso es verdad…pero en realidad ganas una cosa invaluable, que es, el regalo que viene con la expresión de tu ser real de la manera más efectiva y motivadora ante un  gran número de personas posible. Eso es un regalo para ti, pero también es un regalo para nosotros.  Si tú te minimizas, no nos haces un favor a ninguno de nosotros, como lo ha dicho la gran Marianne Williamson. </p><p><strong>¡Hola! Soy Alexa</strong></p><p>La mayor parte de mi carrera he sido actriz de televisión, hasta el momento en que me di cuenta que la vida en el escenario de un programa no cumpliría mi deseo de ayudar a la gente. El trabajo del actor es sobre la interpretación de la conducta humana. Es sobre estudiar lo que lo mueve. Es sobre comprender los obstáculos que tiene para cumplir sus deseos. Me encanta actuar, pero me entristeció ver el impacto que la industria de entretenimiento tiene sobre una persona normal. He visto muchas personas que se destrozaban haciendo la comparación entre ellos y las celebridades retocadas con efectos aerógrafos. Me di cuenta que era tiempo de entrar en lo  desconocido y comenzar a enseñar.</p><p><strong>La verdad es:</strong></p><p>Los actores son justamente como tú y yo. De hecho, cada persona de este planeta ha nacido para brillar. Has venido a este mundo con una pasión y un objetivo. Puede ser que no lo conozcas todavía, pero sabes que es tiempo de cambiar algo. Imagina que en tu versión más valiente podrías:</p><ul><li>Tener el coraje de pedir lo que quieres.</li><li>Tener la tenacidad de no rendirte.</li><li>Entrar en un cuarto y sentirte seguro y tranquilo.</li><li>Expresarte sin esfuerzos.</li><li>Dominar la atención del público.</li><li>Obtener un gran nivel de autenticidad y honestidad.</li><li>Usar TODAS tus habilidades actuales, pero de una mejor manera.</li><li>Crear nuevas maneras y creativas para compartir tu negocio.</li><li>Comenzar a crear tus propias oportunidades.</li><li>Hablar delante de la cámara con facilidad.</li><li>Parar la conversación negativa de tu mente de una vez por todas.</li></ul><p>Cuando te deshaces de tus miedos y tus dudas, de verdad empleas tu  poder. Cuando te conectas con tu objetivo, enciendes tu pasión. Cuando construyes tu confianza, te mueves en la dirección de tu destino.</p><p><strong>Simplemente, cuando te iluminas, el mundo lo observa y las oportunidades aparecen, sin esfuerzos.</strong></p><p>Pero el primero y el más importante aspecto de este proceso es tener la voluntad de comenzar. ¿Estás listo? ¿Estás listo para dejar la sombra y salir a la cálida  luz del sol – y sentir la diferencia en cada aspecto de tu vida?</p><p>Yo estoy lista. Estoy lista para que tú lo hagas. Y de verdad creo que podrás hacerlo. No tienes que hacerlo solo. Comencemos ahora. Juntos.</p><p><strong>¿Cuáles son los requisitos?</strong></p><ul><li>Naciste calificado para este curso. No hay ningún requisito. <strong></strong></li><li>Como un extra, te recomiendo traer un corazón compasivo, una mente curiosa y un espíritu disponible.<strong></strong></li></ul><p><strong>¿Qué voy a obtener de este curso?</strong></p><ul><li>¡Más de 50 clases y 5.5 horas de contenido!<strong></strong></li><li>Crear una persona dinámica y expresiva, que irradia autenticidad.<strong></strong></li><li>Conectarte con el poder de los pensamientos positivos para construir tu confianza.<strong></strong></li><li>Dominar la voz de la duda que ha sido un lastre para ti en el pasado.<strong></strong></li><li>Involucrarte en conversaciones fácilmente y ágilmente.<strong></strong></li><li>Presentarte dinámicamente, a ti y a tu negocio.<strong></strong></li><li>Aprender habilidades de comunicación para sobresalir en el mundo de los negocios.<strong></strong></li><li>Presentar tu mensaje con pasión y propósito.<strong></strong></li><li>Inspirar al público a través de la cámara.</li><li>Crear grupos de  aficionados<strong></strong></li></ul><p><strong>¿Cuál es el público </strong><strong>a quien va dirigido</strong><strong>?</strong><strong></strong></p><ul><li>Cualquier persona que alguna vez soñó  vivir en grande, pero aún no tiene la confianza para hacerlo.</li><li>Alguien que sabe que vive en este planeta para hacer una diferencia.</li><li>Una persona que está lista para dar el salto hacia el éxito, pero necesita de una mano amiga.</li><li>Empresarios, emprendedores, y otra persona que necesita presentarse al mundo.    </li></ul><p>Gracias!!!!!</p><p>Alexa</p>", 
    "end_date": null, 
    "title": "Radia Confianza: Cómo Crear una Presencia a 1000 Vatios", 
    "price": "40.00", 
    "instructors": "Alexa Fischer", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527288_84eb_2.jpg", 
    "course_url": "https://www.udemy.com/radia-confianza-como-crear-una-presencia-a-1000-vatios/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T07:04:18Z"
}