{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Leadership is a widely known topic that has been researched an debated for years. We will take a look at a leadership style that is becoming more popular and that companies are realizing is a successful type of leadership. </p><p>Master the elements of Servant Leadership in order to become a better leader in your personal and professional settings. Become a better leader by putting others first. You will see the difference you can make in other people's life while becoming a successful leader. </p><p>This course is structured in a self-pace learning style. You are able to watch each lecture at your own pace and even re-watch lectures as needed. There are also activities throughout the course to help you evaluate your strengths and areas of opportunity as a leader. </p><p>After taking this course you will be able to:</p><p>1) Explain what Servant Leadership is</p><p>2) Explain the history of Servant Leadership</p><p>3) Understand the Principles of Servant Leadership which include, People First, Character/Doing The Right Thing, Leading with Humility, Leading with Effective Listening and Empathy, and the Commitment to the Growth of Others. </p><p>4) Understand how moral purpose is needed in Servant Leadership </p><p>Approach this course with the readiness to understand the concepts and be able to start applying them in your everyday life. <br></p>", 
    "end_date": null, 
    "title": "Servant Leadership", 
    "price": "20.00", 
    "instructors": "Savannah Boyles", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627482_4541_3.jpg", 
    "course_url": "https://www.udemy.com/servant-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T22:41:45Z"
}