{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Clear River Biblical Studies brings you cutting edge curriculum enabling you to launch, connect, protect, and grow your next small group while expanding your churches attendance through exponential growth.  Whether you have never led a small group or are the small groups coordinator at your church, this course is for you.  While using models and methods currently taught at the graduate level in Seminaries, your instructor breaks down the content in clear, concise, and easy to understand terms so that you can have a full understanding of the concepts you need to holistically launch and grow your next small group. </p><p>You will not only gain access to high definition video content, but also receive a proprietary eBook that goes along with the course lectures.  The curriculum is broken up in three sections—Connection, Protection, and Growth. In each section, enabling skill-sets are taught so that you will be able to connect individuals together, foster a protective environment in which people can be open and honest without fear, and finally, propel your members in next RIGHT steps towards Jesus.  So many small group members are either never challenged to grow in their relationship with Christ, or worse, pushed to far to quickly, thus ending in attrition of the member. This course will teach you how to plan a person's next RIGHT step, ensuring that they are challenged in a way that will carry them along in relationship rather than pushing them out the door.  Enabling you to avoid these pitfalls, models are introduced such as Bruce Tuckman's 5 Stages of Team Development, Putnam and Harrington's SCMD model (Share, Connect, Minister, and Disciple) as well as their 5 Stages of Discipleship model.  </p><p>This course reflects hours of research at the graduate level and will take your small group ministry to new heights.  As with any Clear River Biblical Studies course, your satisfaction is guaranteed. If for any reason this course does not meet you expectations, a 30-day money back guarantee is included.  Their is no risk and I encourage you to take the next step in propelling your ministry to the next level.  We hope to see you in the first lecture where we give you an in-depth overview of the course material!  </p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Small Group Leadership", 
    "price": "20.00", 
    "instructors": "Brandon Frank", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649326_7329_2.jpg", 
    "course_url": "https://www.udemy.com/small-group-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T02:53:28Z"
}