{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>We like to talk to people. And why not.</p>\n\n<p>We want to feel good by talking to people .</p>\n\n<p>Talking.</p>\n\n<p>Communicating with people.</p>\n\n<p>Talking with a group of people and actively taking part in the group conversation.</p>\n\n<p>We all want to do this.</p>\n\n<p>It would be better if it's THAT easy.</p>\n\n<p>You are walking in a room full of people. You wonder how to join a group.</p>\n\n<p>You look at people sharing jokes and wonder how effortlessly these people are doing conversation!</p>\n\n<p>You want to talk to someone but physically you are trying to hide behind the crowd.</p>\n\n<p>You look at a person entering in the room and everybody notices that.</p>\n\n<p>You look at a person who is the life of the party.</p>\n\n<p>You feel shy and feel like 'I wish I can easily talk to anyone, anywhere and anytime' no matter what.</p>\n\n<p>Our parents asked us to make more friends.</p>\n\n<p>As grow older, we want to connect more and more people.</p>\n\n<p>We want to impress people.</p>\n\n<p>We wish people know us and call when they want to feel good.</p>\n\n<p>Nobody showed you how to talk. </p>\n\n<p>You believe, \"That's just the way I am.\"</p>\n\n<p>Now, if you think the same, you can now change your game.</p>\n\n<p>How to Talk to Anyone is video course that shows exactly how to improve your conversation skills with anybody... and be able to apply those lessons to EVERY conversation you have...naturally and automatically.<br></p>\n\n\n\n\n\n<p>This isn’t mere theory. By the end of the course, you’ll feel comfortable talking to anybody around you — whether it’s setting limits with an overbearing family member, getting a stern boss to become your ally, or even deepening your relationship with your friends or significant other.</p>\n\n\n\n\n\n\n\n<p>And unlike other skim-the-surface material, I’ve gone deep into the psychology of conversational skills at the highest levels.</p>\n\n\n\n\n\n\n\n<p>We cover how we can be more likeable and make new friends, become a better leader, and connect with everyone we meet.<br></p>\n\n\n\n\n\n\n\n<p><strong>No fluff — this is real, practical, hands-on training</strong><br></p>\n\n\n\n\n\n\n\n<p>You don’t learn social skills from a book. In this course, you’ll learn the exact words, body language, and even subtle “connection” strategies to use. </p>\n\n<p>You are going to learn to talk to anyone, anywhere and  anytime. </p>\n\n\n\n<p>Let me share with you in this course.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Talk to anyone, anywhere and anytime?", 
    "price": "20.00", 
    "instructors": "Mayur Bardolia", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822080_de43.jpg", 
    "course_url": "https://www.udemy.com/how-to-talk-to-anyone/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T16:01:25Z"
}