{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        Hopefully, we've all experienced the exhilaration of being part of a successful team, clicking on all cylinders. Now it's our turn to create that experience. We've been newly appointed to a leadership position or we have aspirations to lead others.  Where do we start?  It's not that easy.  We also remember that dreadful time as part of a dysfunctional group.  It can't be happenstance.  There must be a process toward successful team building, right?  In this course, we'll examine that process by enumerating successful team characteristics and understanding team dynamics and their impact. Here is where I will present my pan flute leadership model. You'll love it!  But wait, we're not finished.  It's not good enough to simply create the world's greatest team, we also have to know how to maintain this team.  We will learn about the two pitfalls common to all teams, the two blunt truths we must know as leaders, and the four rules of great team performance.  </p>  <p>  \t    We will accomplish this in fifty minutes through lecture, training aids, and Keynote slides.  Bring an open mind, prepare to learn some new approaches, and enjoy the class.  At the end of this presentation, you'll be prepared to form your own giant killing team, ready to take on the world.  I guarantee that there is nothing more fulfilling than watching a team work together as a cohesive group.  I also guarantee that this won't be boring!  So sign up and be prepared to dazzle.  </p>", 
    "end_date": null, 
    "title": "That Great Team Environment:  How Do We Get There?", 
    "price": "20.00", 
    "instructors": "John R. Bieber", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403014_a818.jpg", 
    "course_url": "https://www.udemy.com/that-great-team-environment-how-do-we-get-there/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T16:48:13Z"
}