{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tWhen you go through crisis and having a hard time, you get stuck in emotions and habits who are slowing you down.  </p>  <p>  \tLearn our proven system and the \"easy to use\" tools you need to move on in your life after being stuck due to different crisis.  </p>  <p>  \tYou reclaim your self-respect and get your power back.  </p>  <p>  \tBy the end of this 5-week challenge, if not before, you get back in control, you take charge, you feel great.  </p>  <p>  \t<strong>You get back in mental and physical balance and you renew your mindset and create a successful future</strong>.  </p>  <p>  \tWhen you learn the foundation of the 4 masculine archetypes. King, Warrior, Magician and Lover, and you handle your procrastination habits with the effective tool of EFT.  \t You achieve the perfect balance between your mind and body.  </p>  <p>  \tYou prioritize your thinking processes and you eliminate your procrastinations. You take valuable decisions and you get things done according to your plans and goals.  </p>  <p>  \tYou are present and balanced in your mind and body and you feel unstoppable.  </p>  <p>  \tYou respect yourself and others respect you too.</p><p>  \t That is true masculine leadership.  </p>  <p>  \t<strong>Content and Overview</strong>  </p>  <p>  \t<strong>The course is structured in 5 weeks.</strong>  </p>  <p>  \t<strong>The first week</strong> you will learn the course concepts and tools - the 4 masculine archetypes and clear out your archetype core values and you learn about Emotional freedom technique (EFT). This will give you the strong foundation to guarantee your success.  </p>  <p>  \t<strong>The second week</strong>, we start with activating the King archetype in you, to establish your personal leadership. The purpose of this week is to put your attention on your subconscious procrastination habits, learn how to handle them and prioritize your tasks.  </p>  <p>  \t<strong>During the third week</strong> you will access your inner magician  \t Search deep inside and connect the dots.  \t Check up on your motives for your procrastinations and clear out fear of change. You will learn our easy to use procrastination elimination formula.  </p>  <p>  \t<strong>The fourth week</strong> is about accessing your warrior archetype.</p>  <p>  \tYou learn how to reclaim your personal discipline and how to get in shape.  </p>  <p>  \tIncrease your testosterone level and get in shape.  \t Feed your body and use your body.  </p>  <p>  \tYour body need to be fit and ready to act swiftly without hesitation with both dedication and concentration.  \t You need energy, vitality and stamina to get your results. In this week you will be challenged with physical exercises and you get valuable nutritional advices to boost your testosterone levels.  \t On the mental part you will be given EFT tool to eliminate laziness.  </p>  <p>  \t<strong>The 5 week. </strong>Open your lover archetype.</p>  <p>  \tLearn the art of receiving without feeling compelled to give something in return.  </p>  <p>  \tLearn the art of compassion and gratitude  </p>  <p>  \tYou will learn how to substitute your lack-of-something attitude and complaining with compassion and gratitude.  </p>  <p>  \t<strong>You will complete each week of the course by evaluating and celebrate your achievements.</strong>  </p>  <p>  \tAnd you get directions on how to apply the tools that you have learned and how to carry on with your new positive habits.  \t You will find your own unique way to use them successfully on your own.  </p>  <p>  \tThis is your four step to your true masculine personal leadership.  </p>  <p>  \tThank you for being brave and disciplined enough to take on this curse.  </p>  <p>  \tAnelia and Karl-Otto  </p>", 
    "end_date": null, 
    "title": "Train Your True Personal Masculine Leadership", 
    "price": "25.00", 
    "instructors": "Karl-Otto Sandvik, Anelia Mitseva", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413160_7121_2.jpg", 
    "course_url": "https://www.udemy.com/true-personal-masculine-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T13:57:23Z"
}