{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Leadership is at the core of organisational growth, strength and structure and creating formidable leadership in a changing world needs not only the knowledge of leadership, management, identifying direction, making decisions and motivating people but also requires the need to move away from a structure of hierarchies and status quo.</p><p>As human beings, your limitations to achieve anything at all, stems not from your lack of intellectual or physical abilities, but through your thought processes. </p><p>The learning objectives for you in this course, include gaining an insight on how you can identify your own emotions and manage their impacts on performance. You will understand other people&#039;s emotions and have an improved awareness of others&#039; feelings, points of view, and learn how to use emotional intelligence to lead effectively to create change, motivate others and boost competence levels among and within your teams. </p><p>This course will equip you with tools and techniques for basic self-management, habit change, increasing personal success and better management of interpersonal relationships. </p><p>The concept of leadership that is appropriate to organisations and businesses in a constantly changing society then, is the one that recognises the power of connection, networking, interactivity, feedback, innovation and the willingness to adapt to change while being open to new knowledge.</p><p>This significant change in leadership reflects the transformations that are occurring in the society within which we live now. The concept of 21st century societal transformation recognizes that there will be times when traditional leadership ideas are appropriate and time when an emerging, new type of leadership is appropriate. This new leadership is called “transformational leadership&quot; or Master Capacity Building leadership, as some leadership experts will refer to it. </p><p>This course will focus on the increasing need for transformational leadership for organisations and business settings with the aim of achieving total success for this leadership style using emotional Intelligence (EI). This is to share a world of interdependency which will require people to think systemically, make multiple connections, design parallel processes, and look for value in what others say and do.</p><p>Emotional Intelligence has the ability to help people think differently, be less subjective about their feelings and emotions, hence pave way to openness to new ideas, innovation and link diverse people in collaboration to foster genuine growth and transformation, where everyone can be the best of themselves. </p><p>&#039;We can&#039;t solve problems by using the same kind of thinking we used when we created them.&#039;</p><p>Albert Einstein</p>", 
    "end_date": null, 
    "title": "Transformational leadership manual for beginners", 
    "price": "50.00", 
    "instructors": "Mutiat Adebowale", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522484_8d84.jpg", 
    "course_url": "https://www.udemy.com/transformational-leadership-manual-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-07T12:13:42Z"
}