{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Superior Leadership Inspires Followers That Genuinely Want To Follow, where Non-Leaders Lead Those Who Believe That They Need To Be Led.</strong></p>\n\n<p>Influential Leadership will be recognised in a Leader's ability to encourage positive action in others and create an environment where everyone has the same opportunity to grow, learn and make more efficient progress in life.</p>\n\n\n\n\n\n<p>Most leaders can get people to achieve some things, but influential leaders will enable people to want to achieve more things. The prominent leader focusses on nurturing the talents and abilities of others to create positive and lasting change in some way.</p>\n\n\n\n\n\n<p><strong>Throughout Ultimate Influence: The Way of Superior Leadership, you'll learn how to:</strong></p>\n\n\n\n\n\n<ul><li>Leverage your lifetime’s experience to engage with and inspire others.</li><li>Demonstrate integrity, credibility, &amp; honesty to earn the trust of others.</li><li>Harness your ability to influence &amp; bring out the best in others.</li><li>Deploy the most effective leadership approach in all situations.</li></ul>\n\n\n\n\n\n<p><br></p>\n\n<p>Some people believe that we're either born with genuine leadership skills and qualities, or we're not. Throughout this course, you'll develop the confidence for making wiser and more important decisions, building the right alliances and leading your people through the certain seasons of personal or professional change.</p>\n\n<p>You will discover new strategies for becoming more effective at implementing strategy, making decisions, building alliances and leading your people through personal or professional change. Upon completion, you'll have all the insights required for communicating your leadership vision with more clarity, confidence &amp; persuasiveness.</p>\n\n<p>While many Leadership courses focus on developing practical skills, talents and abilities, Ultimate Influence offers a different approach as it will primarily focus on your motives, your core values, and how these will impact others as a direct result.</p>\n\n<p><em><strong>Partnered with a Full Money Back Guarantee, you have nothing to lose by enrolling today to discover exactly what's needed to take your leadership to the next level.</strong></em></p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "Ultimate Influence: The Way Of Superior Leadership", 
    "price": "25.00", 
    "instructors": "Kain Ramsay", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628060_156e_6.jpg", 
    "course_url": "https://www.udemy.com/leadership-course-the-way-of-the-superior-leader/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T16:32:57Z"
}