{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em><strong>Deep personal growth, practical skills, happier relationships, making a difference.</strong></em>  </p>  <p>  \t        The world is complex and can often be confusing.  We all want to live a meaningful life and feel like we can make a difference in the world but where do we start?  Our lives are fast-paced and busy, we have to earn a living, we have families to care for, how can we thrive when we are juggling so much?  </p>  <p>  \t        In this course you will learn practical methods to help you to be more calm, powerful, and compassionate even in the face of life&#039;s difficulties.  The ancient warrior traditions have much to teach us about facing the battlefield of modern life with grace, dignity, and even joy!<br>  \t<br>  \t        This leadership course is a program of deep personal development offered in concise lectures enriched by reading and practical exploration.  It combines teaching of ideas, exploration of philosophical perspectives, journaling and self-reflection, and embodied practices for embedding new ways of being.  The broad topics we will explore are:  </p>  <ul>  \t<li>Leadership</li>  \t<li>Warrior philosophy</li>  \t<li>Respect</li>  \t<li>Integrity</li>  \t<li>Responsibility</li>  \t<li>Embodiment</li>  \t<li>Compassion</li>  \t<li>Sustainability</li>  \t<li>Clear communication</li>  \t<li>State management (stress management &amp; resilience)</li>  \t<li>Values and meaning</li>  </ul>  <p>  \t  There are over 4 hours of video lectures, broken down into bite-sized chunks.  Every section has practices to take away and work with to build real, embodied capacity not just theoretical understanding.  There are various articles to deepen your learning and serve as references, plus 2 e-books, one of which is a printable resource for building appreciation into your life, the other is another deeper dive into the topics explored in the course.  This program offers real development and awesome value for money.  </p>  <p>  \t  If you want to connect to your inner warrior and be the leader of your life, this course is for you.  </p>", 
    "end_date": null, 
    "title": "Warrior Leadership", 
    "price": "25.00", 
    "instructors": "Francis Briers", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326116_5958_2.jpg", 
    "course_url": "https://www.udemy.com/warrior-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T01:40:41Z"
}