{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Your Leadership Evolution Level 1 is a comprehensive &#039;first steps&#039; at leadership through a narrated slide based virtual classroom aimed at current and aspiring middle leaders and those building a team within a small company. Through the course, students can expect to gain a deeper awareness and understanding of the following areas:</p><ul style=\"\"><li>What excellent leadership looks like</li><li>What guiding principles should be followed when starting to lead (or when taking a fresh look at your leadership)</li><li>How we move from &#039;the led&#039; to &#039;the lead.</li></ul><span>There is also some recommended reading at the end of the course to allow students to take further that which they have gained form the course.</span>The course has been specifically designed to facilitate reflection in the form of tasks in response to the content and your own experience. These task take between 5 and 30 minutes. Whilst they are optional, it is strongly advised that you complete them to allow a deeper appreciation for leadership principles and practice.<strong style=\"\">Duration</strong>The course videos take less than a hour due to the concise delivery and specific selection of content. Futon to this there is approx another 1 hour of time build in for reflections through the tasks.<strong style=\"\">Structure</strong><span>There are three chapters that conclude with giving direct support to you in &#039;Starting to Lead&#039;. </span><p>By taking this Level 1 course, students will come to more informed perspectives on leadership and have a short action plan that can be implement on the way to or within a current middle leadership position</p><p></p>", 
    "end_date": null, 
    "title": "Your Leadership Evolution Level 1", 
    "price": "25.00", 
    "instructors": "Nick Burge", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569644_2cc7_2.jpg", 
    "course_url": "https://www.udemy.com/your-leadership-evolution-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Leadership"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T21:14:57Z"
}