{"selfpaced": false, "topic_name": ["Digital Media & Video Games"], "description": "\n\n                    \n                    \n                    In today’s diverse consumer market, illustration exists through many forms of expression breaking with traditional roles of the illustrator. Through a  series of projects, students will explore the translation, production and distribution of their visual ideas. Through the integration of design principles and drawing skills, students gain an opportunity to discover new possibilities for illustrated visual expression in the market.A student should have basic drawing skills, basic digital tool skills (Adobe Illustrator and Adobe Photoshop) and understanding in fundamental design theory, in order to take this class. \n\n                                            Syllabus\n                        Session 1: General Project Process \r\nSession 2: What Is Good Illustration? How do you achieve originality? A good illustration should communicate the right message to the right audience. This session will focus on graphic design principles that make illustration effective for communication. We will also look at artistic expression—your illustration should show your passion!\r\nSession 3: Stylization Tips This session will explore principles of Consistency vs. Randomness: The effective image should have consistency in quality as “unity” to be effective. The effective image should also have unexpected quality otherwise it becomes a “predictable image.”\r\nSession 4: Compositional Study In this lecture, using design principals, I will explain different ways to achieve effective composition in illustration.\r\nSession 5: Digital Tools Demos This session will offer several tutorials in Adobe Illustrator, Photoshop and InDesign, covering basic to advanced techniques for professionally presentable images, including cover some of the most useful functions to create an image.\r\nSession 6: Projects This session will focus on hand-drawn typography using illustration/illustrative typography. Illustrative poster. Illustrative trade ad using a product photo.\n                                    ", "end_date": "2016-04-12T00:00:00Z", "title": "Introduction to Graphic Illustration", "price": 0, "instructors": "Junichi Tsuneoka", "institution_name": ["Cornish College of the Arts"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.kadenze.com/courses/introduction-to-graphic-illustration-iii/info", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Kadenze"], "start_date": "2016-03-01T00:00:00Z"}