{"selfpaced": false, "topic_name": ["Digital Media & Video Games"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    compartsvisual-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    In this 5-week course we’ll introduce the fundamentals of computational arts–covering basic programming, simple image processing and elementary sound recording. This class has been taught for seventeen years at Stony Brook University, and is an accessible introduction to combining arts and computing.We will cover Photoshop CS5 and GIMP, which is a free open-source tool offering the same functionality as Photoshop. Whether you have access to one or the other, you will learn how to create and manipulate digital images, and most importantly, you will become comfortable enough to expand on what you learn here, after the end of our course.You will complete both technical assignments and artistic projects, and learn how to participate in an aesthetic critique. You will be exposed to historical works of art from the 20th and 21st centuries which will offer you a context for your artistic endeavors.Peer review is integral to the success of this class; we will also teach you how to give constructive criticism. By the end of the 5 weeks you should have a strong foundation on how to use computers for image manipulation, and expression of your artistic ideas.Additionally, you’ll create an online portfolio of your digital art projects, and be able to communicate ideas about art.  Each week you’ll watch two video series - one on the theory and one on the practice. There will be technical assignments and artistic projects which will be peer reviewed. We’re looking forward to working with you.\n\n                                            Syllabus\n                        Introduction to Computational Arts: Visuals(Spring 2014)Consortium for Digital Arts &amp; Technology (CDACT)Stony Brook University and CourseraCOURSE INFORMATION Instructors:Dr. Margaret Schedel and Catherine KatsafourosCourse DescriptionThis multidisciplinary production class serves as an introduction to, and exploration of electronic media in the arts. Lectures will cover concepts and presentations of artists working in various capacities with computers, as well as tutorials on specific software packages.PrerequisiteNo prerequisites or prior knowledge needed. Familiarity with computers is helpful but not necessary.Course RequirementsInternet connectionWindows or Apple computerAbility to install software on your machine (admin account)Visual arts software: You may use either Photoshop: http://www.adobe.com/products/photoshopfamily.html or Gimp: http://www.gimp.org/Digication e-Portfolio account (links and details will be provided)Course Learning Outcomes Learners who successfully complete this course will have learned basic skills in Photoshop or Gimp. Throughout the 5-week course, students will learn to give critical feedback to their peers about technical and artistic matters through a grounding in the history of technology and the arts. A digital portfolio will showcase your work from this course.Visual Arts Outcomes:Create, edit, manipulate digital images using the basic functions of visual arts softwareDemonstrate creative/conceptual awareness of visual design through peer critiqueProduce artistic images using software Textbook &amp; Course Materials Required Text: No required textsOptional Texts:Art of the Digital Ageby Bruce Wands ISBN-13: 978-0500286296Publisher: Thames &amp; Hudson\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Introduction to Computational Arts: Visual Arts", "price": 0, "instructors": "Margaret Schedel and ", "institution_name": ["State University of New York"], "commitment": "3-4 hours", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/course/compartsvisual", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-03-03T00:00:00Z"}