{"selfpaced": false, "topic_name": ["Communication Skills"], "description": "\n\n                    \n                    \n                    The final course aims to build learners’ confidence and adaptability when communicating in cross-cultural environments as they assume leadership responsibility to communicate influence in persuasive workplace contexts. The course focuses on enhancing learners’ professional persona for skilful engagement and intercultural communication with stakeholders within and beyond the organization, including cross-departmental work teams, clients and external partners. \nLearners will also discover and apply good practices in organising information, using visual aids and body language for presentations while demonstrating a heightened sense of cultural sensitivity in a given context. In all, learners will acquire skills to demonstrate persuasive verbal and intercultural communication in workplace contexts which may include dialogues and presentations to critical stakeholders and effective task delegation to team members.\n\nAt the end of this course, learners will be able to:\n-\tAnalyse factors of motivation among workplace counterparts.\n-\tRecognise the impact of culture on factors of motivation.\n-\tCritique and craft persuasive verbal communication products (i.e. script of dialogue) for exchanges with work teams and critical stakeholders.\n-\tApply principles of effective PowerPoint slide design with consideration for cultural sensitivity.\n-\tIdentify and adopt strategies on the use of voice and body language for engaging presentations.\n\n                                            Syllabus\n                        Module 1: Communicating Influence in the WorkplaceThis module identifies the causes of motivation, the impact of culture on factors of motivation and the structure of persuasive communication carried out with workplace counterparts.Make Effective PresentationsThis module will apply the principles of effective presentation using visual aids, voice and body language, with consideration for cultural sensitivity.Engaging External Stakeholders and CounterpartsIn this module, learners will acquire negotiation skills in a workplace contexts which may include dialogues and presentations to critical stakeholders and effective task delegation to team members.\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "Becoming Part of the Globalised Workplace", "price": 0, "instructors": "Susan Lee", "institution_name": ["National University of Singapore"], "commitment": "", "subject_name": ["Personal Development"], "course_url": "https://www.coursera.org/learn/intercultural-communications", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}