{"selfpaced": false, "topic_name": ["Communication Skills"], "description": "\n\n                    \n                    \n                    En este primer curso, los participantes conocerán el proceso de una negociación, la naturaleza de uno mismo (capacidades y potencialidades) y la de los oponentes, para establecer negociaciones efectivas, en donde se establece una dinámica de propuestas y transacciones racionales y emocionales, en el marco de la globalización, para generar un ambiente de negociación y cooperación creativa, para diseñar estrategias para lograr resultados de negociación, diseñar argumentos para negociar, saber escuchar y comunicarse y convenir en un intercambio de los recursos y bienes en juego, favorable a los intereses de ambas partes. .\n\n                                            Syllabus\n                        Introducción a las estrategias de negociaciónEste curso está diseñado para ayudarte a lograr mejores acuerdos en tus negociaciones personales y profesionales, ya que las partes que en ellas intervienen se benefician, tanto en la materia de su negocio, como en lo referente a la satisfacción de sus intereses y de sus logros personales. Te presentaremos una gran cantidad de ideas -algunas que se han usado durante siglos para negociar y ya forman parte de la cultura humana- y otras que hemos estudiado, para mostrarte por qué afirmamos que son eficaces. El ambiente mundial de las negociaciones Se mostrará la forma de negociar en la globalización con una justa interdependencia a futuro conveniente a las dos partes y analizando el cambio de globalización a regionalización. Asimismo, se identificará la nueva tecnología para las próximas formas de negociación y los accesos de información que generan una economía del conocimiento que potencializa el futuro de las negociaciones. La negociación como necesidad de vidaSe analizará la negociación como una paradoja de poder que genera un futuro creador o un escenario de destrucción, confirmando los valores éticos para las negociaciones en el marco de nuestro modelo de negociación.La acción profesional de un negociadorSe mostrará el decálogo de las negociaciones que influye en el pensamiento de un negociador profesional. Éste, a su vez, realiza una previsión del entorno futuro para planear, llevar a cabo y dar seguimiento a una negociación que se rige por el poder desplegado y la influencia de paradigmas y de una acción estratégica para contrarrestar la intransigencia y la agresión, en su caso, en una negociación.Los obstáculos en las negociaciones Podrás analizar cómo se presentan en serie los nueve obstáculos en las negociaciones y las estrategias para evitarlos; asimismo, harás el análisis de las recomendaciones para cada caso.\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "Introducción al mundo de las negociaciones", "price": 0, "instructors": "Fernando Guerra", "institution_name": ["Universidad Nacional Autónoma de México"], "commitment": "", "subject_name": ["Personal Development"], "course_url": "https://www.coursera.org/learn/estrategias-de-negociacion", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}