{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">This training deliver an essential introduction for anyone responsible for accident investigation reports within their organisation. The courses introduce the practicalities of incident reporting procedures and explore key concepts such as root cause analysis to provide a broader understanding of why accident investigations can fail to prevent accidents occurring in the future.</span>  </p>  <p style=\"\">  \tThis class is made up of short videos that you can watch at your own pace. There are some practical examples in the courses for the big accidents occurred including Tennirife 1977, Zeeburgge 1987 and Bhopal 1984. All these were due to verdict human error. In this program we will show that such mistakes are actually un-inevitable consequence of deeper rooted problems. In effect most people are set upped to have accidents.  </p>  <p style=\"\">  \tTotal length of the course is about 50 minutes. You may need one hour to take the course with quizzes.  </p>  <p style=\"\">  \tThis course is divided in to two major sections:  </p>  <p style=\"\">  \tSection 1 - Introduction To The Principles of Accident Investigation  </p>  <p style=\"\">  \tSection 2 - Investigation Techniques  </p>  <p style=\"\">  \tEach section starts with and introduction lecture, in which student will learn about the key objectives.  </p>  <p style=\"\">  \tThere is an important summary lecture at the end of each section. In summary you will learn the major key points to remember.  </p>  <p style=\"\">  \tThe root cause analysis will prevent both the reoccurrences of the specific incident under investigation. This will prevent the wide range of unforeseen accidents in your organization.  </p>  <p style=\"\">  \t<strong style=\"\">Reasons to investigate a workplace accident include:</strong>  </p>  <li style=\"\">most importantly, to find out the root cause of accidents and to prevent similar accidents in the future</li>  <li style=\"\">to fulfill any legal requirements</li>  <li style=\"\">to determine the cost of an accident</li>  <li style=\"\">to determine compliance with applicable safety regulations</li>  <li style=\"\">to process workers&#039; compensation claims</li>", 
    "end_date": null, 
    "title": "Accident Investigation", 
    "price": "20.00", 
    "instructors": "Williams Terry", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331412_d966_3.jpg", 
    "course_url": "https://www.udemy.com/accident-investigation/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-30T06:31:58Z"
}