{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><strong><em><em><em><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></em></em></em></strong></strong><br></p>\n\n<p><strong>Your Family Isn't Ready For A Terrorist Attack, Hurricane, Flood, or Tornado ! Will They Survive ? If The Government Collapsed Tomorrow Can You Feed &amp; Protect Them?</strong></p>\n\n\n\n<p><strong>Will They Die Because You Have Idea how to Survive ?</strong></p>\n\n\n\n<p>Disaster preparedness and survival skills are enjoying a resurgence in popularity, not only because of popular movies and television shows, but simply because the world as we know it is becoming more and more chaotic and more and more unstable.</p>\n\n\n\n<p> There have been an increasing number of natural disasters, from tropical storms to earthquakes and wildfires, hurricanes and tornadoes and everything in between and people are becoming more cognizant of these facts, each and every day and have a desire to learn the skills necessary to survive disasters, whether they are natural or man-made, such as a riot stock market collapse or electrical grid collapse. <strong><em>30 Day 100% Risk Free Offer!</em></strong></p>\n\n\n\n<p><strong>Think about these things for a minute ...</strong></p>\n\n\n\n<ul><li>What would you do if there was a terrorist attack that caused mass chaos and panic, and all the stores and places of food were closed? Do you want to be the one that is begging your neighbors, friends, or family for help? Do you want to be shipped off to a FEMA “camp?\"</li><li>Could you provide for your family if severe weather like hurricanes, snowstorms or a flood caused your area to go into a panic -- buying up everything off of stores and creating shortages? What if the stores were empty for weeks… or months?</li><li>Could you protect your family if there were massive power outages or rolling blackouts or brownouts -- disrupting electricity and making it nearly impossible to get food from stores or provide heat or energy in your home?</li><li>What would happen if the road system was destroyed by floods or other natural disasters in your area? Could you survive without food or other essentials for weeks?</li><li>Could you protect and provide for your family if an earthquake hit and the area was devastated?</li></ul>\n\n\n\n<p> Many people mistakenly believe that the  government or emergency services will provide all the help they need.  When the time comes, however, it could take emergency service response  teams hours days, weeks and even months to respond effectively to the  disaster.</p>\n\n\n\n<p> So in the meantime, you and your loved ones will have to fend  for yourselves but, if you don't know how to survive in an urban  environment, this is going to be rather difficult.</p>\n\n\n\n<p><strong><em>Give yourself a fresh start by enrolling in this life-changing course now. Every moment you delay, you lose out. Simple as that.</em></strong></p>\n\n\n\n<p><strong>“WARNING: Your Survival Could Depend On Your Next Choice\"</strong></p>\n\n\n\n<p>  \tThe  Basic survivalist and disaster  preparedness course will teach you everything that you need to know  about surviving a man-made or natural disaster in urban settings.  Everything from medicine to food supplies, shelter building and other  primitive construction, basically everything you need to know to be a  21st-century urban Daniel Boone or Davy Crockett and not only will you  learn to survive in an urban disaster setting but you will learn to  thrive.</p>\n\n\n\n<p><strong>Here's Exactly What YOU Get Inside The Newbies Basic Survival Skills Course:</strong></p>\n\n\n\n<ol><li>How to properly store and can food supplies</li><li>How to pack a bug out bag</li><li>How to navigate using a magnetic compass and topography (landmarks and the environment)</li><li>How to set up and sustain a small urban farm consisting of fruits and vegetables chickens and/or fish</li><li>How to produce alternative sources of electricity and brighten your life through solar wind and human power</li><li>How to make alternative fuel sources such as bio diesel to power your home and increase your travel radius</li><li>How to fortify your home and protect yourself and your family from looters, or worse using dogs battery-operated cameras and floodlights and close quarters combat techniques such as firearms and martial arts</li><li>Even how to keep up morale when you are at your mental breaking point and your spirits are low.</li></ol>\n\n\n\n<p><strong>Click the \"Take This Course\" button, on the top right because every hour you delay is jeopardizing not only your Safety but the Safety of Those You love!!!...Scroll up and Enroll Now!</strong></p>\n\n\n\n<p> It has been said that a person can only survive in any given  situation or environment for 90 days, because after this period of time,  you are no longer surviving in a given environment but living in it.  And in the urban Ranger course will teach you exactly that, how to live  in your new urban environment.  </p>\n\n\n\n<p>P.S. <strong>We're living in some of the craziest times in history and many experts agree that it's not a matter of “if\" but “when\" you will face an emergency that is beyond what you and your family have prepared for.</strong> There's a famous truism among instructors getting soldiers ready for war.<em><strong>“When the bullets start flying, you WON'T rise to the occasion. You will perform half as well as you did during your best training.\"</strong></em></p>\n\n\n\n<p><strong>As with all my courses:</strong></p>\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently <strong>$25</strong>, but will next increase to <strong>$50</strong></li><li>You have unlimited lifetime access at no extra costs, ever</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li><li><strong>30 Day 100% Risk Free Offer!</strong></li></ul>", 
    "end_date": null, 
    "title": "Basic Survival Skills :  Live The Survivalist Lifestyle", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265460_1117_3.jpg", 
    "course_url": "https://www.udemy.com/basic-survival-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T04:50:01Z"
}