{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\"><em><em><em><strong class=\"redactor-inline-converted\"><em>LATEST: Course Updated Again for May  2016</em></strong></em></em></em></strong></strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\">In The Real World, Most People Don't Have A Fully Stocked Retreat They Can Escape To. Even If You've Planned Ahead And You Do, There's No Guarantee That You'll Leave In Time Or That You'll Be Able To Make It There.</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Your First Plan Must Be To Survive In Place. And In the 1st step in Survival is to have a Bug-Out Bag</strong></p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Are You Prepared? Dont Wait 'Till SHTF</strong>  </p>\n\n\n\n<p>  \t  More  and more people are becoming interested survival thanks in no small  part to those hyper reality television shows. So many networks are  putting out these days people are getting prepared for all sorts of  disasters, everything from an earthquake to an electromagnetic pulse  (EMP) global economic collapse hurricanes, tsunamis, typhoons, and  anything in between.  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">30 Day 100% Risk Free Offer! </strong></p>\n\n\n\n<p>  \t As people are feeling more and more uncertain about  what the future will hold. So they want to be prepared, and part of  being prepared means having a \"bug out bag.\"  </p>\n\n\n\n<p>  \t  A  bug out bag is a bag or container containing everything that you would  need to survive for a minimum of 48 hours in your given environment. A  bug out bag usually contains food, water, a small medical kits.  </p>\n\n\n\n<p><em>Achieve a Better and Safer Quality Of Life With More Freedom and Confidence</em></p>\n\n\n\n<p>  \tAny  other medication that may be required a blanket or sleeping bag some way  of making shelter such as a 50 gallon drum bag or a tarp.  </p>\n\n\n\n<p>  \tSome method  of fire starting and water purification such as iodine tablets, and  anything else that you think that you might need in an emergency  situation, and contrary to what television would have you believe a bug  out bag does not need to be (although it can be).  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"> What You'll learn in This Bug Out Bag Course:</strong></p>\n\n\n\n<ul><li>How to select the appropriate backpack, rucksack or container for your situation and environment that fits your body type vehicle, and/or needs</li><li>How to select a water bottle, canteen and water purification system that is best for your situation environment and personal preference</li><li>How to select the appropriate food for your bug out bag so that you will have all of the nutrition and calories necessary to survive your emergency situation in as much comfort as possible</li><li>How to supplement your bug out bag supplies and things from the environment such as wild berries, frogs and rabbits</li><li>How to choose the best fire starting implement, such as matches played and steel or friction, as well as an appropriately sized cooking pot</li><li>How to select the appropriate style and type of clothing for your bug out bag to be used in case of emergency or a spare change of clothes</li><li>How to build a primitive shelter from a tarp plastic bag or dead leaves and branches, as well as how to choose a first aid kit appropriate to your medical needs</li><li>How to choose the appropriate hygiene tools for your bug out bag</li><li>.. and much, much more!</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">So, you've read this far! Thank you. </strong></p>\n\n\n\n<p>  \tTactically outfitted  as though you are Rambo going on a secret mission and they bug out bag  is not restricted to an extreme worst-case scenario. Like the zombie  apocalypse, where you are going to have to \"bug out.\" (Hence the name)  and move to a safer location a bug out bag can be kept in the car or  truck and used during a snowstorm or blackout or windstorm orientation  get a flat tire in the middle of nowhere and have to walk for help, or  any other emergency situation.  </p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">Click the \"Take This Course\" button, on the top right because every hour you delay is jeopardizing not only your Safety but the Safety of Those You love!!!...</strong></em><em><strong class=\"redactor-inline-converted\">Scroll up and Enroll Now! </strong></em></p>\n\n\n\n<p>  \t It is not restricted to one scenario and  is definitely not one-size-fits-all. A bug out bag must be customized  for your personal needs and operational environment so that like the Boy  Scouts you are \"always prepared.\"  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">SEE WHAT STUDENTS ARE SAYING...</strong></p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">\"</strong>An excellent course on how to be prepared </em><em>I am one of those persons who believe that you can never be too prepared and taking this course made me feel much more confident regarding my potential of survival. There is plenty of detailed information on things you need to have in your bug out bag and, most important, why you need to have them. It is a great course if you are interested in learning about how to be prepared for unexpected situations. It is not a simple list of items you should have in your bag, but also how to use them and how to get access to the things you need to survive.\"</em> <strong class=\"redactor-inline-converted\">Debbi Samuels</strong></p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">\"</strong>Great course </em><em>I really enjoyed the material in this course, it was well thought out and had very good suggestions in it. I liked how the instructor went into just enough detail without getting too in depth keeping the course a manageable length. I liked how the material was laid out as well, specifying the most important parts and the why as well as what. I thought the instructor was quite knowledgeable and had good information. He spoke clearly and relative to the slide material. The lectures were quite enjoyable and the addition of text material added greatly to the course.\"</em> <strong class=\"redactor-inline-converted\">Mrs Lisa Court</strong></p>\n\n\n\n<p><em>\"Whether its for broadening knowledge base or self preparedness this course is perfect for you </em><em>This course was fun!I found that the class is perfect for those into survivalistic expeditions; man (woman) against nature. The BOB was a great addition to outdoor activities. I loved all the how tos and tips that were covered; not because it was part of the material but because the reasoning was sound. I did not get the feel that this course was set to sell products which is always a plus. I have read other books and other courses that half way through the sales pitch is inserted and that smile of “oh yeah cool\" becomes the look of utter disdain. This course is exempt from that. I gives you a basic foundation with space to adjust to fit each person and incident need. This is the type of information I welcome, one with space to change it up since every incident comes in variety of cause and effects. Its a great class for those outdoorsy people, safety folk, and for disaster preparedness across the board. Highly recommended.\"</em> <strong class=\"redactor-inline-converted\">Mr. X</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bug-Out Bags are a type of survival kit designed to allow its owner to survive at least three days in the event of emergency, typically evacuating from a disaster zone.</strong></p>\n\n\n\n<p>  \t As Bug-Out Bags have a finite amount of space and the weight of the bag must be worn through potentially life threatening situations, it is of critical importance that survivalists put a lot of thought into exactly what they include in their bag.  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Think about these things for a minute…</strong></p>\n\n\n\n<ul><li>What would you do if there was a terrorist attack that caused mass chaos and panic, and all the stores and places of food were closed? Do you want to be the one that is begging your neighbors, friends, or family for help? Do you want to be shipped off to a FEMA “camp?\"</li><li>Could you provide for your family if severe weather like hurricanes, snowstorms or a flood caused your area to go into a panic -- buying up everything off of stores and creating shortages? What if the stores were empty for weeks… or months?</li><li>Could you protect your family if there were massive power outages or rolling blackouts or brownouts -- disrupting electricity and making it nearly impossible to get food from stores or provide heat or energy in your home?</li><li>What would happen if the road system was destroyed by floods or other natural disasters in your area? Could you survive without food or other essentials for weeks?</li><li>Could you protect and provide for your family if an earthquake hit and the area was devastated?</li></ul>\n\n\n\n<p>  \tForgetting to include a certain item (or enough of it), or carrying too many things can all result in a tragic outcome during an emergency. <em><strong class=\"redactor-inline-converted\">Remember that Bug-Out Bags are designed specifically to sustain a survivalist for at least seventy two hours while they reach their evacuation location, whether it is one's home, a cabin in the woods or their grandparents homestead farm.</strong></em>  </p>\n\n\n\n<p>  \tDeciding or forgetting to include any items on this bug out bag list could mean life or death. Having supplies is only part of the solution though. <strong class=\"redactor-inline-converted\"><em>If you don't have a good plan in place all of your supplies will mean nothing.</em></strong>  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Give yourself a fresh start by enrolling in this life-changing course now.</strong><strong class=\"redactor-inline-converted\">Every moment you delay, your  <em>jeopardizing  your survival </em>. Simple as that. </strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">“WARNING: Your Survival Could Depend On Your Next Choice\"</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">P.S. </strong>We're living in some of the craziest times in history and many experts agree that it's not a matter of “if\" but “when\" you will face an emergency that is beyond what you and your family have prepared for. There's a famous truism among instructors getting soldiers ready for war.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">“When the bullets start flying, you WON'T rise to the occasion.</strong> You will perform half as well as you did during your best training.\"</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">As with all my courses:</strong></p>\n\n\n\n<ul><li><strong>the initial low price will increase shortly - the course is currently $25, but will next increase to $497</strong></li><li>you have unlimited lifetime access at no extra costs, ever</li><li>all future additional lectures, bonuses, etc in this course are always free</li><li>there's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li><li>my help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li></ul>", 
    "end_date": null, 
    "title": "Bug Out Bag: Build the Ultimate Bugout 72-hour Survival Bag", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235478_bb51_3.jpg", 
    "course_url": "https://www.udemy.com/bug-out-bag-list/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T08:44:34Z"
}