{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>LATEST</em>:  Course Updated on 3/7/16.  Over 500 students from over 70 countries are learning about concussions!</p><p>BRAND NEW course on Udemy!  Welcome to the FIRST EVER course on sports concussions!</p><p><span></span></p><p>Learn how you can have a profound impact on the safety of your friends, children, loved ones and athletes by learning the basics of sports concussion awareness from Udemy's <strong><u><em>first ever</em></u></strong> concussion education course!  In this course, we will work together make this mysterious topic a little more friendly.  You will also understand how to be the calm among the storm, should you or someone you know suffer a sports concussion.  <em></em></p><p><strong>Gain a Solid Understanding of Head Injuries and Help Protect Yourself and Loved Ones.</strong></p><ul><li>Learn what a concussion is (and what it is NOT)</li><li>Learn how to recognize a potential concussion</li><li>Learn what to do if you think you may have witnessed a concussion</li><li>Learn What to do after a concussion has been diagnosed</li></ul><p><strong><br></strong></p><p><strong>The Power To Save a Life...Literally In The Palm of Your Hand</strong><br></p><p>Each year, thousands of athletes suffer from concussions.  And every year, several young athletes die from head injuries in sports.  This course will help you \"step up your game\" when it comes to the safety of your athletes, teammates and children.  In this course, you will learn <em><strong>The 3 R's of Layperson Concussion Awareness.  </strong></em></p><p>Head injuries do happen in sports; they are inevitable.  You MUST be able to handle them appropriately.  Will <strong><em>You</em></strong> know what to do when a head injury occurs?  This course will help you answer \"yes\" to this question.  </p><p>This course is perfect for anyone involved in athletics in any way, whether they be a parent, athlete, coach, spectator, official or other.</p><p><strong>Content and Overview</strong><br></p><p>In over an hour of content including nearly 20 lectures and several challenging quizzes, this course will take you through a sequential order of learning.  You will begin by understanding the basics of concussive injury.  More importantly you will continue to understand what it means to spot a potential concussive injury.</p><p>With a firm grasp on the signs and symptoms of a concussion, you will learn what appropriate steps to take should one be suspected.  Finally, you will learn the proper steps to managing a concussion following injury.  </p><p>Upon completion of this course, you will be able to understand and use the tools available to you in order to suspect and react to head injuries in an appropriate, safe and prudent manner.  Enroll now and learn how you can save a life today!</p><p><br></p>", 
    "end_date": null, 
    "title": "Concussions in Sports:  3 Easy Steps to Protect Your Kids", 
    "price": "20.00", 
    "instructors": "Ryan Lowery", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/696764_4e7f_4.jpg", 
    "course_url": "https://www.udemy.com/learn-the-secrets-of-sports-concussions/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T01:50:56Z"
}