{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you an adult who needs to learn to drive?</p><p>This course will teach you exactly how to succeed in getting your driver's license.</p><p>Driving Lessons for Adults is a training course that explains my system for teaching novice drivers. I've used these methods with tens of thousands of students for more than twenty years.<br></p><p><strong>My students usually pass their driver's license road test on the very first try. You should be able to do the same!</strong></p><p>Many driving schools focus on the \"facts &amp; figures\" for their driver education students. They pay the most attention to questions like \"How many feet do your high beam headlights shine?\"</p><p>You need to know those facts to pass your permit exam, but my way of teaching is to emphasize WHY that matters.</p><p><strong><em>My goal for all </em><em>driver education and driving lessons students, is to keep </em>YOU</strong><em><strong> alive on the roads.</strong></em></p><p>Driving Lessons for Adults will help you become a skillful, safe, defensive driver. The 13 lessons in this course will explain how and where to begin your very first driving lesson, all the next stages of driving practice as your skills increase, and how to know exactly when you're ready to drive independently and get your license.</p><p><strong>If you follow my system, you can become a skillful driver without paying for expensive driving lessons with a certified instructor.</strong></p><p>Driving does eventually become a comfortable and easy skill. But it is always a high-risk activity. It's fair to say that when you get a driver's license, you are guiding a 3,000 pound missile. When you're driving a car, you become responsible for the safety of yourself, your passengers AND other people nearby you on the road (in cars, on bikes or even on the sidewalk).</p><p>Too many people over the age of 18 think that they are \"lucky\" if they manage to get a driver's license without much effort.</p><p>All my time as a crash investigator and as a teacher has proven their luck will run out a lot sooner than they think.</p><p><strong>I don't want you to be an adult who gets a license, but has a car crash just a few weeks or months later THAT COULD HAVE BEEN PREVENTED.</strong> That happens a lot, and the costs from car repairs, increased insurance payments, medical treatment, (and even sometimes lawsuits), are something you want to avoid.</p><p><strong>My training system is designed to help you learn to drive following simple methods that work. </strong><strong>My techniques are easy, safe, successful, and also reduce stress for everyone involved.</strong></p><p>Like tens of thousands of my previous students in Minnesota and around the world, you can use my knowledge to become a good driver who knows how to avoid car crashes!</p><p>My mission as a driver educator has always been to save lives, and help us protect each other - because we all share the roads. Today there are far too many badly trained, unsafe, distracted drivers. I want you to be different. <br></p><p><strong>My course, <em>Driving Lessons for Adults,</em> will help YOU be a \"Smarter, Safer\" driver.</strong></p>", 
    "end_date": null, 
    "title": "Driving Lessons for Adults", 
    "price": "30.00", 
    "instructors": "Mike Pehl", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649568_a46c_3.jpg", 
    "course_url": "https://www.udemy.com/driving-lessons-for-adults/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T13:50:37Z"
}