{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">This online wilderness first aid course will prepare you to effectively manage the most common injuries and illnesses that occur in the great outdoors. It has been designed for outdoorsmen and women who wish to better prepare themselves to deal with first aid incidents in the great outdoors. </p><p style=\"\"><strong>Learn and Master the Essentials of Wilderness First Aid</strong></p><p style=\"\"><strong></strong>Wound Care<br>Broken Bones<br>Sprains and Trains <br>Hypothermia and Heat Exhaustion<br>Medical Emergencies</p><p><strong>Essential Topics Right at your Fingertips</strong></p><p style=\"\">Every weekend reports come in of hikers, fishermen, climbers, outdoors people of all kinds getting into trouble due to lack of basic first aid training. Small incidents can easily escalate into potentially life threatening situations should they not be dealt with swiftly and effectively.</p><p style=\"\">I want to teach YOU the essentials of Wilderness First Aid, online, in the comfort of your own home. As an avid adventurer I understand that time is limited and you would rather spend you weekends out doing what you love! This course trims the fat, delivering exactly what you need to know to your laptop, tablet or smartphone.  </p><p style=\"\"><strong>Course Overview </strong><br></p><p style=\"\">Each lecture has a video that cuts right to the chase, explaining in simple terms exactly what you need to know about the topic. </p><ul> <li>24 Video Lectures + Additional YouTube Clips</li> </ul><p>The 24 video lectures cover the most commonly encountered injuries and illnesses that the outdoors person is apt to encounter while out doing what they love. </p><p>We will start with wound care, a seemingly simple topic with all too many misconceptions about what to use and how to do it. <strong>We will go over proper treatment for blisters, lacerations, abrasions and minor infections.</strong> You will finish this section knowing what should be in your first aid kit and how you should use it! </p><p style=\"\">Once we have mastered the essentials of wound care we will move onto musculoskeletal injuries such as Sprains &amp; strains, fractures, and dislocations. We will talk about how to effectively manage them in the field and <strong>show you some cool ways to splint using every day materials you would already have in your pack</strong>! </p><p style=\"\">Preventing heat and cold related injuries is challenging enough when you don't have a broken leg, now imagine you are stuck outside dealing with trauma. Do you have enough in your pack to stay warm during an unexpected night out? Learn the essentials of frostbite, hypothermia, heat exhaustion, heat stroke and sun burn so that you can k<strong>eep your core temperature right where it needs to be</strong>. </p><p style=\"\">Lastly, we will talk about medical emergencies. <strong>Medical emergencies can happen anywhere</strong>. They can happen at your office in the city and they can happen in your tent, 20km from your car. Its important to be able to recognize and assist in the management of common medical conditions such as asthma, allergies and Anaphylaxis, diabetes, heart attack &amp; Angina, stroke &amp; TIAs. </p>", 
    "end_date": null, 
    "title": "Essentials of Wilderness First Aid", 
    "price": "30.00", 
    "instructors": "Morgan Moe", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433292_aaf4_2.jpg", 
    "course_url": "https://www.udemy.com/essentials-of-wilderness-first-aid/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T19:22:41Z"
}