{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t        The essential guide to survival in the wilderness will teach you life saving skills for outdoor survival.  Just by viewing the lecture survival priorities you stand a 50% greater chance of survival, we have set it as a free lecture so this information is available to any one.  </p>  <p>  \t                The course will inspire you to spend time outdoors and begin to learn natures secrets.   With practice your experience of being outdoors will be changed forever as you feel confident connected and part of nature.  </p>  <p>  \t                This course is based on 19 years of teaching experience, over which time Thomas has taught thousands of students and helped to establish 10 other schools teaching these skills,  The course aims to give you a feeling of one to one instruction on these basic survival subjects.  Shelter, water, fire, food, and an introduction to nature awareness subjects such as Tracking and natural movement or stalking. There is a large emphasis on wild edible and medicinal plants and trees also covering some of their utilitarian uses.  </p>  <p>  \t                The course we hope will inspire life long learning in the outdoors.  The material presented is usually taught over a weekend and that is quite an intense experience.  We recommend watching the lectures on a particular subject and then spending some time out doors trying out the skills or downloading it to your mobile device and watching it out in nature!  </p>  <p>  \t               There are over three  and a half hours of lectures though we recommend you take your time with each subject. You will find there is enough information to keep you going with your own experiments for years.  </p>  <p>  \t                For further research please go to the shop at the Trackways web site for book titles that we recommend to take your studies further.  We will be adding more advanced courses in the future.  The course price will rise at the beginning of January to  $199.  </p>", 
    "end_date": null, 
    "title": "Essential guide to survival in the wilderness with nothing", 
    "price": "50.00", 
    "instructors": "Thomas Schorr-kon", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/148350_43c2_6.jpg", 
    "course_url": "https://www.udemy.com/bushcraft-survival-1/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-17T14:30:39Z"
}