{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Though a series of short lectures and exercises, Master Jeremy Roadruck teaches you to how to fall safely, in the privacy and comfort of your own home.   </p><p style=\"\">You don&#039;t have to be in great shape, you don&#039;t have to know anything about the martial arts. You just need a desire to learn to fall safely, and some room to fall down.   Not only will you be learning to fall safely, you&#039;ll also learn how to get up safely - plus simple, practical ways to improve your balance so you don&#039;t fall in the first place.   </p><p style=\"\">Master Jeremy has been teaching this course live since 2008, to ladies and gentlemen of all ages - from 3 to 93, after his own mother fell and ended up conscious in the hospital for 3 weeks. She suffered some brain trauma as a direct result of the fall and it took 2 years of physical therapy and over $500,000 in hospital, doctor, and physical therapist bills to get her upright and healthy again.   </p><p style=\"\">Taking this course could literally save your life, and is the most important self-defense class you should take. You might life your whole life without getting into a physical fight with someone, but if you walk on two legs, the statistics are against you: you WILL fall at some point in your life, especially as you age.   </p><p style=\"\">In fact, after information about the live format of this course was broadcast on the evening news, the TV station received the following letter:   </p><p style=\"\">===START===  </p><p style=\"\">“…I was able to get up and walk away.&quot;  I&#039;m writing today to thank TV2 for a story you ran last week that helped me out of a potentially bad situation.   Libby Kirsch ran a story on Barbara Roadruck, who slipped, fell and has spent the better part of the last two months in the hospital ICU with a head injury. Her son, Jeremy Roadruck is now on a mission to teach people the correct way to fall to protect themselves.  </p><p style=\"\">On Friday evening I was taking our dogs out the front door of our home. When I stepped down off of the landing onto the sidewalk, I hit a hidden patch of ice. My feet went forward out from under me and I immediately knew I was in trouble. That split second went into slow motion. It felt like minutes instead.  Many things flashed through my mind. I knew that behind me and somewhere near where the base of my head would land was the concrete step I had just left.   While my mind was racing through more things than you can imagine, and some thing you can&#039;t, including not wanting to die that way, I was able to focus on Libby&#039;s story and I got my arms down and back, head up and forward and fought off a limp landing. I was able to get up and walk away.  </p><p style=\"\">Please pass my thanks on to Libby, Master Jeremy and TV2 News.  </p><p style=\"\">Tom Kelley, </p><p style=\"\">Director Montgomery County Office of Family and Children First </p><p style=\"\">451 West Third Street, 9th floor </p><p style=\"\">Dayton, Ohio   45422-3100  </p><p style=\"\">The Montgomery County Office of Family and Children First provides administrative support to the Family and Children First Council and Human Services Levy Council. The Family and Children First Council has articulated and built consensus around the following six &quot;Desired Community Outcomes&quot;: Healthy People, Young People Succeeding, Stable Families, Positive Living for Special Populations, Safe and Supportive Neighborhoods, &amp; Economic Self-Sufficiency.  Efforts are underway through Outcome Teams to advance the Vision that “Montgomery County is a place where families, children and adults live in safe supportive neighborhoods, care for and respect one another, value each other, and succeed in school, the workplace and life.</p><p style=\"\">====END====  </p><p style=\"\">We&#039;ll see you in class, soon!</p>", 
    "end_date": null, 
    "title": "Learning to Fall Safely", 
    "price": "25.00", 
    "instructors": "Jeremy Roadruck", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349706_f853_3.jpg", 
    "course_url": "https://www.udemy.com/learning-to-fall-safely/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T15:44:17Z"
}