{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is a starting point for anyone who wants to know \"<strong>Which emergency response system should I buy?</strong>\". </p><p>Emergency response systems (medical alerts) are heavily marketed to \nolder adults and their families, but it is extremely hard to find \nindependent, objective analysis of what differentiates one from another.\n After studying more than 50 of these products, we have found big \ndifferences between individual products, and come to realize that \nchoosing the right product for a specific individual is about far more \nthan just price.\n</p><p><strong>We have distilled the results of hundreds of hours of hands-on \nevaluation, and lots of Googling of websites, into a series of bite-size\n lectures.</strong> In less than an hour of total listening time, this course \nwill give you an introduction to this important but confusing product \ncategory.\n</p><p>From this course, you will learn about:\n</p><ul>\n\t<li>What an emergency response system does and how it works, and for whom it might be useful;</li>\n\t<li>The different \"flavors\" of emergency response system and their strengths and weaknesses; and</li>\n\t<li>The four big decisions (about an older adult and their life style) \nthat let you decide which types of systems are right for that \nindividual.</li>\n</ul><p><strong><br></strong></p><p><strong>Background to this course</strong></p><p><em>Tech-enhanced Life</em> is in the middle of a research project \nstudying personal emergency response systems (PERS) for older adults. We\n want to answer questions like \"<strong>Which emergency response (medical alert) is right for my parent, or for me?</strong>\" And \"<strong>Should I get an emergency response system, or not?</strong>\"\n</p><p>In this course, we provide the results of the first part of this \nresearch project. This introduction will give you the basic tools for \nevaluating emergency response systems. In addition you will get an overview of our research project into \nemergency response systems — including who is doing the work, how we are\n doing it, and how the results will help people like you choose the \nright emergency response system for a specific individual.</p><p>Tech-enhanced Life, PBC is a Public Benefit Corporation with the \nmission of improving the quality of life of older adults and their \nfamilies. Our focus is on finding ways that clever, technology-enhanced \nproducts can help overcome some of the challenges of aging, and \ncompensate for functional decline. So that older adults and their \nfamilies can spend more time doing what they love to do, and less time \ndealing with problems and worrying. </p>", 
    "end_date": null, 
    "title": "Medical Alert Systems for Seniors", 
    "price": "20.00", 
    "instructors": "Richard Caro", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/681082_2947_5.jpg", 
    "course_url": "https://www.udemy.com/medical-alert-systems-for-seniors/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-26T00:18:15Z"
}