{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is about crystalline silica, aka, 'deadly dust'. It covers OSHA's Maritime, General, and Construction Industry standards.</p>\n\n<p>Deadly dust encounters everyone, regardless of where we work and live. It is in the air, and it travels along with dust particles. </p>\n\n\n\n<p>This course not only covers the OSHA standards, it identifies methods of awareness of the hazard and how to prevent it. </p>\n\n\n\n<p>With this course, you will gain insight and expertise on how to identify the hazard of crystalline silica, reduce it, and take action against exposure to it. You will learn how to eliminate it, and protect yourself, and others around you, from the threats and adverse health affects it poses to your health. </p>\n\n\n\n<p>This course is less than one hour and is designed to facilitate a high level of application and retention above similar courses that are much longer. It is designed to enlighten you at your level, with your busy schedule in mind. This course is efficient and quick without compromising the value of your health and safety, while, creating a heightened level of safety awareness, and prevention of the hazard, crystalline silica.</p>\n\n<p>Understanding the gravity of the hazard of crystalline silica ('Deadly Dust'), learn how to be a hero, and save lives and prevent pain and suffering through the employment of effective countermeasures that will battle and even defeat this silent enemy.</p>", 
    "end_date": null, 
    "title": "OSHA Safety Pro: Deadly Concrete Dust. Crystalline Silica.", 
    "price": 0, 
    "instructors": "James Neil", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864546_b7b1_3.jpg", 
    "course_url": "https://www.udemy.com/osha-safety-pro-deadly-concrete-dust-crystalline-silica/", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T11:02:13Z"
}