{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Driving a truck or passenger vehicle for a living can be a very lucrative, financially rewarding business. Without goods and people getting to where they need to go, the world would stop. </p>\n\n<p>This is a quick, less than an hour, course that will pay very high dividends not just financially, but through safe practices that will save lives and costly accidents.</p>\n\n\n\n\n\n\n\n\n\n<p>Use this course to show clients and employers you can be trusted with the financial rewards of safe transportation and driving.</p>\n\n\n\n\n\n\n\n\n\n<p>This course is designed for anyone who drives for a living or is applying to be a driver. The certificate received from this course can be used to show paying clients and employers that you can be trusted with the responsibility of safe motor carrier transportation. </p>\n\n\n\n\n\n\n\n\n\n<p>The course is your once enrolled. You will be able to download it and keep it to build upon your safety program at your place of business, show your management you have what it takes, or use it to train others. </p>\n\n\n\n\n\n\n\n\n\n<p>If a safety program or motor-carrier safety program does not yet exist at your place of business, this is your chance to shine an impress others by using the materials of this course to start one. </p>\n\n\n\n\n\n\n\n<p>Use this course to reap the financial and physical health benefits of moving people and goods, safely over the road. </p>\n\n\n\n\n\n\n\n\n\n<p>God Bless...and Safe Driving.</p>", 
    "end_date": null, 
    "title": "OSHA Safety Pro: Transport Safety. Part 396 of The FMCSA", 
    "price": 0, 
    "instructors": "James Neil", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/855008_d7e2_2.jpg", 
    "course_url": "https://www.udemy.com/osha-safety-pro-transport-safety-part-396-of-the-fmcsa/", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T13:36:25Z"
}