{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is an excellent First Aid Training package for parents and child carers to gain invaluable knowledge at their own time and pace. It also serves as a superb resource for those with English as a Second Language to equip them with the vocabulary and language skills to pass a practical course and to refresh this vital knowledge on a regular basis. If you need an accredited or regulated First Aid training qualification to be Ofsted registered, it is necessary to undertake a practical First Aid course.</p><p>The course consists of illustrated step by step directions, flow charts, diagrams, videos and a short test yourself section fully compatible with all computers and mobile devices. You will be able to stop and start as often as you like and on completion you will be able to print your Certificate.</p><p>It is impossible to cover all eventualities within this course, or to equip you with the knowledge and skills to appropriately diagnose and treat in unpredictable real life situations. If you suspect illness or injury, you should always seek immediate professional medical advice.</p><p>The Author has made every effort to ensure the accuracy of the information contained within the course, however this course is merely a guide and the Author does not accept any liability or responsibility for any inaccuracies or for any mistreatment or misdiagnosis of any person, however caused.</p><p>The course material has been written by Emily Mottershead, Qualified Teacher, First Aid Trainer and Community First Responder with London Ambulance Service in conjunction with St Johns.. If you have any queries concerning this course, please contact 1firstaidtraining@gmail.com</p><p><strong>Course contents:</strong></p><p>Action in an emergency</p><p>Keep yourself safe</p><p>Priorities of Treatment</p><p>Preparing for an emergency</p><p>What to put in your First Aid kit</p><p>Role of the First Aider</p><p>The Primary Survey – How to help in an Emergency</p><p>Unresponsive and Breathing</p><p>Recovery Position</p><p>How to put someone into the Recovery position</p><p>How to put a baby into the recovery position</p><p>Secondary Survey</p><p>Unconscious and not breathing</p><p>Resuscitation – Child</p><p>Resuscitating a Baby</p><p>Breathing Problems</p><p>Choking</p><p>Drowning</p><p>Asthma</p><p>Anaphylactic Shock</p><p>Wounds and bleeding</p><p>Shock</p><p>Treatment of Shock</p><p>Amputated parts</p><p>Eye injuries</p><p>Nose bleeds</p><p>Objects in nose</p><p>Objects in ears</p><p>Bites and Stings</p><p>Animal bites</p><p>Bee Stings<br></p><p>Burns</p><p>Poisoning</p><p>Breaks, Sprains and Dislocations<br></p><p>Types of Fractures<br></p><p>Bandaging<br></p><p>Slings</p><p>Head Injuries</p><p>Skull Fracture</p><p>Compression and concussion<br></p><p>What to look out for following a head injury</p><p>Spinal Injuries</p><p>Fitting / Seizures / Convulsions</p><p>Febrile Convulsions</p><p>Epilepsy</p><p>Extremes of body temperature</p><p>Medical conditions and childhood illnesses</p><p>Meningitis<br></p><p>Diabetes</p><p>Low blood Sugar / Hypoglycaemia</p><p>Final Lesson, Quiz and Certificate</p>", 
    "end_date": null, 
    "title": "Paediatric First Aid Training", 
    "price": "20.00", 
    "instructors": "Emily Mottershead", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728582_d2a5_2.jpg", 
    "course_url": "https://www.udemy.com/paediatric-first-aid-training/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T23:31:00Z"
}