{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Do you want your teenage driver to beat the odds &amp; avoid having a crash within the first few months of having a driver's license?</strong> That's my goal, too. </p><p>I've spent over twenty years training tens of thousands of teen drivers to learn defensive driving skills, and the essential habits of being alert &amp; prepared to avoid the mistakes of other careless or reckless drivers. Learning how to drive is much more than learning the rules &amp; regulations on the driver's permit test. What really matters is knowing how to see hazards that put your life at risk while there's still time to react. </p><p><strong>\"Don't crash\" is great advice, but it's not enough knowledge for any of us these days. </strong></p><p>There are more people driving distracted than ever before, and I want your teen to be prepared with the right kind of practice, and the right kind of knowledge, so that they will NOT be another teen who just \"lucks out\" and gets their driver's license, but then crashes within the first few months. </p><p>The information in this course is what I've used with my own local students for more than two decades. The results I've seen with those young drivers is the basis for my statement that it IS possible for teenagers to be safe drivers. What it takes is the right information, and the right process for training. </p><p>This course has tips for the best possible behind-the-wheel practice, including how to start, how to safely learn freeway ramp entering &amp; exiting, how to practice parallel parking, and how to KNOW that it's really time for your teen to take the road test, without stress when they take the car keys and drive away without you in the car.</p><p><strong>This course WILL help your teenager, or ANYONE who wants to learn to drive in the most efficient, most safe, most successful way I know.</strong> It's results-oriented, and proven over many years and thousands of students.</p><p>My time as a crash investigator is what inspired me to help people understand how to defend themselves when bad situations happen on the road. I saw too many tragedies that didn't have to happen. </p><p>Take the process of helping your teenager learn to drive seriously, because the risks are real, and what many experts regard as the \"normal\" statistics are frankly unacceptable,</p><p>YOUR teen can do better, armed with this information &amp; these training methods!</p>", 
    "end_date": null, 
    "title": "Teach Your Teen To Drive, Stay Alive & Get ROADWORTHY!", 
    "price": "30.00", 
    "instructors": "Mike Pehl", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453972_a208.jpg", 
    "course_url": "https://www.udemy.com/teach-your-teen-to-drive-stay-alive-get-roadworthy/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T17:09:22Z"
}