{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">* Course updated Feb 26, 2015 </strong>  </p>  <p style=\"\">  \t     A new section (Case Studies) and three new lectures!  </p>  <p style=\"\">  \t<strong style=\"\">- Decisive Understanding and Action are critical to a decent recovery -</strong>  </p>  <p style=\"\">  \t                    This course covers toxic mold, and informs the student of the first steps to take upon discovery, and how to approach and proceed towards recovery.  </p>  <p style=\"\">  \t                  Mold toxicity syndrome is a widespread problem, indeed an epidemic, and it is poorly understood. Many doctors are largely unfamiliar with the effects of mold and so the wide range of symptoms that show up in patients are frequently misdiagnosed.  </p>  <p style=\"\">  \t                  Toxic mold is the root cause of symptoms as diverse as:  </p>  <ul style=\"\">  \t<li style=\"\">Flu symptoms</li>  \t<li style=\"\">Chest pain</li>  \t<li style=\"\">Migraines</li>  \t<li style=\"\">Chronic fatigue</li>  \t<li style=\"\">Memory loss</li>  \t<li style=\"\">Brain fog</li>  \t<li style=\"\">Immune system disfunction</li>  \t<li style=\"\">Stomach cramping</li>  \t<li style=\"\">much more...</li>  </ul>  <p style=\"\">  \t        It is bound to be a stressful time when you find that your body, and perhaps your mind, are malfunctioning.  If you are in a living space that is toxic, and all of your possessions are contaminated, again, it is bound to be a very stressful time.  It helps dramatically to be well informed!  </p>  <p style=\"\">  \t                   This course recognizes that someone with the challenge of mold should clearly understand, as soon as possible, the severity of the condition, what they can do about it, and where to go next on their healing journey. This course presents the <strong style=\"\">allopathic</strong> and <strong style=\"\">alternative</strong> medical approaches to recovery from the patient&#039;s perspective so that one can become an effective advocate for one&#039;s own health.  </p>  <p style=\"\">  \t                   About an hour and a half of video lectures are included that cover:  </p>  <ul style=\"\">  \t<li style=\"\">How to handle one&#039;s space and possessions</li>  \t<li style=\"\">The various impacts on the body, including the lungs, sinuses, stomach, liver, immune system, mind and energetic system.  </li>  \t<li style=\"\">Case studies of how others have managed.</li>  </ul>  <p style=\"\">  \t                  All referenced products, tests, and treatments are indexed in the PDF at the end of the course. Feedback is appreciated and will be added to this course in Bonus sections.  </p>  <p style=\"\">  \t                  This course will put you on track to return to health. There is a lot of information in this course that could, quite possibly, strongly influence your recovery...  </p>", 
    "end_date": null, 
    "title": "Toxic Black Mold / Mould Recovery. What you need to know.", 
    "price": "45.00", 
    "instructors": "Mark Johnson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/345776_7a33_2.jpg", 
    "course_url": "https://www.udemy.com/mold-recovery/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-16T01:53:10Z"
}