{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><strong><em><em><em><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></em></em></em></strong></strong><br></p>\n\n<p><strong>Your Family Isn't Ready For A Terrorist Attack, Hurricane, Flood, or Tornado ! Will They Survive ? If The Government Collapsed Tomorrow Can You Feed &amp; Protect Them?</strong></p>\n\n\n\n\n\n<p><em><strong>Will They Die Because You Can't Even Survive 48 Hours on Your Own ?</strong></em></p>\n\n\n\n\n\n<p>Survival and survival training are enjoying a renewed popularity thanks to all the pseudo reality television shows floating around on the airwaves and digital universe. Many people are beginning to wonder again whether or not they have what it takes to survive in the wilderness or deserts or in an urban environment during the man-made or natural disaster. But contrary to popular belief the act of survival is nothing like what is depicted on television or in movies. While it is possible to generate fire by rubbing sticks together to create friction even the most experienced survivalists cannot make it happen in 3 seconds flat in a snowstorm starting a fire with friction takes a great amount of patience and practice and a willingness to survive above everything else. <strong>30 Day 100% Risk Free Offer!</strong></p>\n\n\n\n\n\n<p><strong>Think about these things for a minute ...</strong></p>\n\n\n\n\n\n<ul><li>What would you do if there was a terrorist attack that caused mass chaos and panic, and all the stores and places of food were closed? Do you want to be the one that is begging your neighbors, friends, or family for help? Do you want to be shipped off to a FEMA “camp?\"</li><li>Could you provide for your family if severe weather like hurricanes, snowstorms or a flood caused your area to go into a panic -- buying up everything off of stores and creating shortages? What if the stores were empty for weeks… or months?</li><li>Could you protect your family if there were massive power outages or rolling blackouts or brownouts -- disrupting electricity and making it nearly impossible to get food from stores or provide heat or energy in your home?</li><li>What would happen if the road system was destroyed by floods or other natural disasters in your area? Could you survive without food or other essentials for weeks?</li><li>Could you protect and provide for your family if an earthquake hit and the area was devastated?</li></ul>\n\n\n\n\n\n<p>This  survival 101 course will help you test your mental limits and teach you  how to get in the proper survival mindset for any survival or emergency  situation you might encounter. It will also teach you the basic and  necessary physical skills for survival and help you to separate fact  from fiction when it comes to what is actually possible in a given  survival situation, such as exactly how to find food. </p>\n\n\n\n\n\n<p><strong>Give yourself a fresh start by enrolling in this life-changing course now. Every moment you delay, you lose out. Simple as that.</strong></p>\n\n\n\n\n\n<p><strong>“WARNING: Your Survival Could Depend On Your Next Choice\"</strong></p>\n\n\n\n\n\n<p>Try drinking water  and build a primitive shelter and fire so that you can survive for a  minimum of 48 hours until you can either find help (referred to as a  self rescue) or be found by rescuers (assisted rescue). Although the  minimum is 48 hours, suggested survival time until a rescue can be  affected. </p>\n\n\n\n\n\n<p>It could be as little as little as a few hours or as much as  several weeks, until rescue workers may be able to rescue you. It all  depends on the climate, the weather environment and a whole host of  other factors.</p>\n\n\n\n\n\n<p><strong>Click the \"Take This Course\" button, on the top right because every hour you delay is jeopardizing not only your Safety but the Safety of Those You love!!!...Scroll up and Enroll Now!</strong></p>\n\n\n\n\n\n<p> So the survival 101 course will teach you to take the  basic survival skills that you have learned and perfected one step  further and survive longer than 48 hours. If absolutely necessary on  limited resources and your basic fundamental survival skills to not only  survive but thrive in whatever survival scenario you find yourself in.</p>\n\n\n\n\n\n<p>P.S. <strong>We're living in some of the craziest times in history and many experts agree that it's not a matter of “if\" but “when\" you will face an emergency that is beyond what you and your family have prepared for. </strong>There's a famous truism among instructors getting soldiers ready for war.<em><strong>“When the bullets start flying, you WON'T rise to the occasion. You will perform half as well as you did during your best training.\"</strong></em></p>\n\n\n\n\n\n<p><strong>As with all my courses:</strong></p>\n\n\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently<strong> $35</strong>, but will next increase to <strong>$50</strong></li><li>You have unlimited lifetime access at no extra costs, ever</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li><li><strong>30 Day 100% Risk Free Offer!</strong></li></ul>", 
    "end_date": null, 
    "title": "Wilderness Survival : Survival, Prepping and Preparedness", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265492_0a4c_3.jpg", 
    "course_url": "https://www.udemy.com/basic-wilderness-survival/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T05:43:59Z"
}