{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Добро пожаловать в \"Экстренную акупрессуру\" - лучшее место на Udemy, чтобы узнать как быстро помочь себе и окружающим в экстренных ситуациях!</p><p><br></p><p>√ Помогите себе и своим окружающим в экстренной ситуации, при помощи традиционных китайских точек для массаж</p><p>√ Находите нужные точки легко, используя простые и профессиональные видеозаписи в формате Full HD</p><p>√ Курс изучает точки для борьбы с мышечными спазмами, слабостью и облегчения носовых кровотечений.</p><p>√ Курс изучает точки для борьбы с диабетической комой, укусами насекомых и гипертонией.</p><p>√ Курс изучает точки для облегчения затрудненного дыхания, рвоты и обильной менструации.</p><p>√ Курс изучает точки для облегчения зависимости от погоды, укачивания и насморка.</p><p>√ Курс изучает точки для облегчения головной боли, боли в спине и желудке.</p><p>√ Курс изучает точки для облегчения отравлений, мигреней и усталости.</p><p>√ Курс изучает точки для облегчения аллергии, астмы и чувства страха.</p><p><br></p><p>\"В двух словах, она [Акупрессура] обеспечивает максимальную пользу без риска возникновения побочных эффектов, свойственных многим подходам классической медицины.\" </p><p>-Уильям Майкл Каргайл, бакалавр наук, доктор хиропрактики, F.I.A.C.A., Председатель отдела исследований Американской ассоциации акупунктуры и восточной медицины</p><p><br></p><p><span></span>Экстренная<span></span> акупрессура - это прекрасно подходящий для Вас метод лечения. Используйте его при помощи данного курса. Тогда:</p><p><span></span>+ Вам больше не понадобятся требующие много времени визиты к врачу.</p><p><span></span>+ Не понадобятся ощутимые денежные затраты.</p><p><span></span>+ Отпадёт опасность внесения инфекции, повреждений тела или болей.</p><p><span></span>+ Вы мягко массируете точки пальцем руки. </p><p><br></p><p><span></span>Предлагаемые точки массажа:</p><p><span></span>+ Особенно эффективны</p><p><span></span>+ Находятся легко и без посторонней помощи</p><p><span></span>+ Представлены в профессиональных и высококачественных Full HD видеоклипов</p><p><br></p><p><span></span>\"Используя курс, я смогла избавиться от проблем при носовом кровотечении во время зарубежных путешествий. Благодаря видео, поиск точек не составляет большого труда. Я счастлива, что курс всегда со мной, на моем iPhone и iPad\"</p><p><span></span>-Доктор Умин, Менеджер в компании Siemens, Германия</p><p><br></p><p><span></span>Тысячи людей уже используют этот курс. Теперь Вы тоже можете им воспользоваться и помочь себе без медикаментов и визитов к врачу.</p><p><br></p><p><span></span>За малую долю цены одного визита к врачу, вы навсегда получаете проверенный опытом и временем курс акупрессуры, с бесплатными обновлениями, которые будут содержать новые массажные точки. </p><p><br></p><p><span></span>Проводите время весело, изучая курс! ПРИСОЕДИНЯЙТЕСЬ ПРЯМО СЕЙЧАС!</p><p><br></p><p><span></span>Ваш доктор Баргак</p><p><span></span>- 30 лет успешной практики в акупрессуре</p><p><br></p><p><span></span>У вас есть вопросы? Не стесняйтесь писать мне в Facebook - просто введите Dr. Bargak в поисковую строку</p>", 
    "end_date": null, 
    "title": "Экстренная акупрессура: точки для экстренной самопомощи!", 
    "price": "20.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527230_54ed.jpg", 
    "course_url": "https://www.udemy.com/acupressure-for-emergency-self-healing-russian/", 
    "currency": "USD", 
    "subject_name": [
        "Safety & First Aid"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T04:26:54Z"
}