{"selfpaced": false, "topic_name": ["Course Development"], "description": "\n\n                    \n                    \n                    El curso trata temas fundamentales para lograr diseñar clases desde una concepción constructivista considerando diversidad de experiencias de aprendizaje e integración adecuada de la tecnología.\n\n                                            Syllabus\n                        IntroducciónCapítulo Uno. Conocimiento I: Las Habilidades del CurrículumEste módulo llamado \"Conocimiento I: Las Habilidades del Currículum\", tiene como objetivo reconocer los procesos cognitivos dentro de la construcción del conocimiento en el proceso de enseñanza/aprendizaje.Los contenidos serán mostrados a través de una serie de video-clases. Al terminar de cada video, podrá poner a prueba sus conocimientos a través de una pregunta formativa sin calificación. Para finalizar, deberá responder un cuestionario para evaluar los aprendizajes del módulo.  Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Capítulo Dos. Conocimiento II: Lo que no Enseñamos (conocimiento social y del cuerpo)Este módulo \"Conocimiento II: Lo que no Enseñamos (conocimiento social y del cuerpo)\", tiene como propósito principal analizar cómo afectan en el aula las distintas manifestaciones del conocimiento y su interacción con la cultura. Al igual que el módulo anterior, los contenidos se encontrarán a través de video-clases, las que  contienen preguntas que ponen a prueba cuanto aprendió en cada uno de ellos.Para finalizar, deberá responder un cuestionario para evaluar los aprendizajes del módulo. Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Por último, lo invitamos a elaborar un proyecto individual que será de caracter de peer review, con el propósito que pueda evaluar y aportar al trabajo de sus compañeros. Es una actividad fundamental para la certificación del curso.Capítulo Tres. Construcción del ConocimientoEl tercer capítulo, llamado \"Construcción del Conocimiento\", tiene como objetivo fundamental analizar cómo los alumnos construyen el conocimiento interactuando con su entorno. Mantendrá la misma metodología de los módulos anteriores, en donde lo invitamos a responder cada una de las preguntas al final de los video-clases. Para finalizar, deberá responder un cuestionario para evaluar los aprendizajes del módulo. Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Capítulo Cuatro. Comunicación del ConocimientoEl módulo \"Comunicación del Conocimiento\", tiene como propósito reconocer los elementos claves para comunicar efectivamente dentro del aula. Dentro de este módulo, podrá responder preguntas al finalizar de cada video-clase, que serán de gran ayuda para verificar cuánto aprendió. Para finalizar, deberá responder un cuestionario para evaluar los aprendizajes del módulo. Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Por último, lo invitamos a elaborar un proyecto individual que será de caracter de peer review, con el propósito que pueda evaluar y aportar al trabajo de sus compañeros. Es una actividad fundamental para la certificación del curso.Capítulo Cinco. ¿Qué Significa Entender?El quinto módulo llamado \"¿Qué significa entender?\", tiene como objetivo analizar un modelo que permita comprender cómo entienden los alumnos en aula y cómo medir sus logros. Mantendrá una metodología similar a la del resto de los módulos, en donde lo invitamos a responder las preguntas al finalizar cada video-clases. Para finalizar, deberá responder un cuestionario para evaluar los aprendizajes del módulo. Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Capítulo Seis. Tecnología en AulaEl sexto módulo llamado \"Tecnología en Aula\", tiene como propósito analizar el rol de la tecnología en el aula. Podrá estudiar los contenidos a través de una serie de video-clases, los cuales además contienen preguntas formativas que pondrán a prueba sus conocimientos. Para finalizar, deberá responder un cuestionario para evaluar los aprendizajes del módulo. Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Capítulo Siete. Colaboración en el AulaEste módulo llamado \"Colaboración en el Aula\", tiene como objetivo principal comprender el potencial de la colaboración y la cooperación en aula. Recuerde responder cada una de las preguntas finalizando los video-clases. Para finalizar, deberá responder un cuestionario para evaluar los aprendizajes del módulo. Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Por último, lo invitamos a elaborar un proyecto individual que será de caracter de peer review, con el propósito que pueda evaluar y aportar al trabajo de sus compañeros. Es una actividad fundamental para la certificación del curso.Capítulo Ocho. Diseño de una claseEl último módulo llamado \"Diseño de una Clase\", tiene como principal propósito reconocer los elementos constitutivos de una clase con orientación constructivista.  Al igual que los módulos anteriores, existen preguntas al término de cada video-clase, los que pondrán a prueba cuánto aprendió en cada uno. No olvide responder el cuestionario al finalizar este capítulo, puesto que es requisito fundamental para la aprobación del curso. Para finalizar, deberá participar en la actividad propuesta, que además lo invita a evaluar el trabajo de sus compañeros. Esta actividad es indispensable para la certificación del curso.FinalEn esta video-clase el profesor realiza un resumen de lo visto en los 8 capítulos del curso, haciendo foco en temas de colaboración y cómo la tecnología puede ayudar siempre apoyada en la pedagogía e invitando a que los niños siempre sean el actor principal en la sala de clases.\n                                    ", "end_date": "2016-08-29T00:00:00Z", "title": "Hacia una práctica constructivista en el aula", "price": 0, "instructors": "Miguel Nussbaum Voehl", "institution_name": ["Pontificia Universidad Católica de Chile"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "https://www.coursera.org/learn/aulaconstructivista", "duration": "10 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}