{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>3D GameStudio</strong> <em>(também é chamado de <strong>GameStudio</strong>, ou <strong>3DGS</strong>)</em> é um motor de jogo para criação de jogos em 2D e 3D. Ele suporta duas linguagens de script, bastante semelhantes, lite-C e C-Script. Com ele você poderá criar jogos simples, por ser muito simples.<br></p><p>\n\tAprenda o que é o 3D GameStudio, como baixar e instalar o programa e como começar a trabalhar com ele.\n</p><p>\n\t<strong>Você aprenderá a:</strong>\n</p><ul>\n\t<li>Montar cenários para games, maquetes eletrônicas e muito mais. Depois é mostrado como usar ou criar sua própria textura e aplicar nas paredes, portas, janelas. Aprenda a criar portas e janelas, abri-las com e sem chave.</li>\n\t<li>Criar os scripts de programação no braço.</li>\n\t<li>Colocar chaves para acionar portas e elevadores. Aprenda a colocar e manipular plataformas e elevadores.</li>\n\t<li>Colocar efeitos de partículas: fogo, chuva, som de trovoadas… etc.</li>\n\t<li>Inserir texturas de céu com movimento</li>\n\t<li>Inserir models, armas … Nas armas aprenderá vários efeitos de bala, controle de tiros, fumaça e muito mais!</li>\n\t<li>Criar vidros no Photoshop e colocar no seu game. Assim, poderás criar maquetes eletrônicas ou games com portas e janelas com vidros.</li>\n</ul><p>\n\tAlém disso, aprenderá a programação no 3D GameStudio. Você aprenderá a programar funções, Actions, sons, imagens, partículas, menus, ect… tanto em um arquivo único como separando em camadas.\n</p><p>\n\tA programação é indispensável para você consiga “dominar” o game, assim, poderá fazer literalmente o que você quiser no seu jogo.\n</p><p><strong>A B A I X O     V E J A      O     C R O N O G R A M A    D E S T E     C U R S O</strong></p><p>aula 3514 3d GameStudio - Apresentando o curso de 3dgamestudio<br>aula 3514 3d GameStudio - Baixando e instalando o 3dgamestudio<br>aula 3515 3d GameStudio - Introducao ao 3dgamestudio<br>aula 3516 3d GameStudio - Conhecendo a interface e manipulando um objeto cubo<br>aula 3517 3d GameStudio - Criando o primeiro exemplo<br>aula 3518 3d GameStudio - Criando um cenario tipo cubo no braço<br>aula 3519 3d GameStudio - Finalizando cenario tipo cubo no braço<br>aula 3520 3d GameStudio - Aplicando Texturas ao Cenario standard_wad<br>aula 3521 3d GameStudio - Usando Hollow Cube e Criando a propria textura<br>aula 3522 3d GameStudio - Ajustando Textura com a propriedade SURFACE<br>aula 3524 3d GameStudio- novas texturas e gravando standard_wad<br>aula 3525 3d GameStudio- mais propriedades e texture lock<br>aula 3526 3d GameStudio - Criando portas e janelas  CSG Subtract<br>aula 3527 3d GameStudio - Luz do Sol Map Properties Sun Ambient Elevation Azimuth<br>aula 3528 3d GameStudio - Mais detalhes sombra em objetos e textura surface<br>aula 3529 3d GameStudio - Adicionando claridade com add Light e textura apropriada<br>aula 3530 3d GameStudio - Introducao a linguagem de programacao e personalizando Ceu<br>aula 3531 3d GameStudio - Introducao a texturas Ceu Sky baixando<br>aula 3532 3d GameStudio - Criando Script Resources Script Files Map Properties<br>aula 3533 3d GameStudio - Preferences Configurando Editor de Script SED<br>aula 3534 3d GameStudio - Programando C-Script Sky flags cube visible layer<br>aula 3535 3d GameStudio - Aplicando Diversos SkyCube via programacao C-Script<br>aula 3536 3d GameStudio - Mais SkyCube a5_template_project<br>aula 3537 3d GameStudio - Implementando Ceu SkyDome via programação<br>aula 3538 3d GameStudio - bmap panel d3d Criando uma tela de abertura<br>aula 3539 3d GameStudio - centralizando abertura pos_x pos_y screen_size  wait<br>aula 3540 3d GameStudio - finalizando abertura sleep bmap_purge<br>aula 3541 3d GameStudio - testando e abrindo script criado anteriormente<br>aula 3542 3d GameStudio - Iniciando programacao no braco string function main level_load<br>aula 3543 3d GameStudio - programacao no braco panel path wait sleep bmap_purge visible<br>aula 3544 3d GameStudio - programacao no braco sky freeze_mode unico arquivo<br>aula 3545 3d GameStudio - include organizando programacao em varios arquivos WDL<br>aula 3546 3d GameStudio - lidando com a posicao da câmera<br>aula 3547 3d GameStudio - fireworks para importar e exprtar imagens<br>aula 3548 3d GameStudio - criando tela menu do jogo no fireworks e botões<br>aula 3549 3d GameStudio - criando no braco arquivo menu WDL<br>aula 3550 3d GameStudio - criando botoes iniciar sobre sair Over Up<br>aula 3551 3d GameStudio - inserindo button via programação<br>aula 3552 3d GameStudio - programando e criando funcoes para os botões<br>aula 3553 3d GameStudio - mouse_mode ativando mouse e executando funcao sair<br>aula 3554 3d GameStudio - finalizando programacao no braco Menu ON_ESC<br>aula 3555 3d GameStudio - Abertura de fundamento feita no photoshop<br>aula 3556 3d GameStudio - Instalando e usando a versao 7 do 3dgamestudio<br>aula 3557 3d GameStudio - Templates e testando codigos e exemplos em ambas versões<br>aula 3558 3d GameStudio - Inserindo Objetos Pre Fabricados<br>aula 3559 3d GameStudio - Finalizando objetos pre fabricados<br>aula 3560 3d GameStudio - MED model editor objetos animação<br>aula 3561 3d GameStudio - usando modelos warlock pistol cbabe outros<br>aula 3562 3d GameStudio - baixando modelos e usando no cenário<br>aula 3563 3d GameStudio - Criando o primeiro jogo Player_walk a5_template_project<br>aula 3564 3d GameStudio - Adicionando arma e configurando ela weap_m16 mira<br>aula 3565 3d GameStudio - Adicionado inimigos e configrando acoes para eles<br>aula 3566 3d GameStudio - Armas Weapons Action GUN skill flags Rotate Silent Bob Repeat<br>aula 3567 3d GameStudio - Armas Skills Ammotype Bulletspeed municao balas velocidade<br>aula 3568 3d GameStudio - Armas Skills Weaponnumber Firetime<br>aula 3569 3d GameStudio - Armas Skills Firemod efeitos<br>aula 3570 3d GameStudio - Armas Skills Firemod via programação<br>aula 3571 3d GameStudio - Criando uma arma tipo revolver via programacao script<br>aula 3572 3d GameStudio - Configurando e testando a arma via programacao script<br>aula 3573 3d GameStudio - Mais Armas Script e Modelos<br>aula 3574 3d GameStudio - Criando uma arma tipo metralhadora e configurando vidas<br>aula 3575 3d GameStudio - Usando AMMOPAC para pegar munição<br>aula 3576 3d GameStudio - Jogo Tiro com Shooter_Project PlBiped01 plBipedWeap00<br>aula 3577 3d GameStudio - Rotacionando Objetos com ent_rorate script<br>aula 3578 3d GameStudio - Criando entidades portas para abrir e fechar no jogo<br>aula 3579 3d GameStudio - Interacao com  o usuario abrindo e fechando portas<br>aula 3580 3d GameStudio - Interacao com  o usuario criando janela abrindo e fechando<br>aula 3581 3d GameStudio - Door skill endpos angulo force velocidade<br>aula 3582 3d GameStudio - Door skill script abrindo e fechando automaticamente as portas<br>aula 3583 3d GameStudio - SCAN scrip manual funcao de evento das entidades<br>aula 3584 3d GameStudio - C_SCAN TILT PAN vetor para posicao e angulo câmera<br>aula 3585 3d GameStudio - C_SCAN scrip manual para abrir porta<br>aula 3586 3d GameStudio - C_SCAN while my pan action portas manualmente<br>aula 3587 3d GameStudio - Sons ent_playsound SOUND arquivos volume<br>aula 3588 3d GameStudio - Criando entidade para abrir porta somente com chave<br>aula 3589 3d GameStudio - trigger_range enable_trigger ent_remove function e action para chave<br>aula 3590 3d GameStudio - msg_show funcionando liberacao abrir porta com chave<br>aula 3591 3d GameStudio - usando door e key do template para liberar porta com chave<br>aula 3592 3d GameStudio - iniciando elevadores e plataformas<br>aula 3593 3d GameStudio - elevadores e plataformas time My Z Action Script<br>aula 3594 3d GameStudio - action criado no braco para subir e descer plataforma<br>aula 3595 3d GameStudio - Finalizando plataforma elevador feita no braço<br>aula 3596 3d GameStudio - movendo plataforma para frente tras lados cima baixo<br>aula 3597 3d GameStudio - action elevator triiger_range keytype force<br>aula 3598 3d GameStudio - girando objetos via programacao script while PAN<br>aula 3599 3d GameStudio - implementando programacao zoom de camera ARC<br>aula 3600 3d GameStudio - zoom bruto e zoom suave programadas no braço<br>aula 3601 3d GameStudio - TGA Vidros Alpha no photoshop e importanto<br>aula 3602 3d GameStudio - janela vidro fixo oriented passable<br>aula 3603 3d GameStudio - banner letreiro identificacao photoshop<br>aula 3604 3d GameStudio - Coloando Animacao Sprites 2d tga pcx<br>aula 3605 3d GameStudio - Animacao Efeito Fogo Easy Particle<br>aula 3606 3d GameStudio - Function e Action Script para Animacao Efeito Fogo<br>aula 3607 3d GameStudio - Efeito luz fogo animacao  script<br>aula 3608 3d GameStudio - via programacao criando efeito chama do fogo<br>aula 3609 3d GameStudio - melhorando codigo para fogo<br>aula 3610 3d GameStudio - chuva efeito usando gotas<br>aula 3611 3d GameStudio - configurando habilidade skill atraves do DEFINE<br>aula 3612 3d GameStudio - entity ent_create criando entidade<br>aula 3613 3d GameStudio - executando musica media_loop volume<br>aula 3614 3d GameStudio - media_stop media_handle parando a musica a reiniciando</p>", 
    "end_date": null, 
    "title": "3d GameStudio crie jogos fantásticos em 100 videoaulas ", 
    "price": "30.00", 
    "instructors": "Neri Neitzke", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/200316_ae5f.jpg", 
    "course_url": "https://www.udemy.com/3d-gamestudio-crie-jogos-fantasticos-em-100-videoaulas/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-16T23:10:05Z"
}