{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>3D Pixel Art for non artist. Crossy Road inspired 3D Modeling. Unity 3D</p><p><strong>Important</strong>: all software used are FREE to download and use on PC and MAC computers (no need to pay, cheers!)<br></p><p>In this course you will learn how to make 3d pixel art just like in the Crossy Road game.</p><p>This course is meant for non-artists. With this course you don't have to be an artist to be able to make great 3d art.</p><p>You will learn how to use free tools to make amazing characters such as the chicken, the baby duck, the tree frog or the zebra.</p><p>You will also learn how to make landscapes, cars, trucks, roads and trees in no time.</p><p>Then you will learn how to add all these objects in the game engine called Unity 3d to make amazing 3d games, just like crossy road.</p><p>Now, this course is meant to make things this super easy for you. All the steps are shown to you in the video lectures, so you cant possibly miss a step.</p><p>And by the way as a bonus, this course includes free downloads of the finished 3D models, that's dozen of them, and all the Unity project as well.</p><p>The skills you will learn in this course can be applied to so many more projects. Invest in yourself by joining this course now</p><p><br></p><p><strong>What is 3D Pixel Art?</strong></p><p>3D Pixel art is a form of digital art, created through the use of 2D-like raster graphics software, where images are edited on the pixel level in the form of blocks. Graphics in most old (or relatively limited) computer, console, graphing calculator and mobile phone video games are mostly 2D pixel art, and now we use the new technologies t have the retro-cool style with the amazing functionality that 3d technology provides. Some famous 3d pixel art video games (voxels) are minecraft , or crossy road.</p><p><strong>Note: </strong>This is the first course in a series to enable you to make amazing mobile games on your own. If you want to make progress, it is recommended to also take my other course on how to make 3D pixel characters and how to animate them within Unity 3D game engine.</p><p>Then it is recommended to follow with the course on how to design, build, program and publish a Crossy Road like game to the app stores using Unity 3D.</p><p>By taking these courses, you will have a solid set of skills to get you to create professional games and can either become a solo entrepreneur or get hired by AAA game studios. </p><p>Enjoy!</p><p>******</p><p><strong>Notes about course reviews:</strong></p><p>Thank you all for the great reviews, I really appreciate it and you all motivate me to do better.</p><p>Now let me answer to the few bad reviews this course got:</p><p>- From Carlos R:</p><p>\"Maybe i'm not the target of the course but I found it pretty easy\"</p><p>My answer to this comment: <strong>This is an introductory course for non-artist, if you have experience in 3D modeling or in using 3D pixel art voxel software, this course is not for you</strong>. <strong>If you want more advanced techniques, take these advanced courses:</strong></p><p>\"3D Pixel Characters Modeling &amp; Animations for all. Unity 3D\" and \"Unity 3D 2016 - Build , program &amp; publish Crossy Road game\".</p><p>---</p><p>- Another comment from Carlos R:</p><p>\"all examples are based on copying crossy road, which is pretty forward. An example from a draw that's not already done in Voxels would be also good\"</p><p>My answer to this comment: \"<strong>The course title says it all, it's about modeling crossy road objects and characters in a 3D pixel art format. If you want more advanced techniques, take these advanced courses:</strong></p><p>\"3D Pixel Characters Modeling &amp; Animations for all. Unity 3D\" and \"Unity 3D 2016 - Build , program &amp; publish Crossy Road game\".</p><p>---</p><p>- Comment from Carlos: \"Also in general missing some theory\":</p><p><strong>This is not a course about theory, it's a hands-on project where you get things done, if you are looking for a theoretical course, this course is NOT for you.</strong></p><p><br></p><p>---</p><p>Another student left a 1-star review, got the course refunded, but did not leave any comments why he did so. I wish Udemy would remove useless reviews. Don't you</p><p>***</p><p>Enroll now and make 3D pixel art in no time, ready to use in 3D game engines like Unity 3D or Unreal Engine.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "3D Pixel Art for non artist. Crossy Road Modeling. Unity 3D", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657868_a150.jpg", 
    "course_url": "https://www.udemy.com/3d-pixel-art-for-non-artist-crossy-road-modeling-unity-3d/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T16:00:07Z"
}