{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>JOIN OVER <em>+1,800 SUCCESSFUL STUDENTS</em> WHO HAVE ALREADY TAKEN THIS COURSE</strong></p><p><strong>Take this course, develop your first Android game, and start making money NOW! 100% Satisfaction Guaranteed (<em>or your money back!</em>)</strong></p><p>++++++++++++</p><p>  \t<strong>Did you know that...</strong>  </p>  <p>  \t<em>...</em>mobile games accounted for <em>13 billion dollars in 2013</em>, and on target towards collecting <em>17 billion dollars in 2014</em>? This trend is likely to continue, and we will likely see a huge share of them overall in the coming years. I made this course so that you don't lose this great opportunity to grab a share of this market.  </p>  <p>  \t                                          Writing games for mobile devices is not very difficult, but you might need some assistance in the beginning, and I will help you to make this process much easier. For now our aim will be on Android, one of the well-supported platforms. At the end of this course, you should be able to write on your own and make a living!  \t  \t<strong>Why Android?</strong>  </p>  <p>  \t<strong></strong>As of now, Android has a market share of 61.9% in the U.S. Internationally, this number is even higher: 82.7%. By developing on this platform, you are likely to reach out to a larger audience, increasing the potential for income. Additionally, Google Mobile Ads, with its ability to provide targeted ads from various ad networks based on demographics and location, is way powerful and wide reaching than iAd on iOS, there by increasing the chances of ad revenue. Android's applications are written in Java programming language, a widely used popular modern language, requiring a smaller learning curve compared to Objective C on iOS.  \t  \t<strong>Why 2D games?</strong>  </p>  <p>  \t<strong></strong>3D games are significantly complex compared to 2D. From a programming perspective, 3D requires more math skills. Data structures are complex, animation is hard to program, and the volume of data is much higher, making memory management and app responsiveness a difficult task. Art work for 3D tends to be more complex and the set of skills required is wider. From a design perspective, it is difficult to author levels and level physics. Comparatively, you can develop in 2D much faster with little to no experience in game design.  \t  \t<strong>Why Unity3D software?</strong>  </p>  <p>  \t<strong></strong>Unity3D takes away most of the difficulties associated with a game design. It provides a built in physics engine, which otherwise would require a large amount of effort to develop. Unity3D also provides a rich and sophisticated animation system, with the ability to set up animations on a variety of objects, including humanoid characters. It also provides a built in AI capability for navigation and path finding.  \t  \t<strong>What kind of materials will you find in my course?</strong>  </p>  <p>  \t<strong></strong>This is a course entirely based on videos and a set of tests/homeworks, so that we can test if you successfully acquired the concepts.  \t  \t<strong>How long will it take to complete this course?</strong>  </p>  <p>  \t                                          The course length is of around 3.5 hours, but you will still need to do some research and work on your own. This means that after 6 to 10 hours you will completely master the concepts. Only then you will be able to create your own 2D games!  \t  \t<strong>How is this course structured?</strong>  </p>  <p>  \t                                          I divided the course in five sections:  </p>  <ol>  \t<li>In the first section we will install Unity3D and get it to work with the Android SDK.</li>  \t<li>In the second section we will go on a quick, self-explanatory tour of some of the most important Unity3D features.</li>  \t<li>The third section was created with the only objective of getting you prepared for conceiving your own game concepts.</li>  \t<li>In the fourth section we will create our own Android game. We will create it, build and run it in our device, and eventually upload it to the play store. Step by step!</li>  \t<li>Finally, in the fifth and last section we will build and publish our game, GoHippoGo on the Google Play store.</li>  </ol>  <p>  \t<strong>  \t                            In a nutshell please...</strong>  </p>  <p>  \t                                          Developing 2D Android games is a great way to start earning money and join the elite club of other successful app developers. You will also have a greater satisfaction while doing so. I assure you that I will help you to make this process much easier. Thanks for staying with me during this journey by purchasing this course. You won't regret it!  </p>", 
    "end_date": null, 
    "title": "Android Game Development using Unity: Earn passive income!", 
    "price": "25.00", 
    "instructors": "Jose Lopez Garcia", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/282280_e707_6.jpg", 
    "course_url": "https://www.udemy.com/2d-game-developing-for-android-using-unity3d/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-16T23:03:45Z"
}