{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>\t ***********************************************************************************</p>  <p>\t<strong> COURSE UPDATES ! </strong>  </p>  <p><strong>1300+ Students have already enrolled the course !</strong><strong></strong></p><p><strong>Top Rated Udemy game app making course !</strong></p><p><strong></strong><strong>The price of the course is going to increase from $19 to $99 on 05/08/2015 . So HURRY up and grab a seat and make game apps.</strong></p>  <p>\t<strong>ENROLL The course and publish your game app within hours.</strong>  </p>  <p>\t ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^</p>  <p>\t<em><strong> ***** Have you heard of \"Making android games without coding\" ? ***** </strong></em>  </p>  <p>\t This course will let you create game apps without coding. I had many students those who wanted to create game apps but they where not interested to study codes or for some making game app with codes were hard . So here i am introducing a way to create game apps without coding from scratch to end you do not have to refer anything from anywhere rather than in this course. Everything you need is included in this course..</p>  <p>\t<strong>WHAT YOU WILL GET AFTER COMPLETING THE COURSE ?</strong>  </p>  <ul>\t<li><strong>You will be able to make game app without coding.</strong></li>\t<li><strong>You will be able to get all free resources.</strong></li>\t<li><strong>You can publish each app every weekend.</strong></li>\t<li><strong>You will be able to make a lot of passive income.</strong></li>  </ul>  <p>\t<strong> Yes Here Is The Way To Make Android Game Apps Without Coding ! </strong>  </p>  <p>\t<strong> ************ READ ON ! ************** </strong>  </p>  <p>\t Looking to boost your income as a App developer? Or maybe you're seeking a career change that gives you more free time and flexibility?</p>  <p>\t Then this is the right course for you.</p>  <p>\t<strong> YOU CAN BECOME AN ANDROID GAME APP DEVELOPER </strong>  </p>  <p>\t Android has a huge platform where you can sell your game app and make a lots of money . This course will take you from the very basic concepts of game development using the easy game app making software to the advanced level .</p>  <p>\t<strong> ************** IS THIS COURSE UNABRIDGED ? </strong>  </p>  <p>\t<strong> YES OF COURSE ! </strong> This course is an unabridged edition and everything you need to make game app using this software is completely explained in this course so you don't have to study a bit from outside and you don't want any knowledge in game app development . YES this is absolutely right place for <strong>BEGINNERS</strong> and one who want to make <em><strong>PASSIVE INCOME . </strong></em>  </p>  <p>\t If you want to publish android game app without much effort or any types of coding then this is the right course.</p>  <p>\t You can make more money than you really think by selling the app we are making . I will show you multiple ways to make money from the app that you are making .</p>  <p>\t<strong> HOW MUCH YOU WANT TO SPENT ? </strong>  </p>  <p>\t There is actually no more expenses except signing up for Google play that will just cost you a $25 (Developer account). And we will show you the places from where you can get the resources we want without spending a single dollar.</p>  <p>\t<strong> *********** HOW MUCH YOU CAN EARN ******</strong>*</p>  <p>\t You can earn more than you think. I am the one example of that after studying this method i could create and publish game app every week . So i could make a lot of money without putting more effort . Join this course and follow me and you will make a lot money than you think.</p>    <p>\t<strong> ENROLL THE COURSE NOW AND PUBLISH YOUR VERY FIRST GAME APP. </strong>  </p>", 
    "end_date": null, 
    "title": "Android Game development- Beginner's To Pro-Without Coding !", 
    "price": "20.00", 
    "instructors": "Skill Valley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307726_5779_3.jpg", 
    "course_url": "https://www.udemy.com/make-android-game-apps-without-coding-everyone-can-make/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-25T16:03:07Z"
}