{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Crea Videojuegos para móviles con Stencyl</strong></p><p style=\"\">Este curso enseñará a los estudiantes a <strong style=\"\">crear</strong> sus propios <strong style=\"\">Videojuegos</strong> con el programa <strong style=\"\">Stencyl</strong>, sin necesidad de tener conocimientos de programación.</p><p style=\"\">El curso está dirigido a estudiantes que quieren iniciarse a crear <strong style=\"\">Videojuegos para móviles</strong> y dispositivos<strong style=\"\"> Iphone, Ipad, Android</strong> y quieran resultados rápidos y profesionales.</p><p style=\"\"><strong style=\"\">No se necesitan conocimientos previos</strong> para seguir el curso, creando desde cero y clase a clase las distintas partes que comprende la creación de un Videojuego.</p><p style=\"\">Con las habilidades adquiridas en éste curso podrás por ti mismo hacer juegos asombrosos e increibles de casi cualquier género.</p><p style=\"\"><strong style=\"\">¿QUÉ HAY EN EL CURSO?</strong></p><p style=\"\">1.¡Más de 42 clases y 6 horas de contenido!</p><p style=\"\">2. Al terminar el curso, serás capaz de crear tus propios <strong style=\"\">videojuegos 2D para móviles</strong> y PC. Podrás crear por ti mismo una escena principal desde donde comenzar el juego, después los distintos niveles y al final del todo varios finales diferentes tales como el nivel Game Over y el nivel Bien Hecho Has Completado Todos Los Niveles.</p><p style=\"\">3. Método de entrenamiento visual, ofreciendo a los estudiantes una mayor retención y aprendizaje acelerado.</p><p style=\"\">4. Aprenderás a construir tus juegos de una manera lógica y lineal, pudiendo dedicarte a crear Videojuegos profesionales si más adelante deseas hacerlo, porque habrás adquirido las suficientes habilidades para ello.</p><p style=\"\">5. Podrás crear todo tipo de elementos para tus propios juegos, tales como palancas, interruptores, plataformas, explosiones, fragmentos, disparos, etc. Podrás crear todo tipo de enemigos, colectables, players y droppers y podrás crear elementos aleatorios que dificultarán el juego y crear desafíos como realizar acciones en un corto periodo de tiempo para que el juego no acabe.</p><p style=\"\">6. Adquirirás todas las habilidades necesárias, para que durante el curso, puedas publicar tus creaciones para los móviles con sistema <strong style=\"\">Android</strong> en <strong style=\"\">Google Play</strong> y con sistema iOS en el <strong style=\"\">App Store</strong> de Apple.</p><p style=\"\">7. Serás capaz de construir un juego como el que aparece en el curso.</p><p style=\"\"><strong style=\"\">REQUISITOS PARA EL CURSO</strong>:</p><p style=\"\">1. Un ordenador Mac o Windows donde puedas ejecutar el programa <strong style=\"\">Stencyl</strong>, tanto en su versión gratuíta o la de pago. Cualquier ordenador debería permitirlo.</p><p style=\"\">2. No se necesita ninguna experiencia previa. Totalmente para novatos.</p><p style=\"\">3. Ser un entusiasta de los Videojuegos.</p><p style=\"\">4. Seguir las clases con atención y repetirlas varias veces al dia.</p><p style=\"\">El programa <strong style=\"\">Stencyl </strong>es totalmente gratis y se proporcionará el enlace de descarga de este asi como todos las herramientas que manejemos en este curso (imagenes, fondos, sonidos, etc). Existe una versión de pago de Stencyl que permite subir programas al Google Play y al App Store de Apple, pero la versión gratuita de Stencyl nos permitirá probar nuestros juegos directamente en nuestro Android.</p><p style=\"\"><strong style=\"\">¿QUIÉN DEBERÍA TOMAR ESTE CURSO?</strong></p><p style=\"\">1. Principiantes.</p><p style=\"\">2. Aficionados que quieran crear su primer Videojuego de calidad y <strong style=\"\">multiplataforma</strong> en muy poco tiempo.</p><p style=\"\">3. Desarrolladores independientes en busca de una manera rápida para construir <strong style=\"\">juegos multiplataforma.</strong></p><p style=\"\">4. Estudiantes.</p><p style=\"\">Con este curso en cada video te garantizará una habilidad nueva para perfeccionar tu desarrollo como creador de <strong style=\"\">Videojuegos para móviles</strong> y para PC.</p><p style=\"\">A qué esperas para apuntarte al curso, verás lo sencillo y divertido que es crear Videojuegos para móviles con ésta nueva herramienta que se llama <strong style=\"\">Stencyl.</strong></p><p style=\"\"><strong style=\"\">Apúntate Ya! ¿A qué esperas?</strong></p>", 
    "end_date": null, 
    "title": "Aprende a crear video juegos con Stencyl", 
    "price": "20.00", 
    "instructors": "Jaime Cortés", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478354_c95d_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-crear-video-juegos-con-stencyl/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T19:38:08Z"
}