{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Welcome to Oculus Rift Game Development.</p><p>This course is about creating 3D Virtual Reality Games for your Oculus rift, it is suited for complete beginners to Game Development or people who own an Oculus Rift and want to do more with it.</p><p>The course is over four hours of video and is broken down into easy bite-sized video lessons showing you the complete process of: </p> <ul><li>Thinking about how to design games for the rift</li> <li>How to avoid “Simulator Sickness\"</li> <li>Downloading all the free software required</li> <li>Getting your Oculus Rift working with the latest runtime</li> <li>Using Unity 5 for the first time to create levels and objects</li> <li>Creating visual scripts to control the logic and behaviour of your game</li> <li>implementing immersive effects such as particles and audio</li></ul> <p>You will put your skills into practice by building your very first virtual reality game, a shooting range featuring interactive targets, laser sights and a head tracking weapon. Course resources including 3D models, textures and audio files have also been provided for you.</p><p>When you have finished this course you will have a working game for the Oculus Rift which you can share with the world via the Oculus Rift website.</p><p>Welcome to the future of gaming, become an Oculus Rift Developer, enrol on this course now!<br></p>", 
    "end_date": null, 
    "title": "Become an Oculus Rift Game Developer for beginners", 
    "price": "20.00", 
    "instructors": "Scott Wilson", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613146_b19e.jpg", 
    "course_url": "https://www.udemy.com/oculus-rift-game-development/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T21:16:23Z"
}