{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course teaches students how to build a polished platform game in GameMaker Studio. Students will learn to program in GameMaker Studio's scripting language, GameMaker Language (GML).</p><p>If you are interested in game development, programming, level design, platform games, GameMaker, or indie game creation, this is the course for you.</p><p>It will take roughly 10 hours to complete this course.</p><p>The course is structured in a way that introduces the different concepts of GameMaker Studio one at a time. All of the lectures are video lectures except the very first lecture which contains a download link for the resources you will need in this course.</p><p>This course will build and strengthen your programming and game development skills. By the end of this course, you will be ready to tackle a variety of different video game projects using GameMaker Studio.</p><p>Because this course is for beginners, many people have asked me if it is good for children. I would recommend this course for children if they are at least 14 years old or if they already have experience in programming and enjoy math.</p><p><strong>You must have a Windows operating system in order to take this course. If you are on a Mac you will have to install Windows on a virtual machine.</strong></p><p>Become a game maker today.</p>", 
    "end_date": null, 
    "title": "Become a Game Maker with GameMaker Studio", 
    "price": "30.00", 
    "instructors": "Benjamin Anderson", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498972_df27_2.jpg", 
    "course_url": "https://www.udemy.com/make-a-game-and-learn-to-code-in-gamemaker-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T14:10:15Z"
}