{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Become a Game Developer in 2 hours with Game Maker: Studio</strong></p><p>Learn Game Development with Game Maker: Studio, and in just 2 hours become a <strong>Game Developer</strong>!</p><p>In this course, we use <strong>Game Maker: Studio</strong>, a free program used to develop games. You can download it for free, or you can buy it for more features.</p><p>The Course is structured this way: </p><ol><li>First I introduce you to all important elements of the software.</li><li>Then I teach you how to create these 2 games: An Arcade Shooter and a Top Down Shooter.</li><li>Then there are little quizzes after every section ends, which helps you remember what you were taught.</li><li><strong>NEW BONUS:</strong> A Game Project at the end of the course. It will help you learn Game Maker: Studio more effectively. There is simple explanation along with every line of code. Further you can change the game and make it yours! </li></ol><p>I use simple coding to create games. The programming language used in Game Maker: Studio is called \"Game Maker Language\", often abbreviated as \"GML\". GML is Infact very simple, which is an advantage as it is easy to learn and you can easily master it.</p><p>This course will help you become a game developer. Further, you can create your own games, and you can even sell them, so you can actually earn with games. You just have to start from somewhere; and this is where you start.</p><p>Further, the Instructor is always ready to help you. You can always get your doubts cleared just by messaging me.</p><p>Either you want to learn game development to earn, or to just unleash creativity - This course is for you!</p>", 
    "end_date": null, 
    "title": "Become a Game Developer in 2 hours with Game Maker: Studio", 
    "price": "35.00", 
    "instructors": "Gurpreet Singh MAtharoo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466722_f952_3.jpg", 
    "course_url": "https://www.udemy.com/gamedeveloper/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T16:00:35Z"
}