{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This is a Quick course that will help you learn game development and its fundamental concepts without programming. You will be using a game development tool called Gamemaker Studio. You will also make a single level of a ball game called \"Touch Me Not\" without writing a single line of code. Isn't it amazing?</p><p><strong>What will you learn from a course and why it could be valuable to you?</strong></p><p>This course is based on the Windows version of Gamemaker Studio available form YoYo Games.</p><p>The course will help you build fundamentals for making games using Gamemaker Studio. I will provide you with artwork to re-make a game made in this course. You are free to use the artwork as you wish. While making games, you will not be write any code. You will make game using drag-and-drop approach.</p><p>This course is valuable to you as it will help you learn to make game. You can explore more of your creativity to make more games. This course is just a welcome step for you to learn fundamentals of game development. </p><p><strong>What will students need to know or do before starting the course?</strong></p><p>You will need to sit, relax and make-up your mind to learn game development. You will also need Windows PC to install the Gamemaker Studio. In the second chapter, I teach you how to download and install Gamemaker Studio. I will just need your willingness to learn Game development for you to successfully learn from this course.</p><p>It will be great if you know picture editing tools like Photoshop, Corel Draw, Illustrator etc. But if you do not know this tools then it will be OK as I will be sharing the graphics I have made for this game.</p><p>If you can sketch your own graphics, then Gamemaker Studio has a in-built sprite editor to help you make your own graphics.</p><p><strong>At the end of my course, students will be able to...</strong></p><p>Make a ball game called \"Touch Me Not\" for PC. You can also follow my instructions in real-time as you take this course. Along the journey, you will learn about sprites, objects, backgrounds, sounds, animation effects, actions and events, room etc which are used commonly while making any game.</p><p><strong>Is the software used in this course to make games free or paid?</strong></p><p>In this course we will use the FREE version of Gamemaker Studio available from YoYo Games website.</p><p><strong>What is the difference between free version of Gamemaker Studio and paid version of Gamemaker Studio?</strong></p><p>YoYo Games also has a paid version of Gamemaker Studio. The free version allows you to export games for Windows PC and Gamemaker Player. The paid version for Gamemaker Studio allows you to export games for Android, HTML5, iOS, Mac OS X, Ubuntu and Windows Phone 8.</p><p><strong>What are the limitations of this course?</strong></p><p>I do apologize for some mistakes in spoken English but I have tried my best to explain the concepts and help you learn to make your first game using Gamemaker Studio. </p><p><strong>What are my future plans?</strong></p><p>I look forward to creating project based course for more games in near future so that you can make new games and learn advance concepts along with me as you follow the course. </p><p><strong>What do you need to do to make a game using this course?</strong></p><p>Please be sure to follow the instructors in this course. You will need the working internet connection to download Gamemaker Studio from YoYo Game website. I have covered the walk-through to download and setup instructions in Lecture 2 for Windows PC users.</p><p><strong>I have something more to share with you...</strong></p><p>Once again, I welcome your initiative to learn Game development and believe me when I say,\"Game Development is as easy as cracking the nut. You just need to follow this course and shoot me with questions you may have!\"</p><p>All the artwork and music used in this course is available for you to use.</p><p><strong>Can I take this course?</strong></p><ul><li>If you are a student willing to learn game development and make your own games; this course is for you!</li><li>If you are a web developer willing to learn game development and make your own games, this course if for you!</li><li><span></span>If you are a parent, willing to help your kid learn game development; then this course is for your kids as well.</li><li>If you are a digital-artist willing to make your own artwork and use it in your game, then this course is for you.</li><li>If you are willing to learn the approach to game development, then this course if for you.</li><li>If you are willing to learn about step-by-step ways to convert your game idea into RAW story board, then there are chapters (Lecture 4 and Lecture 5) to explain the concepts of Game Plan  and Resource Plan; which are crucial in converting your game idea into story board.</li></ul><p><strong>Why should I NOT take this course?</strong></p><ul><li>You should not take this course if you are looking for advance concepts in Gamemaker Studio.</li><li>You should not take this course if you are willing to learn about physics, path, advance collision detection, GML (Game Maker Language), surface, tiles, advance animation etc.</li><li>You should not take this course if you are willing to learn programming.</li></ul><p><strong>What should I do if I need guideline for using Gamemaker while learning from this course?</strong></p><p><span></span>You may get in touch with me for any query about making games with Gamemaker Studio or about this course and upcoming future courses!</p>", 
    "end_date": null, 
    "title": "Beginners Game Development NO CODING using Gamemaker Studio", 
    "price": "20.00", 
    "instructors": "Praful Daga", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441102_1851_5.jpg", 
    "course_url": "https://www.udemy.com/beginners-game-development-no-coding-using-gamemaker-studio-praful/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T08:39:22Z"
}