{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hi, and welcome to the Begin Unity Programming course, my name is Yohann and I'm famous for having helped tens of thousands of students to make games and publish them in the app stores. My courses have hundreds of 5 star reviews on Udemy alone. If you want to build a game portfolio, then you found the right instructor.</p><p><br><br>This course is the go to course to get started making games with Unity. If you're either new to Unity or have little experience with it then this course is for you.<br>You will start by familiarizing yourself with Unity's user interface . Then we're learn about key concepts to understand the mechanics used to make professional games, and finally we'll get into the fundamentals of programming using the great programming language called c sharp. Now, if you've never programmed before or if you're not very comfortable with programming, then you're going to like this course. Contrary to most instructors on this platform, I have been teaching programming in University for more than 7 years, and I am confident that this time you will get it.<br>This course is all about hands on training, if you're like me and you'd rather learn by doing rather than listening to a boring instructor then this course is for you.<br>Programming is everywhere, it's inside of games, websites, cars, and even coffee machines. The skills you'll learn here are applicable to so many projects, i can't tell you enough how this course will be key to a better future for you.<br>About the course:<br>The course is broken down in short, easy to digest chunks. Now right at the beginning we go straight into downloading Unity and work on a project that's based on a game that is published in the app stores. You get to work on a real game, not just some random useless project. You can follow along whether you're using a Windows computer, Linux or Mac. </p><p><br>As my current students already know, I'm always around in the forums and I'll be there to help you out whenever you get stuck. But you get a lot more than just the best Unity Programming Beginner's course available online. As a bonus You get a copy of the Unity source code of the Crossy road game clone called Dangerous Lanes that's a famous 3D isometric pixel game. You also get a copy of the Captain Rocket source code that is a fun endless 2D platform runner that you can use any way you'd like. And as a bonus, you get lots of characters and environment object that you can use freely to make your upcoming game look professional. This bonuses are worth well over $500.</p><p><br>Are you ready to be successful at getting into the game development world? Then join me on this exciting journey. Become part of this whole new world of learning skills and fun. The future's bright with Unity, you're gonna love it.</p><p><br></p><li><strong>Why Programming?</strong></li> <br>You may already have used software, perhaps for word processing or spreadsheets like Excel, to solve problems. Perhaps now you are curious to learn how<p> programmers write software and want to make awesome games.</p><p><strong>What is a Program?</strong></p>A <em>program </em>is a set of step-by-step instructions that directs the computer to do the <p>tasks you want it to do and produce the results you want. Unity 3D helps you create that \"program\" that we call a \"game\"</p>", 
    "end_date": null, 
    "title": "Begin Unity Programming ✅", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752446_bc74_3.jpg", 
    "course_url": "https://www.udemy.com/unity-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-04T16:17:34Z"
}