{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is designed to be easily understood by absolute beginners. As a result, it is suitable for a wide range of people, from virtual reality enthusiasts to senior software developers, willing to learn how to develop virtual reality content under Unreal Engine.</p>\n\n<p><strong><strong>Build a strong foundation in the world of virtual reality, and get to know Unreal Engine as a tool to design virtual worlds.</strong> No background required !</strong></p>\n\n<p>Are only recommended, but not mandatory;</p>\n\n<ul><li>PC under Microsoft Windows</li><li>Virtual reality device, such as an Oculus Rift, a Gear VR, an HTC Vive...</li></ul>\n\n<p>This course is about <strong>1 hour long, to get you on tracks as fast as possible.  </strong></p>\n\n<p>The first section of this course is an overview of virtual reality for you to fully understand and master its culture. Theoretical virtual reality topics (definitions, history...) and practical aspects (autopsy of modern devices, ecosystems...) are covered.<br></p>\n\n<p>The second section of this course is fully related to finding your way around Unreal Engine with virtual reality in mind. Again no background required, as we start from Unreal Engine installation steps, to end with running a tweaked virtual reality view.</p>\n\n<p>At the end of this course, you will be able to continue on your own creating basic virtual reality experiences with Unreal Engine.</p>", 
    "end_date": null, 
    "title": "Blend into virtual reality with Unreal Engine - Part I", 
    "price": "20.00", 
    "instructors": "Tiago Sagban", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683268_0dbc_5.jpg", 
    "course_url": "https://www.udemy.com/blend-into-virtual-reality-with-unreal-engine-part-one/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T12:41:02Z"
}