{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          This video course brings to you a great way to learn the use of OpenGL ES and create brilliant games while creating a framework for any future games that you would like to develop. It is enriched with the theoretical foundations of OpenGL ES along with ways to monetize your game so that you can potentially make money through the Play Store.  </p>  <p style=\"\">  \t           You will be introduced to the fundamentals of shaders and how they work in OpenGL, gradually moving into the intricacies of rendering a single cube and developing it to add different types of lighting and texturing. You will also see the implementation of particle effects to explode the cube. Finally, after playing with the key technicalities of building a game and developing the engine, you will put it all together to create the classic game from the 1970s, Breakout, and present it with an edge.  </p>  <p style=\"\">  \t          This video course is all about learning the ropes of making a fun game with your own engine, and then being able to create it yourself.  </p>  <h4><strong style=\"\">About the Author</strong></h4>  <p>  \t<strong style=\"\">Amerigo Moscaroli</strong> is a junior game developer at Race Yourself, a game development company based in London, that deals with creating augmented reality fitness games for Google Glass. He has been an avid gamer since an early age, leading him to pursue a career developing video games. He has a first class Bachelor’s degree in Computer Games Programming from De Montfort University.  </p>", 
    "end_date": null, 
    "title": "Building Android Games with OpenGL ES", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401056_0708_2.jpg", 
    "course_url": "https://www.udemy.com/building-android-games-with-opengl-es/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T11:47:14Z"
}