{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>This video course shows you how to design and build several short games, then code and debug them, and finally publish and share them with the world. This course is a beginner’s guide to learning the basics of computer science and creating your own engaging and interactive games.</span>  </p>  <p>  \t      You will learn how to make a character respond to input from your computer keyboard, and how to get onscreen objects to interact with each other in increasingly complex ways. Along the way, you will create more visual variety, more interactive possibilities, and have more fun.  </p>  <p>  \t<span>Following on from this, you’ll learn how to create a simple catch-and-avoid game, a ball-and-paddle “Breakout” game, a base-defence game, a point-and-click “escape the room” adventure game, and a maze game. You’ll learn to upload or create the artwork, how to control an onscreen object with a mouse, keyboard, or even by waving your hand in front of a webcam. We’ll also cover how to create some animation tricks, such as making a falling ball squish when it hits the floor, and making a character’s mouth move in synch with your own voice. Along the way, you’ll learn important computer science principles, such as if-then loops, iterative design, object-oriented programming, and debugging strategies.</span><br style=\"\">  </p>  <p>  \tWhether you are looking for a gentle introduction to computer science, a first step towards learning about the profession of computer programming, or you just want to have fun making games, this video course is here to help you at every step of the way.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span><strong style=\"\">Dennis G. Jerz</strong>, who holds a Ph.D. from the University of Toronto, is a new media practitioner and digital humanities scholar. He has maintained “Jerz’s Literacy Weblog” since 1999. He is an associate professor in the Humanities Division at Seton Hill University, a small liberal arts school near Pittsburgh. He teaches courses in game studies, digital storytelling, new media, journalism, literature, and writing. His professional publications include a study of the Fortran source code for William Crowther’s original “Colossal Cave Adventure” (thought to be lost for 30 years) and a computer simulation of the York Corpus Christi Cycle (a 20-hour medieval religious pageant). He also edited The Inform Beginner’s Guide, a guide to the programming language Inform 6. He has published papers on the history of blogs, teaching with weblogs, and theatrical representations of technology in American literature.</span>  </p>", 
    "end_date": null, 
    "title": "Building Games with Scratch 2.0", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326278_143c_3.jpg", 
    "course_url": "https://www.udemy.com/building-games-with-scratch-20/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T09:33:42Z"
}