{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>-- JUST RELEASED 2/25/2016</em></strong></p><p>In this course you will learn how to create a Business Tycoon Game from the ground up that is similar to games such as ADventure Captialist. But more importantly, this course is designed to teach critical game development concepts and design patterns.<br></p><p>You can play <strong>AdVenture Capitalist </strong>on <strong>Kongregate </strong>to get an idea of the core game play you will learn to create in this course. </p><ul><li><strong>More than 9 Hours of HD 1080P Instruction with a Bonus Update on the way!</strong></li><li><strong>Learn Important Unity 5.0 UI Concepts</strong></li><li><strong>Great for Beginning to Intermediate Level Game Programmers</strong></li><li><strong>Produced by Odoo Class Videos - Experts in Enterprise Development Tutorials</strong></li></ul><p>Do you enjoy playing Tycoon and other Simulation games? Do you know a little bit about C# and Unity3D but would like to take your Development Skills to the next level? If so, this course is exactly what you are looking for.  Ambitious beginners will enjoy this course.</p><p><strong>Course Overview:</strong> This course focuses on core Game Design and Programming Principals. We use the tools in Unity 3D to create the Interface and Artwork is all from Creative Commons. Our game design only roughly borrows from many of the idle Business Tycoon type games such as AdVenture Capitalist, Cookie Clicker, and Web Tycoon. By the end of the course you will be able to customize the game as you please and we look forward to you sharing your tycoon creations with us. </p><p><strong>What are People Saying about Odoo Class Videos?</strong></p><p><em>First off I want to comment on all of the quality video editions you have recently added to your library. They have been tremendously helpful and I have been recommending your service to many people.</em><em></em><br></p><p><em>- John P</em></p><p><em>I find your videos real easy to follow and often revert back to them as a point of reference…</em></p><p><em>- Peter Y.</em></p><p>This course starts at the beginning but ramps up quickly to teach you important Game Design Patterns that you must know to write professional games:</p><p><strong>Beginning Skills:</strong></p><ul><li>Learn how to create a Unity3D Project</li><li>The entire project is created step-by-step. Start at the very beginning!</li><li>Perfect for those that are new to Unity and Programming in General</li><li>Start right away using Unity 3D's newest UI tools to create a working tycoon store</li><li>Write your first C# script and learn the basics of variables, IF statements, creating a Timer, and other simple programming concepts</li><li>Create an Animated Progress Bar to Show your Store in Operation</li><li>Video exercises along the way help reinforce what you are learning</li></ul><p><strong>Improving Your Business Tycoon Game Features and Your Development Skills:</strong></p><ul><li>Upgrade the Game Design to Handle Multiple Stores</li><li>Create a Game Manager to Better Track Money in the Game</li><li>Learn to Implement Math Functions to Calculate Your Next Store Cost</li><li>Add an Icon for your Store and Learn to Create Dynamic Buttons</li><li>Learn Important Beginner C# Structures and Basic Unity 3D Game Development</li></ul><p><strong>Taking Your Game Development Skills To the Next Level:</strong></p><ul><li>Designed to take you through important design patterns to improve your development skills</li></ul><ul><li>Improve Your Game Manager with the Singleton Pattern</li><li>Use Delegates and Events to implement the Observer Design Pattern </li><li>Refactor your Tycoon Game into a UI Manager</li><li>Use Unity Prefabs to dynamically create your stores at run time</li><li>Learn to Load Game Data from XML! Critical to allowing gamers to create mods</li><li>Learn to build a State Machine within the UI Manager to handle the various interface states within your growing Tycoon Game</li><li>Create a Managers Panel to extend the basic game design and provide a template for you to continue adding features to your business tycoon game</li><li>Perfect for those who wish to see how to implement real game designs so you can apply them to more advanced systems and future Tycoon courses</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Build a Tycoon Business Sim in Unity3D: C# Game Development", 
    "price": "20.00", 
    "instructors": "Odoo Class Videos", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759196_09f8_2.jpg", 
    "course_url": "https://www.udemy.com/build-a-tycoon-business-sim-in-unity3d-c-game-development/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T02:55:46Z"
}