{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Building a 2D Game with GameMaker: Studio will demonstrate everything from the main interface and programming to creating an artificial intelligence, teaching you everything you need to know in order to create your own games in GameMaker: Studio.  </p>  <p>  \t  This course is a step-by-step walkthrough that will showcase GameMaker: Studio and Game Maker Language (GML) through a series of small, practical examples. These examples consist of concise videos that demonstrate the essential programming techniques and concepts that you&#039;ll need to get started in game development.  </p>  <p>  \t  You&#039;ll begin with an overview of the interface to familiarize yourself with it, and steadily work your way towards building a platformer with all the usual trimmings such as a score counter, health monitor, enemies, and even artificial intelligence.  </p>  <p>  \t  You will then learn about things such as animating sprites, using objects, best practices when creating resources, and much more, all of which leads up to creating a platformer game. <br style=\"\">  \t  Building a 2D Game with GameMaker: Studio covers everything you need to use GameMaker: Studio and will lay the groundwork for future games of your own.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<strong style=\"\">Nathan Auckett</strong> is an advanced Game Maker user and has been using the software for five years. He started using Game Maker during its seventh version and ever since has been using the built-in programming language to create his own games. In 2012 he began creating small tutorials on various topics in Game Maker and has since then created over 30 tutorials helping people achieve a variety of different tasks in Game Maker.  </p>", 
    "end_date": null, 
    "title": "Building a 2D Game with GameMaker: Studio", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340402_bca6_2.jpg", 
    "course_url": "https://www.udemy.com/building-a-2d-game-with-gamemaker-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T09:51:37Z"
}