{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Thank you for your interest in this course, my name is Yohann, I will be your instructor.  </p>  <p>  \t  With this course, you get the full source code of an iPhone game called Whack the Frog based on the classic gameplay of “Whack a Mole” where the player uses the hammer to hit as many frogs as possible coming out of the holes.  </p>  <p>  \t  In this course I will show you everything you need to create your very own “Whack a Mole” game, with your original graphics. Now don’t worry if you don’t know how to draw, because you’re provided with all the images you need and you will be shown simple ways to draw images. You will be happily surprised with what you can do!  </p>  <p>  \t  This course is a great way to start learning about the world of mobile application development. In this course you will learn how to download and use Xcode, the software used to make applications. You will also learn how to use and test the game in the iPhone simulator, how to take screenshots, create your own app icons, resize images, how to get the Apple developer license, and for the brave ones, you will also publish your very own “Whack a Mole”* game in the itunes app store without having to write not even one single line of code.  </p>  <p>  \t  With this course, you can create dozen of different games. You can make games using all sorts of animals!  </p>  <p>  \t  So remember, with this course you not only get an education, you also get the full source code of an iPhone game, and 2 working iPhone games named Whack the Frog and Whack the Mole. Fully Playable games!  </p>  <p>  \t  Make the right decision and join us now. Let’s get started.  </p>  <p>  \t * Not affiliated in any way with the Whack-a-mole Hasbro game.  </p>", 
    "end_date": null, 
    "title": "Build a Whack a Mole iPhone Game. Includes Code and Images", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274646_0b52_3.jpg", 
    "course_url": "https://www.udemy.com/build-a-whack-a-mole-iphone-game-includes-code-and-images/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T17:24:22Z"
}