{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>At the end of this short course you'll have programmed your first game. You'll learn gameplay development fundamentals by really doing it – writing and running real code on your own machine.</p><p>Each step of the course has the source code attached exactly as it should look at that time (click \"View Resources\" then \"Downloadable Resources\"), for you to compare to or pick up from, so you can't get stuck!</p><p><strong>Begin Your Game Programming Journey the Proven Way</strong></p><p style=\"\">\"Make the simplest game possible.\" \"Program a ball and paddle project.\" \"Practice by first remaking something from the 1970's.\" All beginning developers hear this advice from more experienced peers... because it works!</p><p style=\"\">By following this approach you will:</p><ul><li>Learn design from a fun classic that people know and enjoy.</li><li>Start your practice today – now! – without waiting for an idea.</li><li>Finish your game in hours or in a weekend, not over months.</li><li>Understand every line of code used in the entire program.</li><li>Avoid distraction from searching for or creating detailed art.</li><li>Master fundamentals needed to make your own games better.</li></ul><p>You can program this game with a normal text editor, and run it in the web browser you already have. No special software is needed.</p><p>Though you'll be coding in JavaScript for HTML5 canvas in this course, the focus is on common game programming concepts. You can later apply these same patterns to get quick results in other programming languages such as C#, Java, ActionScript 3, C++, or Python.  </p>  <p>  \t    I'm a private game development trainer, and for clients new to gameplay programming this is exactly the material that I cover to get them started quickly. Within hours you will have finished programming your first project. This is the fastest way to get results. The momentum gained from doing this provides a solid foundation to give more advanced concepts meaning and context as you continue on in your journey of learning game development.</p><p>(HTML5 Logo in the course image is by W3C, licensed under Creative Commons Attribution 3.0 Unported.)<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Code Your First Game: Arcade Classic in JavaScript on Canvas", 
    "price": 0, 
    "instructors": "Gamkedo Game Development Coach Chris DeLeon", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387820_93f0_5.jpg", 
    "course_url": "https://www.udemy.com/code-your-first-game/", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T17:10:30Z"
}