{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\"></strong><strong style=\"\">Course Description</strong></p><p>Learn to create cross-platform mobile games in 2 hours! Start your journey and create the next big game to hit the market!</p><p><strong style=\"\">Overview:</strong></p><p>Start building your own mobile games without having any experience in programming or game development. This complete course is designed for anyone and everyone who is passionate about creating their own mobile games and doing it quickly. This course will teach you the basics of Construct 2 by creating your very own platform game!</p><p><strong style=\"\">About Construct 2:</strong></p><p>Construct 2 is a powerful ground breaking HTML5 game creator designed specifically for 2D games. It allows anyone to build games — no coding required! It has even won the 1st Annual International Best Game Creator Award of 2014. This engine allows anyone to create games easily and publish them on multiple platforms (Android, iOS, Windows, Mac, Linux, HTML5, Wii U, Facebook, Amazon Appstore and much more) without writing a single line of code.<br style=\"\"></p><p><strong style=\"\">What&#039;s Included?</strong></p><ul style=\"\"><li>Over 30 High Quality (HD) Step-By-Step Video Tutorials.</li><li>Over 120+ minutes of High Quality Video Content.</li><li>Complete Workshop Files (.capx), Graphics and Resources.</li></ul><p><strong style=\"\">What You Will Learn From This Course?</strong></p><ul style=\"\"><li>Creating Objects with Basic AI</li><li>Finding Objects and Finding Paths</li><li>On Screen Touch Controls</li><li>Mastering the Use of Variables</li><li>Adding Music and Sound Effects</li><li>Creating and Adding New Levels</li><li>Adding Load and Save Features to Your Game</li><li>Creating Buttons, Menus and Title Screens</li></ul><p><strong style=\"\">Course Objective:</strong></p><p>After completing this course, you will be able to build and sell your own video games on several platforms like Web (HTML), Windows, Mac, Linux, iOS, Android and much more without restrictions.</p><p><strong style=\"\">What are the requirements?</strong></p><ul style=\"\"><li>Free or Paid edition of Construct 2 is required</li></ul><p><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li>Over 30 lectures and 2 hours of content!</li><li>Create a Complete 2D Cross-Platform Video Game From Scratch without Coding or Prior Experience</li><li>Gain various essential skills in game design and development</li><li>Gain a good understanding of Construct 2 and its features while learning about game development</li><li>Learn everything you need to create your own advanced platformer game</li></ul><p><strong style=\"\">What is the target audience?</strong></p><ul style=\"\"><li>Complete beginners who want to create video games</li><li>Designers who wants to create games without coding</li><li>Anyone who is interested in learning on Construct 2</li><li>Beginners of Construct 2 that need to learn more about it</li><li>Any developer who is interested in creating 2D cross platform video games</li></ul>", 
    "end_date": null, 
    "title": "Construct 2: Learn to Build Mobile Games in 2 Hours! ", 
    "price": "20.00", 
    "instructors": "Connor Marble", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588860_f290_3.jpg", 
    "course_url": "https://www.udemy.com/construct-2-learn-to-build-mobile-games-in-2-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T21:52:18Z"
}