{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>UPDATED 5/27/16</strong></p>\n\n<p>Learn the basic concepts, tips and programming techniques to build fully functional games with the popular visual scripting editor, Construct 2. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Build a solid foundation with programming as this course, and Construct 2, whether you have made games before or not, teaches a structured logic experience. </strong></p>\n\n\n\n\n\n\n\n<ul><li>Learn how to use beginner techniques such as Global Variables, Local Variables and Instance Variables.</li><li>Recognize that as you are making your engines, once challenging concepts like Arrays, Shaders and Functions become easy.</li><li>Find the game feel your games have been missing with very basic controls and techniques.</li></ul>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">A Powerful Tool at Your Disposal</strong></p>\n\n\n\n\n\n\n\n<p>Learning the fundamentals of programming can be frustrating, but that's where Construct 2 comes in and swoops you in off your feet. With the [Free] edition it is easy to learn, has excellent documentation, and is the visual scripting tool your brain has been missing. </p>\n\n\n\n\n\n\n\n<p>Games become your canvas and Construct 2 becomes your paint brush as you will be able to pick up every other language you try. Whether it be, C++, C#, Javascript, Java, Ruby or Pascal, you will find that every programming principle is instilled in Construct 2's editor.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Content You Won't Find Anywhere</strong></p>\n\n\n\n\n\n\n\n<p>Taken from an existing list of over 60 Construct 2 Developers, each game has been specifically picked for those to start with no programming experience to end with your very own advanced game. </p>\n\n\n\n\n\n\n\n<p>Throughout each game you will learn new programming principles that can be applied to any language. Each lecture closes with pseudo code exercises putting your new logic skills to the test and prepares you for your journey.</p>\n\n\n\n\n\n\n\n<p>Starting with the basics of programming and taking you through variables, groups, behaviors, events and actions, you will establish an incredibly strong understanding of programming.</p>\n\n\n\n\n\n\n\n<p>Students completing this course will have the knowledge to create anything they want. Construct 2 doesn't limit you to only games, you can make mobile apps, advertisements, web apps and you can export them to any platform. Windows, Linux, Mac, Wii, iPhone, Android, Facebook, Kongregate, Scirra Arcade and more!</p>\n\n\n\n\n\n\n\n<p>Complete with working files and samples, you'll have unlimited access to me as you work through each concept, and each game to achieve the certificate of completion upon finishing this course. </p>", 
    "end_date": null, 
    "title": "Construct 2 - From Beginner to Advanced - Ultimate Course!", 
    "price": "35.00", 
    "instructors": "Jeremy Alexander", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639984_c5e1_3.jpg", 
    "course_url": "https://www.udemy.com/construct-2-from-beginner-to-advanced-build-10-games/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T03:52:52Z"
}