{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><b>DO YOU WANT TO START CREATING VIDEO GAMES? HAVE YOU BEEN PUTTING OFF CREATING YOUR GREAT GAME?</b></p><p>Many people dream of creating an amazing video game that brings an incredible experience, but most people will not even start their project for various reasons ! For some it takes too long, and for others, learning to code is too difficult! This course, however, is for eager learners who want to stop putting off their game, and start making it a reality!</p><p>If you are reading this, you are already many steps ahead of those who will never develop their games. I want to show you how to start creating video games for <b>DESKTOP COMPUTERS AND MOBILE DEVICES</b>, and features to implement to make money from these games! What are some benefits of using Construct 2 to create games?</p> <ul><li>It is <b>EXTREMELY TIME EFFICIENT </b>and you can therefore create your game more quickly!</li> <li>There is no <b>NO CODING KNOWLEDGE REQUIERED!</b></li> <li>Construct 2 is an <b>OUTSTANDINGLY SIMPLE</b> piece of software to use!</li></ul> <p>If you are looking to make a great game and maybe even make some money with that game, then you will want to work through this course! </p><p>I want to remind you that for you there is <b>NOTHING TO LOSE! </b>If you choose at some point within the next <b>30 days</b> of purchasing this course that this wasn't quite the material you were looking for, you have the ability to <b>GET A FULL REFUND. NO QUESTIONS ASKED!</b></p><p>I would encourage you to message me personally before taking such action, as I would be more than happy and willing to assist you with any concerns or questions, and would love to hear ways to improve this course!</p><p>Don't hesitate any further! Create the game you have been wanting to create! Do the work that you enjoy! <b>Use this course to help you get there. This will be the first great step towards succeeding in your game development goals!</b></p>", 
    "end_date": null, 
    "title": "Construct 2: Start Creating Great Games Without Programming!", 
    "price": "20.00", 
    "instructors": "Eric Korber", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564656_6fbc_2.jpg", 
    "course_url": "https://www.udemy.com/construct-2-make-money-with-game-creation-no-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T20:18:17Z"
}