{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the basic concepts, tools, and functions that you will need to build fully functional Games without Coding with the popular Construct2 Game Engine.</p><p><strong>Build a strong foundation in Game Development with this tutorial for beginners.</strong></p><ul><li>Getting Started With Construct2</li><li>Understanding User Interface and Components</li><li>Adding Functionality With Behaviours and Events</li><li>Building Practical Example Games</li></ul><p><strong>A Powerful Skill at Your Fingertips </strong><br>Learning the fundamentals of Game Development puts a powerful and very useful tool at your fingertips. Construct2 is free, easy to learn, has excellent documentation, and is the base for creating professional Games without coding.</p><p>Jobs in Game development are plentiful, and being able to learn Game Development will give you a strong background to more easily pick up other Game development tools.</p><p><strong>Content and Overview </strong><br><br>Suitable for Everyone, through this course of 20 lectures and 1 hour of content, you’ll learn all of the Construct2 Game Development Fundamentals and establish a strong understanding of the concept behind Game Development. Each chapter closes with Quizes, putting your new learned skills into test immediately.</p><p>Starting with setting up Construct2, this course will take you through construct2 User Interface, Behaviours and Events and how to use them. By creating Games, you’ll a establish a strong understanding of Game Development process.</p><p>With these basics mastered, the course will take you through how to use Events and Behaviours to add complexity and functionality to your programs.</p><p>Students completing the course will have the knowledge to create functional and useful Games in minutes without coding.</p><p>You’ll be able to work alongside the author as you work through each concept, and will receive a verifiable certificate of completion upon finishing the course.</p>", 
    "end_date": null, 
    "title": "Construct 2 Game Development - Build Games FREE Construct 2", 
    "price": "20.00", 
    "instructors": "Raja Biswas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738916_f37f_2.jpg", 
    "course_url": "https://www.udemy.com/games-without-coding-construct2/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-23T14:13:32Z"
}