{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Have you ever wanted  to <strong style=\"\">create your own computer games</strong> but have <em style=\"\">no  programming experience</em>? Do you want to create computer games without having  to learn all about programming? Well, if so, this <strong style=\"\">Udemy course</strong> is  for you.  </p>  <p>  \t  Multimedia Fusion 2 is  a game and application authoring tool that allows you to design, build and  develop your very own computer games and applications for:  </p>  <p>  \t  ·   <strong style=\"\">Windows XP, Windows  Vista, Windows 7, Windows 8</strong>  </p>  <p>  \t  ·   <strong style=\"\">iOS (iPhone / iPad /  iPod)</strong>  </p>  <p>  \t  ·   <strong style=\"\">Android (Phones /  Tablets)</strong>  </p>  <p>  \t  ·   <strong style=\"\">Xbox 360 and Windows  Mobile</strong>  </p>  <p>  \t  ·   <strong style=\"\">HTML5 (Web Browser  Games)</strong>  </p>  <p>  \t  ·   <strong style=\"\">Flash (Web Browser  Games)</strong>  </p>  <p>  \t  ·   <strong style=\"\">Java / Blackberry  Games</strong>  </p>  <p>  \t  ·   <strong style=\"\">Macintosh / Linux  Supported</strong>  </p>  <p>  \t  ·   <strong style=\"\">DirectX 9 Powered  Games with Shader Effects (Hardware Accelerated)</strong>  </p>  <p>  \t  Multimedia Fusion 2 is  a very powerful authoring tool that enables you to create quick prototypes or  full-blown game developments cutting down timescales massively and allowing you  to export all your games across the above platforms with just a few clicks of  the mouse!  </p>  <p>  \t  Some products always  like to claim &#039;<strong style=\"\">No Programming Required</strong>&#039; then when you dig deeper you  find there is a &#039;scripting language&#039; you need to learn or some other syntax.  With Multimedia Fusion 2 it is exactly that, <strong style=\"\">No Programming or  Scripting Required</strong>. Multimedia Fusion 2 caters for both beginners and  already-established programmers alike. It contains every feature you could ask  for when developing a computer game or application.  </p>  <p>  \t  This course is made up  of over 3.5 hours of Video Content, complete walk-through via video for each  lecture complete with running commentary in English. The course will introduce  you to MMF2, it’s interfaces, editing, the objects, the extensions and  literally, everything you will need to know to get you on your way with the  best start to create  your own computer games and  applications, cross-platform.  </p>  <p>  \t  This Multimedia Fusion 2 course can be taken  completely at your own pace. You will have access to the content around the  clock and can access this course from any computer. You can follow along with  the video lectures and you can download supplementary material that is  provided. I will also be allocating a weekly time-slot exclusively for this  course to answer any questions you may have and also provide some live-tutoring  along the way.  </p>  <p>  \t  This Multimedia Fusion 2 course is already  packed with everything you need to get you going with the ultimate goal being  to create your own computer games and be more knowledgeable in using MMF2 to do  that. There are goals set along the route to ensure you&#039;re keeping up with the  courses pace. In addition to it already being packed out with exclusive to  Udemy content, I will also be adding content on a weekly basis to ensure you&#039;re  always getting the best value that this course can offer you.  </p>  <p>  \t  This course is ideally  aimed towards beginners of MMF2 or maybe those that have used it before but  cannot get to grips with some of the fundamentals. Do not worry, everybody has  their own way of learning and I hope I can bring the best out in everyone who  takes part in this course to get you on the right track to create your own  computer games.  </p>  <p>  \t  I would recommend this  Multimedia Fusion 2 course for beginners as the structure is laid out in a fashion  that covers each step, right from covering the entire user manual, every  property and the basic functions right through to ultimately creating your first  set of games including Platform Games, Pong-Like Games, Breakout Clones and  much more.  </p>  <p>  \t  Check out some of the  free lectures today to see how this course can further your development with  Multimedia Fusion 2.  </p>  <p>  \t  &lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "Creating Games in Multimedia Fusion 2: Beginner Course", 
    "price": "40.00", 
    "instructors": "Danny James", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42219_aada_8.jpg", 
    "course_url": "https://www.udemy.com/creating-games-in-multimedia-fusion-2-beginner-course/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-18T15:06:14Z"
}