{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t In this tutorial, instructor Alan Thorn takes us through the process of creating a 2D Shooting Gallery game with the Unity Game Engine. You'll learn the ins and outs of creating your interface, building 2d targets, the scripting and coding needed to bring it all together, and much more. At the end of this course, you'll be on your way to creating your own 2d games inside of Unity!In this tutorial series, instructor Alan Thorn takes us through the process of creating a 2D Shooting Gallery game with the Unity Game Engine.  </p>  <p><strong>(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong></p><p>More about the Instructor:</p><p>Alan Thorn is a game developer, author and educator with 15 years industry experience. He makes games for PC desktop, Mobile and VR. He founded 'Wax Lyrical Games' and created the award-winning game 'Baron Wittard: Nemesis of Ragnarok', working as designer, programmer and artist. He has written sixteen technical books on game development and presented ten video training courses, covering game-play programming, Unity development, and 3D modelling. He has worked in game development education as a visiting lecturer for the 'National Film and Television School', as a Lead Teacher for 'Uppingham School', and is currently a Senior Lecturer at 'Teesside University' where he helps students develop the skills needed for their ideal role in the games industry.</p>", 
    "end_date": null, 
    "title": "Creating 2d games in Unity", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/83754_821d_4.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-creating-2d-games-in-unity/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-26T01:34:20Z"
}