{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course, you will learn to create high quality game assets that can be used in any 2D game creator <em>with PowerPoint</em>. <strong>Yes, seriously, I said \"PowerPoint\"!</strong></p><p>When you think of PowerPoint you probably don't think of it for anything other than creating bullet point slides with some occasional transitions with graphics that don't go beyond a chart or two.  Hidden in plain sight are some powerful drawing tools in Powerpoint that Game Developers, Artists, and Designers can use to create stunning graphics.  These graphics tools in Powerpoint are building blocks that will let anyone build assets for 2D games created in Construct 2, Unity, GameMaker, or coding from scratch.</p><p>I will show you how PowerPoint lets you create professional looking images that are even easier to create than expensive software packages.  The great thing about learning how to create game assets with PowerPoint is that you probably already own it, so in addition to creating great game assets, you are saving money!</p><p>I will walk you through creating several assets for a space game, including an opening cinematic.  Along the way I'll teach you Powerpoint and design techniques that you can apply to your own game assets. </p><p>I am excited about teaching you how to unleash Microsoft PowerPoint's graphics potential so you can create assets for your own game development or sell in game marketplaces.<br></p><p><strong>Who Should Take This Course?<br></strong></p><ul><li>Game Developers that want to create their own assets</li><li>Beginning digital artists that don’t have expensive software</li><li>People who don’t believe you can create art in PowerPoint ;)</li></ul>", 
    "end_date": null, 
    "title": "Creating Game Assets with PowerPoint", 
    "price": "30.00", 
    "instructors": "Eleven XIII Products LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544898_9de4_2.jpg", 
    "course_url": "https://www.udemy.com/creating-game-assets-with-powerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T17:01:00Z"
}