{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Want to start with Game Development for Android? This course will jumpstart you into it! In just a few hours, you will develop a game with a step-by-step videocourse!  </p>    <p>  \t      I´ve uploaded the game you will create on Google Play - search for \"MyFirstSpaceShooter\". (can´t link it in udemy - sorry!)  </p>  <p>  \t      In just a few hours of work, you could have your very own game in the Play Store aswell!  </p>    <p>  \t         You probably want to develop a game - maybe even your first. I was in the exact same situation just two years ago - I created a few simple games already, but nothing fancy. Then I started developing for Android, with the goal to eventually publish it. But that was way harder than I expected it to be!  </p>  <p>  \t                                          My first game took about 200 hours of work, even though I already knew Java! My second game even took 300 hours, but it was technically much more advanced. Now I want to help others starting Android game development with less pain and frustration than I had, which is why I created this course.<strong> </strong>I planned to reduce my 200 hours to just 20 hours of work for you - but because of my experience and a lot of trial and error, I could push that number even further. Now you will have a finished (but expandable!) game within just <strong>2 hours! </strong></p><p>A part of why learning AndEngine is so slow is the lack of good tutorials. You'll have a hard time finding a tutorial that really walks you through <strong>everything</strong>. And even if you find a good tutorial, it is probably outdated or not for your version of AndEngine...  </p>  <p>  \t                                      The game you will create is a simple space-invader-like arcade game - but <strong>you</strong> can choose how it looks like! I have included a set of graphical assets that you can choose from to make the game really <strong>yours. </strong>(of course, you can also use your own graphics if you have some)  </p>  <p>  \t                                      Also, I have added a few text-based guides to help you expand your game with additional features like PowerUps, Leaderboards and more! I will also continue to add more guides - if you are interested in anything specific, just ask!  </p>  <p>  \t<strong>What`s included in this couse:  \t</strong>  </p>  <ul>  \t<li>Setting up your development environment</li>  \t<li>Creating the main menu for the game using native Android</li>  \t<li>Creating the game using AndEngine</li>  \t<li>Guides on how to expand the game further</li>  \t<li>All graphical assets used in this course and even more!</li>  </ul>  <p>  \t  \t<strong>What you need to bring:</strong>  </p>  <ul>  \t<li>Basic programming knowledge is highly recommended, ideally in Java, but not absolutely necessary. </li>  \t<li>A smartphone with Android</li>  </ul>  <p>  \t                                  With this course, you will be able to create your very own Android game within just a few hours - guaranteed. If the course doesn´t help you, you can just refund it - no questions asked!  </p>", 
    "end_date": null, 
    "title": "Create an Android Game from Scratch using AndEngine", 
    "price": "20.00", 
    "instructors": "Benjamin Schwalb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351822_9199_4.jpg", 
    "course_url": "https://www.udemy.com/create-an-android-game-from-scratch-using-andengine/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T11:34:57Z"
}