{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t       At ZENVA we specialize in making high-quality technology courses  that will give you all the skills you need to turn your ideas into  reality. Get in touch to find out about our latest courses and  discounts:  </p>  <p style=\"\">  \t         Making games is a lot easier than you think. Imagine you could learn how to make HTML5 games that run in all browsers and Windows 8 with our <strong style=\"\">HTML5 game development tutorial</strong> in only 2.5 hours! Well, that is exactly what this course does.  </p>  <p style=\"\">  \t        We know you&#039;ve always wanted to make your own games. Don&#039;t keep postponing it. Start TODAY  </p>  <p style=\"\">  \t         Learn how to create a Zelda-like action game demo from scratch using only Javascript and HTML. No experience or previous knowledge is required! Although knowing the basics of HTML and Javascript is recommended.  </p>  <p style=\"\">  \t         This <strong style=\"\">HTML5 game development tutorial</strong> is aimed for both beginners and more advanced users who may have HTML5 experience but haven&#039;t got into games yet.  </p>  <p style=\"\">  \t         Some of the topics you&#039;ll learn by building this game from total scratch:  </p>  <p style=\"\">  \t         ●  Creating a basic game that can be embed in any website and can be played with just a web browser.  </p>  <p style=\"\">  \t         ●  Displaying a map and characters on the screen.  </p>  <p style=\"\">  \t         ●  Moving a player on this map.  </p>  <p style=\"\">  \t         ●  Using collision detection to simulate the shooting of bad guys.  </p>  <p style=\"\">  \t         ●  Adding enemies to your games.  </p>  <p style=\"\">  \t         ●  Adding sound to your games.  </p>  <p style=\"\">  \t         ●  Putting it all together to create a fun playable demo.  </p>  <p style=\"\">  \t         ●  All game files, including images and sound are available at the end of each chapter for download.  </p>  <p style=\"\">  \t       This HTML5 game development tutorial has been created by Jacob Deichert in collaboration with Pablo Farias. Jacob has created comprehensive HTML5 game dev screencast tutorials on YouTube and other platforms. Pablo is the author of another awesome game dev course called HTML5 Mobile Game Development for Beginners, which you are also welcome to check out.  </p>", 
    "end_date": null, 
    "title": "Create a HTML5 Game from Scratch", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/18854_af00_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-html5-game-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-31T17:23:04Z"
}