{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t   Learn game development with a qualified ICT Teacher, experienced IT Trainer and author of <em style=\"\">Learning Stencyl 3.x Game Development: Beginner&#039;s Guide</em> (Packt Publishing, May 2013).  </p>  <p style=\"\">  \t     This course is for anyone who wants to learn how to create video games for fun or profit. No knowledge of game development or computer programming is required to start this course.  </p>  <p style=\"\">  \t     No artistic skills are required - you&#039;ll learn where to legally obtain free, top-quality graphics and music to use in your games.  </p>  <p style=\"\">  \t     During the course, you will learn how to use free game development tools for Windows, Linux or Mac OS X, to create video games - starting with a blank screen, and working through to a completed product that can be sold or shared on Flash game portals. You can sell your games or implement advertising to earn money every time someone plays your game!  </p>  <p style=\"\">  \t <strong style=\"\">Your first video game will have</strong>:  </p>  <ul style=\"\">  \t<li style=\"\">Visual effects (explosions!)</li>  \t<li style=\"\">Animation</li>  \t<li style=\"\">Sound effects</li>  \t<li style=\"\">Introduction screen</li>  \t<li style=\"\">Game-over screen</li>  \t<li style=\"\">Scoring</li>  </ul>  <p style=\"\">  \t     You will be creating Flash games during the course because it&#039;s incredibly fast to build and test the games, but the skills you will learn can be used to develop games for iPhone and iPad (you&#039;ll need a Mac to test or publish to Apple mobile devices), so you will be able to sell your games on the Apple iTunes Store.  </p>  <p style=\"\">  \t   When you have completed your first video game, you will then learn how to build the framework for a platform game with an animated player, accurate collision-detection and a horizontal scrolling screen.  </p>  <p style=\"\">  \t <strong style=\"\">Course Requirements</strong>  </p>  <p style=\"\">  \t     All the tools required to complete this course are completely free-of-charge - if you have a Windows or Linux PC, or an Apple Mac, you&#039;re ready to start this course right now!  </p>  <p style=\"\">  \t     If you can turn on a computer and use a mouse, then you have all the skills you need to begin creating your first video game.  </p>  <p style=\"\">  \t  All video training materials have been recorded in High-Definition using professional-quality audio equipment for an enjoyable learning experience. (Be sure to select HD in the video player!)  </p>  <p style=\"\">  \t <strong style=\"\">Your instructor</strong>  </p>  <p style=\"\">  \t     Innes Borkwood, is a qualified IT teacher, experienced trainer, and published author of the game development book <em style=\"\">Learning Stencyl 3.x Game Development: Beginner&#039;s Guide</em> (Packt Publishing, May 2013), who has taught many students, young and old, to create their own video games for fun or profit.  </p>  <p style=\"\">  \t     Join Innes now, and start creating your first video game today.  </p>", 
    "end_date": null, 
    "title": "Create your first video game from scratch without coding", 
    "price": "20.00", 
    "instructors": "Innes Borkwood", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58583_b193_4.jpg", 
    "course_url": "https://www.udemy.com/create-your-first-video-game-without-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-06T13:29:08Z"
}