{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tCryENGINE 3 SDK Level Design covers various aspects of level design while informing the budding designer of ways to achieve their goals with less effort. Even with no prior knowledge of game design, CryENGINE 3 SDK Level Design will show you everything you need to know about game level design, starting from how to load the CryENGINE 3 SDK on to your PC all the way to packing up your first level to play.  </p>  <p>  \tIn order to make your game level look presentable, the course starts off by helping you get a grasp on the basics, such as creating your first level, working with models, terrain creation, and material editing. However, your journey doesn&#039;t stop there, as you will then gain further knowledge of more advanced features such as creating flowgraphs and particles, adding sound, and debugging your level.  </p>  <p>  \tBy the end of this course, you will be armed with the skills you need to start creating game levels and scenes. While watching these videos, you will learn game creation tactics that not only work for the CryENGINE, but also for most modern day game engines.  </p>  <p>  \tCode bundle of this course comes along with the game created in the video course with the CryENGINE Free SDK Version 3.4.5  </p>  <h4><strong style=\"\">About the Author</strong></h4>  <p>  \tLike a lot of game designers, <strong style=\"\">Nick Floyd</strong> started off modifying his favorite games. Soon after this, he learned to model, script, and eventually code. His work experience includes repairing old pinball machines and arcade games, computer and network repair and design, web design and development, and sound production. Now working in software development, he brings you the CryENGINE 3 SDK Level Design course to give beginners and intermediate level designers a foothold in level design.  </p>", 
    "end_date": null, 
    "title": "CryENGINE 3 SDK Level Design ", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401006_e02c_3.jpg", 
    "course_url": "https://www.udemy.com/cryengine-3-sdk-level-design/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T10:30:54Z"
}