{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>En este Curso te introduciremos en el fantástico mundo del desarrollo de videojuegos en 2D utilizando el Motor <strong style=\"\">Unity 5</strong>. </p><p>En la <strong style=\"\">Unidad 1 </strong> Aprenderás la interface gráfica de Unity para que puedas desenvolverte correctamente dentro del programa . Luego podrás comenzar a escribir las primeras lineas de código para dar vida a los diferentes componentes de tu juego, esto lo verás en la <strong style=\"\">unidad 2</strong>. </p><p>En la <strong style=\"\">Unidad 3</strong> comenzarás a trabajar con los elementos gráficos llamados Sprites, tanto Animados como estáticos. </p><p>Comenzarás a ver Scripting avanzado en la <strong style=\"\">unidad 4</strong>. En todo vídeo juego es necesario que se detecten las colisiones entre los diferentes objetos que componen el mismo, para de esta forma ejecutar un determinado evento. </p><p>El trabajo con colisiones lo verás en la <strong style=\"\">Unidad 5</strong>. </p><p>En la <strong style=\"\">unidad 6</strong> aprenderás la técnica parallax para mover a diferentes velocidades los fondos. </p><p>Actualmente. esta muy de moda la creación de juegos que implementan Físicas como por ejemplo &quot;Angry Birds&quot;. En la <strong style=\"\">Unidad 7</strong> aprenderás a usar el componente de físicas que trae <strong style=\"\">Unity 5</strong> para que los GameObjects interactúen entre sí, teniendo en cuenta leyes físicas. </p><p>En todo vídeo juego es esencial que contenga efectos sonoros y música para ambientar en el desarrollo a jugador, esto lo verás en la <strong style=\"\">unidad 8</strong>. </p><p>Por último desarrollaras un vídeo juego completo de plataformas donde aprenderás a crear las mecánicas necesarias para implementar un juego de este estilo, esto lo verás en la última unidad del curso la <strong style=\"\">unidad 9</strong>. </p><p>Al Finalizar el curso habrás aprendido los fundamentos básicos para aprender a desarrollar cualquier tipo de Juego en 2D.</p><p></p>", 
    "end_date": null, 
    "title": "Desarrollo de Videojuegos 2D en Unity 3D 5", 
    "price": "20.00", 
    "instructors": "Alexis Jeansalle", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481712_4a96.jpg", 
    "course_url": "https://www.udemy.com/desarrollo-de-videojuegos-2d-en-unity-3d-5/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T00:43:11Z"
}