{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    Único CURSO en español sobre cómo desarrollar JUEGOS para iOs y Android - desde cero - y sin tener que programar nada!  </p>  <p>  \t    Conocerás un verdadero nuevo MUNDO en torno a los juegos para Smartphones, conocerás las comunidades que existen en torno a ellos y como lo hacen hoy miles de desarrolladores de todo el mundo para PUBLICAR tus mega juegos sin programar absolutamente nada.  </p>  <p>  \t    Te mostraré PASO a PASO como desarrollar JUEGOS para iPhone, iPad y dispositivos Android, sin códigos de por medio, sólo utilizando tus actuales CONOCIMIENTOS de computación y lógica.  </p>  <p>  \t    Aprenderás a desarrollar JUEGOS tales como <a href=\"https://itunes.apple.com/us/app/go-hunter-and-the-lost-castle/id718712458\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Go Hunter</a> y <a href=\"https://itunes.apple.com/us/app/smash-fruits/id783779493\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Smash Fruits</a>, te MOSTRARÉ cómo optimizarlos, subirlos, y cómo MONETIZARLOS para que te comiencen a generar INGRESOS desde el primer día.  </p>  <p>  \t    Descubre cómo DESARROLLADORES en todo el mundo están GENERANDO miles de dolares mensuales con sus JUEGOS en el App Store, Google Play y Kindle Store.  </p>  <p>  \t    Desarrolla con este curso las DESTREZAS necesarias para poder COMPETIRLES de igual a igual.  </p>", 
    "end_date": null, 
    "title": "Desarrolla Tus Juegos En iOs y Android, Sin Programar Nada!", 
    "price": "20.00", 
    "instructors": "Daniel Rogers", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/212610_7607_4.jpg", 
    "course_url": "https://www.udemy.com/desarrolla-tus-juegos-en-ios-y-android-sin-programar-nada/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-07T21:49:51Z"
}