{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  El curso inicia desde 0 por lo tanto NO tienes que tener conocimientos de programación, Stencyl o desarrollo de software, la idea es utilizar el “engine” Stencyl para el desarrollo de videojuegos.<br style=\"\">  \t <br style=\"\">  \t   El curso se va haciendo con la misma herramienta y con ejemplos de visualización, interacciones, efectos o estados que deseamos para un personaje, nivel, escena, variable, etc. Todo esto con el fin de ir conociendo el entorno de desarrollo.  </p>  <p style=\"\">  \t  El curso esta organizado para ir explicando la herramienta y la lógica que se necesita para crear un videojuego de una forma muy sencilla y agradable. Empezaremos con lo más básico y se irá aumentando la complejidad de la lógica en los ejercicios para desarrollar en la medida de lo visto, un ejemplo completo(Revisar los temas).  </p>  <p style=\"\">  \t  Si tu tomas el curso, al ir conociendo el potencial de Stencyl se te abrirá la puerta para poner manos a la obra en el desarrollo de tu idea,te garantizo que al finalizar estarás con ganas de crear algún videojuego y compartirlo en la web o conocer un poco más la herramienta y dedicarte profesionalmente al desarrollo de videojuegos.  </p>  <p style=\"\">  \t El curso es básico, así que utilizaremos la dinámica de un juego de plataformas como Mario para lograr este primer paso.  </p>", 
    "end_date": null, 
    "title": "Desarrollo de Videojuegos con Stencyl Básico", 
    "price": "20.00", 
    "instructors": "José Luján", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/81362_ac00_6.jpg", 
    "course_url": "https://www.udemy.com/desarrollo-de-videojuegos-con-stencyl-basico/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-20T19:08:15Z"
}