{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>BONUS section added for changing levels on website link provided in description of lectures.</strong><br></p><p>Would you like the skills &amp; knowledge to develop your own game and upload it to the app store?<br></p><p>Would you like to learn how to use Game Maker Studio? </p><p>... if the answer is yes, then you should take this course!</p><p><br></p><p><strong>What Is This Course About?</strong></p><p>This course is about developing a game using Game Maker Studio. In this course I develop a brick breaker game, and I make it really easy to follow along from start to finish for all my students - no previous development experience is necessary. I personally take you from the very beginning to the very end of developing your very own game, and answer any questions you may have along the way.</p><p><br></p><p><strong>Why Take This Course?</strong></p><ul><li>Learn game development by making your own game</li><li>Envision your own ideas for games and bring them to life</li><li>Upload your games to the app store</li></ul><p><strong>How Long Will This Course Take To Complete?</strong></p><p>This course should take no longer than two hours to complete!</p><p><br></p><p><strong>Why Learn This Course From Me?</strong></p><ul><li>I have a degree in Computer Science from University College Cork, Ireland.</li><li>I code safety applications used to control funfair rides, ski lifts and car conveyor belts for the likes of Ford, for a living.</li><li>I eat and sleep code, basically coming up with new app / web ideas &amp; implementing those ideas on a daily basis.</li></ul><p><br></p><p>... &amp; I will also provide you with a 30 day money back guarantee, in case you don't like what I have to teach ;)</p><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Develop Your Own Game Quick & Easy with Game Maker Studio", 
    "price": "25.00", 
    "instructors": "Joey Tawadrous", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384972_f1e5_3.jpg", 
    "course_url": "https://www.udemy.com/develop-your-own-game-in-3-hours-with-game-maker-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T17:24:30Z"
}