{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Ever wanted to create your  own shoot'em up game, completely from \nscratch? Well then look now further, the course you've been looking for has arrived. Using the \nincredible Stencyl 2D game engine and toolset, <strong>you will complete a cross-platform, beautiful, fun, dynamic shoot'em up in just a matter of hours</strong>, and you'll learn  a ridiculous amount doing it, too.<br></p><p>In this immensely fun and highly informative (and educational) series of lessons on the development of a 2D mobile game (Android and iOS) in the vertical shooter genre, we delve into the most important tips, tricks and cheats that the pros use to develop great games in a fraction of the time, giving you an early edge in your game development journey. Some of the key take aways include: </p><ul><li>importing, editing and implementing scrolling backgrounds</li><li>creating parallax effects</li><li>accepting and reacting to player input</li><li>using actors in Stencyl to create the player character, obstacles such as comets, as well flying saucers and turrets</li><li>programming both actor and scene behaviors to handle game events and implement game rules</li><li>use sound effects and music to enhance the player experience and overall immersive experience of the game</li><li>Be able to take everything you have learned and apply to your very own game projects!</li></ul><p> Whether you have ambitions of becoming a professional, indie game developer, or you just want to create a cool game you can show off to your friends, <strong>the concise, structured, easy to follow format of this course caters to the learning needs of all. Join up now, it will be one of the most enjoyable learning experiences you'll ever have</strong>, and what you learn will enable you to start building your own games for mobile platforms such as Android and iOS, and even web and desktop targets (Flash, HTML5, Windows, Mac, Linux).<br></p>", 
    "end_date": null, 
    "title": "Develop A Vertical Shoot'em Up Game for Android and IOS", 
    "price": "20.00", 
    "instructors": "Richard Sneyd", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/742322_837e_7.jpg", 
    "course_url": "https://www.udemy.com/develop-a-vertical-shootem-up-game-for-android-and-ios-stencyl-free/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T15:46:43Z"
}