{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t     This course has been especially designed to take your complete beginner or intermediate level skills in Stencyl and build them up to the level required of a professional indie mobile game developer. Where as the foundation course (Create your First Computer Game with Stencyl), teaches you many important skills, concepts, and techniques necessary to implement core gameplay, utilize sound, and implement some basic AI, this course will teach you how to Create a complete, professional grade computer game which can be published on all the most popular platforms -- Google Play, IOS, Windows, Linux, Mac, Flash etc.  </p>\n\n<p>  \t     From start to finish, you will develop a complete, playable game including all the advanced features and polish you would expect, such as:  </p>\n\n<ul>  \t<li>start menu</li>  \t<li>social link buttons</li>  \t<li>multiple, playable levels</li>  \t<li>level selection screens</li>  \t<li> saving and loading</li><li>in-app purchases and ads (for revenue generation)</li>  \t<li>beautiful, unique art and animations</li>  \t<li>parallax scrolling</li>  \t<li>sophisticated gameplay </li>  </ul>\n\n<p>  \t    We also cover less technical -- but none the less essential -- subjects such as marketing, design theory, game monetization paradigms and various other business and design tips and tricks for game development . After the core game has been developed, the course leads into sections on what it takes to publish it to the various Stencyl supported platforms (Desura, Steam, Google Play, Samsung Apps, IndieCity etc), including platform specific details such as certificates, marketplace restrictions, monetization methodologies etc.  </p>\n\n<p>  \t    In short, when you've finished this course, you will have learned everything you need to know to start developing, publishing and monetizing professional quality desktop and mobile games with Stencyl. So let's get started!  </p>", 
    "end_date": null, 
    "title": "Develop Mobile Games for Android and iOS with Stencyl", 
    "price": "20.00", 
    "instructors": "Richard Sneyd", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/193736_7389_13.jpg", 
    "course_url": "https://www.udemy.com/advanced-cross-platform-computer-game-development-design-with-stencyl/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-04T09:59:35Z"
}