{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Why we like play and create Role Play Games (RPG)? We like story, characters, fights and… many-many-many items in our inventory! Moreover, when comes time to create your own RPG, you should fill the inventory with very cool and different staff: deadly weapons, cool armor, useful accessories, funny junk.</p><p style=\"\">In this course, we will understand how to draw many kinds of items in free professional software. Video tutorials in simple and fast way shows you how to start from simple shape and end with brutal axe or smooth bomb. In addition, every object will be created maximum in 25 minutes (in this cases tutorial will be separated in two parts because of Udemy rules).</p><p style=\"\">To start you don&#039;t need specific knowledge – I will show where to get professional software, how to use it and repeat all the main functions in every tutorial. You need just to open your eyes, ears and repeat all the right moves. After 10-20 minutes you will get your first RPG items.</p>Course contain video tutorials. Each theme created from one or two videos. The most comfortably watch videos on PC (MAC) or Pads. But create graphics we will on computers.<p style=\"\">If you want to test my tutorial before start, you can check the free videos “<em style=\"\">Draw the sword: easy way to create 2d game art in 30 minutes</em>&quot;.</p><p style=\"\">The most interesting thing for You, that this course will grow. And next tutorials and next items I will create after yours willing. </p><p style=\"\">If you like games and RPG&#039;s, if you creating your own game and want nice, smooth, simple to create and unique graphics for it – this course is for you. Just sit down, open right program and start to draw. After the few hours, you will have first cool items and possibility to redesign your game to new level.</p><p style=\"\">Good luck and see you on the next video tutorial!</p>", 
    "end_date": null, 
    "title": "Draw Your Own RPG Inventory: easy way to create 2d game art", 
    "price": "20.00", 
    "instructors": "Yuriy Okunev", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512730_4cb8_2.jpg", 
    "course_url": "https://www.udemy.com/draw-your-own-rpg-inventory/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T12:20:36Z"
}