{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Exporte seu jogo para mobile e publique no Google Play Store</strong></p>\n\n<p>Esse é um curso completo de como exportar seu jogo para mobile usando o Construct2 e como publicá-lo no Google Play Store.</p>\n\n\n\n<p>Tudo que você estiver assistindo nos vídeos será compartilhado com você por meio de links para download e outras coisas necessários para termino do projeto.</p>\n\n\n\n<p>Esse não é um curso teórico cheio de ideias abstratas, mas sim um curso passo-a-passo do início ao fim de como <strong class=\"redactor-inline-converted\">exportar o jogo e publicá-lo no Google Play Store*</strong>. A explicação de cada aula é cuidadosamente detalhada para que você possa entender tudo o que está assistindo.</p>\n\n\n\n\n\n<p>Esse curso é excelente para quem está interessado em ter seus jogos disponíveis para aparelhos móveis. É um grande passo de passar de jogos HTML5 para jogos para celulares e tablets.</p>\n\n<p>O curso é baseado em um <strong class=\"redactor-inline-converted\">projeto real </strong>em que você terá a oportunidade de criar exatamente o que está assistindo. Os vídeos não têm nada obscuro ou que foram pré-gravados onde coisas foram feitas de antemão.</p>\n\n\n\n\n\n<p>Ao final do curso você terá toda a base necessária para exportar qualquer tipo de jogo criado no Construct2 e publicá-lo no Google Play Store.</p>\n\n<p>No total o curso tem 4 horas de duração. Se você tiver tempo livre poderá fazer o curso do início ao fim em um único dia. Eu recomendo que tire tempo para prestar atenção aos detalhes e dai você pode repetir com o seu próprio jogo.<br></p><p>* Para exportar o jogo para mobile você precisa da versão Personal ou Business do Construct2.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Vantagens de se tornar um aluno</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Acesso vitalício ao curso</strong>: assista quando e quantas vezes quiser.<br><strong class=\"redactor-inline-converted\">Download dos vídeo</strong><strong class=\"redactor-inline-converted\">s</strong>: através dos Apps Udemy para Android/iOS você pode fazer download dos vídeos e assisti-los offline.<br><strong>Certificado reconhecido</strong>: a Udemy oferece certificação de conclusão do curso, especificando o curso e a carga horária realizada.</p>", 
    "end_date": null, 
    "title": "Exporte seu jogo para mobile e publique no Google Play Store", 
    "price": "30.00", 
    "instructors": "Thiago Prado", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856780_750b_3.jpg", 
    "course_url": "https://www.udemy.com/exporte-seu-jogo-para-mobile-e-publique-no-google-play-store/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-22T18:48:43Z"
}