{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Not: Herkesin faydalanabilmesi ve kendine değer katması adına kursu ücretsiz'e çevirdim. Umarım hepiniz memnun kalırsınız. </strong></p><p><br></p><p>Bu kurs öğrencilerine Game Maker Studio ile nasıl oyun tasarlanıp, yazılacağını öğretmeyi amaçlamaktadır. Kurs boyunca öğrendikleri yetilerle oyun yazabilmeyi öğretmeyi amaçlamaktadır. Öğrenciler Game Maker Studio'yu kullanmayı ve kendi dili olan Game Maker Language (GML) ile oyun tasarlayıp platformlara uygun hale getirmeyi öğrenecektir.</p>\n\n<p>Bir çok insanın çocukluğundan beri hayali olan oyun programcılığı günümüzde ve gelecekte tüketimi ve talebi daha yüksek hale gelecektir. Dünyada oyun yazılımcılarının tüketime göre yetersiz kalması ile kendine sektörde yer bulması ve kariyerinde başka bir başlangıca yönelmesi özellikle oyun sektörüne ilgisi olanlar için fazlasıyla faydalı olacaktır. \n\n  Game Maker Studio ile Android, IOS, Windows Phone gibi mobil platformlara oyun yazılabileceği gibi aynı zamanda Facebook, Windows, Mac, Ubuntu, Tizen, Playstation, Xbox, Ubuntu işletim sistemlerinin kullanıcılarını da ulaşacaktır. Oyunlarını Google Play, Itunes, Steam, Amazon gibi marketlerde yayınlayabilecektir. Bu kurs ile öğrenciler hayallerindeki oyunları hayata geçirebilecekleri, insanlara ulaştırabilecekleri, para kazanabilecekleri, kariyerinde bir yön olması gayet muhtemeldir. \n\n \n\n </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Game Maker Studio'ya hemen alışacak ve sevmeye başlayacaksınız.</strong><br></p>\n\n\n\n<p>Ders süresince ana amaç bir oyun yapmaya odaklanma olacaktır. Dersler bittiğinde önünüzde kendi yaptığınız bir oyun göreceksiniz. Zorlanmadan, kolayca ve başlangıç seviyesinde anlatımla beraber hiç sıkıntı yaşamadan sonuca ulaşacaksınız.</p>\n\n<p>Neden Game Maker Studio?</p>\n\n<ul><li>Öğrenmesi ve Uygulaması Kolay</li><li>Tek Başına Çalışabilme Özgürlüğü</li><li>Tüm Platformlara Oyun Üretebilme</li><li>Marketlerde başarıya ulaşmış binlerce oyunun mimarı</li><li>Hızlı ve Stabil Çalışma</li></ul>\n\n<p><br></p>\n\n<p>Oyun sektörüne giriş yapmaya karar verdiyseniz, Game Maker Studio ve bu dersler sayesinde güzel sonuçlar alacaksınız.</p>\n\n", 
    "end_date": null, 
    "title": "Game Maker ile Sıfırdan Oyun Yapımı - Bir Oyun Yapımcısı Ol", 
    "price": "20.00", 
    "instructors": "Altan Kahraman", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/837586_a547_3.jpg", 
    "course_url": "https://www.udemy.com/game-maker-studio-oyun-yapimi/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-02T15:25:32Z"
}