{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>The source code is compatible with iOS 8, and also ready for iPhone 6/6+</strong>  </p>  <p>  \t  Thank you for your interest in this course, this is your instructor Yohann.  </p>  <p>  \t      This course is not just about theory, it's about getting things done.  </p>  <p>  \t      We give you the full source code of a clone of the Swing Copter game, another top ranking game from Dong Nguyen, the creator of Flappy bird.  </p>  <p>  \t      This course will guide you step by step on how to customize the game graphics, sounds, and settings and you'll magically end up with your own game published in the iTunes app store.  </p>  <p>  \t      The game comes with 3 advertising channels so that you can earn money every day while people play your game.  </p>  <p>  \t      This course is the simplest way to get into the mobile app industry and get your first app in the app store. It's also for anyone who'd like to expand their app portfolio.  </p>  <p>  \t      The source code included with this course comes with an an unlimited license, which means you can keep reusing it and make dozens of games with different themes. It's fun and it's going to bring you even more money! I know it works because that's what I've been doing myself! Here I will show you how I'm turning the swing copter game into a Swinging Teddy Bear one.  </p>  <p>  \t      The process is fun and rewarding, So Don't wait for the next opportunity, now is the time, and please check out the course outline and see all the value that comes with it.  </p>  <p>  \t      Get the course now and see you in the classroom.  </p><p><strong></strong></p><p></p>", 
    "end_date": null, 
    "title": "Game Reskinning. iOS Swing Copters* Source Code Template", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296321_c830_3.jpg", 
    "course_url": "https://www.udemy.com/game-reskinning-ios-swing-copters-source-code-template/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T12:57:00Z"
}