{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tIn this course I will introduce you to the <strong style=\"\">Unity 3D</strong> game engine. From <strong style=\"\">interface to programming</strong>, I will help you with everything and I will help you in making a working prototype. Everyone enjoy&#039;s playing games, but while taking this course, you will realize making a game is as much fun as playing it.  </p>  <p style=\"\">  \tI still remember the day, when I first time made my character move on a solid platform, I was so happy and excited, I was just moving that character left to right for next 10 mins. It might seem difficult when you look at the engine for the first time but its all easy. And soon you will realize its easy and <strong style=\"\">fun</strong> to play around with engine and make games. And as soon as you realize this, you will start getting you <strong style=\"\">own game ideas</strong> that would love to implement. By the completion of this course you will have a <strong style=\"\">working prototype</strong> of a game with you and you will be ready to make your own prototypes.  </p>  <p style=\"\">  \tThis course is <strong style=\"\">organized </strong>very ideally, as I know the problem I faced while learning unity. So you don&#039;t need to face same problems while learning the same. Everything will be explained in detail, and code will be explained line by line, so don&#039;t worry if you are not a programmer.  </p>  <p style=\"\">  \tAlso I will explain about the interface and how <strong style=\"\">powerful unity&#039;s interface</strong> is so even programmers wont face a problem, as I being a programmer, hate so many buttons on my screen. And learning all this you will realize that half of your game related work can be done inside unity and you wont need much of 3rd party software to make a prototype. Your learning related to programming will cover everything from <strong style=\"\">introduction</strong> to programming, to game-play<strong style=\"\"> scripting</strong>. And there will be lots of bonus content to help you publish you game and have different types of build that includes <strong style=\"\">IOS, android, web and PC.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong><strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \tJoin fast, before the price increases. The price is going to increase as more videos are added and course comes to completion.  </p>  <p style=\"\">  \t<strong style=\"\">So if you have a game idea and ever thought about making a game go ahead and join </strong>the course.  </p>  <p style=\"\">  \t&lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "Game Development Made Easy", 
    "price": "20.00", 
    "instructors": "Anshul Soni", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33489_827f_3.jpg", 
    "course_url": "https://www.udemy.com/game-development-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-24T10:03:03Z"
}