{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    Game Making in Scratch is a course designed for those who have an interest in programming and making and selling games but don&#039;t know how or how to get started. Because the course uses a free, easily installable program, it&#039;s all open and intended for users of all ages and backgrounds.  </p>  <p>  \t    Programming is often a foreign concept but this course is designed to teach some of those concepts and methods that will clarify it. By learning about variables, code and scripts, you can understand how to translate what you learn into an app or another idea. By the end of the course you will have created your own games with the instructor, other students and by yourself  </p>  <p>  \t<strong>What is Scratch? Is it too elementary?</strong>  </p>  <p>  \t  Scratch is a free programming program that uses &quot;blocks&quot; instead of lines of code making syntax errors impossible which makes for enjoyable coding. It&#039;s great for teaching basic programming and is recommended to elementary and middle school classrooms. If you are a teen or adult, it is not necessarily too elementary for you because we also go over a lot of programming concepts that are used not just in Scratch.  </p>  <p>  \t<strong>Why take this course instead of another?</strong>  </p>  <p>  \t  Good question! The first reason this is the best course for you is that it is very flexible; I am committed to teaching you programming and Scratch, not just selling my course. Because of this, I am happy to answer your questions throughout the course and add lectures as we go if a lot of people request something. Secondly, this is an inexpensive course that is actually higher quality than all the other ones out there. HD video and high quality audio paired with a knowledgable instructor make for a good learning experience.  </p>  <p>  \t<strong>Who is the instructor and how knowledgable are they?</strong>  </p>  <p>  \t  Hi! I&#039;m Evan Schweikert and I&#039;m a programming student. I started programming with Scratch several years ago and have been quite active ever since. Throughout my time working with Scratch I have related my learning to programming in Objective-C and java and have accumulated a lot of knowledge thanks to my peers. In the Scratch community, I am a permanent curator for a section of the front page (SDS) and served as a special project curator for a couple of weeks. I teach Scratch because I love it and love programming.  </p>", 
    "end_date": null, 
    "title": "Game Making in Scratch", 
    "price": "20.00", 
    "instructors": "Evan Schweikert", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/316240_26a2_5.jpg", 
    "course_url": "https://www.udemy.com/games-in-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-09T02:16:09Z"
}