{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t <em style=\"\">Getting Started with Unity 4 Scripting</em><span> will explain everything that you need to know; from the basics of the Unity game engine, through to how the component system and Input Manager works. Learn how to create a custom GUI and set up basic AI pathfinding systems, and progressively cover more advanced topics such as inter-communication between the different languages that the Unity game engine supports.</span>  </p>  <p>  \t    With this video course, you will learn about render loops and basic entry point functions that the Unity engine exposes, followed by the component system, Input system, Gizmos, character controllers, and GUI Scripting. This video course culminates by teaching you about the AI system and the script compilation orders that the Unity game engine provides, as well as all the basic components that comprise a good game.  </p>  <p>  \t Learn everything you need to know about how scripting in Unity works; everything from exposing variables in scripts, entry point functions, render loops, and colliders, including how to make them work, to an in-depth introduction of the component system and its intricacies. Discover how to add, remove, and create custom components, as well as about the anatomy of the Input, GUI, and Gizmos system, how they work, and how they behave in tandem. <br style=\"\">  \t    By the end of this course, you&#039;ll be knowledgeable enough to create any basic game by harnessing the power of Unity.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span><strong style=\"\">Juan Sebastian</strong> started to develop an interest in computer graphics and visualization software early in his college years, when he started to work at the virtual reality lab on a laparoscopic surgery simulator; there after he did his internship in web design, but he knew that game development was the way to go. He found web development boring, and got entry level work at a game studio as a Junior Programmer. There he started to learn Unity and work on some games, and he also started to work on side projects of his own. After he graduated, he moved to Denmark to work at Unity’s head quarters as the Doc Engineer, where he was in charge of all documentation. In this role, he created a parser to automatically translate all the examples written in JavaScript to C# and Boo. After 2 years, he moved to Chile to work in Unity as the core programmer on a marketing research simulator made in Unity. There he was in charge of all the connections and hardware interactions with the engine.</span>  </p>", 
    "end_date": null, 
    "title": "Getting Started with Unity 4 Scripting", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352692_b09e_2.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-unity-4-scripting/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T06:36:32Z"
}