{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Have you ever wanted to create a 2D Unity game? Remember those old arcade classic games like Double Dragon and Donkey Kong? What fun times!</p><p>You will learn exactly how to create a 2D Platform game using the Unity 3D Engine. This training course will take you from the scratch and show you how to make a 2D Platform game, complete with a scoring system!</p><p>Impress your friends and even land your dream job! Games are hot property these days - companies are scrambling to get into the gaming market. Its lucrative and its a whole lot of fun!</p><p>You will learn everything you need to get started in under 3 hours! Don't waste your time studying for too many hours - this course will give you exactly what you need to get up and running.</p><p>You will:</p><ul><li>Understand the Unity dashboard</li><li>Learn about 2D Spritesheets</li><li>Discover how to edit 2D Spritesheets to retrieve the exact Sprites required</li><li>Discover how to create animations for your character</li><li>Learn about enemies and how to add objects for your character to collect</li><li>Learn how to implement a scoring system</li><li>Learn so much more!</li></ul><p>The potential is unlimited! Not only can you use these skills to build your own games, you can build these games for clients (with the potential of earning thousands of dollars!)</p><p>What are you waiting for? Get started today - you are covered by a 30 day unconditional money back guarantee</p>", 
    "end_date": null, 
    "title": "How To Create a Unity 2D Platform Game in Under 3 Hours!", 
    "price": "35.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/812104_1141_2.jpg", 
    "course_url": "https://www.udemy.com/unity-2d-platform-game/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-04T07:02:25Z"
}