{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Most people believe that the development and successful progress of mobile gaming requires serious and difficult skills.  By learning the process with Unity 2D, these perceptions will be smashed. 2D suits well for mobile platforms and due to its low power consumption can become an amazing project on large platforms.</p><p>This course is for beginners and experienced designers of mobile games. You will create a dynamic Unity 2D game during the course, but the focus is made not on passing the game, but on mastering the art of game design through problem solving and experiments.</p><p>You will start with importing models and textures before proceeding to the level design. To get started we'll learn how properly to set up our coins in order to collide with the player. This is a basis for the following steps: creating an animation that controls the actions of your player. You will end with creating an animation of collection and creating music for your games.</p><p>By the end of this course, you will be able to create a complex Unity 2D game, starting with nothing but a blank screen. This course will give you a basis for understanding the development of the game, using the Unity 2D - powerful game engine. If you have never designed games before, this course is for you.</p>", 
    "end_date": null, 
    "title": "How I Make a Unity 2D Platformer - The Complete Course", 
    "price": "20.00", 
    "instructors": "Awesome Teach Inc.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571664_c71a_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-make-a-unity-2d-platformer-the-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T15:26:07Z"
}