{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>LATEST UPDATE:</strong> Integrating our iPhone game with Twitter<br></p>\n\n<p><strong>PREVIOUS UPDATE: </strong>Saving the user's High score to local storage using NSUserDefault and updating a third party SDK in your project (Chartboost SDK).</p>\n\n<p>The “How to create iPhone <strong>Flappy Birds</strong> inspired iPhone game with Swift” Course is a comprehensive step by step course. You will learn how to put a modern, <strong>socially integrated</strong> and monetised iPhone game together. The inspiration for the course comes from the world famous game <strong>Flappy Birds</strong>. Let me be very clear on my next point. The concepts you will learn in this course can be applied to any idea you have for an iPhone game.</p>\n\n<p>In the <strong>40</strong> <strong>lectures</strong> and over <strong>7 hours</strong> of content, we will start by covering off all the basis to get you going. We will install <strong>Xcode</strong> and run through the basics of the <strong>Xcode</strong> environment. We will then moving on quickly to start building the scenes and background to our game. After that we will build the pipes and the main character. Not long after that we will look at introducing physics properties to our game objects. Now are our game is starting to take shape. We can them look at how our user is going to score in the game. Once that is all done we will introduce <strong>Chartboost</strong> ads to monetise our game. Then we will integrate our game with two the biggest and best social media networks… <strong>Facebook and Twitter</strong>. We will also connect our game up to a <strong>Game Center</strong> Leaderboard to track our users high scores.</p>\n\n<p>Once we have complete all of that I will finish off on talking the next steps I think you should take...</p>\n\n<p>I’ve done all the research, read the Swift documentation, searched the web for how to perform certain functions in an iOS game and put all the ideas and concepts into one complete package. <em><strong>There is no need to look any further:</strong></em> This course is a one stop shop to get you started in building your own unique iPhone game. </p>\n\n<p>\n\n\n\n<br><strong>This course will continue to grow and be updated with new trends and to accommodate for new software version updates.</strong><br></p>", 
    "end_date": null, 
    "title": "How to create a Flappy Bird inspired iPhone game in Swift 2", 
    "price": "20.00", 
    "instructors": "Ben Kane Johns", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/591506_7766_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-flappy-birds-inspired-iphone-game-with-swift/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T04:13:03Z"
}