{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">So you want to make dynamic mobile applications, but you don&#039;t want to learn the native toolkits for Android, iOS or even Windows 8? &nbsp;This course is what you&#039;re looking for! &nbsp;With this HTML5 Mobile App Development course, you will learn to create HTML5 based mobile applications that can be sold in the Apple App store, the Google Play Store or other mobile marketplaces.<br style=\"\"> &nbsp;<br style=\"\">If you know the basics of HTML, CSS and Javascript, you&#039;re ready to take this exciting course. &nbsp;You&#039;ll be encouraged to code along with master instructor Mark Lassoff, as you create applications that demonstrate many of the features available in the PhoneGap (aka Cordova) library. &nbsp;You&#039;ll work with applications that control audio and video, use remote data from a server, and interact with the phone&#039;s camera and microphone hardware.<br style=\"\"><br style=\"\">If you already know HTML, CSS and Javascript, you can be well on your way to creating engaging mobile applications that you can distribute to all major phone platforms-- without coding a line of Java or Objective C. &nbsp;Using the PhoneGap platform and the techniques demonstrated in this course you can also write your code once and distribute to both iOS and Android easily.<br style=\"\"><br style=\"\">This course includes hours of video lectures, dozens of code and application examples and engaging lab exercises to help you retain the material once you have reviewed it.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "HTML5 Mobile App Development with PhoneGap", 
    "price": "30.00", 
    "instructors": "LearnToProgram, Inc.", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28790_5275_8.jpg", 
    "course_url": "https://www.udemy.com/html5-mobile-app-development-with-phonegap/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-06T15:47:01Z"
}