{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Bonjour et bienvenue a cette formation, je m'appelle Yohann, je suis Francais et Americain et je suis connu pour avoir aider des dizaines de milliers d'etudiants a faire des jeux videos et a les publier dans iTunes et Google Play. Certains de mes etudiants ont atteint le top 10 et du coup la presse a ecrit des articles sur ce que je fais, comme par example le magazine WIRED, yahoo news et meme forbes en ligne. Allez jeter un coup d'oeil a ce que les etudiants disent de moi dans les revues.</p>\n\n<p>Alors si vous voulez commencer a faire des jeux videos, ou si vous avez deja commence mais vous avez besoin de quelqu'un pour vous guider, alors vous avez frappez a la bonne porte.</p>\n\n\n\n\n\n\n\n\n\n<p>Cette formation est parfaite pour commencer l'aventure de faire des jeux video, et on va utiliser Unity 3D. Ne vus inquietes pas si vous etes bidon en programmation ou que vous ne savez pas dessiner, de nos jours ya tellement de facon de contourner tout ca, que c'est pas sorcier, et que des gamins peuvent faire des jeux videos.</p>\n\n\n\n\n\n<p>Vous me croyez pas? Ben le jeune home Anglais de 14 ans qui a suivi ma formation a vendu son jeu a Disney, et si vous voyait son compte en banque vous rigolerez plus. </p>\n\n\n\n\n\n<p>Bon bref, voici ce que vous allez apprendre dans cette formation:</p>\n\n\n\n\n\n<p>On va commencer par se familiariser avec l'interface du programme Unity. Ensuit je vais vous apprendre les concepts cles pour comprendre les mechaniques utilisees pour faire des jeux videos. Puis ensuite on va apprendre les fondations de la programmation. Oui vous savez, c'est un sujet qui est pas marrant du tout et beaucoup d'entre vous trouve ca ennuyant, alors j'ai acheter des figurines de Star Wars pour vous expliquer tout ca. Maintenant c'est pas a l'universite que le prof va sortir des figurines star wars! N'est-ce pas?</p>\n\n\n\n\n\n<p>Voila, si vous etes comme moi et vous preferez apprendre en faisant des projets pratique plutot que d'ecouter la theorie pendant des heures, alors cette formation est faite pour vous.</p>\n\n\n\n\n\n<p>Au faite, la programmation est partout, dans les jeux videos, dans les sites webs, les voitures, meme dans les machines a cafes. c'est dingue!</p>\n\n\n\n\n\n<p>Donc ce que vous allez apprendre dans ce cours est ultra puissant, c'est l'equivalent de trois super guerriers de l'espace reunis. Imagine, trunks, san gokou et vegeta, trois en un! au top!</p>\n\n\n\n\n\n\n\n\n\n<p>Cette formation est composee de lecons qui font quelques minutes de long comme ca c'est plus facile a digerer. Vous allez apprendre et en meme temps travailler sur des vrais jeux qui sont dans les app stores.</p>\n\n\n\n\n\n<p>Vus pouvez suivre les lecons sur MAC, Linux et Windows, alors arretez de trouver des excuses et prenez cette formation. Allez, j'y vais, a tout de suite.</p>", 
    "end_date": null, 
    "title": "Initiation a la programmation pour faire des jeux videos", 
    "price": 0, 
    "instructors": "Yohann Taieb", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/816638_1f9b.jpg", 
    "course_url": "https://www.udemy.com/initiation-a-la-programmation-pour-faire-des-jeux-videos-unity/", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-08T19:34:42Z"
}