{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tBrand new game design series based on the Unity3D game engine, taught by Martin Knapp. Through out each of the many lessons you are introduced to the powerful Unity3D game engine which has been used to create countless game for all the major system and mobile devised. After becoming familiar with the Unity user interface, students to on to learn how to create a game level from scratch. Addition videos in this series teaches students how to apply textures, lights and even advanced particle systems to their games. Finally this training series will show students how to add first person and third person game controllers to their games so they can explore and play the worlds they just learned how to create.  </p>  <p>  \t<strong style=\"\">About Martin Knapp</strong>  </p>  <p>  \tMartin is a Creative Director who has been working in the 3D industry for over 10 years. He has worked for major 3D companies such as Pixologic and has taught classes at major film and game studios like Industrial Light and Magic and Ubisoft. He has served on the advisory board for the LA Film School and the Digital Animation and Visual Effects School. In addition to creating award winning work in the areas of advertising, web, and games, he has a passion for sharing his deep knowledge of the digital arts with others and has created hundreds of hours of online training. He is an Autodesk and Pixologic certified instructor and self admittedly is always a student himself as he never stops learning the latest tools and techniques.  </p>", 
    "end_date": null, 
    "title": "Introduction to Game Design with Unity3D", 
    "price": "20.00", 
    "instructors": "School of Game Design", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96898_d7e4_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-game-design-with-unity3d/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-25T00:18:49Z"
}