{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>El Curso <strong>Desarrolla Tus propios juegos en Unity 5, </strong>es una guía que te ayudará en la inserción en el mundo de desarrollo de videojuegos utilizando este espectacular software. En el<strong> Módulo Introducción</strong>, aprenderá los aspectos básicos de unity 5 como son: la descripción de la ventana principal y el nombre de los diferentes objetos que se pueden integrar en un escenario. </p><p>En el <strong>Módulo 2</strong> aprenderá a trabajar con la creación de terrenos utilizando las herramientas que proporciona el engine. Además, podrá crear sus propios pinceles para personalizar las montañas y vera en profundidad la creación de arboles utilizando el Tree Creator.</p><p>En el <strong>siguiente Módulo</strong>, aprenderá los fundamentos básicos del scripting con C# realizando ejemplos prácticos para entender el funcionamiento. </p><p>En el <strong>Capitulo 4</strong>, aprenderás a trabajar con las Cámaras en Primera Persona, tercera persona y una tipo Top Down Shooter.</p><p> Durante el <strong>Capitulo 5</strong>, se verán los tipos de luces y sus funciones.</p><p>En el <strong>capitulo 6</strong>, aprenderás a utilizar las físicas de Unity 5. Verás términos como collider, collision, RigidBody y  triggers.</p><p>En el <strong>capitulo 7</strong> aprenderás a utilizar el Sistema de Partículas.</p><p>En el <strong>Capitulo 8</strong> conocerás las herramientas que ofrece Unity 5 para elaborar modernas interfaces de usuario.</p><p>En el <strong>capitulo 9</strong> Aprenderás a trabajar con las fuentes de audio para generar efectos de sonido y colocar música en tus videojuegos. También verás el nuevo sistema Mixer que proporciona esta nueva versión de Unity 5</p><p>Durante el <strong>Capitulo 10</strong> Aprenderás a utilizar las animaciones con el sistema Mecanim.</p><p><br></p>", 
    "end_date": null, 
    "title": "Introducción al Desarrollo de Juegos en Unity 5", 
    "price": "20.00", 
    "instructors": "Alexis Jeansalle", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579674_c829_4.jpg", 
    "course_url": "https://www.udemy.com/desarrolla-tus-propios-juegos-en-unity-5/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T01:39:59Z"
}