{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Houdini is a very powerful 3D software application that has the ability to create procedural assets for Movies and games. It is more widely known in the movie industry but it is becoming more and more integrated into the game development pipeline. Throughout this course we will cover the crucial information to make anyone successful in their procedural modeling adventures, using Houdini.</p><p style=\"\">With each lesson we will take you from beginner to a Houdini modeling expert by covering some of the basic nodes that every procedural modeling graph begins with.  The course will begin by walking through each of the basic primitives available so that you have a good understanding of the types of geometry you can start with.  As we move towards the middle of the course, we will take a look and learn how to set up common procedural algorithms, that produce the procedural models you see in games and movies today!</p><p style=\"\">Finally we will close out this course by performing a small procedural modeling project.  We will create a procedural staircase, that allows you to change the number of stairs, the height, width, and depth of the stairs, as well as the colors of the stairs.  By creating this proceudural project, you will get practical training in a procedural modeling pipeline. </p>", 
    "end_date": null, 
    "title": "Intro to Procedural Modeling with Houdini", 
    "price": "20.00", 
    "instructors": "Gametutor :-)", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542262_aa68.jpg", 
    "course_url": "https://www.udemy.com/intro-to-procedural-modeling-with-houdini/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T15:00:24Z"
}