{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">How many apps do you have on your mobile device? And out of those apps, how many are games? Chances are you&#039;ve probably downloaded more than a few. After all, gaming is one of the most popular uses for mobile devices.</p><p style=\"\"><em style=\"\">“According to App Annie Intelligence, games contributed around 80% of revenue and 40% of downloads generated globally on iOS and Google Play combined in December 2014.&quot; – App Annie</em></p><p style=\"\">If you&#039;ve always wanted to build and develop mobile games, there&#039;s no better time than now to learn and act on that dream. With “mobile gaming [driving] nearly half of all app downloads&quot; (App Annie), this is a field that is going to continue to grow.</p><p style=\"\">Think it&#039;s an expensive investment? Not at all – it&#039;s now possible to start your game development career without breaking the bank, thanks to a recent update from Corona Labs.</p><p style=\"\">With the release of Corona SDK Starter – a free tier that allows you to download and use Corona for free, as well as publish your game to Google Play, iTunes, the Amazon App Store, and more – it has never been easier or cheaper to start building mobile games for millions of players worldwide. </p><p style=\"\">With Intro to Mobile Game and App Development and Corona SDK 2015, you&#039;ll learn about the Lua language, programming concepts, Corona basics, and game development. </p><p style=\"\">Here&#039;s what you will learn in this course: </p><ul style=\"\"><li style=\"\">The Programming Language Lua – Build a solid understanding and foundation of the Lua programming language. </li><li style=\"\">Corona Basics – Here, you will discover some of the foundational pieces that make up Corona SDK, such as display objects, events, widgets, physics, and composer. Put Your </li><li style=\"\">Knowledge to Work – Learn By Doing. In this section of the course, you&#039;ll build a game called Bob the Catcher to help jump-start your game development career. </li><li style=\"\">Building More – This segment will cover how to create a 2D space shooter game filled with spaceships, lasers, and UFOs. </li></ul><p style=\"\">This online game development course is recommended for individuals who are just starting out in game development, but it can be just as useful for those who have already started their careers. From beginners to the slightly more advanced, every student will find something useful to take away from this course. </p><p style=\"\">Some of the topics covered in this course are: </p><ul style=\"\"><li style=\"\">Variables, Operators, and Tables</li><li style=\"\">For and While Loops </li><li style=\"\">If/Then Statements </li><li style=\"\">Functions </li><li style=\"\">Display Objects </li><li style=\"\">Event Listeners and Physics </li><li style=\"\">Widgets </li><li style=\"\">Composer Scene Management </li></ul><p style=\"\">This course uses the latest public build of Corona SDK, graphics 2.0, and the official scene management tool by Corona – Composer. </p><p style=\"\">Learn how to build games faster and better with Corona SDK and advance your game development career!</p>", 
    "end_date": null, 
    "title": "Intro to Mobile Game and App Development and Corona SDK 2015", 
    "price": "25.00", 
    "instructors": "Daniel Williams", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/504184_df1d_3.jpg", 
    "course_url": "https://www.udemy.com/mobile-game-development-and-corona/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-17T02:38:39Z"
}