{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This seven hour tutorial series has one main aim to it: give you a quick start guide to programming one of the hardest elements of any game, controlling your characters. Most programmers begin a new app by prototyping the controls. It&#039;s just a natural starting point for production, and it can be one of the biggest stumbling blocks for new developers. With a dozen example projects and 24 videos, you can start wherever you like and implement any of the control systems below…</p><ul style=\"\"><li>Accelerometer controls</li><li>Simple touches, taps and swipes</li><li>Rotation, pan, pinch, and long press gestures</li><li>Path-based movements</li><li>Aim and release slingshot style controls</li><li>Directional pad controls</li><li>Virtual joystick controls in a top-down flying game</li><li>Virtual joystick controls in an isometric-viewed world</li><li>Virtual joystick controls in a traditional side scroller/ platform world</li><li>Attacking, jumping and double-jumping with virtual buttons</li></ul>This series was developed with Swift 1.2 and uses Apple&#039;s very own Sprite Kit game engine. While you master the control methods above, you&#039;ll also learn the basics of game development: animating texture atlases, creating classes for players and collision objects, working with physics, creating world nodes, and countless other nuggets of know-how for making an awesome game with Xcode.", 
    "end_date": null, 
    "title": "iOS Control Systems with Swift 2 or 1.2 and Sprite Kit", 
    "price": "25.00", 
    "instructors": "Justin Dike", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505404_ad46_2.jpg", 
    "course_url": "https://www.udemy.com/ios-control-systems-with-swift-and-sprite-kit/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T18:28:55Z"
}