{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Para este projeto, usei como referencia os games dos anos 90 /2000 da Rareware / Nintendo64, então vamos construir um jogo de aventura / plataforma 3D</p><p>Durante este curso, procuro ensinar da forma mais simples possível, como desenvolver seu primeiro jogo em 3D, usando os recursos mais legais e simples da Unity5</p><p>No final, ainda mostro como se integra o projeto no SDK de Realidade Aumentada Vuforia 4, para rodar em dispositivos iOS e Android. (nas ultimas aulas uso o Xcode / iPad como exemplo para construir a aplicação)</p><p>Durante o curso, vamos ver como importar os modelos FBX do 3D Studio Max, configurar a cena, os modelos, texturas, luzes e as animações dentro da Unity 5</p><p>Depois vamos entender um pouco como funciona o componente Character Controller, para movimentar o personagem</p><p>Também vamos aprender a trabalhar com colisões, pegar os itens, partículas e efeitos sonoros.</p><p>Aprenderemos como implementar o Joystick Virtual, muito utilizado hoje em dia para jogos Mobile</p><p>No final do projeto, ensino como configurar a Vuforia, para construir a aplicação em Realidade Aumentada e executar a aplicacao no iPad para ser submetido para appStore.</p><p>O curso apesar de parecer complexo, e bem basico, e procuro usar uma linguagem clara, explicando em detalhes com zoom cada parte do processo.</p><p>O projeto final e os modelos utilizados durante o curso tambem sao disponibilizados para download.</p><p></p>", 
    "end_date": null, 
    "title": "Jogo de Plataforma em Realidade Aumentada - Unity 5", 
    "price": "30.00", 
    "instructors": "Tito Petri, Thiago Travi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493202_6db4.jpg", 
    "course_url": "https://www.udemy.com/felpudounity5/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T11:40:45Z"
}