{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>How to Create a tvOS Template for any SpriteKit Game</strong><br></p><p>In the first section we will create a tvOS template for navigating between scenes (Home, Features, Team Standings), and discuss ways to pass data around classes, save data using NSUserDefaults, swipe between menu options and much more. By the end of this course you will have a template you can begin any of your future tvOS apps with.</p><p><strong>How to Create a Side Scroller Game for tvOS or iOS - Session 1</strong><span><br></span></p><p>In this series you will learn how to create a retro 2d-style side scroller game from scratch for the new tvOS or for iOS. The project will be initially developed using the tvOS template, then you'll see how to take most of the same code and use it for an iOS app. We'll cover all the essentials to making a side scroller: building a physics-based environment (with platforms, vines, pipes, collectibles), programming a an easy character to move using swipes, adding the HUD (for things like Score or a Lives label), sound and much, much more. Toward the end of this session we'll also discuss how to add a tvOS target to an existing iOS project and share code / assets between the two targets.<span><br></span></p><p><span><strong>How to Create a Side Scroller Game for tvOS or iOS - Session 2</strong><span><br></span></span></p><p><span><span>The epic saga continues in this second session all about how to make a 2D side scroller for tvOS or iOS. We'll look at turning our GameScene into more of a \"game engine\" by incorporating a property list to change variables on a per-level basis. We'll also talk about scoring, moving platforms (that carry the player), \"dead zones\" to kill the player, restarting from continue points, inventory, and much more!<span><br></span></span></span></p>", 
    "end_date": null, 
    "title": "Learn tvOS for Game Development", 
    "price": "40.00", 
    "instructors": "Justin Dike", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653744_447f.jpg", 
    "course_url": "https://www.udemy.com/learn-tvos-for-game-development/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T19:13:03Z"
}