{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em>The course is continually updated, a major improvement was made in Glitch Garden in March 2016, and over 30 new quiz questions were added in June 2016.</em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\"></strong>This is the online game development school that was a <strong class=\"redactor-inline-converted\">r</strong><strong class=\"redactor-inline-converted\">unaway success on Kickstarter.</strong></p>\n\n\n\n\n\n<p>  \t                                                            Learn how to create video games using Unity 3D, the free-to-use game development tool. <strong class=\"redactor-inline-converted\">We start super simple </strong>so you need no prior experience or Unity of coding! With our online tutorials, you'll be amazed what you can achieve.  </p>\n\n\n\n\n\n\n\n<p>  \t                              Benefit from our <strong class=\"redactor-inline-converted\">world-class support </strong>from both other students, and Ben is on the forums regularly. Go on to build several games including a full 3D version of Pong with an online multiplayer scoreboard, and more.</p>\n\n\n\n\n\n\n\n<p>  \tYou will have access to a course forum where you can discuss topics on a course-wide basis, or down to the individual video. Our <strong class=\"redactor-inline-converted\">thriving discussion forum</strong> will help you learn and share ideas with other students. Check out our reviews to see how people love this feature.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                            <strong class=\"redactor-inline-converted\">Unity 5</strong>: The first part of the course is taught in Unity 4. 6, as this is well established and stable. When you get to Bowlmaster we upgrade to Unity 5, and start using it's great new features. You can use Unity 5 from the start if you wish, with only minor code differences. </p>\n\n\n\n\n\n\n\n<p>The course is <strong class=\"redactor-inline-converted\">project-based</strong>, so you will not just be learning dry programming concepts, but applying them immediately to real indie games as you go. All the project files will be included, as well as additional references and resources - you'll never get stuck. There are talking-head videos, powerful diagrams, quality screencasts and more.  </p>\n\n\n\n\n\n\n\n<p>  \t                                Oh, and it's just <strong class=\"redactor-inline-converted\">bigger and better </strong>than the competition. See the length and the reviews.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                            For each demo game you build you will follow this process...  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>Be challenged to build the entire game yourself.</li>  \t<li>Be shown step-by step how to build it.</li>  \t<li>Be challenged to apply, and re-apply your knowledge regularly.</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t                                                            You will get full <strong class=\"redactor-inline-converted\">lifetime access</strong> for a single one-off fee. The creators are qualified and experienced coders and avid gamers, so are able to explain complex concepts clearly, as well as entertain along the way. Most courses teach scripting using only C#.</p>\n\n\n\n\n\n\n\n<p>You will <strong class=\"redactor-inline-converted\">learn C#, including Test Driven Development</strong>, a highly valuable skill.  \t  \t                                                            By the end of the course you'll be very confident in the basics of coding and game development, and hungry to learn more.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">What this course DOESN'T cover...</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                                                Whereas this course is already huge, we can't possibly cover everything in that time. Here are some things we will not be covering...  </p>\n\n\n\n\n\n\n\n<ul><li>Performance optimization.</li>  \t<li>Editor plugins or modifications.</li><li>Physics engine modification*</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t                                                  * Separate mini-course to cover these this now available.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                            Anyone who wants to learn to create games: <strong class=\"redactor-inline-converted\">Unity 3D is a fantastic platform which enables you to make production-quality games.</strong> Furthermore these games can be created for Windows, MacOS, iOS (even iOS 9), Android and Web from a single source!</p>\n\n\n\n\n\n\n\n<p>If you're a complete beginner, we'll teach you all the coding and game design principles you'll need. If you're an artist, we'll teach you to bring your assets to life. If you're a coder, we'll teach you game design principles.  </p>\n\n<p><strong>Note:</strong> access to this course comes with an optional, free community site where you can share games and 3D models, as well as connect with other students.</p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">  Dive in now, you won't be disappointed!  </strong>  </p>", 
    "end_date": null, 
    "title": "Learn to Code by Making Games - The Complete Unity Developer", 
    "price": "50.00", 
    "instructors": "Ben Tristem", 
    "commitment": "51.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258316_55e9_4.jpg", 
    "course_url": "https://www.udemy.com/unitycourse/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-09T19:17:28Z"
}