{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>No-code Video Game Development with Unity3d and Playmaker</strong></p><p> teaches you how to create a modest <strong>FPS horror-survival</strong> video game without ever having to write a single line of code! By leveraging the powerful new technology of State Machines, a game developer can eliminate code and instead make diagrams to control the game's operations. Creating a video game is now as simple as drawing a flowchart!</p><p>The <strong>No-code Video Game Development with Unity3d and Playmaker</strong> course features <strong>over 6 hours of video tutorials</strong>, transcripts, 11 quizzes, <em>free Unity projects, scenes, packages, Playmaker templates, and art assets</em> (free FPS hands, free cyborg ninja, animations, and more)! Using tried and true Unity3d 4.x (and compatible with Unity 5) the course is divided into 3 sections:</p><ol><li>The first section is in-depth instruction of Unity, its capabilities, its use.   </li><li>The second section teaches programming concepts and vocabulary, stops just short of coding, and delves into Playmaker</li><li>The third section unifies concepts and execution in the form of an <strong>FPS survival horror project!</strong> </li></ol><p>  \t  If you:</p><ul><li>don't know how or where to get started in video game development</li><li>have ever dreamed of becoming a game developer but don't want to spend lots of money or years learning to code</li><li>started to learn coding only to stop time and time again</li><li>are a current developer wanting to learn a new, more productive pipeline</li><li>want free Unity projects, scenes, packages, Playmaker templates, and art assets</li><li>are finally ready to make your dream game come true</li></ul><p>The <strong>No-code Video Game Development with Unity3d and Playmaker</strong> course is for you!</p>", 
    "end_date": null, 
    "title": "Learn to Make Games Without Code - Using Unity and Playmaker", 
    "price": "50.00", 
    "instructors": "Michael Kelley", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325204_71a1_4.jpg", 
    "course_url": "https://www.udemy.com/nocodevideogamedevelopment/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T20:59:27Z"
}