{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Animation brings games alive. We believe creating great animation requires not only powerful software, but a powerful workflow. Spine is dedicated to 2D animation, providing an efficient workflow both for creating amazing animation and for integrating it into your games.</p><p style=\"\"><strong style=\"\">WHAT IS SPINE?</strong></p><p style=\"\">Spine is an animation tool that focuses specifically on 2D animation for games. Spine aims to have an efficient, streamlined workflow, both for creating animations and for making use of those animations in games.</p><p style=\"\"><strong style=\"\">BENEFITS</strong></p><p style=\"\">Animation in Spine is done by attaching images to bones, then animating the bones. This is called skeletal or cutout animation and has numerous benefits over traditional, frame-by-frame animation:</p><ul style=\"\"><li style=\"\"><strong style=\"\">Smaller size</strong> Traditional animation requires an image for each frame of animation. Spine animations store only the bone data, which is very small, allowing you to pack your game full of unique animations.</li><li style=\"\"><strong style=\"\">Art requirements</strong> Spine animations require much fewer art assets, freeing up time and money better spent on the game.</li><li style=\"\"><strong style=\"\">Smoothness</strong> Spine animations use interpolation so animation is always as smooth as the frame rate. Animations can be played in slow motion with no loss in quality.</li><li style=\"\"><strong style=\"\">Attachments</strong> Images attached to bones can be swapped to outfit a character with different items and effects. Animations can be reused for characters that look different, saving countless hours.</li><li style=\"\"><strong style=\"\">Mixing</strong> Animations can be blended together. For example, a character could play a shoot animation while also playing a walk, run or swim animation. Changing from one animation to another can be smoothly crossfaded.</li><li style=\"\"><strong style=\"\">Procedural animation</strong> Bones can be manipulated through code, allowing for effects like shooting toward the mouse position, looking toward nearby enemies, or leaning forward when running up hill.</li></ul><p style=\"\"><strong style=\"\">WHAT&#039;S IN IT FOR ME?</strong></p><p style=\"\">This course will take you step by step how to get the most out of your character by implementing basic and advance rigging techniques which will give you more animation functionality. You will learn proper ways to add vertices to your meshes and allow you to give your 2D characters a 3D feel. </p><p style=\"\">Easy to follow instructions for experienced and beginners. A full character rig is included with 6 different outfits for character customization. Take your game animations to the next level. Enroll today!<strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Learn Rigging & Animation Techniques in Spine", 
    "price": "25.00", 
    "instructors": "Take10 Animation Studios", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495512_f932_2.jpg", 
    "course_url": "https://www.udemy.com/take10animation/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T23:23:20Z"
}