{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>UPDATES: Thank you! I now have over 350 students and I am proud of all of you!</em></strong></p><p><strong><em>I am planning on adding bonus content in the future, if you become a student and like my work you can suggest for something for me to teach and I will give you credit for the idea!</em></strong></p><p><strong>After this course, you will know how to make games within hours, or weeks! </strong><br></p><p><strong>This course is exclusively on Udemy!</strong></p><p>With just 5 hours of commitment, you will learn how to build games and code.</p><p><em>You will look like the hardcore developers that you thought were gifted.</em><br></p><p><strong>And now you can be gifted yourself!</strong><br></p><ul><li><strong><em>With no budget</em></strong></li><li><strong><em>With no background knowledge</em></strong></li><li><strong><em>With no high end PC</em></strong></li></ul><p><strong><em></em></strong></p><p><strong>You can be the developer you always dreamed of!</strong><br></p><p><strong>Join the journey to become a master at Gamemaker: Studio</strong><br></p><p>In just one course, you will learn how to use and understand the GML language in Gamemaker: Studio. By making your own platform game, you will discover basics of Gamemaker and how to handle situations you have within your code. </p><p><strong>My Story</strong></p><p>I started off knowing no programming knowledge whatsoever with Gamemaker being my first programming language. I wanted to be the best game creator possible. I didn't become the best, but I knew how to make games that could make me income. My first completed game got me an offer of $120. I made that game within 12 hours with rarely any programming experience whatsoever. Now, I can make games with ease and make them look professional.</p><p><strong>I want to share my success in making games with you!</strong></p><p>One time, I spent around an hour making a joke game and uploaded it to Gamejolt! Within a couple of days I had gained money from ad revenue  and I had many people playing my game and had received 2.7K views. Many people on YouTube even uploaded themselves playing it!</p><p>I want you to experience the feeling of <strong>success </strong>I have had with making games. It isn't the profit that just matters, but the feeling of <strong>accomplishment </strong>and the sense that <em>\"I made this\"</em></p><p>This course will help you <strong>learn </strong>Gamemaker Studio!<br></p><p>This course is <strong>packed </strong>with Gamemaker Studio tutorials to help you reach your <strong>goal!</strong></p><p><strong>Every</strong><strong>day you will be left wondering how to make games.</strong><br></p><p><strong>If you don't learn anything, you can get your money back within your first </strong><strong>30 days</strong><strong> of owning this course! Buying this course is no </strong><strong>risk!</strong></p><p><em>Want to satisfy that temptation?</em><br></p><p><strong>Join the 300 students and counting! Click the take this course button now! </strong><strong></strong><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Gamemaker Studio with no past programming experience!", 
    "price": "30.00", 
    "instructors": "Benjamin Monderno", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545766_cffa_3.jpg", 
    "course_url": "https://www.udemy.com/learn-gamemaker-with-no-past-experience/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T17:59:18Z"
}