{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the the basic concepts of programming while developing games in the fun and friendly language Game Maker Language (GML).</p><p><strong style=\"\">Learn and Master Core Programming Concepts With GML.</strong></p><ul style=\"\"><li style=\"\"><span></span>Types and Operators</li><li style=\"\">Loops and Conditionals</li><li style=\"\">Functions and Return Values</li><li style=\"\">Objects and Instances</li></ul><p><br style=\"\"></p><p><strong style=\"\">A Powerful Tool to Create Amazing Games</strong></p><p>We&#039;ll learn about the essentials of programming. By using GameMaker: Studio, we can take what you&#039;re learning and immediately apply it to actual games. You will also get a glimpse of the structure of video games.</p><p>GameMaker: Studio is a powerful and growing tool that is breaking its way into professional development. Developers often use GameMaker: Studio to quickly prototype and create games that don&#039;t require the power of other languages, like C++, Java, and C#. Hotline Miami, Spelunky, TowerFall Ascension, and Gunpoint are only a few examples of the great games that can be created with GameMaker: Studio.</p><p><strong style=\"\">Content Overview</strong><br style=\"\"></p><p>While designing this course, I kept absolute beginners in mind. When you begin this course, you will be taken from the very basics and work your way up to the more complex concepts. There will be several quizzes along the way to test your knowledge of the concepts you are learning.</p><p>By the end of the course, you will understand core programming concepts, how to create games in GameMaker: Studio, and you will have a cool maze game that you can show off to your friends and family.</p>", 
    "end_date": null, 
    "title": "Learn to Code in Game Maker Language", 
    "price": "20.00", 
    "instructors": "Nicholas Cohran", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464428_4228_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-code-in-game-maker-language/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T22:31:39Z"
}