{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course, Philipp Schmidt is going to give us an introduction PixPlant while showing us how to make some basic tileable textures. To start this off, we will search perfect reference images which will give us a good base for this, and after a little intro to PixPlant and the process of making the texture tileable, we will use Bitmap2Material which is another powerful program used to create textures on the fly. After we have finished the Basic Texture in Bitmap2Material, we will switch over to Knald to create a new ambient occlusion map. From there we jump over to photoshop to create our albedo map in the first part, and in the second we will create our specular, glossiness and some nice variation masks to push our texture a little bit more. With our texture complete, we will create our dDO Custom Preset to use the texture with the Quixel Suite and then test out map in various software and game engines such as Marmoset, Unity, Unreal Engine 4 and CryEngine 3.<br style=\"\"></p><p><strong style=\"\">(Students - please look under Section 1 / Lecture 1 downloads for the source files associated with the lesson.)</strong></p><p>More about the Instructor:</p><p>Philipp Schmidt is graduated 3D Artist from Germany. He worked as freelance Artist on numerous unannounced projects. He always had a passion for 3D Art and Environments and he enjoys sharing his knowledge.<br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learn Texture Creation Using PixPlant and Bitmap2Material", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594324_49f0_2.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-learn-texture-creation-using-pixplant-and-bitmap2material/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T19:54:53Z"
}