{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<ul style=\"\"><li><strong style=\"\"></strong><strong style=\"\">What is this course about?</strong></li></ul><p>In this course we will create an entire 3d third person game using Unity and Playmaker. Every step of the process is included. Students will learn everything they need to know to make their own 3d games without writing one line of code. A non technical introduction to game dev course is included, as well as an introduction to Playmaker and 6 bonus advanced Playmaker tutorials.</p><p>Strip away the mystery of game development with Unity + Playmaker and get in the game!</p><ul style=\"\"><li><strong style=\"\">What materials are included?</strong></li></ul><p>All assets including 3d character models and animation used in the course are included.</p><ul style=\"\"><li><strong style=\"\">Ho</strong><strong style=\"\">w long will this course take?</strong></li></ul><p>It will take 2 - 7 days depending on your speed; there are 15 hours of total material.</p><ul style=\"\"><li><strong style=\"\">Ho</strong><strong style=\"\">w is this course structured?</strong></li></ul><p>In the course we will create a complete 3d third person game from beginning to end; complete with weapon pickups, enemy NPCs, a Boss Battle and an Intro Menu and &#039;Game Over&#039; screen. </p><ul style=\"\"><li><strong style=\"\">Why take this course?</strong></li></ul><ol style=\"\"><li>One of a kind instructor: this class is taught by indie game developer and internationally renowned award winning animation filmmaker M dot Strange. You can play the games the instructor has made, using the things he will teach you, at mdotstrange (dot) com; see for yourself if he knows what he is talking about.</li><li>Real world learning: use real assets taken from real working games. Everything you learn has been tested and used in games that have shipped.</li><li>Beginner friendly: Minimal geek speak is used so you won&#039;t have to google every other world to know what&#039;s going on.</li><li>Secrets Unlocked: Learn to do things the easy way. Making games is a lot easier than you think! Let us show you how!</li><li>We have fun: Learning from an instructor that loves what they do is a lot more fun than learning from someone that is just out to make a quick buck.</li><li>Learn More: Get a deeper understanding as our classes teach you the hows and whys, instead of just how to get an identical end result.</li></ol><p>No coding. No programming. Skip the grind of traditional game development like a boring cutscene by learning cutting edge visual scripting tools with the Strange School.</p><p><strong style=\"\">Start today and be a game developer tomorrow!</strong></p>", 
    "end_date": null, 
    "title": "Make Awesomely Strange Video Games with Unity and Playmaker", 
    "price": "50.00", 
    "instructors": "Michael \"M dot Strange\" Belmont", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597732_390c_3.jpg", 
    "course_url": "https://www.udemy.com/cant-code-who-cares-make-games-anyway/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T22:37:14Z"
}