{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Virtual Reality will be the next big thing... but only if we make it so!</strong></p>\n\n<p>After a false-start in the 1980s, it really is finally time for VR to shine. Facebook famously bought Oculus for $2bn in 2014, and this year will see several major headsets hit the market (Oculus Rift, Sony's PlayStation VR, HTC Vive and more).</p>\n\n\n\n\n\n\n\n\n\n<p>Major game engines such as Unity and Unreal are now supporting VR, and the computer power required to drive VR is finally affordable. Today we have some great platforms to work with including Oculus Rift, Google Project Cardboard, and Samsung Gear VR.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>What Will I Learn?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>You will learn about the current VR offerings, explore their fundamental capabilities and requirements. You'll then learn basic coding in C#, and brush-up your vector maths. From there we'll build Shoot Hoop, an Oculus Rift compatible game. Finally we'll make a fun game for Google Project Cardboard  - all using the free game development software Unity.</p>\n\n\n\n\n\n\n\n\n\n<p>This course is for beginner to intermediate students of Unity and C#. <strong>No prior programming or Unity knowledge is required</strong>, and any experience you have will only help.</p>\n\n\n\n\n\n\n\n<p>The free game engine Unity has the largest market share in indie games for a reason, it's modern and easy to use</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Why Learn This Now?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>All these new devices will need apps, and there's only one chance to be first in a particular space. Furthermore there are already millions (yes millions) of existing owners of Cardboard devices, and early Oculus Rift orders are very strong.</p>\n\n\n\n\n\n\n\n\n\n<p>Please note that to build to iOS devices for Google Cardboard you will need access to a Mac running a recent version of XCode. <strong>An Oculus Rift is optional, but not required for the course.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>In addition you can re-apply your knowledge to create apps for both the iOS and Android app store, which already have hundreds of VR apps. Now is just the right time to join them.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Who Are You To Teach Us?</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>Ben has already co-created the most popular game development courses on Udemy. Sam is a highly qualified computer scientist from Cambridge University. We're confident that we can help you build the skills in VR you need to get started.</p>\n\n\n\n\n\n\n\n\n\n<p>The VR wave is about to come in, and I'd love you to be on it with us.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Note</strong>: access to this course comes with an optional, free community site where you can share games and 3D models, as well as connect with other students.<br></p>\n\n<p>Samuel Pattuzzi &amp; Ben Tristem</p>", 
    "end_date": null, 
    "title": "Make VR Games in Unity with C# - Cardboard, Gear VR, Oculus", 
    "price": "35.00", 
    "instructors": "Ben Tristem, Sam Pattuzzi", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632414_e618_3.jpg", 
    "course_url": "https://www.udemy.com/vrcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T14:25:07Z"
}