{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tUnity is very powerful game development software but also can be <em style=\"\">very overwhelming</em>! I know, because I tried using it probably a dozen times, giving up in disgust each time.  </p>  <p style=\"\">  \tBut the last time I looked into it I discovered the secret to getting over the learning curve, and I created this course so you can skip the pain that comes from banging your head against the computer screen.  </p>  <p style=\"\">  \tThis <strong style=\"\">short</strong> course is designed for people who are <strong style=\"\">complete beginners with Unity</strong> but who want to get started with 2D game development. These videos will guide you through the steps needed to create physics-based &quot;bouncing and sliding&quot; demos that can then be expanded into games if you continue with your Unity experimentation.  </p>  <p style=\"\">  \tYou will:  </p>  <ul style=\"\">  \t<li style=\"\">Put sprites (graphic images) on the screen.</li>  \t<li style=\"\">Discover the basics of physics-based 2D games with Unity.</li>  \t<li style=\"\">Understand components such as colliders and rigidbodys.</li>  \t<li style=\"\">See how to use sorting layers to control the sprites.</li>  \t<li style=\"\">Make prefabs (prefabricated game objects) from your sprites and reuse them in new scenes.</li>  \t<li style=\"\">Create a bouncing and sliding demo without any coding!</li>  </ul>  <p style=\"\">  \tAll you need is the desire to create your own 2D video game, a copy of the Unity software (it&#039;s free!), and this course to get started. Don&#039;t know how to program in Javascript or C#? No problem, because you&#039;ll be working with visual game objects and no coding is required to be successful with this course!  </p>  <p style=\"\">  \tThe videos in this course are broken into short pieces and <strong style=\"\">guide you through every step</strong>. You don&#039;t need previous programming or game development experience to be successful with this course.  </p>  <p style=\"\">  \tThe free version of the Unity software can be used with this course so there&#039;s nothing holding you back from finally discovering the secret to getting started making your own 2D games using Unity.  </p>  <p style=\"\">  \tJump in and get started today!  </p>", 
    "end_date": null, 
    "title": "Make a Unity 2D Physics Game - For Beginners!", 
    "price": 0, 
    "instructors": "J. A. Whye", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412034_4b33_5.jpg", 
    "course_url": "https://www.udemy.com/unity-2d-bouncing-and-sliding-with-physics/", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T08:51:26Z"
}