{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Important: the code that comes with this game is 32 bit only (not 64 bit) which means, it cannot be used on the older iPhone 4, 5 and 5s</strong></p><p>  \t   Hello and Welcome!  </p>  <p>  \t   My name is Yohann, I am a College instructor. I've been teaching iPhone ( iOS ) programming for 5 years, and I'm also an Entrepreneur with 40 iPhone apps and games currently in the app store.  </p>  <p>  \t   Thank you for your interest in \"How to make your own iPhone game in a day\", with absolutely no coding involved.  </p>  <p>  \t   This is a very unique course. You are provided with a full working game, a pinball game, and I will show you, step by step, how to customize it to make it a totally new pinball game, and then I'll show you how to publish it in the app store.  </p>  <p>  \t   Now this isn't just another boring course about theories on how to make an app. NO WAY. At the end of this course, you will have your own game in the app store. The game comes with several ways to monetize itself. That's right. That's what it's all about, MAKE MONEY!  </p>  <p>  \t   You're not just building a game here, you're building a business. And that's not all. To top it off, you get an unlimited license on the source code that comes for FREE, so that you can rinse and repeat the whole process and keep making more money!  </p>  <p>  \t   Basically, That course pays for itself, so don't wait for another occasion to jump in. This is the right time and the right course for you.  </p>  <p>  \t   And if you're still not convinced, watch the introduction video to take a closer look at the priceless material this course brings you.  </p>  <p>  \t   It's never been easier as it is today to start your own business. So join now, create some awesome games, make money, take control of your life and live the lifestyle you always wanted to have.  </p>  <p>  \tThere has been plenty of reskins of these apps by myself and by many students.</p>  <p>  \tAlso feel free to ask me anything that goes through your mind, I love to help!</p>  <p>  \tCheers!  </p>  <p>  \tYohann  </p>", 
    "end_date": null, 
    "title": "Make Your Own iPhone Game in One Day Without Coding - iOS 7", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/76674_2240_6.jpg", 
    "course_url": "https://www.udemy.com/make-your-own-iphone-game-in-one-day-without-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-10T13:30:16Z"
}