{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>* This course teaches Unity version 4.x</strong></p><p>Many people have a perception that to successful mobile game development requires learning complicated and difficult skills and techniques. By learning the process with Unity 3D, these perceptions will be smashed. Not only is Unity 3D easy to get to grips with, it's extremely versatile too; so you can develop and publish games on almost any platform, for almost any device.</p><p><strong>Create Mobile Games for Any Platform</strong></p> <ul><li>Create a fully fledged iOS game in minimal time<strong></strong></li> <li>Master the craft of game development through experimentation with code and game play<strong></strong></li> <li>Publish your game on any mobile platform<strong></strong></li> <li>Understand the vast possibilities of a Unity 3D game for mobile<strong></strong></li> <li>Learn complex techniques in an easy, instantly usable manner<strong></strong></li></ul> <p><strong>Course Overview</strong></p><p>This course includes 9 hours of content and 34 lectures, and is suited to both experienced and budding game developers. You will create a dynamic Unity 3D game during the course, but the focus is not on completing a game, but mastering the art of game development through problem solving and experimentation.</p><p>You will begin by importing models and textures before progressing to level design, lighting and lightmapping. From there, you will compare and learn about GUI systems, specifically NuGUI. This sets the foundation for the next step; multiple cameras, avatar customisation, controlling your player's actions, scripting mecanim animation, and more. You'll finish off by creating particle effects, compiling and publishing your game. </p><p>By the end of this course, you will have created a complex Unity 3D game – having started with nothing but a blank screen – that can be instantly published and played on multiple platforms.</p><p><strong>About Unity 3D</strong></p><p>Unity 3D is a game engine used to create multiplatform 3D and 2D games for desktops, consoles, mobile devices and websites. Combining high end technology and tools with intuitive and customisable settings, it runs on almost every platform you can think of and is constantly developed and improved by its community of developers. As well as creating games, it also provides features such as ads, analytics, cloud building and multiplayer networking.</p>", 
    "end_date": null, 
    "title": "Mobile Game Development with Unity 3D", 
    "price": 0, 
    "instructors": "Stone River eLearning", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294668_ce08_2.jpg", 
    "course_url": "https://www.udemy.com/mobile-game-development-with-unity-3d/", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T14:37:37Z"
}