{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tThank you for your interest in this course on how to make and publish your own iPhone game today and make money. This is your instructor Yohann, This course is not just about theory, it’s about getting things done.  </p>  <p>  \tYou are provided with the source code which cost hundreds of dollars on its own, and you will be guided step by step on how to customize the game graphics, sounds and settings, and you will magically end up with your own game in the app store, ready to bring in revenue on a daily basis.  </p>  <p>  \tThe game comes with four advertising channels that will bring you money. I know it works because the game we are creating in this course called Jellow, had over 25000 downloads and brought back more than 2000 dollars in pure profit. I’m not saying revenue, I’m saying pure profit. Not bad at all when you know that it takes less than a day of work!  </p>  <p>  \tThis course is the simplest way to get your app business started and get your app published in the apple app store. It’s also for anyone who’d like to expand their app portfolio.  </p>  <p>  \tThe source code that is included in this course comes with an limited license, which means you can keep reusing it and make dozens of  different themes that will grow your profits exponentially.  </p>  <p>  \tDon’t wait for the next opportunity, this is the right course and the right time to be in the app store. Take a look at the course curriculum and let’s get started! We’ve got a lot of things to do.  </p>  <p>  \tSee you in the classroom.  </p>", 
    "end_date": null, 
    "title": "Mobile Game Development: Make & Publish iPhone Games", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144560_8908_4.jpg", 
    "course_url": "https://www.udemy.com/make-publish-your-own-iphone-game-today-make-money-now/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-09T15:14:15Z"
}