{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>COURSE IN DEVELOPMENT - Completes End of July 2016</strong></p>\n\n<p>Claim lifetime access today, and get all future updates for free. We're adding content faster than most people can take it, so why delay?</p>\n\n\n\n\n\n\n\n<p>===</p>\n\n\n\n\n\n<p>Want to pass Unity's new Certified Unity Developer exam?  This course is <strong class=\"redactor-inline-converted\">all you need to prepare for and pass the exam, in just one week.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Can I really prepare in a week?</strong> YES, we have tested our methodology, taken and passed the exam ourselves. By focusing your efforts into a short period of time just before the exam you will maximize your chances of making the 70% pass grade.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How is the course structured?</strong> Each section represents the topic areas as set-out in the certification requirements. Each lecture / question pair roughly corresponds to one question in the exam. The order is based on a logical order to learn, not necessarily the order of the exam.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How long will I need to study? </strong>We have prepared you 1000 quiz questions. We want you answering questions in about 30, so <strong class=\"redactor-inline-converted\">allow about 8 hours extra for quizzes</strong>. That makes a total time commitment of 30-40 hours of study. The best way is to do this in the 4-5 days leading up to the exam, but you could spread it over as much as 4 weeks.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Unity is quickly becoming the go-to game engine in the industry, and now is a great time to highlight your skills by becoming one of the first to become a Unity Certified Developer.</p>\n\n<p><strong>Note</strong>: access to this course comes with an optional, free community site where you can share games and 3D models, as well as connect with other students.<br></p>\n\n<p>See you in there!</p>", 
    "end_date": null, 
    "title": "Pass the Unity Certified Developer Exam - Lifetime Access", 
    "price": "20.00", 
    "instructors": "Ben Tristem, Sam Pattuzzi", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822660_1527_3.jpg", 
    "course_url": "https://www.udemy.com/unitycert/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T09:30:38Z"
}