{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t      Welcome to Practical Game Development in Unity 4: Level 2.1!  </p>  <p>  \t     his video series is all about the practical approach to using the tools made available to us in Unity 4 to create our very own video game! Over the course of this VTM, we will create a 3D Asteroids-style game - complete with Freelancer-style spaceship movement and weapon controls. We will show everything from a modular player controller all the way to implementing custom sounds - both 2D and 3D - and polishing the game up with a simple menu system complete with high scores! In addition, we will build a targeting HUD, a waypoint navigation system, and even some spiffy particle effects!  </p>  <p>  \t      Level 2.1 is the first in a series of training products centered around the creation of an open world 3D space game. The game we put together in this series will serve as the foundation of our future projects in this series!  </p>  <h5>Why Learn Unity?</h5>  <p>  \t      Unity is the fastest growing game engine on the market - favored by the smallest indie studios and the largest game development companies alike. Unity&rsquo;s flexible, extensible, editor and component-oriented architecture lends itself well to the creation of virtually any game or simulation imaginable!  </p>  <p>  \t      Finally, although there is a pro version of it; almost all of the features that make it one of the leading game-development platforms are available for both commercial and non-commercial use absolutely free!  </p>  <h5>What will you learn?</h5>  <p>  \t      We will be putting together a waypoint based Asteroids-like game with the following features:<br style=\"\">  \t      - Freelancer-style player controller and weapons system<br style=\"\">  \t      - A targeting HUD used to identify the next waypoint in the game<br style=\"\">  \t      - Additional HUD elements for player health, current speed, and time left<br style=\"\">  \t      - Both 2D and 3D sounds - including an engine sound with a variable pitch depending on speed<br style=\"\">  \t      - An endless asteroid field manager<br style=\"\">  \t      - Basic, scalable, menu system<br style=\"\">  \t      - High score management and persistence<br style=\"\">  \t      - The ability to construct multiple levels  </p>  <p>  \t      Though the course of the creation of our game, we will solve many common challenges that come up during game development: including collision detection, resource management, modularity of our code, and the interaction between different game objects.  </p>  <h5>What you need to follow along</h5>  <p>  \t<strong style=\"\">A basic understanding of Unity:</strong> We won&rsquo;t be covering elementary topics such what a game object is or how components work. If you have never touched Unity, we recommend you check out Practical Game Development in Unity 4: Level 1 first to get a grasp of the fundamentals. However, this series is great for people who know their way around Unity, but may still be uncomfortable about how to use its various tools and techniques to great effect.  </p>  <p>  \t<strong style=\"\">Beginner-level Understanding of C#:</strong> The bulk of code we will write will be relatively simple C#. In the few cases where more advanced features are utilized, the purpose of the code will be very apparent and provide for a great learning experience for beginner developers who wish the explore the language further.  </p>  <p>  \t<strong style=\"\">Unity Standard:</strong> We will be with the standard, free, version of Unity. If you haven&rsquo;t already, be sure to grab the latest version of the editor from the Unity website: <a href=\"http://unity3d.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">http://unity3d.com</a>  </p>  <p>  \t<strong style=\"\">Visual Studio or MonoDevelop:</strong> We will be using Visual Studio 2013 with ReSharper 8 installed. However, you will be able to follow along with either any version of Visual Studio (even the free express editions) from 2010 onwards - or with the free and open-source MonoDevelop installation that comes bundled with Unity.  </p>  <p>  \t<strong style=\"\">Optional - SourceTree:</strong> We recommend that developers working on any project, big or small, use source control. GIT is an excellent choice as it is free, widely supported, and doesn&rsquo;t require any special services to use locally. We will be using the SourceTree product by Atlassian to manage our GIT repository. Although this is an optional step that may be skipped; we do very much believe that getting into the habit of using source control in your projects is very important.  </p>  <h5>Future series</h5>  <p>  \t      We will be using this project as the foundation for a larger game that will be developed over the course of multiple video series. In the future, we will be adding open-world gameplay, ship-customization, AI, radar, trade lanes, multiple sectors and more! So be sure to check this series out, and stay tuned for upcoming releases!  </p>", 
    "end_date": null, 
    "title": "Practical Game Development in Unity 4: Level 2.1", 
    "price": "20.00", 
    "instructors": "3D BUZZ Programming and Digital Art training", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/125330_359d_5.jpg", 
    "course_url": "https://www.udemy.com/practical-game-development-in-unity-4-level-21/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-25T23:15:33Z"
}