{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>**Last Updated June 2016***</strong></p>\n\n<p><strong>**Now Supports Android and iOS Platforms - Dual Source Code Template Included**</strong></p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p><strong>**900 Students </strong>have joined my Amazing Course &amp; Growing<strong>***</strong></p>\n\n\n\n\n\n<p><strong>**</strong>A Technical Approach to Reskinning &amp;<strong> Template Included</strong><strong>***</strong></p>\n\n\n\n\n\n<p><strong>***</strong>Supercharge Your Reskinning Business Today<strong>, Includes Highly Priced App Template****</strong></p>\n\n\n\n\n\n<p><strong>**Engage and take a practical approach to reskinning, no more basic courses required***</strong></p>\n\n\n\n\n\n<p><strong>**The Ultimate Reskinning Technical Course on Udemy To Date and Includes a Free Resource Worth over $200USD Alone***</strong></p>\n\n\n\n\n\n<p>**<strong>Receive my support for any challenging bits ! I respond typically within 24 hours and never leave my students hanging\"</strong></p>\n\n\n\n\n\n<p>Interested in <strong>Making Games for Android or iOS ?</strong></p>\n\n\n\n\n\n<p>Look know further this is a non technical course on making your first game for android and ios the game being, icon mania trivia - similiar to guess one pic one word games. Learn without effort how to take your concept to reality with this simple course. Designed with you in mind, yes you the person who probably never looked at 1 line of code in their lives.</p>\n\n\n\n\n\n<p>Here's just a few things you will learn from this course</p>\n\n\n\n\n\n<ul><li><strong>How to Reskin Guess the Pic Template for Android and IOS,</strong></li><li><strong>A Reskinning Business Approach</strong></li><li><strong>Reskin Just about any game after this</strong></li><li><strong>Use your skills to look for work as a contractor.</strong></li><li><strong>Learn how to make games with no programming skills</strong></li><li><strong>Monetize your apps for success</strong></li><li><strong>A Hint of App Store Optimization that Will Fine Tune your Business</strong></li><li><strong>You'll be able to reskin, flappy bird, three's and much more with the help from this icon mania template</strong></li><li><strong>Reskin any guess the pic word trivia template game</strong></li><li><strong>Upload any app to the app store and more, </strong></li><li><strong>You'll receive my undivided support, to help you upload your first app to the app store.</strong></li><li><strong>And much much more....</strong></li><li><strong>Lifetime Access to All My Lectures, And always get the latest version of the code first</strong></li><li><strong>Refunds accepted </strong></li></ul>\n\n\n\n\n\n<p>This course is intended for people who have an urge to reskin games, in particular the guess the pic.</p>\n\n\n\n\n\n<p>You'll learn how to navigate Xcode and Eclipse, Reskin the App Template provided and easily be able to submit your very first reskinned app to the apple app store and google play.</p>\n\n\n\n\n\n<p>This is a technical reskinning course and aims to provide guidance on how to easily create and modify an app template to your very own game .</p>\n\n\n\n\n\n<p>Join today and you won't be any short of awesomeness as we walk through together step by step on how to<strong> reskin this type of game, prepare all the assets add your own advertising identifiers and much much more...</strong></p>\n\n\n\n\n\n<p><strong>Join Today and you Won't Be </strong><strong>Disappointed</strong></p>\n\n\n\n\n\n<p><strong>Here's what some people have to say</strong></p>\n\n\n\n\n\n<p><strong>\"<em>Great course, really engaged by what Marco has to say. I would highly recommend this course to anyone interested in app reskinning because it comes with a free template that he teaches you to use.\"</em></strong></p>\n\n\n\n\n\n<p><strong>I</strong>'ve been averaging<strong> a 4.5 star rating with my course, </strong>That's something really had to maintain !<strong> Join 900 Bright Appreneurs </strong>and learn from each other today !!</p>\n\n\n\n\n\n<p><strong>Join Now and stop wondering why, the price is an introductory price for those that missed out on the free course. The source code is available on my website, but without this highly effective video training it will take you days to get your head around. </strong></p>", 
    "end_date": null, 
    "title": "Publish your Own Guess the Word Game for Kids, iOS & Android", 
    "price": "20.00", 
    "instructors": "Marco Baatjes", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382464_eec0_2.jpg", 
    "course_url": "https://www.udemy.com/ios-app-reskinning-101-for-profits-fun-home-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T22:06:58Z"
}