{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    This course's main objective is to become the go-to source for anyone willing to enter the iPhone app industry.  </p>  <p>  \t   The course starts with us in front of a regular Apple computer (or MacInCloud for PC users) and I will guide you through all the step necessary to set up your computer for development. I will also go through each steps to become a licensed iOS developer.  </p>  <p>  \t   We will then install the game from the source code(included with this course), run the game on the simulator, then modify the graphics and sounds to customize the 'match 3' game into one of your own.  </p>  <p>  \t   Then we will setup three advertising channels to ensure money coming in. Then we will publish the game to the Apple app store.  </p>  <p>  \t   This course is not about theories. Once you complete this course, you have a real product of your own in the app store, bringing in profit. You can't pass this opportunity.  </p>  <p>  \tThere has been plenty of reskins of these apps by myself and by many students.</p>  <p>  \tAlso feel free to ask me anything that goes through your mind, I love to help!</p>  <p>  \tCheers!  </p>  <p>  \tYohann  </p>  <p>  \t *The sourcecode is not Candy Crush's source code, it does have the same match-3 game mechanics.  </p>", 
    "end_date": null, 
    "title": "Publish your own Candy Crush* iPhone Game Today. iOS Code", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/111340_419c_13.jpg", 
    "course_url": "https://www.udemy.com/earn-money-making-a-candy-crush-iphone-game-today-code-included/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-27T15:04:41Z"
}