{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>***** Do you know you can \"Publish iPhone games without coding\" ? *****</strong></p><p>This course will let you create a game similar to Splish-Splash, a top chart game in the iTunes app store, all of it without coding. I had many students those who wanted to create game apps but they where not interested to study codes or for some making game app with codes were hard. So here i am introducing a way to create games without coding. This course comes with the source code so you will not have to refer anything from anywhere rather than in this course. Everything you need is included in this course.</p><p><strong>WHAT YOU WILL GET AFTER COMPLETING THE COURSE ?</strong></p><p>You will have your very own iPhone game in the iTunes app store, ready to bring in revenues from Ads and in-app purchases.</p><p>You will be able to make an iPhone game similar to Splish Splash, without coding.</p><p>You will be able to get all free resources, including the source code with an unlimited license.</p><p>You can publish games every weekend, using the same source code, included within this course as a bonus, for free.</p><p>You will have the potential to make a lot of passive income.</p><p>Yes Here Is The Way To Make iPhone Game Apps Without Coding !</p><p><strong>************ READ ON ! **************</strong></p><p>Looking to boost your income as a App developer? Or maybe you're seeking a career change that gives you more free time and flexibility?</p><p>Then this is the right course for you.</p><p><strong>YOU CAN BECOME AN IOS GAME APP DEVELOPER</strong></p><p>iOS has a huge platform where you can sell your game app and make a lot of money . This course will take you from the very basic concepts of game development using the free software given by Apple.</p><p><strong>HOW MUCH DO YOU HAVE TO SPEND?</strong></p><p>There is actually no more expenses except signing up besides getting the iOS developer license ($99/year). And we will show you the places from where you can get the resources we want without spending a single dollar.</p><p><strong>*********** HOW MUCH YOU CAN EARN *******</strong></p><p>You can earn more than you think. I am the one example of that after studying this method i could create and publish game app every week . So i could make a lot of money without putting more effort . Join this course and follow me and you will make a lot money than you think.</p><p><strong>ENROLL THE COURSE NOW AND PUBLISH YOUR VERY FIRST GAME APP, all it takes is one free afternoon.</strong></p>", 
    "end_date": null, 
    "title": "Publish your SplishSplash iPhone game to iTunes store today", 
    "price": "20.00", 
    "instructors": "Yohann Taieb, Mohit Soni", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618240_e69d.jpg", 
    "course_url": "https://www.udemy.com/publish-your-splishsplash-iphone-game-to-itunes-store-today/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T15:49:18Z"
}