{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t Thank you for your interest in this course, my name is Yohann, I will be your instructor.  </p>  <p>  \t With this course, you get the full source code of a classic iPhone and iPad game called Tic Tac Toe. It is a 2 player game in which your goal is to complete a row, a column, or a diagonal with either three O&#039;s or three X&#039;s within the grid.  </p>  <p>  \t In this course I will show you everything you need to create your very own Tic Tac Toe game, with your very own graphics. Now don’t worry if you don’t know how to draw, because I will show the simple ways that are very powerful and you will be happily surprised with what you can do!  </p>  <p>  \t This course is a great way to start learning about the world of iOS development. In this course you will learn how to download and use Xcode, the software used to make apps. You will also learn about the iPhone simulator, how to take screenshots, create app icons, resize images, how to get the Apple developer license and for the brave ones, I will also show you how to publish your very own game in the itunes app store without having to write not even one single line of code.  </p>  <p>  \t So remember, with this course you not only get an education, you also get a full source code and 2 tic tac toc games graphic packs! Tic tac toe Rapid and Tic tac toe Cookie Edition. Fully Playable games!  </p>  <p>  \t Make the right decision and join us now. I’ll see you in the classroom.  </p>", 
    "end_date": null, 
    "title": "Publish Your TicTacToe iPhone Game without coding. For Kids", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/254558_7208_2.jpg", 
    "course_url": "https://www.udemy.com/publish-your-tictactoe-iphone-game-without-coding-for-kids/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-02T16:44:32Z"
}