{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">This course&#039;s main objective is to become the go-to source for anyone willing to enter the iPhone app industry.</p><p style=\"\">The course starts with us staring at the screen of an Apple computer (or MacInCloud for PC users) and I will guide you through all the step necessary to set up your computer for development. I will also go through each steps to become a licensed iOS developer.</p><p style=\"\">We will then install the game from the source code(included with this course), run the game on the simulator, then modify the graphics and sounds to customize the &#039;Amazing Hero&#039;* game into one of your own.</p><p style=\"\">Then we will setup the advertising networks to ensure money coming in. Then we will publish the game to the Apple app store.</p><p style=\"\">This course is not about theories. Once you complete this course, you have a real product of your own in the app store, bringing in profit. You can&#039;t pass this opportunity.</p><p style=\"\">There has been plenty of reskins of these apps by myself and by many students.</p><p style=\"\">Go Take a look at them on the iTunes app store. Look for &#039;<strong style=\"\">Stick Hero Run - Free&#039;<strong style=\"\"> on the itunes app store.</strong></strong></p><p style=\"\">Also feel free to ask me anything that goes through your mind, I love to help!</p><p style=\"\">Make sure to check AppsFresh website, plenty of resources there.</p><p style=\"\">*The source code mimic mechanics of the original Stick Hero game for iPhone.</p>", 
    "end_date": null, 
    "title": "Publish Stick Hero iPhone game - monetize with Ads - no code", 
    "price": "20.00", 
    "instructors": "Yohann Taieb, Mohit Soni", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521678_2641_2.jpg", 
    "course_url": "https://www.udemy.com/ios-publish-stick-hero-iphone-game-monetize-with-ads-no-code/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-06T01:10:29Z"
}