{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Games by their very nature are supposed to be fun. So why should the process of creating them be tedious and complicated? Instead of sitting through hours of lectures and game development theory, this course cuts to chase and allows you to create a game straight away, learning as you go. <b></b></p><p><b>Learn Python game development by creating your own game</b></p><ul><li>Gain practical experience in Python game development</li><li>Develop a clone of Flappy Bird using Python game programming</li><li>Create levels with increasing difficulty and complexity</li><li>Understand and utilize the opportunities Python games provide</li></ul><p><strong></strong><b></b></p><p><b>Master game development in a fun environment</b></p><p>Python game programming is a set of Python modules designed specifically for writing games. It allows you to create fully featured games and multimedia programs using the Python programming language. Python is highly popular and versatile, running on almost every platform and operating system out there; so mastering it is of enormous benefit whether you want to create Python games or pretty much anything else. By completing this course, you can create open source, free, freeware, shareware and commercial games using Python game programming. <b></b></p><p><b>Course Overview</b></p><p>This course contains 21 lectures and over 3 hours of content. It is intended for those who already have a working knowledge of Python programming or general programming, and who want to apply their skills to games development. However, beginners may still be able to follow the course too.</p><p>The main focus of this course is to create a clone of the smash hit (and extremely simple) game Flappy Bird using Python game programming. You will first be introduced to Python programming concepts and initial coding, and then delve straight into the making your game from scratch.</p><p>The first two elements of the game you will learn are the time clock and game over. From there, you'll progress to initial graphics setup including the background and adding graphics to the screen. Following that, you'll move on to working with coordinates.</p><p>The next few sections of the course focus in detail on creating input controls, boundaries, crash events and menu creation, as well as creating obstacles using polygons. Finally, you'll add the finishing elements to your game like game logic, score display, colours, and most importantly, difficulty levels. </p><p>By the end of this course you will have created your own Flappy Bird game from scratch using Python game programming and Python game development techniques. The skills you picked up along the way will give you a solid groundwork for creating bigger, more complex, and more versatile games that can be run on any platform or any operating system.</p>", 
    "end_date": null, 
    "title": "Python Game Development - Create a Flappy Bird Clone", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/283781_88d0_3.jpg", 
    "course_url": "https://www.udemy.com/python-game-development-create-a-flappy-bird-clone/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-19T15:21:35Z"
}