{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Den Game Maker kannst du kostenlos auf der offiziellen Webseite von Yoyogames downloaden!</strong></p>\n\n<p><strong>Der einfache Einstieg in die Welt der Spiele-Entwicklung<br></strong>Möchtest du deine eigenen Video-Spiele entwickeln? In diesem Kurs zeige ich dir wie! Eventuell bist du schon im Besitz des kostenlos erhältlichen \"Game Maker Studio\" und fühlst dich von all den Dingen die man lernen muss überfordert? Ich nehme dir all diese Hürden ab und biete dir einen roten Faden beim Erlernen der Programmiersprache GML. In diesem Kurs lernst du nämlich Schritt für Schritt all die Features der Programmiersprache kennen um danach deine eigenen Spiele-Ideen in die Tat umsetzen zu können.<br></p>\n\n<p><strong>Programmieren ist nicht schwer!<br></strong>Programmieren ist leichter als man denkt. Viele Menschen haben Angst sich an ihre erste Programmiersprache zu wagen, da das Thema kompliziert und zeitaufwendig zu sein scheint. Mit diesem Kurs nehme ich diese Angst und gebe einen leitenden Faden, sodass man selbst die schwierigeren Themen kinderleicht versteht.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Im Kurs lernst du die <em>Game Maker Language</em> (kurz <em>GML</em>) kennen. Eine Sprache mit der du professionelle PC-, Handy-, Tablet- oder Web-Spiele programmieren kannst. Die <em>GML</em> ist dabei eine sehr einsteiger-freundliche Programmiersprache und du wirst beim Lernen schon sehr schnell tolle Ergebnisse sehen. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Was bietet der Video-Kurs:<br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Was ist Code?</strong></li><li><strong>Die Programmiersprache GML lernen!</strong></li><li><strong>Wie nutze ich die GML-Dokumentation richtig?</strong></li><li><strong>Alle GML-Grundlagen. Von Variablen bis hin zu Datenstrukturen!</strong></li><li><strong>Einführung in die Spiele-Entwicklung mit dem Game Maker: Studio!</strong></li><li><strong>30 TAGE GELD-ZURÜCK-GARANTIE!</strong></li><li><strong><strong></strong>Abschluss-Bescheinigung! (Zertifikat)</strong></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Du bist nicht alleine!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Bei Fragen und Anregungen bin ich über die im Kurs angegebene E-Mail-Adresse erreichbar. So kann ich sicherstellen, dass selbst wenn in den Videos etwas unklar sein sollte, nichts unverstanden bleibt. Auch wenn du Kritik zum Kurs äußern möchten, kannst du das über die E-Mail-Adresse machen oder mir hier auf Udemy eine Privatnachricht schreiben!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Doch auch die Kommunikation mit anderen Kursteilnehmern ist möglich!<br>Im Kurs-Dashboard kannst du mit anderen Teilnehmern Diskutieren.</p>", 
    "end_date": null, 
    "title": "Spiele programmieren im Game Maker: Studio", 
    "price": "20.00", 
    "instructors": "Janek Pruin", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688006_fb6f_5.jpg", 
    "course_url": "https://www.udemy.com/programmieren-lernen-mit-game-maker-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T15:24:02Z"
}