{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>So gestalten Sie Ihre ersten Computerspiele! Lernen Sie in zahlreichen Praxisvideos die faszinierende Welt der Spieleprogrammierung kennen und erleben Sie, wie einfach der Einstieg ist. Garvin Gurbat zeigt Ihnen, wie Sie Unity einrichten und richtig bedienen. Sie erfahren, wie Sie die Werkzeuge und Funktionen einsetzen, die Spielfiguren steuern und Sound-Effekte erzeugen. Machen Sie bei drei spannenden Spieleprojekten mit und erstellen Sie mit Unity eigene Spielekomponenten, Grafiken und Animationen ganz nach Ihren Vorstellungen. Und das Beste: Sie brauchen keine besonderen Programmierkenntnisse!</p>\n\n<p><strong>- Einstieg ohne Vorwissen – So entwickeln Sie Ihre eigenen Computerspiele!</strong></p>\n\n<p><strong>- Alle Skripte und Spielekomponenten für Ihr erstes Computerspiel</strong></p>\n\n<p><strong>- Drei Komplettworkshops: Arcade-Actionspiel, Adventure, Jump-and-Run</strong></p>\n\n<p>Garvin Gurbat ist Software-Entwickler, Fachinformatiker und Computerspieler aus Leidenschaft. Seit vielen Jahren befasst er sich intensiv mit der Entwicklung von Computerspielen und kennt die Unity-Engine bis ins kleinste Detail. Die Spieleszene und die Unity-Community sind sein zweites Zuhause. Neben einem Blog für Retro-Spiele betreibt er auch einen »Let's-Play«-Kanal auf YouTube.</p>", 
    "end_date": null, 
    "title": "Spiele entwickeln mit Unity 5 - Das umfassende Training", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535332_ece0.jpg", 
    "course_url": "https://www.udemy.com/spiele-entwickeln-mit-unity-5-das-umfassende-training/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T18:01:25Z"
}