{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>UPDATE (Januar 2016): 3D Spiel Zombie Survivor hinzufügt (insgesamt jetzt 5 Spiele!)</strong></p>\n\n<p>Lerne wie man Videospiele mit Unity 3D, dem kostenlosen Speileentwicklungsprogramm erstellt.<br>Wir fangen mit extrem einfachen kleinen Schritten an, es ist also egal ob Du bereits Programmieren kannst, oder ein kompletter Anfänger bist.</p>\n\n\n\n<ul><li>Einstieg in Unity</li><li>Programmierung in C#</li><li>Coole Animationen erstellen</li><li>Benutzung von Unity's Physics System</li><li>Menüs und Einstellungen erstellen</li><li>Erstellung von 2D und 3D Spielen</li><li>Und vieles mehr!</li></ul>\n\n\n\n<p><br>Du erhältst <strong>grandiosen Support </strong>von mir und meinem Assistenten. Folglich stehen wir Dir zur Seite, falls Du mal nicht weiter weißt.<br><br>Der Kurs ist <strong>komplett Projekt basiert</strong>, also keine ewig lange Theorie, sondern direkt coole eigene Spiele. Du entwickelst also von Anfang an echte Spiele.<br><br>Nachdem wir die Grundlagen der Programmiersprache C#, in etwa einer Stunde durchgearbeitet haben, beginnen wir bereits mit unserem ersten Spiel. Einem Space Invader Clon. Dabei wirst Du direkt lernen wie man einen Figur bewegt, wie man Spielephysik einfügt etc.<br><br>Danach werden wir uns an ein alt bewährtes super Spiel machen \"<strong>Minesweeper</strong>\". Dabei handelt es sich um einen mega Klassiker. Dabei lernst Du Spielelemente wie Timer, Highscores, Verschiedene Bedienelemente etc. kennen.<br><br>Mit Minesweeper ist es aber noch nicht erledigt. Wir werden uns auch um Pong kümmern, einem anderen Klassiker. Hierbei werden wir uns jedoch vor Allem mit Menüs, Spieleinstellungen und der Künstlichen Intelligenz kümmern.<br><br>Als krönenden Abschluss erstellen wir <strong>ein super umfangreiches Tower Defense Spiel</strong>. Diese Spieleart ist extrem beliebt und Du kannst ihn danach komplett anpassen und<strong> Dein eigenes Mega Spiel</strong> daraus machen.<br><br>Dieser Kurs ist <strong>das Beste</strong> was es <strong>im deutschsprachigen Raum</strong> gibt. <br><br>Es ist folglich der ideale Kurs, wenn es darum geht geniale Videospiele mit Unity 5 zu entwickeln. Dem Tool, dass es <strong>ermöglicht Spiele für iOS, Android, PC, Xbox, PS</strong>4 etc. zu entwickeln und welches von einigen großen Entwicklerstudios verwendet wird.<br><br><strong>Nimm jetzt teil! Du wirst es nicht bereuen!</strong></p>", 
    "end_date": null, 
    "title": "Spiele entwickeln mit Unity - Erstelle eigene Games in C#", 
    "price": "50.00", 
    "instructors": "Denis Panjuta, Panjutorials – Tutorial-Plattform", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373208_1ccb_5.jpg", 
    "course_url": "https://www.udemy.com/derkompletteunitykurs/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-18T11:08:16Z"
}