{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>The Mission:</strong><br>Your child is brilliant! I know this because he or she is in the most creative age group in the world! This is the first time in history a child can truly express themselves to thousands of others and add value to their own lives easily. The goal of this course is to turn your child into an innovator. I will give them the tools necessary to put what is on their mind to the screen. <br><br><strong>How?</strong><br>The Scratch programming software was developed by a team at the Massachusetts Institute of Technology and has proven to be very effective for entry level programmers. We will start by learning about the user interface. Your child will quickly build the confidence needed to start creating games by themselves!</p>\n\n<p><strong>When?</strong></p>\n\n\n\n<p>Now! Your child will go from loving and playing video games to loving and creating them! If your child becomes a proficient programmer now they will create amazing things in the future! Technology will improve, let your kids improve with it.<br><br><strong>Never Stop Learning!</strong><br> I am always improving this course! I add, revise, and optimize content constantly. To keep you updated, I make regular announcements on the awesome innovations I find on Scratch.</p>\n\n\n\n<p><strong>Score!</strong></p>\n\n\n\n<p>Your child will have the ability to share his or her game with thousands of other like minded individuals. Scratch is a community of young people that's always looking to improve! If your child enjoys building things, they will enjoy this community.  This is the future.<br><br>I am excited to get started, see you soon!</p>", 
    "end_date": null, 
    "title": "The Scratch Academy - Entry Level Computer Programming", 
    "price": "20.00", 
    "instructors": "Benjamin East", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617606_9bf1_2.jpg", 
    "course_url": "https://www.udemy.com/scratch-beginner-to-scratch-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T23:27:03Z"
}