{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">NEW BattleTank section shipping now</strong>, this includes...</p>\n\n<ul><li>Deep dive into control systems</li><li>Much more C++ and Blueprint</li><li>Particle systems and projectiles</li><li>Using and extending Unreal's AI pathfinding</li><li>Simple 2D User Interface design and more.</li></ul>\n\n\n\n\n\n<p>This course is the beginning of a project that was a runaway success on Kickstarter. Get involved now, and get access to all future content as it's added. The final course will be over 30 hours of content and 200+ lectures.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Learn how to create and mod video games using Unreal Engine 4, the free-to-use game development platform used by AAA studios and indie developers worldwide. <strong class=\"redactor-inline-converted\">We start super simple</strong> so you need no prior experience of Unreal or coding! With our online tutorials, you'll be amazed what you can achieve.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Benefit from our <strong class=\"redactor-inline-converted\">world-class support</strong> from both other students, and Ben who is on the forums regularly. Go on to build several games including a full 3D version of Pong with an online multiplayer scoreboard, and more.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You will have access to a course forum where you can discuss topics on a course-wide basis, or down to the individual video. Our <strong class=\"redactor-inline-converted\">thriving discussion forum</strong> will help you learn and share ideas with other students.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You will <strong class=\"redactor-inline-converted\">learn C++, the powerful industry standard language from scratch.</strong> By the end of the course you'll be very confident in the basics of coding and game development, and hungry to learn more.</p>\n\n\n\n\n\n\n\n\n\n<p>Anyone who wants to learn to create games:<strong class=\"redactor-inline-converted\"> Unreal Engine is a fantastic platform which enables you to make AAA-quality games</strong>. Furthermore these games can be created for Windows, consoles, MacOS, iOS, Android and Web from a single source!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>If you're a complete beginner, we'll teach you all the coding and game design principles you'll need. If you're an artist, we'll teach you to bring your assets to life. If you're a coder, we'll teach you game design principles.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What this course DOESN'T cover...</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Whereas this course is already huge, we can't possibly cover everything in that time. Here are some things we will not be covering...</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Team collaboration topics.</li><li>Editor plugins or modifications.</li><li>Physics engine modification.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Note</strong>: access to this course comes with an optional, free community site where you can share games and 3D models, as well as connect with other students.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">Start your transformation now, you won't be disappointed!</strong></p>", 
    "end_date": null, 
    "title": "The Unreal Engine Developer Course - Learn C++ & Make Games", 
    "price": "45.00", 
    "instructors": "Ben Tristem", 
    "commitment": "22.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657932_c7e0.jpg", 
    "course_url": "https://www.udemy.com/unrealcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T17:09:54Z"
}