{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Are you looking for building your career as a game developer, or building a game studio that creates exceptional games? Do you want to build the next big game hit that will break the app store records? Do you want to entertain millions of people, and add fun to their lives? </p><p>If yes, then you have come to the right place. \n</p><p>This second-by-second crafted course is a complete Unity game development experience that will take you into a journey that starts by finding an idea of your game, prototyping your game, putting the structure and developing your game whether in 2D or in 3D, and then publishing it using the Unity game engine.\n</p><p><strong>You will learn how to design your game, validate it, build it and see it live and working and play it with your own hands.</strong></p><p>During the course, you will build a <strong>Candy Crush, Subway Surfers</strong><strong>,</strong> <strong>2D platformer</strong> in addition to <strong>3D Balance Ball</strong> \"like\" games to practice what you are learning.</p><p><strong>What do students say about this course?</strong></p><p><strong>5-Star Review</strong>: \"Excellent content structure. Topics covered are explained in a way to really understand them. Up to date, and covers latest unity 5 features. I've never enjoyed the online learning course like this before. He catches all essential parts of game dev with well divided lectures. And overall lectures have good balance of the background knowledge and the real code. If you wanna learn unity game dev as quick as possible without missing any important points, this is the answer for you.\" by <strong>David Borg</strong></p><p><strong>5-Star Review</strong>: \"This course covers unity fundamentals very well, helped me a lot to understand unity game development basics, and see many exercises. I am still going through the course, but until now everything seems great!\" by <strong></strong><strong>John Evans</strong><strong></strong></p><p><strong>------</strong></p><p>10 years ago, building games was a complex thing. In order to build a game, you had to get your hands dirty with physics, graphics, and math code. It was something only big companies can afford; companies that have millions of dollars to spend on creating their games.\n</p><p>But thanks to the Unity 3D Game Engine, now game development has become a breeze! Unlike the old age of game development, now an indie team of 2 or even 1 game developer can produce games and easily publish and market them.\n</p><p>Unity has become a part of the success of many popular games; Monument valley, threes, Odd world: New n tasty, bad piggies, and hundreds of other titles. The simplicity of the engine, in addition to the vast number of platforms it supports makes it a great choice to depend on.\n</p><p><strong>Content and Overview </strong></p><p>Throughout this hand-crafted course, you’ll learn all of the Unity game engine's capabilities and establish a strong understanding of the concepts behind game development.</p><p>You will understand how to design your games, how to program in C#, experiment each of Unity’s components, apply physics, add materials to your game objects, adjust lighting, cameras, play sounds, animations, and deploy your games on mobile devices. In short, you will be exposed to every single aspect that you will need to build fantastic games in Unity.\n</p><p>In your journey in this practical course, your learning experience will always be exercised with challenges. You will write complete programs, and build 4 complete 3D and 2D games from scratch that bridge the gap between theory and practice, and prepare you to be a great hands-on game developer after you graduate from the course. </p><p>This course assumes no previous experience. It takes you from the absolute beginner game development concepts, downloading and installing the Unity Game Engine, writing your very first C# program, and then goes into more detail to explore the entire Unity Game Engine's feature set.</p><p>Every single lesson in the course has been pre-directed and supplied with animated materials that help deliver complex concepts in the easiest way possible. Utilizing this, the course has been designed to teach you all the aspects and features that the Unity engine provides in an efficient way that saves your precious time. Why would you spend 50 hours to learn game development while you can do it in less than half of that time?</p><p>Built from the ground up with modularity in mind, this Unity course is perfectly suitable for both complete beginners and more advanced developers. Want to learn only 2D game development, not 3D ? Well, skip directly to the 2D game development section in the course.</p><p>Now, what are you waiting for? <strong>Join the course, and start building your dream game in Unity now!</strong> </p>", 
    "end_date": null, 
    "title": "The Complete Unity 5 Guide: Unity Game Development Made Easy", 
    "price": "30.00", 
    "instructors": "Ahmed Swilam", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647844_c368_3.jpg", 
    "course_url": "https://www.udemy.com/build-your-dream-game-learn-unity-course/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T13:58:13Z"
}