{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>*** This Is The Only LibGDX Course That Teaches How To Make Complete Games From Scratch On Udemy!!! ***</strong></p><p><strong>The course is completely project based, and we are going to create full featured games from scratch using LibGDX framework.</strong></p>\n\n\n\n\n\n<p><strong>We will start with simple things</strong> <strong>so you will be comfortable if you are using LibGdx for the first time.</strong></p>\n\n\n\n\n\n\n\n<p><strong>You will also benefit from my super fast response if you have\n any issue that you are stuck with(I check Udemy forums every day if \nsomeone posts a question). Oh and all the students taking the course \nwill also be there to help you!</strong></p>\n\n\n\n\n\n\n\n<p><strong>All project files will be included and you are free to use them for anything that you like, personal or commercial use!</strong></p>\n\n\n\n\n\n\n\n<p><strong>Lets take a look at the games that we are going to create inside of this course:</strong></p><p>We are going to start with a simple game that I call Jack The Giant. \nIn this game we are going to help Jack climb down the beanstalk, along \nthe way we can jump on white clouds but we need to avoid dark clouds. \nBesides of creating our gameplay we are going to create menus, implement\n background music, and much much more.</p>\n\n\n\n\n\n<p>The next game that we are going to create is Flappy Bird, and I know \nwhat you are thinking oh not another Flappy Bird clone, but this is not a\n regular Flappy Bird clone, oh no, I've added a lot of features that you\n can't find in any other flappy bird clone such as selecting a \nbird(choose between different flappy birds), and \nmany other features that you will see inside of the course.</p><p><strong>Using what you obtain in this course, you will be equipped \nwith more than enough knowledge in order to continue improving yourself \nin the field of game development, using LibGDX or any other game engine.\n</strong></p>\n\n\n\n\n\n<p>If You ever had an idea for an awesome game, then enroll in this \ncourse and learn the tools that you need to develop Your next hit \ngame!!!</p>\n\n\n\n\n\n\n\n<p><strong>What Is Your Risk  By Taking This Course?</strong></p>\n\n\n\n\n\n\n\n<p><strong>Nothing!! If you are not satisfied with the course, I promise I will give you a full refund of your money NO questions asked!!</strong>\n</p>\n\n\n\n\n\n\n\n<p><strong>Enroll Now!! You Will Not Be Disappointed!!</strong></p>", 
    "end_date": null, 
    "title": "The Complete LibGDX Game Course Using Java", 
    "price": "20.00", 
    "instructors": "Awesome Tuts", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/851020_a641_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-libgdx-game-course/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T18:45:06Z"
}