{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Starting with no prior knowledge of UDK, this course exposes you to the main features of UDK, UnrealScript, and Kismet while showing you how to build a third-person platformer game.  </p>  <p style=\"\">  \t  On this journey, you will first learn how to build a level and an area by making use of models and geometry. Following this, you will make full use of Kismet, the Unreal Engine’s visual scripting tool, to create collectibles and a simple checkpoint system. Once the basis of the game has been created, you’ll be ready to dive in to the world of UnrealScript by first setting up its working environment. Next, you will learn how to create custom gameplay behaviors and a camera system. Lastly, you’ll see how to customize your UDK game to replace the default settings with your own main menu, loading screen, and splash screens! By the end of this course, you&#039;ll have a solid foundation in building games which you can use in your own future projects.  </p>  <h4><strong style=\"\">About the Author</strong></h4>  <p style=\"\">  \t<strong style=\"\">John P. Doran</strong> is a technical game designer who has been creating games for over 10 years. He has worked on an assortment of games in teams with members ranging from just himself to over 70, in student, mod, and professional projects.  </p>  <p style=\"\">  \t  He previously worked at LucasArts on Star Wars: 1313 as a game design intern; the only junior designer on a team of seniors. He was also the lead instructor of DigiPen-Ubisoft Campus Game Programming Program, instructing graduate-level students in an intensive, advanced-level game programming curriculum.  </p>  <p style=\"\">  \t  John is currently a technical designer in DigiPen&#039;s Research and Development department. In addition to that, he also tutors and assists students on various subjects while giving lectures on game development, including C++, Unreal, Flash, Unity, and more.  </p>", 
    "end_date": null, 
    "title": "UDK Game Development", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368681_e723_2.jpg", 
    "course_url": "https://www.udemy.com/udk-game-development/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T07:52:35Z"
}