{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Update 12.03.2016:</strong> вторая часть курса, посвященная программированию игры на языке C# одобрена и находится в списке моих курсов, присоединяйтесь!</p><p>************************************************************************</p><p><strong>Update 05.12.2015:</strong><strong></strong> Уже почти 500 обучающихся на этом курсе! </p><p>************************************************************************<br></p><p>  \t                В представленных уроках высокого качества мы подробно разберем с вами все <strong>этапы создания современной компьютерной игры</strong>; рассмотрим интерфейс, основные понятия и концепции современного программного обеспечения для создания игр; научимся программировать логику игры с использованием Javascript. Вот что мы с вами будем делать в этой части:  </p>  <ul>  \t<li>установим и настроим внешний вид Unity;</li>  \t<li>рассмотрим основные понятия этого \"движка\": game object, asset, prefab, компонент, сцена и т.д.;</li>  \t<li>научимся расставлять и изменять игровые объекты в виртуальном трехмерном пространстве;</li>  \t<li>рассмотрим, что такое камера, источники света, частицы;</li>  \t<li>Рассмотрим магазин игровых объектов Asset Store от компании Unity Technologies;</li>  \t<li>научимся использовать физику внутри своей игры.</li>  </ul>  <p>  \t              Курс разбит на последовательности действий, выполняя которые автор подробно раскрывает некоторые секреты создания компьютерных игр с использованием Unity. По окончании первой части курса, помимо сертификата, вы получите практические навыки, которые позволят вам продолжить свою карьеру в игровой индустрии. Unity активно используется сегодня как независимыми разработчиками, так и большими студиями для создания компьютерных игр высокого качества.  </p>  <p>  \t              Автор предлагает на каждом этапе создания игры воспользоваться уже готовыми файлами (трехмерные модели, скрипты, текстуры), которые будут доступны для скачивания и использования в вашем проекте. Проект посвящен созданию одного уровня компьютерной игры \"Save Aliens!\".  </p>  <p>  \t    --  </p>  <p>  \t    The author offers at each stage of the game to take advantage of ready-made files (three-dimensional model, scripts, textures), which will be available for download and use in your project. The project is dedicated to creating the same level of the computer game \"Save Aliens!\".  </p>", 
    "end_date": null, 
    "title": "UNITY: как сделать свою игру? Основные концепции", 
    "price": "20.00", 
    "instructors": "Evgeniy Solovey", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101142_78af_10.jpg", 
    "course_url": "https://www.udemy.com/unity-make-your-game/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-03T18:59:24Z"
}