{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Enroll Now And Make Your Own In App Purchase Game!</strong><br></p><p><strong>***** Course is Created with Unity 5 - 2016 *****</strong></p><p>With this course it will never be easier than now to build IAP inside your games!!</p><p><strong>This is a course I wish I had when I first started to learn game development.</strong></p><p><strong>The course is completely project based (top down approach), and we are going to create and publish a complete IAP featured game using Unity Game Engine.</strong></p><p><strong></strong></p><p><strong>You will also benefit from my super fast response if you have any issue that you are stuck with(I check Udemy forums every hour if someone posts a question). and don't forget the great community of my students will be here to help you as well.</strong></p><p><strong>All project files will be included and you are free to use them for anything that you like, personal or commercial use!</strong></p><p><strong>Lets take a look at the projects that we are going to create inside of this course:</strong></p><p>We are going to show you how to Support Handling Multi-Scenes Game with In-App-Purchase using <strong>Soomla IAP</strong> with the following features: </p><p>- <strong>Store</strong> (In-App Purchases) <br>- <strong>Multi-Scenes</strong> (IAP Across Multiple Scenes) <br>- <strong>Soomla (Multi-Scenes Handling)</strong> <br>- <strong>Step By Step Video Training</strong> <br>- <strong>Buy NoAds UnLock</strong> (Banners, InGame) <br>- <strong>Music Purchase</strong> (Layered AudioContorller) <br>- <strong>Complete Game</strong> (Coins, Life, Levels) <br>- <strong>Virtual Currency</strong> (Coins Example) <br>- <strong>Real Money Purchase</strong> (5 PlayStore Products) <br>- <strong>Purchase With Coins</strong> (10+ Virtual Items) <br>- <strong>Soomla Storage &amp; User Preferences</strong> <br>- <strong>Responsive UI</strong> (Custom UI and Canvus UI) <br>- <strong>StartApp Support</strong> <br>- <strong>Ads Showing Criteria</strong> <br><br><strong>Soomla Store:</strong> <br>SOOMLA provides the building blocks for all free-to-play games, you will learn from the basics to the advanced topics related to every area about in app purchase using unity.</p>", 
    "end_date": null, 
    "title": "Unity In App Purchase Complete Course", 
    "price": "20.00", 
    "instructors": "Ahmad Naser", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756908_32e3_11.jpg", 
    "course_url": "https://www.udemy.com/unity-in-app-purchase-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T07:34:32Z"
}