{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Important:</strong> <strong>all software used are FREE to download and use on PC and MAC computers</strong> (no need to pay, cheers!)</p>\n\n\n\n\n\n\n\n<p>In this course you will learn how to make a system to equip weapons and gears to characters.</p>\n\n\n\n\n\n\n\n\n\n<p>Why would you want to learn how to build a system to equip items on characters? Because it's a very efficient way to create an engaging game where players love to explore the world you create to find legendary items and magic weapons and make their character more powerful and unique.</p>\n\n\n\n\n\n\n\n\n\n<p>All the great games out there are using this system, look at Zelda, or World of Warcraft or MineCraft or even Star Wars.</p>\n\n\n\n\n\n\n\n\n\n<p>This course can be taken by anyone even if you've got no programming skills or very little</p>\n\n\n\n\n\n<p>This course is meant for non-artists, meaning you don't have to be an artist to be able to use 3D pixel art graphics.</p>\n\n\n\n\n\n<p>You will learn how to use free tools to make an amazing game from scratch as I will show you every single line of programming and how to use Unity 3D to be able to make professional games all by yourself quickly and without having to spend money.</p>\n\n\n\n\n\n\n\n\n\n<p>You will learn how to download and install unity 3D on Mac, PC or Linux.</p>\n\n\n\n\n\n\n\n\n\n<p>Then we will get to create a project, add levels and add characters to it. You will also learn how to animate your characters with life-like animations. You will learn how to create items such as swords, shields, shoulder pads and helmets and learn how to have your character pick them up and equip them on.</p>\n\n\n\n\n\n\n\n\n\n<p>Now, this course is meant to make things this super easy for you. All the steps are shown to you in the video lectures, so you cant possibly miss a step.</p>\n\n\n\n\n\n\n\n\n\n<p>As a bonus for joining this course, you will get the source code of the game and 2 characters ready to be animations with a pack of 50 life-like animations for medieval fantastic combat, that's a value over $350 dollars that you get just for joining this course!</p>\n\n\n\n\n\n<p>The skills you will learn in this course can be applied to so many more projects as they are the core foundations of any professional video games. Invest in yourself by joining this course now</p>\n\n\n\n\n\n<p>What are you waiting for. Let's get started.</p>", 
    "end_date": null, 
    "title": "Unity 2016 - Character gear and weapon use", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834910_e417.jpg", 
    "course_url": "https://www.udemy.com/unity-2016-character-gear-and-weapon-use/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-29T00:39:43Z"
}