{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>*** Enroll Now And Learn How To Create Your Own Candy Crush Style Game And Angry Birds Style Game From Scratch ***</strong></p>\n\n<p><strong>*** THIS COURSE IS NOT FOR BEGINNERS, so make sure you have a prior knowledge of Unity, game development and programming before you join this course ***</strong><br></p>\n\n<p><strong>A sequel to our Mastering 2D Games In Unity: Build 6 Fully Featured Games From Scratch Course!!</strong></p>\n\n<p><strong>As a sequel to a course that already covers the basics of Unity and C#, in this course we are going to take it straight to the point, so if you are a complete beginner we do advise you to take a look at our other course which will help you understand unity and game development.</strong></p>\n\n<p><strong>As always we are using practical approaches in teaching game development, so in this course we are going to build 6 games from scratch!!!</strong></p>\n\n<p><strong>Pin The Circle Game</strong><br><strong></strong></p>\n\n<p>We are going to start with a simple game called Pin The Circle. In the game we have a circle that is rotating and we need to shoot all our needles in the circle but we must avoid touching other needles in that process. We are going to create a main menu for the game, implement shooting mechanics, spawn a specific number of game objects for a specific level, and see how can we effortlessly create levels for our game in order to make it challenging to our players.</p>\n\n<p><strong>Jump Hero Game</strong><br></p>\n\n<p>Moving forward with a more complicated game we are going to create a game called Jump Hero. In this game we have platforms on which our hero stands, and he needs to jump from one to another in order to progress through our game. We get one point if we land on a platform without falling down. We are going to see how can we implement the players jump, how can we spawn new platforms for the player to jump and how can we move the camera to the next platform in order for our player to see the next platform and jump on it. We are also going to implement a main menu and a player died panel which is going to show us our score when player dies.</p>\n\n<p><strong>Basketball Shoot Game</strong><br></p>\n\n<p>The next game is even more complicated and its called Basketball Shoot. In the game we have a basketball which we are going to shoot by dragging our mouse or our finger on the screen and we need to score a point in order to progress in the game. We are going to implement main menu and ball select system which will allows us to chose one of the multiple balls that we have in the game. When we drag our ball we are going to create a projectile path which is going to show us where our ball is going to land when we release our button and we are also going to implement a ball scoring system.</p>\n\n<p><strong>Puzzle Game</strong><br></p>\n\n\n\n<p>Next we are going to create a puzzle game where we are going to slice an image that we import and then we are going to shuffle the pieces of that image so that we form a puzzle. The player will be able to move the puzzle pieces left, right, up and down in order to rearrange them in the correct order so that he can form a whole image.</p>\n\n<p><strong>Angry Birds Style Game</strong><br></p>\n\n\n\n<p>After that we are going to create the good old Angry Birds game. We are going to see how can we shoot our birds to hit the bad piggies and score points. We are going to see how can we implement a slightly different technique in order to draw the projectile path and we are going to see how can we implement the game mechanics for our Angry Birds Game.</p>\n\n<p><strong>Candy Crush Style Game</strong><br></p>\n\n\n\n<p>And finally we are going to create a Candy Crush Clone game. We are going to implement the mechanics of matching 3 equal items in order to score in our game and destroy the matched candies. We are going to use two dimensional arrays to position our candies in the game, and we are going to see how can we implement different algorithms in order to find the equal matches. We are going to implement a nice main menu and a score system which will reward our player when he crushes 3 or more candies, and if he crushes more than 3 candies we are going to give him a bonus candy which will crush a whole row or column when its crushed.</p>\n\n<p><strong>You will also benefit from my super fast response if you have any issue that you are stuck with(I check Udemy forums every day if someone posts a question). Oh and all the students taking the course will also be there to help you!</strong></p>\n\n<p><strong>All project files will be included and you are free to use them for anything that you like, personal or commercial use!</strong></p>\n\n<p>If you are already using unity, this course is going to take you to the next level of your game development skills.<br></p>\n\n<p><strong>What You Will Learn</strong></p>\n\n<ol><li>Advanced C#</li><li>Solve Complicated Problems in C#</li><li>How To Use Two Dimensional Arrays</li><li>Configuring Game Sprites</li><li>Create Menus</li><li>Animate Menus</li><li>Use Rotations</li><li>Calculating And Drawing Projectile Paths</li></ol>\n\n<p><strong>That and much more is awaiting for you in this course.</strong></p>\n\n<p><strong></strong></p>\n\n<p><strong>What Is Your Risk  By Taking This Course?</strong></p>\n\n<p><strong>Nothing!! If you are not satisfied with the course, I promise I will give you a full refund of your money NO questions asked!!</strong><br></p>\n\n<p><strong>Enroll Now!! You Will Not Be Disappointed!!</strong></p>\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "Unity: From Master To Pro By Building 6 Games", 
    "price": "20.00", 
    "instructors": "Awesome Tuts", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581854_4c7e_3.jpg", 
    "course_url": "https://www.udemy.com/create-a-2d-platformer-game-with-unity/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T05:12:13Z"
}