{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>WHY YOU MUST BUILD YOUR EMAIL LIST IN YOUR VIDEO GAME—AND HOW TO GET STARTED</strong></p><p>if you are not building an email list, you’re making a HUGE mistake. Your app or game needs to capture the user's information, such as the email address, first name and last name.</p><p><strong>“Why would I EVER want to build an email list?”</strong></p><p>Nowadays the app stores are saturated with apps. Take a look at the Google Play store in 2016, there are about 2 millions apps. In 2008 there was less than 100K apps!</p><p>It's hard to get players to find your game. That's why your game must have a way to capture the player's email address, so that each time you come up with a new set of features, new characters, or even a new game, you can easily spread the word and get a boost in downloads and in user engagement.</p><p>To put this in perspective, had I started building an email list back in 2010 as I was building dozens of games, when I would release a new game, I could have had 7 to 10 times MORE users, which translates in potentially 10 times money than I would originally get.</p><p>How dumb, right?</p><p>Fast forward to today, I see people making the same mistake I made years ago. Instead of building their email list in their game, they’re focusing on pointless things like paying for ads… or worse… social media (YEAH!!).</p><p>And that’s why I want to share this new course with you where I share how to build a system to capture emails using Unity 3D. Now I go through every single steps to create this system, but for the lazy ones, by joining this course, as a bonus, you get the completed bundle that you can in any of your Unity game projects. Life is good!</p><p><strong>Why Email Marketing crushes Social Media Marketing</strong></p><p>You might think I'm crazy to say this, everyone says social media is the way to go, you gotta use Facebook and Twitter!</p><p>Well let me tell you something.</p><p>How many tweets do you receive daily on average? 100, 2000, 5000?</p><p>How many emails do you receive daily on average? 5, 10, 25?</p><p>Okay, by now I'm sure you get it! Your messages will have more chances to get seen by email that by Tweeting or by posting it on Facebook!!!</p><p>Email performs so much better than social media.</p><p>Building an email list in your video game is easy. Just follow my steps.</p><p><strong>Join this course now.</strong></p><p><strong>***</strong></p><p>Not convinced yet? it's cool.... listen up...</p><p><strong>Here are 2 tips I'm giving you away that you can implement in your game right now!</strong></p><p>1) Go ahead and place an email capture form when the player kills a boss.</p><p>Human psychology shows that after \"feeling good\" about reaching an achievement, people are more prone to give back.</p><p>Here, the player's brain is releasing endorphins because he or she is feeling good after having killed the first boss. The player is now ready to give back, by giving away their email address.</p><p>2) Here is another strategy to entice the player to give your their email address:</p><p>You can use the \"carrot\" system to capture emails. For example: \"Player gets 250 coins for giving away their email\".</p><p>Now that you're all pumped up, let's get started!</p><p><strong>Join this course now.</strong></p>", 
    "end_date": null, 
    "title": "Unity 2016 - Email List Building - Why and How", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788008_0d0c_3.jpg", 
    "course_url": "https://www.udemy.com/unity-2016-email-list-building-why-and-how/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T02:17:26Z"
}