{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Unity 3D 2016 Demo: Create a game fast no coding required</strong></p><p>Note this is a lite version of the full course here you get a taste what the full course is all about for free and therefore no source code will be included. Once you purchased the full course we will also include a section how to market your course once it is published. </p><p>If you enjoyed this course make sure to get the full course which will include the lectures here plus a lot more content. <span></span>This course assumes you know nothing about making games, and you will publish your very own game to the apple app store without coding not even a single line of code,</p><p>The full course will include the following....</p><ul><li><strong>The game comes with multiple advertising channels to bring your passive income.</strong></li><li><strong>Teaches you how to market by using social media such as facebook and twitter</strong></li><li><strong>How to get virtual assistants to outsource some of the tasks for creating the game</strong></li><li><strong>As a bonus show you how the game also works on Android phones not just macs</strong></li><li><strong>All it takes is one afternoon to have your very own game join the fan today</strong></li></ul><p>The full course is backed by 30 days zero risk to you if you are not happy for any reason you can get a complete refund no questions asked. Should you choose to keep the course you will get discount offers to all our courses and life time access to this course and any future revisions including fast support from your instructors for any questions you might have it is like having an actual teacher sit next to you and guide you step by step along the way. </p>", 
    "end_date": null, 
    "title": "Unity 3D 2016 Demo: Create a game fast no coding required", 
    "price": 0, 
    "instructors": "Sergey Kasimov, Yohann Taieb", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/798232_96ff_5.jpg", 
    "course_url": "https://www.udemy.com/unitydemo/", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-19T20:19:54Z"
}