{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    In this course you are going to reskin an educational game for kids, the name of this game is <strong>\"Alphabet Board\" A fun way to learn writing for your kids!</strong>  </p>  <p>  \t    This course is the first in its kind; It’s a complete process to design and reskin an Alphabet Board 2D game using Unity3D. It’s a clear step by step lessons without jumping. We are going to cover everything related to the design and basic development for this game starting from the design in illustrator and Photoshop then moving to reskinning, configuration, tracing and testing of the game using Unity3D.  </p>  <p>  \t<strong>The Following features are supported in this game:</strong>  </p>  <ul>  \t<li>Support customization for other languages alphabet.</li>  \t<li>All features arranged on a single screen, no confusing navigation.</li>  \t<li>Large letter shapes for easy tracing.</li>  \t<li>Attractive sound effects.</li>  \t<li>Alphabet background music.</li>  \t<li>Smooth lines.</li>  \t<li>Supports PC, iOS and Android.</li>  \t<li>Custom Backgrounds.</li>  \t<li>Complete Scenes.</li>  </ul>  <p>  \t<strong>You can consider this course as a real world example</strong>, since I worked for 3 years on educational games, I have good experience in this field that’s why this course is there, also it’s not a complex app,<strong> it’s perfect for beginners and for non-programmers</strong> to extend their unity skills as well.  </p>  <p>  \t    Unity is on the top of the develop-once distribute-many platforms and it is really an awesome one-stop-shop platform and game engine for games, that is why we choose it as development platform.  </p>  <p>  \tCourse Preparation Team:  </p>  <ul>  \t<li>Ahmad Naser</li>  \t<li>Baraa Nasser</li>  \t<li>Asma Hammad</li>  </ul>", 
    "end_date": null, 
    "title": "Unity3D Alphabet Board Game Step By Step", 
    "price": "20.00", 
    "instructors": "Ahmad Naser", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368388_de0d_3.jpg", 
    "course_url": "https://www.udemy.com/unity3d-alphabet-board-game-step-by-step/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T21:43:38Z"
}