{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>Important</strong>: all software used are <strong>FREE</strong> to download and use on PC and MAC computers (no need to pay, cheers!)</p><p>In this course you will learn how to <strong>design and program a 3D pixel art video game</strong> just like Crossy Road using Unity3D and publish it in the app stores (iOS and Android).</p><p>Why would you want to learn how to make a game like crossy road? Because it's the most efficient way to create a good looking game by yourself that you can publish in the app store, without having the need of a team of multiple people. </p><p>This course can be taken by anyone even if you've got no programming skills or very little </p><p>This course is meant for non-artists, meaning you don't have to be an artist to be able to use 3D pixel art graphics.</p><p>You will learn how to use free tools to make an amazing game from scratch as I will show you every single line of programming and how to use Unity 3D to be able to make professional games all by yourself quickly and without having to spend money.</p><p>You will learn how to download and install unity 3D on Mac, PC or Linux.</p><p>Then we will get to create a project, add levels and add graphichs such as the Crossy Road chickens, Roads, trees, rocks, cars, trucks and much more.</p><p>You will also learn how to add artificial intelligence to these objects to make them come to life.</p><p>Also, you will learn how to make game menus, game over screens, and how to keep score.</p><p>Once we've got a working game, we will go through the whole process to publish the game to the iTunes app store.</p><p>Then you will learn how to add all these objects in the game engine called Unity 3d to make amazing 3d games, just like crossy road.</p><p>Now, this course is meant to make things this super easy for you. All the steps are shown to you in the video lectures, so you cant possibly miss a step.</p><p>And by the way as a bonus, this course includes free downloads of the finished 3D models, Unity projects and levels as well.</p><p>The skills you will learn in this course can be applied to so many more projects as they are the core foundations of any professional video games. Invest in yourself by joining this course now</p><p>What is 3D Pixel Art?</p><p>3D Pixel art is a form of digital art, created through the use of 2D-like raster graphics software, where images are edited on the pixel level in the form of blocks. Graphics in most old (or relatively limited) computer, console, graphing calculator and mobile phone video games are mostly 2D pixel art, and now we use the new technologies t have the retro-cool style with the amazing functionality that 3d technology provides.</p>", 
    "end_date": null, 
    "title": "Unity 3D 2016 - Build , program & publish Crossy Road game", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706024_f76d.jpg", 
    "course_url": "https://www.udemy.com/unity-3d-2016-build-program-publish-crossy-road-game/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T22:36:22Z"
}