{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Important:</strong> <strong>all software used are FREE to download and use on PC, LINUX and MAC computers</strong> (no need to pay, cheers!)</p>\n\n<p>In this course you will learn how to build a system to add attributes, and modifier to game characters, weapons and gear items. </p>\n\n\n\n\n\n\n\n<p>Why would you want to learn how to build this? Because it creates engaging games where players get to explore worlds, find items and weapons to make their character stronger, and get to fight enemies and powerful bosses that drop loot when defeated. By the way some of the most common attributes are health points, strength, dexterity, intelligence, spell damage, and attack speed.</p>\n\n\n\n\n\n\n\n<p>All the great games out there use stats, look at Zelda, or World of Warcraft or MineCraft or even Star Wars. That's exactly what you will get to build by taking this course.</p>\n\n\n\n\n\n\n\n<p>This course can be taken by anyone even if you've got no programming skills. This course is meant for non-artists, meaning you don't have to be an artist to be able to use 3D pixel art graphics since this course provides all the necessary assets for you. The only tool we use in this course is Unity 3D, and it's completely free to use. No need to spend extra money.</p>\n\n\n\n\n\n\n\n<p>This course is easy to follow along since all the steps are shown to you in the video lectures, so you can't possibly miss a step, and it's a lot more fun that reading documentation</p>\n\n\n\n\n\n\n\n<p>As a bonus for joining this course, you will get the source code of the game with a 3D pixel character, fully animated for medieval fantastic combat, and lots of weapons and gear items to equip, that's a value over $400 dollars that you get just for joining this course!</p>\n\n\n\n\n\n\n\n<p>The skills that are taught in this course are the foundation of any professional video games and they can be applied to all your future projects. </p>\n\n\n\n\n\n\n\n<p>Join the course now, you've got nothing to lose because if i don't deliver, you'll get a full refund. I'll see you in the videos lectures and in the course forum.</p>", 
    "end_date": null, 
    "title": "Unity 2016 - RPG Character Stats and Item Attributes System", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/872516_ef1e.jpg", 
    "course_url": "https://www.udemy.com/unity-2016-rpg-character-stats-and-item-attributes-system/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-08T16:40:38Z"
}