{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This lecture is about how to program turn based game's turn structure, card game's card usage system by Unity and C#.</p><p><strong><br></strong></p><p><strong>[Turn based game's turn structure]</strong></p><p>*Using unity's StartCoroutine, enum syntax,  you will learn how to program it from the scratch. </p><p>*For example, I adopt famous card game, \"Magic the Gathering\". You will learn its turn structure and how to program it.</p><p><br></p><p><strong>[Card, RPG game's card, skill usage system]</strong></p><p>*Normally, card game or RPG game has many skills, cards. If user click some skill icon or card UI, relative skill or card's function should be executed. </p><p>*But how will you make it? Using \"if\" or \"switch\" syntax? This is too annoying and not elegant way at all. </p><p>*Instead, you will learn how to make this system using Abstract class and inherited specific class, List and foreach syntax.</p><p>*And also, you will learn how to use StartCoroutine in specific card class which does not inherit MonoBehaviour like normal unity C# script start from it.</p><p><br></p><p>This lecture consisted by rather short videos, but this include core mechanism to programming above game, and I typed each script from the scratch, so you will get to the point shortly and thoroughly. And this short lecture does not cover whole programming of complicated 'Magic the gathering'. </p>", 
    "end_date": null, 
    "title": "Unity Lecture : Turn based card game (Magic the Gathering)", 
    "price": "20.00", 
    "instructors": "Dong Hun Lee", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690298_17b7.jpg", 
    "course_url": "https://www.udemy.com/unity-lecture-2-how-to-make-turn-based-card-game/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T13:26:37Z"
}