{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>دليلك الشامل باللغة العربية لاحتراف تصميم، برمجة، بناء وتسويق وجني الارباح من خلال الالعاب باستخدام اليونتي لنظام اندرويد واي اوه اس</p>  <p><strong>احصل على مشاريع العاب وهدايا مع الكورس بقيمة 400 دولار عند التسجيل!</strong></p>  <p>في هذه الدورة سنقوم بتصميم وبرمجة عدة العاب، سنقوم بنشر الالعاب لجميع الاسواق الخاصة بالتطبيقات، بالاضافة لتمويل التطبيقات وجني الارباح منها، سنقوم بتصميم لعبة ب 36 مرحلة وبعدة مستويات مع ستوري بورد كامل، اسم اللعبة التي سنبدأ بها فلاتي بوكس، وهذا الكورس متوافق مع يونتي 5 ويونتي 4 وطالع.</p>    <p><strong>ستحصل على مايلي عند تسجيلك في الكورس:</strong></p>  <ol><li>لعبة فلاتي بوكس كاملة</li><li>الباكج الخاصة بالستوري بورد من تصميمي وسعرها 75 دولار على الاست ستور</li><li>كتابي الجديد في تصميم الالعاب للعبة فلابي بيرد 35 صفحة</li><li>كورس كامل لتعليم الاندرويد بقيمية 200 دولار</li><li>باكج كاملة للتعامل مع النوافذ وديالوج فوز ال3 نجوم</li></ol>            <p>هذا الكورس فريد من نوعه والاول في المنطقة العربية، اسلوب تطبيقي عملي مبني على تنفيذ مشروع تطبيقي خطوة بخطوة من الصفر حتى الاحتراف، سنبدأ من خلال تصميم اللعبة من الصفر خطوة بخطوة بشكل تتابعي مرن، سنقوم بتغطية كل شيء يتعلق بالتصميم والبرمجة والتسويق والبيع لهذه اللعبة من البدء باستخدام الفوتوشوب واختيار لوحة الالوان والسكيتش الخاص باللعبة لبرمجة اللعبة، وتخصيص اعداداتها وتوافقها مع الاداة الاحترافية ستوري بورد يو اي كت بجميع المكونات والشاشات والقوائم والديالوجز مع الاختبار والفحص للعبة باستخدام منصة اليونتي لنضمن تطوريك للعبة احترافية متقنة باستخدام شاشة مستخدم جذابة وتعمل على جميع الشاشات بطريقة رائعة ولكي نوفر عليك الوقت بدلا من اسابيع وشهور الى مجرد عدة ساعات ممتعة.</p><p><strong>سنقوم بتوجيهك خطوة بخطوة لتحقيق حلمك في بناء العاب احترافية وبيعها، وسنبدأ بعمل لعبة كاملة سنسميها فلاتي بوكس، بعد الانتهاء من تصميم وبرمجة اللعبة ستحوي المميزات الاتية</strong></p><ul><li>تدعم الموبايل ندرويد واي او اس، دسكتوب وماك</li><li>قوائم وواجهة مرنة تدعم كل الشاشات – رسبونسف</li><li>اللغة المستخدمة في البرمجة هي سي شارب  C#</li><li>واجهة مستخدم جميلة وجذابة</li><li>تحوي اللعبة على سلايدر للمراحل والمستويات</li><li>تحوي اللعبة على ستوري بورد كامل متكامل</li><li>اعدادات وبيانات اللاعب واللعب مع التخزين والقراءة على مختلف الاجهزة المستخدمة</li></ul>    <p>سنقوم بتوجيهك بخطوات تفصيلية الى كيفية نشر وتسويق والربح من اللعبة على منصات الاندرويد جوجل بلاي والابل ستور واليونتي است ستور وكيفية بيع التطبيق الخاص بك والربح منه من خلال الانترنت.</p><p>Unity Arabic Course, Is a complete guide to teach you professional unity3d development in Arabic language.</p><p><br></p>", 
    "end_date": null, 
    "title": "Unity3D for Android and IOS الدورة الشاملة لمطور الألعاب   ", 
    "price": "50.00", 
    "instructors": "أ. أحمد ناصر", 
    "commitment": "20.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635140_b497_2.jpg", 
    "course_url": "https://www.udemy.com/unity-course-in-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T18:43:28Z"
}