{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hi, and welcome to the Unity Game Physics course, my name is Yohann and I'm famous for having enabled my students to make games that reached the top ranks in the itunes app store. My courses have hundreds of 5 star reviews on Udemy alone.</p><p>This course is all about hands on training, if you're like me and like to learn by doing things yourself rather than listening to a teacher rambling on theory then you're going to like this course.</p><p>About the course:</p><p>Whether you're a beginner at making games or not, I will show you how to master game physics just like it's done in professional games. Physics is everywhere, sometimes you don't even know it 's there but trust me it is, it's used in most games.<br></p><p>The course is broken down in short, easy to digest chunks. Now right at the beginning we go straight into downloading Unity and work on a project that's based on a game that is published in the app stores. You get to work on a real game, not just some random useless project. You can follow along whether you're using a Windows computer, Linux or Mac. We'll start with the basics of physics and then move to advanced techniques like <strong>colliders, rigidbodies, triggers, area effectors, fixed joints, hinge joints, raycasting, forces, torques, and even buoyancy! </strong>The cool thing is that you don't need to take a physics class nor a game class, it's all in here.</p><p>If you've never heard of any of these terms or never got to use them, then this mammoth course is for you.</p><p>As my current students already know, I'm always around in the forums and I'll be there to help you out whenever you get stuck. But you get a lot more than just the best Unity Physics course available online. As a bonus You get a copy of the Unity source code of the Crossy road game clone called Dangerous Lanes that's a famous 3D isometric pixel game. You also get a copy of the Captain Rocket source code that is a fun endless 2D platform runner that you can use any way you'd like. And as a bonus, you get lots of characters and environment object that you can use freely to make your upcoming game look professional. This bonuses are worth well over $500.</p><p>Are you ready to be successful at mastering game physics? Then join me on this exciting journey. Become part of this whole new world of learning skills and fun. The future's bright with Unity Game Physics, you're gonna love it.</p><p><br></p><p><strong>What is game physics ?</strong></p><p>Computer animation physics or game physics involves the introduction of the laws of physics into a simulation or game engine, particularly in 3D computer graphics, for the purpose of making the effects appear more real to the observer<br></p><p><br></p><p><strong>Why use Unity 3D to learn about physics in video games ?</strong></p><p>Unity Technologies is shaping a booming global games market and has seen escalating uptake of the Unity engine and its complementary and integrated game promotion, user retention and analytics services.</p><p>The Unity engine is the mamoth in game dev and by far and away the dominant global game development software. More games are made with Unity than with any other game technology. More players play games made with Unity, and more developers rely on our tools and services to drive their business.</p><p>Also Unity 3D is free for personal use, so there is no reason not to use it! And thanks to Unity 3D, you can learn about all types of physics, 3D physics, 2D physics, isometric physics, and even simulated physics. You can reuse your knowledge for any other game engines once you've done it with Unity 3D</p><p>Unity 3D for the win! Physics for the win! all free to use for the win!</p><p>Note: course recorded with the latest version of Unity 5.x 2016 which comes with the newest game physics algorithms</p><p>Note: if you already know advanced physics techniques in Unity, this course is NOT for you.</p><p><br></p><p><strong></strong></p><p><strong>  </strong></p><br><p><br></p>", 
    "end_date": null, 
    "title": "Unity 2016 Game Physics", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737874_ce4a.jpg", 
    "course_url": "https://www.udemy.com/unity-2016-game-physics/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T14:22:02Z"
}