{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Bonus: </strong>All assets used in this course are included for free.</p><p>Hi, and welcome to the Unity Game Analytics course, my name is Yohann and I'm famous for helping thousands of students makes apps and games and publish them to the app stores while some of my students's games reached the top 10 in iTunes and google play store.</p><p>This course is all about hands on training, if you're like me and like to learn by doing it yourself rather than listening to a teacher then this course is for you.</p><p><strong>About the course:</strong></p><p>By taking this course, you will learn how to integrate google analytics to any of your Unity games. Thanks to Unity and Google Analytics, you will be able to capture data about your users behavior and user engagement. Then you will be able to analyze this data and find ways to make your game more engaging which will ultimately increase your revenue.</p><p>For example, when you use analytics in your game, you can figure out if too many players stop playing a certain level in your game, maybe this level has a bug, or it's too hard or even to boring! By adding analytics to your game, you don't have to pray the gods to have users play your game, now you know how to improve your game based on real scientific data.</p><p>By the way, all the games out there like Minecraft, candy crush,  and clash of clan, they all use analytics in their games.<br>\n</p><p>The course is broken down in short, easy to digest chunks. Now right at the beginning we go straight into downloading Unity and work on the captain rocket Unity project that's based on a game that is published in the app stores. You get to work on a real professional game, not just some random project. You can follow along whether you're using a Windows computer, Linux or Mac. We'll start with the basics of integrating analytics within your game then we'll go into advances topics such as tracking in-app purchases transactions, code exceptions, bugs, or the time a player spends on a level.</p><p>If you've never heard of any of these terms or never got to use them, then this mammoth course is for you.</p><p>As my current students already know, I'm always around in the forums and I'll be there to help you out whenever you get stuck. But you get a lot more than just the best Unity Analytics course available online. As a bonus you get a copy of the Captain Rocket source code that is a professional endless 2D platform runner that you can use any way you'd like.  This bonus is worth well over $500.</p><p>Are you ready to be successful at mastering game analytics in Unity ? Then join this course now. you're gonna love it.</p><p>***</p><p><span></span><strong>What is Google Analytics?</strong></p><p><strong>Google Analytics</strong> is a freemium  <strong>analytics</strong> service offered by <strong>Google, </strong>originally meant for website that tracks and reports website traffic. <strong>Google</strong> launched the service in November 2005 after acquiring Urchin. <strong>Google Analytics</strong> is now the most widely used web <strong>analytics</strong> service on the Internet.</p><p> The great thing about Google analytics, is that it's an all-in-one solution, it works for the web, for the Android smartphones and tablets, for the iPad, for the iPhone.</p><p>On top of that, Google Analytics can be combined with Google Admob advertising networks and Google Adwords too, which means you can analyze and gets pertinent reports about how your app is used as well as how the advertising within your app is working. You get analytics for banner ads, full screen ads, and also analytics for video ads (rewards too!)<br></p><p><br></p><p><strong>Why would you want to use Google Analytics in your Unity 3D game ?</strong></p><p>You need to understand and measure what your users do inside of your game — a key to engaging and monetizing users in the long run. You cannot expect to publish a game and cross your fingers or pray the gods that your game will make money. You need to analyze your user behavior and engagement and update your game to be more attractive and engaging for the game players.<br></p><p><br></p><p>Google Analytics allows developers to send raw user interaction data directly to Google Analytics servers. This allows you, the game developer to measure how users interact with their business from almost any environment. Developers can then use the data to:</p><ul><li>✅ Measure user activity in new environments.</li><li>✅ Tie online to offline behavior.</li><li>✅ Send data from both the client and server</li><li>✅ See how many players come daily to your game.</li><li>✅ Add custom events to track actions that players make on your game.</li><li>✅ See the results of custom events through the funnel.</li><li>✅ See where the players get stuck in your game and fix it</li></ul><p><br></p><p>Thanks to Unity 3D, you can now track user activity on iOS, Android, desktop games ( Windows or Mac or Linux ) Playstation and Xbox ! Even the Apple TV and the Virtual reality devices like Samsung VR and Oculus Rift ! It's it amazing?!</p><p><strong>Unity Analytics works seemlessly with Google Ads</strong></p><p>Have you ever wondered how games such as “Candy Crush” were able to become financially successful? Implement ads that the players would like to see using an ad network targeted specially for gamers, show only game related videos to your player and forget about the intrusive banner ads in this tutorial for intermediate users you will learn in no time how to monetize that free game you have.</p><p>Make revenue out of your game</p><ul><li>Target the right player audience with pertinent advertising.</li><li>Choose between showing ads that will reward the player or not.</li><li>Show an Ad to the player after he or she performs a specific action.</li><li>Navigate through the ads online dashboard to see the revenue of your game.</li><li>Make money out of your game without affecting the player's experience.</li></ul>", 
    "end_date": null, 
    "title": "Unity Game Analytics", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741600_4ce7_3.jpg", 
    "course_url": "https://www.udemy.com/unity-game-analytics/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T23:32:09Z"
}