{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Welcome to the first volume of the <strong>Unity Master Series</strong> created by experts here at the School of Interactive Design. The School of Interactive Design is an industry leader in game design education. We only create training videos which have been carefully produced by game design experts currently working in the game industry. With years of experience in both game development and teaching our expert team make these complex tools simple and fun to learn.</p><p>In this series, you will be learning the basics of the Unity3D game engine which is used by everyone from indie game developers to major game studios all over the world. Anyone who is serious about becoming a game designer should take the time to learn this user-friendly yet powerful 2D and 3D game development platform. Unity can be used to develop games, apps, and interactive content which can then be published to Mac, PC, gaming consoles like PS4, Nintendo, and Xbox, as well as all mobile devices. </p><p>Getting the right start with any software makes learning more advanced features down the road that much easier. This course takes the fear and frustration out of learning this powerful game development program by keeping things simple and to the point. You will quickly learn the fundamentals needed to have a strong base and the confidence to move on to the many more advanced Unity training tutorials we offer. </p><p><strong>You should take this Unity course if you</strong></p><ul><li>Are completely new to Unity or game design</li><li>Want to learn how to make your own games or work in the game industry</li><li>Want a great understanding of the basics so you can easily follow along in later courses</li></ul><p><br><strong></strong></p><p><strong>By the end of this Unity training series you will:</strong></p><ul><li>Know how to properly install, setup, and launch Unity 5</li><li>Know how to navigate around your 3D scene</li><li>Know how to add 3D objects to your scene</li><li>How to organize your workspace and customize windows</li><li>Learn more about the online Unity community and assets store</li><li>Know how to open and view complex game projects</li><li>Have a excellent understanding of the tool bar and inspector panel</li><li>Be prepared to move on to the next series : Learning to code in C#</li></ul><p><br></p><p>If you are completely new to Unity, then this course is exactly what you need to build a strong foundation and start your journey into  the exciting field of game design.</p>", 
    "end_date": null, 
    "title": "Unity3D Master Series : Volume 1 | Learning the basics", 
    "price": "20.00", 
    "instructors": "School of Game Design", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432892_c79a_4.jpg", 
    "course_url": "https://www.udemy.com/unity3d-master-series-volume-1-learning-the-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T10:25:58Z"
}