{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Important:</strong> <strong>all software used are FREE to download and use on PC and MAC computers</strong> (no need to pay, cheers!)</p>\n\n<p>In this course you will learn how to build an inventory system for your games using Unity 3D</p>\n\n\n\n\n\n<p>Why would you want to learn how to build an inventory system? Nowadays, all major games, especially online multiplayer games require an inventory system to create an engaging game where players love to explore the world to find legendary items and magic weapons and have their avatar look more powerful.</p>\n\n\n\n\n\n<p>All the great games out there are using this system, look at Zelda, or World of Warcraft or MineCraft or even Star Wars.</p>\n\n\n\n\n\n<p>This course can be taken by anyone even if you've got no programming skills or very little</p>\n\n\n\n\n\n<p>This course is meant for non-artists, meaning you don't need to be an artist to be able to follow along.</p>\n\n\n\n\n\n<p>You will learn how to use Unity 3D to build the inventory system.</p>\n\n\n\n\n\n<p>You will design a backpack and inventory user interface, then you will learn to program how to drag and drop item in the backpacks,  Then you will learn how to equip these items and how to swap weapons, shields, helmets, and all the gear items to make a solid game, and so much more. </p>\n\n\n\n\n\n<p>Now, this course is meant to make things this super easy for you. All the steps are shown to you in the video lectures, so you can't possibly miss a step.</p>\n\n\n\n\n\n<p>As a bonus for joining this course, you will get the completed Unity project, so that you can reuse this inventory system in all your games. That's a $100 dollar value on its own</p>\n\n\n\n\n\n<p>The skills you will learn in this course can be applied to so many more projects as they are the core foundations of any professional video games. Invest in yourself by joining this course now</p>\n\n\n\n\n\n<p>What are you waiting for. Let's get started.</p>", 
    "end_date": null, 
    "title": "Unity 5 - Inventory System for Professional Games", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856164_651b.jpg", 
    "course_url": "https://www.udemy.com/unity-5-inventory-system-for-professional-games/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-21T22:48:51Z"
}