{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Решили стать программистом компьютерных игр? Хотите сменить профессию? Ищете себя в сфере информационных технологий?</strong> Добро пожаловать!</p>\n\n<p>*************************************</p>\n\n<p><strong>Update, 25.03.2016</strong>: добавлены уроки, в которых рассказывается, как создать текстовые элементы на экране.<br></p>\n\n\n\n<p><strong>Update, 21.03.2016</strong>: добавлены уроки, в которых рассказывается, как создать элемент графического интерфейса, выводящий на экран здоровье игрока с применением новейшей системы построения UI в Unity.</p>\n\n\n\n<p>*************************************</p>\n\n\n\n<p>Анализ сайтов, предлагающих вакансии, показал, что по запросам Unity сегодня в России, а тем более в других странах, предлагается огромное количество вакансий с заработной платой значительно выше среднего.<strong> </strong> В представленных уроках высокого качества последовательно разбираются методы программирования, синтаксис языка, основные идеи и приемы создания игровой логики и превращения статичных сцен в полноценные игры. Мы будем использовать с вами C# - язык программирования, который постепенно становится профессиональным стандартом и является мощным объектно-ориентированным языком программирования. Этот язык используется и при создании игр на Unity. Начните свою карьеру программиста отсюда!<br></p>\n\n\n\n<p>  \t  Что мы будем делать:  </p>\n\n\n\n<ul>  \t<li>писать программы;</li>  \t<li>писать программы;</li>  \t<li>писать программы...</li>  </ul>\n\n\n\n<p>  \t  А если серьезно, то после прохождения курса вы получите представление о том, что такое алгоритмы, изучите синтаксис языка C#, освоите основные приемы программирования игр, изучите основные классы и методы, предоставляемые внутри Unity разработчиками.  </p>\n\n\n\n<p>  \tАвтор предлагает на каждом этапе создания игры воспользоваться уже готовыми файлами (трехмерные модели, скрипты, текстуры), которые будут доступны для скачивания и использования в вашем проекте. Проект посвящен созданию одного уровня компьютерной игры \"Save Aliens!\".  </p>\n\n\n\n<p>Часть курса, посвященная изучению основных концепций построения игры на Unity находится в списке моих курсов, присоединяйтесь! Среди ресурсов на этом курсе вы найдете все необходимое, чтобы начать программировать свою игру!</p>\n\n\n\n<p>************************************************************************</p>\n\n\n\n<p>The author offers at each stage of the game to take advantage of ready-made files (three-dimensional model, scripts, textures), which will be available for download and use in your project. The project is dedicated to creating the same level of the computer game \"Save Aliens!\".<br></p>", 
    "end_date": null, 
    "title": "Unity: как сделать свою игру? Программирование игр на C#", 
    "price": "20.00", 
    "instructors": "Evgeniy Solovey", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360498_5f1f_2.jpg", 
    "course_url": "https://www.udemy.com/unity-program-game/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T13:50:50Z"
}