{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Welcome to the second volume of the <strong>Unity Master Series</strong> created by experts here at the School of Interactive Design. The School of \nInteractive Design is an industry leader in game design education. We \nonly create training videos which have been carefully produced by game \ndesign experts currently working in the game industry. With years of \nexperience in both game development and teaching our expert team make \nthese complex tools simple and fun to learn.</p><p>In this series, you \nwill be learning the programming language C# for use with the powerful Unity3D game engine which is used by \neveryone from indie game developers to major game studios all over the \nworld. Anyone who is serious about becoming a game designer should take \nthe time to learn this user-friendly yet powerful 2D and 3D game \ndevelopment platform. Unity can be used to develop games, apps, and \ninteractive content which can then be published to Mac, PC, gaming \nconsoles like PS4, Nintendo, and Xbox, as well as all mobile devices. </p><p>Getting\n the right foundation with any coding language makes learning more advanced coding\n down the road that much easier. This course takes the fear and \nfrustration out of learning how to code by \nkeeping things simple and to the point. You will quickly learn the \nfundamentals needed to have a strong base in programming and the confidence to move on \nto the many more advanced Unity training tutorials we offer. </p><p><strong>You should take this Unity course if you</strong></p><ul><li>Are completely new to coding and want to learn C#</li><li>Want to working as a game developer in the game industry</li><li>Want to make your own indie games with Unity3D</li></ul><p><br><strong></strong><strong>By the end of this training series you will have a strong foundation in C# and have masted the following concepts:</strong></p><ul><li>Anatomy of a script</li><li>Variable attributes</li><li>Unity console</li><li>Syntax symbols</li><li>Grammar</li><li>Debug and string</li><li>Variable type</li><li>Array and list</li><li>Array and list inspector</li><li>Arithmetic</li><li>Shorthand arithmetic</li><li>Conditional if else</li><li>Conditional if else if</li><li>Conditional lambda</li><li>Multi conditional and expression</li><li>Enum</li><li>Switch case basics</li><li>Switch case enum</li><li>For loop basics</li><li>For loop with conditional</li><li>While loop</li><li>Nested loop</li><li>Foreach</li><li>Method structure</li><li>Method arguments and scope</li><li>Method overloading</li><li>Method return values</li><li>Class basics</li></ul><p>If you are ready to learn coding with C# and start your career as a game designer, then jump right in and start learning this powerful programming language. </p>", 
    "end_date": null, 
    "title": "Unity3D Master Series: Volume 2 | c# Intro to programming", 
    "price": "20.00", 
    "instructors": "School of Game Design", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499656_a5ac_2.jpg", 
    "course_url": "https://www.udemy.com/unity3d-master-series-volume-2-intro-to-programing-in-c/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T04:35:09Z"
}