{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h4>Do you want to create online worlds like MineCraft or Clash of Clans?  Do you feel like you cannot do it because multiplayer is hard to program? </h4><h4> Well, you were right until today.  I have looked through dozens of ways to make a multiplayer game, and i came up with the easiest way to make it happen. </h4><h4> This course contains all you need to easily turn any Unity games into online multiplayer platforms.  This course will drive you step by step on taking a shooter robots game and turn it into an online multiplayer Free For All game. </h4><h4>    The process is fun and it feels great to accomplish such a difficult task.</h4><h4>Join the community now</h4><h4>MULTIPLAYER MADE EASY</h4>\n\n<p>Unity Multiplayer is the easiest way to create real time, networked games for Unity. It’s fast to implement and highly customizable. Unity-provided servers ensure that your players can find and play with each other.</p>\n\n\n\n<p><br></p>\n\n\n\n<h4>EASY TO IMPLEMENT</h4>\n\n\n\n\n\n<p>Unity Multiplayer uses the component workflow you already know so you can implement and prototype networked features quickly.</p>\n\n\n\n<p><br></p>\n\n\n\n<h4>FLEXIBLE</h4>\n\n\n\n\n\n<p>Low level APIs grant you access to the core of the Unity Multiplayer’s framework, so you can optimize your game for a networked environment, however you want to.</p>\n\n\n\n<p><br></p>\n\n\n\n<h4>BACKED BY UNITY</h4>\n\n\n\n\n\n<p>Unity Matchmaker Servers makes it easy to connect your players. Unity Relay Servers brokers network traffic to ensure quality sessions between your players no matter where they are.</p>\n\n\n\n<p><br></p>\n\n\n\n<h4>GET STARTED NOW</h4>\n\n\n\n\n\n<p>Unity Multiplayer is available to all Unity customers for development purposes at no additional charge.It is totally free to create professional multiplayer games</p>\n\n\n\n<p><br></p>\n\n\n\n<h4></h4>\n\n\n\n<h4>HANDS ON PROJECT</h4>\n\n\n\n<p>This course drives you step by step on how to turn a 3D shooter game into a multiplayer game where 2 to 16 players can play simultaneously controlling robots shooting fireballs at eachother, in a fun environment like MineCraft style.</p>\n\n\n\n<p><br></p>\n\n\n\n<h4>MEGA BONUS</h4>\n\n\n\n\n\n<p>By joining this course, you automatically get for FREE all the project files, the source codes, the graphic files, 3d animations, models, and you also get the published iPhone app and Android it. Life is good!</p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Unity Multiplayer 2016 -Build Online Shooter - code included", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/809994_83c3.jpg", 
    "course_url": "https://www.udemy.com/unity-multiplayer-make-a-shooter-game-code-included/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-01T13:18:29Z"
}