{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Prepare-se para desenvolver um jogo completo!</strong></p><p>Esse curso é indicado para quem está procurando <strong>conhecimento de qualidade </strong>nos aspectos mais simples de Unity 5 até as funcionalidades mais úteis e complicadas em termos de programação e desenvolvimento de jogos.  </p><p><strong>Essa não é uma série de vídeo onde eu simplesmente cito os passos para produzir algo.</strong> Todos os vídeos são <strong>devidamente explicados </strong>e a qualidade das aulas pode ser comprovada pelos mais de <strong>dez mil</strong> alunos que já tive a oportunidade de instruir.</p><p>Ao ter acesso a esse material, você verá a <strong>programação de um outro modo</strong>. Entretanto, não se engane pensando que empenho é opcional. Assim como qualquer outra coisa, aprender a programar não acontece da noite para o dia, então lembre-se de se esforçar em completar testes (incluídos no curso) e seguir as aulas corretamente.</p><p>O curso inclui todo o material que será usado nas aulas. Então, tenha certeza de que tudo que você vê em aula é<strong> totalmente reproduzível em seu computador</strong>.</p><p><strong>Esse curso cobre tudo</strong>. Desde o mais básico sobre interface até a<strong> construção de um game completo</strong>! Porém, não espere ter de mergulhar em códigos complicados desde o início. Eu estruturei o curso de tal forma que você aprende tudo <strong>sem pressa e no seu ritmo</strong>. Nenhum conhecimento prévio é necessário para cada aula a não ser o que você adquiriu na aula anterior.</p><p><strong>Quer que eu desenhe?</strong> Sem problemas! Para esse curso, desenvolvi vários vídeos conceituais onde explico termos mais complicados com desenhos e diagramas. Uma imagem vale mais que mil palavras, certo?</p><p>Posso afirmar que esse é o <strong>melhor curso de Unity</strong> em português dado o seu preço e a qualidade do material oferecido. Espere um instrutor dedicado com grande experiência prévia (meu curso de Unity em inglês é um sucesso. Pense nesse como uma versão melhorada!). Confie em mim quando eu digo:<strong> Eu falo a sua lingua!</strong></p><p>Podemos começar?</p>", 
    "end_date": null, 
    "title": "Unity 5 + C#: Simplificando o Desenvolvimento de Jogos", 
    "price": "50.00", 
    "instructors": "José Augusto Thomas", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468424_d35f_5.jpg", 
    "course_url": "https://www.udemy.com/aprendaunity/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-05T21:42:47Z"
}