{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t <span>This course is a comprehensive introduction to UnrealScript presented by Alan Thorn, veteran game developer and author with over 12 years of industry experience. Taking a step-by-step approach, you’ll move from the basics of configuring the UDK and its files to coding a feature-filled game complete with timed behavior and editor integration.</span>  </p>  <p>  \t    Clear and concise, this course takes you from start to finish through the creation of a practical game in UnrealScript, demonstrating the core features of the language along the way. It starts by exploring how to configure UDK files and software and ends with a working game featuring time-limits, editor integration, component-based actors, and custom Kismet nodes.  </p>  <p>  \t Overall, you’ll see how to build a game from the ground up. Along the way, you’ll explore core UnrealScript features such as console commands for improving debugging, class states for dynamically changing actor behavior, custom Kismet nodes to control program flow visually, the ability to tweak class settings through text-based configuration files, and much more besides.  </p>  <p>  \t By the end of this course, you’ll have coded a feature-filled game in UnrealScript and the UDK. In achieving this, you’ll establish a solid foundation in UnrealScript that you can utilize when building your own games.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t<span><strong style=\"\">Alan Thorn</strong> is a London-based game developer, freelance programmer, and author with over 13 years of industry experience. He founded Wax Lyrical Games in 2010, and is the creator of the award-winning game, Baron Wittard: Nemesis of Ragnarok. He is the author of 10 video-training courses and 11 books on game development, including Unity 4 Fundamentals: Get Started at Making Games with Unity, Focal Press, UDK Game Development, and Pro Unity Game Development with C#, Apress. He is also a visiting lecturer on the Game Design &amp; Development Masters Program at the National Film and Television School.</span>  </p>", 
    "end_date": null, 
    "title": "Unreal Development Kit Game Programming with UnrealScript", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355166_eeaa_2.jpg", 
    "course_url": "https://www.udemy.com/unreal-development-kit-game-programming-with-unrealscript/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T10:27:05Z"
}