{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Nuestro Curso de Desarrollo de Videojuegos en Swift utilizando SpriteKit te enseñará las herramientas necesarias para desarrollar tus propios videojuegos desde cero para iPhone e iPad en Swift, el nuevo lenguaje avanzado de Apple creado para desarrollar apps y videojuegos para iOS. El curso incluye algunos algoritmos, herramientas, utilidades, conceptos y patrones de diseño importantes así como consejos y <em>best practices </em>que te ayudarán a iniciarte en el mundo del desarrollo de videojuegos 2D.</p><p>Al finalizar el curso, serás capaz de reproducir y entender la gran mayoría de funcionalidades de las videojuegos más populares de iOS y profundizar en ellas para hacer tus propios juegos. También, como no, aprenderás a sacarle el jugo a tus videojuegos como por ejemplo metiendo publicidad en forma de banners, interstitials y vídeos, promocionándolos a través de la viralidad y el marketing y subiéndolos a la App Store. ¡Así mismo veremos un ejemplo de re skin que yo mismo he realizado del juego y he publicado en el App Store!</p><p>Sin duda, la práctica a través de la construcción es una muy buena forma de aprender, por eso durante el curso, los estudiantes realizarán videojuegos cubriendo todos los aspectos esenciales del desarrollo de juegos 2D para iOS. Cada uno que realices mejorará tus habilidades y dispondrás del <strong>código fuente </strong>del instructor para acceder a él, contrastarlo con el tuyo, adaptarlo a tus necesidades y como no, mejorarlo.</p><p><strong>Qué vas a aprender</strong></p><ul><li><strong>Swift</strong>: Aprende el nuevo lenguaje de programación de apps para iOS y Mac.</li><li><strong>Xcode</strong>: Aprende a manejarte por su interfaz y todos los trucos necesarios para maximizar tu tiempo.</li><li><strong>Cocoa y UIKit:</strong> Conoce a fondo el framework básico de desarrollo de apps, tanto a nivel lógico, funcional como a nivel visual.</li><li><strong>SpriteKit:</strong> Conoce a fondo el framework básico de desarrollo de videojuegos en 2D creado por Apple, tanto a nivel lógico, funcional como a nivel visual.</li><li><strong>iOS9 y XCode 7</strong>: Utiliza la última tecnología disponible de la mano de Apple.</li><li><strong>Programación</strong> <strong>básica</strong>: aprende programación desde cero, variables, bucles, condicionales, hilos, delegados, patrones de programación...</li><li><strong>30 días con 100% garantía de devolución</strong>: si no quedas satisfecho, tienes 30 días para reclamar la devolución de tu pago sin ningún problema.</li></ul><p><strong>Escucha las opiniones de los estudiantes</strong><br></p><ul><li><em><strong>Raziel Tovar - Excelente curso! </strong></em>Me parece que Juan sabe como explicar de forma muy sencilla lo que antes me parecía muy complejo. Lo recomiendo bastante!</li><li><em><strong>María del Mar Cardona - Lo que yo buscaba! </strong></em>Un curso fabuloso, especialmente para mí que aunque sé algo de java me hacía mucha ilusión adentrarme en la programación para iOS que sin duda es muy atractiva! Lo recomiendo al 100% a toda la gente que quiera aprender a hacer apps.</li><li><strong><em><strong>Miguel Ángel Ferri - E</strong>xcelente curso para empezar a desarrollar tu app desde cero </em></strong>Tengo muchos años de experiencia en el desarrollo de juegos y aplicaciones web y escritorio, elegí este curso para introducirme en el desarrollo de aplicaciones para IOS y me ha parecido muy bien explicado, con un lenguaje fácil y comprensible para cualquier persona. En definitiva 100% recomendable para toda aquella persona, con o sin experiencia, que quiera empezar a desarrollar para IOS.</li></ul><p><strong>Apúntate ahora </strong>y únete a los más de 2.000 estudiantes que ya disfrutan de los cursos de Juan Gabriel Gomila en Udemy. </p>", 
    "end_date": null, 
    "title": "Videojuegos 2D: Crea tus propios videojuegos con SpriteKit", 
    "price": "35.00", 
    "instructors": "D. Juan Gabriel Gomila Salas", 
    "commitment": "18 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705822_3fdc_2.jpg", 
    "course_url": "https://www.udemy.com/videojuegos-desde-cero-con-swift-y-spritekit/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T16:05:04Z"
}