{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>From the author of one of the most influential Unity &amp; Android courses ever made in Udemy titled: </strong><em>Become a 2D Game Developer for Android In No Time!</em><br></p><p><strong>Take this course, develop your first Android and iOS game, upload it to the market, and start making money NOW! 100% Satisfaction Guaranteed (<em>or your money back!</em>)</strong><br></p><p>++++++++++++</p><p><strong>Did you know that...</strong></p><p>Writing games for mobile devices is not very difficult, but you might need some assistance in the beginning, and I will help you to make this process much easier. For now our aim will be on Android and iOS, the two giants in the mobile industry.</p><p>At the end of this course, you will be able to create your own 2D games using the important concepts taught there, such as the Object Pooling technique. Besides, unlike any other Unity course out there, we will also focus on the graphic design of the assets we are going to use, so you will end up having various graphical design competences also!</p><p><strong>Is this course just for Android and iOS?</strong><br></p><p><em>No</em><em>! </em>You will also learn (on Lecture 22 to be more specific) how to make this game work for whatever platform you can think of: BlackBerry, PC, Mac, Linux, Windows 8/8.1, Android, iOS.</p><p><strong>Why 2D games?</strong></p><p>First of all, think that the great majority of success cases in the mobile game industry is made up of 2D or 2.5D games: Candy Crush, Flappy Birds, Clash of Clans, Angry Birds, Geometry Dash, ...</p><p><strong></strong>Furthermore, 3D games are significantly complex compared to 2D. From a programming perspective, 3D requires more math skills. Data structures are complex, animation is hard to program, and the volume of data is much higher, making memory management and app responsiveness a difficult task. Art work for 3D tends to be more complex and the set of skills required is wider. From a design perspective, it is difficult to author levels and level physics. Comparatively, you can develop in 2D much faster with little to no experience in game design.</p><p><strong>Why Unity3D software?</strong></p><p><strong></strong>Unity3D takes away most of the difficulties associated with a game design. It provides a built in physics engine, which otherwise would require a large amount of effort to develop. Unity3D also provides a rich and sophisticated animation system, with the ability to set up animations on a variety of objects, including humanoid characters. It also provides, among other things, a built in AI capability for navigation and path finding.</p><p><strong>What kind of materials will you find in my course?</strong></p><p><strong></strong>This is a course entirely based on videos and a set of tests/homeworks, so that we can test if you successfully acquired the concepts. Within each Lecture you will also find out any downloadable resource you might need.</p><p><strong>How long will it take to complete this course?</strong></p><p>The course length is of around 5 hours, but you will still need to do some research and work on your own. Remember that the course is updated every one or two months, so the exact time it will take you to complete the course will greatly depend on the time you can dedicate to study and do self-research.</p><p><strong>How is this course structured?</strong></p><p>The course is structured in various sections, each one covering an important aspect of the game. Worth noting that, as the course is in constant update, new sections will arise slowly but surely!</p><p>For example, in the 1st section we welcome our new fellow students to the course. In the 2nd section, we go over all the graphic designing process. In the 3rd section we introduce our project's folder hierarchy and import the joystick. In the 4th section, we play around with our camera and create some code to make it follow our survivor properly. In the 5th section,</p><p><strong>In a nutshell please...</strong></p><p>Developing 2D Android and iOS games is a great way to start earning money and join the elite club of other successful app developers. You will also have a greater satisfaction while doing so. I assure you that I will help you to make this process much easier. Thanks for staying with me during this journey by purchasing this course. You won't regret it!</p>", 
    "end_date": null, 
    "title": "Zombies Game Development for Android, iOS and PC using Unity", 
    "price": "35.00", 
    "instructors": "Jose Lopez Garcia", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536432_b261_4.jpg", 
    "course_url": "https://www.udemy.com/2d-zombies-game-android-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T18:48:28Z"
}