{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>【はじめに】</p><p>ゲームが好きでいつか自分のゲームを作ってみたいと１度でも考えたことがある方へ。プログラミングの知識や経験が無くても３Dゲームを作れるようになってみませんか？</p><p>Unityの登場でゲーム作りが大企業から個人が作れる時代になりました。<br></p><p>一昔前であれば3Dゲームを作りたいと考えた場合、Direct XやOpenGLといったライブラリが用意されていて、実際に使ってみようと思うと、プログラミングの知識が膨大に必要でとてもじゃないけどゲームなんて個人で作るのはとても難しく敷居が高い分野でした。技術革新が進み、様々な環境が整い、今では簡単に個人でもゲームが作れるようになってきています。</p><p>１０年近く前 J2ME(Java Micro Edition)というライブラリを使ってガラケーのiアプリを作ることができる環境があり、オセロゲームやブロック崩しを作ったことがあります。１ヶ月ぐらい格闘しなんとか完成したものの大変でいろいろな人に使ってもらえるようにするまでは至らず諦めてしまったこともありました。</p><p><span></span>そんな中で強力なUnityを使うことで圧倒的に素早く簡単にゲームが作れるようになったので、数多くの人にゲーム作りの面白さ、魅力をステップバイステップでご紹介していこうという思いに至りました。</p><p>今までゲーム作りの敷居を上げていた原因は大きく３つありました。</p><p>・プログラミング知識が膨大に必要で、とても複雑でとっつきづらい</p><p>・ゲーム素材を用意するのが大変で本格的なゲームを作りづらい</p><p>・個人が世界に向けてゲームを広げていく環境が作りづらい</p><p>こういった原因が技術革新が進んだことで大きく敷居が下がり個人でもゲームを作って広げていくことができるようになってきました。</p><p>このコースを通して１人でも多くの方に就職や転職に有利になったり、独立していくこともできる道筋を与えてくれたUnityの素晴らしさを知ってもらいたいと考えています。この活動を広げていくためにも無料ではなく有料のコースとさせていただいています。一緒にUnityを使ってゲームやエンターテイメントの世界を広げていきましょう。</p><p>そして最終的にはこの出会いを通じて誰でも知っているようなゲームタイトルを作り出していく世界を実現してみてください。あなたと共に成長していく未来を楽しみにしています。</p><p>【コース概要】</p><p>Unity 3Dゲームエンジンを使って、ゲームデザインを体験するコースです。Unityは世界中でも加速度的に普及し、日本でも導入が進んでいます。スマホやパソコン、Play Station、Wii、XBoxなど環境を選ばずマルチプラットフォームで動作するゲームやインタラクティブなコンテンツを制作することが可能です。ユニティのユーザインタフェースの使い方を知り、ゼロからゲームレベルを作成する方法を学べます。そして、ゲームオブジェクト(Game Object)を追加し、画像素材(Texture)を適用し、照明(Light)や高度な粒子（Particle）効果を適用する方法を実践することができるようになります。作成したゲームを動き回ることができるようになるゲームコントローラ(Game Controller)でゲームを実行してオリジナルゲームの世界観を楽しみましょう。ゲームコントローラでは一人称視点、三人称視点（上からキャラクタを見下ろす）でキャラクタを動かしていく方法をご紹介していきます。</p><p>【講師紹介】</p><p>１０年以上にわたり、IT業界で開発現場から経営まで、あらゆる分野のシステム関連プロジェクトを経験してきた開発スペシャリストです。現在は本業に加えて、情報技術に関する講師活動、起業から上場手前までのマーケティング、経営コンサルティングサービスを展開しています。</p><p><br></p>", 
    "end_date": null, 
    "title": "【初心者でも簡単】はじめてのUnity 3D ゲームデザイン", 
    "price": "20.00", 
    "instructors": "Sato Takuya", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711868_b7f4_2.jpg", 
    "course_url": "https://www.udemy.com/unity-3d-game-design/", 
    "currency": "USD", 
    "subject_name": [
        "Game Development"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T13:16:49Z"
}