{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>One of the largest barriers to personal growth and feeling good about yourself is being self-critical or beating yourself up. You might be so used to having negative thoughts about yourself, you don't even hear them anymore. Learn how to stop this self-defeating process easily and quickly - finding inner peace.\n\n  </p>\n\n<p>The research suggests that giving ourselves a break and accepting our imperfections may be the first step toward better health. People who score high on tests of self-compassion have less depression and anxiety, and tend to be happier and more optimistic. Preliminary data suggest that self-compassioncan even influence how much we eat and may help some people lose weight.\n\n  </p>\n\n<p>This idea does seem at odds with the advice dispensed by many doctors and self-help books, which suggest that willpower and self-discipline are the keys to better health. But Kristin Neff, a pioneer in the field, says self-compassion is not to be confused with self-indulgence or lower standards.\n\n  </p>\n\n<p>“I found in my research that the biggest reason people aren’t more self-compassionate is that they are afraid they’ll become self-indulgent,” said Dr. Neff, an associate professor of human development at the University of Texas at Austin. “They believe self-criticism is what keeps them in line. Most people have gotten it wrong because our culture says being hard on yourself is the way to be.”\n\n  </p>\n\n<p>Here's what students have to say!\n\n  </p>\n\n<p>“I loved the class and the exercises. I can see myself doing it very often to touch base with my feelings on my life and who I am.”\n\n  </p>\n\n<p>“I would never have thought such a simple process would reap such rewards….I would have scoffed had I not tried. This sends me in a new direction that I thoroughly appreciate.”\n\n  </p>\n\n<p>“All in all, I felt like I went on a mini spiritual journey here.”\n\n  </p>\n\n<p>Stop listening to those old voices that tell you you did it wrong or you aren't smart enough or you did such a terrible thing or that was an unforgivable mistake. Learn how to give yourself forgiveness and love so you can stop being stuck in your life. You'll watch 6 videos and download pdf's that teach you the process. The course will take about 30 minutes. Take this course if you'd like to move forward into more and more success and more and better self-regard.\n\n  </p>\n\n", 
    "end_date": null, 
    "title": "5 Steps to Stop Beating Yourself Up", 
    "price": "20.00", 
    "instructors": "Personal  Growth Teacher Maia Berens", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/870596_a4c4_3.jpg", 
    "course_url": "https://www.udemy.com/5-steps-to-stop-beating-yourself-up/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-06T20:22:49Z"
}