{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t                  Accent Reduction for Professionals Who Want to Get Ahead Professionally  </p>  <p style=\"\">  \t          Hear what others are saying:</p><p style=\"\"><strong style=\"\">A Life Changing Course!</strong></p><p style=\"\">\"This is not just a course of 4 hours, it is a course that holds the potential to change your life. It changed my accent dramatically, it will change yours too. I followed each and every techniques she talked about, that's because it's well explained and easy to follow. I wish I could talk to her over the phone to show her how much I improved my accent. Certainly, a highly recommended course for every non-native speakers of English.\"  by SAJIB.</p><p style=\"\"><strong style=\"\">Great course</strong> </p><p style=\"\">The whole idea of the course is new and sure will help a lot of people from all cultures to improve their accent... highly recommended by Maged Koshty </p><p style=\"\"><br style=\"\"><strong style=\"\">Great Course</strong> </p><p style=\"\">By explaining those rules using examples, helped a lot and made me feel more comfortable since I truly understand why and how to speak, hence the reduction to my accent. Faisal Rehman</p><p style=\"\"><strong style=\"\">Great Course</strong> </p><p style=\"\">By explaining those rules using examples, helped a lot and made me feel more comfortable since I truly understand why and how to speak, hence the reduction to my accent. Sandeep Kumar </p><p style=\"\"><strong style=\"\">Very Helpful Course</strong> </p><p style=\"\">Tracy ... Thanks for such a great course. I am getting a lot of value from this course. Milciades Andrion,</p><p style=\"\"><br style=\"\"></p>  <ul style=\"\"></ul>  <p style=\"\">  \t          Are you tired of repeating yourself?  </p>  <p style=\"\">  \t          Are you not getting ahead because your accent is creating a barrier?  </p>  <p style=\"\">  \t      (Bonus FREE course with enrollment in this course, check the bottom of the page)  </p>  <p style=\"\">  \t          It's actually easier than you might think to reduce your accent and get ahead.  Accent reduction is a technique that is primarily centered around correcting missing/mispronunced vowels and consonants.  There are other parts to accent reduction including intonation and stress and they are all included in this course that is jam packed with great technique you can easily start applying today.  </p>  <p style=\"\">  \t                  A great course for anyone who is struggling with a thick or heavy accent.  Especially individuals who are well aware that their accent needs to be neutralized because it's getting in the way of their business and personal success.  </p>  <p style=\"\">  \t                  In this course, you will learn every step needed, from start to finish, how to reduce your accent.  </p>  <p style=\"\">  \t                  This course covers placement, identifying mother tongue issues and correcting, learning how to pronounce vowels and consonants that have been problematic or non-existent in the past.  This course will teach you how to vowel and consonant inversions indicative of mother tongue influences.  This course will teach the subtle nuances that are so important in reducing your accent so you can speak with more clarity, including intonation, pacing, stress, phrasing and thought groups and pronunciation.  This course will also cover several valuable bits for greater success with presentations including driving to the end of words, pacing, pausing and breathing.  </p>  <p style=\"\">  \t                  Why should you take this course?  If you have struggled in the past with a heavy or thick accent, research shows that by reducing your accent you will be able to get past barriers that have held you back in business and socially.  You will neutralize your accent with this technique and build more confidence in your speaking, presentations and instruction.  </p>  <p style=\"\">  \t                  No materials are needed for this course.  Each component is taught via video with supporting materials that include PDF worksheets, quizzes and audio examples.  </p>  <p style=\"\">  \t                  The course is comprehensive and more lessons and exercises will be added along the way.  The length of time for completion depends on how much time you spend watching the videos and applying the techniques.  I've seen people reduce their accents in a few short weeks.  </p>  <p style=\"\">  \t                In addition, I update this course on a regular basis.  I have already updated the course two times by adding numerous videos, audios and training materials.  I will continue to update the course on a regular basis.  </p>  <p style=\"\">  \t                I also am willing to review your work, your sound.  If you send me an audio, I will review it and give you an assessment of what you need to focus on to improve your sound.  I am also available in the discussion area and easy to access.  </p>  <p style=\"\">  \t                I offer a 30 day money back guarantee.  I stand behind my work completely and know that you will benefit from this course.  However, if you are not satisfied, I do offer a money back guarantee.  </p>  <p>  \t      Also, get my course 8 Crucial Techniques to Be More Engaging in Videos for FREE on enrollment.  </p>", 
    "end_date": null, 
    "title": "Accent Reduction:  Be Heard, Understood, Get Ahead in Life", 
    "price": "45.00", 
    "instructors": "Tracy Goodwin", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364184_6506_3.jpg", 
    "course_url": "https://www.udemy.com/reduce-your-accent-and-increase-business-and-social-standing/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T18:54:46Z"
}