{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>If anxiety has ever caused you a problem, then you might be glad to learn that there is a quick and efficient way to deal with it which doesn't involve taking drugs.</strong></p>\n\n<p>'Anxiety Boot Camp: A Complete Guide to Beating Anxiety' will give you life changing insights into what anxiety is, where it comes from and how to overcome it in the most efficient way.</p>\n\n\n\n\n\n\n\n\n\n<p>If you've previously searched for help with anxiety, you may have come across a broad range of confusing and contradictory ideas on the Internet, or perhaps even from health practitioners or therapists who will often do more harm than good.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Throughout Anxiety Bootcamp, you will learn how to:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul>\n<li>Develop and Strengthen Your Inner Resilience</li>\n<li>Identify and Change Your Habitual Response Patterns.</li><li>Take the First Steps Towards Being Rid Of Anxiety For Good.</li>\n<li>Overcome Future Challenges With Greater Confidence &amp; Ease.</li>\n<li>Understand What Anxiety Is And Realise Where It Comes From</li>\n<li>Develop Genuine Confidence That is Easily Recognised by Others.</li>\n<li>Remove Your ‘Head Trash’ &amp; Harness the Tools That Cultivate Your Inner Peace.</li>\n</ul>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p>Anxiety Boot Camp: A Complete Guide to Beating Anxiety, has been uniquely designed to provide you with truth based, &amp; easy-to-digest information that’ll enable you to take control of anxiety and overcome it as quickly as possible.</p>\n\n\n\n\n\n\n\n\n\n<p>Managing our negative emotions is a crucial life lesson that we seldom get taught about in school. So, by building your emotional intelligence, you’ll become able to manage your emotions in a more effective way, and take back full control of your life in the process.</p>\n\n\n\n\n\n\n\n\n\n<p>Wisdom once said that, <em>'Anxiety, is carrying tomorrow's load with today's strength. It's moving into tomorrow ahead of time. Anxiety doesn't empty tomorrow of its sorrow, it just empties today of its strength.'</em> Understanding anxiety is the first step towards beating it!</p>\n\n\n\n\n\n\n\n\n\n<p><strong><em class=\"redactor-inline-converted\"><strong>Anxiety Bootcamp comes with a Full Money Back Guarantee, so take this course today, and if you're less than fully satisfied, you can get a full refund within 30 days.</strong></em></strong></p>", 
    "end_date": null, 
    "title": "Anxiety Boot Camp: A Complete Guide to Beating Anxiety", 
    "price": "20.00", 
    "instructors": "Kain Ramsay", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/586442_2022_9.jpg", 
    "course_url": "https://www.udemy.com/how_to_overcome_anxiety/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T15:02:10Z"
}