{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    “The privilege of a lifetime is being who you are.” - Joseph Campbell  </p>  <p>  \t  This course distills research from psychology into lessons and steps that you can take to live more authentically.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Start living your own life</strong>  </p>  <p>  \t  ·Get in touch with your true self  </p>  <p>  \t  ·See the world without distortions and biases  </p>  <p>  \t  ·Build authentic relationships with your partner, friends and family  </p>  <p>  \t  ·Discover what it takes to live authentically  </p>  <p>  \t  ·Become who you really are  </p>  <p>  \t<br style=\"\">  \t<strong style=\"\">Get a full-fledged authenticity course that covers every single factor that will contribute to a life that’s true to yourself.</strong>  </p>  <p>  \t  Being ourselves is at the heart of a fulfilled life. Authenticity plays a major role in fulfilled relationships, a life of passion and honesty as well as self-confidence. People who are able to express themselves authentically, are among the happiest and also most successful people in the world. In this course, you’ll learn how to live your life authentically – based on the scientific research on authenticity.  </p>  <p>  \t  At the beginning, we’ll briefly cover the What? and Why? of authenticity before we learn which factors contribute to an authentic life. Then we’ll set the basis for living authentically: getting in touch with our true selves. Next we will build on this understanding of our true selves and take all the necessary steps that will lead us to a more authentic life. Throughout the whole course, you’ll get activities, worksheets and more additional material that will lead you through the exact steps.  </p>  <p>  \t<br style=\"\">  \t   One more thing: You have a totally unconditional money back guarantee. It allows you to study the course for 30 days and if you are in any way unhappy with it, you will get a full refund, no questions asked! Enrolling in the course is absolutely risk free.  </p>  <p>  \t<em style=\"\">Click the &quot;Take This Course&quot; button now and enroll!</em>  </p>", 
    "end_date": null, 
    "title": "Authentic Living: The Psychology of Authenticity", 
    "price": "30.00", 
    "instructors": "Manuel Kraus", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403708_64ce_3.jpg", 
    "course_url": "https://www.udemy.com/science-of-authenticity/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T18:26:52Z"
}