{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Our instructors have over 10 years of combined experience in the field of psychology, life coaching and stress management, and after successfully helping thousands of people in Norway and abroad overcome social anxiety, lack of confidence and low self-esteem, Frank and Joe joined Udemy in order to reach more people with their proven strategies for living a life of freedom, excellent work performance, successful relationships and powerful self-development. </p>\n\n<p>Joe and Frank apply the principles of neuroplasticity - the 'muscle building' part of the brain to effectively help you take control of your mind and emotions and optimize your personal growth and success in all other areas of your life too.<br></p>\n\n\n\n\n\n\n\n\n\n<p>At the end of this course, with the tools and knowledge you gain, you will have more confidence to follow your goals, motivation for success, drive for achievement and most importantly powerful awareness of yourself and others which unique abilities will all help you <strong class=\"redactor-inline-converted\">discover</strong> what exactly you need to change so you can <strong class=\"redactor-inline-converted\">design</strong> your life the way you want it and <strong class=\"redactor-inline-converted\">dominate</strong> each challenge. </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Power is within you. We just give you the keys you need to access it. </strong><br><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course content</strong><br>The course consists of 3 sections and 37 video lectures that give you engaging real-life examples to better understand what factors and situations within you and around you lead to anxiety and stress, followed by step-by-step guidance from our instructors on what proven strategies you can use to change these factors and turn each anxiety situation into a positive experience.<br><br></p>\n\n\n\n\n\n\n\n<p>We will teach you the following concepts:<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>The power of our proven 3D system that beats anxiety</li><li>Neuroplasticity and brain programming for success</li><li>How to program your mind for positive behavioral changes</li><li>Anchoring of positive emotions and experiences</li><li>Proven techniques to instantly achieve positive state of mind</li><li>How to use your mind and body as abundant sources of energy and motivation</li><li>How to develop self-awareness of yourself, others and your environment which knowledge you can then pair with our tools to design your experiences in the right way for achieving your goals.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why us and what makes our course different?</strong></p>\n\n<p>Welcome to our new and improved course, after we had over 6000 students on our first course here at UDEMY we decided to make a new and improved one and give it to you once again for free. Enjoy!</p>\n\n<p><strong class=\"redactor-inline-converted\"></strong>We have dedicated the last 10 years of our lives reading hundreds of personal growth books, attending motivational seminars all over the world, and listening to the best spiritual teachers, successful entrepreneurs and leading psychologists we could find. </p>\n\n\n\n\n\n\n\n\n\n<p>We actually <strong>PRACTICE AND LIVE</strong> what we PREACH. We have done the hard work of going through trial and error so we can create the best tools to help others accelerate their personal and professional growth through simple yet effective mind changing techniques.<br>We all have the choice of reading books, meeting people, taking education and receiving mentoring. But when you are in such a chaotic world, where money is more valued than time, you don't want to crawl around the globe to find the right tools to live your life, let alone spend years experimenting with them. You want the answers here and now!!!<br>That's why we created this course – to help you hack your brain towards more confidence and self-awareness and self-power. We believe that once you master these qualities, you will be able to enjoy life more and be clearer on you goals. We have tested it all and here we give you the most effective of them all. Try for yourself!</p>", 
    "end_date": null, 
    "title": "Beat Anxiety: Proven Strategies for Self-Power & Confidence", 
    "price": 0, 
    "instructors": "Frank Nilsen, Joe Syversen", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738710_0f5b_5.jpg", 
    "course_url": "https://www.udemy.com/brain-rewire-how-to-hack-social-anxiety/", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-23T08:14:06Z"
}