{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Welcome to my Udemy course The Perfect Tinder Profile. Volume 3: Opener!</strong></p>\n\n<p>For the past 8 years, I've been traveling the world teaching men of all ages how to meet and attract <em>all different kinds</em> of women! From New York to Paris and from Sydney to Prague, <strong>I've helped men not only learn to get laid, but meet the women of their dreams</strong>, wherever they may be! </p>\n\n<p><strong>I've worked so hard at this over the past ten years that universities like Yale and Columbia have invited me to speak and I've even been on Nightline and NBC news.</strong> You'll forgive me if I seem confident when I say that not only do I know I can help you, it's my <em>passion.</em></p>\n\n<p><em><em><strong>From some of my students:</strong></em>\n</em></p>\n\n<p>“Gareth's texting instruction has helped me significantly improve my texting. I used to get anxious and not know how to effectively communicate with women via text. Gareth's instructions were easy to implement and I now text in a more direct, playful manner that women have come to love.”</p>\n\n<p>Ron, Prague - 2015</p>\n\n<p>“Gareth gave me some of the best texting advice I ever received, some of it flew in the face of conventional wisdom, and he's absolutely right.”</p>\n\n<p>Mike, Los Angeles - 2015</p>\n\n<p>\"I really enjoyed being coached by Gareth ; his teaching is extremely personalized, he is emotionally committed to the success of his students. He is an esthete, he loves the good things of life in a very empowering way, and one month later I still get compliments about my style, thanks to the advice he gave me”.</p>\n\n<p>Arnaud, NYC - 2015</p>\n\n<p><em><strong>\n</strong></em></p>\n\n<p><em><strong>This course is one of four courses to help you design The Perfect Tinder Profile so that you can use this incredible app to meet women of all ages everywhere you go</strong> (Volume 1: Pictures, and Volume 2: Tagline are already out, and Volume 4: Getting The Number is on it's way!). Whether you're stationary in your favorite city or a rambling man, Tinder is an amazing tool for meeting local women <em>instantly</em> (yes, just like those ads - but real!) and has been invaluable for <strong>many</strong> of my romantic relationships, including my current girlfriend of more than a year!\n</em></p>\n\n<p>Now that you understand how important Tinder can be; you're ready for our <strong>11 videos</strong> of yours truly speaking straight at the camera (no funny business!) about very the particular points of the Perfect Tinder Opener and the <strong>bonus PDF</strong> including my original notes outlining each video and it's important elements!</p>\n\n<p>Even though this course will be quick and easy to complete, by the time it's over, you'll be able to start constructing your <strong>Perfect Tinder Profile</strong> to maximize your dating success!\n\nMany sincere thanks to the students taking part in this course and <em>especially</em> those that are helping the course (and me!) to refine and grow with their comments and suggestions.\n\n</p>\n\n<p>Happy Swiping!\n</p>\n\n<p>-Gareth Roger Martin Jones</p>\n\n", 
    "end_date": null, 
    "title": "Building The Perfect Tinder Profile. Volume 3: Opener", 
    "price": "50.00", 
    "instructors": "Gareth Jones", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848432_9bad_3.jpg", 
    "course_url": "https://www.udemy.com/perfect-tinder-profile-aotp3/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T19:26:11Z"
}