{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Be better on camera with more confidence, authority, and comfort!</strong></p><p><em>Do you get nervous when speaking on camera?</em></p><p><em>Do you wish you felt more confident and had a better on camera presence?</em></p><p><em>Are you trying to be on television, a YouTube vlogger, or an online teacher?</em></p><p><em>Do you have to be on camera for an interview, and need quick media training?</em></p><p><strong>If you answered yes to any of those questions, this is the perfect course for you. </strong>This mini-course will help you feel more confident, speak more clearly, and have an overall better on camera presence no matter what kind of video you are a part of.</p><p><em><strong>Learn from a television professional!</strong></em><br></p><p>Christian Hartnett is a mutimedia journalist with over a decade of on camera experience. He has a bachelor of arts in broadcast journalism and was recently the youngest field reporter for CBS San Francisco. He's learned many tips and tricks over the years that have helped him be successful. He's also made a lot of mistakes and struggled to be confident on camera, <em>just like you.</em><br></p><p><strong>Course Overview:</strong></p><p>Enjoy this free course, the first section and a few other great lessons from the full Camera Confidence Media Training course right here on Udemy. Get started with some basic techniques that will get you more comfortable right away. <em>If you enjoy this free course, check out the full Camera Confidence course!</em><span> It expands on the content of this free course with hours more content!</span></p><p><strong><strong>Enroll now to be better on camera!</strong></strong></p><p>Increase your confidence for your next video, television appearance, YouTube vlog, or online course.</p><p>Cheers,</p><p>Phil &amp; Christian</p>", 
    "end_date": null, 
    "title": "Camera Confidence Mini-Course: Be Better On Camera", 
    "price": 0, 
    "instructors": "Phil Ebiner, Christian Hartnett", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766626_2578.jpg", 
    "course_url": "https://www.udemy.com/camera-confidence-mini-course-be-better-on-camera/", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T15:24:13Z"
}