{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>***Updated For <em>June </em>2016***</strong></em><br></p>\n\n<p><strong>Charisma gives you power in business &amp; relationships. It allows you to develop a large professional network providing you with countless opportunities &amp; a strong social circle filled with meaningful personal connections. Studies have shown that people with a larger social circle are smarter, live longer &amp; display greater happiness!</strong></p>\n\n\n\n\n\n<p><strong></strong>The question is, can you <strong><em>engineer</em> charisma?</strong><strong></strong><strong></strong></p>\n\n\n\n\n\n<p>Most people believe that charisma &amp; popularity are magical gifts that only a few chosen ones are born with while others have to suffer through their entire lives enduring reduced business opportunities, boring relationships and sometimes even depression because of their lack of charisma. \"Celebrity-like popularity\" is all about exploiting social strategies to bend \"social rules\" at your will and boost your popularity.</p>\n\n\n\n\n\n<p><strong>Guarantee: By the end of this step-by-step actionable course you will have mastered the ability to become the most popular person in the room.</strong></p>\n\n\n\n\n\n<p><strong>Why do the 7 laws work?</strong><br>The 7 laws of popularity are based on science &amp; an insane amount of trial and error. Simply knowing the theory is not enough, you need to know how you can apply the laws effectively to boost your popularity.</p>\n\n\n\n\n\n<p>Each and every single law has been distilled to it's pure essence meaning that they will work for anyone. </p>\n\n\n\n\n\n<p><strong>In this course you'll learn the following secrets:</strong><br>-The exact science on how to <strong>gain, maintain and capitalize on the power of popularity.</strong><br>-The incredible <strong>dangers of over-exposure</strong> and how most people fail to be popular.<br>-How to <strong>avoid resentment from others</strong> so that people are always on your side.<br>-How to properly use momentum to give you <strong>\"celebrity-like popularity\" instantly.</strong><br>-The incredible importance of avoiding<strong> \"leeches\"</strong> and <strong>\"sinking ships\".</strong></p>\n\n\n\n\n\n<p>As you go through this course you will see your popularity skyrocket because the course is filled with powerful exercises that push your comfort zone so you can master social situations!</p>\n\n\n\n\n\n<p><strong>In addition, you will receive these 2 bonuses:<br>-Bonus #1:</strong> <strong>Popularity On Steroids</strong>, which will reveal to you the<strong> 5 proven ways to boost your popularity</strong> even further<strong><br>-Bonus #2:</strong> <strong>The Popularity Quick Guide</strong>, which will give you <strong>a quick portable reference</strong> of the 7 laws</p>\n\n\n\n\n\n<p><strong>The Better than Money Back Guarantee</strong><br>As always there is a 30 day money back guarantee and if you complete this course and don't have celebrity like popularity then I will give you <strong>double your money back</strong> out of my own pocket. It is my mission in life to help people grow and develop themselves and I know without a shadow of doubt that <strong>Charisma Alchemy</strong><strong> will work for you.</strong></p>\n\n\n\n\n\n<p><strong>Make The Choice &amp; Enroll Today</strong><br>Enroll now and finally become the person that you always wanted to be. Check out the preview videos to see what you will be getting and start transforming your social skills &amp; charisma today.</p>\n\n\n\n\n\n<p>See you inside the course!</p>\n\n\n\n\n\n<p>Ben &amp; Eric</p>", 
    "end_date": null, 
    "title": "Charisma Alchemy: Rapid Popularity, Attraction & Confidence", 
    "price": "25.00", 
    "instructors": "Benjamin Hero, Digi Strats", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475276_379f_8.jpg", 
    "course_url": "https://www.udemy.com/charisma-alchemy-instant-popularity-attraction-system/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T19:33:09Z"
}