{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><span></span></p><ul><li>Over <strong>3500 happy students</strong> enrolled in my courses</li><li>Currently <strong>103 out of 124 4- and 5-star reviews</strong></li><li>No risk involved. Watch the <strong>PREVIEW VIDEOS</strong>!</li></ul>\n\n<hr>\n\n<p><strong>Confidence: How To Think, Feel, And BE Unstoppable!</strong></p>\n\n<p>Develop the ability to break through your fears, stand out in life, and get what you want.</p>\n\n<p><strong>Do you say these things to yourself:</strong><br></p>\n\n<ul><li><strong>I KNOW I have value to add to the world</strong>, I just don't have the confidence to put myself 'out there.'</li><li><strong>I wish I didn't feel so unbelievably anxious and uncomfortable</strong> in social situations - it's so frustrating and I know others talk about me when I'm not around!</li><li><strong>Why do I feel like I'm stuck in a rut</strong>, not really doing much in life other than what's 'comfortable', which makes me feel like I'm wasting my life away?</li><li><strong>I've got to get up and speak in front of others</strong> for my job - I wish I didn't dread it so much that it makes me sick!</li><li><strong>How can I be attractive to others</strong> if I don't feel good about myself?</li><li><strong>How can I develop the confidence I need</strong> in life to do amazing things?</li></ul>\n\n<p><br></p>\n\n<p>If these are the kinds of conversations you have in your head, <em>you're going to love this course</em>!</p>\n\n<p>Not only does it provide practical solutions to all these challenges (and many others), but the course is delivered to you in a energetic, simple, and fun way (<strong>check out the preview videos</strong>).<br></p><hr>\n\n<p><strong>So...what makes this course so unique?</strong></p>\n\n<ul><li>My relentless focus on delivering high-quality content within the course - <strong>It comes with a workbook!</strong></li><li>The high value of the ideas</li><li>The unique and engaging way lessons are presented</li><li>How practical and usable the ideas are that I teach you</li><li>The transformation you'll see in yourself</li><li>The transformation others will see in you</li></ul>\n\n<hr>\n\n<p><strong>This course is for you if you:</strong></p>\n\n<ul><li>Want to quickly become a more confident person with a strong sense of personal power</li><li>Have very little time to watch boring, complicated lessons</li><li>Tired of ideas that are really nothing more then weak, boring cliche's that are largely worthless nonsense ('be yourself', 'let go of your fear', etc.)</li><li>Enjoy video training over book-learnin'</li><li>Want actionable, practical strategies and tools that you can use right now - today</li><li>Think visual guides for the course content is cool and useful for reference later</li><li>Like having some fun while you learn</li></ul>\n\n<p>Scan the lessons below, and <strong>be sure to watch some of the FREE preview videos</strong> to see for yourself that what I just said is true!</p>\n\n<hr>\n\n<p><strong>After you're done watching the free preview videos, then follow these steps:</strong></p>\n\n<ol><li>Join the course</li><li>Watch <em>all</em> the videos</li><li>Download <em>all</em> the included guides/workbook</li><li>Put what you learn into action</li><li>Come back and let me know what you think -<strong> if you like what you've learned, leave a lovely (that means nice) review, if not, get a lovely refund (you have a full 30 days to do this)</strong></li></ol>\n\n<p>If you're ready to boost your confidence and be unstoppable, then join us today!</p>\n\n<p>Derek</p>", 
    "end_date": null, 
    "title": "Confidence: How To Think, Feel, And Be Unstoppable", 
    "price": "20.00", 
    "instructors": "Derek Franklin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/727244_fe06.jpg", 
    "course_url": "https://www.udemy.com/be-confident/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T20:04:32Z"
}