{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Este curso está <strong style=\"\">dirigido a padres, tutores, hermanos, amigos y conocidos de una víctima de acoso escolar o institucional, en especial a aquellas personas que tienen relación con un menor, adolescente o joven que sufre del acoso de agresores. Y está muy especialmente dirigido a aquellos que sufren del acoso por medios electrónicos,</strong> como las redes sociales, móviles, aplicaciones, ordenadores, Internet, Youtube y un sinfín más de tecnología de la información y comunicación. Es importante tomar este curso para poder identificar a tiempo un acoso o agresión especialmente en las nuevas tecnologías de la información y comunicación, como son las redes sociales, youtube, Internet, móviles (celulares), ordenadores y tabletas. Así poder actuar de manera inmediata con el objetivo de salvar la vida de la víctima y detener las agresiones.  </p>  <p>  \tEl objetivo de este curso es entregarte las herramientas necesarias para que puedas identificar una situación de bullying y cyberbullying y así:  </p>  <ol style=\"\">  \t<li><strong style=\"\">Detener</strong> el acoso a tiempo</li>  \t<li><strong style=\"\">Salvar</strong> a la víctima del acoso</li>  \t<li><strong style=\"\">Reinsertar</strong> a la víctima de bullying en la sociedad de manera satisfactoria</li>  \t<li><strong style=\"\">Identificar</strong> y <strong style=\"\">neutralizar</strong> al agresor</li>  \t<li><strong style=\"\">Comunicar</strong> a la institución involucrada y a otras instituciones de la existencia de  ese agresor, para que también <strong style=\"\">tomen medidas</strong> de contención</li>  \t<li>Hacer uso de <strong style=\"\">recursos penales y judiciales</strong> en caso de que sea necesario</li>  \t<li>Realizar un <strong style=\"\">mejor manejo de las tecnologías sociales para prevenir</strong> futuros casos de acoso o abusos ya sea a la víctima o de parte de nuestros hijos</li>  </ol>  <p>  \t  Utilizaremos terminología sencilla y al alcance comprensivo de todos. En el curso van a contar con clases grabadas en vídeo con narrativa en off para explicar cada punto. El mismo es de corta duración y culmina con un breve examen a los efectos de poder reforzar los elementos que les permitirán identificar una situación de Bullying y Cyberbullying así como detener estos casos a tiempo.  </p>  <p>  \tA su vez contarán con una <strong style=\"\">clase extra sobre la utilización de herramientas para monitorear a nuestros hijos de forma remota y sencilla</strong> mientras ellos utilizan sus ordenadores, smartphones o tablets, más la posibilidad de <strong style=\"\">adoptar una cuenta controlada para menores</strong> que nos avise cada vez que nuestros hijos buscan acceder a sitios no aptos para su edad.  </p>  <p>  \t  El curso se divide en clases que explican las diferencias entre Bullying y Cyberbullying. Les enseña ejemplo de estas prácticas y sus consecuencias. Se muestran otras conductas nocivas que son previas al bullying pero están muy relacionadas. Y finalmente les abre los ojos a todos y les entrega las herramientas para detectarlo, atacarlo y detener el Bullying para salvar la vida de la víctima.  </p>  <p>  \t  Es importantísimo realizar este curso, porque la tecnología es un mundo más dónde los peligros existen y el daño es real y puede ser irreversible. <strong style=\"\">Con estas herramientas podrán hacer frente a estas situaciones y proteger a los más queridos</strong>.  </p>  <p>  \tCon cada video de clase, <strong style=\"\">cuentan también con el mismo material escrito para descargar, parte de una publicación del mismo en una prestigiosa revista jurídica</strong> y también con una <strong style=\"\">encuesta</strong> que pueden descargar y completar a los efectos de saber <strong style=\"\">en qué situación se encuentra la víctima</strong> y a que grado ha llegado el acoso.  </p>  <p>  \t  Además del curso, una vez terminado el mismo podrán acceder a la presentación completa en Prezi y por supuesto, mi contacto para una primera reunión o consulta virtual de asesoramiento sin costo.  </p>", 
    "end_date": null, 
    "title": "Cyberbullying. La Guía para detener el acoso escolar digital", 
    "price": 0, 
    "instructors": "Andres Saravia", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288574_d22c_5.jpg", 
    "course_url": "https://www.udemy.com/cyberbullying-guia-de-detencion/", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T23:16:10Z"
}