{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Con este curso identificarás todas las creencias erróneas que te han implantado desde que eras un niño, descubrirás las ideas y conceptos equivocados que has aprendido y absorbido en la sociedad.</p><p>Aprenderás cuál es el proceso falso y erróneo que sigue la mayoría de las personas para determinar su autoestima, el cual genera una valoración mediocre e incompleta, generando así una autoestima débil y falsa, dando como resultado sentimientos de inferioridad, o falsos sentimientos de superioridad.</p><p>Obtendrás el proceso correcto para corregir tus ideas, tus conceptos y tus creencias limitantes, para poder así desarrollar una autoestima poderosa, sin complejos, y sin sentimientos de bajo valor que te impiden desarrollarte exitosamente en la vida, impulsándote por lo tanto en tu desarrollo personal.</p><p>La estructura básica de este curso consiste en presentarte el proceso mental-emocional que seguimos todas las personas en el procesamiento de información y obtención de resultados en la vida, para luego entender por qué tu sistema de pensamientos genera complejos de inferioridad, autoestima falsa y débil, para luego corregir tus creencias y modificar así tu sistema de pensamientos, logrando erigir una autoestima poderosa, fuerte y verdadera</p><p>El objetivo de este curso es mostrarte cuáles son los errores mentales que has aprendido, los cuales vienes arrastrando desde tu infancia, y que te impiden desarrollar una autoestima correcta, para revertirlos y convertirte en una persona de alto valor</p><p>Todas las personas merecemos obtener todo este conocimiento para evitar la timidez, para desarrollar habilidades sociales y ser exitosos en las relaciones interpersonales y en todos los ámbitos de nuestra vida</p>", 
    "end_date": null, 
    "title": "Cómo aumentar tu autoestima", 
    "price": "20.00", 
    "instructors": "Marcos Morales", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569732_25d4_6.jpg", 
    "course_url": "https://www.udemy.com/autoestima/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T00:03:23Z"
}