{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul>  \t<li><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Over 41,000 people from 180 countries enrolled in my courses</strong></em></li>  \t<li><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Featured as one of the Best instructors on Udemy</strong></em></li>  \t<li><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Overall, 1200+ TOP </em><em class=\"redactor-inline-converted\">Reviews from very happy students</em></strong></em></em></li>  </ul>\n\n<p><br><em><strong class=\"redactor-inline-converted\">[April 2016 BONUS: </strong>over 30 minutes of fresh bonus videos with the celebrity entrepreneur, author and world class public speaker - <strong class=\"redactor-inline-converted\">Peter Sage</strong>. Peter has started over 20 companies and shared the stage with the likes of Richard Branson and Bill Clinton to name just a few.<strong>]</strong></em><br><br>Confidence is one of the core principles of happiness. And fear is one of the primary obstacles to confidence. Confidence is proven to reduce stress and anxiety, and also improve one's ability to think clearly and make everyday decisions. This course is designed to to teach the principles which make up self-esteem and confidence, so that you can begin improving your outlook on life while reaching a higher level of self satisfaction.  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Start Exuding Confidence and Feeling More Self-Satisfied With This Straightforward and Effective Course.</strong>  </p>\n\n\n\n<ul>  \t<li>Building Confidence</li>  \t<li>Developing a Powerful Mindset</li>  \t<li>Social &amp; Perceived Confidence</li>  \t<li>Developing an Elevator Pitch</li>  \t<li>Rituals and Tricks</li>  </ul>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Contents and Overview</strong>  </p>\n\n\n\n<p>  \t  This course was made for anyone that wishes to improve their levels of confidence and self-esteem. The only requirements are a flexible mindset and a commitment to changing yourself.  </p>\n\n\n\n<p>  \t  Enrollees in this course will have access to over thirty-five videos that seek out your inner confidence and build it up step-by-step with mental exercises. You will learn how to feel powerful and capable in your abilities and break out of the psychological cages that you have built around yourself.  </p>\n\n\n\n<p>  \t  The course also includes strategies for maintaining confidence when anxiety slips back in, and how to deal with stressful situations. Then, you will move on to practice social interaction in exercises like a simulated elevator pitch. Finally, once you have achieved progress, you will learn some simple tricks that boost confidence and keep it going every single day.  </p>\n\n\n\n<p>  \t  Students who complete this course will be mentally prepared to feel more confident and full of self-esteem in most situations, including those game-changing moments that can turn your life around. This course may also increase the likelihood of you seeing opportunities every day and seeking them out instead of shrinking back in fear.  </p>\n\n\n\n<p>  \t  Learn to stop letting anxiety prevent you from leading the life you deserve; start gaining mental strength with these tricks and strategies and don't let the life you could have pass you by.  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What people say about this course:</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"The best course I have taken at Udemy. </em><em class=\"redactor-inline-converted\">I have enrolled another two courses by Jimmy, great teacher!\"</em> - <strong class=\"redactor-inline-converted\">Mèo đần</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Excellent course. </em><em class=\"redactor-inline-converted\">The instructor is very straight forward and gives a lot of practical examples and gives challenges to practice. The videos are very high quality and creative, nice idea to record videos in different cities of the world. I'll be back to remind of certain aspects that i forgot and for sure I'll practice for now on\".</em> - <strong class=\"redactor-inline-converted\">Jorge De Matos Vieira</strong><em class=\"redactor-inline-converted\">\"Great Course. </em><em class=\"redactor-inline-converted\">Enjoyed the course. Many great takeaways received. Very up to date for todays world.\" </em>- <strong class=\"redactor-inline-converted\">Hayden Proffitt</strong></p>\n\n\n\n<p>\"<em class=\"redactor-inline-converted\">WORTH IT! </em><em class=\"redactor-inline-converted\">I am not even finished, but I can tell, If you really listen to, understand and follow the steps and tips on the videos, you're gonna increase your confidence for sure!!</em>\" - <strong class=\"redactor-inline-converted\">Lucio Rodriguez</strong><em class=\"redactor-inline-converted\">\"This is really fun and challenging. </em><em class=\"redactor-inline-converted\">Even though I believe that I'm quite self-confident, I bought this Course to see if I can learn something new. It totally changes my view of what you can do to improve your self-esteem. Especially the Comfort Challenges are - as you might guess - very challenging. The quality of the videos is awesome and you can see that Jimmy put a lot of effort in this course. I really appreciate that.\" </em>-<strong class=\"redactor-inline-converted\"> Enis Tola</strong><em class=\"redactor-inline-converted\">\"</em><em class=\"redactor-inline-converted\">Trust me, you can double your confidence! </em><em class=\"redactor-inline-converted\">Jimmy Naraine's course on \"Double your confidence &amp; Self Esteem\" has gone beyond my expectation. There are so many factors which we consider of less importance. But if dealt properly, the magnitude of succeeding in achieving confidence is realistic. He explains these nitty-gritty details, which makes us think on \"Why we never thought about this before?!\". I've started practicing his suggestions. The audio and video clarity is one big plus in this course. Highly recommended.\"</em> - <strong class=\"redactor-inline-converted\">Shameer Mohammed</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">\"</strong>GREAT INFORMATION! Jimmy Naraine Is the man! he gives great information and he explains everything very well he does not sugar Coat anything he goes straight to the point! </em><em class=\"redactor-inline-converted\">Take ACTION!\" </em>-<strong class=\"redactor-inline-converted\"> Rihan</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"</em></strong><em class=\"redactor-inline-converted\">Great Course! A very well made course, lot's of great videos that really communicate the content. Very well and authentically presented in a professional manner. For me personally it was very well worth it, my confidence and communication skills have increased significantly and my overall living quality has increased a lot. </em><em class=\"redactor-inline-converted\">Big recommendation!\" -</em> <strong class=\"redactor-inline-converted\">Valentin Funk</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Excellent course to make yourself more confident. </em><em class=\"redactor-inline-converted\">The contents in the course are short videos and to the point. I like the baby steps jimmy used to taught us his tricks. It was fun to try all those challenge. Highly recommended\"</em> - <strong class=\"redactor-inline-converted\">Afsar</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Worth Every Penny! </em><em class=\"redactor-inline-converted\">This course does what it says and more, he really takes you on a journey that you are going to enjoy being on as you see the core problems that you are having that is holding your confidence back and how to change them\"</em>. - <strong class=\"redactor-inline-converted\">Jerome Moore</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Awesome Course. </em><em class=\"redactor-inline-converted\">I am learning a lot and am impressed with the presenter. He knows his stiff and presents it well. Thank you.\"</em> - <strong class=\"redactor-inline-converted\">Terrie</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Lots of good concepts. </em><em class=\"redactor-inline-converted\">Jimmy can find the right words and examples to explain theoretical concepts about confidence &amp; self esteem. I am pretty sure that applying these ideas would increase people confidence.\" </em>- <strong class=\"redactor-inline-converted\">M</strong><strong class=\"redactor-inline-converted\">atthieu Speeckaert</strong><em class=\"redactor-inline-converted\">\"I needed it. Thank you so much Jimmy for this amazing course, I like all the techniques you taught in this course. but the one that was special to me and a very powerful and helpful for me is the Phone Trick. whenever i feel that i need some push in my confident i use it and it really helps alot in many situations\". - </em><strong class=\"redactor-inline-converted\"> Mohamad</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Excellent Production Quality. </em><em class=\"redactor-inline-converted\">Jimmy and his video team have obviously made a great deal of effort in the filming and post-production. They set a standard for other Udemy instructors to follow\".</em> - <strong class=\"redactor-inline-converted\">Alicia</strong><em class=\"redactor-inline-converted\">Brilliant course! </em><em class=\"redactor-inline-converted\">Incredible course, I'm not the entire way through but I am amazed at the wealth of information in the course. Brilliant production quality and the instructor is brilliant. Would definitely recommend.\"</em> - <strong class=\"redactor-inline-converted\">Richard Batt</strong></p>", 
    "end_date": null, 
    "title": "Double Your Confidence & Self Esteem - Complete Blueprint", 
    "price": "25.00", 
    "instructors": "Jimmy Naraine", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/103738_61ad_6.jpg", 
    "course_url": "https://www.udemy.com/double-your-confidence-self-esteem/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-09T17:12:42Z"
}