{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul>  \t<li><em>Over <strong>40</strong><strong>,500 people</strong> from <strong>179 countries </strong>enrolled in my courses</em></li><li><em><strong>Winner of Udemy Innovation Award</strong> - July 2015</em></li><li><em><em><em>Overall,<strong> 1100</strong></em></em></em><em><em><em><strong>+ TOP </strong></em><em><strong>Reviews</strong> from very happy students</em></em></em></li></ul>\n\n<p><strong><em><br><br></em></strong>This course is a complete blueprint for becoming socially successful. In the next several hours you are about to learn the key concepts of social dynamics. You will discover how to:  </p>\n\n\n\n<p>  \t     - start a conversation with anyone  \t     - destroy the fear of rejection  \t    - double your confidence  \t    - engineer a winner's state  \t    - network with top businessmen  \t    - eliminate the approval seeking behavior  \t    - be a better communicator both in your social and your business life  </p>\n\n\n\n<p>  \t    and many more…Moreover, this course is constantly updated with bonus material.   \t  \t    Congratulations for your commitment to mastering social dynamics and becoming socially successful!  </p>\n\n\n\n<p>  \t  \t              <strong>What customers say about my courses: </strong></p><p><em>\"This course has changed my perspective on life. Some of the exercises made me realize that confidence is really something that can be learnt if you are willing to put some effort\" </em>- <strong>Roman Lewandowski </strong><br></p>\n\n<p><strong></strong> \t  \t<em>\"Helpful and enjoyable. </em><em>Jimmy's presentations are very professional, coming from beautiful spots all over the world. I learned a great deal of important and usable information, and am implementing it as I write this.\"</em> - <strong>Stan Prentice </strong></p>\n\n<p><strong></strong> \t  \t<em>\"</em><em>This is a great course. Very good video quality, and Jimmy is really confident when talking to camera. He knows what he is talking about, there are some very good tips and advices\" </em>- <strong>Cristian Cisa </strong></p>\n\n<p><strong></strong> \t  \t<em>\"</em><em>Best produced course I've seen on Udemy to date... </em><em>Hi Jimmy, </em><em>Excellent production quality. Great content. You are setting the bar that other course content creator's should rise up to here on Udemy. Nice work sir. Congrats to you and your movie crew on a successful partnership. I appreciate your enthusiasm and quality of work you are creating. Well done.\" </em>- <strong>Mark Priess </strong></p>\n\n<p><strong></strong> \t  \t<em>\"Thorough material, great value for money. Very detailed overview of the topic for a bargain price! The presenter explains the content in a straightforward manner, and breaks the topic up into logical sections. I believe everybody can learn something new from this course, definitely check it out!\" </em>- <strong>Tamas Tarczy</strong></p>", 
    "end_date": null, 
    "title": "Double Your Social Skills and Instantly Connect With People", 
    "price": "25.00", 
    "instructors": "Jimmy Naraine", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/423092_8d65_3.jpg", 
    "course_url": "https://www.udemy.com/double-your-social-skills-and-instantly-connect-with-people/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T08:36:30Z"
}