{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>MAJOR IMPROVEMENTS ADDED JUNE 2016</strong></p><p><strong>Read now my book 'What we can learn from the butler': 200 pages of amazing stories about butlers and how you can apply the techniques they use...</strong></p><p><br></p><p>Welcome,\n\n</p><p>Who you are is often defined by your degrees, your work or the life you lead but how you come across and how you can stand out is mainly defined by your behaviour towards other people</p>\n\n<p>Now everyone has a change to become what they want in life. In recent years values have ended up in a gray zone and social classes are mixed up</p>\n\n<p><strong class=\"redactor-inline-converted\">Etiquette can make your really stand out!!</strong></p>\n\n<p>This course covers etiquette in a fun, entertaining yet professional way<br></p>\n\n<p>It is taught in an unique way with visual supports such as photo's and videos by experts from School for Butlers and Hospitality</p>\n\n<p><strong class=\"redactor-inline-converted\">You can expect the following in this course:</strong></p>\n\n<ul><li>Everything about social etiquette</li><li>7 powerful techniques to improve your chances during a job interview</li><li>How to build self confidence</li><li>Discover why presidents are always looking sharp and are so well organized</li><li>Table manners you can apply for the rest of your life</li><li>How to eat difficult foods and not be embarrassed </li><li>Being a lady</li><li>How to always choose the right wine.</li><li>...</li></ul>\n\n<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">How long does it take?</strong></p>\n\n<p>This is a rather short course but all the more powerful. It doesn't take a lot of ideas to change your life, it only takes a good one. You can complete this course in one morning or one evening. Apply the systems explained straight away in your daily life and let us know how the changes have influenced your daily achievements!</p>\n\n<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Who should take this course?</strong></p>\n\n<p>Anyone who wants to empower themselves and get the most out of life! Learn to make an amazing first impression and reach the goals YOU have been dreaming of...</p>\n\n<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Why take this course?</strong></p>\n\n<p>It will make you stand out from the crowd. Your friends and family will see significant changes in your behavior, chivalry and self esteem<br></p>\n\n<p><br></p>\n\n<p>So, join us and seize the day...!</p>", 
    "end_date": null, 
    "title": "Etiquette in the 21st century: how to get more out of life!", 
    "price": "50.00", 
    "instructors": "Vincent Vermeulen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399040_b31f_3.jpg", 
    "course_url": "https://www.udemy.com/etiquette-in-the-21st-century/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T11:16:05Z"
}