{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>In this course titled </strong></p><p><strong>Get the Confidence of a pickup artist confidence with women</strong></p><p>You know already I hope that women are attracted to confidence and confident men and by you reading this  you want to know more about feeling confident and my  new approach to having the confidence of a pickup artist. </p><p>And just like I have said in the preview this is not about learning fancy pick up lines you can find them anywhere for free, and to be honest they can be worth just as much as you have paid for them.</p><p> because if you feel you have no confidence, nervous or anxious approaching a woman even to have a simple conversation those lines will not make any difference if you don't get to use them. </p><p>Okay enough said about that I am going to teach you techniques that will increase your confidence very quickly and these same techniques I have been using with clients for years and getting amazing results sometimes even in just one session. </p><p>You now can have your very own confidence sessions with me in this course and because you have a lifetime access and can download the whole course for having the confidence of any pickup artist.</p><p>that you can use over and over again that will blow you away with the results you will get, and how confident you will feel approaching any woman. So that when you look back at how you used to have no confidence then, thinking was that really me. </p><p>Not only that you will be learning an easy to learn and apply technique that not only will give you the confidence of a pickup artist but a technique you will be able to use in every area of your life so that you can be  living the life you really want and with the woman or women you want </p><p><strong><em>What you will learn in this course</em></strong></p><p><strong><em>Get the Confidence of a pickup artist confidence with women</em></strong></p><p><strong>1. A personal feel good Confidence trigger</strong></p><p><strong>2. What is EFT?</strong></p><p><strong>3. How to apply EFT</strong></p><p><strong>4. The power of words</strong></p><p><strong>5. How to make changes deep in your mind to improve Confidence</strong></p><p><strong>6. After 21 days using this course notice the results you are having and how much more confidence you have. </strong></p><p><strong>7. All Videos are downloadable for easier access offline</strong></p><ol></ol>", 
    "end_date": null, 
    "title": "Get the Confidence of a pickup artist confidence with women", 
    "price": "25.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396024_c4ad.jpg", 
    "course_url": "https://www.udemy.com/pickup-artist-confidence-secret/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-16T19:54:56Z"
}