{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you ever totally \"lost it\" and basically made a fool of yourself? Most people would think that this would be a conversation about how you felt afterwards. No such conversation here because we all know what it feels like to \"loose it\": if feels demeaning, humiliating and frankly, quite embarrassing. Instead I would like to ask you a different question: what was it that you lost when you say that you \"lost it\". A common answer to that question is: my temper, or my patience. if you feel that all you lost was your temper or your patience when you \"lost it\", no doubt you have also noticed that that you keep on \"loosing it\", and each time it gets a little worse. Part of the problem is that we don't know what it is that we have lost and we certainly do not know how to recover it, until now. I will explain this most common problem that afflicts all people in a way that you never heard before. You will learn what exercises to do, how to do them, and how to proceed the next time the going gets tough for you. You will feel elated to discover what few have discovered before you, and you will feel that you transcended the most visceral aspect of human nature.</p><p>The presentation and delivery of this course evolved over 20 years of therapy and teaching. Frequent repetition of key concepts and alternative explanations for the same ideas have proven to make our classes more enjoyable and productive for students. When students understand a topic and later hear an alternative explanation of the same idea they feel confident in their learning and expand their awareness of themselves. Additionally, students often comment that it is almost as if they can hear the instructor \"talking to them\", as the concepts covered seem to stay with students forever. </p><p>You will get a number of video lectures where I look directly into your eyes. I suggest you allow yourself the opportunity to watch the lectures at least once looking into the screen and focusing on the concepts. Later you can download the audio lectures and listen to them again if you wish.   </p><p>I answer all questions students ask. Not only I enjoy very much receiving and addressing your questions, but actually I thank you for them, since all courses after the first one we did evolved from questions from students.</p><p>Thank you, and welcome to the journey!</p><p>Flavio Souza-Campos</p>", 
    "end_date": null, 
    "title": "How to prevent anger from ruining your life - regain dignity", 
    "price": "30.00", 
    "instructors": "Flavio Souza-Campos, Ph.D.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833966_874d.jpg", 
    "course_url": "https://www.udemy.com/restore-your-dignity/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T23:02:35Z"
}