{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn the skills about what it takes, inside and out, to be more confident. Learn how body language affects how you feel about yourself. Also learn techniques that you can apply today to make yourself feel confident any new situation.</p><p>This course will review how body language can help you feel in control in a conversation, meeting or social gathering. How you hold yourself makes you feel stronger and more confident while also projecting that same vision to others.</p><p>In addition, you will learn about how to think in a confident way. Those who have confidence see themselves in control of the situation and know that they can handle whatever comes their way. In this sense, the negative and anxious thoughts of someone who is not confident holds them back. When you feel that you can't handle the situation in front of you, then you will guarantee failure, or at least the feeling of failure when it is over. This course will help you change the negative and anxious thoughts that pop into your head into positive action thoughts that will propel you. </p><p>Confidence is about taking action and when you push yourself to step out of your comfort zone, you will succeed. This course will talk about the issue of avoidance and trying to escape an uncomfortable situation. When you feel confidence, an original and new situation doesn't bring about the feelings of dread. Instead it turns into an opportunity to gain new skills and experiences. </p><p>This course is about seeing that confidence isn't a foreign concept. It is not something that someone is born with. It is a skill that can be learned through practice. The anxious person may feel that it is impossible to get past their fears but with this course they will see improvement in their day to day life.</p>", 
    "end_date": null, 
    "title": "How to Walk Into A Room and Be Confident", 
    "price": "25.00", 
    "instructors": "Elizabeth Cauley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/681954_8bb1_6.jpg", 
    "course_url": "https://www.udemy.com/beconfident/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-26T23:19:19Z"
}