{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Over 470 men signed up for the UberMan Challenge in the first week! Do you want to become a happier, healthier, more confident and more masculine man?  Have you ever felt at odds with your masculinity? Insecure? Unfulfilled ? Unprepared to handle yourself when sh*t hits the fan? That is all about to change...  </p>  <p>  \t                            The 30 Day UberMan challenge has been tested and proven by the men of MANSA (Man Skills Academy), to rapidly increase your confidence and competence as a man. Over the next 30 Days, you will undergo a total transformation and experience massive personal growth.  </p>  <p>  \t                        Not only will you develop new \"man skills\", but you will build life changing habits and gain virtues that will make you a new and improved version of the man that you are today.  </p>  <p>  \t                        Here are some of the AWESOME things you will know how to do by the end of this course:  </p>  <ol>  \t<li>Speak louder, clearer and with more confidence</li>  \t<li>Project strong, alpha body language that attracts woman and will command the respect of your friends, family, co-workers and peers</li>  \t<li>Defend yourself from aggressors and learn how to protect your loved ones</li>  \t<li>Safely operate and shoot a handgun. You will be zombie apocalypse ready!</li>  \t<li>Dazzle your nephews, nieces, friends, bar-babes and just about anyone with one easy but amazing magic trick</li>  \t<li>Get better at telling stories and imparting wisdom through anecdotes </li>  \t<li>Tell a funny joke that will make your friends laugh so hard that they piss their pants</li>  \t<li>Have a new appreciation for your life, gratitude and a winning attitude that will set you up for success</li>  \t<li>No longer let fear rule your life. \"Feel the fear and do it anyways\"</li>  \t<li>Live 6.5 years longer with one easy life hack</li>  \t<li>Perform CPR and know what to do when a loved one is choking</li>  \t<li>Get what you want in life by becoming a master-negotiator</li>  \t<li>Give a woman an orgasm... EVERY TIME </li>  \t<li>Unsnap a bra with one-hand</li>  \t<li>Read minds with a jaw-dropping Jedi-Mind Trick (cold-reading)</li>  \t<li>Be bold, unafraid and have more in control over your life than ever before </li>  \t<li>MAKE 2015 the best year of your life</li>  </ol>  <p>  \t                        You will learn all of the skills above and much more in JUST 30 DAYS. This course is packed with bonuses and I am going to continue to make it better based on your feedback.  </p>  <p>  \t                      Upon graduating you will get the first of the Man Skills Academy-Man Cards, your MC 1.  </p>  <p>  \t                                  Warning: This course requires you to take action. If you just want to listen to a few videos for a quick feel good session, the 30 Day UberMan Challenge is not for you.  </p>  <p>  \t                                  If you want an arsenal of proven tips, strategies and exercises that you can use to earn your manhood and immediately improve your life, than sign up now.  </p>  <p>  \t                                  Welcome to the 30 Day UberMan Challenge.  </p>  <p>  \t                            See you inside.  </p>", 
    "end_date": null, 
    "title": "Increase Your Confidence - 30 Day UberMan Challenge ", 
    "price": "30.00", 
    "instructors": "Bryce Anderson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306962_54b4_28.jpg", 
    "course_url": "https://www.udemy.com/ubermanchallenge/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T16:08:56Z"
}