{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">The Instant-Series</strong> <em style=\"\">Presents</em> &quot;Instant Confidence&quot;</p><p style=\"\"><strong style=\"\"> </strong></p><p style=\"\"><strong style=\"\">How to Be Confidence Instantly!</strong></p><p style=\"\">Are you somebody who simply lacks confidence and have no self-esteem, always worrying about what other people think of you, or how you&#039;re coming across to others?</p><p style=\"\"><strong style=\"\">Confidence</strong> is the power to getting anything and accomplishing everything you want. Without it, you will find yourself in a lonely, dark depressive place that hinders you in life and whatever you do will be much more difficult than it should.</p><p style=\"\">You&#039;ll always question and doubt yourself, feel vulnerable as a victim, be uncomfortable around other people, fail to stand up for yourself or take initialize to go after what you want, whether job opportunities or that person you want to talk to...</p><p style=\"\">Making great connections who can help you professionally, real good friends who will support you no matter what, or the love of your life who you want to spend the rest of your life with...all because you are not confident to initiate the conversation, but instead freeze or act weird, <em style=\"\">having them reject you</em>...causing you not to be outgoing.</p><p style=\"\">Yet, people always say all you have to do is stop being shy and believe yourself, but as you probably should know, it is not easy as it sounds.</p><p style=\"\">Do you want to know how you can be more confident now, and not talking about the same old <em style=\"\">&quot;fake it til you make it&quot;</em> but actual real long-lasting permanent confidence fast?</p><p style=\"\">Become much more <strong style=\"\">confident </strong>now!</p>", 
    "end_date": null, 
    "title": "Instant Confidence Course", 
    "price": "20.00", 
    "instructors": "The INSTANT-Series", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468454_9cb6.jpg", 
    "course_url": "https://www.udemy.com/instant-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-05T22:49:12Z"
}