{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Los mensajes que recibimos en nuestra infancia influyen en nuestro autoconcepto y en la forma en que nos vemos y actuamos ante otros. Se insertan en nuestro inconsciente como hábitos y automatismos que pasan a convertirse en nuestra forma \"normal\" de pensar, sin que nos planteemos siquiera que las cosas pueden ser de otra forma.</p><ul><li>¿Te exigen o autoexiges mucho?</li><li>¿No te valoran como crees que deberían?</li><li>¿No sabes si podrás realizar la próxima tarea o no ves alternativas?</li></ul><p>Lo que vemos que los demás nos dicen de adultos es un reflejo de la imagen que proyectamos inconscientemente ante ellos, y esa imagen la hemos asumido como lo que somos, en una parte importante, por los mensajes que hemos recibido en nuestra infancia y cómo los hemos procesado interiormente.</p><p>Este curso te ayuda a traer esos mensajes a la superficie para que puedas identificar cuándo te comportas o tomas decisiones basadas en ellos.</p><p>Te ayuda a tomar conciencia de tus hábitos y te da pautas nuevas para que puedas decidir cómo actuar en adelante.</p><ol><li>Identifica los 7 tipos principales de mensajes de la infancia que influyen en la Autoestima y cuáles han influido en ti.</li><li>Comienza a cambiar los hábitos y comportamientos automatizados.</li><li>Crea nuevas relaciones y situaciones.</li></ol><p>Contiene cuadernos didácticos para ayudarte con tus reflexiones y cambios de hábitos.</p>", 
    "end_date": null, 
    "title": "Los Mensajes de tu Infancia. Redefine tu valor y relaciones.", 
    "price": "20.00", 
    "instructors": "Margarita Álvarez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850810_bf76.jpg", 
    "course_url": "https://www.udemy.com/los-mensajes-de-la-infancia/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T15:50:30Z"
}