{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Low confidence has some or many of the following characteristics</strong>:</p>\n\n<ul><li>reluctance to disagree (tend to agree instead), and tend to take it personally when disagreed with</li><li>difficulty with assertiveness (passiveness is preferred, or even aggressiveness)</li><li>a lot of self-doubt, which comes across in (lack of) stating opinions, beliefs, and even likes and dislikes</li><li>caving in to pressure from others when it comes to choices about your own life</li><li>living a life below or even far below one's own potential. For example, gifted people with low confidence tend to undermine themselves and choose failure over success</li><li>a desire to be liked and accepted is stronger than the desire to be true to the self (<em>If I do this thing I want to do, people won't like me.)</em></li><li>telling or laughing at jokes that they don't think are funny or are actually mean to certain groups of people, just to try to fit in</li><li>boastful, arrogant, highly critical of others</li><li>self-uncertainty; reluctance to ask for help</li><li>amplified needs for control, inclusion, and affection (reassurance)</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Strong confidence has essentially the opposite characteristics:</strong><br></p>\n\n\n\n\n\n<ul><li>willingness to disagree (politely is a good idea), and don't take it personally when others disagree with them</li><li>ability to easily state opinions, beliefs, and preferences</li><li>easily assertive (neither passive NOR aggressive)</li><li>choosing to live one's own life one's own way rather than trying to please others with personal life choices</li><li>pushing for success and striving to fully live up to one's potential, even though this may make others uncomfortable</li><li>the desire to be true to oneself is stronger than the desire to fit in (this is why people with strong confidence will not be liked by everyone, but people with strong confidence are just fine with that)</li><li>they don't laugh at inappropriate or rude jokes just to fit in</li><li>not boastful, arrogant or highly critical of others; understanding that everyone has a right to one's own opinions and perspectives</li><li>self-assuredness; ask for help when they need it</li><li>needs to exert control over one's own life, be included in the lives of others, and receive reassurance from others are at normal levels</li></ul>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><strong><em>Everyone could use a boost to their self-confidence and self-esteem. Everyone!! </em></strong>This is something that only <em>we</em> can give to ourselves. Our confidence and self-esteem are all about our <em>relationship with ourselves. </em>If we don't improve our relationships with ourselves, no one else can or will. It is entirely up to us.<br></p>\n\n\n\n\n\n\n\n<p> With improved self-confidence and self-respect, your entire life makes a huge shift for the better. Your relationships improve, your earning potential improves, and you can enjoy greater success in literally every area of your life.</p>\n\n\n\n\n\n\n\n\n\n<p>Build self-confidence and self-respect with this easy course. Based in science, this course will give you proven techniques to boost your self-confidence and self-respect.<br></p>\n\n\n\n\n\n\n\n\n\n<p>This course isn't \"hacks\" that might make you <em>feel</em> more confident for a moment or two, but then that confident feeling fades and you're right back where you started. Instead, this course actually helps you build your self-confidence, self-respect, and self-esteem -- for a lifetime. It helps you improve your relationship with yourself. Once truly built, these characteristics don't disappear. Keep working on these areas, and you will keep improving them! Of course, when you are strong in these areas, there is nothing you can't do! The world is entirely open to you, and you are fully free to follow your heart's happiness.</p>\n\n\n\n\n\n\n\n\n\n<p>We've included lectures to help you understand the ideas and perspectives you will need to help you build your self-esteem, and exercises for your own personal growth. Both lecture material and exercises are based in proven techniques from psychology and sports coaching, areas where self-esteem and self-confidence are examined and developed.<br></p>\n\n\n\n\n\n\n\n\n\n<p>For your viewing pleasure, most videos were filmed on location on some of Central America's most beautiful and desirable beaches. Enjoy the sunshine and waves, and watch the surfers ride the waves as you learn! The atmosphere created by these videos is relaxing and very pleasant.</p>\n\n\n\n\n\n\n\n\n\n<p>Join us today on this journey to a new and improved you! And watch your life transform as you build inner strength, confidence, and self-respect. </p>\n\n\n\n\n\n\n\n\n\n<p><strong>Sign up today and start maximizing your confidence right now!</strong></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Maximum Confidence: Proven Scientific Techniques", 
    "price": "20.00", 
    "instructors": "Dr. Michele Poff, PhD, Sergey Kasimov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629778_061b_4.jpg", 
    "course_url": "https://www.udemy.com/self-confidence-and-self-respect/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T18:15:08Z"
}