{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you wish you could <strong>speak to beautiful women with total confidence?</strong></p>  <p>  \t  Then join hundreds of students who've taken this course and transformed their dating lives for the better!</p><p>This class started because I used to never know what to say in women in bars, clubs, or even parties.  Most nights I would stand and say almost nothing.  Sometimes, I'd find the \"liquid courage\" at the bottom of several rum and cokes to have a decent interaction.</p><p><strong>But with the women I was most interested, I could never reliably get them to like me.</strong></p>  <p>So I took a hard look at myself and asked:</p>  <p>  \t  \"<em>How could I improve myself and my lifestyle in a way that would make me MORE proud of who I am while getting MORE of the girls I want in my life??</em>\"  </p><p>It was a looooong journey, over the course of 8 years, hundreds of books and videos on human psychology, and thousands of hours spent out testing and refining what I'd learned.</p><p>But I figured out a reliable way for me, and any man willing to learn, to develop the charisma and confidence to date amazing women you meet in almost any social situation. No tricks, no lying, no BS.</p><p>At this point I've spent 3 years teaching what I've learned to thousands of other men.  I've seen every type from scrawny college students with no clue to established men who just need a boost after a rough breakup.  <strong>Regardless of where you are starting, if you put in the time and effort to implement what you'll learn in this course, you will find it easier to connect with and date amazing women.</strong></p>  <p>Here's what some past students have had to say:</p>  <p>  \t  \"<strong>Crucial identity level changes worth hundreds of dollars . . .\" </strong>- Kevin B.  </p>  <p>  \t  \"I cannot find words describe the respect I have for Ben and Charlie, their attitudes, values and optimistic outlook on life . . .<strong>If you are like me, the type of person who never settles, and is always striving to achieve your full potential, this is the community you want to associate yourself with</strong>.\"<strong></strong>- Ben W.  </p>  <p>  \t<strong>\"Charlie does an absolutely incredible job of showing how you can conflate morality with extroversion to truly achieve a \"kick-ass\" life</strong>.\" - Jordan T.  </p>  <p>  \t<strong>\"</strong>This class is the SHIZNET (love you snoop!). Not only is it packed with actionable, mind-blowing information, it's highly entertaining and fun. I laughed at least 46 times. <strong>Unless you're already ATTRACTING BEAUTIFUL WOMEN EVERYWHERE YOU GO while having things people pay 1000s of dollars for given to you for free, YOU NEED TO TAKE THIS CLASS. </strong><strong>\" </strong>- Scott B.  </p>  <p>  \t<strong>\"G</strong><strong>et the inspiration and permission to fully embrace the confidence, authentic man that's buried under years of bad social programming.</strong><strong>\" -</strong> Drew. L  </p>  <p>  \t  I took the BEST of the classes and personal coaching sessions and expanded upon it to deliver the ultimate premium class here....  </p>  <p>  \t  In this course you'll learn:  </p>  <ul>  \t<li>The simple (<strong>and laughable</strong>) way to get FREE bottle service at elite clubs while 90% of guys get turned away </li>  \t<li>The best way to appraoch women in blazingly loud clubs and have them be stoked to talk to you</li>  \t<li>How honesty can differentiate you from every other dude in the club and get beautiful girls chasing you</li>  \t<li>Exactly what sign to look for to know she wants to be kissed</li>  \t<li>Inner game workshops to hardwire your brain and prevent yourself from wussing out of speaking to girls (THE WORST)</li>  \t<li>A  blueprint to take action on everything I'll teach you so that you have CONCRETE STEPS to transform your dating life, get amazing girls, and life the lifestyle of your dreams!</li>  </ul>  <p>  \t  And JUST to be clear . . . this isn't one of those \"get girls to fawn over you by using one super secret technique\" scams (UGH).  </p>  <p>  \t<strong>If you want the \"make her fall in love over text\" version, this course is not for you</strong>.  This course is about changing your life.  Which means it is going to require you to put in some effort!  Nothing in the course is impossible or even all that hard, but it DOES require courage and commitment.  </p>  <p>  \t  That's the price you pay to embark life's most worthwhile journeys . . .  </p>  <p>  \t  No matter who you are, I guarantee you'll learn at least one thing from this class (see the testimonials above for proof). Note* if you've been studying social skills/improving with women for centuries, you'll probably know a lot of this - managing expectations here peeps!  </p>  <p>  \t<strong>I will personally respond to any questions you may have</strong> as you go through the material so there's no worry if you're not sure how to take all of the information and apply it to your life. So sign up now!  </p>  <p>  \t  Talk soon,  </p>  <p>  \t  Charlie Houpert  </p><p><strong>P.S. And just to put your mind at ease, this course comes with a <em>totally unconditional GUARANTEE</em>.  If you are in any way unhappy with the course, you have 30 days to get a 100%, no questions asked refund direct from Udemy</strong></p>", 
    "end_date": null, 
    "title": "Meet And Attract The Woman Of Your Dreams", 
    "price": "20.00", 
    "instructors": "Charlie Houpert", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/57710_f9b0_5.jpg", 
    "course_url": "https://www.udemy.com/nightclub-hacking/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-01T20:19:27Z"
}