{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">You Are A Man &amp; You Deserve Success, Money, and The Woman of Your Dreams... But Unfortunately You Will Never See These Gifts of Life Without  Deep Inner Confidence</strong></p><p style=\"\"><span style=\"\"></span><strong style=\"\"></strong>You know who they are...those men you see that seem to always get what they want with ease? You may wonder what their secret is...<strong style=\"\"></strong></p><p style=\"\">It&#039;s not their looks....It&#039;s not their clothes...It&#039;s not their muscles...</p><p style=\"\">It&#039;s one simple things...<strong style=\"\">CONFIDENCE</strong></p><p style=\"\">A man with a deep sense of self respect will exude confidence and be successful no matter how he looks, what he wears, or how much time he spends in the gym. </p><p style=\"\">So then, how do YOU gain this deep inner confidence? </p><p style=\"\">In this course you will learn exactly how. You will also learn why the modern American society has confused most men into being ashamed of their true masculine natures.</p><p style=\"\">I&#039;m Ray Doktor, Psy.D, and I&#039;ve been helping men find their confidence and all the success that comes along with it for the past 15 years. As a clinical psychologist with a background in eastern philosophy, I&#039;ve learned to combine the best of modern knowledge of the male brain with ancient wisdom to create a potent concoction of techniques that will help any man unlock deep confidence well beyond what he thinks he currently has.</p><p style=\"\">If you are a man who would like to gain life changing confidence, then this course will set you on the most important journey of your life!</p><p style=\"\">Do you need this course? Answer these questions...</p><p style=\"\"><strong style=\"\">5 Questions To Ask Yourself And Answer With Raw Honesty As A Man</strong> </p><ol style=\"\"><strong style=\"\"></strong><li style=\"\"><strong style=\"\">Do you effortlessly attract the most amazingly powerful and beautiful women into your life that fully trust you? \t \t</strong></li><li style=\"\"><strong style=\"\"> \t \t\t       Does your very presence command the utmost respect from other men you interact with on a daily basis? \t \t</strong></li><li style=\"\"><strong style=\"\"> \t \t\t       In social groups, are you a leader or too often just the follower? \t \t</strong></li><li style=\"\"><strong style=\"\"> \t \t\t      Do you follow through on your ideas and dreams rather than procrastinating and only talking about what you are going to do without ever taking real action? \t \t</strong></li><li style=\"\"><strong style=\"\"> \t \t\t       Do you feel you are in alignment with your purpose and have the confidence that nothing could deter you from your path \t \t</strong></li></ol><p style=\"\"> \t    If you can&#039;t honestly answer YES to each of these questions that&#039;s ok...you&#039;re not alone! All you need to ask yourself is if you want to be able to answer yes to each of these? If so, then this course has been designed for you! </p><p style=\"\"> \t    <strong style=\"\">In this recorded live event I will reveal to you how a loss in masculinity has played a major role in barricading men from attracting the love, sex, and business success they are yearning for. </strong></p><p style=\"\">You will learn powerful exercises derived both from modern psychology and eastern philosophy to help you reconnect to your genetically programmed masculine self that society has attempted to suppress. </p><p style=\"\">You will learn how success in any arena in your life can be yours with relative ease once you understand how to hack into your true potential as a man. As a new heart centered warrior, you will easily command the respect of fellow men, and women will gravitate to you in ways that will leave other men confounded. Abundance is yours if you will reach out and take it. </p><p style=\"\">Enroll in my course today and find your deep inner confidence!</p><p style=\"\">- Ray Doktor Psy.D</p>", 
    "end_date": null, 
    "title": "MEN: How to Skyrocket Your Confidence Forever in Just 4 Hrs", 
    "price": "50.00", 
    "instructors": "Ray Doktor", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/149190_58f1_4.jpg", 
    "course_url": "https://www.udemy.com/heart-centered-warrior/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-19T17:29:13Z"
}