{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is for guys who genuinely want to know what a woman wants in the bedroom.</p><p>Let&#039;s face it, it is highly unlikely your dad sat you down at age 18 to teach you the finer points of &#039;getting frisky&#039; with a lady. The reason he did not do this is because most parents don&#039;t like to talk to their kids about sexuality. Parents like to think that you will learn enough at school, and that you will work the rest out when you get married…! </p><p>Another reason dad&#039;s don&#039;t talk to their sons about this stuff is that they have never really been sure about what they are doing either. They fumbled and stumbled their way through their sexual adventures since the very first time. </p><p>Sex is just one of those taboo subjects that is avoided at school too. Not all schools, but many of them are just worried about what they should or should not say, so they say very little!</p><p>If only you could take a semester in Sex Ed that actually taught you what you wanted to know.</p><p>In my line of work I talk to many women about their sexual experiences, I also have plenty of experience of my own. What I hear is an overwhelming number of sad stories about ladies disappointed with their lovers (young and old). So many guys who just never really learned what to do in the bedroom.</p><p>That all changes with this course. Let me show you how to be a great lover. If you feel that you have been missing out on the sex you want, become better at it… be more.</p><p>No nudity, just interesting, fun info.</p>", 
    "end_date": null, 
    "title": "Men's Guide to Becoming a Legend in the Bedroom", 
    "price": "50.00", 
    "instructors": "Darleen Proud   M. HLTH SC. (Sexual Health)", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436966_8de4_2.jpg", 
    "course_url": "https://www.udemy.com/bedroom-skills-for-guys-become-a-legend-with-the-ladies/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T21:37:33Z"
}