{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><em>NEW: 1612<strong> PEOPLE ENROLLED THIS MONTH!</strong> WHY NOT YOU?</em></li><li><em><strong>New Content:</strong> Updated on the 28th january 2016</em></li><li><em>I have more than <strong>20,000 satisied students</strong> and <strong>195 TOP REVIEWS</strong></em></li></ul><p><strong>Radiate Confidence In Every Area Of Your Life &amp; Boost Your Self Esteem</strong></p><p><em>Did you know that becoming self confident would give you all these benefits (according to many studies):</em></p><p>People who are self confident tend to experience less fear &amp; social anxiety, become free of self double &amp; indeciveness, , tackle life's challenges with more certainty &amp; ease, become happier, become comfortable socially, take more care of their health, perform better at work and get better sleep.</p><p>Is that something that you would like to experience?</p><p><strong>Welcome to the only self confidence you will ever need!</strong></p><ul><li>Becoming Confident</li><li>Boost Self Worth &amp; Self Esteem</li><li>Become Unstoppable in Life</li><li>Build Social Confidence</li><li>Be Free Of Self Doubt &amp; Indecisiveness</li></ul><p><strong>Remove Self Doubt, Stop People Pleasing Behavior, Stop Indecisiveness &amp; Be Free Of Stress/Anxiety</strong></p><p>This course if for people who would like to become more confident and boost their self esteem.  It has been adapted to help people with little self confidence &amp; self esteem and  people who were already confident but needed that extra edge.</p><p>At the end of this course, you will become a new version of yourself. You will learn powerful tools &amp; techniques in this course that will transform you into the confident person that you would like to become.</p><p><strong></strong></p><p><strong>What are you waiting for? Enroll in this course right now so you can start your transofmration!</strong></p><p><em>This course has a 30 day money back guarantee. You can try this course and see how it will improve your life by unleashing your self confidence! Why not trying? You can only be more confident from this deal!</em></p>", 
    "end_date": null, 
    "title": "NEW CONFIDENCE : Boost Your Confidence & Self Esteem", 
    "price": "20.00", 
    "instructors": "Alain W.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747072_5b82_16.jpg", 
    "course_url": "https://www.udemy.com/confidence-self-esteem/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T17:44:16Z"
}