{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Understand how beliefs were created, how they affect your self esteem and how to change them to positive ones that make you evolve fast.</p><p>Learn how to spot when someone is lying to you, and how to generally read people's emotions by just analysing their bodies and voices. This alone sky rockets your self esteem because it puts in a place of power when talking to other people.</p><p>Lean how to stop conflicts at work, with friends or family and how to create an environment full of harmony and positive emotions. This method will make you stop losing energy and self esteem in family and work situations.<br></p><p>Learn how to create a deep level of connection with the people you meet with several techniques that work really well, all the time. Connection is the fastest way to relax, grow self esteem and build relationships.</p><p>Find out the right attitude to install that will make you have positive emotions with everyone you meet. The right attitude will give you the best results with self esteem and persuasion.</p><p>This course is also going to be updated with new techniques, worksheets and extra methods along the way. Please join the discussions so we can make a great conversation and community on this course, together.</p><p>Free life-time access to all of the content, free certificate upon graduation of the course, free lifetime access to my advice and feedback on the discussions section of the course.<br></p>", 
    "end_date": null, 
    "title": "NLP Self Esteem - Communicate with Confidence", 
    "price": "20.00", 
    "instructors": "Success Strategies", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707834_995d_2.jpg", 
    "course_url": "https://www.udemy.com/nlp-self-esteem-communicate-with-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-27T18:14:07Z"
}