{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        Note from instructor: Regular price of this course has been reduced for the colder months. Price was $60 and now it is just $44! This is the time of the year that depression is its highest, and Seasonal Affective Disorder (SAD) is setting in. Get the course for the best price of the year, just when you need it most!  </p>  <p style=\"\">  \t      We are going to focus on those natural human biases that plague your thinking, and that prevent you from reaching your goals. Maybe you are just tired of being stagnant, you are annoyed that when you look back on the previous year, you see yourself making the same mistakes over and over again. Maybe it makes you sad, angry, frustrated, and left thinking that nothing is going to change.  </p>  <p style=\"\">  \t                       I am going to show you why you keep making these mistakes; we are going to discuss why these natural motivational inhibitors exist, and you are going to discover strategies and plans to overcome this negative thinking.  </p>  <p style=\"\">  \t                       Essentially, this course follows the paradigm that I have created which is called, the K.A.S.S. System. I am going to give you the Knowledge, so you can take the Action, after we develop a Strategy, so you can reach Success you want in your life. KASS = Knowledge Action Strategy Success!  </p>  <p style=\"\">  \t                       The important thing to consider is that if you don&#039;t take action now, if you choose to let your negative thinking get the best of you, you are going to be sitting here a year from now, wishing you would have simply taken a course to learn more about how your brain works. My background is in cognitive neuroscience, which is the study of how the brain works at the most complex levels.I have the knowledge and experience you need to get you the strategies that are necessary to overcome the self-defeating voice in your head.  </p>  <p style=\"\">  \t                       So, what are you waiting for? Class is starting!  </p>", 
    "end_date": null, 
    "title": "Overcome Negative Thinking with The K.A.S.S. System!", 
    "price": "25.00", 
    "instructors": "David Dugger", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220256_e019_6.jpg", 
    "course_url": "https://www.udemy.com/overcome-negative-thinking-with-the-kass-system/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T04:40:07Z"
}