{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>“Guilt” and “Shame” can be powerful emotions</strong> that cause us to take action in particular ways. Learn the underlying linguistic concepts of “guilt” and “shame” so that you can intelligently work with them and move into a potential space of happiness and satisfaction. Use acupressure techniques in conjunction with working with emotions to alleviate stress and tiredness.</p><p><strong>Learn what it takes to declare satisfaction and happiness for yourself and overcome the potentially self-destructive actions caused by guilt and shame.</strong><strong></strong></p><ul><li>Strengthen your emotional foundations</li><li>Find out how “guilt” and “shame” cause you to take certain actions</li><li>Explore the use of acupressure techniques to help you observe your emotions and actions in a holistic manner</li><li>Be trained in the unique set of acupressure methods to help you reduce tiredness, improve emotional stability and sharpen your skills of observation</li></ul><p><strong>Discover a 3-Step Framework of working with the whole human being you are by exploring the connections between Body, Emotions and Language!</strong><strong></strong></p><p>I want to offer you a framework, a new perspective of the holistic and integrated human being that you are! This perspective may help to incorporate several concepts that you have come across in your quest for personal transformation and development. </p><p>The underlying concept is that of language and the resultant, subjective expression of emotions and movement; movement through actions, movement through thoughts and ideas.</p><p><strong>Course Contents And Overview</strong></p><p>This course contains over 35 lectures and 1.5 hours of content! It is designed for you if you experience “guilt” and “shame” in your life. It is designed for you if you want to move past “guilt” and “shame” and learn to be satisfied and happy. The material in this course is what I use with my coaching clients so if you are curious about learning to coach yourself from observing your thoughts, ideas and body while exploring emotions, this course is for you!</p><p>I strongly believe in 3 key ideas: <strong>#1) Education</strong> - learn about what matters to you; <strong>#2) Coaching</strong> - practice and embody that learning; and <strong>#3) Leadership</strong> - show up \"fully and in presence\" with others.</p><p>Every section in this course is connected and invites you to embody the learning. Each section has some “Action Steps” or “Activity” to help you notice what shows up for you as you experience the emotions of “guilt” and “shame”.<br></p>The more you can practice and apply what you learn in the sections determines the results you'll get.<strong></strong><p><strong>Section #1 – “Introduction To The Course”</strong> – Quickly get started in this section with this short “Self-Care” Checklist to notice what areas of your life you would like to evaluate or re-evaluate. It’s a simple 3-5 minute exercise for you to set your baseline of expectations and understanding.</p><p><strong>Section #2 – “The Linguistic Foundations Of Guilt”</strong> – Linguistically, the emotion “guilt” has two different meanings. One is the legal side of having to “pay a debt” either to society or to an individual. This is a transgression of a law. The second and probably more familiar meaning is that of a “moral sin or transgression”. This is probably the more difficult one to work with because our responses to this are entirely subjective and can be self-destructive.</p><p><strong>Section #3 – “The Linguistic Foundations Of Shame”</strong> – An exciting exploration of various linguistic roots of the emotion of “shame”. What other emotions are related to “shame”? And are there any associated bodily sensations or transformations?</p><p><strong>Section #4 – “Acupressure Techniques To Learn More Efficiently And Effectively”</strong> – Explore with Dr. Bargak in this professionally produced set of videos to help you improve your learning. When exploring emotions, especially that of guilt and shame, we want to be able to objectively notice #1) the thoughts and ideas in our head #2) other associated emotions and #3) any physical expressions that we have. Use these acupressure techniques to sharpen your observation skills and to alleviate stress and stabilize your emotions.</p><p><strong>Section #5 – \"Overcoming Guilt &amp; Shame Worksheets &amp; Exercises\"</strong> – These are worksheets that I share with my coaching clients so that we can have thought-provoking and personally transformative conversations of self-exploration. Watch these videos explaining the worksheets and follow along for a rich, introspective journey to personal transformation.</p><p><strong>Section #6 – \"Conclusion &amp; Next Steps\"</strong> – We wrap up this course with a few pointers on how to deepen your practice of working with the emotions of “guilt” and “shame” and also a few special offers to deepen your continued learning.</p><p><strong>Course Bonuses!</strong></p><p><strong>Bonus #1</strong> – PDF Worksheet \"Energy Zappers\" – A 2-page worksheet to help you identify the people, ideas, situations and events that cause you to be drained of your energy. What do you notice as you do this exercise?</p><p><strong>Bonus #2</strong> – PDF Worksheet \"Self-Care Check-In\" – A comprehensive 4-page worksheet that will allow you to explore the various areas in your life that you would like to see improvement in. The self-reflection questions and actions invite you to objectively look at life situations and notice what showed up for you. Other questions invite you to commit to actions to declare satisfaction and happiness in your life.</p><p><strong>Take Action &amp; Enroll</strong></p><p><strong>Click \"Take This Course\" now</strong> and make the commitment to jump straight into “Overcome Guilt And Shame” for yourself. I know that working with emotions created shifts within me and resulted in a rewarding personal and professional life.</p><p>See you on the inside!</p><p>Wishing you much success in your journeys,</p>Thushyanthan &amp; Dr. Bargak", 
    "end_date": null, 
    "title": "Overcome Guilt & Shame With A Simple 3-Step Model!", 
    "price": "30.00", 
    "instructors": "Thushyanthan A, Dr. Jakob Bargak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625448_0715_3.jpg", 
    "course_url": "https://www.udemy.com/guilt-shame/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T03:10:56Z"
}