{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>UPDATED FOR MARCH 2016. JOIN OVER 800 STUDENTS! FIVE 5-STAR REVIEWS!</strong></p>  <p>  \t<strong>  FREE BONUS</strong> ($40 Value): With this course you get full lifetime access to 2 online tools that help you overcome the pain of rejection faster &amp; easier.  </p>    <p>  \t               Does it hurt you when you think about times you've been rejected in the past? Or make you feel angry with yourself or others?  </p>  <p>  \t                               Does just the thought of being rejected make you feel afraid and anxious, and make it harder for you to achieve things, due to fear of being rejected?  </p>  <p>  \t                               If so, you're not alone. <strong>Almost everyone experiences this type of pain, anger, and fear about rejection.  </strong>  </p>  <p>  \t<strong>    But you don't have to feel this way anymore. This course can help you.  </strong>  </p>  <p>  \t                             Just imagine how much happier and better your life would be in every single way if rejection was never an issue for you anymore.  </p>  <p>  \t                             Imagine being able to think about times you've been rejected in the past, and feel completely at peace, without anger or resentment, and without any feelings of hurt and suffering. Just imagine how much richer and more rewarding your life would be!  </p>  <p>  \t                             And just imagine how much more confident and successful you would be if you never had to deal with the fear of rejection again. After all, it would make it so much easier for you to achieve things you want to achieve, without that crippling, paralyzing fear holding you back.  </p>  <p>  \t                             In this course, you'll learn step by step how to handle rejection easily, so that it's never an issue or a problem for you again in anyway.  </p>  <p>  \t<strong>    And you're going to achieve this powerful life-changing experience in less than 2 hours.  </strong>  </p>  <p>  \t                         To appreciate how powerful this change will be...  </p>  <p>  \t                         Consider how people often talk about \"risking\" rejection, as if rejection has to be some sort of a hard, dangerous risk you have to take sometimes.  </p>  <p>  \t<strong>But what if rejection was never a risk for you, simply because dealing with rejection was no big deal to you?</strong>  </p>  <p>  \t<strong>This is the exact kind of change this course will help you achieve -- in just 2 hours.</strong>  </p>  <p>  \t                         As a result of this change, you'll immediately:  </p>  <ul>  \t<li>Be free of rejection having a negative effect on your life, since you'll know how to handle rejection constructively</li>  \t<li>Find it easier to socialize with other people, without any fear or anxiety about being rejected</li>  \t<li>If you're ever rejected, you'll find it easy to move on from the rejection -- and even grow stronger and more confident from it!</li>  \t<li>Pursue romantic relationships more easily and feel more comfortable putting yourself out there, without the fear of rejection holding you back</li>  \t<li>Know how to deal with rejection from a guy or a girl easily (or your husband or wife) so that you don't ever feel sad, bad, and angry about being rejected</li>  \t<li>Apply or audition for anything more easily without thoughts of possibly being rejected preventing you from doing your best</li>  \t<li>Be more calm, relaxed, and at peace about times you've been rejected in the past, and be free of any stressful pain or anger associated with the rejection</li>  \t<li>Share personal things more easily (like something you've written or created, or your personal thoughts) without being terrified of possibly being rejected</li>  \t<li>Reduce and eliminate social anxiety that is tied to a fear of being rejected</li>  \t<li>Be more successful in business, sales, or as an entrepreneur, without the fear of rejection ever holding you back</li>  \t<li>Stop being scared of rejection and start appreciating how it's not big deal to you anymore, even if it's something that used to scare you a lot</li>  \t<li>Be a happier, more confident, more successful person in life in each and every single way</li>  </ul>  <p>  \t                         In just 2 hours, you can dramatically change your life for the better, by learning how to deal with rejection easily... And experience the immediate, wonderful difference this makes in your life.  </p>  <p>  \t                         In fact, <strong>you'll have dramatic proof</strong> that you've achieved an amazing change in just 2 hours, because:  </p>  <ul>  \t<li>At the beginning of this course, you'll think of an experience with rejection that has caused you to feel a lot of pain in the past</li>  \t<li>At the end of this course, <strong>you'll be able to think about this same experience, without feeling that kind of pain</strong> (either no pain at all, or dramatically less pain)</li>  \t<li>So the proof will be swift and obvious: you'll know without a doubt that you've achieved something amazing in the span of just 2 hours... </li>  \t<li>And you'll feel happier, stronger, and more confident than ever, as you appreciate what amazing things you're capable of achieving</li>  </ul>  <p>  \t           So what are you waiting for?  </p>  <p>  \t           You have every reason in the world to start this course right now, especially since:  </p>  <ul>  \t<li><strong>The initial low price will increase shortly</strong> - the course is currently only $49, but will next increase to $99</li>  \t<li>You have <strong>unlimited lifetime access</strong> at no extra costs, ever</li>  \t<li>All future additional lectures, bonuses, etc. in this course are always free</li>  \t<li>There's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li>  \t<li>My help is always available to you if you have a question</li>  </ul>  <p>  \t               With this course and the 2 online tools you get for free, you can learn how to overcome rejection and not be negatively affected by it anymore in just 2 hours.  </p>  <p>  \t                         So don't waste another second.  </p>  <p>  \t<strong>Enrol in this course right now, and immediately change your life for the better in every way, as you begin living a life that's completely free of the pain, anger, and fear of rejection.</strong>  </p>  <p>  \t<strong>Enrol now!</strong>  </p>", 
    "end_date": null, 
    "title": "Overcome Rejection in 2 Hours: Stop the Pain, Anger & Fear", 
    "price": "20.00", 
    "instructors": "David Fonvielle", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370762_10dd_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-deal-with-rejection/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T15:06:45Z"
}