{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tDo you feel as if your life is a maze of confusion and chaos? Are the challenges you&#039;re facing causing you to live a &quot;frustrated&quot; life...always feeling discouraged, dissatisfied and disappointed? Perhaps you&#039;re frustrated because you see yourself as an underachiever. Has almost everything you&#039;d planned for a successful career has failed? Maybe you&#039;re experiencing the negative effects of the economic dilemma. Would you like to experience inner peace even in the midst of chaotic surroundings?  </p>  <p style=\"\">  \tLearn how to build your knowledge base and access your inner strength to master your emotional stress due to difficulties and circumstantial frustration that can drive you to behave in a regretful manner.  </p>  <p style=\"\">  \tThis course is created to empower and encourage those who desire to master their emotions by tapping into the power of positive thinking and apply the knowledge they have, which may be suppressed because they can only see the unpleasantness of present circumstances and situations.  </p>  <p style=\"\">  \tThis course teaches you how to:  </p>  <ul style=\"\">  \t<li style=\"\">Recognize the most common types of frustrations</li>  \t<li style=\"\">Identify the triggers that causes frustration. </li>  \t<li style=\"\">Tap into your innate gift (power, strength, ability) to overcome life challenges. </li>  \t<li style=\"\">Use your &quot;knowledge base&quot; as your power rather than your emotions. <br style=\"\">  \tBy the end of this course, you will be able to redirect your thoughts and tap into the power available to you, and use it to overcome the detrimental power of frustration.</li>  </ul>  <p style=\"\">  \tIncluded in the course are PowerPoint videos, audio and downloadable materials.  </p>  <p style=\"\">  \tThere are eight (8) sections and fifteen (15) lectures.  </p>  <p style=\"\">  \t<strong style=\"\">Disclaimer</strong>:  </p>  <p style=\"\">  \t<strong style=\"\">This course is intended for biblical teaching and educational purposes and should not be construed as medical advice or instruction.  In no way are any of these teachings meant to be a substitute for professional medical care or counseling by a licensed professional counselor. </strong>  </p>", 
    "end_date": null, 
    "title": "Overcome the Power of Frustration", 
    "price": "20.00", 
    "instructors": "Queen E. F. Phillips", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49284_3102_8.jpg", 
    "course_url": "https://www.udemy.com/overcome-the-power-of-frustration/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-10T21:06:17Z"
}