{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Imagine seeing a half glass of water in front of you.  </p>  <p style=\"\">  \t  Would you consider it to be half empty, or half full?  </p>  <p style=\"\">  \t  It&#039;s the age old question that has been asked when determining one&#039;s perception of the world.  </p>  <p style=\"\">  \t  You&#039;d be surprised to know that it is this perception, your outlook on life, that determines the degree of success you will achieve in everything you set out to do.  </p>  <p style=\"\">  \t  Over the next 12 &quot;Positivity Camp&quot; lectures, we will explore the fascinating phenomenon of Optimism, and how it is absolutely vital to achieving success in everything you do in life.  </p>  <p style=\"\">  \t  We begin with a brief history lesson on Optimism, its scientific aspects, and its significance. There&#039;s also a short quiz that will help you determine whether you&#039;re a &quot;half full&quot; or &quot;half empty&quot; kind of person, so you know where you stand.  </p>  <p style=\"\">  \t  Next we dive into the very real benefits of positive thinking, and you&#039;ll learn how to create a mindset that is both affirmative and encouraging, and also the significance of motivation in cultivating optimistic belief and attitude.  </p>  <p style=\"\">  \t  We also tread into the realm of negativity, the opposite of optimism. This is crucial as pessimism is rooted in the human mind, and therefore we need to be familiar with the destructive aspects of it, and the various ways we can overcome it.  </p>  <p style=\"\">  \t  Once we&#039;ve explored the &quot;dark side&quot;, we return to the more practical applications of optimism.  </p>  <p style=\"\">  \t  The ability to think positively can make or break your career in the corporate world, so we&#039;ll look into strategies that help manifest optimism in the workplace so you can overcome the different kinds of challenges that come your way.  </p>  <p style=\"\">  \t  And it doesn&#039;t matter where you stand in your company&#039;s hierarchy. If you&#039;re a leadership position, optimism is just as important as if you were a low to mid level member of your organization.  </p>  <p style=\"\">  \t  Leaders need to make an effort to further promote optimism in the organization, as it is with optimism that everyone within the organization can go above and beyond their potential and see to the organization&#039;s success.  </p>  <p style=\"\">  \t  Finally, we look at the optimistic aspects of the self and the relationship, and how positive thinking can enhance relationships, be it with friends, loved one or the family.  </p>  <p style=\"\">  \t  Now you are ready to manifest optimism and positive thinking to your advantage and success in life!  </p>", 
    "end_date": null, 
    "title": "Positivity Camp : Optimistic Approach To Empower Your Life", 
    "price": 0, 
    "instructors": "Edu Life Vantage", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302626_9567_10.jpg", 
    "course_url": "https://www.udemy.com/positivity-camp-optimistic-approach-to-empower-your-life/", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T03:13:26Z"
}