{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tImagine giving your retirement speech and every one of your colleagues feels as though you are personally speaking to them and thanking them in a meaningful way. Wouldn&#039;t it be nice to end your career on a high note by giving a retirement speech where you hit all the right notes?  </p>  <p style=\"\">  \tIn this How to Give a Retirement Speech you will learn the following:  </p>  <p style=\"\">  \t*How to give a great retirement speech  </p>  <p style=\"\">  \t*How to plan stories for your speech  </p>  <p style=\"\">  \t*How to practice your speech on video  </p>  <p style=\"\">  \t*How to use the right amount of emotion and retain composure  </p>  <p style=\"\">  \tThis course is delivered primarily through spoken lecture. Because the skill you are learning is speaking related, it only makes sense that you learn through speaking.  </p>  <p style=\"\">  \tThe skill you will learn in this class is not primarily theoretical or academic. It is a skill that requires physical habits. That is why you will be asked to take part in numerous exercises where you record yourself speaking on video, and then watching yourself. Learning presentation skills is like learning how to ride a bicycle. You simply have to do it numerous times and work past the wobbling and falling off parts until you get it right.  </p>  <p style=\"\">  \tThis course contain numerous video lectures plus several bonus books for your training library.  </p>  <p style=\"\">  \tTJ Walker has been coaching and training people on their presentation skills for 30 years. Now, through the power of Udemy&#039;s online platform, he is able to give you the same high quality training that he gives in person to CEOs, Fortune 500 executives, and Presidents of countries. Only you can now receive the training at a tiny fraction of the normal fee for in-person training.  </p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on July 30, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Public Speaking: How to Give a Great Retirement Speech", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363396_087a_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-give-a-retirement-speech/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T21:34:42Z"
}