{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\"><strong style=\"\">&#039;The content of this course is extraordinary: practical, focused, most of it quite straightforward, but based on solid research, science and psychology. The section on the confident smile is incredible and worth the price of admission alone, especially if you ever have to get your photograph taken.... I like the delivery too - because it doesn&#039;t charge through things but each weeks focuses on one particular aspect you can work on or change. It&#039;s clear, sensible, and easy to follow. Effective too.&#039;</strong> - Simon Townley</em>  </p>  <p style=\"\">  \t                Reasonable Confidence is basically the Reason-Ability system applied to confidence, to help you become more confident in a reasonable way, using what we know from neuroscience as the course backdrop.  </p>  <p style=\"\">  \t                It&#039;s Reason x Reasonable.  </p>  <p style=\"\">  \t            1. Here&#039;s the REASON why you should do this. It&#039;s based on neuroscience.  </p>  <p style=\"\">  \t            2. And here&#039;s a REASONABLE way to do it; marginally, one thing at a time, using the 13x4.  </p>  <p style=\"\">  \t                After many decades of dry and obscure laboratory research, the neurosciences are now beginning to bring us real and practical information that we can apply in our everyday lives to increase our levels of happiness, love, productivity and harmony.  </p>  <p style=\"\">  \t                That&#039;s what this course is all about.  </p>  <p style=\"\">  \t                Practical, easy, reasonable things to do, that make it about as simple as possible to become more confident in everyday life.  </p>  <p style=\"\">  \t  We hope you enjoy it!  </p>  <p style=\"\">  \t                Dr Mark Rogers &amp; Tom Cassidy  </p>", 
    "end_date": null, 
    "title": "Reasonable Confidence: How To Be Confident, True To Yourself", 
    "price": "20.00", 
    "instructors": "Tom Cassidy, Mark Rogers", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288634_6d16_4.jpg", 
    "course_url": "https://www.udemy.com/reasonable-confidence-how-to-be-confident-true-to-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-27T02:12:16Z"
}