{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What is the course about?</strong></p><p>This online course will introduce you to how the brain works and why you feel the way you do as well as introducing you to where fear comes from and how to overcome it.</p><p>This will make you feel more confident and enable you to move forwards with greater belief and free from fear.<br></p><p><strong>Course Materials</strong></p><p>A number of exercise worksheets are included with the course which will allow you to practice what you learn.</p><p>A number of video and audio resources are available for you to download and use.</p><p><strong>Course Length</strong></p><p>This course can be completed in about four hours. Ideally, for maximum benefit, you should spread this course over a few weeks. </p><p><strong>Course Structure</strong></p><p>The course is split into eight sections. An introduction, followed by the main sections that take you through the steps to improve your confidence and overcome your fear.  Section 6 is packed with activities for you to try and use to help you overcome fear.  There are a number of techniques based on your learning style.  Finally a summary section is used to recap learnings and prompts you to make a 'I commit to...' promise.</p><p><strong>Why take this course?</strong></p><p>If you're serious about wanting to overcome your fear and increase your confidence, this course will help you explore and challenge your current approach to situations and the confidence levels you have, and inspire you to improve.</p>", 
    "end_date": null, 
    "title": "Recognising and Overcoming Fear - The F Word", 
    "price": "50.00", 
    "instructors": "Kelly Fryer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699790_ca72_6.jpg", 
    "course_url": "https://www.udemy.com/the-f-word-recognising-and-overcoming-fear/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T07:38:00Z"
}