{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Win With Confidence is the Premiere Ultimate confidence booster course and program.  </p>  <p style=\"\">  \t  Power packed with over 2 hours of life changing, content, videos and lectures this course will cause you to tap back into, awaken  and rediscover that inner self that&#039;s been lost or dormant, but is needed to win and win big in today&#039;s society no matter what genre, gender, race, industry or demographic you reside this course will reignite the fire within .  </p>  <p style=\"\">  \t  Within minutes you can expect to feel a shift and lift in your confidence as we explore the hidden gems that reside within you and tap into everything great and natural that came with the package called you.  </p>  <p style=\"\">  \t  As you rediscover that forgotten you of old and merge with the new you, a whole new world will illuminate as your beliefs begin to affect your perceptions, which will affect your internal behaviors, which will impact your external boldness, gaining the true authenticity of your confidence and power, making you a mighty  force to be reckoned with, taking the winning attitude into any scenario and over coming any and all fears.  </p>  <p style=\"\">  \t  This course will leave you empowered, inspired, and motivated to share with the world the new and the real you.  </p>", 
    "end_date": null, 
    "title": "Restore Your Confidence Using The SWOT method", 
    "price": "30.00", 
    "instructors": "Dwayne Maurice Golden", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327094_2687_3.jpg", 
    "course_url": "https://www.udemy.com/restore-your-confidence-using-the-swot-method/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-25T17:39:26Z"
}