{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course is a set of simple and yet very powerful strategies or exercises designed to build your Primary Self Esteem. Primary Self Esteem is the Self Esteem you had as a child, before you were praised or achieved success. This is your true power, your true magnificence, independent of what the world thinks of you or whether you achieve success or failure. Secondary Self-Esteem is feeling good when you are praised and successful. Nothing wrong with this, but there is more to life! You will learn how to experience self-worth <em style=\"\">real authentic power</em> while simply doing all of the things that living involves, as well as being able to significantly reduce your stress and anxiety in pressured and stressful situations. Because this work grows your power, you will experience a gradual sense of being more ok with all of the ups and downs of life, <em style=\"\">because power enables you to manage them so much better! </em>The course consists of specific strategies and a meditation exercises, designed to build your power, love and joy. If you practice and use the techniques regularly you will enhance your sense of value in the most extraordinary way. These techniques will also enable you to recover much faster from pressure, conflict and stress, returning you to equanimity and peace without having to be approved of and supported. In essence, this course will give you the capacity to generate the ultimate support - internally.</p>", 
    "end_date": null, 
    "title": "Revitalizing your Self-Esteem.", 
    "price": "20.00", 
    "instructors": "Mark Peter Kahn", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421704_35c9_4.jpg", 
    "course_url": "https://www.udemy.com/primary-self-esteem/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T10:15:57Z"
}