{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Have you been mentally and emotionally abused and manipulated by a toxic narcissist? Have you had enough of the gaslighting, the flying monkeys, the love-bombing and the hoovering? </strong></p><p>Are you tired of accepting the \"you\" that the narcissist has defined? Are you ready to finally DEFINE YOURSELF? Want to make your own choices about who you are and what your life looks like? </p>\n\n<p><strong class=\"redactor-inline-converted\">If you're ready to rediscover yourself again after narcissistic abuse, this course presents and easy and simple way to do just that. </strong></p>\n\n<p>You'll learn to identify your abuse story, write it out and then release it. Plus, you'll get a step-by-step plan to write your new future story - one that you can use to create the life you truly desire, and to become the person you've always wanted to be. </p>\n\n<p>You don't havve to accept the story your narcissist put in place - you get to write your OWN story. </p>\n\n<p><strong>This course offers you the solution you need, and it's been created specifically for you by a certified life coach, author and survivor of narcissistic abuse. </strong></p>\n\n<p>Inside, you'll find several reports, worksheets and downloadable tools that will help you to take the steps necessary to get your story down, release it and write your new story. </p>\n\n<p>Take the time to study the material, do the meditation and the writing exercises, and you'll be on your way to making things go your way - and to creating the self and the life that you truly want. </p>", 
    "end_date": null, 
    "title": "Rewrite Your Story After Narcissistic Abuse in Relationships", 
    "price": "50.00", 
    "instructors": "Angela Atkinson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815902_d2bd.jpg", 
    "course_url": "https://www.udemy.com/rewrite-your-story-after-narcissistic-abuse-in-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T22:21:30Z"
}