{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>+++++++++++</em><br></strong></p>\n\n<p><strong><em>Note: This course was just recently launched and already has over 180 students. </em><br></strong></p>\n\n\n\n\n\n\n\n<p><strong><em>We are one of the top Udemy Instructors in the Personal Development Field. our courses have been taken by over 21,000 happy students from 159 Countries.</em></strong><br></p>\n\n\n\n\n\n\n\n<p><strong><em>We have a thriving community in the course and we are actively involved and answer questions within 24h.</em></strong></p>\n\n\n\n\n\n\n\n<p><em><strong>+++++++++++</strong></em><br></p>\n\n\n\n\n\n\n\n<p><strong><em></em></strong></p>\n\n\n\n\n\n\n\n<p>Are you a helper, a giver, or someone who works in a helping field?<br></p>\n\n\n\n\n\n\n\n<p> Do you find yourself saying \"yes\" when you really mean \"no\"?<br> Do you tend to over commit and have no time left over to take care of yourself and do the things you love?<br> People like us have big hearts. We care, and sometimes this leads us to sacrifice for others, allow them to depend on us and forget that we matter, too. </p>\n\n\n\n\n\n\n\n<p><strong>IT's TIME TO TAKE YOUR POWER BACK!</strong><br> <br> <strong>This course is for the helpers and givers who want to develop the confidence say \"NO\" when it's time to honor themselves.</strong> Who want to help uplift others in a way that is supportive, not rescuing or creating dependency. To give from a healthy place of confidence and empowerment, rather than out of obligation or guilt.<br> <br> <strong>We're going to teach you the tools and the mindset to empower yourself AND others. </strong>We know how hard it can be to put yourself first. We're both the classic \"helper\" type--we just want so badly to make other people's lives better! But, we've also learned that when we are not taking care of ourselves, things get out of balance, leading us to become burnt out, unwell, and unable to contribute to those we love. </p>\n\n\n\n\n\n\n\n<p>We're going to teach you everything we've learned in our own journeys, our decade of experience  in psychology, as well as what we've learned through working with thousands of other \"helpers\"--whether life coaches we've trained or individuals we've coached and met through our workshops.<br> <br> <strong>This course will leave you feeling confident and empowered, with an inspiring vision of your new empowered life and concrete goals to get you there.</strong> Plus we know you'll enjoy the course! Join our nearly 21,000 happy students in 159 countries.</p>\n\n\n\n\n\n\n\n<p>By learning to say \"NO\" you will be honoring yourself--you'll be healthier and happier and therefore have more to give.</p>", 
    "end_date": null, 
    "title": "Set Boundaries and Take Your Power Back!", 
    "price": "20.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741488_1e6e.jpg", 
    "course_url": "https://www.udemy.com/the-helpers-guide-to-saying-no/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T21:19:45Z"
}