{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>⇉ Watch the promo video</strong> to see How You Can Start To Become More Confident and Shifting Your Self-Esteem Today! </p>\n\n<p><strong>⇉ Join Over 100,000+ Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n<p><strong>⇉ 250<strong>0</strong>+ Five Star Reviews</strong> Shows Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n<p><strong>⇉ You receive 25+</strong> streamlined lectures and <strong>2+ hours of HD video content!</strong></p>\n\n\n\n<p><strong>⇉ This Course is Designed For Speed! Shift Your Confidence In Just About 2 Hours!</strong></p>\n\n\n\n<p><strong>__________________________________________________________________________</strong></p>\n\n\n\n<p><strong>Student Success Testimonials: </strong></p>\n\n\n\n<ul><li>Naomi Wycherley</li><li>10 days ago·<strong>Great course, easy to follow.</strong><strong></strong>Great course, easy to follow.I enjoyed the lectures. They were easy to follow and I liked how they were broken down into easy to follow explanations and analogies. I liked the length of the lectures as well as the environments they were filmed in. Great tips and strategies</li></ul>\n\n\n\n<ul><li>Scott Paton</li><li>5 days ago·Get more confidence and keep it. Joe has put together a great course to help any one raise their confidence level and increase your self esteem. He shares practical exercises and information that works. I particularly like that he lives it in the course. Besides sharing from the heart he also films the course outside on a beach (Well, a lot of it) and that takes a ton of confidence :) Highly recommended.</li></ul>\n\n\n\n<p>_______________</p>\n\n\n\n<p>In this course I am going to teach you how to develop more confidence and self-esteem in your life! <br></p>\n\n\n\n<p><strong>What is self-confidence?</strong> </p>\n\n\n\n<p><strong>Self-Confidence </strong>is The ability to believe in yourself and you ability to accomplish any task no matter the circumstances! </p>\n\n\n\n<p>I believe self confidence is a <strong>SKILL</strong> that can be learned by anyone who is willing to out in the effort. In this course I am going to teach you exactly how to learn this skill through a series of video tutorial lecture. </p>\n\n\n\n<p>You will learn how to develop your own self-confidence and self-efficacy. You will learn how to start believing in yourself and not letting others push you around. You will learn How To Control and Use Your Emotions to Build Your Self-Esteem. But most importantly You will learn how to begin taking action, being relentlessly persistent and seeing real results! </p>\n\n\n\n<p>__________________________________________________________________________When I was younger I struggle with my confidence and self-esteem. All through high school I was not very popular, shy, never had a girlfriend, and seemed to be disconnected with the outside world.<br></p>\n\n\n\n<p>That is when I started to research and study from some of the best self-help gurus in the world. </p>\n\n\n\n<p><strong>Since then Everything in my life began To Shift… </strong></p>\n\n\n\n<p>I began to earn more money, I became the captain of my College basketball team, and I have now been dating a very beautiful girl for the past two years! </p>\n\n\n\n<p>In this course I am going to share with you the exact same strategies that helped me go from a zero to a hero and start shifting your confidence and self-esteem today! </p>\n\n\n\n<p>If I can learn how to Shift my confidence and self-esteem so can you! The only difference between you and I is that I have the experience working with these confidence and self-esteem strategies. I hold nothing back! I am going to teach you everything you will need to know and more about Shifting your confidence and self-esteem in this course! </p>\n\n\n\n<p><strong>__________________________________________________________________________The Benefits You Will Gain From This Course Are Endless!</strong><br></p>\n\n\n\n<p><strong>I have created this course</strong> to help as many students develop a higher self-esteem and the ability to start believing in themselves! My goal for my students is to learn how to begin taking action, building meaningful relationships, and feeling amazing about who they really are! <br></p>\n\n\n\n<p>I show you throughout this course how we use both our mind and body through a series of strategies and techniques to achieve these amazing results.</p>\n\n\n\n<p><strong>You Will Learn:</strong></p>\n\n\n\n<ul><li>Multiple Strategies to Shift your Confidence and Self-Esteem</li><li>Self-Image strategies to boost your Confidence and Self-Esteem</li><li>Understand the psychology of who you are and how to Transform Your Life!</li><li>Both Inner and Outer Confidence for a life changing Transformation and Shift!</li><li>Engaging Lectures shot from all around the world using high teach cameras!</li><li>Understand Who you are and how to manifest amazing results</li><li>And so much more!!</li></ul>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards transforming your life and becoming more confident!</p>\n\n\n\n<p>When I learn something new about confidence and self-esteem, I add it to the course -at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But it can be done!</em> </p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p><strong>This course will not remain this price forever! It's time to take action!</strong></p>\n\n\n\n<p>Click the <strong>\"take this course\" </strong>button, top right, now...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p><strong>See you in the course!</strong></p>\n\n\n\n<p><strong>Sincerely,</strong></p>\n\n\n\n<p><strong>Joe Parys</strong></p>", 
    "end_date": null, 
    "title": "Shift Your Confidence & Self-Esteem - Complete Udemy Course - Unofficial", 
    "price": "20.00", 
    "instructors": "Joe Parys", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623830_4638_2.jpg", 
    "course_url": "https://www.udemy.com/unofficial-shift-your-confidence-and-self-esteem-complete-udemy-course/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-27T16:47:49Z"
}