{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span>Do you ever wish you had the confidence to talk to anyone and be completely comfortable in any social or networking setting?  Wouldn&#039;t it be awesome to easily meet new friends, approach strangers on the street with ease?</span>  </p>  <p>  \t                                In this course you will learn how to be comfortable in any social setting and gain the confidence to meet new people for business, networking, dating and expanding your circle of friends. In less than 3 months 1870 people enrolled to become more socially confident!  </p>  <p>  \t<strong style=\"\">What others are saying about the course: </strong>  </p>  <p>  \t<em style=\"\">&quot;Small Talk is direct with full of actionable tips. If you would like to up your small talk game or grow your networking skills, check out this course.&quot; -</em>Alex Sartore  </p>  <p>  \t<em style=\"\">&quot;You guys have taken something that i feared so much and turned it into something so easy to do. I am much more comfortable with talking to people I know and even more comfortable with making small talk with people I don&#039;t know. I highly recommend this course to anyone and everyone!!!&quot; -</em>Tasmin De Villiers  </p>  <p>  \t<em style=\"\">&quot;This course has helped me &#039;&#039;remember&#039;&#039; how it is to meet new people, how to approach them, giving practical examples in case I&#039;m out of imagination, keep the conversation going and keep contact with them so I can call them friends one day :)&quot; -</em>Delphine De Sanglier  </p>  <p>  \t<strong style=\"\">You will learn:</strong>  </p>  <ul style=\"\">  \t<li>How small talk has changed in the digital age.</li>  \t<li>One simple way to jumpstart your social success.</li>  \t<li>How to take charge of your social life with networking.</li>  \t<li>How to use simple daily observations to start conversions.</li>  \t<li>How to master first impressions.</li>  \t<li>The core basics of any good conversation.</li>  \t<li>How to exit a conversation gracefully.</li>  \t<li>How to get someone&#039;s contact details to keep in touch.</li>  \t<li>When and how to correctly follow up.</li>  \t<li>What some of the best openers and ice breakers are.</li>  \t<li>What conversations are safe and what to stay away from.</li>  \t<li>How to use your body language in a positve way.</li>  \t<li>What body language to avoid at all costs.</li>  \t<li>How to use small talk to become successful in both business and relationships.</li>  </ul>  <p>  \t<strong style=\"\">What&#039;s in the course:</strong>  </p>  <p>  \t                                        Through the use of video tutorials, Powerpoint presentations and real-world examples you will gain the tools needed to approach anyone.  </p>  <p>  \t                                        After the first 20 minutes of the course you will already have acquired the basic skills needed to make your first approach and by the end of the course you will have mastered the art of small talk.  </p>  <p>  \t                                        In a series of quick 5 minute videos with one easy exercise at the end of each section you will breeze through this course and take with you the art of small talk.  </p>  <p>  \t<strong style=\"\">You should take this course if:</strong>  </p>  <ul style=\"\">  \t<li>You want to be socially confident.</li>  \t<li>You want the skill set to successfully talk to anyone.</li>  \t<li>You want to know what to say when starting conversations.</li>  \t<li>You want to be comfortable in different social situations.</li>  \t<li>You want to master small talk and networking.</li>  \t<li>You want to take control of your social destiny.</li>  </ul>  <p>  \t<strong style=\"\">        Scroll back up and join the course today. </strong>  </p>  <p>  \t                         We look forward to seeing you in the course.  </p>  <p>  \t                        -Larissa and Johnny  </p>", 
    "end_date": null, 
    "title": "Small Talk Networking: How to Talk To Anyone", 
    "price": "20.00", 
    "instructors": "Johnny FD Jen, Larissa Swart", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/229512_d901_10.jpg", 
    "course_url": "https://www.udemy.com/smalltalk/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-26T09:11:56Z"
}