{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>***Updated For June 2016***</em></strong><br><strong></strong></p>\n\n<p><strong>You will become a constant generator of “social questions”\nno matter which format a social situation takes, or who you are talking to. You\nwill never ponder at what to say to fill that seemingly inevitable empty space!</strong><strong></strong></p>\n\n\n\n\n\n\n\n<p>Have you ever considered that finding a true friend often presents a great challenge? Having a true friend is always something that is underestimated in our current society. Friendship provide us with the much needed solace when we experience an emotional turmoil of a breakup, or any other misfortune. The value of <em>true </em>friendship also erodes with age. It is no secret that adults forge friendships that are far less frequent and less meaningful than children. The reason mainly comes down to differences in temperament, personality and communication styles. In this course, I will teach you how to overcome those barriers of individual differences! I will teach you not only the “what to do”, but also (and more importantly!) the mindset of a true friend. To find a true friend, you must become one first.</p>\n\n\n\n\n\n\n\n<p><strong>Guarantee: You will become a \nconstant generator of “social questions” no matter which format a social\n situation takes, or who you are talking to. You will never ponder at \nwhat to say to fill that seemingly inevitable empty space!</strong><br><strong></strong></p>\n\n\n\n\n\n\n\n<p><strong>Zero Risk</strong><br>There is a 30 day money back guarantee so you literally have no risk in taking this course. Seriously, the 30 refund is even done automatically so there is no hassle on your end. If this course sounds like it is for you then give it a go! </p>\n\n\n\n\n\n\n\n<p><em>\"One of the most beautiful qualities of true friendship is to understand and to be understood.\"</em> - Lucius Annaeus Seneca<br></p>\n\n\n\n\n\n\n\n<p>I will see you on the inside! </p>\n\n\n\n\n\n\n\n<p><strong>Ben</strong><br></p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Social Mastery: How To Build True Long Lasting Friends", 
    "price": "25.00", 
    "instructors": "Benjamin Hero", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718386_f8b3.jpg", 
    "course_url": "https://www.udemy.com/social-mastery-how-to-build-true-long-lasting-friends/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T15:32:13Z"
}