{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Boost Your Social Skills &amp; Develop Amazing New Friendships</strong></p><p><strong></strong></p><ul><li>Would you like to be able to connect with people?</li><li>Would you like to get new extraordinary friends?</li><li>Would you like to boost your social skills?</li><li>Would you like to get the social life of your dreams?</li><li>Would you like to become socially successful?</li></ul><p><strong>Welcome To The Complete Course That Will Teach You How To Make New Extraordinary Friends</strong></p><p>How would your life improve if you had incredible friends around you who could support you, motivate you, take care of you, share a great moment with you and become important people in your life?</p><p><strong>Boost Your Social Skills &amp; Develop Amazing New Friendships </strong></p><ul><li>Make New Friends Easily</li><li>Double Your Social Life</li><li>Connect With People Instantly</li><li>Social Skills Secrets</li><li>Build Social Confidence</li></ul><p><strong>Social Skills Secrets: Boost Your Social Skills &amp; Make New Friends</strong></p><p>This course if for people who would like to make new amazing friends who they can really connect with, boost their social skills &amp; develop a more fulfilling social life. It has been adapted to help people with little scoial skills to boost their social life and people who already have good social skills to get the friends they 've always dreamt of!</p><p>At the end of this course, you will become socially successful. You will learn powerful tools &amp; techniques in this course that will show you exactly how to make new amazing friends &amp; boost your social life.</p><p><strong></strong></p><p><strong>What are you waiting for? Enroll in this course right now so you can start your transofmration!</strong></p><p><em>This course has a 30 day money back guarantee. You can try this course and see how it can boost your social life! Why not trying? You can only improve your social skills from this deal!</em></p>", 
    "end_date": null, 
    "title": "SOCIAL SKILLS - Double Your Social Skills & Make New Friends", 
    "price": "20.00", 
    "instructors": "Alain W.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/763788_6f85_4.jpg", 
    "course_url": "https://www.udemy.com/social-skills-make-friends/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T00:14:16Z"
}