{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>This course is taught by a <strong>social skills coach with 15 years of experience</strong></li><li><strong>20'000 satisfied students</strong> enrolled in my courses</li><li><strong>300+ TOP reviews</strong> in my courses</li><li><em><strong>30 Money Back Guarantee</strong> - You have 30 days to watch the course and decide if that's for you</em></li><p><em>LATEST: Course Updated Again for October 2015</em></p></ul><p>Learning to influence &amp; persuade people will give you personal power over other people. This course will cover 9 powerful techniques you can use in your personal and professional life to get what you want in social situations.</p><p><strong>How To Influence People &amp; Get What You Want In Social Situations</strong><strong></strong><br></p><ul><li>Get more favors from people</li><li>Gain more power socially</li><li>Influence your customers to buy your products</li><li>Influence people in your personal life</li><li>Influence &amp; persuade people in any social situation</li></ul><p><strong>Learn To Influence &amp; Persuade People In Any Social Interaction</strong></p><p>Why do you say yes to some people &amp; no to others? How can you talk with more influence so you can get what you want? How can you persuade people to do something?</p><p>We will answer these questions in this course. Every one around you uses the power of influence to communicate. But at different levels. Some people know how to use it and they become socially successful &amp; get what they want while other people struggle socially. But don't worry, with this course, you will become to the category of people who are socially successful.</p><p><strong>Content &amp; overview</strong></p><p>You will learn the 9 most powerful techniques in persuasion &amp; influence when dealing with people. You will learn how to increase your success rate when asking a question to someone (it will really make your life easier), you will learn how to get more favors from people (don't overuse it ;-), how to get people to be drawn towards you, how to be categorized as friendly even before you open your mouth (this technique is incredible), how to influence people so they will be super nice when you approach them, how to be great at social skills influence, how to get people to value you socially &amp; how to connect faster with people!</p><p><strong>This course has a 30 day money back guarantee. You can try this course and see how much your influence increases! Why not trying? You can only gain more social influence from this deal!</strong><strong></strong><br></p>", 
    "end_date": null, 
    "title": "SOCIAL SKILLS: How To Influence People & Gain Influence", 
    "price": "20.00", 
    "instructors": "Alain W.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623530_c7a7_13.jpg", 
    "course_url": "https://www.udemy.com/social-influence/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-27T05:39:47Z"
}