{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t     The ability to stand firmly and strongly in your personal space so that you can say no from a place of inner strength  is a skill that many people struggle with.  </p>  <p>  \t     Of course there are many times when we are duty bound to say yes, but if you find yourself frequently feeling resentful, or drained when you cannot  say no to someone, then you may well have created the habit of being a people pleaser.  </p>  <p>  \t     What lies at the root of this more often than not is the fear that by saying no we will be rejected and thought of as selfish. For most people this is a belief that has been deeply embedded since childhood when we learnt that to be selfish was to be bad and to be bad was to be unloved. One of the consequences of this in our adult lives is that we can  run the unconscious belief that it is not possible to be loved and say no at the same time.  </p>  <p>  \t     Learning to stand strongly and firmly in your own personal power  is about so much more than just finding a polite and assertive way to decline a request.  It is about speaking your truth out loud, without fear, or guilt  and without anxiety that you might rock the boat, be rejected, or disturb the peace.  </p>  <p>  \t     In this e-course you will discover how you can begin to release any  unhelpful beliefs that may be limiting your natural authority  and practice several  exercises that you can use straight away to help you say no when you need to and stop giving your power away.  </p>  <p>  \t<strong style=\"\">                                                        Testimonials</strong>  </p>  <p>  \t <em style=\"\">Like so many other people today, I&#039;ve found it harder and harder to say &#039;no&#039; to things. After a steep learning curve I realised that this is untenable and ultimately shows a lack of respect for my own needs. This course has been invaluable in helping me find the ability to say &#039;no&#039; and reconnect with my own authenticity&#039;.</em>  </p>  <p>  \t                                                     Eva Leppard, Australia  </p>", 
    "end_date": null, 
    "title": "Staying Strong Saying No", 
    "price": "20.00", 
    "instructors": "Anne Marshall", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/88006_9a0a_9.jpg", 
    "course_url": "https://www.udemy.com/saying-no/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-04T10:17:24Z"
}