{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">DID YOU KNOW THAT IF YOUR PRIMARY GOAL IN LIFE IS TO BE APPROVED OF BY OTHER PEOPLE, THEN YOU STAND AT RISK OF SACRIFICING YOUR OWN SELF ESTEEM, AND END UP HAVING NO-ONE ELSE LIKE YOU AT ALL.</strong></p>\n\n<p>As social animals, most of us find concern in whether we're accepted, respected &amp; appreciated by others or not. Many people fully commit their lives to meeting the whims of others, keeping people happy and winning the approval of the company they keep.</p>\n\n\n\n<p>Maybe this is you; maybe it isn't? Either way, you can probably relate to the desire of wanting to 'fit in, and have the unconditional acceptance of other people.</p>\n\n\n\n<p>The main problem with this desire to win the approval of others is that when this happens, these 'others' might end up liking someone that you aren't! A wise man once said that, 'If you don't fully accept yourself in life, how could you ever expect anyone else to?'</p>\n\n<p><strong class=\"redactor-inline-converted\">In Super Confidence: Why It's OK Not To Liked By Everyone, you'll:</strong></p>\n\n\n\n<ul><li>Transform How You Interact &amp; Communicate With Other People.</li><li>Discover How To Become An Expert At Saying 'NO' To People.</li><li>Build Powerful Social Confidence &amp; Transform Your Self Esteem.</li><li>Grasp a Strong Understanding of Why You Make the Choices You Make.</li><li>Understand How To Identify Unhealthy Dependancy in Your Relationships.</li><li>Understand How Your Thought Life Influences Your Confidence &amp; Self Esteem.</li><li>Revolutionise your Self-Esteem by Knowing Why It's OK Not To Be Liked By Everyone!</li></ul>\n\n<p><br></p>\n\n<p>One of the greatest regrets that people have in life is committing their time towards being who other people want them to be, rather than just being themselves.</p>\n\n\n\n<p>Throughout the course, each lesson will take you on a step by step journey towards breaking free from the concerns you have about what other people think of you.</p>\n\n\n\n<p>Take the course at your own pace and revolutionise your confidence today by realising, that you're always with yourself, so you might as well start enjoying the company!</p>\n\n\n\n<p><strong><em>Super Confidence: Why It's OK Not To Be Liked By Everyone comes with a Full Money Back Guarantee, and if you're less than fully satisfied, you can get a full refund within 30 days of purchase.</em></strong></p>", 
    "end_date": null, 
    "title": "Super Confidence: Why It's OK Not To Be Liked By Everyone!", 
    "price": "20.00", 
    "instructors": "Kain Ramsay", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608236_1b72_13.jpg", 
    "course_url": "https://www.udemy.com/why-its-ok-not-to-be-liked-by-everyone/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T17:27:53Z"
}