{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you ever considered what makes a celebrity or superstar exude such charisma? What gives certain people so much mojo? </p><p>They have tapped into their greatest asset and resource – THEMSELVES. They have refined and chiseled away the parts of their identity which were NOT authentic and learned how to shine!</p><p>Genuine celebrity results when individuals find their innate strength, discover their true talent, and master it. The end result? They are alive to the fullest, and THAT translates into mojo. </p><p>The distance between the life you <strong>wish</strong> you were living and the life you are <strong>actually</strong> living can be measured by your level of self-confidence. Self-confidence determines how we show up in the world, how we relate to others, how much we influence others and how successful we become. This course is a complete overview of ALL the facets of possessing confidence, self-assurance, and a magnetic personality. It is designed to create <em>intensive</em> transformation in the lives of those who engage with  the material, complete the activities, and implement the techniques and strategies reviewed.  By the end of the course, you will have discovered your <strong>own</strong> inner superstar charisma and will possess that moxy and mojo that only celebrities possess!</p>  <p><strong>Overcome the Barriers to Cultivating Self-Confidence and Develop Self-Assurance in all Areas of your Life.</strong></p>  <ul><li>Build a comprehensive skill set for engaging successfully in any social situation and discover how to attract others like moths to a flame.  <strong>Exude charisma and unlock your inner charm.</strong></li><li>Learn the multi-dimensional reasons why people struggle with low self-esteem and incorporate powerful techniques to subconsciously increase feelings of self-worth.</li><li>Identify the areas of your life which are crippling you with self-doubt and a lack of belief in yourself. Cultivate unlimited faith in yourself and achieve more than you ever thought possible.</li><li>Find a sense of direction in life that gives you clarity, certainty, and purpose. Stop feeling lost and aimless.</li></ul>          <p><strong>Be empowered and Gain Control over your Destiny.</strong></p>  <p>There is no area of our life that isn’t directly impacted by our level of self-confidence. It is precisely because low self-confidence doesn’t <em>seem</em> to be the problem that it is so very insidious. Many people who suffer from low self-esteem attribute their life challenges to wholly different causes. We will be exploring the ways in which almost<em> all</em> of the challenges you face in life can be traced back to this very source.</p>    <p>This course is extremely comprehensive. We will be exploring in-depth the multiple dimensions of confidence along with where people falter when trying to develop it. No matter what specific aspect you are struggling with: social anxiety, lack of self-worth, lacking certainty &amp; purpose, or not feeling powerful and in control of your life, we will address the issue and identify ways to overcome it.</p>    <p>You will be given a series of projects, self-assessments, and activities that will help you to examine <em>where</em> in your life you can make changes that will bolster your levels of confidence and leave you feeling empowered. Each section in this course contains specific instructions that will help you develop the necessary skills to becoming your very best.</p>    <p><strong>Content &amp; Overview</strong></p><p>Everyone has the ability to develop confidence. Confidence itself is not a ‘skill’ per se, but is a combination of multiple skills and is pieced together like a big puzzle. Starting with the biggest and most important piece, this course will help you to assemble the ‘confidence puzzle’ one piece at a time, showing you certain traits and skills that <em>anyone</em> can develop and demonstrating how to implement them into your daily life. </p>  <p>You will learn how to become magnetic, charming, and how to radiate positive energy. Through exercises and activities, you will discover techniques that will make you appear powerful and will enable you to influence others in a powerful way.</p>  <p>You will i<strong>dentify your insecurities</strong>, what triggers them, and how to manage them. Everyone has insecurities, but it <em>is</em> possible to deal with them in such a way that they don’t break down your self-confidence and self-esteem.</p>  <p>You will learn how to be assertive and how to set healthy boundaries, which will increase others respect for you and subsequently, your own self-respect.</p>  <p>You will discover the voice of inner truth and learn to speak it without fear, overcoming the tendency to be submissive and to be a ‘people pleaser’. You will feel empowered to have much more control over how things turn out in your life.</p>  <p>This lack of trust in our own abilities is very dangerous to our potential, as it can stop us from truly following our passions!  Many of us live in fear of doing what we dream; we shrink and play small so that we don’t have to face our fears; we strive to be left alone in our own little world.</p>  <p>But we are meant to shine! Confidence is all about opening up and unleashing the giant potential we each have within, understanding that we are powerful beyond measure, and manifesting our most brilliant inner light into the world. </p>  <p>Join me and let’s get started!</p><p><strong>                                   ********BONUS********</strong></p><p>At the end of the course, I have included a FREE eBook that includes all of the material we will cover throughout the course so that you have everything you need in one, easily downloadable format.                       <br><strong></strong></p><p><strong>                                       GREAT VALUE!!!</strong><br></p>", 
    "end_date": null, 
    "title": "The Confidence Master Course", 
    "price": "20.00", 
    "instructors": "Andrea Hayes", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600804_ae2e_13.jpg", 
    "course_url": "https://www.udemy.com/confidence-h/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T20:19:13Z"
}