{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  On a personal and professional level we are increasingly challenged by what life throws at us. Sometimes lacking identity in what we do, unable to express ourselves, unsure of when to act, low on passion, doing things that don&#039;t feel right, searching for direction and making little impact.  </p>  <p style=\"\">  \t  What would it be like if you could better identify with your values? What would it be like if you could know and express yourself skilfully? What would it be like if you could assert yourself more often?  </p>  <p style=\"\">  \t  Imagine a world where you are an inspiration to yourself and others, a world where you appreciate the importance of your action and a world where you can overcome barriers and achieve impact time and time again.  </p>  <p style=\"\">  \t  These are the results of working with The Seven Secrets of Authenticity.  </p>  <p style=\"\">  \t  The old world permits jobs for life, scandal (from Watergate to Enron etc) and a sense of over protection. The new world of authenticity however, promotes transparency, supports vulnerability, is values led and ensures openness and risk.  </p>  <p style=\"\">  \t  Beware the common pitfalls and the results will soon come your way, don’t…  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  1) Focus too much emphasis on things around you.  \t</p>  \t<p style=\"\">  \t\t  2) Forget to place an emphasis on skilfully expressing your values.  \t</p>  \t<p style=\"\">  \t\t  3) Remain in the background.  \t</p>  \t<p style=\"\">  \t\t  4) Chase outcomes without passion or passion without outcomes.  \t</p>  \t<p style=\"\">  \t\t  5) Set goals that only outline what you want.  \t</p>  \t<p style=\"\">  \t\t  6) Search for answers when questions are more important.  \t</p>  \t<p style=\"\">  \t\t  7) Understand the theory without creating habits.  \t</p>  </ul>  <p style=\"\">  \t  In order to archive these outcomes this short course is structured around the seven secrets of authenticity (identity, inner, insight, inspiration, importance, imagine &amp; impact) - utilising video content, such as: Prezi, websites, video exercises, video presentations, an interview and white board activity. I reference my book (It’s Not About The Coach) and the first chapter titled authenticity.  </p>", 
    "end_date": null, 
    "title": "The Seven Secrets of Authenticity", 
    "price": "20.00", 
    "instructors": "Stuart Haden", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/279352_7d5a_2.jpg", 
    "course_url": "https://www.udemy.com/the-seven-secrets-of-authenticity/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-12T10:37:07Z"
}