{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\"Low self-confidence isn't a life sentence. Self-confidence can be learned, practiced, and mastered--just like any other skill. Once you master it, everything in your life will change for the better.\" - <em>Barrie Davenport</em> </p>\n\n\n\n<p>  \tThis course distills research from psychology and neuroscience from all over the world into lessons and steps that you can take to become more self-confident.  </p>\n\n<p>  \t<strong>Become Self-Confident</strong> <strong>and Set Yourself Up for Success</strong>  </p>\n\n<ul>  \t<li>Challenge self-doubts effectively</li>  \t<li>Understand and develop 'growth mindsets'</li>  \t<li>Identify thinking errors and generate alternative beliefs</li>  \t<li>Manage feelings of anxiety</li>  \t<li>Lean into uncomfortable feelings</li>  \t<li>Use positive emotions to raise confidence</li>  \t<li>Use 'tiny habits' to build up confidence</li>  \t<li>Learn to leave your comfort zone</li>  \t<li>Use long-term strategies to improve confidence</li>  \t<li>Harness your social environment</li>  \t<li>Stop social comparison</li>  \t<li>Build a detailed confidence action plan</li>  </ul>\n\n<p><strong></strong></p>\n\n<p>  \t  \t <strong>Get a full-fledged self-confidence course that covers every single factor that contributes to your self-confidence.</strong>  </p>\n\n<p>  \tSelf-confidence is an important factor for how far we get in life. Because self-confidence is part of you achieving your goals, reaching your dreams, creating the life you want. When you start building your self-confidence, you take one of the most important steps towards a successful and fulfilled life. In this course you'll learn how to build self-confidence – based on the scientific research in psychology and neuroscience.  </p>\n\n<p>You'll learn how to tackle your self-confidence from the four main perspectives: your thoughts, feelings, behavior and social environment. For example, you'll learn how to change beliefs of self-doubt, how to accept and manage feelings of anxiety and what are the best ways to leave your comfort zone. You'll build a detailed confidence action plan that will eventually lead you to higher confidence. If you keep to it, you will succeed. Every single strategy is based on scientific research and used by experts from all over the world. This course is the first to bring them all together in one single course in 'The Science of Self-Confidence'.</p>\n\n\n\n<p>One more thing: You have a totally unconditional money back guarantee. It allows you to study the course for 30 days and if you are in any way unhappy with it, you will get a full refund, no questions asked! Enrolling in the course is absolutely risk free.</p>\n\n<p><em>Click the \"Take This Course\" button now and enroll!</em></p>", 
    "end_date": null, 
    "title": "The Science of Self-Esteem: Learn to Build up Confidence", 
    "price": "30.00", 
    "instructors": "Manuel Kraus", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322008_1e16_2.jpg", 
    "course_url": "https://www.udemy.com/science-of-self-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T09:19:39Z"
}