{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Are you sick and tired of caring what others think about you?</strong>  </p>  <p>  \t<strong style=\"\">Want to be free and confident in your own power?</strong>  </p>  <p>  \t  The answer is simple, we all have to get over ourselves and stop judging.  </p>  <p>  \t  Someone said this to me 10 years ago and at first I thought they were being really rude. But after a few days thoughts I realised that was exactly what I need to do, to break free forever.  </p>  <p>  \t  During this course I will help you break free by teaching you a very simple EFT Tapping technique that will help you release the negative self image and any judgements about yourself or others.  </p>  <p>  \t  This video course features 16 demonstrations of the EFT Tapping so that you can easily transform yourself by following along with me in the videos as your personal instructor.  </p>  <p>  \t  This course covers many key areas of your life and the demonstrations included will leave you feeling much more confident and self accepting.  </p>  <p>  \t  This course is designed to help students understand why they feel insecure, judgemental and with low self esteem. The mind is powerful and is able to change anything that you don&#039;t want. All you do is focus, trust and let go.  </p>  <p>  \t  The videos contained in this course will show you how to do that easily and quickly so you can feel better faster.  </p>  <p>  \t<strong style=\"\">Enrol</strong><strong style=\"\"> today, you&#039;ll be glad you did! </strong>  </p>", 
    "end_date": null, 
    "title": "Transform Self Criticism Into Self Esteem", 
    "price": "20.00", 
    "instructors": "David Childerley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339416_57d4_3.jpg", 
    "course_url": "https://www.udemy.com/how-i-stopped-caring-what-others-think-accepted-myself/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T19:05:38Z"
}