{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>⇉ Join The Biggest &amp; Most Comprehensive Confidence &amp; Self-Esteem Course on Udemy Today! </strong></p>\n\n<p><strong>⇉ This course is MASSIVE! You get Over 121 Lectures and 12+ hours of HD content!</strong><br></p>\n\n\n\n<p><strong>⇉ Watch the promo video to see how to Transform Your Confidence and Self Esteem!</strong></p>\n\n\n\n<p><strong>⇉ Join Over 100,000+</strong> Students Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n<p><strong>⇉ 2500+ Five Star Reviews</strong> Shows Students Who Enrolling Are Getting <strong>Real Results!</strong></p>\n\n\n\n<ul><li>Would you like to improve your results and instantly start becoming more confident?</li><li>Or perhaps develop a higher Self-Esteem and improve your social skills?</li></ul>\n\n\n\n<p>Then this course is for you! <strong>Click \"Take This Course Now\" </strong>For Instant Life-Time Access! </p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>Student Success Testimonials and Reviews:</strong></p>\n\n\n\n<p><strong>My Reflection - You can use it</strong></p>\n\n\n\n<p>Hi Joe,</p>\n\n\n\n<p>I had a lot of breakthroughs in this course.</p>\n\n\n\n<p>The most important 2 were trust: trust any result or outcome, good or bad, happens for the right reason.</p>\n\n\n\n<p>Than makes me have a lot more confidence because whatever I do in life, the result is going to be the right one in that moment, so that something greater happen in my life.</p>\n\n\n\n<p>Also, I discovered that I had no confidence and self-esteem in certain situations.</p>\n\n\n\n<p>The exercises and challenges that you offer in the course are the best to grow that so I can immerse myself into the unknown.</p>\n\n\n\n<p>I discovered that I had no confidence in some aspects of my life, and that was why I was failing in them... I wasn't challenging myself to tap into those scenarios with the intention of gaining more confidence and self-esteem and to grow.</p>\n\n\n\n<p>Thank you very much for this course Joe.  <strong>-Estaban </strong></p>\n\n\n\n<p>__________</p>\n\n\n\n<p><strong>\"Excellent Material</strong> </p>\n\n\n\n<p>I'm only a quarter of the way through and have no hesitation in telling you that this is an excellent course. Joe is so full of enthusiasm for his subject, and covers some pretty deep stuff in a very engaging manner. There are plenty of udemy instructors who cobble together a short course, charge way too much, and hardly engage with students at all. Joe is totally engaged with his students and it's clear that he really wants to help. (Let me tell you, when you get to my age, you develop a very finely tuned BS detector. It never comes close to twitching when I watch Joe's stuff.) The best compliment I can pay this course is to tell you that I like to start my working day, at my desk, with a video or two from this course. Sets me up nicely for the day ahead. Will update this review when I've watched more of the course.\"   -Sam Pollard </p>\n\n\n\n<p>This is by far my favorite Udemy course of all time! The videos are spectacular and like you said I was never bored! Incredible things I have learned about my own confidence and self-esteem just by enrolling in this course. You have great content. Please continue to make more courses like this!\"</p>\n\n\n\n<p>-Rachel Laveno</p>\n\n\n\n<p><strong>\"It feels as though you were working with him on a 1 to 1 basis.</strong></p>\n\n\n\n<p>The goal of most self-development courses is very simple: to inspire others to take determined action in order to make changes in their lives. Yet many people fail to do so because sometimes the lessons are taught in a way that seem to make things more complicated than they need to be. I'm happy to say that this course is different. Joe Pary makes learning how to transform your confidence and self-esteem into a fun, easy and enjoyable experience. Filmed in high definition in multiple locations, Joe brings his audience into each lesson with him, making it feel as though you were working with him on a 1 to 1 basis. Joe's infectious, positive attitude coupled with a direct and to the point delivery makes increases the student's motivations, stimulates their desires and keeps them focused. Don't delay in getting this great course taught by a very talented instructor!\" -Tim Hudson </p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>The Benefits You Will Gain From This Course Are Endless!</strong></p>\n\n\n\n<p><strong>My goal for you in this course </strong>is to give you the understanding of how to transform your confidence and self-esteem!</p>\n\n\n\n<p> I show you throughout this course how we use both our mind and body through a series of strategies and techniques to achieve these results.</p>\n\n\n\n<p><strong>You Will Learn:</strong></p>\n\n\n\n<ul><li>Multiple Strategies to Transform your Confidence and Self-Esteem </li><li>Self-Image strategies to boost your Confidence and Self-Esteem</li><li>Understand the psychology of who you are and how to Transform Your Life! </li><li>Both Inner and Outer Confidence for a life changing Transformation </li><li>Engaging Lectures shot from all around the world using high teach cameras! </li><li>Who you are and how to manifest amazing results </li><li>And so much more!!</li></ul>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards transforming your life and becoming more confident! </p>\n\n\n\n<p>When I learn something new about confidence and self-esteem, I add it to the course -at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the Udemy <strong>30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But it can be done!</em> </p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p>This course will not remain this price forever! <strong>It's time to take action!</strong></p>\n\n\n\n<p>Click the <strong>\"take this course\" </strong>button, top right, now...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p><strong>See you in the course!</strong></p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p>Joe Parys</p>", 
    "end_date": null, 
    "title": "Transform Your Confidence and Self-Esteem - Complete Course", 
    "price": "50.00", 
    "instructors": "Joe Parys", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471952_5499_3.jpg", 
    "course_url": "https://www.udemy.com/confident/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T14:48:16Z"
}