{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Have you ever wondered what life would be like if you had Unshakable Confidence in the truth of who you are? Have you ever imagined having untouchable self esteem?</strong></p>\n\n<p>Unshakable Confidence: The Ultimate Self Esteem Formula, will take you on an in-depth journey of self-discovery to understand the reasons for low self esteem, how to overcome it, and how to implement your newfound confidence in all areas of your life.</p>\n\n<p><strong>As you progress through the course you will learn how to:</strong></p>\n\n<ul><li>Develop Strong Inner Confidence and Self Esteem.</li><li>Reduce Your Need for the Approval of Other People.</li><li>Overcome Your Fear of Rejection and Social Anxiety.</li><li>Manage and Reduce Your Minds Negative Self-Talk.</li><li>Face New Life Challenges With Greater Confidence and Ease.</li><li>Become Genuinely Confident in the Truth of Who You Are.</li><li>Grow Your Communication Skills for More Social Confidence.</li></ul>\n\n<p><br></p>\n\n<p>Insecurity and low self-esteem make so life unnecessarily hard! And developing genuine confidence in who you are is essential for transforming your self esteem, your social confidence, and your general wellbeing in life.</p>\n\n<p>Some people miss out on exciting life experiences due to fear, low self esteem, or their lack of self-confidence. This course will introduce you to the idea that our low self esteem or confidence issues are often just a result of the mistaken perceptions that we develop about ourselves as children.</p>\n\n<p>Unshakable Confidence addresses the core issues that underpin many self-doubts and low self esteem issues. We'll go on a journey to discover the actionable steps that you can begin taking today, to dismiss your negative thinking and build genuine confidence in its place.</p>\n\n<p>You'll understand the key factors that trigger low confidence, and begin to recognise easily the thought patterns that produce low self esteem alongside other negative emotions. Once you know how to identify them, you can eliminate them with ease.</p>\n\n<p><strong><em>Unshakable Confidence course comes with a Full Money Back Guarantee, and i</em></strong><strong><em>f you're less that 100% satisfied, you can get a full refund within 30 days of purchase.</em></strong></p>\n\n<p><em><strong></strong></em></p>\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "Unshakable Confidence: The Ultimate Self Esteem Formula", 
    "price": "30.00", 
    "instructors": "Kain Ramsay", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184138_81e1_10.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-confidence-coaching-program/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-17T20:17:43Z"
}