{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What is Verbal Self Defense 101 about?</strong></p><p>This is an INTRODUCTION to the art and science of verbal self defense, an essential life and social skill. </p><p>In life people will always provoke and test you. They do this in order to find out what you're made of. Just like on the playground, your social standing depends on your ability to deal with people's social tests. If you do not know how to fight back verbally when people verbally provoke, bully, or test you, you will find yourself on the lower end of the \"social totem pole\". </p><p>This course will teach you how to \"fight back\" with wit and social intelligence.  It will do this by identifying for you the MOST COMMON verbal attacks and insults that you will experience and teach you the BEST ways to respond.</p><p><strong>What kind of materials are included?</strong></p><p>This course consists of FIVE short video lessons and a PDF file summarizing the material in this course. </p><p>Two bonus lectures are also included.</p><p><strong>How long will the course take to complete?</strong><br></p><p>This course will only take you roughly 30 minutes to complete. In only 30 minutes, you will be able to deal with and crush all the most common verbal attacks and insults!</p><p><strong>How is this course structured?</strong><br></p><p>Not only will this course teach you HOW to respond to the most common verbal attacks and insults, you will also learn important mindsets and non-verbal communications NECESSARY to implement these responses to their full effect. </p><p>Finally, the course will finish with some exercises to help you reinforce the material in this course.</p>", 
    "end_date": null, 
    "title": "Verbal Self Defense 101", 
    "price": "20.00", 
    "instructors": "Min Liu", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758944_da64_5.jpg", 
    "course_url": "https://www.udemy.com/verbal-self-defense-101/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T22:13:11Z"
}