{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>INSCRÍBETE EN ESTE CURSO GRATIS del 19 al 31 de Octubre 2015! APROVECHA! Usa el código GRATIS.</strong>  </p>    <ul>  \t<ul><p>¿Quieres fortalecer tu confianza en ti?</p><p>·¿Llevas tu vida complaciendo las expectativas de los demás en vez de las tuyas?</p><p>·¿Sientes incongruencia entre lo que piensas, dices y haces?</p><p>·¿Te sucede que muchas veces dices “SÍ\" cuando quieres decir “NO\"…. o dices “NO\" cuando quieres decir “SÍ\"?</p></ul><p>Si has respondido afirmativamente a cualquiera de estas preguntas, ¡entonces necesitas hacer el <em><strong>Entrenamiento Holista y Sistémico en Asertividad</strong> </em>sin esperar un segundo más!</p><p>Esta es la <strong>Fase 3, el CURSO AVANZADO del <em>Entrenamiento Holista Y Sistémico en Asertividad</em></strong> y esto es lo que están diciendo de este proceso de crecimiento personal que te conduce a sentirte y SER un GANADOR / una GANADORA en tu vida:</p><p><em>\"Uno de los cursos más interesantes y productivos que he realizado. Es una propuesta de trabajo interno absolutamente coherente y con posibilidades de aplicación inmediata.\"</em></p><p><em>\"Las destrezas asertivas han contribuido a desempañarme mejor en mi trabajo, a interactuar mejor con mis clientes y proveedores, a ser una mejor profesional.\"</em></p><p><em>\"Uno de los cursos más poderosos que he tomado. Toca lo más profundo de tu ser llevándote a un serio y responsable autoanálisis.\"</em></p><p><em>\"Me ayudó a conocerme mejor y descubrir cosas de mi personalidad. He apreciado mis cambios en mi forma de pensar y actuar; siento mas confianza al relacionarme con otros.\"</em></p><p><em>\"He estado aplicando las destrezas que aprendí en este curso y estoy asombrado de los resultados positivos que me han producido.\"</em></p><p><strong>El </strong><em><strong>Entrenamiento Holista y Sistémico en Asertividad</strong></em> es un proceso completo y profundo diseñado para dotarte de una sólida Auto-Confianza que te motive a vivir una Vida Asertiva. Comprende Tres Fases:</p><ul><li>Curso Introductorio: Estableciendo Las Bases del Proceso</li><li>Curso Intermedio: Del Auto-Conocimiento a la Auto-Confianza</li><li>Curso Avanzado: El Poder de Confiar en Ti y de Ser Asertivo</li></ul><p>Este <strong>CURSO AVANZADO</strong> también incluye un Manual de Trabajo o <em>Cuaderno de Bitácora</em> con todos los ejercicios que debes realizar e información nutritiva para fortalecer tu confianza en ti y empoderarte como la Persona Ganadora que eres.</p><p><strong>¿Qué es Ser Asertivo?</strong> En términos generales, una PERSONA ASERTIVA confía en si misma; piensa, siente y se expresa positivamente, con decisión y firmeza. Tiene claro lo que quiere y lo que no quiere; es capaz de sobreponerse a sus miedos siendo proactiva al plantear apropiadamente lo que desea o necesita para que sus demandas sean satisfechas.</p><p>Si no has realizado Las Fases 1 y 2 del Programa,<strong> inscríbete YA en el CURSO INTRODUCTORIO</strong> que es completamente <strong>GRATIS</strong> y comienza tu Entrenamiento para SER UNA PERSONA ASERTIVA. Tanto el <em>Curso </em><em>Intermedio </em>como este<em> Curso</em> <em> Avanzado</em> tienen <strong>el precio mínimo</strong> establecido por Udemy para sus cursos.</p><p><strong>¡Un Ganador nunca posterga sus decisiones! ¿Eres tú un Ganador?</strong></p><p>Revisa los Bonos que recibes al inscribirte en el Curso Intermedio de los cuales continuarás disfrutando en el Curso Avanzado. </p></ul>  <p>  \t<strong>Algunos beneficios reportados por personas que han realizado este Programa:</strong>  </p>  <ul>  \t<p>  \t\t·Aumento progresivo, constante y duradero de su Auto-confianza y Auto-estima.  \t</p>  \t<p>  \t\t·Reducción significativa de los niveles de ansiedad y/o miedo en situaciones difíciles.  \t</p>  \t<p>  \t\t·Mejoras significativas en sus relaciones interpersonales en los diversos contextos de la vida… con los padres, hijos, pareja, amistades, familiares, … y relaciones sociales en general.  \t</p>  \t<p>  \t\t·Disminución significativa de estados depresivos y somatizaciones.  \t</p>  \t<p>  \t\t·Aumento de su nivel de auto-conciencia y toma de conciencia del ambiente circundante.  \t</p>  \t<p>  \t\t·Apertura de oportunidades de crecimiento personal y profesional.  \t</p>  \t<p>  \t\t·Profundo y real sentimiento de satisfacción personal y orgullo positivo.  \t</p>  \t<p>  \t\t·Incremento de su iniciativa y proactividad.  \t</p>  \t<p>  \t\t·Cambio en su forma de ver la vida… y vivirla.  \t</p>  \t<p>  \t\t·Mayor Bienestar Emocional, Mental y Física.  \t</p>  \t<p>  \t\t·Claridad de propósito en su vida.  \t</p>  \t<p>  \t\t·Mayor felicidad y paz interior.  \t</p>  </ul>  <p>  \t¡Todos estos beneficios, y más, <strong>los puedes lograr tú también</strong> con al realizar el Entrenamiento completo en Asertividad<strong>!</strong></p>  <p>  \t¡Te invito a salir de tu zona de confort y a sorprenderte a ti mismo/a de todo lo que eres capaz de hacer y de lograr.  </p>  <p>  \tRecuerda: ¡<strong><em>La felicidad no es un fin ni una meta…. Es un camino, una forma de vivir! </em></strong>  </p>  <p>  \t<em>“Locura es hacer lo mismo una y otra vez y esperar resultados diferentes\" ~ </em>Albert Einstein  </p>  <p>  \t<strong><em>¡La decisión es tuya y de nadie más!</em></strong></p>  <p><strong>¡Sé un Ganador! No postergues la decisión de convertirte en una MEJOR persona... en una PERSONA ASERTIVA.  </strong></p>", 
    "end_date": null, 
    "title": "¡Maestría en Asertividad para Ser Un Ganador en la Vida! ", 
    "price": "35.00", 
    "instructors": "Gisela Echeverría G.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289782_79e3_4.jpg", 
    "course_url": "https://www.udemy.com/el-poder-de-confiar-en-uno-mismo/", 
    "currency": "USD", 
    "subject_name": [
        "Self Esteem"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T20:19:41Z"
}