{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In deze video cursus leer je aan de hand van een <strong style=\"\">vrij eenvoudige woning</strong> alle noodzakelijke technieken om te <strong style=\"\">modelleren in 3D</strong>. We gaan een voorbeeld uitwerken vanaf het begin, maar zullen ook de belangrijkste methodes leren om op een <strong style=\"\">efficiënte en professionele manier</strong> aan de slag te gaan met SketchUp.</p><p>Je kan het model zelf stap voor step opbouwen, met <strong style=\"\">elke recente versie van SketchUp</strong> (Windows of OSX, Make of Pro). Slechts hier en daar worden gereedschappen gebruikt die enkel in de Pro-versie beschikbaar zijn en over het algemeen kan je dit ook benaderen met de Make versie.</p><p><em style=\"\">De video werd opgenomen met versie 2013 Pro, toen Trimble net eigenaar was geworden van SketchUp, maar de manier van werken is dezelfde voor alle versies van SketchUp.</em></p><ul style=\"\"><li>We vertrekken van een algemeen overzicht en de elementaire gereedschappen om te modelleren en te navigeren in 3D.</li><li>Doordat SketchUp op een slimme manier opgevat is, blijft dit toegankelijk voor iedereen, ook als je geen ervaring hebt met 3D of CAD.</li><li>We brengen gaandeweg meer complexe gereedschappen aan, in de loop van het project, zoals &quot;<em style=\"\">Components</em>&quot;, &quot;<em style=\"\">Layers</em>&quot; en &quot;<em style=\"\">Scenes</em>&quot;.</li><li>We maken gebruik van de leuke en interessante manieren om het model te presenteren in SketchUp, zonder het model zelf anders te moeten opbouwen.</li><li>Tenslotte leren we enkele spectaculaire technieken kennen om het model te integreren met <em style=\"\">Google Earth</em>, om extra modellen te downloaden van de &quot;<em style=\"\">Warehouse</em>&quot; en om 3D modellen af te leiden van een foto, inclusief de texturen.</li></ul>", 
    "end_date": null, 
    "title": "3D Architectuur met SketchUp", 
    "price": "20.00", 
    "instructors": "Stefan Boeykens", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561468_1c0f.jpg", 
    "course_url": "https://www.udemy.com/sketchup-architect/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T09:52:08Z"
}