{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Aprende a modelar espacios arquitectónicos con un acabado profesional y realista. Con este curso te capacitamos en un programa de conocimiento mundial utilizado para la creación de juegos, peliculas y espacios 3D.</p><p><strong>Conoce las herramientas que posee el 3Ds Max para abordar proyectos exteriores e interiores de arquitectura.</strong></p><ul><li>Modelar elementos de arquitectura.</li><li>Modificar Mobiliarios importados.</li><li>Utilizar la importación de modelos creados en otros softwares.</li><li>Aprender los conceptos de Iluminación.</li><li>Utilizar Plugins para disminuir el tiempo de modelado.</li><li>Conocer la forma correcta de texturizar espacios y elementos de arquitectura.</li><li>Entender el concepto de Render y sus características.</li></ul><p><strong>Un programa con todas las herramientas que se necesitan para la creacion de espacios arquitectónicos realistas con un acabado profesional.</strong></p><p>Sumérgete en el mundo del modelado arquitectónico tridimensional de forma rápida en el programa más utilizado en la representación gráfica 3D. Adquiere las habilidades de Modelado, Texturizado, Iluminación y Render a nivel profesional.</p><p>Este curso está orientado a estudiantes que estén incursionando en el modelado de espacios tridimensionales o para personas que ya conozcan el espacio 3D y no hayan logrado sus objetivos de generar espacios realistas.</p><p>En este curso los estudiantes aprenderán mientras se divierten creando los ejemplos explicados para entender las herramientas que posee el programa 3Ds Max. Ademas de adentrarnos en modelado, nos enfocaremos en la iluminación de espacios interiores y exteriores y su correcto texturizado.</p><p>Al principio de este curso conocerás la interfaz gráfica y las herramientas que facilitan el trabajo a la hora de abordar proyectos de arquitectura, luego iremos explicando las herramientas que tenemos para modificar elementos arquitectónicos.</p><p>También aprenderemos a utilizar de forma correcta las luces que posee el programa para generar espacios realistas, ademas de aprender a utilizar plugins que facilitan la inserción de mobiliarios, vegetación y texturizado de los elementos que siempre poseen los espacios arquitectónicos y por último aprenderemos el concepto de render, sus características y el retoque a nivel básico de las perspectivas que creamos para ser mostradas al cliente.</p>", 
    "end_date": null, 
    "title": "3D Studio Max:  Espacios arquitectónicos", 
    "price": "50.00", 
    "instructors": "Miguel Angel Soto, SDQ Training Center", 
    "commitment": "21.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420452_baa0.jpg", 
    "course_url": "https://www.udemy.com/3d-studio-max-espacios-arquitectonicos/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T18:37:28Z"
}