{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Architectural visualization is the skill needed in every architecture and property development business. Why? Because architects need them to present their designs and property developers need them to make sale. The demand is very high yet not many people willing to master it; thinking it&#039;s a complicated stuff to master. Well not anymore! This course will teach you effectively how to create beautiful 3D architectural visualization using 3DS MAX and Corona renderer with just a fraction of time usually needed. Not years. Not months. In only 4 days you&#039;ll master the knowledge to create stunning 3D renderings and become fully a job-ready person in the industry. Or if you are like me; create your own 3D visualization firm and make a lot money from it!</p><p>This course is designed for a complete beginner so no prior experience is needed. On the other hand seasoned 3DS MAX users can still benefit from this course as we&#039;ll be covering more specific topics in this course such as Corona renderer and post-processing with Photoshop. If you know VRay before and want to explore cheaper but better alternative then VRay you definitely need to take this course. How do I know that? Because I&#039;ve used VRay before and just switched to Corona after knowing its hidden power. As I mentioned, the softwares we will be using in this course are: 3DS MAX, Corona renderer and Photoshop in this course. Trial versions will be enough as we don&#039;t need more than 30 days to finish the whole course. </p><p>First we&#039;ll cover the fundamental stuff in 3DS MAX. Then we move on to different 3D modeling techniques. We&#039;ll cover a lot of exercise projects designed to develop your skill step-by-step. After that we&#039;re going to deepen our knowledge to lighting, material and rendering using Corona rendering engine. Our final project is to build an interior scene from scratch; from modeling, texturing, lighting, rendering and finally retouch it in Photoshop.</p><p>Beside lifetime access to professional-quality video lessons, you&#039;ll also get all of the projects files including: 3DS MAX files, texture images and the final Photoshop composition file. And also I&#039;ll be adding bonus lessons in this course every month so be sure to check them out!</p><p>So why wait? Take the course know and take your first step in becoming 3D artist or 3D entrepreneur! Whatever you choose to be. Because there is NO RISK in taking this course. If you find my course is not suitable for you or for whatever reasons; you can get a full 100%, absolutely no conditions attached, no questions asked, refund directly from Udemy. How cool is that?</p>", 
    "end_date": null, 
    "title": "3D Visualization For Beginners: Interior Scene with 3DS MAX", 
    "price": "35.00", 
    "instructors": "widhi muttaqien", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/461864_4f1a_2.jpg", 
    "course_url": "https://www.udemy.com/3d-visualization-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T05:06:01Z"
}