{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Aprende el <em style=\"\">Diseño Asistido por Computadora</em> de una manera fácil y divertida. Con este curso aprenderás las herramientas necesarias para diseñar en uno de los software más utilizados en el área de Arquitectura e Ingeniería.</p>  <p><strong style=\"\"><em style=\"\"></em>Conoce las herramientas que debes tener para desarrollar proyectos en el mundo del AutoCAD.<em style=\"\"></em></strong></p>  <ul style=\"\"><li style=\"\">Diseñar proyectos arquitectónicos.</li><li style=\"\">Modificar elementos de cualquier tipo de proyecto.</li><li style=\"\">Dimensionar y diagramar proyectos para la impresión y visualización.</li><li style=\"\">Exportar proyectos a diferentes formatos.</li><li style=\"\">Creación tridimensional de muros.</li><li style=\"\">Creación de mobiliarios.</li><li style=\"\">Edición de elementos tridimensionales.</li></ul>  <p><strong style=\"\"><em style=\"\"></em>Una poderosa herramienta para desarrollar proyectos de manera profesional.<em style=\"\"></em></strong></p>  <p>Conoce de manera sencilla y divertida uno de los programas más utilizados a nivel mundial en el área de la industria de la construcción. Aprende los concepto básicos de las entidades, organización de proyectos, Impresión de planos y diseño 3D.</p>Este curso ha sido concebido para estudiantes que estén comenzando a utilizar el AutoCAD, o profesionales que quieran actualizarse en las versiones más recientes que tiene este tan conocido programa. En este curso taller vas a desarrollar  ejemplos diseñados con el objetivo de ayudarte a entender y conocer cómo utilizar los elementos más importantes del Autocad. Además tomarás prueba de autoevaluacián para medir los conocimientos que adquieras durante las clases. Al principio de este curso aprenderás los conceptos esenciales para poder introducirte al diseño bidimensional, el cual esta sustentado en la creacion de<em style=\"\"> líneas, arcos, rectángulos, entre otros</em>, luego iremos aprendiendo las herramientas que tenemos para editar las entidades que ya hemos creado.<p style=\"\"><br style=\"\"></p><p style=\"\">También aprenderemos cómo organizar nuestros proyectos por medio de los conceptos de capas. Conocerás el dimensionado de planos y la creacion de alzados o fachadas de ejercicios que estaremos trabajando en el transcurso de esta clase. </p><p style=\"\">En el transcurso te sumerjerás en el mundo tridimensional logrando realizar desde el levantamiento de muros básicos y la creación de mobiliarios. <br style=\"\"></p>", 
    "end_date": null, 
    "title": "Aprende AutoCAD 2D y 3D: Básico e Intermedio.", 
    "price": "50.00", 
    "instructors": "Miguel Angel Soto, SDQ Training Center", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419481_a7fd.jpg", 
    "course_url": "https://www.udemy.com/aprende-autocad-2d-y-3d-basico-e-intermedio/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T18:24:58Z"
}