{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong></strong><strong>Dibuja, diseña y documenta tus proyectos de estructuras con REVIT</strong></p><ul><li>Entra en el campo de diseño con BIM (Building Information Modeling)</li><li>Domina las potentes herramientas de dibujo</li><li>Crea tus propias plantillas</li><li>Exporta a programas de cálculo</li><li>Crea y documenta planos</li><li>Crear y analiza cargas y reacciones en las estructuras</li><li>Presenta tus resultados con planos de calidad en la mitad de tiempo.</li></ul><p>Con este curso aprenderás como sacar provecho de estas herramientas para que el proceso de diseñó estructuras para edificios sea más rápido, más eficiente y de mayor calidad.</p><p><strong>Una nueva forma de gestionar tus proyectos</strong></p><p>El software Revit es el líder mundial para diseño de edificios haciendo uso de BIM (Building Information Modeling), permitiendo a los profesionales no solo generar planos sino coordinar el modelo entero del edificio incluyendo características de diseño. Revit está ideado para incluir herramientas de diseño de estructuras de edificios.</p><p><strong>Cuando asignas elementos a un proyecto, tu puedes:</strong></p><ol><li>Generar automáticamente planos de planta, elevaciones, secciones e impresiones finales</li><li>Realizar cálculos estáticos en la nube</li><li>Realizar cálculos avanzados en programas especializados como Robot Structural Analysis</li><li>Crear modelos estructurales y analíticos</li><li>Crear y documentar rápidamente los planos de detalles</li><li>Mejorar tu rendimiento al trabajar en un modelo BIM</li></ol><p><strong>Orientación del curso</strong></p><p>Seguiremos el orden lógico en que desarrollarías un proyecto personal. En lugar de considerar cada aspecto teórico del programa, nos centraremos en seguir el flujo de trabajo que más se adapte a un caso real y te daremos algunos consejos para conseguir los mejores resultados.</p><p>Conseguirás archivos preparados que te permitirán seguir el avance del curso desde donde consideres más necesario guiándote para que utilices tu mismo las herramientas mientras ves las clases.</p><p>El contenido del curso es actualizado regularmente para incluir actualizaciones importantes o puntos que pueden ayudarte a mejorar tu aprendizaje y tendrás acceso a ellas en tiempo real para que puedas mejorar tus habilidades de continuo.</p>", 
    "end_date": null, 
    "title": "Aprende Revit Structure", 
    "price": "50.00", 
    "instructors": "Felix Garofalo", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566738_0fc7_5.jpg", 
    "course_url": "https://www.udemy.com/aprende-revit-structure/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T01:45:21Z"
}