{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>When I started architectural visualization and rendering with Max &amp; V-Ray, my final renders were not so interesting .It was very sad. Comparing my renders to professional archivizs' across the internet made me deeply disappointed. Their renders had something magical that was pleasing to the eye. I used to think studying more about V-Ray render settings, lighting, texturing, etc. would fix my problem, but it wasn’t the case. After much ado, I decided to improve my post production skills and the result blew my mind! Yes, that was it! The miracle! The more I spent on improving my post-production skills, the better my renders got. \n\n  </p>\n\n<p>I am confident that many of you guys have the same problem, so I decided to launch a course to get straight to curing your washed-out unsatisfying renders!\n\n  </p>\n\n\n\n<p>In this course, we won't go to every boring menu and setting in Photoshop, we do our job fast and flawlessly, just like a pro!\n\n  </p>\n\n\n\n<p>You don't need to have any skill in Photoshop at all. Just follow my steps and understand the workflow. I give you all the details you need to know.\n\n  </p>\n\n\n\n<p>Just bear in mind your raw renders must meet the minimum requirements of a good render such as correct lighting and texturing. In other words, you can't render rubbish and expect Photoshop to clean it up for you! It's about taking your ordinary render to an eye-catching world-class one!\n\n  </p>\n\n\n\n<p>So be positive and confident about what you are doing and what you will do after finishing this course! You will make great progress.</p>", 
    "end_date": null, 
    "title": "Architectural Post-production: From boring to brilliant !", 
    "price": "25.00", 
    "instructors": "Farhad Rashidi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/855022_e1ea_4.jpg", 
    "course_url": "https://www.udemy.com/architectural-post-production/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T13:52:59Z"
}