{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t      Günümüzde <strong>mimar, mühendis ve teknikerlerin artık bir 3D modelleme programı bilmemesi </strong>söz konusu bile değil. Bir çok üniversite öğrencisi okullarda bu programların yeterince iyi bir şekilde öğretilmediğinden şikayetçi.  </p>  <p>  \t<strong>Yakın Kampüs&#039;ün</strong> kendisini kanıtlamış kadrosunun yeni ders serisinde <strong>AutoCAD 3D programını</strong> derinlemesine öğreneceğiz.  </p>  <p>  \t  Derslerin sonunda AutoCAD 3D ile bir çok örnek yapmış olacaksınız. Neredeyse her komutu en az 1-2 örnek ile pekiştirerek çok daha kalıcı bir şekilde öğreneceğiz.  </p>  <p>  \t<strong>AutoCAD 3D</strong>, 3 boyutlu modellemeye son derece yerinde bir başlangıçtır. Bir çok 3 boyutlu modelleme programının temel komutlarını da bu eğitimde bulacaksınız. Aurocad 3D öğrendikten sonra bir çok 3 boyutlu modelleme programını kullanmak sizin için çok daha kolay olacak.  </p>  <p>  \t<strong>AutoCAD 3D derslerimizi Yakın Kampüs eğitmenlerinden Gökçe GÜN anlatıyor. </strong>Gökçe GÜN yaklaşık 10 yıldır AutoCAD ile projeler yapmaktadır ve 7 yıldır teknik çizim, modelleme ve 3D görselleştirme dersleri anlatmaktadır. Ayrıca modelleme ve görselleştirme yaptığı <strong>Aferin Medya</strong> isimli firmanın da  ortağıdır.  </p>  <p>  \t      Bu sürede kazandığı tecrübeyi bu eğitimde ve Yakın Kampüs internet sitesinde öğrencileri ile paylaşmaktadır.  </p>  <p>  \tEğitimimize <strong>AutoCAD programının en güncel versiyonunun kurulumu ile başlayacağız</strong>. Derslerimizde komutların daha önceki versiyonlarda da nasıl çalıştığından bahsedeceğiz ama son versiyonun kurulumu eğitimi rahatlıkla takip etmek için tavsiye edilir.  </p>  <p>  \tBundan sonra 3 boyuta bir giriş yapacağız ve 2 boyutta yapmaya alıştığımız çizimleri 3 boyutta nasıl rahatlıkla yapabiliriz bunları göreceğiz. Bu aşamadan sonra 2 boyutlu objeleri 3 boyutlu modellere nasıl çevirebileceğimizi ve bu objeler üzerinde nasıl modifikasyonlar yapabileceğimizi göreceğiz.  </p>  <p>  \tİleri aşamalarda yüzey modelleme, mesh modelleme gibi komutları göreceğiz ve son olarak modellerimizden teknik resimler oluşturmayı görerek eğitimimizi bitireceğiz.  </p>  <p>  \t<strong>Yakın Kampüs AutoCAD 3D derslerimizi</strong> <strong>izledikten sonra rahatlıkla 3 boyutlu modelleme yapabilmeniz hedeflenmektedir. </strong>Kendinizi bu ders serimizden sonra daha da geliştirmek için <strong>Yakın Kampüs Udemy </strong>kanalımızdaki diğer ders serilerimizi izleyebilir ya da <strong>Yakın Kampüs internet sitemizdeki</strong> ücretsiz dersleri takip edebilirsiniz.  </p>  <p>  \tAutoCAD 3D ile Modelleme derslerinden sonra AutoCAD ile Render derslerine devam etmenizi tavsiye ederiz. AutoCAD programında render almayı da öğrendikten sonra yine 3Ds Max gibi çok daha gerçekçi görseller oluşturabileceğiniz programlara geçiş yapabileceksiniz.  </p>", 
    "end_date": null, 
    "title": "AutoCAD 3D ile Modelleme Öğrenin", 
    "price": "50.00", 
    "instructors": "Yakın Kampüs", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340874_ccc2_6.jpg", 
    "course_url": "https://www.udemy.com/autocad-3d-ile-modelleme-ogrenin/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T21:05:48Z"
}