{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>From zero to Autodesk professional! </p><p>This course will cover everything you need to know about Revit with many easy and practical tutorials. Learn to design and build an architectural project from scratch in Autodesk Revit, if you are interested in automated drawing, design, architecture this is the right course for you!</p><p>The course 'Autodesk Revit Bim training' is based on my personal experience as an Autodesk Authorized Instructor, it starts with a preliminary tutorial so that you can become familiar with the graphic interface of the program Autodesk Revit Architecture, then we will learn how to set up a project from scratch, establish structural grid lines and reference lines and start setting up structural columns.</p><p>The next step will be installing walls, control their wall assembly and learn how to customize elements, you will learn how to use the curtain wall tool and how to create slabs and stairs.</p>A whole tutorial is focused on roofs, how to build them and give the proper slope. Later you will learn how to use of the area command which will allow you to generate quickly and effectively area calculation for your project and how to generate schedules and area takeoffs.<p>Modelling a terrain, a classical complex task with other software, such as AutoCAD, 3ds Max or Rhino is made very easy by Revit, you'll see!</p><p>At the end of the course we will examine how to develop details to go with our construction document and you will learn how to create a parametric 3d component, the so-called “Revit families\" <br> <br>Post Scriptum: I originally recorded the tutorials in Italian and then asked Alessandro, a friend of mine who lives in the States, to translate them in English, so don't be surprised when you'll hear a very manly voice speaking! <br> <br>Have fun! and learn well! <br> <br>Elisabetta Cenci</p><p><br></p>", 
    "end_date": null, 
    "title": "Autodesk Revit Architecture BIM Training", 
    "price": "45.00", 
    "instructors": "Elisabetta Cenci", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570058_8511_3.jpg", 
    "course_url": "https://www.udemy.com/autodesk-revit-architecture-bim-training/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T10:52:17Z"
}