{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\"></strong>Concrete is the most widely used building material in the world. Today&#039;s construction professional needs to understand how this material works, how it has evolved and how it is made. The course includes discussions on the chemistry behind making concrete, and the evolution of the science behind making concrete. These are things that today&#039;s construction professional needs to understand in order to effectively manage today&#039;s projects. You will learn the meaning and origins of the terms and processes used in the industry by today&#039;s concrete producers and engineers so that you become a more effective and more professional construction pro.</p><p><strong style=\"\">Gain a better understanding of the chemistry behind the Worlds most widely used building material and learn how its production has evolved to produce a more advanced and eco-friendly finished product. </strong></p><p>After completing this course you will be able to...</p><ul style=\"\"><li>Describe the  difference between concrete and cement</li><li>List the basic  components or ingredients needed to make concrete</li><li>Explain how  concrete uses industrial by-products</li><li>Discuss how these by-products enhance the properties of concrete</li><li>Describe the chemical process through which concrete gets hard</li><li>Explain how chemical admixtures can be used to alter the properties of concrete</li><li>Define the terms used by designers and producers when they are preparing and reviewing concrete mix designs </li></ul><p><strong style=\"\">Learn from a professional</strong></p><p><strong style=\"\"> </strong>My courses have been created as a place where everyone, whether you are an experienced professional, a young project engineer, new to a trade or a seasoned journeyman, can come to learn more about the industry that we have chosen as our profession. That&#039;s what this platform is about. These courses are meant to be a way for you to increase your knowledge of the construction industry in a variety of cutting edge topics from concrete reinforcing and prestressing, to micro trenching, to safety management systems. These are not meant to be how-to courses. These are meant to be courses that educate you on a construction topic and give you a real understanding of how something works or why its being used. This is also meant to be an unbiased platform that discusses both the advantages and the limitations of the topic being taught. </p><p>This course is a great way for you to increase your knowledge about the material science behind the production of concrete.<strong style=\"\"> </strong></p>", 
    "end_date": null, 
    "title": "Become a Better Construction Manager - Learn About Concrete", 
    "price": "50.00", 
    "instructors": "Jim Rogers", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447022_b350_2.jpg", 
    "course_url": "https://www.udemy.com/concrete101/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T02:50:21Z"
}