{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><em style=\"\">This is the second module of a course (in Dutch), which takes you through the modelling of a small, single-family residential building, from scratch. It follows the <strong style=\"\">Building Information Modelling</strong> (BIM) methodology and uses <strong style=\"\">Graphisoft ArchiCAD</strong>, which is a popular BIM authoring software, available for OSX and Windows.</em></p><p style=\"\">Deze reeks videos is een introductie tot het maken en presenteren van digitale gebouwmodellen met ArchiCAD. Deze werden geconcipieerd en opgenomen door <em style=\"\">Stefan Boeykens</em> en maken gebruik van ArchiCAD 18 NED (de regionale versie van ArchiCAD voor België en Nederland, verdeeld door Kubus). Het grootste deel van de inhoud is bruikbaar met andere taalversies of ook (iets) oudere versies van ArchiCAD.</p><p style=\"\">Deze tweede module bouwt verder op de eerste module en omvat de ontwerpfase “<em style=\"\">UitvoeringsOntwerp</em>&quot;, met de focus op het uitwerken en detailleren van een meer compleet gebouwmodel, zoals uitgewerkt doorheen het ontwerp en voor een bouwvergunning.</p><p style=\"\">Tegelijk wordt ook het palet gereedschappen van ArchiCAD verder verkend.</p><ul style=\"\"><li style=\"\">Er wordt een 3D Model van een kleine, eengezinswoning uitgewerkt. Hoewel alle stappen worden doorlopen, wordt niet iedere modelleerstap voorgedaan.</li><li style=\"\">Er wordt wel een algemene bouwkennis verondersteld en ook een zekere ervaring met algemene grafische software is aanbevolen.</li><li style=\"\">Het ontwerp bevat een aantal bewust gekozen elementen, zoals een deel plat dak en een deel hellend en ook de aansluiting tegen een buurwoning.</li></ul>De eerste module (in een aparte cursus) ging in op het &quot;<em style=\"\">Voor</em><em style=\"\">Ontwerp</em>&quot; en de eerste kennismaking met de ArchiCAD software.", 
    "end_date": null, 
    "title": "BIM met ArchiCAD - Module 2: Uitvoeringsontwerp", 
    "price": "40.00", 
    "instructors": "Stefan Boeykens", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556120_5ab4.jpg", 
    "course_url": "https://www.udemy.com/archicad-module2-uo/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T08:51:54Z"
}