{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Are you looking to work in the BIM profession? Are you in the Architectural, Engineering or Construction field and want to sharpen your BIM skills? A student and want an edge over the competition? This course was developed to give you practice in solving the most common BIM exercises asked by employers.<span> This course has 6+ hours of instruction and assignment focused curriculum. I have also compiled supplementary material from some other amazing instructors who have allowed me to use this content to enhance the course. Unit 01 3D creation for site logistics plans. As a BIM professional, you will be expected to help clients, builders, investors etc. visualize the project and find early hi-level project constraints. <span>The goal of this unit is visualization and constructability, two essential parts to any good construction plan. Unit 02 - 4D You will be expected to help others visualize the construction sequence in detail. Unit 03 - 5D BIM by its definition BIM carries valuable information. Parametric information can inform you with precise quantities and needed values to gain quantity information and ultimately help create estimates and budgets.</span></span> Unit 04 BIM coordination. By far the most notable benefit of BIM is the ability to coordinate building systems before construction begins. This aspect of BIM is often referred to BIM coordination. Please note that this is not a step-by-step course to thoroughly teach you how to use BIM software. This course will teach you how BIM is used in multiple facets to deliver common deliverables requested in the AEC industry. Before enrolling in the course <span>PLEASE WATCH THE COURSE PROMO VIDEO IN ITS ENTIRETY. You may already know the skills taught in the course but have never had a project based assignment to give you the confidence needed to be a great BIM professional. </span><span><span><span></span></span></span></p>", 
    "end_date": null, 
    "title": "BIM Academy- 3D, 4D, 5D Project Skill Builder", 
    "price": "40.00", 
    "instructors": "PJ M. Pena", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642974_96ce.jpg", 
    "course_url": "https://www.udemy.com/bim-universe-bim-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T01:33:42Z"
}