{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h4 style=\"\"><em style=\"\">Aprende paso a paso todos los secretos de las Chimeneas de Leña. </em></h4>  <p style=\"\">  \t        Con este video curso <strong style=\"\">se acabaron los problemas con las Chimeneas</strong>, <strong style=\"\">nunca más tendrás dudas</strong>… Y por supuesto, tendrás <strong style=\"\">la seguridad que tu chimenea va a funcionar correctamente</strong>, pero no sólo eso, sino que aprenderás a <strong style=\"\">mejorar su rendimiento.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Si te identificas con alguna de las siguientes situaciones, <em style=\"\">éste es tu video curso:</em></strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t        - Te exigen que en tu proyecto figuren <strong style=\"\">los croquis y detalles de la chimenea a ejecutar</strong>… y no sabes por dónde empezar.  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Tu cliente te exige</strong> una chimenea de leña <strong style=\"\">que funcione correctamente y con garantías.</strong>  \t</p>  \t<p style=\"\">  \t\t        - Tu obra va con retraso, y ¿<strong style=\"\">no puedes permitirte el lujo</strong>  de <strong style=\"\">que la chimenea no funcione,</strong> menos aún de repararla… o repararlas si es que es una promoción de varias viviendas?  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Has tenido muchos problemas con las chimeneas de leña</strong>, y por nada del mundo te arriesgarías a otro más… <strong style=\"\">Prefieres intentar que tu cliente cambie de opinión, aún a riesgo de disgustarle.</strong>  \t</p>  \t<p style=\"\">  \t\t        - ¿Necesitas proyectar una chimenea de leña, y <strong style=\"\">no tienes tiempo de investigar y estudiar el tema</strong> hasta convertirte en un experto?  \t</p>  \t<p style=\"\">  \t\t        - ¿Tienes <strong style=\"\">dudas sobre la instalación de tiro</strong> para que la chimenea funcione correctamente?  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Ya has llevado a cabo la construcción de una chimenea</strong>, y en aquella ocasión funcionó correctamente, aunque <strong style=\"\">no estás seguro de si volverá a funcionar</strong>.  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">El tiro de tu chimenea no puede salir recto hasta la cubierta</strong>, y no sabes qué decisiones serán las más adecuadas para solucionarlo.  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">¿Tienes miedo de que el humo entre la estancia?</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Tienes que supervisar la obra </strong>en todas las fases de ejecución<strong style=\"\"> de la chimenea, y no sabes si lo que se está llevando a cabo es correcto o no. </strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Has contratado a una empresa especialista en chimeneas, </strong>con la que nunca habías trabajado antes<strong style=\"\">, y te gustaría saber si lo que están llevando a cabo es correcto o no</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Tu cliente ha elegido materiales de un alto valor, y por nada del mundo, te gustaría tener problemas con la chimenea…</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Te ha tocado replantear la chimenea… y en el Proyecto no se definen los detalles para ello.</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Tienes que lanzar el pedido de los materiales, y no sabes muy bien cuáles serán los más adecuados….</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Aparte del tiro y del hogar… ¿Sabrías indicar aparte de éstas,  4 partes importantes en el funcionamiento de una Chimenea de Leña?</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Te han contratado para solucionar las patologías de una chimenea… y no sabes cuál es el problema ni cómo solucionarlo?</strong>  \t</p>  \t<p style=\"\">  \t\t        - Sabes que las chimeneas se calculan en función de los m3 a calefactar<strong style=\"\">, y que sus dimensiones guardan relación entre ellas…. ¿Sabrías calcularlas?</strong>  \t</p>  \t<p style=\"\">  \t\t        - Tienes claro cuál es <strong style=\"\">la mejor ubicación de tu chimenea </strong>dentro de la estancia?  \t</p>  \t<p style=\"\">  \t\t        - ¿Qué sección deberá tener el tiro de tu chimenea? <strong style=\"\">¿Qué hueco debemos dejar previsto en el forjado?</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Llevas bastante tiempo y dinero gastado intentando solucionar</strong> la entrada de humo de esa chimenea. <strong style=\"\">Estás DESESPERADO </strong>y a punto de tirar la toalla y cambiarla por una prefabricada o un insert.  \t</p>  \t<p style=\"\">  \t\t        - Te ha ocurrido alguna vez que<strong style=\"\"> después de hacer un gran trabajo </strong>en el resto de la obra,<strong style=\"\"> resulta que la chimenea de leña no tira, y tu trabajo ha quedado completamente deslucido.</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">Te ha llamado tu cliente, quejándose </strong>que las paredes del hogar de la chimenea se ha agrietado, y no sabes explicarle la causa y peor aún, <strong style=\"\">no sabes solucionarlo</strong>  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">La chimenea no funciona, </strong>sólo cuando se abre la puerta de la calle…  \t</p>  \t<p style=\"\">  \t\t        - <strong style=\"\">¿Crees que un diámetro mejor constituye un mejor tiro? La respuesta es que NO.</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\"></strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\"></strong>  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\">Si te sientes identificado con alguno de estos enunciados, </strong><strong style=\"\">entonces estás en el lugar indicado</strong><strong style=\"\">,</strong><strong style=\"\"> porque yo te enseñaré cómo lograr todas estas cosas y muchas más que más adelante te cuento, pero permíteme antes comentarte cómo está estructurado este Video curso para facilitar tu aprendizaje:</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t<strong style=\"\">1.</strong><strong style=\"\">MÓDULO 1. CONCEPTOS BÁSICOS. </strong>Lo primero que vamos a hacer es conocer exactamente <strong style=\"\">cómo funciona una chimenea por dentro</strong>, si sabemos cómo se comporta el humo por su interior, tendremos gran parte del camino recorrido. <strong style=\"\">Te lo explico además de una forma muy sencilla e intuitiva</strong>, nada de formulaciones, ni teorías farragosas, vamos <strong style=\"\">al grano directamente! </strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">2.</strong><strong style=\"\">MÓDULO 2: Cómo Proyectar una chimenea de leña. </strong>Antes de lanzarnos a diseñar y proyectar nuestra chimenea, tenemos que tomar una serie de decisiones, tenerlas en cuenta pues son importantes, en este segundo Módulo daremos un recorrido por esas cuestiones, e iremos definiéndolas...Tanto <strong style=\"\">para  garantizar su buen funcionamiento, como para mejorar su rendimiento</strong>.  Y sí<strong style=\"\">, </strong><strong style=\"\">también calcularemos nuestra chimenea</strong>, de una forma fácil y rápida…. Ahora <strong style=\"\">con la total tranquilidad de saber que va a funcionar correctamente…</strong>, Es momento de que tu creatividad se ponga en marcha y diseñes esa chimenea… Qué sensación de serenidad y satisfacción, ¿no te parece? Sobre todo, si tienes en cuenta que no sólo tu chimenea va a funcionar correctamente, sino que le sacarás el máximo rendimiento posible… Déjame que te cuente que <strong style=\"\">hay muchas chimeneas que funcionan bien, pero… ¿se les está sacando su máximo rendimiento?</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">3.</strong><strong style=\"\">MÓDULO 3:   CÓMO CONSTRUIR UNA CHIMENEA DE LEÑA </strong>El primer gran paso ya lo hemos dado, pero ahora toca poner el broche de oro, haciendo las cosas bien en obra. Te contaré <strong style=\"\">las técnicas constructivas a aplicar en las Chimeneas de leña</strong>, te hablaré de los<strong style=\"\"> materiales adecuados</strong>, a cada parte… <strong style=\"\">Mejora de Rendimiento, y evitando patologías</strong>, aumentando su durabilidad… <strong style=\"\">Y si el Proyecto que tienes, no define la Chimenea como hubieras querido…, no te preocupes: </strong><strong style=\"\">con este video curso saldrás airoso del reto</strong><strong style=\"\">.</strong><strong style=\"\"> Te lo garantizo, y si no lo consigo, te devuelvo el dinero sin hacerte ninguna pregunta</strong>!!!<strong style=\"\"></strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\"><em style=\"\">4.</em></strong><strong style=\"\">MÓDULO 4: MANTENIMIENTO</strong>.  Seguimos sumando valor a nuestro trabajo, y hablamos de Mantenimiento, <strong style=\"\">es importante que sepamos asesorar al usuario sobre cómo debe realizar el primer encendido, el mantenimiento que debe llevar a cabo, las precauciones y hábitos que debe adquirir para evitar situaciones de riesgo y/o accidentes domésticos</strong>, los utensilios en su manejo y mantenimiento, y por supuesto, hablemos también del <strong style=\"\"><em style=\"\">tipo de leña que mejor rendimiento nos va a dar, qué grado de humedad debe tener y cómo va a afectar éste al rendimiento de la chimenea.</em></strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">5.</strong><strong style=\"\">MÓDULO 5: ANÁLISIS DE PATOLOGÍAS</strong>. <strong style=\"\"><em style=\"\"><u style=\"\">Y para los que no contaron con este video curso cuando ejecutaron la chimenea</u></em></strong>, repasaremos las <strong style=\"\">Patologías más comunes</strong><strong style=\"\">, y sobre todo qué las ha causado</strong> y cómo se pueden arreglar. Aunque ya adelanto que en lo que a Chimeneas de Leña se refiere, la subsanación de la patología pasa por rectificar la parte inadecuada, y esto en la mayoría de las ocasiones, significa demoler esa parte, que lleva consigo la demolición de otras para facilitar su acceso. <strong style=\"\"><em style=\"\">Pero </em></strong><strong style=\"\"><em style=\"\">tranquilos!!,</em></strong><strong style=\"\"><em style=\"\"> en nuestra chimenea esto no se va a dar,</em></strong> porque la habremos ejecutado correctamente. <strong style=\"\">Sin embargo, a lo largo de nuestra carrera tendremos que ayudar a otros </strong>quienes no tuvieron la suerte de contar con este video curso, pero como digo al principio del párrafo, <strong style=\"\">a nosotros </strong><strong style=\"\">nos servirá de repaso a todo lo aprendido</strong>, o bien, si ya estamos embarcados ayudando a otros, pues <strong style=\"\">nos servirá para identificar la causa de esa PATOLOGIA….</strong>  \t</p>  </ul>  <p style=\"\">  \t        Todo el video curso está desarrollado en vídeos, incluso el <strong style=\"\">CÁLCULO DE CHIMENEAS</strong> donde además<strong style=\"\">, podrás descargarte la tabla</strong><strong style=\"\"></strong>que utilizamos y <strong style=\"\">el croquis tipo para identificar cada elemento de dicha tabla</strong>, y que es la base del cálculo de <strong style=\"\">una Chimenea de un solo frente</strong>. Estoy segura de que te va a servir de gran ayuda, además de ser <strong style=\"\"><em style=\"\">uno de los secretos mejor guardados</em></strong>, y que tantos quebraderos de cabeza ocasiona a los profesionales de la construcción.  </p>  <p style=\"\">  \t        Toda la inversión en material didáctico, y sobre todo, en tiempo que he usado para llegar a adquirir estos conocimientos, te la resumo, lo cual también me ha llevado mucho tiempo de estructuración y preparación… Y te lo resumo, por dos grandes motivos: a) Soy consciente de que <strong style=\"\">el tiempo es oro</strong>, y actualmente, <strong style=\"\">todos deseamos disfrutar de más tiempo libre</strong>; b) <strong style=\"\">Si podemos dedicarle un determinado tiempo a aprender algo, por qué dedicarle el doble o más</strong>… sin además perjudicar ni a la calidad, ni a la cantidad de los conocimientos que adquirirás… <strong style=\"\">TAN SÓLO TENDRÁS QUE DEDICARLE 5 HORAS,</strong>y te convertirás en un experto, no habrá problema con tu chimenea en la obra que no puedas resolver. <strong style=\"\"><em style=\"\">Créeme este video curso cobra doble valor:</em>el valor que aportarás, a tu cliente, empresa, y/o a compañeros, con los conocimientos adquiridos, dedicándole el tiempo necesario y ni un minuto más, </strong>salvo que sea ésa tu decisión….Y dos,<strong style=\"\"><em style=\"\"> el tiempo que te ahorrarás en la búsqueda de respuestas concretas a tus dudas, y de soluciones a tus problemas…</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>", 
    "end_date": null, 
    "title": "Cómo Proyectar y Construir Chimeneas de Leña", 
    "price": "45.00", 
    "instructors": "Formación Técnicos Construcción Isaura ARDILA", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240900_d427_2.jpg", 
    "course_url": "https://www.udemy.com/como-proyectar-y-construir-chimeneas-de-lena/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-10T18:05:42Z"
}