{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course (House Plan in AutoCAD (Full project - From A to Z)), the trainer Bassel will teach you, step by step, how to draw a house using <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">advanced techniques</em></strong> which give you the effortlessness, the speediness and the proficiency in drawing process.<br><strong class=\"redactor-inline-converted\">Master house planning step by step with a full house plan project.</strong><br>This course will equip you with the knowledge and the techniques needed in house plan process. At the end of this course, you will be able to draw <em class=\"redactor-inline-converted\">effortlessly </em>and <em>speedily </em>a house (including walls, doors, windows, texts, hatch and dimensions … ). Furthermore, you will be able to solve the most common problems you may face throughout house drawing process.<br>This course is designed for students who are already familiar with AutoCAD. To acquire the largest amount of knowledge, if you do <strong class=\"redactor-inline-converted\">NOT</strong> know anything in AutoCAD, you need a basics course before attending this course.</p>\n\n<p><strong>Now, I am working on additional lessons (Electrical Plan and Layout), so please keep following to get advantage of them.</strong></p>", 
    "end_date": null, 
    "title": "House Plan in AutoCAD (Full project - From A to Z)", 
    "price": "20.00", 
    "instructors": "Bassel Diban", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/871768_0abe_3.jpg", 
    "course_url": "https://www.udemy.com/house-plan-in-autocad-full-project-from-a-to-z/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-07T21:21:09Z"
}