{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong></strong>Welcome to the Introduction to Structural Reinforced Concrete in 1 Hour course where you will learn about the fundamental properties of reinforced concrete, one of the most commonly used materials on this planet.</p>\n\n<p>My name is Abdul, and I will be leading you through this course.  I began my career as a structural engineer in the offshore and subsea oil and gas industry.  After 5 years of structural engineering, I have transitioned to developing a platform for engineering content.  I am currently the founder of Engineering Examples.  See website below.</p>\n\n\n\n\n\n<p>By the end of the course, you’ll be able to identify the advantages and disadvantages of reinforced concrete, calculate various mechanical properties such as as the tensile and flexural strength of concrete according to the American Concrete Institute Code 318-11, and learn about how steel is used to improve the performance of reinforced concrete. </p>\n\n\n\n\n\n<p>There are 36 lectures within this course.  They have been prepared in the most clear and concise manner possible in order to avoid overwhelming students. We start from the basics of what is reinforced concrete all the way to covering how steel is incorporated within a concrete member.  Each lecture builds slowly on top of what you have already learned.  This course should take 1-2 weeks to complete.</p>\n\n\n\n\n\n<p>This course is ideal for architects, engineers, construction professionals, and anyone else who wants to learn more about reinforced concrete.  </p>\n\n\n\n\n\n<p>This course is also great for college or university students looking to work in architecture, engineering, or construction. </p>\n\n\n\n<p>Feel free to look through the course description and I look forward to seeing you inside.</p>", 
    "end_date": null, 
    "title": "Introduction to Structural Reinforced Concrete in 1 Hour!", 
    "price": "20.00", 
    "instructors": "Abdul Siraj", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/840770_95c8_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-structural-reinforced-concrete/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-05T20:56:36Z"
}