{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this<strong> Project Based Autodesk AutoCAD 2016 instructional course</strong>, CAD Certified Na'Shawn Jordan, will walk you through the steps you need to know in order to create superb 2D drawings. We will be using the latest AutoCAD software to help you stay current with today's trends while reinforcing skills and commands that were learned in previous versions. This course is aimed at developing the skills of a complete beginner with no experience in AutoCAD to a create a more rounded CAD individual. <br><br></p><p>You will begin your journeying by learning basic concepts familiar to the program and 2D drafting creation, then launch towards our projects in a similar sense that happens in some Architectural studios. Having an<strong> Architectural background</strong> has allowed me to learn an intimate amount of knowledge with the program and gaining both a certification and an Architectural degree has shown me the programs and skills needed to stay competitive while looking superbly drawn. Together <strong>we'll continue learn the tips and tricks</strong> I've learned after years of education to familiarize yourself with how the program works, the model space, and commands that are critical to the design process.<strong> This Project Based Course aims towards creating real world objects</strong> such as buildings, windows and shutters, and more all while learning the program along the way. I look forward to showing you how you can use the coordinate system, using guidelines, and objects snaps all to your benefit. Projects and lectures will be added in accordance to the questions asked and challenges presents as well as projects that allow a great amount of skills to be gained to the students. I look forward to seeing you in class.</p><p>Once you have finished this computer aided design training course, you will be capable of using AutoCAD 2016 to create your very own unique 2D drawings. Working files are included, allowing you to follow along throughout the lessons.</p>", 
    "end_date": null, 
    "title": "Learning Autodesk AutoCAD 2016: The Basics of Design", 
    "price": "45.00", 
    "instructors": "Na'Shawn Jordan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676186_fb07.jpg", 
    "course_url": "https://www.udemy.com/autocadbasics/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T05:09:24Z"
}