{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t           Welcome to 3DTraining.com&#039;s <a href=\"http://www.3dtraining.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\"></a> Quick Start Video Series: If you are a beginner or industry professional new to Autodesk Revit these videos will give you a quick overview of the software to help you decide if you seriously want to pursue a career in 3D.  </p>  <p>  \t           In this project-based course you will learn:  </p>  <p>  \t           ·Autodesk Revit&#039;s Core Interface and Navigation  </p>  <p>  \t           ·Introduction to Revit&#039;s unique Project Workflow  </p>  <p>  \t           ·Design an organic shaped building using massing tools  </p>  <p>  \t           After this course, you will have created your own basic building that walks you through step by step how to work on a project from start to finish such as basic massing, editing a mass and converting a mass to a useable product.  </p>  <p>  \t           Included in this course is a link to download the 30 day trial version of Revit (Courtesy of Autodesk) and approx 60 minutes of training video provided by 3DTraining.com. The average student will complete this course in approximately 2-4 hours.  </p>  <p>  \t           And if you enjoy your experience working in the software and you are interested in professional training to find work in this field visit our site and sign up for a free one hour intro class for more information.  </p>  <p>  \t           Also when you visit our site, don&#039;t forget to check out our company news<a href=\"http://3dtraining.com/asp/about_company_news.aspx\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\"></a> page to see how the 3DTraining.com unique training methodology has helped our students launch a successful career in the 3D industry.  </p>", 
    "end_date": null, 
    "title": "Mass Building using Autodesk Revit", 
    "price": 0, 
    "instructors": "3DTraining .com", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234386_eecb_6.jpg", 
    "course_url": "https://www.udemy.com/revit_3dtraining_quickstart/", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-31T01:10:31Z"
}