{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Concrete is the most widely used building material in the world. In addition to understanding concrete, today&#039;s construction professional needs to understand the principles of concrete reinforcing and how prestressed concrete works. This includes both pre-tensioned concrete that is typically manufactured in a precast plant, and post-tensioned concrete that is cast-in-place. Post-tensioned concrete is being used more and more throughout the world to build multi-story structures, slabs-on-ground, and bridges, while precast prestressed concrete continues to be used in rapidly built structures like parking garages. Understanding how and why reinforcing and prestressing works in a concrete structure. </p><p style=\"\"><strong style=\"\">Gain a better understanding of the principle and theory behind concrete reinforcing and prestressing to help you be a better construction management professional. </strong></p><p style=\"\">After completing this course you will be able to...</p><ul style=\"\"><li style=\"\">Explain the meaning of passive reinforcing versus active reinforcing and list examples of each</li><li style=\"\">Discuss the effects of adding rebar to a concrete element</li><li style=\"\"><span style=\"\"></span>Explain how the change in location of the rebar within the concrete effects its performance</li><li style=\"\"><span style=\"\"></span>List advantages of prestressed concrete</li><li style=\"\"><span style=\"\"></span>Describe the difference between pre-tensioned and post-tensioned reinforcing</li><li style=\"\">Describe the precast concrete process</li><li style=\"\">Explain how post-tensioned concrete works</li><li style=\"\">List common examples of prestressed concrete structures</li></ul><p style=\"\"><strong style=\"\">Learn from a professional</strong></p><p style=\"\">My courses have been created as a place where everyone, whether you are an experienced professional, a young project engineer, new to a trade or a seasoned journeyman, can come to learn more about the industry that we have chosen as our profession. That&#039;s what this platform is about. These courses are meant to be a way for you to increase your knowledge of the construction industry in a variety of cutting edge topics from concrete reinforcing and prestressing, to micro trenching, to safety management systems. This is not a course that teaches you how to install rebar or prestressing steel. It is a course that educates you on why we reinforce concrete and how it works. This is information you need as a construction professional in order to talk to designers, owners and subcontractors. </p><p style=\"\">This course is a great way for you to increase your knowledge about concrete reinforcing and prestressing. </p>", 
    "end_date": null, 
    "title": "Reinforced & Prestressed Concrete for Construction Managers", 
    "price": "20.00", 
    "instructors": "Jim Rogers", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455744_a719_9.jpg", 
    "course_url": "https://www.udemy.com/reinforcing-prestressing/", 
    "currency": "USD", 
    "subject_name": [
        "Architectural Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T13:56:20Z"
}