{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  This course is for the first-timer headed to France or an experienced traveler who wants to brush up on the basics. It is comprised of a list of 25 expressions that are indispensable for communicating with the French, as well as pronunciation tips.  Additionally, cultural insights are shared and explained in a clear and thorough manner.  </p>  <p>  \t  The course itself caters to auditory and visual learners as each lecture is written out on a slide and explained orally.  Quizzes are given at the end of each section to ensure understanding, and the student is also provided with vocabulary guides and links to articles that will encourage him think critically about his own culture as well as the French culture.  </p>  <p>  \t  It will take about 2.5 hours to complete the lecture portion of this course, and an extra hour to complete the recommended reading given in the lists at the end of each section.  </p>  <p>  \t  This course explains each expression carefully (each expression is a complete lecture) and sets the expression in context.  </p>  <p>  \t  You should take this course if you are apprehensive about your upcoming trip to France!  This course will give you basic conversational knowledge of the French language, a confidence boost, and a heads-up on cultural differences.  </p>  <p>  \tIt would also benefit you if you have been to France before but want to really nail down the basic expressions needed for a return trip.  </p>", 
    "end_date": null, 
    "title": "25 Essential French Expressions for Your Trip to France", 
    "price": "30.00", 
    "instructors": "Mme Gabrielle Sweets", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267380_e3d4_3.jpg", 
    "course_url": "https://www.udemy.com/25-essential-expressions-for-traveling-in-france/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T14:54:27Z"
}