{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Have you considered learning French, or do you want to brush up on your French? \"An Intro to Learning French Through Stories and Conversation\" will introduce you to the basic linguistic tools to <strong>take the next step on your French journey</strong>. This course teaches French primarily through the story <strong>\"Le petit bonhomme de pain d'épices\" (The Gingerbread Man) </strong>and <strong>conversation</strong>, which is how our brains naturally learn languages. It is designed for <strong>beginners </strong>or for those who want to <strong>freshen up </strong>their French.</p><p>If you want to learn how to actually <strong>use the language</strong> without having to memorize a bunch of grammar, then this course is for you.</p><p>For each section of the story I have included:</p><ul><li>The important vocabulary (presented in chunks for better understanding of the language structures)</li><li>Quizlet and Memrise vocabulary activities (for various ways of practicing and playing with the vocabulary)</li><li>The story in French and English in the present tense.</li><li>Conversation questions with example answers (to make personal connections to the text and to practice with a partner)</li><li>Textivate activites (to work more with the chapter summary text)</li><li>A quiz (to check for comprehension of the story)</li></ul><p>After completing this course you will be able to <strong>understand </strong>and <strong>use </strong>some basic high-frequency French which will <strong>open doors</strong> to French conversation, travel, culture, and true joie de vivre.</p><p><strong>Enroll now for free </strong>to take the first step on your French learning journey!</p>", 
    "end_date": null, 
    "title": "An Intro to Learning French Through Stories & Conversation", 
    "price": 0, 
    "instructors": "Bryan Whitney", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689134_0c77_2.jpg", 
    "course_url": "https://www.udemy.com/an-intro-to-learning-french-through-stories-conversation/", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T19:49:36Z"
}