{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">**Course Updated: May, 2016** From the creators of the Conversational Spanish Made Easy course.</strong></p>\n\n<p>Have you tried to learn French before and simply lost interest and motivation along the way?<br></p>\n\n\n\n\n\n<p>Have you visited a French speaking country and wished you had been able to communicate with the locals in their own language?</p>\n\n\n\n\n\n<p>If so, the \"Conversational French Made Easy\" course, will give you the tools to communicate effectively in a large number of common situations when traveling to French-speaking countries or with French speakers in your own country.</p>\n\n\n\n\n\n<p>This course takes you from simple words for greeting and meeting new people to understanding others and expressing your needs and wants effectively.</p>\n\n\n\n\n\n<p>More and more students are benefiting from learning with a method that makes learning French a fun and rewarding experience.</p>\n\n\n\n\n\n<p>---------------------------------------------------------------------------------------------------</p><p><strong class=\"redactor-inline-converted\">How have we accomplished this?</strong></p>\n\n\n\n\n\n<p>This course focuses on frequently used vocabulary that you would find in everyday conversations among native French speakers.</p>\n\n\n\n\n\n<p>Instead of focusing and bombarding you with grammar concepts and lingo, we focus on useful phrases and sentences that you can start using from day one.</p>\n\n\n\n\n\n<p>We've been able to design a course that will have you speaking French with native speakers in no time. Join our community of over 1,000 students and start speaking French today!</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This is what some of our students are saying:<br></strong></p><p>\"This course is extremely helpful in developing basic conversation skills. I can't wait to become proficient enough to put everything to use!\"<br></p><p>\"The instructor is amazing! This course is well organized and it explains the most important details of what it takes to learn french!\"<br></p><p><strong class=\"redactor-inline-converted\">Course Highlights:</strong></p><p><strong class=\"redactor-inline-converted\">Overview</strong></p>\n\n\n\n\n\n<p>You will learn essential conversational French in a number of common situations. Starting with simple vocabulary that you can use when meeting people, to more complex vocabulary and phrases that will allow you to order food, follow directions and other important skills, essential for successfully communicating with French speakers.</p>\n\n\n\n\n\n<p>In addition to the video lectures, practice videos and quizzes, you will have access to ready-to-print PDF's that you can review in your free time to help you keep your conversational French skills fresh.</p>\n\n\n\n\n\n<p>Join our French-learning community, and don't hesitate to ask if you have questions.</p>\n\n\n\n\n\n<p>Remember, all Udemy courses come with a 30-day money back guarantee. Sign up and start learning French today! See you inside the course!</p>", 
    "end_date": null, 
    "title": "Conversational French Made Easy", 
    "price": "20.00", 
    "instructors": "Esteban Perez Rodriguez", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582720_baeb_3.jpg", 
    "course_url": "https://www.udemy.com/conversational-french-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T05:00:05Z"
}