{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\"> This course is dedicated to spoken French, the goal of this course is to prepare you to speak French with natives.</p><p style=\"\">Why the classical French course is not enough?</p><p style=\"\">The French language is famous for its graceful and beautiful pronunciation, however, in writing long complex grammar constructions abound. French natives tend to make their speech as rapid and as simple as possible, so they literally “shorten\" words and phrases. This approach is so widely used that in outcome the real spoken French is very different from the written. In case you learn the language being outside France and having no practice with the natives, you risk to be surprised not in a nice way once you come here. Even if your level French is good, you will unfortunately struggle with understanding the French people. It will stop you from feeling confident and comfortable to carry a very ordinal conversation. You will be forced to spend more time and take more efforts to learn the missing vocabulary and structures. </p><p style=\"\">If the reason why you learn French is to communicate with French people, if you plan to come to France and want to start instantly speaking to the French, this course is perfect for you! It is simple and focuses on grammar constructions and vocabulary used the most by French in their daily speech. It includes everything you need from contractions and “liaisons\" to slang and common sayings.</p><p style=\"\">The course was created to make your integration in France smooth, easy and pleasant! </p><p style=\"\">You will be ready to talk, have a great experience and be in touch with French people!</p><p style=\"\">It is the complete tutorial of French used in a daily conversation. After completing the course you will be able to understand the features of spoken French and be ready to come to France and meet French people!</p><p style=\"\">The course is the first of its kind: it teaches you the real French.</p><p style=\"\">Get ready to bring your French on a new level!</p>", 
    "end_date": null, 
    "title": "Discover and learn spoken French to sound like the natives", 
    "price": "20.00", 
    "instructors": "Spoken French", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532326_3bec_3.jpg", 
    "course_url": "https://www.udemy.com/french-for-beginners-with-spokenfrench/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T16:45:00Z"
}