{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>This is a French grammar course for complete beginners. Learn how to speak beautiful and correct French with easy explanations and examples of all the grammar you&#039;ll need for your first year of French.</p><p><strong style=\"\">Eliminate embarrassing errors in your French study with a friendly, informal tutor</strong><br style=\"\"></p><ul style=\"\"><li>Discover how to work out the gender of any French word in seconds</li><li>Learn the three verb groups and how to speak in present, past and future tense</li><li>Master descriptions in French with an adjective guide and video quiz</li><li>Test yourself in quizzes throughout the course so you always know you&#039;re making progress</li><li>Create French statements and questions more easily than ever</li></ul><p>French is a leading world language spoken by millions of people all over the world. Discover the language of this wonderful country and open the door to culture, travel and food from the French-speaking world. Instead of teaching you through a dull book, this course is developed to introduce French grammar as a real, living thing that is used in lots of real sentences. I am an experienced teacher of languages and work with adult learners who study this language for business, life and travel.</p><p>Through this Udemy course, you will</p><ul style=\"\"><li>watch friendly videos from online tutor Kerstin, helping you eliminate fear and embarrassment</li><li>follow up all lectures with live discussions and worksheets so you can be sure that you have understood everything correctly</li><li>discover pronunciation and grammar examples to start you speaking French fluently and confidently</li><li>get easy English explanations so you can know and remember rules you&#039;ll need for speaking French</li><li>measure your progress and feel so confident about speaking French that you might just go and finally talk to someone</li></ul><div style=\"\"><strong style=\"\">By the end of this course, I promise that you will gain a new understanding and confidence of French grammar and eliminate 80% of the most common mistakes.</strong><br style=\"\"></div>", 
    "end_date": null, 
    "title": "Easy French Grammar for Complete Beginners", 
    "price": "25.00", 
    "instructors": "Kerstin Hammes Cable", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140844_a9f0_5.jpg", 
    "course_url": "https://www.udemy.com/french-grammar-for-beginners-level-a1/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-02T13:27:55Z"
}