{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">French Level 2 is the second part to the introductory French course. Learners will be learn ways to make more complex sentences and be introduced to the past tense. By the end of the course, successful learners will be able to build more complex sentences, respond to spoken questions with more precision, and be able to talk about events in the past, present, and future. The only prerequisite for this course is to have taken French Level 1 OR be able to ask questions and introduce oneself in French.</p><p style=\"\">This course is comprised of video lectures and learning activities (quizzes) to help solidify your learning. </p><p style=\"\">French is one of the most widely spoken languages in the world and is the official languages of countries all across the world. Learning a second language will make you more marketable for future employment. Being able to speak a second language will make travelling easier as well. There are also a number of cognitive benefits to learning a second language. Some studies suggest that learning a second language is a great way to keep your mind in shape. </p><p style=\"\">It is recommended that learners focus on one lesson per week. Thus, ideally, the course should take each learner about 9 weeks to complete. Learners are able to progress at their own speed and are able to finish the course before or after the 9 week suggested period. </p><p style=\"\">This course is a self-directed course and the instructor is present to act as a guide to foster learning and answer any questions that the learner may have. This format allows more convenience for the learner to progress at their own speed.</p>", 
    "end_date": null, 
    "title": "French Level 2: Building Blocks of French", 
    "price": "20.00", 
    "instructors": "Dillon March", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332758_2543_4.jpg", 
    "course_url": "https://www.udemy.com/frenchtwo/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T16:50:44Z"
}