{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t                This course teaches you the <strong>basics of the French language</strong>.  </p>  <p>  \t                It is meant for persons with <strong>little or no knowledge of French</strong>. This course is<strong> video based</strong> and taught by Julie, a <strong>bilingual speaker</strong> who is a<strong> native and experienced French teacher</strong>.  </p>  <ul>  \t<li>over 2.5 hours of content including videos, quizzes and printable documents such as vocabulary sheets</li>  \t<li>progressive &amp; comprehensive learning conducted in English</li>  \t<li>additional notes within the videos for a better understanding</li>  \t<li>exclusive bloopers for your enjoyment</li>  \t<li>next levels are in the making</li>  </ul>  <p>  \t<span>Absolute beginners as well as people getting started with the French language will learn a lot with this <strong>easy-to-follow French course</strong>. It will also be very beneficial for people planning a short trip to France or to any other French-speaking country.</span>  </p>  <p>  \tLearning French with Julie is <strong>fun, pleasant and effective</strong>. Julie has taught thousands of students of all ages in private and group settings, and has received <strong>extremely positive feedback</strong> from them.  </p>  <p>  \tTopics covered in this introductory course are the French letters, French numbers, conjugation basics, asking and giving directions, introducing yourself (asking and telling your age, nationality, profession, etc), genders (feminine and masculine), quantity (singular and plural), pronunciation (accents, stressing, tips...), giving the time in French and more !  </p>  <p>  \tOne of the many perks of this course are the <strong>short videos in between sections</strong> that put to use the vocabulary and rules covered in the previous lessons. This way you can put yourself in real-life situations and test your understanding of native speakers. Not to worry, the short movies are always played twice and come with subtitles the second time !  </p>  <p>  \tLast but not least, we have included bloopers at the very end of this course for you to laugh with us. Learning French is no easy task, one must put time and effort to learn and eventually master the language, but you MUST keep in mind that<strong> it has to remain a FUN experience</strong>. Enjoying learning is the key to staying motivated and progressing efficiently.  </p>  <p>  \tReady ? C&#039;est parti !  </p>", 
    "end_date": null, 
    "title": "French for Beginners : Level 1", 
    "price": "40.00", 
    "instructors": "French Toast", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/293814_7732_4.jpg", 
    "course_url": "https://www.udemy.com/french-for-beginner-course-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-04T12:30:31Z"
}