{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t               Learning the French tenses can be time consuming and, unfortunately, rather boring if you follow the 'traditional' methods. Enroll in this course and I will help you master the 10 <strong>most important</strong> tenses in the <strong>fastest</strong> and <strong>most efficient</strong> way possible by learning <strong>how each tense is formed</strong>, <strong>when it is used</strong> and, to make it even simpler to remember, <strong>what the English equivalent is</strong>!  </p>\n\n<p>  \t<em>Content Last Updated: <em><strong>May</strong><em><strong> 2016</strong></em></em><em><strong></strong></em></em></p>\n\n<p>  \t    Over 3,900 students are already profiting from this course!  </p>\n\n<p>  \t              -------------------------------------------------------------------------------------------------------------------</p>\n\n<p>  \t        See what my current students have to say:  </p>\n\n<p>  \t<em>\"This course is an excellent tool to anyone learning French\" </em>- Audry Candida Da Silva Wickham  </p>\n\n<p>  \t        \"This course is presented in a direct, easy to learn manner. I expected to master the 10 main tenses fast, and that is exactly what I learn from this course. <em>Highly recommended!\" </em>- Michael Lim  </p>\n\n<p>  \t<em>\"A nice summary of the different French tenses. Very handy for someone wanting to delve into the language more deeply.\" - </em>David Khoury  </p>\n\n<p>  \t        -------------------------------------------------------------------------------------------------------------------</p>\n\n<p>  \t               Work your way through the tenses in <strong>easy-to-follow lectures</strong>, then test what you have learned at the end of each section - as a professional languages teacher and tutor my experience has shown time and time again that by revising our learning after <strong>short bursts</strong> we are able to remember information <strong>MUCH</strong> more effectively!  </p>\n\n<p>  \t        Enroll in this course today and it is <strong>GUARANTEED</strong> to help your knowledge and understanding of the French tenses. Whether you are taking your exams, finals or are just brushing up on your already-developed language skills then this course <strong>WILL</strong> help! Don't forget, you are covered by a MASSIVE 30-day no-quibble money back guarantee, so if you don't love the course then you can get a refund with no questions asked!  </p>\n\n<p>  \t               I am always here to take questions and I will <strong>ALWAYS</strong> respond to you. I already teach <strong>OVER 5,900 HAPPY STUDENTS</strong> on my <strong>Learn to Speak: Conversational French</strong> course at Udemy. The Conversational French course is great for improving your spoken <strong>French</strong>, and would work brilliantly alongside the Tenses course.  </p>", 
    "end_date": null, 
    "title": "French Tenses Simplified: Master the 10 Main Tenses Quickly!", 
    "price": "20.00", 
    "instructors": "Scott McElroy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226468_1e22_4.jpg", 
    "course_url": "https://www.udemy.com/frenchtensemastery/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T18:05:44Z"
}