{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><em><strong>Join the almost </strong><strong>500 people that signed up within the first three days</strong><strong class=\"redactor-inline-converted\"><br></strong></em></p>\n\n<p>Learning French takes a lot of time and dedication. You need to practice the skills you have, and grow the ones you don't. Once you're ready to move beyond the basics, there is a huge gap between being able to understand a single sentence, and being able to participate in genuine French media like movies, TV shows, articles and books. For those of you who have learned the basics, and want to learn more, striving towards that ultimate goal of fluency, you may be asking yourself the question what now? You've learned all that your previous courses have had to offer, but you still need some help. Where can you go to get this? How do you reach the next level? What can you do? </p>\n\n<p>Well this is at least a bit of a sales pitch, so you probably know what I'm going to say. You probably know that I believe that this course is your answer. I do believe that this is true, just let me explain myself a little so that you can too. What you need is a story, you need it to be read to you in french so you can practice your listening skills. You'll also need some help, including some translations from time to time, and maybe even some in depth explanations at times, because you know that direct translation doesn't always work. Understanding a foreign language at a high level is hard, so you need to hear things multiple times. I know it is easy to be overwhelmed, so let's not go over too much information at a time.Then finally how are you going to know for sure that you understood everything if you aren't tested on it, and it can be so frustrating to move on before you're ready and be left behind. If you're with me so far, then this course will be a great fit for you. </p>\n\n\n\n\n\n\n\n<p>This course will do all these things, and at the end you will not only get your standard Udemy Certificate, but a solid sense of accomplishment, because you will have conquered an entire narrative in French, something not a lot of students get to the level of doing. Whether it's your first or your fiftieth, it is still an accomplishment to be proud of. </p>\n\n\n\n\n\n\n\n<p>The story itself is completely different from other stories you will find in this series. This story is called \"La Bonne Petite Souris\". It is a fast paced story about two waring kingdoms, their rulers, fighting, love, hate, suffering, redemption, magic and of course one particular little mouse who despite his size, accomplishes much, and constantly surprises us, the only way to find out how...is to take a chance, and enroll in this here course. What are you waiting for?! Your French isn't going to improve itself!  <br></p>", 
    "end_date": null, 
    "title": "Improve your French with Stories: La Bonne Petite Souris", 
    "price": "20.00", 
    "instructors": "Jeffrey Rudolph", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857094_91cc_3.jpg", 
    "course_url": "https://www.udemy.com/la-bonne-petite-souris/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T03:03:33Z"
}