{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>So you’ve completed an introductory or even intermediate French course, now what? Sure you know a few words and phrases, but you are a far cry from being able to competently use your skills in conversation. Now comes the daunting task of climbing the ever imposing mount fluency, and the hardest question to ask is simply where to start. It is easy to get ahold of French newspapers and books, but you know that you aren’t ready for that unaided. Maybe you have even tried and ended up giving up because you it was too much too soon. You’re standing at a cross roads, and maybe, just maybe this course can help. </p>    <p>This course is there for those of you who have taken some French before, and want to improve your skills. It is for those of you who are ready for their first story, or have seen a few, but would like some help getting to the next level. I’m not going to assume that you can just read a text and instantly understand what is going on. If you did, you wouldn’t need this course, so we are going to take it nice and slow. Here, the story has been broken down into small easy to digest sections, about 4 minutes long, so you don’t get overwhelmed. And then through this course you are not simply going to have the story read to you and then be expected to nod your head and move on. So within each piece of the narrative, you will learn from a number of different steps that you will take.</p>    <p>First you will get a set of vocabulary words, not a ton of them and only the ones that pertain to the section of the story you are about to read. </p>    <p>Then you will read the story the first time. Of course you aren’t alone, and there will also accompanying audio to follow along with. Here each sentence that of the story that is given will have its English translation on screen as well. So if there is a word that wasn’t in the vocabulary that you didn’t know, it will be right there for you, or if a particular sentence is hard for you to understand, you can easily find its English counterpart. </p>    <p>In the next section you will be aided further, because it won’t be assumed that just the English translation is enough for you. Here many of the sentences that may have tripped you up are explained in detail so you can start to understand French even when it doesn’t translate directly into English. </p>    <p>For the final section you are going to see the same section again, and this time you will have already seen all of it, and even gone in depth with some of the trickier sentences that appeared. This final repetition should give you confidence in knowing that here is an entire section of a story all in French and you understand every word of it. </p>    <p>And as you have gotten this far, I have one final note on the story itself that you will be reading. It is a French fairy tale. It was originally written in French and then translated into English. I hope that by now you are at least a little excited at the prospect of being able to work your way through your own French story. Take a look at the previews, as the entire first section is free so you can get a feel for what is in store for you.</p>", 
    "end_date": null, 
    "title": "Improve your French fluency and comprehension with stories", 
    "price": 0, 
    "instructors": "Jeffrey Rudolph", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606590_bb1c_2.jpg", 
    "course_url": "https://www.udemy.com/improve-your-french-fluency-and-comprehension-with-stories/", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T02:26:43Z"
}