{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>If you've tried learning French before and haven't succeeded, well this course is for you.</p><p>There is nothing as thrilling as being able to visit another country and communicate with the locals in their own language. Well, now you can experience that amazing feeling too!</p><p>This course gives tried and tested, high quality French tuition broken down into 9 easy lessons. You'll go from a complete beginner to speaking more of the language than somebody who has been studying it for years!\t           </p><p>This is the first part of my French level 1 courses and is suitable for everybody, no matter what your starting level. I wrote the course assuming you know absolutely nothing about the French language. Even if you've studied the language before, I recommend you commence with this course, as you will definitely learn things you didn't know before.\t           </p><p>This course gives you a very useful base vocabulary and shows you how to build your own sentences to impress the locals when you're on holiday abroad. </p><p>You'll not only get video tutorials, but you'll also get videos where you can practise what you've learnt, videos giving you useful learning techniques and a range of downloadable PDFs that will give you an enormous vocabulary as well as a set of reference sheets explaining the more complex ideas.</p>", 
    "end_date": null, 
    "title": "Learn Fantastic French with Kieran - Level 1 - Part 1", 
    "price": "20.00", 
    "instructors": "Learn with Kieran", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786294_53b7_2.jpg", 
    "course_url": "https://www.udemy.com/learn-fantastic-french-with-kieran-level-1-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T16:57:15Z"
}