{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t                         The course is designed to help <strong>everyone</strong> from the <em>ab initio</em> stage - those who have never learned French before - to those wanting to brush up in preparation for an upcoming holiday or business trip. The course is <strong>audio based</strong> using a bilingual speaker (myself) and it will be supported with on-screen transcripts for easier learning and better retention. There are also <strong>printable vocabulary guides</strong> to take with you wherever you go!  </p>\n\n<p>  \t<em>Latest Update: <strong>May</strong><em><strong> 2016</strong></em></em>  </p>\n\n<p>  \t          Over 8,100 students have already enrolled and are profiting from this course!  </p>\n\n<p>  \t                  -----------------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t<strong>Just look at what my students have to say!</strong>  </p>\n\n<p>  \t<em>'Each lecture gives so much detail, without it sounding too overwhelming. It really is a must have for mastering a good, solid foundation of spoken French! It's good to keep referring to various modules as you like. Very well presented, likeable tutor, easy to follow online course. 5/5!'   </em>Catherine Holder  </p>\n\n<p>  \t<em>'Having been to college to learn French and spent lots of cash on books, this has to be the easiest course by far. Navigation of the online content is both enjoyable and simple. The ability to access the course when you want makes my first foray into online learning a joy. many thanks this is the helping hand I needed.' </em>  Frank Phipps  </p>\n\n<p>  \t<em>'The BEST thing about this course (apart from it being really helpful!) is that the content is up to date and contemporary. My classes (I am a French teacher) sometimes have to learn from outdated text books but the language in this course is modern, fresh and above all it is USABLE! Thank you for your hard work!'</em>    Charlize Afolayan  </p>\n\n<p>  \t<em>'This course has made learning French so accessible and easy that I can actually feel myself progressing. Honestly, you won't regret signing up!'</em>    James Marsh  </p>\n\n<p>  \t                  -----------------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t                         The course is designed as an easy access into the world of French and has been laid out in such a way that students can <strong>go at their own pace</strong>. Don't forget, you are covered by a MASSIVE 30-day no-quibble money back guarantee, so if you don't love the course then you can get a refund with no questions asked!  </p>\n\n<p>  \t                         If you have always been fascinated by people who speak another language and want to pursue it as a hobby, or you simply need to brush up on your <strong>spoken French</strong> before you head off on a trip, this course will help you to achieve your goals and <strong>open up new avenues</strong> and experiences for years to come!  </p>", 
    "end_date": null, 
    "title": "Learn to Speak: Conversational French - Full Course", 
    "price": "20.00", 
    "instructors": "Scott McElroy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86480_ee82_10.jpg", 
    "course_url": "https://www.udemy.com/learnfrench/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-31T17:42:14Z"
}