{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t  Welcome to part 1 of this short French language course that is designed to help you with the basic understanding of French culture, while being able to learn key vocabulary topics specifically for a corporate environment, yet still giving you the basics of everyday French language.  </p>  <p style=\"\">  \t   Whether you wish to simply travel to France for a short vacation or have ambitions to do business in France, this course will give you the basic step by step guide on how to do this in a professional manner.  </p>  <p style=\"\">  \t   Throughout the course sections you will learn key phrases each containing an image that will explain the english and french translations in a easy format.  </p>  <p style=\"\">  \t   Once you have a basic understanding of the phrases the course will then introduce you to conversational situations that will allow you to use those key phrases to form structured sentences at the appropriate time.  </p>  <p style=\"\">  \t <strong style=\"\">The content to be covered in this course will be the following;</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Etiquettes in French culture</li>  \t<li style=\"\">Greetings</li>  \t<li style=\"\">Introducing yourself</li>  \t<li style=\"\">Wishing someone something</li>  \t<li style=\"\">Misunderstandings</li>  \t<li style=\"\">General assistance</li>  \t<li style=\"\">Booking a hotel room</li>  \t<li style=\"\">Ordering in a restaurant</li>  </ul>  <p style=\"\">  \t   The course offers:  </p>  <ul style=\"\">  \t<li style=\"\">Easy to learn conversational French real-life situations, such as: meeting new clients, booking a hotel room, ordering food at a restaurant, asking for directions and much more.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">As an extra bonus we’ve created ready-to-print pdf’s that you can review in your free time to help you keep your French skills fresh.</li>  </ul>  <p style=\"\">  \t   So, for now, sit back and indulge yourself into the French language and French culture!  </p>", 
    "end_date": null, 
    "title": "Learn French For Business & Leisure", 
    "price": "20.00", 
    "instructors": "Laure James", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/150914_e946_2.jpg", 
    "course_url": "https://www.udemy.com/learn-french/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-22T17:38:32Z"
}