{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>If you have reached this page, you probably want to learn French, not English! Bonne nouvelle, this course is <strong>100% in French</strong>, mostly with videos, created and presented by Anne Le Grand, an experienced native teacher.<br></p><p>Whatever your objective or level in French, <strong>mastering the past tenses is vital </strong>to communicate.</p><p>In this course you will learn how to use the 3 main past tenses in French:<strong> the imperfect, the passé-composé and the plus-que-parfait.</strong> You will be able to evoke memories, speak about work experiences and understand news stories, or just express past events accurately.</p><p><strong>Master each tense individually in context and learn how to use them together in this French immersive course.</strong></p><ul><li>Course <strong>100% in French with French subtitles</strong></li><li>Coherent and comprehensive teaching <strong>method Based on Common European Framework of Reference for Languages</strong></li><li>Designed for students from <strong>A2 to B2</strong> levels (lower-intermediate to advanced level)</li><li>Clear explanations with experienced native teacher</li><li><strong>48 lectures and dozens of quizzes</strong> to practice with real life examples</li><li>Validate your knowledge with quizzes</li><li>All videos available in HD</li></ul><p><strong>Feel free to watch the introduction section and the free video previews to see how the course is structured.</strong></p><p>Each section covers a specific use of the past in French and allows you to easily develop the four basic linguistic abilities: listening, speaking, reading and writing.</p><p><strong>Introduction:</strong> I will present you the key points of the section in a short video (free preview)</p><p><strong>Grammar lecture:</strong> learn and practice a specific grammar function with talking head videos and quizzes, to speed up and consolidate the process of learning French grammar</p><p><strong>Listening comprehension lecture:</strong> listen to an audio recording focusing on the section's grammar point and validate your understanding with a quiz.</p><p><strong>Reading comprehension lecture:</strong> read a text focusing on the section's grammar point and validate your understanding with a quiz.</p><p><strong>Vocabulary lecture:</strong> Learn 10 key expressions you can easily include in your spoken French like a native speaker, followed by a quiz.</p><p><strong>Writing lecture (dictation):</strong> boost your writing skills and learn ready to use French structures.</p><p>In Section 5, you will learn how to differentiate and pronounce the sounds <strong>[e] and [ɛ]</strong> (é/ è) via an entertaining phonetic video and exercises.</p><ul><li><ul><li><span style=\"\"></span></li></ul></li></ul>", 
    "end_date": null, 
    "title": "Practice and Perfect your French - Intermediate Level (HD)", 
    "price": "30.00", 
    "instructors": "Anne Le Grand", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523138_5464_5.jpg", 
    "course_url": "https://www.udemy.com/intermediate-french-master-the-past-tenses/", 
    "currency": "USD", 
    "subject_name": [
        "French"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T09:00:42Z"
}