{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tAre you a new coach or consultant who is just starting out in business?  </p>  <p>  \tOr, have you been in business for a while but you’re struggling to get clients and make it work?  </p>  <p>  \tIn either case, this course is for you.  </p>  <p>  \t<strong style=\"\">In fact, I believe in the content I share in this course so strongly that I think it should be <em style=\"\">mandatory</em> for every new coach and consultant.</strong>  </p>  <p>  \tThere are so many things you simply don’t know and can’t anticipate when you go into business for yourself.  </p>  <ul style=\"\">  \t<li><span>Things no one ever tells you</span></li>  \t<li><span>Things you simply overlook</span></li>  \t<li><span>Things you don’t think about</span></li>  </ul>  <p>  \tAnd all of those unknowns can make business frustrating, difficult, and frankly a real struggle.  </p>  <p>  \tBut it doesn’t have to be that way.  </p>  <p>  \t<strong style=\"\">When you know what to expect and what to do, it changes everything.</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Suddenly you are able to…</strong>  </p>  <ul style=\"\">  \t<li><span>Be better prepared so you can succeed in      your business</span></li>  \t<li><span>Relax and enjoy your business more</span></li>  \t<li><span>Avoid many of the common mistakes      <em style=\"\">(and the pain and frustration that goes along with learning the hard way)</em></span></li>  \t<li><span>Eliminate failures <em style=\"\">(I’ll be      honest, you can’t totally eliminate all failure but you can sure minimize      it!)</em></span></li>  \t<li><span>Save yourself a lot of frustration,      pain, and heartache</span></li>  \t<li><span>Become successful in your business      more quickly and easily</span></li>  </ul>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">I learned everything I teach in this course <em style=\"\">the hard way</em>.</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \tI’ve been in business on my own since 1998 (that’s 16 years). I’ve started 8 different businesses since 2005. Three became successful 6-figure businesses relatively quickly (within the first year or so). The others, well let’s just say I learned some valuable lessons!  </p>  <p>  \t<strong style=\"\">I was probably a lot like you when I started my first business. </strong>  </p>  <p>  \tFull of ideas, passion, motivation and drive. But no experience running a business. I’ve learned so much in the past 16 years that I feel an obligation to share it with those who are just starting out, or those who are struggling.  </p>  <p>  \tWhether you’re thinking about becoming a coach or consultant, you’re just starting your business, or you’ve been in business for years and things aren’t going quite the way you’d hoped, I believe understanding the things I share in this course will help you.  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">There&#039;s no reason you have to discover these things the hard way.</strong>  </p>  <p>  \tConsider this course your sneak peek into the future of what it takes to run a successful coaching or consulting business. Your opportunity to learn from someone who has <em style=\"\">been there-done that </em>and is now sharing it with YOU!  </p>  <p>  \t<strong style=\"\">Join the more than 460 students who are already in the class and learning how to create a more enjoyable, successful, and profitable coaching or consulting business.</strong>  </p>", 
    "end_date": null, 
    "title": "10 Things Every Coach or Consultant Needs to Know to Succeed", 
    "price": "50.00", 
    "instructors": "Debbie LaChusa", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112924_51ac_15.jpg", 
    "course_url": "https://www.udemy.com/10-things-every-coach-or-consultant-needs-to-know/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-30T20:01:45Z"
}