{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you own your own business or manage the marketing for a business, this course will be invaluable to you. So many marketing campaigns disappoint with poor results but often it isn't clear why. This course will look at why your campaigns might not be bringing in the level of new business you hoped for and will show you exactly what to do to put it right so that your marketing stops being a drain on resources and, instead, becomes a profitable investment and a supercharged engine for business growth.</p><p>The course will show you that there are 5 vital stages of marketing any business, and that you will be missing out on huge amounts of untapped profits if any of these stages are missing or implemented poorly. I'll show you how to identify the gaps and fill them in so that all your marketing spend can start to work harder at bring in new business.</p><p>In just a few hours, you'll acquire some expert knowledge allowing you to analyze your current marketing and put it right - a process that would cost you thousands if you were to hire a marketing professional to do all this for you.</p><p>You'll learn how to perform every one of these marketing stages better than the vast majority of your competitors who simply won't have a clue, helping you to make your business more successful and more secure.</p><p><strong>The course includes 66 lectures covering:</strong><br></p><ul><li>Over 60 lectures, downloads and quizzes</li><li>2.5 hours of video instruction</li><li>Examples of good and bad marketing</li><li>Worksheets to help you learn and implement the techniques</li><li>Quizzes to test your understanding</li></ul>", 
    "end_date": null, 
    "title": "Better Business Marketing for More Enquiries and More Sales", 
    "price": "35.00", 
    "instructors": "Mr Simon Turner", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690504_ec84_2.jpg", 
    "course_url": "https://www.udemy.com/better-business-marketing-for-more-enquiries-and-more-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T19:36:01Z"
}