{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">Why do people buy top shelf liquor?</strong><br style=\"\"></p>  <p>  \t<strong style=\"\"></strong>Try this experiment at your next party: Buy a few vodkas (or champagne or wine) from a few different price tiers. Conduct a blind taste test. See if your friends can correctly rank the different vodkas according to their respective prices.  </p>  <p>  \t                    Chances are they will tell you they can, but in reality they probably cannot.  </p>  <p>  \t                    So, why is there such a thing as top shelf liquor - if it doesn&#039;t pass the scrutiny of a simple taste test.  </p>  <p>  \t<strong style=\"\"><em style=\"\">There lies the power of</em><em style=\"\"> branding! </em></strong>  </p>  <p>  \t                    Branding has implications for liquor, and a variety of products. This class is meant to teach you the fundamentals of building a brand strategy, upon which you can build a plan that will set you apart from your competitors.  </p>  <p>  \t<strong style=\"\">What will you learn from this class?</strong>  </p>  <p>  \t                    You will learn how to apply the same tricks of the trade big brand marketers use to unlock the potential of your product!  You will learn the framework with which you can define your target consumer in a way that you can build brand value.  You will also learn how to define product benefits that will be relevant to your target consumer.  Your class project will give you a visual representation of both your target consumer and product benefit.  These are fundamental building blocks for building a brand.  </p>  <p>  \t<strong style=\"\">What is NOT this class?</strong>  </p>  <p>  \t              This class covers the basics of how to build a brand.  The basics are grounded in branding theory and practices used by brand managers worldwide.  This course is strategic in nature.  This course will help you identify what makes your brand special.  This course will help you understand what your brand stands for.  This course will help you build a brand that will differentiate you from your competition.  However, this course will not cover branding design.  This course is NOT about your brand logo or your brand tagline.  However, you will walk away from this course knowing what&#039;s that special sauce for your brand that you should definitely include in your brand tagline, logo design, website design, etc.  </p>  <p>  \t<strong style=\"\">How is the class structured?</strong>  </p>  <p>  \t                The class consists of several video lectures, separated in 3 sections.  Each section will cover a fundamental step toward building a winning brand. The lectures will take an hour to complete. At the end of the lecture, you would have clarity on where the power your brand lies!  You will be well on your way toward building an empire based on your winning brand strategy!  </p>  <p>  \t<strong style=\"\">Why take this course?</strong>  </p>  <p>  \t      First of all, this course is back by a 30 days money back guarantee.  Secondly, don&#039;t you want to know the secrets on how to get more customers and charge more for your products?  Don&#039;t you want to know how brand managers from Coca-Cola got people from every country to buy their products?  Don&#039;t you want to know how brand managers from Seven Jeans get to charge more for a simple pair of jeans?  If you&#039;d like to learn how to elevate your brand, enroll in this course now!  </p>", 
    "end_date": null, 
    "title": "Branding Basics: Build a brand strategy in 3 simple steps! ", 
    "price": "35.00", 
    "instructors": "Jeannie Chan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354868_63d1_6.jpg", 
    "course_url": "https://www.udemy.com/the-foundation-of-building-a-brand-jeannie-chan/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T01:12:59Z"
}