{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>HTML, linking, rédactionnel, Google Panda, Adwords, affiliation, \nréseaux sociaux, outils d'analyses et de positionnement, etc. ; adaptées\n aux dernières conventions, cette formation a pour \nobjectif de vous fournit <strong>une vue d'ensemble et les connaissances indispensables au référencement et \nmarketing web</strong> pour vous permettre d'augmenter votre visibilité sur le \nweb.</p>\n\n<p>Le développement d'Internet\n (et de la concurrence qu'il implique) est tel que le référecemment web \nest devenu un enjeu majeur pour tous sites ou toutes sociétés de \ne-commerce confrontés à une problématique de rendement : <strong>se positionner \nen tête des réponses proposées par les moteurs de recherche</strong> en général \net Google en particulier, <strong>créer le maximum de trafic</strong> sur ses pages et \nainsi augmenter de manière significative son activité et sa performance \ncommerciale.</p>\n\n\n\n\n\n\n\n<p>Le SEM regroupe deux stratégies bien distinctes et toutefois \ncomplémentaires. Le SEO (Search engine optimisation), ou référencement \nnaturel consiste à optimiser les pages de son site web, à la fois lors \nde sa conception (la mise en valeur et la hiérarchisation de \nl'information par l'utilisation des balises HTML ou encore \nl'arborescence du site sont, par exemple, primordiales) et au cours de \nson exploitation selon différents critères parmi lesquels : contenu, \naccessibilité, maillage externe (netlinking). Le SEA (Search Engine \nAdvertising), quant à lui, renvoie principalement aux Adwords et à la \npublicité sur les moteurs de recherche ; cette dernière incluant \négalement le reciblage publicitaire comportemental et personnalisé \n(retargeting), ou encore l'affiliation. Le principe du SEA repose sur un\n système d'enchère et de mesure de pertinence qui affiche des bannières \npublicitaires ciblées en fonction des mots-clés que saisi l'internaute.</p>\n\n\n\n\n\n\n\n<p>Si les réseaux sociaux (Facebook, Twitter,\n Google +1) s'inscrivent comme un des critères essentiels du \nréférencement naturel au regard du <strong>nouvel algorithme de Google</strong> (et \nGoogle Panda), ils demandent pour les acteurs du web, au même titre que \nle SEM, de mettre en place des stratégies spécifiques et proposé un \ncontenu adapté afin d<strong>'optimiser leur présence \"sociale\"</strong> : visibilité, \ne-réputation, fidélisation, développement commercial.  Celle-ci en \nrapport avec les codes et usages propre à la communication \ncommunautaire.</p>\n\n\n\n\n\n\n\n<p>Aussi, cette formation référencement et marketing web se propose de \n<strong>faire le point sur l'ensemble de ces notions vous permettant \nd'acquérir les principes et les connaissances indispensables du \nréférencement web adaptés aux dernières évolutions</strong>, comme à l'importance\n grandissante des réseaux sociaux. Qu'est ce que le référencement ? En \nquoi consiste t-il ? Quels en sont les différents domaines d'application\n et les stratégies à envisager ? Quelles sont les bonnes pratiques (et \nles mauvaises !) ? Qu'est ce que le Black SEO et quelles en sont ses \nlimites ? Comment développer le netlinking et quels sont les moyens \ndisponibles ? Comment mettre en place une campagne publicitaire et en \ntirer profil ? Quels sont les avantages et inconvénients de cette \nstratégie de référencement ?</p>\n\n\n\n\n\n\n\n<p>Cette formation a pour objectif de vous fournit une vue d'ensemble et\n des pistes de réflexions sur ce domaine vaste et complexe qu'est le SEM\n afin que vous puissiez <strong>saisir les possibilités que celui-ci peut offrir\n dans le développement de votre activité</strong>. Elle permet ainsi d'identifier\n la large palette d'opérations d'optimisation de son site à mettre en \nparallèle avec les règles d'ergonomie et vous donne les clés pour \naugmenter votre visibilité sur les moteurs de recherche, comme de \ncomprendre les différents leviers du référencement.\nEnfin, <strong>cette formation accorde une grande place aux outils de mesures et\n vérifications sans lesquels aucune stratégie de marketing web ne peut \ns'inscrire dans le long terme et être véritablement efficace</strong>. Elle vous \nmontrera les indicateurs clés qui vous permettrons de re-calibrer vos \nactions en fonction de leur effet, et vous pourrez ainsi aller de \nl'avant en corrigeant les erreurs.</p>\n\n\n\n\n\n\n\n<p>Cette formation n'est ni un guide pas à pas, ni une utopie théorique.\n Il s'agit d'<strong>un mélange de pratique et de théorie</strong> vous permettant de \nsaisir les ficelles du référencement et de comprendre comment obtenir \nles faveurs du sacro-saint Google !</p>\n\n\n\n\n\n\n\n<p>A l'issu de cette formation, <strong>vous serez capable de réaliser un \nproduit optimisé et de faire évoluer votre stratégie en fonction de \nvotre écosystème et des résultats que vous obtenez</strong>.</p>", 
    "end_date": null, 
    "title": "Comprendre le référencement et le marketing web", 
    "price": 0, 
    "instructors": "Formation video", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/820848_eb6d_4.jpg", 
    "course_url": "https://www.udemy.com/comprendre-le-referencement-et-le-marketing-web/", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T12:54:25Z"
}