{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Do you have an idea for a course, book, service/coaching package, or product? </strong></p>\n\n<p>If so, you should be collecting email leads!</p>\n\n<p>Why? </p>\n\n<p>Growing an email list of people who are interested in what you are creating <strong class=\"redactor-inline-converted\"><em>before</em></strong> you launch it is a great way to validate your idea and make sure that people are interested in the product you are creating. </p>\n\n<p>When I wrote my first book, I didn't have an email list, which means I didn't have anyone to promote the book to on launch day :( </p>\n\n<p>But, once I started growing an email list, my book sales picked up and continued grow! </p>\n\n<p>Many people, myself included, believe that you need a website in order to start growing an email list. But websites can be expensive and time consuming to create, especially if you are just getting started. </p>\n\n<p>Luckily, I found a way to create simple landing pages using ConvertKit that DON'T REQUIRE you to have a website in order to start growing your email list. </p>\n\n<p>That's exactly what I cover in this tutorial. </p>\n\n<p><strong>In this tutorial I show you:</strong></p>\n\n<ul><li>how to create an opt-in offer or \"lead magnet\" that is targeted at your ideal customer, </li><li>how to upload and host your lead magnet, and </li><li>how to create a high converting landing page using ConvertKit that delivers your lead magnet to your subscribers automatically as soon as they sign up. </li></ul>\n\n<p><br></p>\n\n<p>And we can do all of this BEFORE you even have your website set up. That means that you can start growing your list right now! </p>", 
    "end_date": null, 
    "title": "ConvertKit Tutorial - Build a Landing Page with NO Website", 
    "price": 0, 
    "instructors": "Krystal Wascher", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/859614_89ee_3.jpg", 
    "course_url": "https://www.udemy.com/convertkit-landing-page-tutorial/", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-25T12:59:57Z"
}