{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Struggling with writing sales copy?<br><br>It's true...Copywriting is tough.<br><br>It takes effort.<br><br>It takes hard mental focus.<br><br>Mostly, it takes a ton of research to figure out exactly who our ideal customer is, and how to speak to them in a way that compels them to take action.<br><br>When you sit down to write some sales copy, you get stuck:<br><br>You don't know how to start...<br>You don't know how to finish...<br>You start thinking you need to add more \"power words\"...<br>You wonder how to 'frame' the offer...<br><br>And here's the vicious truth that you might be avoiding...<br><br><strong>Copywriting = Freedom<br></strong><br></p><p>Want to make more money than you are right now?<br><br><strong>Learn to write good sales copy.</strong><br><br>If you can write good copy, you will never struggle to make money. Clients will pay you top dollar for your work. And if/when you create your own products you wont be at the mercy of Google or penguins or algorithm updates or any other SEO stuff.<br><br>You won't be building an empire on quicksand.<br><br>And you'll have the unique ability to say to yourself, \"Hmm, I want to make a bunch of money today.\" Then crank out a simple sales letter in 30 minutes to an hour. And freaking make money with it that day... and for years afterward!<br><br>Then you can move on to the next project with confidence. And the next. And the next.<br><br>This is reality for a small number of people who put in the small amount of work up-front to learn this \"secret\".<br><br>The secret?<br><br>You don't have to be an award-winning copywriter to create effective sales letters. In fact, writing great sales letters is more of a science than an art. Even the pros use proven \"templates\" to create sales letters that get results.<br><br>Imagine...Having complete copywriting FREEDOM 24 hours from now (maybe less).<br><br>What does that mean?<br><br>...No more pulling your hair out trying to write a sales letter or ad that converts...<br>...No more failed attempts at coming up with a good selling angle...<br>...No more FEAR and hesitation about what to write...<br><br>I've created this course to give you this formula, all you have to do is simply follow the formula step by step with tweaks according to your product &amp; customer and you'll have a sales letter that will convert.</p>", 
    "end_date": null, 
    "title": "Copy Intelligence: Write Persuasive Copy that Sells", 
    "price": "20.00", 
    "instructors": "Basim Salim", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743248_0a5f_3.jpg", 
    "course_url": "https://www.udemy.com/copy-intelligence-write-persuasive-sales-copy-that-sells/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T06:29:43Z"
}