{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">As a small business marketer or independent marketing consultant, you need to be nimble and ultra-focused in defining your target market. You know you can't afford to be \"all things to all people.\" No only that, you probably don't have deep pockets to support a market research project to investigate your target buyers and their behaviors. So, how can you quickly build an illustration of your best target buyers -- one that is good enough to support a go-to-market plan? Or, if you are consulting with larger companies on their marketing plans, how can you guide them to produce better personas themselves?</p><p style=\"\">The good news is that you can use the exact same method big companies use to craft their personas. This course unlocks the secrets to building better personas -- secrets and a 10-step process you can adopt today to answer these questions. </p>This 90-minute course is divided into a practical, pragmatic 10-step approach to illustrating your best target buyers. Each step is illustrated with a short video giving you lots of examples. Mike Gospe shares his personal story of how he discovered how to build better personas, including stories about the good, bad, and ugly persona examples he uncovered in his own journey. He goes further by prescribing how you should conduct the persona exercise and manage your internal politics so you get the best outcome possible. This course is for any marketer or small-business entrepreneur interested in learning how to better understand their best target customers.<span></span><span></span><span></span> <ul><li>Learn the <strong>10-step proven technique</strong> for building a better buyer persona</li> <li>Download Mike's unique <strong>persona template</strong> and customize it to your business</li> <li>Understand the <strong>3 dimensions</strong> that must be included in your persona</li> <li>Discover <strong>short cuts</strong> to help you document and share your persona</li> <li>Find out <strong>how to immediately apply your persona</strong> to your product positioning, customer messaging, and marketing blueprints</li></ul>", 
    "end_date": null, 
    "title": "Create powerful buyer personas for your small business", 
    "price": "20.00", 
    "instructors": "Mike Gospe", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554952_45a3_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-better-buyer-personas/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T00:52:46Z"
}