{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>All businesses sell one thing: </strong><strong>Reactions!</strong>  </p>  <p>  \t          The Customer Experience emotional reactions you create are your product. And as soon as you begin to see your business as a reaction-creating machine, you’ll begin to think about your business and its marketing differently.  </p>  <p>  \t                 In <span style=\" color:inherit; \"><em><strong>Differentiate Your Business with Customer Experience Marketing,</strong></em></span><span style=\" color:inherit; \"> John Weisenberger will show you how to think differently about the emotional reactions you create in your customers and how to put Customer Experience (CX) Marketing techniques to work in your business to create massive customer loyalty and profits.</span>  </p>  <p>  \t                  In this course you learn how to:  </p>  <ul>  \t<li>Create powerfully differentiated Customer Experiences that your customers will remember and talk about to others</li>  </ul>  <ul>  \t<li>Use Customer Experience Marketing (CX Marketing) to quickly change your customer’s perception of your brand</li>  </ul>  <ul>  \t<li>Track and measure the Key Process Indicators (KPI) necessary to calculate your CX Marketing Return on Investment (ROI)</li>  </ul>  <ul>  \t<li>How to get started today using practical low cost/no cost CX Marketing strategies that don&#039;t require big budgets and complicated technologies.</li>  </ul>  <p>  \t             This is a 101 level introductory course intended to expose the student to a broad overview of Customer Experience Marketing in order to prepare for further advanced study in each of the introduced sub-topics.  </p>", 
    "end_date": null, 
    "title": "Differentiate Your Business w/ Customer Experience Marketing", 
    "price": "20.00", 
    "instructors": "John Weisenberger", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278192_ea91_5.jpg", 
    "course_url": "https://www.udemy.com/differentiate-your-business-w-customer-experience-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-10T15:35:29Z"
}