{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t How would you like to never have to worry about getting new customers in your business ever again?  </p>  <p style=\"\">  \t Some people don&#039;t think its possible...  </p>  <p style=\"\">  \t But successful business people are doing it right now...  </p>  <p style=\"\">  \t Everyone else, though, are struggling just to get 1 or 2 people to say yes to buy their product or service - and it takes them 3, 4, even 6 months to do it!  </p>  <p style=\"\">  \t This class will teach you the exact <strong style=\"\">step-by-step system</strong> that you need to follow - in order to get you to a place where you can get customers any time and anywhere.  </p>  <p style=\"\">  \t Once there, you&#039;ll <strong style=\"\">never have to worry about getting new customers</strong> ever again...  </p>  <p style=\"\">  \t Imagine this...  </p>  <p style=\"\">  \t Imagine if you were able to consistently get <strong style=\"\">5 - 10 new customers every month</strong>, what would that mean to you?  </p>  <p style=\"\">  \t I mean, if you do the math, 5 - 10 new customers a month - translates into 50 - 100 new customers a year!  </p>  <p style=\"\">  \t How much money will that bring you?  </p>  <p style=\"\">  \t What could you do with your business if you were able to do that?  </p>  <p style=\"\">  \t If you&#039;re like me, to have a skill like that means that you could grow your businesses and create multiple streams of income for yourself...  </p>  <p style=\"\">  \t ...You could reach a 6, 7 or 8 figure income within the next 5 years, and just keep growing...  </p>  <p style=\"\">  \t So are you ready to learn what it takes to get 10 new customers within the next 30 days?  </p>  <p style=\"\">  \t Here&#039;s what you will learn in this class:  </p>  <ul style=\"\">  \t<li style=\"\">The 3 keys that will determine the <strong style=\"\">success of any marketing effort</strong> you make. </li>  \t<li style=\"\">The #1 thing, that if you do this, you will <strong style=\"\">never have to worry about getting customers</strong> - ever again... </li>  \t<li style=\"\">How to identify the &quot;Optimal&quot; marketing strategy for your industry, that is currently bringing millions of dollars to your competitors... </li>  \t<li style=\"\">How to craft a simple marketing message that will <strong style=\"\">compel people to take action</strong> right away, and seek you out. </li>  \t<li style=\"\">How to consistently<strong style=\"\"> attract your ideal client</strong>, and keep them buying from you year after year. </li>  \t<li style=\"\">The key to making your marketing efforts more and more effective and profitable month after month. </li>  \t<li style=\"\">The 6 marketing boosters that will <strong style=\"\">double or triple the amount of customers you get</strong> - and money you make. </li>  \t<li style=\"\">How to <strong style=\"\">automate your marketing</strong> so that customers come to you, a lot more than you go chase after them. </li>  \t<li style=\"\">And much, much more...</li>  </ul>  <p style=\"\">  \t What are you and your business financially capable of? Sign up for this course and find out!  </p>", 
    "end_date": null, 
    "title": "Effective Small Business Marketing", 
    "price": 0, 
    "instructors": "William U. Peña, MBA", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170852_dea5_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-10-new-customers-in-the-next-30-days/", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-22T08:00:18Z"
}