{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t  Included:  </p>  <p style=\"\">  \t  19 Lessons Email Marketing Mastery &amp; Core Influence Training  </p>  <p style=\"\">  \t  2 Landing Pages That You Can Use For Your List Building Efforts  </p>  <p style=\"\">  \t  Over 10 Joint Venture Letters For Getting Others To Promote Your Products  </p>  <p style=\"\">  \t  A High Converting &amp; Tested 7 Day &quot;Done For You&quot; Email Autoresponder Sequence  </p>  <p style=\"\">  \t  -------------------------------------------------------------------------  </p>  <p style=\"\">  \t  Discover The Exact Methods For Writing Highly Responsive Emails And Start Making More Sales From Your List Starting Today!  </p>  <p style=\"\">  \t  If you&#039;re not using these tactics,  </p>  <p style=\"\">  \t  you could be wasting your time building a list...  </p>  <p style=\"\">  \t  Do you get frustrated when you build your list but don&#039;t make any sales from it?  </p>  <p style=\"\">  \t  Do your subscribers actually look forward to receiving your emails each day?  </p>  <p style=\"\">  \t  Do you get irritated when you spend hours crafting some great free content, only to have people unsubscribe from your list when you send it to them?  </p>  <p style=\"\">  \t  Or maybe your subscribers do actually open up your free content emails, but when it comes down to it and you ask them to buy from you, they lock up their wallets?  </p>  <p style=\"\">  \t  Wouldn&#039;t It Be Great If You Could Make Money  </p>  <p style=\"\">  \t  From Your List Instead Of Wasting Money?  </p>  <p style=\"\">  \t  How would it feel if you knew exactly how to get your subscribers to open up your emails all the time and actually look forward to seeing your emails?  </p>  <p style=\"\">  \t  What if you discovered there is a very easy way to get your subscribers to actually want to buy from you over and over again?  </p>  <p style=\"\">  \t  How would that change your business? How would that change your life?  </p>  <p style=\"\">  \t  Well, I&#039;m here to tell you that there is a very specific way you need to communicate with your list, to build a strong bond with your subscribers, and actually get them to become highly responsive when you are selling to them.  </p>  <p style=\"\">  \t  It&#039;s Not About Just Building Your List, <br style=\"\">  \t   It&#039;s About Building A Relationship With Your List!  </p>  <p style=\"\">  \t  You see, you don&#039;t build a list just for the sake of having subscribers on your list.  </p>  <p style=\"\">  \t  What you want to do is actually build a strong enough bond with your subscribers to a point where they will actually WANT to buy from you.  </p>  <p style=\"\">  \t  Most people ignore this completely though.  </p>  <p style=\"\">  \t  All they do is sell, sell, sell to their list...but of course, that&#039;s why they don&#039;t make any sales.  </p>  <p style=\"\">  \t  All they end up doing is burning their list out, getting a whole bunch of unsubscribes every single day, and then go off and complain about how it&#039;s all a scam and they can&#039;t make a dime online.  </p>  <p style=\"\">  \t  If that&#039;s what you&#039;ve been doing, then it&#039;s time to make a change.  </p>  <p style=\"\">  \t  It&#039;s time for you to finally discover how to actually have the great responsiveness and profitability you have been looking for.  </p>  <p style=\"\">  \t  It&#039;s time for you to finally start making more sales from your email marketing campaigns.  </p>  <p style=\"\">  \t  And you&#039;re going to discover how in my new email marketing training...  </p>  <p style=\"\">  \t  This is a comprehensive training program on how to build a strong relationship with your list, and actually make more sales from your email campaigns.  </p>  <p style=\"\">  \t  Here&#039;s what you&#039;re going to learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to get your subscribers to know, like and trust you</li>  \t<li style=\"\">What you need to do for them to actually look forward to receiving your emails every single day (even sales emails)</li>  \t<li style=\"\">The one thing you need to know before you send a single email</li>  \t<li style=\"\">How to organize your email campaigns to build credibility and trust</li>  \t<li style=\"\">Why you need to __________ if you want your subscribers to stay on your list</li>  \t<li style=\"\">One easy way to set yourself apart from the rest of your competition</li>  \t<li style=\"\">How to get your subscribers to actually see you as a trusted friend instead of a marketer</li>  \t<li style=\"\">The exact reason why most people don&#039;t get any results with email marketing (are you currently doing this right now?)</li>  \t<li style=\"\">The best types of headlines that actually get your emails opened</li>  \t<li style=\"\">How to get subscribers to not just open your emails but actually click on your links as well</li>  \t<li style=\"\">Why _________ emails should be the backbone of your email campaign (ignore this and your entire campaign could be worthless)</li>  \t<li style=\"\">How to actually build a relationship with your subscribers</li>  \t<li style=\"\">The secret to writing sales emails that your subscribers will actually look forward to receiving</li>  \t<li style=\"\">The one type of email you must send to build a deeper bond with your list</li>  \t<li style=\"\">How to properly format your emails for best results</li>  \t<li style=\"\">How often you should be mailing your list</li>  \t<li style=\"\">Why making mistakes is actually not a bad thing and how you can still succeed</li>  \t<li style=\"\">How to stop worrying about all the unsubscribes you get</li>  \t<li style=\"\">The biggest email marketing myth you&#039;ve been told</li>  \t<li style=\"\">How to make money from your subscribers in the long run</li>  \t<li style=\"\">And much, much more...</li>  </ul>  <p style=\"\">  \t  You&#039;re Going To Discover Everything You Need To Create A Profitable Email Campaign!  </p>  <p style=\"\">  \t  Let me tell you this straight up...  </p>  <p style=\"\">  \t  It is possible to load emails into your autoresponder and make sales on autopilot.  </p>  <p style=\"\">  \t  It is possible to send out a broadcast to your list and makes sales with the click of the send button.  </p>  <p style=\"\">  \t  It is possible to turn freebie seekers into loyal buyers.  </p>  <p style=\"\">  \t  But it doesn&#039;t happen by accident.  </p>  <p style=\"\">  \t  It happens by organizing and structuring your email campaigns in a certain way so that subscribers will actually want to open your emails, read them, and buy from you.  </p>  <p style=\"\">  \t  And you&#039;re going to discover how to do that in Email Marketing Mastery.  </p>", 
    "end_date": null, 
    "title": "Email Marketing Mastery", 
    "price": "20.00", 
    "instructors": "JT Starks", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384212_e4dd.jpg", 
    "course_url": "https://www.udemy.com/email-marketing-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T18:13:43Z"
}