{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Viele JungunternehmerInnen denken, dass ihre Webpage der Schlüssel zum Verkaufserfolg ist.</p><p><strong>Doch eine Webpage generiert dir nur sehr bedingt Umsatz!</strong></p><p>Viel sinnvoller ist der Einsatz von gezielten Landingpages. <strong>Damit überlässt du es nicht dem Zufall, welchen Weg der Kunde durch dein Angebot nimmt</strong> (und ob er überhaupt davon Gebrauch macht), sondern <strong>gibst ihm einen klaren, von dir definierten Weg vor.</strong></p><p><strong>Landingpages eigenen sich hervorragend, um deine Liste ständig zu vergrößern und auch, um Verkäufe zu generieren.</strong></p><p>Dieser Kurs ist speziell <strong>für EinzelunternehmerInnen gedacht, die ein stabiles und gewinnbringendes online Geschäftskonzept auf die Beine stellen</strong> möchten, ohne Tag und Nacht an ihrem Marketing zu feilen.</p><p>Sinnvoll ist es, wenn du schon ein paar Produkte, wie zB Webinare, Workshops oder Coachings und Therapien anzubieten hast. Es ist aber keine MUSS-Voraussetzung.</p><p><strong>Das kannst du nach dem Kurs:</strong></p><ul><li>du verstehst, warum der Einsatz von Landingpages wichtig für dein Business ist</li><li>du überlässt die Wahl deiner Produkte nicht dem Zufall, sondern planst einen sinnvollen Weg, den deine Kunden durch dein Angebot gehen</li><li>du strukturierst diesen Weg mit Angeboten auf Landingpages</li><li>du lernst, wie du mit wenigen Klicks selbst Landingpages mithilfe von OptimizePress 2 erstellen kannst</li><li>du lernst, wie du Anmeldeformulare und Autoresponder von KlickTipp integrieren kannst</li></ul>", 
    "end_date": null, 
    "title": "Erstelle deine 4 wichtigsten Landingpages mit OptimizePress ", 
    "price": "35.00", 
    "instructors": "Meike Hohenwarter, MSc", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683552_9304_3.jpg", 
    "course_url": "https://www.udemy.com/deine-4-wichtigsten-landingpages/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T20:14:47Z"
}