{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tFundraising often strikes fear in the hearts of people. As a fundraiser you are simply the conduit that helps an individual connect with a cause they care about. <span> </span>This course will help you to gain a firm foundation of various fundraising avenues so as to create winning fundraising strategies. <span> </span>  </p>    <p>  \t<strong style=\"\">Learn Fundamental Fundraising Principles That Help You Become A Better Employee, Board Member, Fundraiser, Director Or Candidate.</strong>  </p>    <ul style=\"\">  \t<li style=\"\">  \t  \t\t<strong style=\"\">Learn the top 10 development areas for crafting a winning fundraising strategy</strong>  \t  \t</li>  \t<li style=\"\">  \t  \t\t<strong style=\"\">Recognize the five types of donors and how to reach them</strong>  \t  \t</li>  \t<li style=\"\">  \t  \t\t<strong style=\"\">Gain knowledge of the seven elements for successful donor communications</strong>  \t  \t</li>  \t<li style=\"\">  \t  \t\t<strong style=\"\">Discover key phrases that enable you to quickly put information into practice</strong>  \t  \t</li>  \t<li style=\"\">  \t  \t\t<strong style=\"\">Acquire insights that assist you in your efforts to achieve your fundraising goals </strong>  \t  \t</li>  </ul>    <p>  \tAt its heart, fundraising is simply communication and marketing coupled with relationship building. This course will enable you to gain beneficial insights that you can use in your career, your life and your volunteer efforts. Understanding the various areas of fundraising will help you make you a valuable member of your team.   </p>    <p>  \t<strong style=\"\">Contents and Overview</strong>  </p>    <p>  \tThis course contains over 20+ lectures and over three hours of content. This course is designed so you can quickly grasp fundraising essentials  and put them into practice. Depending on your role in fundraising—whether as staff, board member, candidate&#039;s manager or even a small business owner—learning these areas will assist you in crafting the best way to create awareness of your “product&quot; or mission.   </p>    <p>  \tBy the end of this course, you will have a strong knowledge of all the basic areas of fundraising as well as specific tools you can use to quickly start your fundraising practice today. This course will also assist you in your efforts to expend time and resources on those areas that provide the best return on investment for your particular area and target market. Exercises  will enable you to try out some of your newly gained knowledge. <span> </span>  </p>", 
    "end_date": null, 
    "title": "Fundraising Principles for Nonprofits and Small Businesses.", 
    "price": "20.00", 
    "instructors": "Vikki Walton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425250_230c_2.jpg", 
    "course_url": "https://www.udemy.com/fundraising-101-become-a-great-fundraiser-today/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T20:01:17Z"
}