{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Group Savvy - Maximizing Profits from Joining Groups  </p>  <p>  \t  This course will take you through the steps of deciding on the best group for you to join when it comes to finding your target customer. You will find the material inside is a practical down to earth approach to maximizing the time and money you spent gaining new business.  </p>  <p>  \t  This course takes a unique approach with the learner in mind.  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">All of the transcripts and resources are provided for you to download as you go through each lesson. Why is this important?</span></li>  \t<li style=\"\"><span style=\"\"></span><span style=\"\">Often we want to go back to a technique in a video but are not sure where it may be located. With the transcript for each video in hand, you will have instant access whether you are on or off line.</span></li>  \t<li style=\"\"><span style=\"\">The course is broken down into 15 specific techniques for zeroing in on the right groups for your business and zeroing in on your customer persona.</span></li>  </ul>  <p>  \t  Why should you take this course? Without it you will be spending copious amounts of money trying to get to the right event, With this course, you will save not only your time but your money as well.  </p>  <p>  \t  Want to know more? Register today!  </p>", 
    "end_date": null, 
    "title": "Group Savvy - Maximizing Profits from Joining Groups", 
    "price": "20.00", 
    "instructors": "Dr. Bette Daoust", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360706_5d48.jpg", 
    "course_url": "https://www.udemy.com/group-savvy/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T19:23:02Z"
}