{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Have you ever spent money on a Google or Facebook Ad campaign and didn’t get a single sale?</strong></p>\n\n<p>You noticed that a lot of visitors came to your website but nobody took any action.You invested so much time and effort to create a digital product. Whether it be</p>\n\n<ul><li>          An eBook</li><li>          An audiobook</li><li>          An online course</li></ul>\n\n\n\n\n\n<p>But then when you have to make the sales the whole process suddenly stops.\n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">And then you assume that maybe your product is bad.</strong>\n\n  </p>\n\n<p>I propose to you that the root of the problem could be your marketing.\n\n  </p>\n\n<p>You see, marketing is a skill. It is all about getting customers. You could have the best product in the world, but if your marketing is poor, you will not get any sales.\n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">And a business with no sales has no income and will go bust.</strong>\n\n  </p>\n\n\n\n<p>Now I use to think that marketing was all about writing ads. But after a ton of failed campaigns and a lot of money thrown away, I realized that there is so much more. Writing ads is just the tip of the iceberg.\n\n  </p>\n\n<p>So I started diving beneath and searching for answer to effective marketing.\n\n  </p>\n\n<p>While studying marketing I realized that a lot of people make the same mistakes which I did when starting their first marketing campaigns.\n\n  </p>\n\n<p>So I decided to create this course and show you an <strong class=\"redactor-inline-converted\">effective way to market your products online so that you avoid making these common mistakes.</strong>\n\n  </p>\n\n<p>And instead learn proven marketing strategies you can use to create captivating promotions that get sales.\n\n  </p>\n\n<p>However in this course I will not be discussing any technical matters. I will not discuss Facebook ads or Google ads or Bing ads.\n\n  </p>\n\n<p>What I have noticed is that underlying all these online traffic methods, there are marketing principles that are responsible for getting sales.\n\n  </p>\n\n<p><strong>And when you learn these fundamental marketing principles then you can go to Facebook, or Google or any new traffic method, and be able to create captivating promotions and get sales.</strong>\n\n  </p>\n\n\n\n<p>Click the “Take this course” button now and start your marketing education today.<br></p>\n\n<p>I’ll see you on the inside.</p>", 
    "end_date": null, 
    "title": "How to Market Your Products in the Digital Age", 
    "price": "20.00", 
    "instructors": "Tom Wiztek", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857198_35b9.jpg", 
    "course_url": "https://www.udemy.com/how-to-market-your-products/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T05:54:01Z"
}