{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>How To Market Your Events</strong></p><p><strong>Use this proven 6 step process to get people paying to attend your courses, seminars or Workshops</strong></p>\n\n<p>  \t     Being able to market your own courses, workshops and seminars is essential if you are a trainer, presenter or even a business owner. Not only can you make substantial profits but also use the event to promote other things to your audience  such as coaching, products or even in-house training workshops. <br>  \t <br>  \t      Simply put, if you know how to get people booking on your event, you can make money. In fact, you don't even need to do the training  yourself if you prefer not to.  </p>\n\n<p>  \t     If you have tried filling courses before, perhaps you have found it a challenge to get enough bookings or even had to cancel an event because there were not enough people attending.  </p>\n\n<p>  \tIn this ideas-packed course, you will discover exactly what you need to do to so that you can fill your training courses with paid attendees without wasting money on marketing that doesn't work.  </p>\n\n<p>  \t <strong>Learn a Proven 6 Step System to Get People Booking On Your Public Training Courses</strong>  </p>\n\n<ul>  \t<li>How to plan what you want from your course</li>  \t<li>Discover how much money you will make from each course you run</li>  \t<li>Find out how to create the right title for your course</li>  \t<li>The easy way to get free or low cost bookings</li>  \t<li>How to use direct mail to fill places</li>  \t<li>Discover how to use back end selling for even      more profit</li>  </ul>\n\n<p>  \t     If you are a business owner, trainer, coach or presenter you will know how beneficial it can be to share your knowledge to a paying audience. Not only do you get the pleasure of knowing that you have helped others to be more successful in their job, business or life but also you can make healthy profits too.  </p>\n\n<p>  \t     In the past you  may have been tempted to run courses for others because you are just not sure how to fill an event yourself. This may have seemed ideal but you will have been doing most of the work for the least amount of money.  </p>\n\n<p>  \t <strong>Contents and Overview</strong>  </p>\n\n<p>  \t     This training course with 40 easy to follow lectures and 6 quizzes will change all of that. Using my tried, tested and proven 6 step process, real life examples and downloadable templates, you will discover exactly what you need to do to be successful at filling your next workshop, seminar or course with paying customers.  </p>\n\n<p>  \t     Upon completion of this course, you will have all the tools and strategies you need to start marketing your own events, so that you can make money  from each one you run.  </p>", 
    "end_date": null, 
    "title": "How To Market Your Events", 
    "price": "35.00", 
    "instructors": "Keith Banfield", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426598_6468_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-fill-your-own-seminars-workshops-or-courses/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T05:01:11Z"
}