{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Struggling with gaining traction with your online marketing? The reason may be that you've fallen into the trap of one or more of these time, effort and money wasters that keep you stuck.</p><p><strong>By The End Of The Course:</strong></p><p>You should have a good grasp of the most frequently traps most fall into with their online marketing and <strong>how not to become one of the victims</strong>. </p><p><strong>Content Overview</strong></p><p>The course is presented in <strong>seven sections</strong>, each dealing with one of the <strong>major stumbling blocks</strong> most new as well as not so new to Internet/Online Marketing fall into. They are more like traps that tend to snag most of us at one time or another. </p><p>Through examples and illustrations I help you <strong>recognize the traps</strong>, <strong>offer tips</strong> on minimizing their impact and <strong>introduce you to efficiency tools</strong> and <strong>systems</strong> that will serve you well with any Internet or non-internet related projects. Intertwined you'll also find:</p><ul><li>Two very simple but effective <strong>task</strong> and <strong>time management tools</strong>, including simple yet powerful time and business planning processes that will get you to your destination quicker and save you \nlots of frustration with your online marketing or other efforts.</li><li>The why, what and how of the all important flow of a sale, we call the \"<strong>sales funne</strong>l\"</li><li>A simple but highly effective \"<strong>lean canvas</strong>\" based business evaluation and planning tool that you'll appreciate </li><li>A glimpse into what's behind the ever <strong>accelerating rate of change</strong></li></ul><p>The material is presented through the use of a <strong>Mind-map</strong> product, xMind to be specific. I'd love to get your feedback on its use for a presentation such as this, versus using PowerPoint, for example. </p><p><strong>Course Length and Structure</strong></p><p>The course should not take any longer than 3 - 4 hours. The <strong>seven sections</strong> are broken down into 30+ lectures of <strong>2 - 5 minutes each</strong>. The corresponding Mind-maps are included as attachment in the Summary of each section. </p><p><strong>What You'll Gain</strong></p><p>As you go through the course:</p><ul><li>You'll be able to identify and <strong>avoid</strong> the most common, <strong>effort</strong> and <strong>money wasting traps</strong>.</li><li>Gain insights into simple but powerful <strong>time</strong> and <strong>task management</strong> processes</li><li>Gain insights on concepts such as <strong>Sales</strong> and <strong>Marketing</strong> <strong>Funnels</strong> and <strong>Landing Pages</strong></li><li>Perhaps find the reason why you're stuck and then <strong>get unstuck</strong> with your project</li><li>Find the courage to <strong>just</strong> <strong>get</strong> <strong>started</strong>.</li></ul><p>Don't be like one of the attendees I had in a group I led, that before she joined us, spent around twenty thousand dollars setting up her online marketing business and six months after launch having to start from scratch. Had she been aware of just one of the traps she was walking into when she handed the work over, that would not have had to happen.</p><p><strong>The Bottom Line</strong></p><p>If you'll pay attention to these and put the recommended best practices into use, <strong>at the end of the course you'll be miles ahead</strong> of most that are building an online business or a online marketing campaign.</p>", 
    "end_date": null, 
    "title": "How To Overcome These 7 Online Marketing Momentum Killers", 
    "price": "20.00", 
    "instructors": "Andre Kasberger", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415942_a385_6.jpg", 
    "course_url": "https://www.udemy.com/my-best-advice-and-insights-for-green-online-marketers/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T17:27:50Z"
}