{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This Udemy course has been taken over by over 2,000 students around the world. <br></p><p><strong><em>LATEST: Course Updated Again for September 2015</em></strong></p><p><strong><em>Learn EXACTLY what I've taught international brands like McDonald's and evian... in only 2 hours!</em></strong><br></p><p>Gain the skills major brands have paid hundreds of thousands for. Quickly and easily.</p><p><em>Over 2,000 students have already learned what took me almost a decade to develop.</em></p><p>Have you heard of my \"<strong>Branding, Public Relations and Social Media Secrets?</strong>\"</p><p>I've been working with international brands for almost a decade. And this course highlights what REALLY works.</p><p><em>It has taken me years to find out what really works... and now these tactics are revealed here for the first time.</em><br></p><p><strong>I make over $7,000 a month with private clients</strong> teaching them these very tactics - but you can gain my secrets for a fraction of the price.<br></p><p>When I first started my career in marketing, I was making a measly $30,000 a year. As a former Marketing Director, I made triple that -- and even more once I started freelancing. <strong>This is because I know what REALLY works when it comes to branding, public relations, and social media. </strong>And you can too.</p><p>I know what works. My CV and current consulting practice proves it. <em>Check out some of the free lectures below as a sample.<strong></strong></em></p><p>Every single tactic I reveal in this course is easy enough <strong>to implement in minutes</strong> - and you can see your brand change <strong>instantly.</strong><strong></strong></p><p>Nothing is kept secret - I'm revealing everything I know... and as I work with my clients, I'll unveil even more up to date tactics. <strong>And you pay NOTHING EXTRA for this ongoing content.</strong><strong></strong></p><p>Plus, Udemy has a 30 day guarantee. And you have my personal guarantee that in 2 hours, you'll be amazed at how much you'll learn... <strong>and you'll be kicking yourself if you already have a brand </strong>but haven't mastered branding, public relations, and social media.<br></p><p><em>What this is course IS NOT:</em><br></p><p><em>I do not cover anything you can freely find anywhere else online. <strong>I present to you real tactics I've used for major, international brands that I've worked with for close to a decade.</strong></em><br></p><p><em>I will not \"look at your brand\" and \"tell you what's wrong\". Every brand is different - and it would be reckless to advise you through a course. <strong>But I will help you build a rock solid foundation that EVERY brand I've worked with needed when I began working with them. This is something you need.</strong></em><br></p><p><em>I won't teach you any underhanded tricks, black hat marketing techniques, or how to write clickbait - <strong>I value my skills and I want to value your brand by giving it REAL potential to be amazing.</strong></em><br></p><p>But, if you want my real \"insider\" information - remember that <strong>I went from a lowly $30k a month salary to over triple that amount when I worked with agencies (</strong>I now make well over 5x that as a consultant) - so you need to get this course now... right this minute.</p><p><strong>Every minute you delay, you're actually LOSING money...</strong><br></p><p><strong>Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "How to Master Branding, Public Relations, & Social Media", 
    "price": "20.00", 
    "instructors": "Jeff Ramos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25581_4b8c_14.jpg", 
    "course_url": "https://www.udemy.com/branding-public-relations-social-media-cc/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-28T20:56:07Z"
}