{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">   Do you have your Marketing Plan yet?</strong>  </p>  <p style=\"\">  \t      If not, your&#039;e not alone.  </p>  <p style=\"\">  \t     The truth is that most business owners do not have one.  </p>  <p style=\"\">  \t     But boy, they sure would make a lot of money if they did!  </p>  <p style=\"\">  \t <strong style=\"\">If you didn&#039;t know, statistically, business owners who have a marketing plan are 80% more successful than those without one.</strong>  </p>  <p style=\"\">  \t     Why?  </p>  <p style=\"\">  \t     Because business owners that have a marketing plan are able to:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Attract the most customers</strong> to their business.</li>  \t<li style=\"\">Choose the <strong style=\"\">best marketing tools</strong> for their business - that is the best use of their time and money.</li>  \t<li style=\"\">Consistently <strong style=\"\">reach their monthly marketing and sales goals</strong>.</li>  \t<li style=\"\">Track their marketing so that they can <strong style=\"\">know what is working</strong>...and what is not.</li>  \t<li style=\"\">Most importantly, small business owners and entrepreneurs that have a marketing plan have the <strong style=\"\">best return on investment (ROI) for their money</strong>.</li>  </ul>  <p style=\"\">  \t     If you don&#039;t have a marketing plan can you see how much opportunity you are missing out on?  </p>  <p style=\" text-align:center;\">  \t<strong style=\"\">Do I Need To Write a 20 Page Marketing Plan? </strong>  </p>  <p style=\" text-align:center;\">  \t <strong style=\"\"> No Way! </strong>  </p>  <p style=\" text-align:center;\">  \t<strong style=\"\"></strong> <strong style=\"\"></strong><strong style=\"\">Use Our 1 Page Ultimate Marketing Plan Instead...</strong>  </p>  <p style=\"\">  \t                    Many people believe that you need pages and pages of complex information in order to write a great marketing plan.  </p>  <p style=\"\">  \t                    But that is <strong style=\"\">just not true</strong>...  </p>  <p style=\"\">  \t         Think about it... Do you read the 50 page manual that comes with all your electronic products? Or do you simply just follow the <strong style=\"\">1 page basic instructions</strong> that comes with the box?  </p>  <p style=\"\">  \t         They are both helpful, but the 1 page instructions get you started much quicker, and helps you to enjoy your product much faster.  </p>  <p style=\"\">  \t                    In the same way, this 1 Page Ultimate Marketing Plan will give you <strong style=\"\">everything you need to reach all of your marketing and sales goals.</strong>  </p>  <p style=\"\">  \t                    Also, because it&#039;s so simple, it makes it easier to do everything you are supposed to do to succeed in your business.  </p>  <p style=\" text-align:center;\">  \t<strong style=\"\">Why is This Marketing Plan Plan Just 1 Page?</strong>  </p>  <p style=\"\">  \t                    Since 20% of the things we do bring 80% of the results, we&#039;ve created a 1 Page Marketing Plan that focuses only on the <strong style=\"\">Top 20% that bring the biggest results.</strong>  </p>  <p style=\"\">  \t                    Most marketing plans are full of a lot of unnecessary information, and they make you do a lot of steps that just waste your valuable time.  </p>  <p style=\"\">  \t                    This 1 Page Ultimate Marketing Plan only describes the <strong style=\"\">most important and powerful steps</strong> you should take to help you <strong style=\"\">achieve your marketing and sales goals</strong>.  </p>  <p style=\" text-align:center;\">  \t<strong style=\"\">Does this 1 Page Marketing Plan Really Work?</strong>  </p>  <p style=\"\">  \t                    Absolutely!  </p>  <p style=\"\">  \t                    This 1 Page marketing plan has helped many business owners take their business to the next level in their business by helping them:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Increase customers by 30 - 50%.</strong></li>  \t<li style=\"\"><strong style=\"\">Build awareness to their brand</strong></li>  \t<li style=\"\"><strong style=\"\">Get more highly qualified customers that pay more</strong></li>  \t<li style=\"\"><strong style=\"\">Increasing profits</strong> by helping them use their marketing investments more wisely,</li>  \t<li style=\"\">And much more...</li>  </ul>  <p style=\" text-align:center;\">  \t<strong style=\"\">Will It Work for Me?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">If you&#039;re a small business owner or entrepreneur, and you have important marketing and sales goals that you want to achieve -  then <strong style=\"\">this 1 Page Ultimate Marketing Plan will help you succeed.</strong></li>  \t<li style=\"\">If you&#039;re a person that wants to get more customers, but you want an <strong style=\"\">effective</strong> <strong style=\"\">marketing plan</strong><strong style=\"\"> to help guarantee your success</strong>, then this 1 Page Marketing Plan will help create that roadmap for you.</li>  \t<li style=\"\">If you want to get yourself and your business to a <strong style=\"\">new level of success</strong>, this 1 Page Marketing Plan, will lay out a <strong style=\"\">step-by-step plan</strong> to show you everything you need to do to increase your leads and sales.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\">The &quot;How to Write the Ultimate </strong></strong><strong style=\"\"><strong style=\"\">1 Page </strong></strong><strong style=\"\"><strong style=\"\">Marketing Plan&quot; course will show you how to guarantee the success of your business, so that you can see all of your business goals, visions and dreams become a reality.</strong></strong>  </p>", 
    "end_date": null, 
    "title": "How to Write The Ultimate 1 Page Marketing Plan ", 
    "price": 0, 
    "instructors": "William U. Peña, MBA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170854_5e7e_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-the-ultimate-1-page-marketing-plan/", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-22T08:18:14Z"
}