{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>        HOW TO CREATE A POWERFUL CAPABILITY STATEMENT.. so you can win government contracts</strong> is a course teaching you how to create the ideal marketing collateral for the government market.  </p>  <p>  \t  After years of working as a consultant in the government industry, I was deeply disturbed by the challenges which small business have. I saw the disparities that limited small businesses from success. According to the SBA, small businesses represent 99.7% of American companies, yet they are only winning 16% of federal dollars.  Women owned small businesses represent 41% of companies, yet are only winning 4.3% of contracts.  Minorities represent 35% of the population, yet are only winning 4.8% of contracts.  </p>  <p>  \t As such, I left the consulting world and decided to start the Government Contractors Association.  I wanted to do something to help impact the disparities and challenges which existed in the most lucrative industry.  This course is one of the many training tools and resources which I have created to help change the disparities and the &quot;economic injustice&quot; which exists in the government market.  </p>  <p>  \t  In this course, you&#039;ll learn that the government does not use brochures or flyers. They use capability statements. If you want to have the best chance of winning contracts, then you&#039;ll need to have a literature that speaks to your audience.  </p>  <p>  \t            This course guides you step-by-step on how to create a capability statement. It explains why you need one, what are the components and how to use it.  </p>  <p>  \t            In this course you&#039;ll also receive guidance on how to find an agency so you can market your capability statement to. You&#039;ll learn 7 important keys to unlock more contract opportunities. You&#039;ll also receive templates and samples so you don&#039;t have to start from scratch. Just use the templates and edit them so you can finalize your capability statement quickly.  </p>  <p>  \t      This is your opportunity to grow your company in the $500 billion government market. Use this course to help you to create your marketing capability statement for the largest customer in the world.  </p>", 
    "end_date": null, 
    "title": "How to Create a Powerful Capability Statement (Step-by-Step)", 
    "price": "50.00", 
    "instructors": "Abraham Xiong", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299882_0e41_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-capability-statement/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-14T01:18:56Z"
}