{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Are you fed-up of your 9 to 5 job? Are you looking to replace or complement that income with income from online activities? If the answer is &quot;YES&quot; to both, then this course is for you.</p><p style=\"\">Internet Marketing Fundamentals was designed to teach persons NEW to the field of online marketing. If you are looking to live the internet lifestyle and travel the world while earning money when you sleep, then this is the perfect starter course to teach you the basics.</p><p style=\"\">It is to-the-point and does NOT contain fluff. Remember though, it is only the basics and is targeted to &#039;newbies&#039;.</p><p style=\"\">You will learn things like:                                                                                                         </p><ul style=\"\"><li style=\"\">What is Internet marketing</li><li style=\"\">The difference between Sales and Marketing. Get this right and you are set</li><li style=\"\">Competition in Internet Marketing and how this is good</li><li style=\"\">Market Research and how best to do it</li><li style=\"\">Profitable Niches and where to find them</li><li style=\"\">How to get Traffic to your site or offer</li></ul>and more...<p style=\"\">You would even get 15 pages of Valuable Tools (a Vendor Roladex) to help you build your business plus audio tele-seminars that you could download and listen to at your convenience. </p><p style=\"\">Remember, this is a basic course and much of your success depends on your ability to take <strong style=\"\">ACTION</strong>. So put all your limiting beliefs behind you and just do it!</p>", 
    "end_date": null, 
    "title": "Internet Marketing Fundamentals - How to Earn Extra Income", 
    "price": "30.00", 
    "instructors": "Jerome Marquez", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538078_c6f1_2.jpg", 
    "course_url": "https://www.udemy.com/internet-marketing-fundamentals-now/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T16:38:47Z"
}