{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">**Note: This is a promotional price. The price of this course will increase to $47 within the next few days</em></strong><br style=\"\">  \t    </p><p>As an entrepreneur, business owner, or self-employed professional, you already know that the key to higher income is growing your audience of potential customers. But as an introvert who builds energy when alone and expends energy in social situations, you probably cringe at the idea of marketing yourself. And that&#039;s why we created this course -- to help you put an end to the dread and overwhelm that you may have come to associate with the idea of marketing.  </p>  <strong style=\"\">Increase Your Income by Marketing the Way that Matches Who You Are</strong>  <p>  \t<strong style=\"\">Learn How To:</strong>  </p>  <ul style=\"\">  \t<li>Identify the perfect audience for your message</li>  \t<li>Speak to your ideal audience in a genuine way that engages and attracts them</li>  \t<li>Build relationships of trust with prospects and turn them into customers and loyal fans</li>  \t<li>Extend your reach, while maintaining your energy</li>  \t<li>Leverage technology to identify what is working best, and maximize the return on every effort</li>  \t<li>Put the fun back into running and growing a business</li>  </ul>  <p>  \t<strong style=\"\">Marketing like an Introvert means Succeeding with more Inspiration and less Drudgery</strong>  </p>  <p>  \t                                This course is taught by an expert team of business development, marketing, web design and copywriting professionals. We&#039;ve all succeeded in business as introverts, and want to help you achieve your goals by sharing some of the most important lessons we&#039;ve learned along the way. What&#039;s more, we&#039;ve created this course as a team, because we understand that despite all the characteristics we share as introverts, each of us is still incredibly unique, and has something different to offer you.  </p>  <p>  \t                This is a course that will help you find new ways of working that better fit who you are when you&#039;re at your best -- when you&#039;re enjoying your life and naturally attracting people to you in your own unique way.  </p>  <p>  \t                                We&#039;ve designed each lesson in the course from an introvert&#039;s point of view. Most lessons present <strong style=\"\">easy-to-follow</strong> marketing “How-To&quot; instructions, while others offer broader context to create overall success. In all cases, we provide you with <strong style=\"\">practical instruction</strong>, spelling out the steps you need to take, and providing hands-on <strong style=\"\">exercises</strong> so you can immediately apply what you are learning. Many of the lessons also have <strong style=\"\">handouts</strong> you can download with further ideas and insights on how to keep developing your business skills and growing your business.  </p>  <p>  \t                                Be sure to watch every lesson and give all the exercises a go. Hey, you may still not want to do some activities even after trying them with an introvert approach, but at least you&#039;ll know. At least it won&#039;t just be something you gave up on, because it seemed like something that couldn&#039;t fit your personality. It will be a choice about what you want, rather than a limitation that makes you feel denied.  </p>  <p>  \t                                At the end of this course you will have identified at least one new approach to your marketing that helps you grow your audience and income with enjoyment, instead of feeling drained and depleted.  </p>  <p>  \t<em style=\"\">Come on. Meet us in the Masterclass.</em>  </p>", 
    "end_date": null, 
    "title": "Introvert Marketing Masterclass: More Income, Less Stress", 
    "price": "30.00", 
    "instructors": "Awaken,  LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383382_5cf9_9.jpg", 
    "course_url": "https://www.udemy.com/introvert-marketing-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T19:59:49Z"
}