{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>**The #1 Landing Page Course on Udemy! with The Most Students and The Most Reviews. Join Landing Page Fundamentals <em>Today!</em>**</strong></p><p>*Updated November 2015*</p><p>  \t<strong>Apply The Strategies In This Course And You Will Increase Your Conversion Rate <em>By At Least 100%.</em></strong>  </p>  <p>  \t<strong>That's At Least Double The Amount Of Subscribers, Leads, Or Customers...</strong>  </p>  <p>  \t<strong></strong><strong>See Your Conversion Rate Double, Or Get Your Money Back. No Questions Asked. </strong>  </p>  <p>  \t<em>Buy This Course To: Increase Conversions. Increase Leads. Increase Sales. </em>  </p>  <p>  \t       The first page visitors arrive at is the most critical aspect of your website. It is also a critical part of any advertising campaign, online marketing, or contests.  </p>  <p>  \t         Yet, it is often overlooked.  </p>  <p>  \t          It is common for companies to spend hundreds of hours and $10,000s generating traffic without first optimizing their landing page.  </p>  <p>  \t         This course will show you how to increase your website or landing page conversion rate by 3 to 20 times.  </p>  <p>  \t<strong>This means 3 to 20 times more leads. </strong>  </p>  <p>  \t         Do I have your attention now?  </p>  <p>  \t                In this course, I will show you the most common mistakes designers, copywriters and internet marketers make when planning their website and landing pages. I will also teach you the strategies and tactics behind the most effective websites and landing pages, and provide a checklist of the basic elements for a successful landing page.  </p>  <p>  \t<strong>        You will learn:</strong>  </p>  <ul>  \t<li>The difference between a landing page, squeeze page, sales page and long form sales letter - <em>plus when it is best to use each one<br>  \t</em></li>  \t<li>  \t  \t\t       One Common Mistake You Can Fix To Instantly Double Your Conversion Rate  \t  \t</li>  \t<li>The Secret To Writing Killer Headlines That Keep Your Prospect Reading<br>  \t<br>  \t</li>  \t<li>How to create a customer avatar and speak directly to your visitor<br>  \t<br>  \t</li>  \t<li>Take a look behind the curtain and learn why the richest internet marketer’s squeeze pages are so effective (examples and  analysis)</li>  \t<li>  \t  \t\t       Why Benefits Sell Like Features Never Can  \t  \t</li>  \t<li>  \t  \t\t       6 Weapons Of Influence To Turn Your Prospects To Putty In Your Hands  \t  \t</li>  \t<li>  \t  \t\t       The Never Before Revealed Strategy That Ties Your Entire Website Together For Drastically Higher Conversion Rates<br>  \t  \t</li>  \t<li>  \t  \t\t       5 Best Practices Previously Reserved Only For Online Marketing Ninjas  \t  \t</li>  </ul>  <p>  \t<strong>If your job or income depends on the performance of a website, you must take this course. </strong>  </p>  <p>  \t    Even if you're not a technical person (I'm not), this course will dramatically improve your knowledge and confidence when it comes to all levels of online marketing and sales.  </p>  <p>  \t    I guarantee the content of this course will not only improve your knowledge, but it will have a direct impact on your bottom line and will increase your profits.  </p>  <p>  \t<strong><em>Enroll In This Course Now. I'll See You Inside. </em></strong>  </p>  <p>  \t<strong><em>Dan Johnston. </em></strong>  </p>", 
    "end_date": null, 
    "title": "Landing Page Fundamentals, Buyer Psychology, and Conversions", 
    "price": "30.00", 
    "instructors": "Dan Johnston", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/209292_064e_20.jpg", 
    "course_url": "https://www.udemy.com/landing-page-and-conversion-optimization/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-02T11:01:14Z"
}