{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>It's never been easier to set up a page to sell your product or service on the Internet. There are now at least a dozen services online where a business owner can set up a web page to collect email addresses and sell their product or service. And I've tried them all. I've used Wix, Unbounce, and Instapage. And I've tried the plugins for Wordpress that try to make it easier. But nothing was easy as when I set up my landing page in <strong>LeadPages</strong>.<br></p>\n\n<p>  \tIn this course, you'll see each stage of setting up LeadPages for your digital product funnel step-by-step. Together, we'll set up a landing page, ask users to give us their email in exchange for a valuable gift (a lead magnet), and then publish that page back to a Wordpress site or a Facebook page.  </p>\n\n<p>You will learn:</p>\n\n<ul><li>How a basic funnel works</li><li>Choosing your first template in <strong>LeadPages</strong></li><li>Modifying the text to suit your needs</li><li>Adding custom images to the template</li><li>Sending customers an email when they fill out the form</li><li>Getting their email addresses into your inbox</li><li>Adding third-party email providers such as <strong>MailChimp</strong></li><li><strong>A/B testing</strong> your forms</li><li>Publishing your page to your <strong>WordPress </strong>website</li><li>Publishing your page to your <strong>Facebook </strong>Page</li><li>Alternatives to Leadpages (free and paid)</li><li>And more!</li></ul>\n\n<p><br></p>\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.</p>", 
    "end_date": null, 
    "title": "LeadPages - Build a Digital Product Sales Funnel In No Time", 
    "price": "20.00", 
    "instructors": "Scott Duffy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359806_de0b_2.jpg", 
    "course_url": "https://www.udemy.com/leadpages/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T16:31:16Z"
}