{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tThis is a course that discusses the fundamental concepts from Marketing that is applied to your online marketing initiatives.</p><p style=\"\">Traditional, fundamental marketing skills are the foundation to getting ranking #1 on Google.<br style=\"\">  \t<br style=\"\">  \tThis course is great for anyone marketing a local business, which might include consultants, agencies, business owners and marketing managers.<br style=\"\">  \t<br style=\"\">  \tWhile this is a prep course for online marketing for local business, these concepts are often missed in many online marketing training.  In the end, winning on the internet comes down to quality marketing, not gaming the system.  This course covers the fundamentals of marketing to win.  </p>  <p style=\"\">  \t<strong style=\"\">Below are the 8 Concepts covered in the Internet Marketing Fundamentals for Local Business Course</strong>  </p>  <p style=\"\">  \t<strong style=\"\">1. Marketing Concepts Primer  </strong>Core marketing concepts and their descriptions that I feel are relevant concepts related to the content throughout the course. While there are many more concepts to consider, these four concepts are key to agency success.  </p>  <p style=\"\">  \t<strong style=\"\">2. Site Design Concepts and Online Campaigns </strong> This video is going to cover different philosophies that I have adopted over the years in regards to marketing and business. While there are different philosophies and mentalities towards increasing the bottom line, this is where certain principles and values that I stand by are brought into the Agency mix  </p>  <p style=\"\">  \t<strong style=\"\">3. Online Marketing Defined </strong> We are going to take online marketing principles and demonstrate how they apply to an offline business (brick-and-mortar company) to promote themselves online. We&#039;ll also look at maintaining a reputation online.  </p>  <p style=\"\">  \t<strong style=\"\">4. Find Your Customer Segment </strong> This is one of my favorites.  This video discusses strategies on defining your audience for both vertical niches and geo-located niches.  </p>  <p style=\"\">  \t<strong style=\"\">5. Driving Traffic Methods and ROI</strong> This video provides a high-level overview of the best strategies for a local business to expose themselves on the Internet. We cover search engines , e-mail marketing , search marketing including organic, PPC, and local and social media marketing.  </p>  <p style=\"\">  \t<strong style=\"\">6. Email Marketing Breakdown</strong> This video covers an overview of e-mail marketing. We&#039;ll cover niche-based e-mail marketing, Geo-based e-mail marketing, campaign segmentation and blog content strategy.  </p>  <p style=\"\">  \t<strong style=\"\">7. Web Assets To Market</strong> This video covers the online properties and assets that local businesses or Internet marketing agencies will promote in order to achieve top rankings utilizing search engine optimization. These properties include websites, blogs, social media properties, news stories, videos, video profiles, articles, article profiles reviews and data providers.  </p>  <p style=\"\">  \t<strong style=\"\">8. Search Marketing Defined</strong> This video provides an overview of the search marketing strategies such as organic search results, paid results and local search results. We&#039;ll also cover the importance of research and search marketing process.  </p>", 
    "end_date": null, 
    "title": "Learn How to Apply Marketing to SEO for Local Business", 
    "price": "20.00", 
    "instructors": "Local Marketing Source, Scott Gallagher", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433482_d9e4_4.jpg", 
    "course_url": "https://www.udemy.com/internet-marketing-fundamentals-for-local-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T22:46:40Z"
}