{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tThis local  internet marketing course is designed for 2 people.  </p>  <p style=\"\">  \t<strong style=\"\">Business owners</strong> - The world is changing VERY rapidly and  what people are trying to sell you is often times years old! In this  local internet marketing course, I am going to <strong style=\"\">walk you through everything you need</strong> to not only prepare for the  future but also be light years ahead of your competitors. The Udemy platform  is perfect for this course whether you are going to do the tasks yourself or  have someone on your team do it.  The  content remains forever!  </p>  <p style=\"\">  \t<strong style=\"\">People looking to start their own business</strong> - The local small  business space is the largest untapped resource on the internet.  Many small business owners know they need  this service but have no idea where to start.   In this course there is a special section about how we have had success  approaching clients, figuring out the pricing structure, contracts, and about  everything else.  </p>  <p style=\"\">  \t<strong style=\"\">In this local internet marketing course, I am also  going to walk you through how we:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Turned a local sandwich franchise into the top 1,2, and 3 highest grossing stores in the world!! (in Lincoln, Nebraska no less).</li>  \t<li style=\"\">Filled a dentist office with clients for 90 days with the exact core demographic they were looking for (they had to call us and tell us to stop!).</li>  \t<li style=\"\">And many more case studies.</li>  </ul>  <p style=\"\">  \tSo as you  can see, no matter if you are a small business OR a person looking to offer  local businesses these services,  <strong style=\"\">this local internet marketing course is a  **MUST HAVE!!! **</strong>  </p>  <p style=\"\">  \tI have sold over 3  million dollars in informational courses.   Most of which at the $2,000 price point.   I feel this is probably the most valuable one I have ever put out. The  content is amazing and the opportunity is HUGE.  </p>  <p style=\"\">  \t<strong style=\"\">Chapters Include: </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Working with the client</li>  \t<li style=\"\">Step by step walk throughs to optimize your web presense (SEO, Tracking, etc)</li>  \t<li style=\"\">Reputation Management (Don't wait until its too late!!!)</li>  \t<li style=\"\">Search engine optimization</li>  \t<li style=\"\">Case studies</li>  \t<li style=\"\">Walk throughs</li>  </ul>  <div style=\"\">  \t<p style=\"\">  \t\t<strong style=\"\">Take this local internet marketing course now!!!</strong>  \t</p>  </div>", 
    "end_date": null, 
    "title": "Local Marketing Blue Print", 
    "price": "20.00", 
    "instructors": "Jeremy Schoemaker", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17158_ea75_8.jpg", 
    "course_url": "https://www.udemy.com/local-marketing-blue-print/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-02T18:29:47Z"
}