{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Dear Online Entrepreneur,  </p>  <p>  \t <strong>Are you looking to make a passive income?</strong>  </p>  <p>  \t <strong>Do you want to be able to live an easy life?</strong>  </p>  <p>  \t <strong>Are you tired of wasting your money on courses that don’t deliver?</strong>  </p>  <p>  \t <strong>Do you want to learn how you make more sales?</strong>  </p>  <p>  \t <strong>Then Local Marketing Classroom is what you need!</strong>  </p>  <p>  \t <strong>You can now…</strong>  </p>  <p>  \t <strong>Learn how to Generate Leads for Local Businesses and Close Offline Deals!</strong>  </p>  <p>  \t <strong>It’s that simple! </strong>  </p>  <p>  \t Everywhere you turn these days marketers are selling offline folks on the benefits of online promotions. Website designers, social media marketers, and SEO specialists are all out there pounding the pavement, looking to help the corner store make a splash online. But there&#039;s another, less talked about connection: online businesses moving OFFline. And if your online business isn&#039;t poised to take advantage of this opportunity, you might just be missing out on something big. <br>  \t<br>  \t  Consider the small, offline business owner who is desperately in need of an administrative assistant. He doesn&#039;t have time to read his own email let alone search the Google listings for a virtual assistant. In fact, he probably doesn&#039;t even know what a VA is, let alone how to find one. But if you introduce yourself and your VA business and explain how you can help him be more efficient and work fewer hours, chances are he&#039;ll be interested. <br>  \t<br>  \t  You&#039;ve just got to get your message in front of him.  </p>  <p>  \t <strong><br>  \t </strong>  </p>  <p>  \t <strong>Why do you want to learn how to generate leads and convert them? </strong>  </p>  <p>  \t Because, no matter what product or service you’re selling, you need one thing: people to buy it. And you could have the best service or product, but if nobody knows about it, if nobody buys it, you’re soon going to be out of business.  </p>  <p>  \t <strong>Successful marketing</strong>, be it online or offline <strong>is about two things</strong>: <strong>Generating Leads and Closing Deals! </strong>  </p>  <p>  \t <strong>Local Marketing Classroom helps you do just that!</strong>  </p>  <p>  \t <strong>Why would you want to work with local business? </strong>  </p>  <p>  \t Today, all the focus is on the online, right? So, how can you make a nice passive income by working with local businesses?  </p>  <p>  \t Well, local businesses need to have a web presence. But, that web presence, needs to sale, to draw leads. And you’ll be able to take advantage of this.  </p>  <p>  \t Plus working with local businesses:  </p>  <ul>  \t<li> Is more lucrative</li>  \t<li> Cuts the middle man</li>  \t<li>You can actually know the person you’re working for</li>  \t<li> Is more personal </li>  \t<li>Brings more money</li>  \t<li>Takes less time </li>  </ul>  <p>  \t <strong>Here’s where it all becomes more beautiful and simple: </strong>  </p>  <p>  \t When it comes to lead generation for local business you can go two ways:  </p>  <ul>  \t<li>Generate leads and sell them directly to interested companies </li>  \t<li> Find companies that broker deals and act as a middleman</li>  </ul>  <p>  \t Out of the two options, the latter is the most lucrative:  </p>  <ul>  \t<li>You generate leads for companies who know what they want</li>  \t<li>You get a specific percentage of what those companies make</li>  \t<li>You get constant work </li>  \t<li>You get constant money </li>  </ul>  <p>  \t And what’s even more beautiful is that you don’t have to find clients, or any of that. You simply have to generate leads! And this course is going to teach you how to do just that so you’ll be able to sit back and see how you start making money easily and constantly!  </p>  <p>  \t <strong>So, what will Local Marketing Classroom teach you? </strong>  </p>  <ul>  \t<li>How this actually works </li>  \t<li> How to generate leads for brokering companies</li>  \t<li>How to find the lead niche </li>  \t<li>How to use demographics to your advantage</li>  \t<li> How to do keyword research </li>  \t<li>How to do LSI keyword research</li>  \t<li>How to find keyword domain names </li>  \t<li>How to make your site look professional</li>  \t<li>How to create videos that will generate leads </li>  \t<li>How to upload your videos on YouTube (and get the leads)</li>  </ul>  <p>  \t And that’s not it!  </p>  <ul>  \t<li>How to create amazing and responsive offline offers </li>  \t<li>How to learn the problems and take care of them beforehand</li>  \t<li>How to offer results before traffic</li>  \t<li>How to find clients</li>  \t<li>How to close the deal with clients</li>  \t<li>How to outsource everything </li>  \t<li>How to establish yourself as a professional</li>  </ul>  <p>  \t <br>  \t <strong>Order now Local Marketing Classroom!</strong><br>  \t <br>  \t This is an amazing opportunity!  </p>  <p>  \t Remember: you get a full system, that’s going to teach you everything that you need to know to build a business that will offer you a passive income from scratch! And you’ll also learn how to let others do the work for you, while you sit back and enjoy the benefits!  </p>  <p>  \t Overview of what you get:  </p>  <ul>  \t<li>38 videos </li>  \t<li>Proven system to generate leads</li>  \t<li>Spot-on tactics to help you get clients </li>  \t<li>Amazing information to help outsource everything </li>  \t<li>And much, much more…</li>  </ul>  <p>  \t <strong>Sign Up Today<br>  \t </strong>  </p>  <p>  \t This really is a once in a life time opportunity!  </p>  <p>  \t Get a system:  </p>  <ul>  \t<li>  \t<p>  \t\t That offers precise information  \t</p>  \t</li>  \t<li>That offers step by step directions </li>  \t<li>That provides you with secrets that everybody keeps from you </li>  \t<li>That’s guaranteed to help you make money! </li>  </ul>  <p>  \t Why would you waste another moment? If you truly want to take control of your destiny, start now! It’s easy to do it if you follow the information provided in <strong>Local Marketing Classroom! </strong>  </p>  <p>  \t This is what you’ve been waiting for! It’s time to really make a difference and start earning money! Why miss on this opportunity when you could start making a passive income tomorrow and see how your dreams turn into reality?  </p>  <p>  \t <strong>Order Local Marketing Classroom now and start living your dreams! </strong>  </p>", 
    "end_date": null, 
    "title": "Local Business Marketing Classroom", 
    "price": "25.00", 
    "instructors": "Earners Classroom, Mikel Costa", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/74528_d7e0_6.jpg", 
    "course_url": "https://www.udemy.com/local-business-marketing-classroom/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-06T14:55:05Z"
}