{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<span style=\" color:rgb(85, 85, 85);\">Marketing can be the spark of life for organizations.  Many people however misunderstand the fundamentals of marketing.</span>  </p>  <h4 style=\"\">&quot;Business has only two functions – Marketing and Innovation.”  ~ Milan Kundera</h4>  <p style=\"\">  \t          You don&#039;t need to be a marketer to benefit from this course.  Being marketing-driven means looking at everything a company does from a customer point of view.  Many believe that organizations should be marketing-centric - in other words, start with marketing before anything else to understand if there is an actual need for the product or service and if so how much.  </p>  <h4 style=\"\">“Marketing is no longer about the stuff that you make but about the stories you tell.” - Seth Godin</h4>  <p style=\"\">  \t    In this course, you will learn the core elements of marketing from a CEO / CMO perspective.  You will learn:  </p>  <ul style=\"\">  \t<li style=\"\">What marketing is and what it means to be a marketer.</li>  \t<li style=\"\">Branding and how to create a brand architecture</li>  \t<li style=\"\">Brand promise, brand positioning and brand personality</li>  \t<li style=\"\">Points of difference, points of parity and rational and emotional benefits</li>  \t<li style=\"\">Example of great brands and branding</li>  \t<li style=\"\">Style guides, why they matter, and how to create one</li>  \t<li style=\"\">How do conduct market research</li>  \t<li style=\"\">How to create a buyer persona</li>  \t<li style=\"\">How to create campaigns towards your buying personas</li>  \t<li style=\"\">Understanding the customer journey</li>  </ul>  <h4 style=\"\">“Marketing is too important to be left to the marketing department.” ~ David Packard</h4>  <p style=\"\">  \t    Once you complete this course, you should understand the basics of marketing, and how to think, sound and act like a marketer.  If Marketing is your desired field, you should be more employable and valuable as a marketer.  Additionally you will receive exclusive downloadable marketing templates, tips, guides and tips related to the course material that you can use throughout your career.  </p>  <h4 style=\"\">“The aim of marketing is to know and understand the customer so well the product or service fits him and sells itself.” ~ Peter F. Drucker</h4>", 
    "end_date": null, 
    "title": "Marketing Fundamentals", 
    "price": 0, 
    "instructors": "Jobs University LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378936_50f0_6.jpg", 
    "course_url": "https://www.udemy.com/marketing-fundamentals/", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-28T03:55:28Z"
}