{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Learn the marketing mistakes that most businesses make - and find out exactly how to avoid them.</p><p>After reviewing many businesses (even my own) I have identified a number of mistakes that most businesses make and how crucial it is to avoid these at all costs. Not only will it save you lots of money, but it will also save you an incredible amount of effort as well.</p><p>You will be shown why most marketing material is completely wrong! Your focus in your marketing material needs to be re-engineered from the ground up. You will learn who the customer or prospect cares about most and how you can tap into this psychology.</p><p>In addition, you will learn how to avoid becoming a \"me too\" company and why competing on price is the worst decision you can make, You will learn how to compete on value - the most critical factor to the customer.</p><p>You will be able to master the three ways to increase your business and also learn how to win the easiest sale (the easiest sale is right in front of you!)</p><p>This course comes with a 30 day money back guarantee so enroll today</p>", 
    "end_date": null, 
    "title": "Marketing Death Trap - Learn How To Save Your Business Now!", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658298_64e6_3.jpg", 
    "course_url": "https://www.udemy.com/marketing-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T23:20:18Z"
}