{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Do you need <strong style=\"\"><em style=\"\">a system for creating more customers</em></strong> in your retail business? </p><p style=\"\">Do you need <strong style=\"\"><em style=\"\">proven marketing and sales strategies</em></strong> that are low cost and deliver consistent results? </p><p style=\"\">Do you need marketing &amp; systems training that is easy, short and fun? Training specifically <strong style=\"\"><em style=\"\">designed </em></strong><strong style=\"\"><em style=\"\">for busy business owners</em></strong>...</p><p style=\"\">This is the course <strong style=\"\">I wish I had 7 yrs ago</strong> when I first started Shady Designs here in Sydney, Australia</p><p style=\"\">The course which contains <strong style=\"\">frameworks</strong> that I&#039;ll continue to use in 7 years time</p><p style=\"\">If I ever sell my business, the person who buys my business will use this course to impliment all my<strong style=\"\"> tactics, strategies and training</strong>, continuing to grow this business and double its profits </p><p style=\"\">I designed this course with a specific person in mind, my business partner and wife Lisa</p><p style=\"\">We have a retail store and factory which specialises in bespoke designer lampshades handmade to order</p><p style=\"\">Lisa is the creative side of the business and I manage all the sales, marketing and operations</p><p style=\"\">On a recent holiday, I was watching the tv in an airport departure lounge. On the news was a frightening Air Asia plane crash</p><p style=\"\">It made me think, If I died in a plane crash - Lisa doesn&#039;t have a system in place to execute all of my marketing &amp; sales plans </p><p style=\"\">Systems which I impliment in the business that help <strong style=\"\">double our profits</strong> consistently every two years since we started</p><p style=\"\">These short 15 minute training modules will give you <strong style=\"\">focus, key strategies and templates</strong> that are vital to growing your business in a systematic way</p><p style=\"\">What are the important projects that you can impliment straight away putting cash in your pocket and giving you <strong style=\"\"><em style=\"\">more spare</em></strong><strong style=\"\"><em style=\"\"> time</em></strong> to spend with family and loved ones</p><p style=\"\">Tactics and strtategies which you can impliment over 7 days, 7 weeks or 7 months</p><p style=\"\">This course is a <em style=\"\"><strong style=\"\">culmination of tens of thousands of dollars in training courses</strong></em>, 10 years of real world hardcore retail selling... all put into one neat little short course</p><p style=\"\">Discover how we took our little garage business from startup at a local flea market to what it is today employing full time staff with a sales network all over Australia </p><p style=\"\">What are the <strong style=\"\">low cost tools and tactics</strong> that we can use in our business that are more important than anything else</p><p style=\"\">How can we make our business easy, lucrative and fun </p><p style=\"\"><strong style=\"\">By</strong> <strong style=\"\">focusing on the one thing that I can do that will make everything else easy or not necessary at all</strong> </p><p style=\"\">Join me as I take you on an inspiring journey which is <strong style=\"\">H</strong><strong style=\"\">andmade Marketing</strong> by Shady Designs</p>", 
    "end_date": null, 
    "title": "Marketing for Retail Stores and Sellers of Handmade Products", 
    "price": "25.00", 
    "instructors": "Arif Imran", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473186_abaa_6.jpg", 
    "course_url": "https://www.udemy.com/marketing-for-retail-stores-and-crafters-selling-handmade/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T23:44:28Z"
}