{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Discover the Power of Introverts to Attract a Following</strong>  </p>  <p>  \t  Do you enjoy being alone? Prefer keeping your personal life to yourself? Hate small talk? Wish the people you do business with would stop yakking and get to the point?  </p>  <p>  \t  If so, you may have been told you must change your personality if you want to be successful in business.This is nonsense! Pretending that you’re an extrovert drains you of energy. But honoring your introvert leanings empowers you and fires you up in a way that your ideal clients find magnetic.  </p>  <p>  \t  Introverts can attract customers extremely well if you respect and use your natural tendencies.  </p>  <p>  \t  In this webinar-style video course, you discover dozens of ways in which you can approach networking, publicity, getting published, speaking in public and other common marketing activities while being true to your introvert talents, personality strengths, likes and dislikes.  </p>  <p>  \t  And if you’re not an introvert yourself but have clients, partners, staff members or colleagues who are, you’ll learn about the effectiveness they can achieve if you give them the flexibility to bring in business their way.  </p>  <p>  \t  A bookworm as a child, course presenter Marcia Yudkin grew up to discover she had a surprising talent for creative marketing. Her credentials include a Book of the Month Club selection, two books featured on the Oprah Winfrey Show, commentaries on National Public Radio, publicity on page one of the Wall Street Journal and other newspapers throughout the world and a reputation as a word lover who isn’t afraid to express an unconventional opinion. She also mentors introverts so they discover their uniquely powerful branding and most comfortable marketing strategies.  </p>  <p>  \t  Note: If you are hearing-impaired, speak English as a second (or third) language or just like to review content quickly, you’ll be glad to know that this course includes the written transcript of each video lesson. It also includes several worksheets.  </p>  <p>  \t  Lessons you’ll take away from Marketing for Introverts include:  </p>  <ul style=\"\">  \t<li>Who is      introverted and how it is different from being shy</li>  \t<li>Five      common traits of introverts that relate to marketing choices</li>  \t<li>What      to do about marketing “shoulds” that you can’t embrace</li>  \t<li>Introvert      strengths that have outstanding value in the marketplace</li>  \t<li>Five      ways to use video marketing besides appearing as a “talking head” </li>  </ul>  <ul style=\"\">  \t<li>Styles      and situations of public speaking that suit you well</li>  \t<li>Secrets      of comfortably networking without turning into a gladhandler</li>  \t<li>Why      one-on-one marketing can add up impressively for you</li>  \t<li>Five      challenges to handle in publishing even if you love to write</li>  \t<li>How to      enjoy 15 minutes (or 15 years) in the media spotlight</li>  </ul>  <ul style=\"\">  \t<li>Why      product development can be a stellar marketing vehicle for you</li>  \t<li>Adjustments      to social media marketing that tame its downsides for introverts</li>  \t<li>Four      little-known types of introvert charisma</li>  \t<li>Client-attracting      and authentic personal branding tips</li>  </ul>  <ul style=\"\">  \t<li>Copywriting      techniques that showcase your introvert advantages</li>  \t<li>How to      work smoothly with extroverts - and vice versa</li>  \t<li>Ten      famous introverts whose careers offer valuable insights</li>  \t<li>Your      action plan for implementing ideas and discoveries from the course</li>  </ul>  <p>  \t  Remember that you have lifetime access to the course after you enroll, so you can review the advice and suggestions from time to time as your comfort with marketing your own way develops and deepens.  </p>  <p>  \t  An earlier version of this course was written up in the<em style=\"\"> Philadelphia Inquirer. </em>  </p>  <p>  \tStop the suffering that comes from struggling to be someone you’re not. Declare your introvert independence and enjoy the success that comes from making the most of who you are. Sign up today and begin roaring along on the quiet path to fame and fortune.  </p>  <p>  </p>", 
    "end_date": null, 
    "title": "Marketing for Introverts: How Quiet Ones Can Zing", 
    "price": "35.00", 
    "instructors": "Marcia Yudkin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/133522_a542_6.jpg", 
    "course_url": "https://www.udemy.com/marketing-for-introverts/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-14T13:09:26Z"
}