{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Owning a small business, you juggle many balls in the air - and with only 24 hours in a day, it can be difficult to focus on marketing your business.  </p>  <p>  \t      One of the biggest challenges I see when I work with small business owners is that marketing your business can often be a little bit like throwing mud at the wall and seeing what sticks.  </p>  <p>  \t      And it's easy to get overwhelmed by all the marketing strategies and tactics we should engage in. I was recently speaking on marketing at a large sales conference and one audience member stood out to me. After listening to speaker after speaker talking about how to market and sell, he simply asked “how am I supposed to do all that and still run my business?\" That question really stuck with me because it summed up how many small business owners feel. And the answer to it is: you can't do it all – not at the same time anyways. So how do you do it? Follow a SMART marketing plan that incorporates basic marketing fundamentals - a solid system that will guide you. Marketing your business isn't a giant leap, but it's the discipline of putting one foot in front of the other one, day after day, rain or shine.  </p>  <p>  \t      Small business owners often focus on marketing their business when business is down and do a good job giving it a strong push to increase sales. But once the business gets busier (and other areas of the business need attention – the team is growing, product or service lines are expanding), less attention is giving to marketing. After all the business is running well now… but it's not. Without constantly giving attention to your marketing to feed your sales funnel, you will create a rollercoaster business that's up when you market your business and goes down when you pay less attention to your marketing. Sounds familiar?  </p>  <p>  \t      In this course I will share with you the blueprint to your marketing success.</p>  <p>  \t      <strong>You will learn about:</strong>  </p>  <p>  \t<strong>Your Target Market:</strong> You will learn why identifying your target market is critical to your business success and how to define the target market for YOUR business.  </p>    <p>  \t<strong>Your Market Positioning: </strong> \tWhat does your business stand for, what value do you provide and what makes you unique?  You will learn why the answers to these questions are key to communicating your market positioning to your prospects and clients.  </p>    <p>  \t<strong>Websites: </strong> \tYour website is the centre of your digital marketing universe. Do you have a website, and if so, is it performing well? You will learn about the key components to building a successful website and how you can work on this right now.  </p>  <p>  \t<strong>Blogging:</strong>  \tAre you writing a blog? If the answer is “yes\", congratulations! I'll teach you how you can tweak your blog to be an even better marketing tool for your business. If the answer is “no\", I'll ask you to please revise this answer to “not yet\". A blog is a cost effective and easy to implement marketing tool (and yes, you can write!)  </p>  <p>  \t<strong>Social Media: </strong>Without doubt, social media is a “must\" in today's marketing, but it's also the most overwhelming part of marketing for small business owners. I will teach you how to develop a successful social media strategy that is sustainable for your business.  </p>  <p>  \t<strong>Email Marketing: </strong>Email marketing should be a component in any small business' marketing mix – and it's also one marketing tactic that can be highly automated and systematized. You will learn how email marketing can help you build lasting relationships with your prospects and clients.</p>  <p>  \t<strong>Video Marketing: </strong>Are you doing any video marketing yet? It's easy to get started (and cost effective, not to say free!). Learn why video marketing is so powerful and how you can make it work for your business.  </p>  <p>  \t<strong>Offline Marketing</strong> - <strong>Print:</strong>  \tI have owned a digital printing company for over 18 years, and print is still close to my heart. It's a powerful marketing tool that will help you drive traffic to your online marketing channels. Learn how you can have big results on a shoestring budget.  </p>  <p>  \t<strong>Offline Marketing - Direct Mail:</strong>  \tI call direct mail a secret weapon when it comes to marketing. Learn why and how you can tap into this “secret weapon\" for your business.  </p>  <p><strong>Why should you buy this course?</strong></p><p>It will help you grow your business! We cover strategies and tactics that are proven to increase sales and profits and each lecture is followed by an exercise that will encourage you to implement what you have learned right away (knowledge is power, but only when acted upon!).</p><p>I have created this course for every small business owner out there who wants to grow their business. I am an entrepreneur and small business owner myself and I believe that most businesses started out as someone's dream…and I am here to ensure that the dream has a solid foundation beneath it. </p><p><strong>If you are ready to take the next step...</strong>and go from “throwing mud at the wall\" and seeing what sticks to creating a sustainable, results-oriented marketing system for your business, click on \"take this course\" at the top of this page. It's that simple (and since every Udemy course comes with a 30-day money back guarantee... you have everything to gain and nothing to loose!)</p>", 
    "end_date": null, 
    "title": "Marketing Fundamentals - Small Business Marketing Success", 
    "price": "25.00", 
    "instructors": "Alexandra Krieger", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301746_3a6b_3.jpg", 
    "course_url": "https://www.udemy.com/smart-marketing-for-small-business-owners/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T03:05:29Z"
}