{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Do you want to spend less time and money marketing?  Do you want to easily find more ideal prospects who then become paying customers?</strong>   You are in the right place because this high quality and interactive course by Louise Anne Maurice of 90 Day Guru E-Learning was created for you and <strong>recently updated April 1, 2016.</strong></p>\n\n<p><strong>Marketing Fundamentals for Life Coaches, Online Teachers and Authors</strong> <strong>is for you if:</strong></p>\n\n\n\n<ul><li>You are currently a Kindle Author, Udemy Instructor, Life Coach or Consultant and see the potential of having a <strong>steady stream of readers, students and clients</strong> but you want the best step-by-step guidance for how to do market research.</li><li>You want <strong>customer segmentation samples, market research strategies and target market examples</strong> that you'll follow and have already been tested and proven to work.</li><li>You would like logical ways to find your i<strong>deal target market</strong> that will inspire you to continue writing, creating courses and developing coach programs and consulting services.</li><li>You would like to <strong>know who you are marketing to</strong> so that you can connect with your ideal customer in the shortest amount of time possible.</li><li>You are ready to find your <strong>target market and niche</strong> but just need to know the foundation pieces so you feel more confident that you are doing it right.</li></ul>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong>Why take</strong> <strong><strong>Marketing Fundamentals for Life Coaches, Online Teachers and Authors</strong>?</strong></p>\n\n\n\n<ul><li>This is why you are here because you want to know about the <strong>marketing fundamentals</strong> that most business people miss; <strong>how to create a target marketing plan</strong> that you can follow.</li><li>Now keep this in mind - Every piece of advice, strategy and logical approach to market research has been tested; none of this is theory</li></ul>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong>What is covered in </strong><strong><strong>Marketing Fundamentals for Life Coaches, Online Teachers and Authors</strong>?</strong></p>\n\n\n\n<ol><li>Walk away with frameworks for using marketing research, customer segmentation and target marketing to find more ideal customers who buy your services, courses and books.</li><li>Learn easy marketing research strategies and be guided step-by-step to learn how to do market research in less time</li><li>Uncover ideal target market segments, how to find your target market and target market strategy</li><li>Look over my shoulder and learn everything about customer segmentation, how to do psychographic segmentation, demographic segmentation and geographic segmentation</li><li>Develop the necessary skills to conduct marketing research anytime plus learn how to develop a market research survey</li><li>Uncover who you are marketing to and be given guidance to make adjustments</li><li>Follow a simple market research success formula that will help you find more readers, students and clients moving forward</li></ol>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong>How will </strong><strong><strong>Marketing Fundamentals for Life Coaches, Online Teachers and Authors</strong> benefit you?</strong></p>\n\n\n\n<ul><li>In this course, you learn the exact steps you need to know to conduct <strong>market research that you can follow for success as an Author, Udemy Instructor, Life Coach or Consultant. </strong></li><li>You get <strong>customer segmentation insights</strong> that only a professional with my background can give you.</li><li>You get the <strong>inside track on what you need to do to develop a target marketing plan</strong> from nothing plus what you need to do to follow through.</li><li>If that's something you would like to achieve, you have selected <strong>the right marketing fundamentals course</strong> to take.</li><li>If you complete this entire course and implement everything you learn you will have <strong>completed customer profiles, market research and know who your target market is </strong>and how you help them.</li><li> Remember, it doesn't matter if you are new or already in full swing, I've been there and I can show you exactly what you need to do to make it happen.</li></ul>\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n<p><strong>W</strong><strong>hen Can You Take </strong><strong><strong>Marketing Fundamentals for Life Coaches, Online Teachers and Authors</strong>?</strong></p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<ul><li>What are you waiting for? If you’re looking for a course to learn how to spend less time and money marketing yet easily find more ideal prospects who then become paying customers<strong>,</strong> then look no further.</li><li>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</li><li>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; <strong>NO EXTRA COST TO YOU.</strong></li><li><strong>REMEMBER</strong>: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</li><li>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</li></ul>\n\n\n\n<p>******************************************************************************************************************</p>\n\n\n\n<p>Still not convinced? Make sure you watch some of the <strong>FREE PREVIEWS</strong> available to learn more about the course and more about me your instructor. Plus you can check out some of the reviews. Here is just one of the many examples:</p>\n\n\n\n<p><strong>What people are saying about <strong>Marketing Fundamentals for Life Coaches, Online Teachers and Authors</strong> </strong><strong>created by Louise Anne Maurice of 90 Day Guru E-Learning?</strong></p>\n\n\n\n<p><em>\"Great Course - This course was informative and the instructor makes things easy to understand. I know a lot more about these topics now. I liked the step-by-step way the lectures flowed, the templates that were done for me, the checklists and the great downloads. Thank you.\"</em></p>\n\n\n\n<p>*****************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "Marketing Fundamentals for Life Coaches Teachers and Authors", 
    "price": "20.00", 
    "instructors": "90 Day Guru® E-Learning, Louise Anne Maurice", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561926_c136_3.jpg", 
    "course_url": "https://www.udemy.com/marketing-research-customer-segmentation-target-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T19:35:16Z"
}