{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Marketing Fundamentals - 5 Pillars - Learn-Apply-Earn</strong> - Learn The Fundamentals Of Marketing And Build Your Online Business Especially If You Are A Complete Beginner  </p>    <p>  \t<strong>**MORE THAN 1000 SUCCESSFUL STUDENTS ENROLLED AND 15 FIVE STARS** </strong></p><p><strong>**30 DAYS MONEY BACK = NO RISK**</strong>  \t<strong></strong>  </p>  <p>  \t<strong>My Students Say:</strong></p><ul><em></em><li><strong><em>\"BEST Marketing Course on Udemy\"</em></strong></li></ul><p><em>\"This is the real deal :) No fluff, just genuine, valuable information through and through. Which is very hard to come by as I feel a lot of marketers withhold information and knowledge just so they can make more money on their next ebook, course, etc. but you won't find any of that here. I highly recommend the course to anyone interested in learning more about marketing fundamentals.\" -  Youngin</em></p>  <ul><li><strong><em>\"The Best Marketing Course I've Ever Taken\"</em></strong><em></em></li><li><em><strong>\"Beginner's marketing blueprint and action plan\"</strong></em></li><li><em><strong>\"Clear, well presented and engaging!\"</strong></em></li><li><em><strong>\"Marketing made easy!\"</strong></em></li><li><em><strong>\"I Highly Recommend This Course\"</strong></em></li><li><em></em><strong><em>\"Outstanding Experience</em><em>\"</em></strong></li></ul><p><strong></strong></p><p><strong>\"WHAT AM I GOING TO LEARN?\"</strong>  </p>  <ol>  \t<li><strong>You will learn how to design a powerful name for your product(s).  </strong></li>  \t<li><strong>                           You will learn how to create an imaginary customer. (a crucial concept)  </strong></li>  \t<li><strong>                           You will learn how to price your product(s) and different pricing strategies.  </strong></li>  \t<li><strong>                           You will learn how to craft your promotional message that sells.  </strong></li>  \t<li><strong>                           You will learn different online  marketing channels that you can use to put your  message in front of  your prospective customer's eyes - and much, much more.  </strong></li>  </ol>    <p>  \t<strong>Please watch the “preview\" lectures, as I share 28 minutes high quality content and you will have a better understanding whether this marketing and business course is for you!</strong>  </p>  <p>  \t                                                                                          My name is Vladimir Raykov. I work as a <strong>Marketing Manager</strong>, I have a Bachelor's degree in <strong>Marketing</strong>, and I do online marketing business with my own digital products (eBook and eCourses). I became interested in online marketing several years ago and from then on, I have never stopped learning.  </p>  <p>  \t                                                               The reason I've created “<strong><strong>Marketing Fundamentals - 5 Pillars - Learn-Apply-Earn</strong></strong><strong>!</strong>\" is because I'd like to provide you with a <strong>solid foundation (the missing ingredient)</strong> on which you can build your online business.  </p>  <p>  \t<strong>In this very moment, people are making millions online.</strong> All those people have something in common – <strong>KNOWLEDGE!</strong> They have invested time to educate themselves. They understand the importance of acquiring new skills and honing existing ones.  </p>  <p>  \t<strong>There are many courses right now</strong>, promising that you would make huge number: <strong>6 or 7 figure incomes. </strong>SECRET software and tactics or tricks… well, you will get nothing of that fluff here in my course.  </p>  <p>  \t          Mind you, this course is <strong>NOT</strong> about getting rich quickly – if you are looking for this, you won't find it here and I advise you NOT to enroll in my course.  </p>  <p>  \t<strong>In this Marketing course,</strong> I'm sharing my experience and knowledge with you that I've been gathering more than 6 years now. You will learn about the most important pillars of marketing, and namely: Product, Price, Place, Promotion, and Customer.  </p>  <p>  \t<strong>This course it is not just plain theory!</strong> You are not going to be a passive student. Yes, I teach you the theory because you need it (after all this is a course about marketing fundamentals), but then I integrate the theory with practise, so you start gaining experience right from the beginning of your marketing career.<strong> </strong>  </p>    <p>  \t<strong>NOT ONLY WILL YOU LEARN</strong>, you will be required to <strong>practise </strong>what you've learned – see all the “<strong>Take Action</strong>\" PDFs after each chapter. You will have to download these files and write directly on them.  </p>  <p>  \t                                                                                   I've included a <strong>GREAT BONUS</strong>, too:  </p>      <p>  \t<strong>Everything you need to know about WordPress</strong> and how to start your own blog that in time will generate you an online income. <strong>(regular value $37)</strong>  </p>  <p>  \t<strong>Remember, you have nothing to risk!</strong> The investment you make now will pay you back many times in the future. I've spent a lot of time working on this course. I provide you with a high quality audio and full HD videos. I believe in my course and I am sure you will love it. If, however, for some reason you are dissatisfied or the course is not what you've expected – no worries, you <strong>have 30 days money back guarantee – NO QUESTIONS ASKED!</strong>  </p>  <p>  \t                                                                                   So, in short here is my proposal:  </p>  <ul>  \t<li>My course is going to teach you the <strong>fundamentals of marketing</strong> – product, price, place, promotion, and customer.  </li>  </ul>    <ul>  \t<li>Once, you have these in place, you are ready to <strong>start building your online business</strong> (my bonuses will help you with that). You will become a member of our marketing community – we share knowledge and experience.  </li>  </ul>    <ul>  \t<li>All of the information you will be presented is <strong>high quality HD videos with a perfect sound.</strong> You have access to great bonuses that will become more and more with the time.  </li>  </ul>    <p>  \t                                                                                   If this sounds appealing to you, please click on “<strong>Take This Course</strong>\" button.  </p>To your success,    <p>  \t                                                                                   -Vladimir Raykov  </p>", 
    "end_date": null, 
    "title": "Marketing Fundamentals - 5 Pillars - Learn-Apply-Earn", 
    "price": "50.00", 
    "instructors": "Vladimir Raykov", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332662_efe1_6.jpg", 
    "course_url": "https://www.udemy.com/marketing-fundamentals-become-a-marketer-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T14:15:31Z"
}