{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">All businesses need marketing to communicate their product or service to their potential customers or audience. Marketing managers form marketing strategies from analysis of market segments and implement marketing plans to bring value to their company&#039;s product or service. Today, marketing is moving fast and it is essential to know the fundamentals as well as the newest industry trends if you want to have an effective marketing campaign.</p><p style=\"\"><strong style=\"\">Achieve marketing success for with this comprehensive course.</strong></p><ul style=\"\"><li style=\"\">Learn the Foundations of Marketing</li><li style=\"\">Assess Market Potential and Opportunities</li><li style=\"\">Measure and Forecast Market Demand</li><li style=\"\">Implement Branding and Positioning Strategies</li></ul><p style=\"\"><strong style=\"\">Become a Market Guru</strong></p><p style=\"\">Knowing the terms and definitions will help you understand current marketing concepts and methods. This course&#039;s detailed lectures and lessons will teach you how marketing works. Use the knowledge of how companies market to excel at your career or take your business&#039;s message to your potential customers. Whether you are at the beginning stages of starting your own company or a seasoned businessperson, this course will give you the knowledge critical to communicating value to your target audience.</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">Building from the ground up, this course begins with the fundamentals of marketing terminology and advances onto the latest techniques for analyzing market segments and potential opportunities. The Marketing Mania: Fundamentals of Marketing course covers all of the crucial marketing practices including customer relationship management and what methods work for what type of businesses. This courses lectures, lessons, videos, and quizzes will prepare you for successful marketing in today&#039;s fast evolving business environment.</p><p style=\"\">The marketing tools provided in this course are the keys to success for your company or your career.</p>", 
    "end_date": null, 
    "title": "Marketing Mania: Fundamentals of Marketing Management ", 
    "price": "25.00", 
    "instructors": "Global Finance School", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443496_9057.jpg", 
    "course_url": "https://www.udemy.com/marketing-mania-fundamentals-of-marketing-management/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T07:45:59Z"
}