{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tWhether you just have a product idea, or have already created a product, the determining factor of whether it will sell or not depends on your market.  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">How do you know your idea will sell? Or worse – will it flop?<br style=\"\">  \t</em></li>  \t<li style=\"\"><strong style=\"\">Have you done the proper research to know that there is indeed a buyer’s market?<br style=\"\">  \t</strong></li>  \t<li style=\"\"><em style=\"\">And if there is, where are they located? Are they in other countries besides the one you&#039;re looking at?<br style=\"\">  \t</em></li>  \t<li style=\"\"><strong style=\"\">Where are your buyers hanging out? What sites do they visit? How can you reach them?<br style=\"\">  \t</strong></li>  \t<li style=\"\"><em style=\"\">Are there any competitors in your market? Who are they? What are they doing that you aren&#039;t? What are </em>you<em style=\"\"> doing that </em>they<em style=\"\"> aren&#039;t?</em></li>  </ul>  <p style=\"\">  \t      These are all great questions that you need to ask yourself before you jump into any market. So as you can see, doing proper market research is very important.  </p>  <p style=\"\">  \t      And digging even deeper into the market to see what sort of things buyers are saying they like or don&#039;t like is also important. This helps you create a better product or service, or improve your existing one, to be exactly what your potential buyers want.  </p>  <p style=\"\">  \t      So whether you have an idea you &quot;think will sell,&quot; or you have a product or service already created, you&#039;ll have the peace of mind that you&#039;re doing the right thing, and ensure that you have done everything in your power to know whether or not your idea will sell.  </p>  <p style=\"\">  \t      This course will help you better understand how to examine your market further to uncover what your buyers really want – which is the most important aspect in developing your product or service. It’s really too easy to create a product or service around what we “think is correct” vs. putting ourselves in our potential customer’s shoes.  </p>", 
    "end_date": null, 
    "title": "Market Research Fast Track", 
    "price": "20.00", 
    "instructors": "Veronica J. Kirchoff, MyBizBuilders Team", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/155798_78e1_2.jpg", 
    "course_url": "https://www.udemy.com/market-research-fast-track/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-31T09:42:51Z"
}