{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>++<strong>NOW UPDATED WITH DIGITAL MARKETING RESEARCH SOLD SEPARATELY FOR EXTRA $67++</strong></strong></p><p><strong><strong>SECTION 7 COMPLETE SLIDES SETS FOR MARKETING RESEARCH AND DIGITAL MARKETING RESEARCH - OVER 350 PAGES OF AWESOME VALUE.</strong></strong></p><p><strong><strong>Want to discover the inner Extra Profit in any Business? Then this is the course for you.</strong></strong></p><p>With the information explosion that has accompanied the development of the internet there is often a<strong> fallacy that any information that is required can be found via Google</strong>. A professional approach to supporting marketing decisions with well grounded information requires the skills that are included in this course. <br></p><p>The course is intended as a practical step by step guide to market research, to provide a structure for those who plan to undertake a research project or may wish to commission an agency to conduct research on their behalf. Each of the stages of the market research process are covered individually- starting with an understanding that market research is not the same as \" see what you can find\" on a particular topic or issue- but rather a structured and systematic approach to building a picture which can support business decisions, form part of a business development or act as a foundation for marketing strategy.</p><p><strong>DIGITAL MARKETING RESEARCH</strong></p><p>Continuous Marketing research should be the focus of any company. No matter how Big or how Small you are, knowing what your customer thinks, how the market evolves, what your competitors are doing should be your constant priority.<br></p><p>After this course you will be able to answer the following key-questions</p><ul><li>In a world of <strong>Multi-Device Multi-Tasking use</strong>, do we know how your customer deal with all of this?</li><li>What <strong>Analytics</strong> are telling us about how our customer are using your website?</li><li>Are they concerned about <strong>Privacy</strong>?</li><li>What <strong>Social Media</strong> do they use most and how?</li><li>Do you understand the <strong>Psychology</strong> of your customers?</li></ul><p>Now <strong>Digital Marketing Research </strong>has made all of this possible without spending a fortune!</p>", 
    "end_date": null, 
    "title": "Marketing Research for Profit", 
    "price": "20.00", 
    "instructors": "Oxford Learning Lab", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/68736_e4c0_6.jpg", 
    "course_url": "https://www.udemy.com/marketing-research-for-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-23T17:36:57Z"
}