{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are you a solopreneur or small business owner?</strong></p><p>Do you get caught up in the urgent, day-to-day activities of your business?</p><p><strong>Are you ready to plan for success?  Set the stage now for a successful 2016!</strong></p><p>In this course, you'll learn small business marketing fundamentals and create your own marketing plan!  you deserve to learn from an expert who has both academic and small business experience. I've walked both MBA students and small business owners through these steps to creating an effective marketing plan.</p><p><em>I'll explain successful goal-setting; </em> <strong>You'll set your goals!</strong></p><p><em>I'll teach you how to really nail your target market(s) &amp; positioning.</em>  <strong>You'll write a powerful positioning statement to get and keep the clients you really want.</strong></p><p><em>I'll walk you through the key elements of the marketing mix.</em>  <strong>You'll </strong><strong>walk away with step-by-step actionable plans to grow your revenues and profits. </strong></p><p><strong>Plus in addition to the discussion group, I offer a free 15 minute consultation via phone, Skype or Google Hangout.  Get your marketing questions answered by an expert.</strong></p><p><strong></strong> Get your marketing mojo going! <strong>Enroll now!</strong></p><p><strong>************************************************************</strong></p><p>I bring a combination of academic research and the hands-on experience of working with hundreds of small business owners to teach you how you can learn it, do it and profit! in your business.</p><p>About this course:</p><ul><li>Full, free lifetime access</li><li>All future extra lectures and upgrades are always included for free</li><li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</li><li>Worksheets and checklists so you can easily and quickly implement this approach for YOUR business.</li></ul>", 
    "end_date": null, 
    "title": "Marketing Planning for Solopreneurs", 
    "price": "20.00", 
    "instructors": "Lisa Cain, PhD", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410174_0c45.jpg", 
    "course_url": "https://www.udemy.com/marketing-planning-for-solopreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T19:49:18Z"
}