{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">What is this course about?</strong><br style=\"\"></p>  <p>  \t                                   Today&#039;s consumers live in a world full of choices.  They live in a world full of decisions.  How do they make these decisions, and what can you do to influence them?  In this class, we&#039;ll dive deeply into the numerous decisions a consumer make prior to actually making a purchase.  By understanding this decision making process, we&#039;ll be able to put together a plan to influence the process so the decisions would be made in our favor.  We&#039;ll examine the entire consumer journey to understand where there may be purchase barriers, so we can remove them! </p>  <p>  \t<strong style=\"\">What should you expect from this course?</strong>  </p>  <p>  \t                                You should be able to analyze how consumers make decisions and put together a plan remove purchase barrier and drive brand preference.  So, you can win in the marketplace to <strong style=\"\">sell more</strong>!  </p>  <p>  \t<strong style=\"\">Who is this class for?</strong>  </p>  <p>  \t                          This course will be beneficial to any strategic minded individuals looking for a deeper understanding of consumers behaviors in order to drive business growth.  This course provides a clear framework to make sense of it all.  The course provides context to observable consumer actions by revealing the hidden decision making process.  This course will be most beneficial if you need to understand consumer behaviors to drive business decisions, but may not have in-depth formal training in the subject. To get the most out of this course, you will need to workshop the material after the lectures.  The course will not provide a one-size-fits-all solution.  By applying the framework, you will be able to better understand your consumers and to create a tailored solution for your specific business.  </p>  <p>  \t<strong style=\"\">How is the class structured?</strong>  </p>  <p>  \t                                   The class consists of several video lectures.  The lectures will take an hour to complete.  At the end of the lecture, you will have a clear understanding on how a purchase decision is made..  You will have an understanding on distractions that may occur along the path toward purchase.  With that knowledge, you will be able to build a plan that can influence consumer decisions and guide consumers toward purchasing your brand. After the video lectures, you will need to then take your own time to build that plan.  This course will provide you a template to get you started on that plan.  </p>  <p>  \t<strong style=\"\">Why take this course?</strong>  </p>  <p>  \t  First of all, this course is back by a 30 days money back guarantee. Secondly, don&#039;t you want to <strong style=\"\">sell more</strong>? Only by understanding how consumers make decisions would you be able to influence their decisions.  If you&#039;d like to learn how to make consumers pick your product over a competitive product, enroll in this course now!  </p>", 
    "end_date": null, 
    "title": "Marketing Strategy: Why are they not buying your product?", 
    "price": "30.00", 
    "instructors": "Jeannie Chan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340226_2cfe_9.jpg", 
    "course_url": "https://www.udemy.com/influencing-consumers-decisions-how-to-make-them-pick-you-jeannie-chan/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T01:44:03Z"
}