{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Dieser Kurs richtet sich vor allem speziell an <strong>EinzelunternehmerInnen im Bereich Beratung, Training und Therapie, die noch kein Digitales Produkt erstellt haben</strong></p><p>In der<strong> Einleitung</strong> geht es darum, die Idee <strong>nicht nur seine Zeit gegen Geld</strong> zu verkaufen schmackhaft zu machen.</p><p>Die <strong>Schritt-für-Schritt-Anleitung </strong>stellt dann <strong>eine konkrete Hilfe</strong> dar, sich für ein bestimmtes digitales Produkt zu entscheiden und dieses genau zu definieren.</p><p>Diese Kurs zeigt den <strong>generellen Rahmen für das Erstellen von Digitalen Produkten</strong>, nicht aber die Details, wie man zB ein eBook erstellt. Hierzu biete ich diverse weiterführende Kurse an.</p><p><strong>Was kannst du am Ende des Kurses?</strong></p><ul><li>du kannst dich endlich von dem Konzept \"Zeit gegen Geld\" lösen</li><li>und du erkennst, dass es bessere Wege gibt, um ein regelmäßiges Einkommen zu generieren</li><li>neben dem steigenden Umsatz ist jedes Digitale Produkt auch gleichzeitig ein Werbemittel, das dich bekannter macht und dir hilft, dass noch mehr Menschen Vertrauen zu dir haben</li><li>du lernst die verschiedenen Ziele vom Einsatz Digitaler Produkte kennen und wie du sie am besten für dein Unternehmen nutzt</li><li>ich helfe dir dabei, dich für die Erstellung deines ersten Digitalen Produktes zu entscheiden und den genauen Rahmen zu definieren</li></ul>", 
    "end_date": null, 
    "title": "Neue Einnahmequellen für Berater, Trainer und Therapeuten...", 
    "price": "25.00", 
    "instructors": "Meike Hohenwarter, MSc", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684128_ea88.jpg", 
    "course_url": "https://www.udemy.com/neue-einnahmequellen-fur-berater-trainer-und-therapeuten/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T16:04:26Z"
}