{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Attention: the price of this course will go up on the 1st of May 2016.</strong><br></p>\n\n<p><em>\"If you buy - or sell anything, anywhere, you need this course!...\" </em>                                                                                                                             (review from Anne Jordan, see below)<br></p><p>In this highly entertaining and interactive course you will discover how and why marketing works. First we will need to understand what triggers us. We’ll be diving deep into our conscious and subconscious decision-making processes\nand I’ll show you, with tons of concrete real life examples, how marketing strategies have been able to cash in on those processes.</p>\n\n\n\n<p>Now marketing hasn’t been waiting around for neuroscience to come up with insights about the brain to start applying these principles. Through trial and error, and a lot of\ntesting, marketing departments were able to develop sound principles based on empirical evidence. In this course, not only will I show you what works, but also why it does so well. The scientific part of this course is based on the latest research in neuroscience and psychology and is brought to you through an easy-to-understand model of how our mind works.</p>\n\n\n\n<p>And we won’t stop there. You see, this is not a course on how to apply neuroscience to your own marketing efforts, even though I guess you could use the information here to\ndo so. </p>\n\n\n\n<p>The real aim of this course is to educate consumers, and aren’t we all, so that next time we feel the urge to buy something, we are able to look beyond the marketing, and see\nif we’re just being manipulated or if we genuinely need or want to buy something</p>\n\n\n\n<p>Because in the end, this course is about empowerment. It’s about being able to free oneself from consumerism. It’s about living consciously, being aware when we’re being\nplayed, and making educated choices.<br></p>\n\n\n\n<p>So what should you expect?</p>\n\n\n\n<ul><li>a simple model to understand our complex subconscious drivers</li><li>examples to show you how marketers are applying these principles</li><li>exercises to help you train yourself to recognize when you're being manipulated</li><li>edutainment, as I'm not into dry theories</li><li>Knowledge to free yourself from manipulation</li></ul>", 
    "end_date": null, 
    "title": "Neuromarketing: a consumer's guide", 
    "price": "25.00", 
    "instructors": "Gregory Caremans", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566378_8a49.jpg", 
    "course_url": "https://www.udemy.com/marketing-and-neuroscience/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T18:55:28Z"
}