{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>So many people say they want to have their own website or build an online business but they're not sure where to begin. The process seems complicated and very time consuming. Yet, millions of average people have their own site and business online. The<b> </b><b>Online Marketing for Beginners: Site Set-Up &amp; Sales Tactics </b>course is designed for anyone interested in having their own website and online business but may not be technically savvy or have a degree in marketing or sales. </p><p>The goal of this brand new <b>Online Marketing for Beginners: Site Set-Up &amp; Sales Tactics </b>course is to give you a resource you can use over and over to tackle all the technical aspects of online marketing like:</p><ul><li>buying a domain</li><li>using an FTP program</li><li>selecting and setting up hosting, etc. </li><li>learn some basic, hard and fast marketing concepts in short, easy to follow videos and      printables.</li></ul> <p>In order to give your online business a great start, I've included downloadable supplements that discuss different marketing concepts for beginners. Believe me; these can help you avoid some costly mistakes as you build your business. </p><p>The videos are short but crammed with information and actionable steps. You could watch the videos straight through in just over 1 hour. However, I recommend following the video and pausing, taking action before continuing. You can download and print the supplemental material to study at your leisure and use as a reference guide when needed.</p><p>Starting your own website and building your brand and business isn't magic. Let the <b>Online Marketing for Beginners: Site Set-Up &amp; Sales Tactics </b>course pull back the curtains and demystify the process for you. If you are comfortable with your computer and navigating the internet you could be up and running in less than 24 hours!</p>", 
    "end_date": null, 
    "title": "Online Marketing for Beginners: Site Set-Up & Sales Tactics", 
    "price": "30.00", 
    "instructors": "Jason Magill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556532_5494.jpg", 
    "course_url": "https://www.udemy.com/online-marketing-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T18:04:21Z"
}