{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>*** Course Updated, Wednesday, Dec. 23, 2015 ***</strong></p><p>Many of your customers - and future customers - practically live online every day. </p><p>They text. They Tweet. They search for goods and services and, sometimes, they'll leave reviews for restaurants; coffee shops; florists; heating and cooling repairmen; plumbers; lawyers; accountants and more. </p><p>Your company - whether you're a local start-up; \"Mom and Pop\" shop or is starting to grow with a larger customer base and more employees - needs to protect and improve its online reputation.</p><p>One of the best ways is by earning positive reviews from customers and clients through online review websites such as Yelp, Manta, Google+ Local, Bing Local and many others.</p><p>Positive online reviews offer social proof that your company provides excellent products and services to its customers. It tells other potential customer \"buy from this company\" or \"visit this restaurant!\" </p><p>On the other side, customers can also leave your company a negative review which can quickly cause your business' online reputation to go sour. </p><p>In this course, we'll focus on how you and your business can earn positive reviews from customers. </p><p>We'll explain how online review websites work and how businesses and customers rely on these websites; how your business can claim, confirm and optimize your online review profile for better rankings; which online review websites your company should target, and, most importantly, proven and inexpensive tips and techniques you can implement in order to earn more positive reviews for your business.</p>", 
    "end_date": null, 
    "title": "Online Reputation Management: Earning Positive Reviews", 
    "price": "20.00", 
    "instructors": "Steve Phillips", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631624_93ba.jpg", 
    "course_url": "https://www.udemy.com/earning-positive-business-reviews/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T19:17:17Z"
}