{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>NOTE: I have decided to make this course free. I hope you take this information with the spirit is intended. I want photographers to be as successful as they can be. Good luck to all of you taking this course.</strong></p><p><em>I think the information is vital for photographers who are being marketed to in a constant barrage of \"Secrets\" and \"Easy Methods\" and the snake oil of hype and glitz. There are no secrets, nothing this important is easy, and people who try to tell you there is a single way to success are simply full of it... and your money if you buy into the nonsense. Don't be sucked in by the perkiness and the hype, becoming a successful photographer may be one of the most difficult career moves out there. But it can be done, IS being done every day be people who are prepared and willing to work.</em></p><p><strong>The Real World, NO BS, Marketing Strategies for Photographers.</strong></p><p>The title of this course says it all... this is a real world, no nonsense approach to marketing for the commercial photographer. While this course is fully implementable by photographers of all genres, the approach is for the emerging commercial photographer. Much of the information can be used by wedding and portrait photographers, however the main thrust of it is toward the editorial, corporate and commercial photographer in markets that are difficult to get a foothold in. <br></p><p>The class consists of video and worksheets designed to help you forge your own, personal approach to marketing and finding clients.</p><p>This <strong>course is not designed to be done quickly</strong>, and I suggest that you take a couple of months to complete it - based on how much outside work you are doing. The worksheets take time to complete and are instrumental in the design of your marketing strategy. Use them to educate yourself, and bring them to the Webinars for some individual discussion if you would like. There will be opportunities for further discussion on these points.<br></p><p>Video is used for a more narrative approach, and there are the worksheets that have been mentioned. The class is designed to go from beginning to end the first time through, then to be used as a resource for continuing in the specific areas the student is struggling with.</p><p>If you are wanting to create a business out of commercial photography, build a reputation, find and retain clients and have a complete working knowledge of how marketing a small, creative business is done, this course is for you. Whether you want to go full time or make a good part time income, creating and understanding your marketing strategy will save you time, money and heartache.</p><p>As a photographer, designer and marketer for small and medium businesses for forty years, I bring all of my experience and knowledge of this field into easy to understand videos. The work is hard, but the skills needed are presented in a way that make them accessible - and that benefits the busy student in many ways.</p><p>Our Comprehensive Table of Contents:</p><p><strong><strong>The Real World, No BS, 'Take Your Secrets and Shove 'em” Approach to Marketing for Photographers</strong></strong></p><p>Introduction<br>Marketing is a Journey Not a Destination<br>Marketing Builds Awareness.<br>There Are No “Secrets”<br>Your Story<br>Crafting Your Story<br>Marketing is Not a Tactic or a Trick<br>Marketing is Not Sales<br>Why Cookie Cutter Strategies Won't Work<br>Preparing to Build Your Strategy<br>Goal Setting Worksheet<br>Keep It Simple</p><p><strong><strong>Creating a Strategy That is Right For You</strong></strong></p><p>Create Your Own Strategy <br>The Building Blocks<br>Watch Out for Roadblocks – Especially The Ones You Create<br>Build a Support Group<br>Become Responsible, and Love Being Responsible<br>Budget Your Assets for Maximum Reach and Minimal Expense<br>Understand Your Market</p><p>Building a Good Foundation</p><p>First – BE a photographer.<br>What do You Do?<br>Why do You Do It?<br>A Long Dissertation on Shooting What YOU Love to Shoot.<br>Plan the Work and Work the Plan<br>Shooting Every Day -- The Goal<br>“Shoot Every Gig for a Year” - (“<em>Wizwow’s</em> Approach to Making Headway”<br>Shoot at 110% For Every Job You Get<br>The Essence of the Self Assignment<br>Creating an “Editorial Schedule” To Keep The Work Fowing</p><p><strong><strong>The Time Tested, Good Ol' Hardcopy Portfolio.</strong></strong></p><p>Create a strong experience based book.<br>What is in it.<br>Why you have it.<br>Where You Show it.<br>Who You Show it to.<br>When to Create it.<br>Why You Still Need It<br>Why iIt Makes a Difference.<br>Which Portfolio Style is Best for You</p><p><strong><strong>Portfolio building ideas.</strong></strong></p><p>Folders for Possibilities<br>Basic Portfolio Challenges.<br>Basic Portfolio Layout.<br>How To Decide On Presentation<br>Page Size</p><p><strong><strong>What about the Web?</strong></strong></p><p>How the Web Portfolio is Different Than the Hardcopy<br>Web Categories<br>How Many Categories / How Many Images Per?<br>Why Less is More<br>Why having a 'Webmaster” is a Losing Proposition<br>Presentation of the Image<br>How Large Should the Images Be?<br>How to Create a Faster Loading Image in Photoshop<br>Protecting The Image.<br>Using a Watermark (<em>that usually looks terrible, unprofessional and silly</em>) VS Not Using A Watermark</p><p><strong><strong>Hard Copy Tools</strong></strong></p><p>Print Materials<br>Identity Materials<br>Even Business Forms Need ID<br>Why Spending a Ton of Money on ID when starting Makes No Sense<br>Common Sense Design Trends<br>Drop Off Materials Leave Behinds<br>Direct Mail Approaches</p><p><strong><strong>The Internet</strong></strong></p><p>The Most Important Two Internet Tools..<br>-Your Website<br>-Your Blog<br>Create a Blog for the 'Right' audience.<br>Blog For Clients, Not Other Photographers<br>What Kinds of 'Stuff' Should You Blog?<br>Social Tools<br>Social Sites (Satellite Outliers and the Main Site approach. <br>Why Facebook, G+ and Twitter Will NOT make you rich).<br>Why Ignoring Facebook and Twitter (and G+) Is A Problem – Or Not – Depending.<br>Use the Outliers to Build Awareness</p><p><strong><strong>Email Marketing</strong></strong></p><p>Find and Build a List<br>Purchase a List<br>Monitoring the Effort<br>Understand Metrics<br>Use Google Analytics<br>Creating Additional Content Marketing<br>OnLine Magazines<br>Content Placement</p><p><strong><strong>Putting it all together:</strong></strong></p><p>Shooting for Free vs Shooting for Access.<br>Should You Do Work For “Free”?<br>What Is The Value of your work?<br>Do Beginners Have to Start at “Cheaper” Prices?<br>Shooting for Growth.<br>Live the 'Life'</p><p><strong><strong>The Wrap Up... Keep Shooting</strong></strong></p><p>Resource Guide and Links</p><p>Portfolio Products</p><p>Wordpress Themes</p><p>Wordpress Hosting</p><p>Designers</p><p>Printers</p>", 
    "end_date": null, 
    "title": "Real World, NO BS, Marketing Strategies for Photographers", 
    "price": 0, 
    "instructors": "Don Giannatti", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/56435_6c20_7.jpg", 
    "course_url": "https://www.udemy.com/real-world-no-bs-marketing-strategies-for-photographers/", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-25T23:37:06Z"
}