{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t     I don’t teach marketing; I <strong style=\"\">DO</strong> marketing. This course not only relies on information floating around on the Internet, but also draws on well over thirty years of experience in an easy to understand style. You benefit from a mix of real-world experience passed along as personal stories, including mistakes, and bookish analysis.  </p>  <p style=\"\">  \t     It’s normal for the Gurus to tell you what to do: <em style=\"\">“Step One: do this….”</em> Yes, you can follow the leader and will find some success. Indeed, one shoe will fit most. The old “Teach a man to fish” adage comes into play in this course. I will tell you why you want to use certain techniques. <strong style=\"\">This is much more powerful information</strong> and will help you develop a marketing plan for your restaurant that you will find far more satisfying.  </p>  <p style=\"\">  \t     With the above in mind, this course is intended to give the participant the ability to skip to relevant areas and grab needed information on demand. There are only two sections you need to watch in their entirety: Section One and Section Three. If I am serious about allowing you to decide which ideas are important, then you will need some foundation to work from.  </p>  <p style=\"\">  \t     The idea here is to allow the restaurant owner or manager to watch a five minute video on a subject when that information is needed. For example: if a Newspaper Rep. is coming in the afternoon, perhaps it would be a good morning to re-watch the Newspaper Lecture.  </p>  <p style=\"\">  \t     Obviously, with this course design in mind we need over thirty videos spread over two hours on a number of subjects so you can watch the ones you need and skip irrelevant topics. Once you view all videos you can receive a final certification.  </p>  <p style=\"\">  \t   Questions? Drop me a note anytime: dean@deanlewis.net  </p>", 
    "end_date": null, 
    "title": "Restaurant Marketing - The Basics", 
    "price": "20.00", 
    "instructors": "Dean Lewis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241956_8e27_6.jpg", 
    "course_url": "https://www.udemy.com/restaurant-marketing-the-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-12T08:13:44Z"
}