{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">***UPDATED APRIL 2016***</strong></p>\n\n<p>Sales copy can make or break any campaign, whether you’re trying to increase sales, build your list or engage with prospects. <strong class=\"redactor-inline-converted\">Discover top converting copy methods</strong> you can instantly apply to your campaigns for improved results across the board.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Maximize Your Conversions And ROI Fast With These Proven Copy Methods</strong></p>\n\n\n\n<p>=&gt; Increase product sales with <em>powerful ads and reviews</em></p>\n\n\n\n<p>=&gt; Build your subscriber base fast with <em>top converting lead pages</em></p>\n\n\n\n<p>=&gt; Engage prospects and customers better through <em>effective email marketing</em><br><br><em>Brian, Mark and Shane are wonderful instructors and the course is simply brilliant. As a copywriter and marketer, I’m always willing to learn more about crafting compelling sales copies. This course helped me tremendously not only to better understand my target audience, but also to run better researches and structure my letters.</em><em>Thank you!</em> <strong class=\"redactor-inline-converted\"> -</strong><em><strong>Alexandra Moore</strong></em></p><p><strong class=\"redactor-inline-converted\">Your Copywriting Triple Threat: 3 Ways To Win With Sales Copy</strong><br></p>\n\n\n\n<p>There are many good copywriting courses out there. With ours, we share the exact methods we’re using daily and <strong class=\"redactor-inline-converted\">how you can apply them</strong> in 3 forms of marketing.</p>\n\n\n\n<p>Brian reveals the strategies that have landed him contracts with Hennessy, Hyundai and other global powerhouses.<br><br>Shane shares tips you can use to build your list faster than ever with conversion tricks he’s used to become a master list builder.<br><br>Tap into the exact tools Mark uses to provide 7 figure marketers with the results they demand.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What Makes This Course Unique?</strong></p>\n\n\n\n<p>We’ve got your back. You’ll have <em>a dedicated team of three instructors</em> ready to answer any question you have, or describe something in more detail for you.<br><br>As with our other courses, this one will be updated over time with fresh content. All updates for life are included.</p>\n\n\n\n<p>The extensive content is broken into easily digestible bits you can rapidly absorb. Engaging exercises along the way help you master the methods so you can see results fast.</p>\n\n\n\n<p>You’ll come out with a specific strategy to improve conversions in three types of marketing campaigns: direct sales, lead generation and email marketing.</p>", 
    "end_date": null, 
    "title": "Sales Copy That Sells ... Copywriting Made Easy", 
    "price": "30.00", 
    "instructors": "Mark Tandan, Brian Gray, Shane Farrell", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646954_c831_5.jpg", 
    "course_url": "https://www.udemy.com/sales-copy-that-sells-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T16:05:08Z"
}