{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Creating an online business of any type can be a daunting task but one that is very possible but without sales and marketing skills you won't get far. Most likely you have your product or service, perhaps a website, and now you wait for that money to pour in. The problem? It never does. There is much more to an online business than selling a product or service and then collecting money. One of the most important things you need is marketing. If you are not in a position to hire a marketing expert than doing it yourself is the next best way. It is needed no matter what type of business you do. </p><p>This sales and marketing course is designed to get you started in the right direction by making it super simple. This course will cover tips for making sales and various marketing techniques. For example did you know that a product with a personal story behind it outsells those that don't? I'll explain in the course. Did you know that video is a fantastic way to build your brand and bring in sales? I cover that as well. Other things we will discuss are tips for optimizing your website, blogging, traffic, video, paid advertising methods, email, offline marketing, customer service, branding, creating a call to action, social media, and so much more! By the time this course ends you will have everything you need to take your online business to the next level by utilizing marketing.</p><p>While you take this course you can feel confident that you are learning from someone who has been where you are now. I have been running multiple online businesses for awhile now. I've had my failures and I've had my success. I learned what it takes to grow a successful business and now I am going to teach you using 100% video lectures and video tutorials. It will take a few weeks to complete this sales and marketing course as we will cover a lot but it will be well worth it.</p>", 
    "end_date": null, 
    "title": "Sales and Marketing For Online Businesses", 
    "price": 0, 
    "instructors": "Mike M. Burke", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500690_f568.jpg", 
    "course_url": "https://www.udemy.com/sales-and-marketing-for-online-businesses/", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-13T04:40:17Z"
}