{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course titled \" SMstudy® Marketing Strategy Associate certification course\" contains overview of marketing strategy basics and is based on <em>the SMstudy<sup>®</sup> Guide</em>. It has 41 high quality videos on marketing strategy including a brief about evolution of sales and marketing. Upon completion of this course, students can get free 'SMstudy<sup>®</sup> Certified Marketing Strategy Associate' certification from www(dot)smstudy(dot)com. The course also touches upon the benefits of SMstudy<sup>®</sup> Guide. The <em>SMstudy</em><sup>®</sup><em> Guide </em>is developed by VMEdu, Inc., a global certification course provider that has educated over 400,000 students world-wide in more than 3,500 companies. It explains Sales and Marketing concepts through a practical, process-oriented approach. The course begins with the introduction video about sales and marketing in general and marketing strategy in specific. The course then touches upon specific topics to be studied as part of the marketing strategy. It describes how the Aspect of Marketing Strategy aligns with a company's overall Corporate Strategy and acts as a unifying framework to define and analyze the other Aspects of Sales and Marketing. It also supports the alignment of all marketing resources among all Aspects. Marketing Strategy includes determining internal organizational strengths and weaknesses, as well as external opportunities and threats; identifying and segregating prospective buyers into market segments based on common needs; defining competitive positioning to satisfy specific customer needs; and defining the objectives and budgets for implementation, evaluation, and improvement of all marketing activities. The course can be taken by professionals and students interested in gaining a basic understanding of marketing strategy. The many authors, advisers, and reviewers of the course have worked in numerous Sales and Marketing areas and geographic regions across a variety of industries. Thus, insights provided by them make this body of knowledge industry independent. The course defines Sales and Marketing in terms of processes that comprise a series of actions that leads to a particular result. Each process requires specific inputs and then uses tools to create specific outputs. To take this course, students need to have an interest and aptitude for marketing strategy.</p>", 
    "end_date": null, 
    "title": "SMstudy® Marketing Strategy Associate certification course", 
    "price": 0, 
    "instructors": "SMstudy Certifications", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708254_b58e_4.jpg", 
    "course_url": "https://www.udemy.com/smstudy-marketing-strategy-basics/", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T06:04:19Z"
}