{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Over 750 students and eight 5-star reviews!</strong></p>  <p>  \t<strong>This course is part of my Small Local Business &amp; Solopreneur Marketing Series!  Great for service providers like wellness professionals, coaches, consultants, and more!</strong>  </p>  <p>  \t                                                  Grow your small business more quickly and have more fun working with the most profitable target clients.  </p>  <ul>  \t<li>Are you a small business owner or solopreneur? </li>  \t<li>Are you stuck at 50 to 70% capacity? </li>  \t<li>Are you ready to work with the right clients who will really value your services?</li>  </ul>  <p>  \t        This course will help you focus on the ideal clients who are most profitable and create and clarify your positioning statement to attract them more easily while making more money!  Fill your practice or business!  </p>  <p>  \tI've built my own business and consulted with hundreds of solopreneurs to help them build theirs too!  The first step is honing in on the best target (or niche) markets where you're the clear fit and they're willing to pay more.  </p>  <p>  \tI bring my academic background with a Phd in marketing from The Wharton School along with nearly 15 years of practical experience to the course.   You get the same concepts I teach in MBA programs, customized for small business owners.  </p>  <p>  \t                                                  +++++++++++++++++++++++  </p>  <p>  \t<strong>Great online course teaching market positioning in a clear, concise program</strong>  </p>  <p>  \t          Lisa's course takes a step-by-step approach to teach you how to recognize your market, target your clients, and show you how to grow your niche. She uses worksheets and outside resources to help you understand how important it is to understand your client's needs and to meet those needs most effectively, thereby creating long term clients whose value to your company is very high. She helps you hone in on your marketing statement and gain clarity about what you offer and to whom you should market it. A great class!  </p>  <p>  \t          `  Beth Hird, Camp Director  </p>  <p>  \t<strong>Read the rest of the five star reviews below!  </strong>  </p>  <p>  \t                                                  About this course:  </p>  <ul>  \t<li>Full, free lifetime access</li>  \t<li>All future extra lectures and upgrades are always included for free</li>  \t<li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</li>  \t<li>Worksheets and checklists so you can easily and quickly implement this approach for YOUR business.</li>  </ul>  <p>  \t                                                  LEARN HOW:  </p>  <ul>  \t<li>To segment your market so you can evaluate and choose the most profitable target segments!</li>  \t<li>To do a careful evaluation that considers growth rate, profitability and other critical criteria</li>  \t<li>Position your business so that your ideal, profitable clients know that you 'get them' and they're willing to pay more, be more loyal and refer to you more often.</li>  </ul>  <p>  \t                                                  I've worked with hundreds of small business owners and solopreneurs over the past 15 years.  Plus I've taught MBA students similar material for just as long.  This info is up to date with key learnings and customized for the small business owner who wants to know <strong>some of the why and what</strong> but really wants to know<strong> how to learn it, do it and profit!  </strong>  </p>  <p>  \t                                                  “I was just telling a friend how Lisa has helped me to more than double my income in 9 months and I felt that I should let the whole world know. I am a self employed acupuncturist and prior to working with Lisa I was spinning my tail doing lots of stuff at once then getting tired and not doing anything for several months. I was feeling like my business was never going to grow. Lisa helped me to get clear about my business message, helped me to come up with strategic methods and timelines for reaching people, was a great sounding board for working out ideas and helping me to discern which marketing activities would NOT be worthwhile for me, my brand and my style.  I cannot recommend her enough.\"  </p>  <p>  \t                                                  ~ Marie B, 5 Star Review posted on Yelp  </p>  <p>  \t                                                  Click the <strong>\"take this course\" button, top right</strong>, ... don't waste time or money, get started now!  </p>  <p>  \t                                                  Lisa Cain  </p>", 
    "end_date": null, 
    "title": "Solopreneur Marketing: Find Your Profitable Niche", 
    "price": "35.00", 
    "instructors": "Lisa Cain, PhD", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121832_dd4d_5.jpg", 
    "course_url": "https://www.udemy.com/bulls-eye-positioning-find-your-profitable-target-market/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-18T19:55:42Z"
}