{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Are you an independent coach or consultant?</p><p>Do you love working with clients but hate the process of selling your services in order to get those clients?</p><p>Maybe you've never been taught how to sell, so you're not even sure how.</p><p><strong>Did you know that nearly all of the coaches and consultants I talk to and work with hate the idea of having to sell? </strong></p><p>And you know what, I hated it too when I started my own business back in 1998. </p><p>But when I learned the sales process I'm going to teach you in this course, everything changed. I no longer hated selling and I started closing more sales.</p><p><em>If you're currently selling your services using free coaching sessions, or you're giving away valuable advice in spec proposals, I'd like to invite you to learn a more effective way to sell your services, that does not feel like selling AND does not require you to give away your valuable time and expertise for free.</em></p><p><strong>This course is for you if you're an independent coach or consultant and..</strong>.</p><ul><li>You hate sales, or you've never been taught how to sell</li><li>You're currently selling your services using free coaching sessions, or you're giving away valuable advice in spec proposals</li><li>You're tired of giving away your valuable time and expertise for free</li><li>You're struggling to convert prospects into paying clients</li><li>You're having a hard time finding potential clients to even make offers to</li><li>You dread the idea of cold-calling</li><li>You're tired of hearing prospects tell you, \"let me think about it and get back to you\" and then never hearing from them again</li></ul><p><strong></strong></p><p><strong>What You'll Learn in this Course</strong></p><p>In this course you will learn a simple, conversational, comfortable, 10-step sales process you can use in 30- to 60-minute Free Consultations with your prospects, to turn more of them into paying clients.</p><p><strong>Sell More, More Comfortably, and at Higher Prices</strong></p><p>As an independent marketing consultant and coach since 1998, I've been selling my own services for 17 years. I've tried a lot of different things. And I admit, at the beginning I was just kind of winging it.</p><p>However, when I was taught the specific sales process I'm going to share with you in this course, selling not only became more comfortable, I sold a lot more coaching and consulting packages. And, I sold them at higher prices.</p><p><strong>When I dialed in my process to include the specific 10 steps I'm going to teach you, and I went out and tested the this 10-step process for the very first time, I sold $12K worth of private coaching in a little over a week.</strong></p><p>Even better, I knew exactly what I needed to do each month to keep generating that same income.</p><p>While I can't promise you'll have the same result, what I can promise is that if you are currently giving away free advice in free coaching sessions or spec proposals as a way to sell your services, or you too are just kind of \"winging it\" when it comes to selling your services, this 10-step sales process will truly transform the way you sell, and your results. </p><p>I'm really excited to be sharing this process in such detail (I only top-lined it in my <em>How to Market Yourself as a Coach or Consultant</em> course) because I know how much it can change how coaches and consultants FEEL about selling, as well as their results.</p><p><strong>In fact, here is what one student in my <em>How to Market Yourself as a Coach or Consultant</em> course had to say about the one lesson I teach on this sales process in that course:</strong> </p><p><em>\"Lesson 21 is Worth Five Digits To Me. This is an excellent course, easily worth the money and time. I have been an independent consultant for four years and I found two ideas particularly helpful. First, Debbie's view that my marketing approach should be consistent with who I am as a person. Second, Debbie's description of the consultative sales call (Lesson 21).\" Michael de la Maza</em></p><p>And that was based on ONE lesson.</p><p><strong>This course includes 17 video lessons plus 2 bonus video demos.</strong></p><p>I've broken down each step into individual lessons so I can share in detail how this sales process works, and include stories from my own personal experience and my clients, so you really understand it and can apply it in your business.</p><p>So, if you find yourself wishing clients would just show up, so you don't have to pound the pavement or do cold-calling to find them… <em>(Neither is required with this process!)</em></p><p>Or, you're struggling to get clients to say yes…</p><p>Or, you're tired of giving away free advice and sample coaching sessions and still not getting clients…</p><p>I encourage you to enroll in this course.</p><p><strong>Not only will you learn how to sell your services, you'll receive:</strong></p><ul><li>A step-by-step agenda and checklist you can use in every consultation you do, so you know exactly what to say and do to close more clients</li><li>27 different ways you can get prospective clients to contact YOU and request a consultation<em> (that means no cold-calling or pounding the pavement looking for clients!)</em></li><li>A formula to help you determine exactly how many free consultations you need to do to generate the clients and income you want so you can get off the cash-flow roller-coaster and start earning reliable income month after month</li><li>Fill-in-the-blank worksheets to help you fine-tune your sales process, so the more consultations you do, the more you improve your closing ratio <em>(that means you get to spend less time selling and more time working with clients)</em></li><li>Free and low-cost web tools you can use to automate the consultation application and scheduling processes so you can focus your time doing what you do best – talking with prospects who've expressed interest in working with you… and working with clients</li></ul><p><strong></strong></p><p><strong>Be sure to watch the Course Introduction Video to learn more about what you'll learn in this course (it's free!)</strong></p><p>Then enroll in the course and start learning an easier, more comfortable, more effective way to sell your services so you can attract and begin working with all those people you got into business to help.</p><p>See you inside!</p><p>Debbie LaChusa, The Business Stylist®</p>", 
    "end_date": null, 
    "title": "The Most Effective Way to Sell Coaching/Consulting Services", 
    "price": "50.00", 
    "instructors": "Debbie LaChusa", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579390_f42e_3.jpg", 
    "course_url": "https://www.udemy.com/the-most-effective-way-to-sell-coaching-or-consulting-services/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T19:51:03Z"
}