{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Welcome to the \"Online Marketing Fundamentals and Success Principles\" course. </p><p>In this course you'll learn the marketing fundamentals as I like to call them, that need to be incorporated into your online marketing strategy, for it to have a chance to succeed. </p><p><strong>This will form the foundation of your online marketing project.</strong> </p><p><strong>Who this is for:</strong></p><ul><li>Whether you're brand new to online marketing or have been at it for a while and still struggling, the fundamentals covered in this course, <em></em><strong><em>if applied</em></strong>, will bring you much clarity.</li></ul><p><strong>Why take this course:</strong></p><ul><li><strong></strong>Be able to identify and implement the fundamental pillars necessary to build a successful Online Marketing strategy.<strong>   </strong><strong></strong></li></ul><p><strong>The course starts out with:</strong></p><ul><li>A summary of the <em><strong>six major challenges</strong></em> that online marketers of all shapes, sizes and experience, encounter and trap most. <em>You don't want to miss these.</em></li></ul><p><strong>Next I cover two critical questions that are targeted at you:</strong>     </p><ul><li>The detail of your answer will most likely determine whether your marketing effort will succeed or fail.</li><li>These two are the emotion behind what you do and provide you with the staying power. </li></ul><p><strong>Following we'll dive into:</strong></p><ul><li>The fundamentals that are the foundation of a sound marketing plan</li><li>Looking at marketing as a system and the major components of that system </li><li>The fundamentals that need to be part of your Website and that will keep you from the typical knee jerk reactions every time Google releases an update to their algorithm.</li><li><span></span>The fundamental shift in the marketplace and what's behind today's crazy pace.</li></ul><p><strong>Presentation style:</strong></p><ul><li>I use a Mindmap format as the presentation medium, a copy of which I make available as a PDF at the end of each section. Check out some of the previews I make available. I'd love your feedback on this. </li></ul><p><strong>Homework:</strong></p><ul><li>I've included  a worksheet at the end of the course that will help you recall some of the key points and serve as a worksheet to you own online marketing campaign.</li></ul><p>It's my pleasure to share this information with you and I trust you'll extract much value out of the course and I look forward to hearing from you. Please let me know how I can empower you on your own journey.</p>", 
    "end_date": null, 
    "title": "The Critical Components Of Any Online Marketing Venture", 
    "price": "20.00", 
    "instructors": "Andre Kasberger", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502206_6189_4.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-a-successful-online-marketing-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T18:23:56Z"
}