{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Goodbye <em style=\"\">American Dream</em> and Welcome <em style=\"\">Online Marketing Dream</em>. </strong></p><p style=\"\">If you&#039;re looking at this course, chances are you are either a marketing professional or a business owner who understands the internet of internet marketing today.</p><p style=\"\">You &#039;get&#039; that traditional marketing methods are become more ineffective and expensive and you know that by neglecting to market your business online, you&#039;re missing out on powerful business results that an effective internet marketing strategy can bring about – thousands of leads, millions of dollars in sales and repeat customers.</p><p style=\"\">Whether your business is just getting started with internet marketing or you want to brush up on the basics, this course will help you set up and implement a successful internet marketing step-by-step.</p><p style=\"\">This Course is a super-simple, &quot;marketing-lingo&quot; guide that walks you through proven, actionable steps to establish the right foundation for online marketing success.</p><p style=\"\"><strong style=\"\">My 8 Module Online Marketing Crash Course Outline</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">Module#1: Introduction –</strong> Why internet marketing is where most of the new wealth is created and vital for your business to master in order to thrive.</li><li style=\"\"><strong style=\"\">Module#2: Creating &amp; Optimizing Your Website –</strong><strong style=\"\"></strong> Your website is the most important virtual property you have on the web. Like a traditional store, how you design it determines how well you perform.</li><li style=\"\"><strong style=\"\">Module#3: Creating Content –</strong><span class=\"redactor-invisible-space\" style=\"\"> Your content is your invitation to your potential customers in to your website. If your content isn&#039;t engaging, no one will show up.</span></li><li style=\"\"><strong style=\"\">Module#4: Getting Social –</strong><span class=\"redactor-invisible-space\" style=\"\"> Social media is a major source of free traffic and where your customers are hanging out. Engaging your customers effectively will get them to come to your website and buy.</span></li><li style=\"\"><strong style=\"\">Module#5: Converting Traffic into Leads –</strong><span class=\"redactor-invisible-space\" style=\"\"> It&#039;s not enough that you have traffic coming to your website. You need your potential customers to be constantly coming back to your website for them to convert into paying customers.</span></li><li style=\"\"><span style=\"\"><strong style=\"\">Module#6: Nurturing Leads into Buying Customers –</strong> This is all about getting them to like you and your products/services. Not only must they have you on top of their minds, but they must also want to buy your products.</span></li><li style=\"\"><span style=\"\"><strong style=\"\">Module#7: Analyze and Refine –</strong> There will always be some areas of improvement in your business. A leak that might be costing you money or you might be losing out on potential customers. Learn how you optimize your online business to lower costs and generate more money.</span></li><li style=\"\"><span style=\"\"><strong style=\"\">Module#8: Conclusion –</strong> Learn how you can take actionable steps at the end of the program to implement this course and market your business online.</span></li></ul>", 
    "end_date": null, 
    "title": "The Essential, Step-by-Step Guide to Online Marketing", 
    "price": "20.00", 
    "instructors": "Basim Salim", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444734_c0c5_3.jpg", 
    "course_url": "https://www.udemy.com/the-essential-step-by-step-guide-to-online-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T11:48:30Z"
}