{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t If you want to get the biggest bang for your marketing bucks, this course is for you.  </p>  <p>  \t  Over the years (37 in my own business as a marketing speaker and consultant), I’ve learned that too many owners and executives in small and growing businesses find marketing quite confusing.  They think marketing and advertising are the same thing. Or they think marketing and sales are the same thing.  People think marketing takes a long, uninterrupted block of time, is very expensive and takes forever to work.  These are all misconceptions and/or myths.  </p>  <p>  \t  In “The Best Use of your Marketing Dollars,” I name all of the potential marketing strategies.  Then I divide them into three categories: Unknown to Unknown, Known to Unknown and Known to Known.  NO OTHER MARKETING PROFESSIONAL HAS EVER BROKEN DOWN THE VARIOUS STRATEGIES IN THIS MANNER, and it removes all the confusion that exists about “Which strategies are the best for our business/profession/organization?  Where do I start?  How much do I have to spend?  How long will it take for me to see results?”  </p>  <p>  \t  As you take this course, you’ll see immediately how my suggestions either counteract or complement what you’ve been doing.  There’s a great deal of conventional thinking regarding marketing.  Friends, relatives and colleagues who mean well all too often give truly unfortunate marketing advice.  This course tells it like it is, as far as your marketing is concerned.  You’ll be able to start immediately, because of the practical advice provided.  You’ll definitely welcome the opportunity to save up to 85% on your marketing costs.  That’s right: up to 85%!  </p>  <p>  \t  It’s time you learned how marketing really works, what discourages and what drives responses.  After all, you work hard for your marketing budget.  It’s only fair that you should see results from every dollar you invest!  And, most important, this course will teach you that, in marketing, it’s not what you spend, but how you spend it!  </p>", 
    "end_date": null, 
    "title": "The Best Use of Your Marketing Dollars", 
    "price": "20.00", 
    "instructors": "Adrienne Zoble", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203421_6685_7.jpg", 
    "course_url": "https://www.udemy.com/the-best-use-of-your-marketing-dollars/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-22T19:42:32Z"
}