{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>This course is not sponsored by or affiliated with Udemy, Inc.</em></p>\n\n<p><strong>Udemy Course Marketing: Social Media &amp; SEO Guide</strong></p>\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Are you making at least $1,000 a month on Udemy? Have you tried paid ads and got little or no luck? Have you given up trying to make money on Udemy! If you answered yes to some or all of those above then this course is designed just for you...</strong><br></em></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">          Welcome to Udemy Course Marketing: Guide to Social Media &amp; SEO Tactics</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Master the top skills you need to make REAL income selling your courses on Udemy:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Udemy promotions and affiliate sales are nice, but are not enough if you would like to see your income grow.  Your own promotions will not only earn you the bigger bucks, but will also drive Udemy and affiliates to promote your course even more than they do now.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>With over 23,000 students and 30+ courses, Sergey Kasimov teaches you the strategies he uses to earn a full-time income on Udemy. He has teamed up with YouTube and SEO experts Auret &amp; Jewel who have ranked their courses on the #1 page of Google. Auret &amp; Jewel will walk you through their process of using video marketing and finding the right keywords to send organic traffic to your Udemy courses.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Master These Easy-To-Follow Social Media and SEO Strategies That You Can Implement Right Now and Start Seeing Results. </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Learn how to use Social Media to generate publicity for your course</li><li>Find high searched and low competition keywords for your course so students who are searching for your course topic can find you</li><li>Create a powerful course title, subtitle and summary to capture students attention </li><li>Automate your course promotions using advanced tactics</li><li>Set up and optimize your Facebook, Twitter, Pinterest, YouTube and LinkedIn promotions to get you more course sales</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This courses teaches actionable material - not theory - so you can see what we are doing on screen, follow along and implement these steps right away. </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn to master the following concepts with this course...</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Identify where is the best place to market your Udemy course</li><li>Rank your course in the search engines so your potential students can find you organically</li><li>Use Facebook, Twitter, Pinterest, YouTube, LinkedIn and Fiverr effectively to make more course sales</li><li>Test out advanced tactics for course promotions that will help automate your marketing and give you more time to focus on creating content</li><li>Establish a direction for their Udemy course promotions and stay focused</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>Click on the \"Take This Course\" button to get started and we look forward to meeting you inside! press on preview to see 5 min demo of any lecture if you are still unsure. Remember you can take this course for 30 days risk is on us if not happy for any reason get a refund.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>If you choose to stay you get access to twice a month $10 course deals emailed directly to you from Udemy usually on Sundays. If you did not receive any email check your junk mail or spam folder. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Udemy Course Marketing: Social Media & SEO guide ~Unofficial", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov, Jewel Tolentino & Auret Esselen", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599760_0e82_6.jpg", 
    "course_url": "https://www.udemy.com/udemysocialmedia/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T21:09:34Z"
}