{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Wir sind erst am Beginn einer Videomarketing-Revolution! </strong></p><p>Der Einsatz von <strong>Video auf Webpages, Landingpages und SocialMedia</strong> ist schon jetzt für jeden modernen Unternehmer eher Pflicht als Kür - und es geht gerade erst los!</p><p>Natürlich kannst du deine Videos auch bei einer Agentur oder einem Freelancer in Auftrag geben, doch kann das teuer werden und die Ergebnisse unter Umständen nicht deinen Erwartungen entsprechen.</p><p>Da ist es doch einfacher, selbst zum Regisseur deiner Videos zu werden!</p><p><span></span>Du lernst in diesem Kurs, wie du mit Power Point und Camtasia <strong>deine eigenen Werbevideos und Erklärvideos (Explainer Videos)</strong> erstellen kannst.</p>  <p>Ich spreche mit diesem Kurs <strong>EinzelunternehmerInnen</strong> an, die ihre <strong>Webpages und Landingpages</strong> mit <strong>kleinen, professionellen Verkaufs- und Erklärvideos selbst aufpeppen wollen</strong>.</p>  <p>Der Kurs ist <strong>außerdem für Freelancer</strong> geeignet, die sich mit dem <strong>Erstellen von professionellen Videos</strong> <strong>ein Haupt- oder Nebeneinkommen erwirtschaften</strong> wollen.</p>  <ul><li>Das beginnt bei der <strong>passenden Planung</strong>, denn mit jedem Video willst du natürlich ein <strong>klares Ziel</strong> erreichen</li><li>Danach zeige ich dir, wie du das <strong>Storyboard</strong> erstellst</li><li>Anschließend verrate ich dir <strong>DAS Skript</strong>, das <strong>für alle Verkaufsvideos</strong> immer bestens funktioniert</li><li>Weiter geht es mit der <strong>Ton-Aufnahme</strong> oder der Bestellung eines <strong>professionellen VoiceOvers</strong></li><li>...und natürlich willst du auch fetzige <strong>Musik </strong>hinzufügen. Ich zeige dir, wo du sie findest!</li><li>Dann kommt das eigentliche Herzstück:<strong> Die Erstellung einer spannenden, professionellen Präsentation</strong>, dabei verrate ich dir <strong>jede Menge meiner Tricks</strong>!</li><li>Als nächstes zeige ich dir, <strong>wie du deine Präsentation aufnimmst</strong></li><li>Dann geht es ans <strong>Editieren und Schneiden</strong></li><li>...und zu guter letzt wird das Ganze <strong>zu einem gelungenen Video gerendert</strong></li></ul>                  <p>Anwenderkenntnisse von Powerpoint sind von Vorteil, aber keine Voraussetzung.</p>", 
    "end_date": null, 
    "title": "VideoMarketing Expert", 
    "price": "45.00", 
    "instructors": "Meike Hohenwarter, MSc", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468788_7c38_3.jpg", 
    "course_url": "https://www.udemy.com/business-video-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T09:06:59Z"
}