{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>「ニュートンは最後の魔術師だ」</strong></p>\n\n<p>1940年ごろ、経済学者ケインズ（そう、あのケインズ）がオークションでニュートンの遺稿を落札しました。競売にかけられた329冊の手記の中、なんと三分の一は怪しげな錬金術についての文書でした。ケインズによれば、ニュートンは最初の近代科学者というよりは、最後の魔術師である、とのこと。冒頭の一文ですね。</p>\n\n<p>ニュートンが金の亡者であったかどうかはわかりません。しかし金を合成する過程で、様々な発見がありました。硫酸、硝酸、塩酸など化学薬品の多くが試行のプロセスで発見され、様々な実験道具も発明されました。その成果は現在にも引き継がれ、歴史学者のフランシス・イェイツは<strong>「16世紀の錬金術が17世紀の自然科学を生み出した」</strong>と発言したほどです。</p>\n\n<p>もしニュートンが現代に蘇り、10年ばかりの寿命が与えられたら、彼は何を研究するのでしょうか。やはりこれも想像の域を出ません。個人的にはマーケティング工学をやるのではないかと思うのです。</p>\n\n<p>なぜなら世界の最も賢い人たちは、今、データサイエンティストという肩書きを携え、必死にマーケティングの研究をしているからです。<strong>その当時の世界で最も賢い人たちが研究するテーマは、時代とともに変遷しました。</strong></p>\n\n<p>人工知能、宇宙工学、金融工学。</p>\n\n<p>人間と意思疎通のできるロボットの制作を夢見た科学者。月面着陸を夢見た科学者はNASAを目指しました。デリバティブやオプション取引を生んだシティやウォールストリートの天才たちは、やはり金融工学の分野で博士号を取っています。</p>\n\n<p>そして今日、<strong>ビッグデータをもとに人間の行動を解析するデータサイエンティストという職業</strong>が、世界で最もクールで、しかもセクシー（Sexy）だと言われています。</p>\n\n<p>僕はこの潮流と言うか時勢を見ていると、マーケティングは「現代版のアルケミー」なんじゃないかと思ったわけです。もちろんマーケティングを学んだからといって、無限に貴金属を生み出せるわけではありません。しかし中小企業や個人事業主でも使えるマーケティング工学は、安定的なビジネスを運営する手助けになるはずです。</p>\n\n<p>少なくとも、僕が勉強して、実際にビジネスに応用したマーケティング工学は、<strong>かなりビジネスをソリッドなものしてくれました。</strong>まぁ、たかだか個人が作った小さな会社です。勝手に言わせておいてあげてください。（僕は、本当にソリッドだと思ったんですから）</p>\n\n<p>例えば、クラウドファンディングを資金調達の方法だと考える人もいますが、あれはニーズ調査のためのツールです。資金が調達できなければ、そもそもニーズが存在していない証拠なので、クリエイターはむしろお金をかけずに調査をできてラッキーだと思うべきです。</p>\n\n<p>逆に言うとファンドレイズが成功したプロジェクトの場合、ニーズがあることを確認し、前金が手に入り、見込み客と顧客までも同時に手に入れることができます。これまでの商慣習を考えると、商品を販売する前にニーズとお金と顧客の全てを手に入れるなんて、<strong>魔法としか思えないような出来事なんですね。</strong></p>\n\n<p>こういったマーケティング最前線の現場を見ていると、フリーランスや中小企業の社長に必要なのは、<strong>お金ではなく工学的な知識</strong>であることがわかります。このコースを受講して、工学的なマーケティングの知識を手に入れ、現場で試してみてください。</p>\n\n<p><strong>なぜニュートンが錬金術にハマったか。</strong>その理由の一片が理解できるかもしれません。</p>", 
    "end_date": null, 
    "title": "ニュートンが錬金術にハマった理由：使えるマーケティング工学の最前線", 
    "price": "20.00", 
    "instructors": "Haamalu Limited Liability Company", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790532_1715_2.jpg", 
    "course_url": "https://www.udemy.com/american-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Marketing Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-12T12:01:40Z"
}