{"selfpaced": false, "topic_name": ["Statistics & Probability"], "description": "\n\n                    \n                    \n                    Statistics is a versatile discipline that has revolutionized the fields of business, engineering, medicine and pure sciences. This course is Part 1 of a 4-part series on Business Statistics, and is ideal for learners who wish to enroll in business programs. The first two courses cover topics in Descriptive Statistics, whereas the next two courses focus on Inferential Statistics.\n\nSpreadsheets containing real data from diverse areas such as economics, finance and HR drive much of our discussions.  \n\nIn Part 1, we shall be exploring multiple ways to describe these datasets, numerically as well as visually. Throughout, we shall embrace a problem-based approach to understanding the material: the primary reason to pick up a tool or a technique will be to solve a problem. Our course makes judicious use of tools.\n\nIn Part 2, we shall take up a few datasets that have over a million rows, which makes it impossible to analyze using a spreadsheet. This is a natural setting for R, an advanced statistical programming platform. The courses incorporate helpful tutorials to get learners acquainted with both the mechanisms. Parts 3 and 4 are dedicated to Inferential Statistics. In Part 3, we begin by exploring the benefits of random sampling, and apply the Central Limit Theorem to arrive at confidence intervals for important population parameters. We also learn how to formulate hypotheses for business data, and resolve them with the testing framework that we establish. Along the way, we shall compare two or more populations and draw inferences with a set of statistical tests.\n\nYou will learn all these concepts with the help of various demonstrations, which show real-life application of the concepts related to business situations.\n\n                                    ", "end_date": "2017-09-14T00:00:00Z", "title": "QM101.1x: Statistics for Business – I", "price": 0, "instructors": "Ishita Kumar and Shankar Venkatagiri", "institution_name": ["Indian Institute of Management Bangalore"], "commitment": "5-7 hours", "subject_name": ["Mathematics"], "course_url": "https://www.edx.org/course/statistics-business-i-iimbx-qm101-1x-0", "duration": "53 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-09-08T00:00:00Z"}