{"selfpaced": false, "topic_name": ["Statistics & Probability"], "description": "\n\n                    \n                    \n                    Statistics 2 at Berkeley is an introductory class taken by about 1000 students each year. Stat2.2x is the second of three five-week courses that make up Stat2x, the online equivalent of Berkeley's Stat 2.\n\nThe focus of Stat2.2x is on probability theory: exactly what is a random sample, and how does randomness work? If you buy 10 lottery tickets instead of 1, does your chance of winning go up by a factor of 10? What is the law of averages? How can polls make accurate predictions based on data from small fractions of the population? What should you expect to happen \"just by chance\"? These are some of the questions we will address in the course.\n\nWe will start with exact calculations of chances when the experiments are small enough that exact calculations are feasible and interesting. Then we will step back from all the details and try to identify features of large random samples that will help us approximate probabilities that are hard to compute exactly. We will study sums and averages of large random samples, discuss the factors that affect their accuracy, and use the normal approximation for their probability distributions.\n\nBe warned: by the end of Stat2.2x you will not want to gamble. Ever. (Unless you're really good at counting cards, in which case you could try blackjack, but perhaps after taking all these edX courses you'll find other ways of earning money.)\n\nThe fundamental approach of the series was provided in the description of Stat2.1x and appears here again: There will be no mindless memorization of formulas and methods. Throughout the course, the emphasis will be on understanding the reasoning behind the calculations, the assumptions under which they are valid, and the correct interpretation of results.\n\nFAQ\n\nWhat is the format of the class?\n\n\tInstruction will be consist of brief lectures and exercises to check comprehension. Grades (Pass or Not Pass) will be decided based on a combination of scores on short assignments, quizzes, and a final exam.\n\t\n\tHow much does it cost to take the course?\n\tNothing! The course is free.\n\t\n\tWill the text of the lectures be available?\n\tYes. All of our lectures will have transcripts synced to the videos.\n\t\n\tDo I need to watch the lectures live?\n\tNo. You can watch the lectures at your leisure.\n\t\n\tWill certificates be awarded?\n\tYes. Online learners who achieve a passing grade in a course can earn a certificate of achievement. These certificates will indicate you have successfully completed the course, but will not include a specific grade. Certificates will be issued by edX under the name of BerkeleyX, designating the institution from which the course originated.\n\t\n\tCan I contact the Instructor or Teaching Assistants?\n\tYes, but not directly. The discussion forums are the appropriate venue for questions about the course. The instructors will monitor the discussion forums and try to respond to the most important questions; in many cases response from other students and peers will be adequate and faster.\n\t\n\tDo I need any other materials to take the course?\n\tIf you have any questions about edX generally, please see the edX FAQ.\n\t\n\n\n                                    ", "end_date": "2014-05-19T00:00:00Z", "title": "Stat2.2x: Introduction to Statistics: Probability", "price": 0, "instructors": "Ani Adhikari and Philip B. Stark", "institution_name": ["University of California, Berkeley"], "commitment": "", "subject_name": ["Mathematics"], "course_url": "https://www.edx.org/course/introduction-statistics-probability-uc-berkeleyx-stat2-2x", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2014-04-14T00:00:00Z"}