{
    "selfpaced": true, 
    "topic_name": [
        "Databases"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Programming\n                                                                                                    &gt; Databases\n                                                            \n                            \n                                                \n                    \n                    \n                    \"Introduction to Databases\" was one of Stanford's inaugural three massive open online courses in the fall of 2011 and was offered again in early 2013. January 2014 will mark its third offering. The course includes video lectures and demos with in-video quizzes to check understanding, in-depth standalone quizzes, a wide variety of automatically-checked interactive programming exercises, midterm and final exams, a discussion forum, optional additional exercises with solutions, and pointers to readings and resources. Taught by Professor Jennifer Widom, the curriculum draws from Stanford's popular Introduction to Databases course.\r\nWHY LEARN ABOUT DATABASES\r\nDatabases are incredibly prevalent -- they underlie technology used by most people every day if not every hour. Databases reside behind a huge fraction of websites; they're a crucial component of telecommunications systems, banking systems, video games, and just about any other software system or electronic device that maintains some amount of persistent information. In addition to persistence, database systems provide a number of other properties that make them exceptionally useful and convenient: reliability, efficiency, scalability, concurrency control, data abstractions, and high-level query languages. Databases are so ubiquitous and important that computer science graduates frequently cite their database class as the one most useful to them in their industry or graduate-school careers.\r\nPREREQUISITES:\r\nThe course does not assume prior knowledge of any specific topics, however a solid computer science foundation -- a reasonable amount of programming, as well as knowledge of basic computer science theory -- will make the material more accessible. Also bear in mind that picking and choosing which topics to learn is a great approach, and not all topics require the same level of background.\n\n                                            Syllabus\n                        This course covers database design and the use of database management systems for applications. It includes extensive coverage of the relational model, relational algebra, and SQL. It also covers XML data including DTDs and XML Schema for validation, and the query and transformation languages XPath, XQuery, and XSLT. The course includes database design in UML, and relational design principles based on dependencies and normal forms. Many additional key database topics from the design and application-building perspective are also covered: indexes, views, transactions, authorization, integrity constraints, triggers, on-line analytical processing (OLAP), JSON, and emerging NoSQL systems. Working through the entire course provides comprehensive coverage of the field, but most of the topics are also well-suited for \"a la carte\" learning.\n                                    ", 
    "end_date": "2014-08-25T00:00:00Z", 
    "title": "DB: Introduction to Databases", 
    "price": 0, 
    "instructors": "Jennifer Widom", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://class.stanford.edu/courses/Home/Databases/Engineering/about", 
    "duration": "11 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Stanford OpenEdx"
    ], 
    "start_date": "2014-06-09T00:00:00Z"
}