{
    "selfpaced": false, 
    "topic_name": [
        "Databases"
    ], 
    "description": "\n\n                    \n                    \n                    Learn everything you need to know to get started building a MongoDB-based app. This course will go over basic installation, JSON, schema design, querying, insertion of data, indexing and working with the C# driver. In the course, you will build a blogging platform, backed by MongoDB.\r\nDetails\r\n\r\n\r\nDuration: 7 weeks\r\nEach week we release new video lectures and a new assignment.\r\nYour final grade for the course will be comprised of weekly assignments which count for half of your grade and a final exam/project which counts for the other half of your grade.\r\nYou will receive a certificate of completion at the end of the course if you achieve a 65% or above on graded material.\r\n\r\n\r\nObjective\r\n\r\nAfter completing this course, you should have a good understanding as to how applications are built on top of MongoDB using the .NET framework. This course should also prepare you to take the C100DEV: MongoDB Certified Developer, Associate Level exam. Register for next exam session to become a MongoDB Certified Professional.\r\n\r\nPrerequisites\r\nTo take this course you should be familiar with the .NET framework. Knowledge of relational databases is not required.\n\n                                            Syllabus\n                        Week 1: Introduction and OverviewWeek 2: Creating, Reading and Updating Data (CRUD)Week 3: Schema DesignWeek 4: PerformanceWeek 5: Aggregation FrameworkWeek 6: Application EngineeringWeek 7: Case Studies\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "M101N: MongoDB for .NET Developers", 
    "price": 0, 
    "instructors": "Craig Wilson", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://university.mongodb.com/courses/M101N/about", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "MongoDB University"
    ], 
    "start_date": "2016-05-24T00:00:00Z"
}