{
    "selfpaced": false, 
    "topic_name": [
        "Databases"
    ], 
    "description": "\n\n                    \n                    \n                    This is an advanced course for operations staff and others interested in administering MongoDB deployments. It is a deeper dive into many of the topics of M102 and several additional subjects. In this course, we will explore performance and monitoring with a detailed tutorial on using MMS. You will learn the mechanics of MongoDB memory and disk usage and how to tune Linux for typical MongoDB workloads. We will look at preparing for disaster recovery under different requirements scenarios ranging from low tolerance for downtime and data loss to high tolerance for both. You will also learn best practices for doing rolling upgrades and other maintenance across replica sets. Building on the introductory coverage of sharding in M102, we will cover sharding mechanics in detail and specific topics such as pre-splitting data and tag-based vs. hash-based sharding. Throughout the course, we will spend considerable time on diagnostic concerns and debugging configuration and other issues in MongoDB deployments. New MongoDB 2.6 features will be addressed throughout the course, including the new security features, which we will cover in the final week. \r\n\r\nThis course should also prepare you to take the DBA certification associate exam. Register for next exam session to become a MongoDB Certified Professional.\r\n\r\nPrerequisites\r\nM102\n\n                                            Syllabus\n                        Week 1: System Sizing and TuningWeek 2: Disaster Recovery and BackupWeek 3: Fault Tolerance and AvailabilityWeek 4: Monitoring and Sharded Cluster ManagementWeek 5: Sharded Cluster Management, Part 2Week 6: Data Integrity, Authentication, and SecurityWeek 7: Authentication, Authorization, and Security\n                                    ", 
    "end_date": "2016-07-12T00:00:00Z", 
    "title": "M202: MongoDB Advanced Deployment and Operations", 
    "price": 0, 
    "instructors": "Adam Comerford", 
    "institution_name": [], 
    "commitment": "7 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://university.mongodb.com/courses/M202/about", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "MongoDB University"
    ], 
    "start_date": "2016-05-24T00:00:00Z"
}