{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Willkommen bei der Akupressur für Sport &amp; Fitness - Der Ort bei Udemy, um die Geheimnisse des Höchstleistungstrainings beim Sport zu enthüllen!</p><p>√ Verbessern Sie Ihre Sportleistung ohne Medikamente selbst mit altbewährten Chinesischen Massagepunkten</p><p>√ Finden Sie die richtigen Massagepunkte leicht mit einfachen und kurzen Full HD Videoclips</p><p>√ Akupressurpunkte für Ausdauer, Konzentration und Reaktion sind im Kurs enthalten.</p><p>√ Akupressurpunkte für Koordination, Sehstärke und Pulsverbesserung sind im Kurs enthalten.</p><p>√ Akupressurpunkte für Angstüberwindung, Stressreduktion und schnelle Entspannung im Kurs enthalten.</p><p>√ Akupressurpunkte für Laufen, Fussball und Yoga sind im Kurs enthalten.</p><p>√ Akupressurpunkte für Notfälle, alltägliche Krankheiten und Reisen sind im Kurs enthalten.</p><p></p><p>&quot;Kurz gesagt, [Akupressur] bietet den maximalen Nutzen ohne gefährliche Nebenwirkungen, die mit vielen Ansätzen der konventionellen Medizin verbunden sind.&quot; </p><p>-William Michael Cargile, B.S., D.C., F.I.A.C.A., Forschungsvorsitzender des Amerikanischen Verbunds der Akupunktur und Orientalischen Medizin</p><p></p><p>Die Akupressur ist wunderbar für Sie geeignet und mit dem Kurs sofort anwendbar. Denn:</p><p>√ Zeitraubende Arztbesuche sind nicht erforderlich.</p><p>√ Nennenswerte Geldausgaben sind nicht notwendig.</p><p>√ Es besteht keine Gefahr der Verletzung, Infizierung oder Schmerzen.</p><p>√ Sie massieren die Punkte sanft mit Ihrem Finger.</p><p></p><p>Die angebotenen Massagepunkte sind:</p><p>√ besonders wirkungsvoll</p><p>√ leicht und ohne fremde Hilfe zu finden</p><p>√ mit professionellen Full HD Photos und Videos dargestellt</p><p></p><p>&quot;Mit dem Kurs konnte ich meine Reaktion und Ausdauer beim Fussballspielen in kurzer Zeit signifikant verbessern! Mit den im Kurs angebotenen Videos sind die Akupressurpunkte sehr einfach zu finden. Ich bin so froh, den Kurs immer dabei zu haben, auf meinem iPhone und iPad!&quot;</p><p>-Sten, Fussballspieler in Deutschland</p><p></p><p>Tausende haben es bereits gemacht. Jetzt haben auch Sie die Möglichkeit, an diesem Akupressurkurs teilzunehmen. Damit werden Sie sich selbst ohne Medikamente und Arztbesuche behandeln können!</p><p></p><p><span></span>Für einen Bruchteil der Kosten eines Arztbesuchs bekommen Sie einen bewährten Akupressurkurs zur lebenslangen Nutzung mit kostenlosen Updates, die weitere Massagepunkte beinhalten werden.</p><p></p><p>Ich wünsche Ihnen viel Spass mit dem Kurs! Melden Sie sich jetzt an!</p><p>Ihr Dr. Bargak - 30 Jahre efolgreicher Akupressurpraxis </p><p></p><p>Haben Sie noch Fragen? Gerne würde ich sie bei Facebook beantworten: suchen Sie einfach nach Dr. Bargak </p>", 
    "end_date": null, 
    "title": "Akupressur für Sport & Fitness - natürliche Höchstleistung", 
    "price": "20.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508296_0324_5.jpg", 
    "course_url": "https://www.udemy.com/akupressur-fur-sport-fitness-naturliche-hochstleistung/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T18:31:36Z"
}