{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is aimed at coaches and athletes who want to take a step forward in the quality and design of their training sessions and performance<br> <br>Attention is one of the most important skills for athletic performance. Knowing how to improve it, how it works and how and when to pay attention can make a big difference in the performance of an athlete.<br> <br>So, if you are a coach looking for  tools to enrich your sessions we will provide valuable basics and examples that allow you to develop your own exercises<br>Or if you are an athlete looking to improve your performance, the course offers a series of exercises that will help you increase your attentional capacities.<br> <br>In turn, we offer the possibility to consult and ask through our website to clarify all your doubts.<br> <br>A total of 19 videos (including the introduction) make this course, which are classified into theoretical and practical sessions, accompanied by PDF documents that complement and explain more deeply the contents of the videos.<br>We also include the bibliographic references used so that, if desired, will allow you to deepen your knowledge.<br> <br>The videos have been designed in a short-format to make it easier consult them.<br> <br>Through simple language, but scientifically based, we explain basic concepts that will enable understanding of attention and how this ability is related to athletic performance.<br> <br>The videos included at the practice section aim to show some exercises to train attention using a different and easy methodology to implement at the same time adaptable to all kinds of sports.<br> <br>Beyond the approximately 2hour course, our idea is to open possibilities in the design of your sessions, as well as to positively boost your athletic performance</p>", 
    "end_date": null, 
    "title": "Attention Training to Improve Sport Performance", 
    "price": "45.00", 
    "instructors": "Sport Neuro Training", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683418_83a9_2.jpg", 
    "course_url": "https://www.udemy.com/sport-neuro-training-attention/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T17:04:28Z"
}