{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t   Con este curso entrenarás el área mental del Golf, que no suele entrenarse, y este hecho convierte al Golf en un deporte imprevisible.  </p>  <p style=\"\">  \t   Voy a enseñarte cómo construir tu rutina del área Mental, de la misma forma que, para jugar, utilizas tus rutinas del área Técnica, del área Física y del área Estratégica.  </p>  <p style=\"\">  \t   Los profesionales de altísimo nivel que compiten el los torneos americanos, europeos y asiáticos suelen tropezar, cuando no pasan el corte, sólo en uno o dos hoyos.  </p>  <p style=\"\">  \t   ¿Qué pasaría si no lo hicieran? Estarían en las primeras plazas del torneo.  </p>  <p style=\"\">  \t   ¿Y qué pasaría si cada semana de entrenamientos fueran mejores jugadores sin experimentar retrocesos? Disputarían los torneos para intentar ganarlos.  </p>  <p style=\"\">  \t   Con los jugadores amateurs que entrenan en serio y quieren mejorar, ocurriría lo mismo si establecen y utilizan en competición la rutina del área Mental que enseño en este curso.  </p>  <p style=\"\">  \t   Por eso te lo recomiendo, no hay nada igual en el mercado, de hecho he registrado mi método con el nombre de &quot;Double Player&quot;. Lo que te enseño en este curso sorprende a los mismos jugadores profesionales y se lo demuestro con ejercicios que confirman todos mis descubrimientos.  </p>  <p style=\"\">  \t   Me he encontrado con que todas las dificultades que no se saben solucionar están dentro del área Mental del Golf y por eso debemos entrenar este área.  </p>", 
    "end_date": null, 
    "title": "Baja de 2 a 5 golpes cada día de Competición", 
    "price": "30.00", 
    "instructors": "Tomas Guijarro Zapiain", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/261328_285d_3.jpg", 
    "course_url": "https://www.udemy.com/metodo-double-player-de-entrenamiento-mental-en-el-golf/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-14T19:41:44Z"
}