{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><em style=\"\">Do you want to pick up basketball as a hobby?</em></p><p style=\"\"><em style=\"\"></em><em style=\"\">Do you want to improve on your basketball skills?</em></p><em style=\"\">Do you want to be a better basketball player?</em><p style=\"\"><br style=\"\"></p><p style=\"\">Well, this is the course for you.</p><p style=\"\"><strong style=\"\">Welcome to the Basketball for Beginners Course!</strong></p><p style=\"\"><strong style=\"\"></strong>Although this course is titled for beginners, it is open to anyone at any skill level.  The reason why this course is open for everyone is because this course is about learning the basic fundamentals of basketball; the fundamentals are the foundation to any basketball player at any level.  </p><p style=\"\"><strong style=\"\">Expectations from this course.</strong><br style=\"\"></p><p style=\"\">The course is split into four sections which are knowing what to knowing what to do on offense and defense and learning drills to improve your offensive and defensive skills.  Whether you are on a offensive or a defensive possession, you will learn what to move to make in a specific scenario.  Furthermore, you will learn drills that will help you make those moves efficiently in live action.  In this course, you will also learn basketball terminologies.  This course will consist of lectures that are about 1 hour long in total.  </p><p style=\"\"><strong style=\"\">Why take this course?!</strong><br style=\"\"></p><p style=\"\">Take this course because basketball is just a fun sport/hobby to get involved.  It will also be a great learning experience.  I guarantee if you apply the things I teach to you from this course, then your basketball I.Q. and skills will improve dramatically.</p><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Basketball for Beginners: Improving Your Basketball Skills", 
    "price": "20.00", 
    "instructors": "Daniel Yoo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428872_bc80.jpg", 
    "course_url": "https://www.udemy.com/basketball-for-beginners-improving-your-basketball-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T04:54:45Z"
}