{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">The most important moment in a pro eSports gamer&#039;s career is its initiation, how one makes the transition from being a hobby or amateur player to a dedicated, determined, hard working and winning professional. This transition is also the hardest stage of any eSports gamers&#039; career.</p><p style=\"\">Long time Evil Geniuses StarCraft 2 gamer Chris &quot;Huk&quot; Loranger mentions his transition and the hard work involved in pro gaming (from the article, &quot;Chris &#039;Huk&#039; Loranger Believes eSports Is A Lot Harder Than People Think,&quot; <em style=\"\">GameSkinny</em>.):</p><p style=\"\"><strong style=\"\">&quot;I played <em style=\"\">StarCraft I</em> and other videogames for a long period of time, but after high school I wasn&#039;t sure what to do with my life basically. I was going to join the US Military to help pay for school – and I didn&#039;t want to take out loans – one, because I didn&#039;t want to take out loans and two, because I didn&#039;t really know what I wanted to do anyway. So I was in the process of joining the military, I took the tests, I was on a waiting list, and <em style=\"\">StarCraft 2</em> came out. I was playing it for fun, and then I started doing good. I got an offer on a team for like $500 a month, and they offered to fly me out to tournaments for three months. So I said, &#039;What the hell, I&#039;m waiting anyway, I can do this.&#039; And since then, I&#039;ve gotten better and better deals, and now the military is something I obviously decided not to do.</strong></p><p style=\"\"><strong style=\"\"> It&#039;s a lot harder than most people realize. You&#039;ve got to be hard working. You have to be able to take criticism, and be able to be humble. And then generally, you&#039;ve got to be pretty dexterous and smart, I guess, in some ways.&quot;</strong></p><p style=\"\">The purpose of this course is to give the aspiring pro eSports gamer a mindset in order to confidently make that transition. <em style=\"\">Become a Pro Gamer (eSports Athlete)</em>, or otherwise called after the book it&#039;s based on, <em style=\"\">Jumpstart Your Pro eSports Gaming Career, </em>will provide you with insights, inspiration, advice and tools to gain a concrete vision on what it means to become a pro eSports gamer. It covers:</p><ul style=\"\"><li style=\"\">Strategies for improving your pro gaming career focus, goal orientation and approach;</li><li style=\"\">How to create a supportive environment around yourself for realizing your pro gaming dreams;</li><li style=\"\">Tools to develop a success mindset, defining your pro gaming dreams, and your goals and targets to realize those dreams;</li><li style=\"\">How to make the right moves in the business of eSports;</li><li style=\"\">Pinpoint common mistakes young aspiring pro gamers and teams make;</li><li style=\"\">Practical tools to maximize your gaming performance</li><li style=\"\">Tested methods for overcoming common problems in human relations and team dynamics.</li></ul><p style=\"\"><em style=\"\"><em style=\"\">Become a Pro Gamer (eSports Athlete)</em></em> is a work that has passed through eSports athletes, educators and entrepreneurs who share a vision of an ever-expanding eSports world. </p><p style=\"\">What is key to note in the beginning of <em style=\"\"><em style=\"\">Become a Pro Gamer (eSports Athlete)</em></em> is that this course aims to give you a success mindset to approach everything you encounter. With this mindset, you will be able to funnel information that you encounter in a way that best serves your goals. You will know what to use, what not to use, how much time and importance to place onto everything that comes your way, so that you can establish yourself a pro gamer, and also maintain balance with other areas of your life. </p>", 
    "end_date": null, 
    "title": "Become a Pro Gamer (eSports Athlete)", 
    "price": "20.00", 
    "instructors": "Addiktz Expertz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497980_ce22_3.jpg", 
    "course_url": "https://www.udemy.com/progaming/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-10T02:07:51Z"
}