{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t      A torough Foundation for Divers seeking valuable knowledge in which to start developing a solid base towards <strong style=\"\">Safe and Efficient Exploration</strong> of new dive sites, wrecks, mines and even untravelled cave passages.  </p>  <p>  \t      Application of Rebreather technology and multiple DPV&#039;s can easily result in extreme exposures that will take the Dive Explorer beyond traditional diving industry limits.  </p>  <p>  \t      How to be prepare to endure multiple hours dives at depths beyond 100mt / 330ft while breathing multiple Breathing Mixes of Nitrox and Trimix while exploring dive areas, possibly no man ever been before, is what Dive Explorer Training is all about.  </p>  <p>  \t      This course should be paired with in-water practice by an experience Instructor, actually is a perfect tool to have when planning to take any Technical Diving Course, but also invaluable aid is thru mentorship in actual Exploration Projects.  </p>  <p>  \t      This is the<strong style=\"\"> IDREO </strong>Explorer Diver Manual for all IDREO Training levels.  </p>  <p>  \t      WARNING: DEEP, DPV, REBREATHER &amp; CAVE DIVING IS POTENTIALLY DANGEROUS, WE HIGHLY RECOMMEND YOU APPLY THIS INFORMATION UNDER DIRECT SUPERVISION OF A PROFESSIONAL  </p>", 
    "end_date": null, 
    "title": "Become a Safe and Efficient Dive Explorer ", 
    "price": "50.00", 
    "instructors": "Chongmin Han, IDREO Asia  Jason Lim, Håkan Gustafsson,  Nick Toussaint, Kevin Runkle,  JongMoon Choi, Joa Löfström,  Paul Okishev", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33353_f338_10.jpg", 
    "course_url": "https://www.udemy.com/divexplorer/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-22T08:51:14Z"
}