{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>All SPORTS Training for:</strong><br><strong>Breathing - Mind Sharpening - Flexibility Training</strong> <br></p><p>Increase Sports Performance to Affect Breathing, The Mind and Overall Flexibility.</p><p>This sports science online course is a ‘must have’ for Athletes, coaches, teams and trainers, is the only one of it’s kind and teaches powerful Breathing Techniques and Mind Sharpening Exercises to increase performance and gain the competitive edge. Learn how to control stress and anxiety and release internal pressure. Enhance game day performance, increase focus, composure, attitude, energy.<br></p><p><strong></strong><strong>BREATHING</strong>–When we lose or hold our breath dur­ing sports com­pe­ti­tion, the mind dis­con­nects with the body. When this hap­pens, it often results in mak­ing the high­light reel for the wrong rea­sons! Learn how to control this! Breath­ing can increase alert­ness and recov­ery and used prop­erly gives you access to your own per­sonal Oxy­gen Bar.</p><p><br><strong>MIND SHARPENING</strong>–Many exer­cises that are labeled as Med­i­ta­tion are actu­ally mind related tools that increase focus, com­po­sure, alert­ness and instinc­tual reac­tions. Con­nect­ing the breath with these exer­cises com­pound the pos­i­tive results.<strong></strong></p><p><strong>FLEXIBILITY</strong>- Work on Flexibility, inside and out. Stretching that will make you more durable and Mental Flexibility that will allow you increased composure and focus  in stressful situations. Stretching with the Z-Stick that can be done anywhere and will help reduce injuries while increas­ing range of motion. Learn how to prop­erly direct the breath while stretch­ing with the Z-STICK to allow for a faster increase of over­all flexibility.</p><p><strong></strong> No Experience Necessary. Prepare yourself for \nsuccess on and off the field. Work on \nBreathing, Mind Sharpening and flexibility gained through deep \nstretching with the ZStick. This helps to maintain the body's posture \n&amp; alignment resulting in a better economy of energy. Additionally, \nthe muscle is flexible and able to extend a full range of motion, \nreducing injury.<br></p><p><strong>Hydration Sports Science-</strong> Learn the benefits of proper Hydration and why the recommended, \"drink 8 x 8oz. of water\" could be hindering your performance.<br><strong>Football-Baseball-Basketball-Lax-Soccer-Hockey-Golf-MMA-All stick sports</strong></p><p><strong></strong></p><p>Tim Kelly is 50 years young and the creator of Zenhaling. Tim is a specialist who teaches Breathing and Mind Sharpening techniques to coaches and athletes to enhance performance, cope with stress and anxiety and release internal pressure. <br></p><p><strong></strong><br><br></p>", 
    "end_date": null, 
    "title": "Breathing and Mind-Body Sports Science for Athletes/Coaches", 
    "price": "50.00", 
    "instructors": "Zenhaling Timothy Kelly", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612928_2b77_5.jpg", 
    "course_url": "https://www.udemy.com/zsports-science/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T17:02:57Z"
}