{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>DO YOU WANT TO PLAY AT THE COLLEGE OR PRO LEVEL? </strong>  </p>  <p>  \t<strong>It's time to educate yourself and find the right fit.</strong>  </p>  <p>  \t<strong></strong>You can change your life through college sports but first you need to understand the recruiting process and the importance of promoting yourself effectively. It's key to get educated so you don't miss out on your playing opportunities.  </p>  <p>  \t  Our informative course will <strong>SAVE</strong> you lots of <strong>TIME</strong> and <strong>MONEY</strong>. This course is ideal for high-school student athletes, prospective college recruits, parents, high-school coaches and players of all levels who truly want to <strong>play sports at the college or professional level</strong>. The course will help <strong>educate players in a fun way</strong> about the rigorous college recruiting process and outline steps athletes need to take to play at the next level.  </p>  <p>  \t                  The course contains <strong>19 animation videos</strong> with over <strong>30 min</strong> of quality content and great expert advise. We can truly confess that our <strong>animation explanatory videos</strong> were created to help educate our audience and keep them engaged in a fun and creative way.  </p>  <p>  \t                  The structure of the course contains 7 short sections presenting vital information and tips about the <strong>college recruiting</strong> and <strong>professional scouting process</strong>. This course will help players of all levels prepare to stand out from their competition by teaching them how to:  </p>  <ul>  \t<li><em>BE PROACTIVE</em></li>  \t<li><em>DEVELOP YOUR STRATEGY</em></li>  \t<li><em>BUILD YOUR PLAYER'S IDENTITY</em></li>  \t<li><em>PROMOTE YOURSELF EFFECTIVELY</em></li>  \t<li><em>HAVE AN ONLINE PLAYER'S RESUME PROFILE</em></li>  \t<li><em>CREATE QUALITY VIDEO HIGHLIGHTS</em></li>  \t<li><em>THE COST OF CHANGING MAJORS IN COLLEGE </em></li>  \t<li><em>CRITERIA TO LOOK FOR WHEN TRYING TO FIND THE RIGHT FIT</em></li>  \t<li><em>GET CLOSER TO PLAY AT THE NEXT LEVEL</em></li>  \t<li><em>AND MORE…</em></li>  </ul>  <p>  \t<em>We truly hope you will enjoy our course and gain valuable information to help you succeed in your sports journey. </em>  </p>  <p><em><br></em></p><p>  \t<em>Thank you, <br></em></p><p><em>Nicolae Popescu</em></p><p><em></em><em>Founder of WeGotPlayers</em></p>", 
    "end_date": null, 
    "title": "College Recruiting Advise For Student Athletes", 
    "price": "20.00", 
    "instructors": "Nicolae Popescu", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/330606_77da_5.jpg", 
    "course_url": "https://www.udemy.com/college-recruiting-process-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T15:41:23Z"
}