{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>LATEST: Course Last Updated 10th June 2016<br></p><p>************************************************</p>\n\n<p>Learn the secrets to being prepared when it comes to going to the gym for the first time. It's time to take control of your body and develop it to the best of your abilities. It's time to get off your couch and start doing the things that will guide you closer to your goals.</p>\n\n<p>Learn the things that you need to know before heading to the gym for the first time!</p>\n\n<p>+++++++++++++++++++++++</p>\n\n<p>About this course:</p>\n\n<ul><li><em>No workbooks, CD's or anything else is required</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul>\n\n<p>+++++++++++++++++++++++</p>\n\n<p>This course teaches students the best way to prepare before and what to do during your time at the gym. It consists of a wide range of topics that will together guide you to being well prepared when you take your first step as a gym member.</p>\n\n<p>These are some of the topics covered in the course:</p>\n\n<ul><li>Why do you want to join a gym?</li><li>Should you go alone or with a trainer?</li><li>Keeping a gym diary</li><li>Bro science vs real science</li><li>Most people have no idea what they're doing</li><li>Finding the right gym for you</li><li>Gym facilities that you might consider</li><li>Types of gyms</li><li>Types of trainign programs</li><li>Gym clothing</li><li>Importance of form</li><li>Training partners</li><li>Food</li><li>Cardio</li><li>Body Types</li><li>...and more.</li></ul>\n\n<p>To watch the course videos, you will need roughly a little bit less than two hours. However, students are encouraged to take an active role throughout the course, by taking down notes and think about how they can best adapt the information to suit their own needs and desires. Also further research is encouraged after the course.</p>\n\n<p>The instructor is also available to answer questions about the course, so if, as a student you have any problems, you will always have a person that can help you achieve the results that you want.</p>\n\n<p>If you believe that you are ready for your dream body, if you want to get the best information and start building yourself up to the best that you can be, then this is the course for you. The lectures in this course will guide you along how to prepare before and what to during your time in the gym.</p>\n\n<p>It's time to take action, enroll now to get started!</p>", 
    "end_date": null, 
    "title": "Don't Join A Gym Before Knowing This Information", 
    "price": "20.00", 
    "instructors": "Kevin Farrugia", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532116_8451_2.jpg", 
    "course_url": "https://www.udemy.com/before-the-gym-things-to-know-before-stepping-inside-a-gym/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T12:36:22Z"
}