{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><span>Dynamic Flexibility is designed for ACTIVE MEN and WOMEN, who want to be more athletic and flexible.  Wanting to lose weight or move with less pain? Beginners will love how simple and easy to follow these movements are! You will have better BALANCE, COORDINATION and CORE STRENGTH after taking this course. If you are starting a fitness routine, this is a blueprint for activity.</span></p><p>This course is for ATHLETES who are looking to optimize their performance. Dynamic Flexibility will increase your muscle TONE and elasticity along with joint MOBILITY for greater Range of Movement. </p><p>Dynamic Flexibility allows for greater power output while reducing the risk of injury.</p><p>Dynamic Flexibility will NOT make you bulk up or increase your size the way resistance training will.  These exercises will prep you body for activity and build core strength. </p><p>Do you have back pain?  Are your hips tight? Do have restrictions in your shoulders?</p><p>Dynamic Flexibility creates space to RELIEVE PAIN.  </p><p>This course will lead to a greater sense of well being, better posture and more confidence. </p><p>3 main sections: (1) Dynamic Movements (2) Foam Roll Release (3) Development </p><p>It may take you longer in the beginning to practice the movements, however, consistent effort with repetition for at least 7days will have you performing them faster with greater EFFICIENCY.  </p><p>As you learn,  it will take less time to complete the routine.  </p><p>Flexibility applies more than just to our physical bodies, its a representation of our life.  As you practice these movements consistently, you will become less anxious and more present, while feeling happier and more patient with those around you.</p><p>This is a simple course that requires no prior training or coaching.  Anyone can implement these exercises to see a better return on your workout time.  </p><p>Athletic </p><p>Weight Loss</p><p>Weight Management</p><p>Pain Relief</p><p>Performance</p><p>Lifestyle</p><p>FlexibleLife</p><p>Efficient</p><p>Recovery</p><p>Simple</p><p>Repeatable</p><p>Range</p><p>Balance</p><p>Body Control</p><p>Awareness</p><p>Practical </p><p>Functional</p><p>Foundation</p><p>Core Strength</p>", 
    "end_date": null, 
    "title": "Dynamic Flexibility: Quick, Simple, Effective", 
    "price": "45.00", 
    "instructors": "Steven Mays", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468280_9df9_3.jpg", 
    "course_url": "https://www.udemy.com/dynamicflexibility/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-05T17:42:51Z"
}