{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><strong style=\"\">&quot;Golf is 99 percent in your head.&quot;</strong>Annika Sorenstam, 90 tour wins, one of the greatest female golfers ever.</p><p style=\"\">This true of most sports. When we make a mistake it can be burned into your psyche. How many times have you said, or heard another golfer say, &quot;I always miss [insert shot here]. How often do you see the runaway leader falter and lose. This is what made <strong style=\"\">Tiger Woods </strong>so feared on the course - in his prime, he was so tough mentally that he pretty much never faltered. If you were behind, you stayed behind.</p><p style=\"\">Yes, you need to practise your strokes. But what happens when you <strong style=\"\">get a handle on the mental part of the game</strong>? Mental errors like these...</p><p style=\"\"><strong style=\"\">Tension</strong></p><p style=\"\">I hear golfers complain a lot about tension on the course. They complain that tension gets in the way of smooth swings and putting strokes. What would happen to your game if you had a simple technique that could produce relaxation in about 20 seconds on the course?</p><p style=\"\"><strong style=\"\">Emotional Memories</strong></p><p style=\"\">Golfers are often haunted by <strong style=\"\">negative emotional memories</strong>. If they mis-hit a shot on the first tee, it affects their entire game. If they come to a hole that they hit a bad shot on a week ago, all they can think about is that bad shot last week. What would happen to your game if you had a simple technique that could erase negative emotional memories in a few minutes?</p><p style=\"\"><strong style=\"\">Emotional Reactions</strong></p><p style=\"\">If you watch professional golf, you&#039;ve seen Tiger Woods&#039;s reaction to hitting a bad shot. It is clear that he is having quite a negative reaction at the moment. What is amazing to most people is that he can leave that negative emotional reaction behind and <strong style=\"\">completely focus on the next shot. </strong>How would your game improve if you had that same ability?</p><p style=\"\"><strong style=\"\">Comfort Zones</strong></p><p style=\"\">Comfort zones affect all golfers, even the touring pros. You can tell when a comfort zone has been triggered; <strong style=\"\">self-sabotage</strong> kicks in. An example is when a golfer shoots the front nine better than his typical round and then sabotages the back nine, completing the round at about his average score. Or you see the reverse. He shoots a poor front nine, then recovers and shoots a great back nine to end the round at about his average. What if you had an easy process that would help you breakthrough and elevate your comfort zone?</p><p style=\"\"><strong style=\"\">Personal Problems</strong></p><p style=\"\">We have all had experiences where we t<strong style=\"\">ake a personal problem onto the course</strong> and it affects the way we play. We have all been affected by a disagreement with someone, worrying about something at work, or a myriad of other things. What would happen to your game if you had an easy process that would allow you to <strong style=\"\">leave your personal problems in the parking lot?</strong></p><p style=\"\"><strong style=\"\">First Tee Jitters</strong></p><p style=\"\">The first tee jitters seems to be an almost universal problem. What if you had an easy process that would <strong style=\"\">reduce or eliminate first tee jitters</strong> in about one minute?</p><p style=\"\"><strong style=\"\">Yips</strong></p><p style=\"\">I have been surprised by the number of golfers who will privately admit to me that they have the yips. These include putting yips, chipping yips, hazard yips, and driving yips. Surveys have shown that the yips affect between 20% and 40% of all golfers. It turns out that the yips are common in many sports and even other activities in life such as public speaking. What if you had <strong style=\"\">an easy process that could eliminate the yips</strong> with a little work? Yes, I said &quot;eliminate,&quot; not work around.</p><p style=\"\">This course is designed by an EFT therapist with over twenty years of experience helping golfers just like you handle the stresses that negatively impact their game.</p><p style=\"\">The information inside this training are insider secrets that take regular guys like you and me and improve their golf game instantly.</p><p style=\"\">Secrets that put you on the same field as Tiger, Phil, Jack and other top pros... well, it probably won&#039;t give you their scores, but you will feel every bit the champion that they are.</p><ul style=\"\"><li style=\"\">You will get INSTANT, LIFETIME ACCESS to everything I mentioned - the EFT lessons that show you everything from A to Z!</li><li style=\"\">LIFETIME UPDATES with NO ADDITIONAL costs, which includes more lectures, bonuses and special reports.</li><li style=\"\">SUPER FAST &amp; UNLIMITED SUPPORT, if you have any questions or need help in something, we are always here to help. Our support is <em style=\"\">LEGENDARY</em> at Udemy!</li></ul><p style=\"\"><em style=\"\">Oh, and just to make this a complete no brainer… I&#039;m removing all the risk! EFT for Golf - Improve your score. Master the Mental Game course comes with a 30 Day Full Money Back Guarantee! If you aren&#039;t blown away by the information inside it, and your improved golf scores, you&#039;ll get 100% of your money back!</em></p><p style=\"\">Start to golf like a boss NOW!</p>", 
    "end_date": null, 
    "title": "EFT for Golf - Improve Your Score. Master the Mental Game", 
    "price": "30.00", 
    "instructors": "Scott Paton, Joan Kaylor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490756_e2af_6.jpg", 
    "course_url": "https://www.udemy.com/eft-for-golf-improve-your-score/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T19:50:49Z"
}