{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "\n\n\n\n<p><strong>Here is the challenge...if you take the Scuba Diving Course:  Extreme Scuba Lessons  Class</strong></p>\n\n<p>&lt;/p&gt;<br></p><ul><li>You will <strong>drop</strong> a significant amount off your current <strong>weighting system.</strong></li><li>You will acquire <strong>perfect buoyancy</strong> on which you can build impeccable skills.</li><li>You will attain gorgeous <strong>UTD/DIR style trim</strong> (prone) position by learning \"insider tricks.\"</li><li>You will significatly <strong>improve</strong> your air consumption rate.</li><li>You will start developing <strong>positioning kicks</strong> such as frog kicks.</li><li>You will improve your knowledge of <strong>Min Deco</strong> to dive without relying on a computer.</li><li>You will improve your understanding of <strong>gas management</strong> your return to the surface.</li><li>You will learn to conduct <strong>skills</strong> without getting on your knees.</li><li><strong>Most importantly</strong> you will be on a path to become a thinking diver!!!</li></ul>\n\n<p>If you are like many of us and are interested in improving your scuba diving skills, this Extreme Scuba Makeover (ESM) program is the first step toward that goal. This 14-part online video class (2 hours) focuses on the \"foundation\" (buoyancy, trim and weighting).  It breaks it down step by step to show you how to execute proper buoyancy, determine the proper amount of weighting to use, and most importantly figure out how to get that \"perfect\" UTD/DIR Trim.</p>\n\n<p>Maybe you've seen other divers who are destroying the ocean bottom, beating on the reef, kicking up the silt, and crashing down on delicate corals because they need to improve their scuba diving skills. Seeing this, you probably thought to yourself, \"I don't want to be that diver.\"  Maybe you <em>are</em>that diver and want to change and improve or relearn your skills.  Maybe you are a new diver and want to perfect your skills or feel that something was missing in your training.  In any case, the number one law of learning is the \"Law of Primacy,\" meaning that the first thing you learn is what you will remember the most. Given this law, you can see why so many divers have learned wrong...they learned to conduct all their skills on their knees and therefore are most comfortable doing skills on their knees and/or diving with poor trim, buoyancy, and weighting. </p>\n\n<p><strong>Let's Take a Look at a Before and After</strong><strong>:</strong></p>\n\n<p>In this ESM video tutorial (or DVD), we will take you back to the basics with over 12 video chapters of foundational scuba diving skills that you can conduct at your home, gym, or local community pool to build a solid foundation. In these videos we will rebuild your trim, buoyancy, and weighting so that you will have a solid base on which to develop exceptional diving skills. This is an excellent primer for any UTD Class, or a wonderful way to conduct your own refresher.  You may just feel like your scuba diving abilities need a boost.</p>\n\n<p>As an alternative to \"home study\", we also offer a UTD \"Mini,\" which is a one day class.  In this class you can find a local UTD instructor,  review the materials with them, and then work directly in a local pool or quarry on the skills.  You will refine them and get professional feedback on your development. The instructor will also shoot before and after videos, helping you identify your progress and some of the weaknesses you have that you will need to practice and improve on. Mini's are not \"pass/fail\" classes or certification.  They are merely workshops to help you develop your personal diving skills in a specific area. </p>\n\n<p>  </p>\n\n\n\n<p>The following are some samples from this 12-video  chapter scuba  diving course series:</p>\n\n<p>&lt;/p&gt;<br></p><p><strong>Chapter 1</strong></p>\n\n\n\n<p><strong><strong>Chapter 6</strong><br><br></strong></p>\n\n\n\n<p><strong><strong>Chapter 12</strong><br><br></strong></p>\n\n\n\n<p><strong>So are you ready to take the Buoyancy, Balance and  Trim Challenge, take this extreme scuba lessons?</strong></p>\n\n<p>&lt;/p&gt;<br></p><p><strong>We have several options to choose from (<strong>click buttons below</strong>). You can purchase the online video program which you can do at home, or you can purchase the same program as a DVD video series. You can also seek a UTD instructor to conduct an \"ESM Mini.\"</strong></p>\n\n<h5><strong><strong>And if we fail to deliver as promised, we will completely refund the purchase price of your ESM classroom/dvd materials.</strong></strong></h5>\n\n<h5><strong><strong>Now take the Challenge!!!</strong></strong></h5>\n\n<div><strong><strong><br></strong></strong></div>\n\n<div><p>Take this ultimate Scuba Diving Course right now and  prepare for extreme scuba  lessons.</p></div>\n\n", 
    "end_date": null, 
    "title": "Extreme Scuba Makeover", 
    "price": "25.00", 
    "instructors": "Unified Team Diving", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40578_a041_6.jpg", 
    "course_url": "https://www.udemy.com/extreme-scuba-makeover/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-07T21:13:13Z"
}