{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Building a championship team takes strategy, research, and intuition. Thinking that you have the retained knowledge to roll into your draft and execute without a plan is unintelligent. Especially with as little as 2 years in the game to this point. </p><p>The fact that you are here looking to gain the edge in your league speaks volumes. Allow my course to help you walk into your draft with a well thought out, strategic game plan. </p><p><strong class=\"redactor-inline-converted\">   Here are a few highlights of what will be covered.</strong><br></p><ol><li><strong class=\"redactor-inline-converted\">Understanding what value means when drafting<br></strong></li><li><strong class=\"redactor-inline-converted\">Understanding the importance of mock drafting before the season</strong></li><li><strong class=\"redactor-inline-converted\">What materials you need to bring to your draft.</strong></li><li><strong class=\"redactor-inline-converted\">What players you should not focus on regardless</strong></li><li><strong class=\"redactor-inline-converted\">Understanding when to draft your QB's and TE's.</strong></li><li><strong class=\"redactor-inline-converted\">Examining the deepest position available, and late round fliers</strong></li><li><strong class=\"redactor-inline-converted\">Why drafting Kickers and Team Defense's should be last</strong></li><li><strong>*Bonus Advice* with details on the most focused player people will seek to              draft this 2016 season</strong></li></ol><p>This course should take no more than 1 hour to digest, and is structured with the majority of power point presentations, along with limited video. The TAKEAWAY BONUS is a downloadable PDF that you can print and use as a reference even after you have taken the course. </p><p>Taking this course will definitely sharpen your focus to build an effective strategy, and give you a few new tools to accelerate your knowledge level on how to approach each seasonal draft. This course does not disappoint primarily because in order to accomplish the bigger goal, you must set and execute smaller goals. The overall goal is to get you to the championship game, and WIN! </p>", 
    "end_date": null, 
    "title": "Fantasy Football 101- Draft Day Preparation & Strategy", 
    "price": "20.00", 
    "instructors": "Barry \"Old Navy\" Gipson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848718_bc4c_2.jpg", 
    "course_url": "https://www.udemy.com/fantasy-football-101-draft-day-preparation-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T01:37:10Z"
}