{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>O curso pretende resgatar as habilidades clássicas de se brincar com a bola, aliando ritmo e equilíbrio aos exercícios, para possibilitar uma organização corporal. Será utilizado o <em>rebound training</em>. </p>\n\n<p>Abordará métodos de utilização de minitrampolim (<em>jump</em>) com habilidades clássicas da modalidade, com o objetivo de ensinar a aprender, de refinar os movimentos, utilizando combinações simples entre as habilidades aliadas ao trabalho de equilíbrio e estabilização sobre o minitrampolim.</p>\n\n<p>Neste curso conhecerá mais sobre as possibilidades de uso do peso do próprio corpo utilizando habilidades clássicas e atléticas da ginástica aeróbica, combinadas a exercícios de estabilização, equilíbrio dinâmico e estável, alguns com um leve toque de pliometria.</p><p><strong>Prof. Me. Eduardo Silva da Costa</strong></p><p>Graduado em Educação Física ( há 19 anos na área) ESEF JUNDIAÍ e Pós-Graduado em Treinamento Desportivo FMU,  \nProfessore e Coordenador do departamento de ginástica da academia Cia Athletica (unidade Morumbi-São Paulo),  \nEspecialista em:  Step, Ginástica Localizada, Treinamento e Ginástica Funcional,  \nAulas com Mini Trampolim (REBOUND - Treinamento Funcional Aeróbico), \nMaster Trainer “KANGOO JUMPS” ( Brasil), \nCriador da metodologia GOLD JUMP, treinamento com Mini Trampolim para a terceira idade, \nProfessor palestrante e presenter em várias convenções de Fitness no Brasil e no Exterior (Espanha e Estados Unidos), \nProfessor do “Encontro Internacional de step”. (representante do Brasil -2008). </p><p><br></p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Funcional Aeróbico – Turbine o seu Treino", 
    "price": "20.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/819012_a13d.jpg", 
    "course_url": "https://www.udemy.com/estacio-funcional-aerobico/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T19:35:54Z"
}