{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t Goals are powerful motivating tools, providing athletes and teams with direction, focus, a reason to commit and a means to evaluate their performance. Goals allow athletes and teams to deal with adversity, adapt and persevere, to continue to be motivated even when events do not turn out as planned. Unfortunately, the mental side of sports is often overlooked by coaches and athletes alike.  </p>  <p style=\"\">  \t <br style=\"\">  \t  Goal setting, when done properly helps athletes and teams tap their potential to its fullest. Properly established and utilized goals not only motivate, but provide athletes and teams with a constant source of direction and feedback, allowing for a constant, steady improvement and the best opportunity for achieving at a high level.  </p>  <p style=\"\">  \t <em style=\"\">Goal Setting for Sport: Learning the Ins and Outs of Using Goals to Improve Athletic Performance</em> is a course designed to make the goal setting process as simple as possible as well as providing understanding and insight into how and why the goal setting process works.  </p>  <p style=\"\">  \t Lessons contain a narrated video, action steps and thought questions, all designed to guide a coach or athletes through the process of successfully establishing meaningful goals that will lead to athletic success.  </p>", 
    "end_date": null, 
    "title": "Goal Setting for Sports and Athletics", 
    "price": "20.00", 
    "instructors": "Kevin  Sivils", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/181846_b24c_2.jpg", 
    "course_url": "https://www.udemy.com/coachsivilscoachingclasses-goal-setting-for-sports-and-athletics/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-13T14:40:34Z"
}