{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Do you sabotage your game by getting angry and frustrated with yourself?</strong>  </p>  <p>  \t<strong style=\"\">Want to develop a winning mindset just like the Pro&#039;s?</strong>  </p>  <p>  \t      Most Golf experts agree that the real game of Golf is a mental one and most club Golfers struggle to keep composed and in control. It only takes one bad shot to blow your motivation and lose control of your attitude or mind set.  </p>  <p>  \t                  Hello, this is David Childerley and over the years I have taught thousands of people around the world how to maximise performance through the mental understanding and the application of the latest mind techniques that really do make the difference between gold and silver in professional sports.  </p>  <p>  \t                  How you see yourself and your game directly effects the results you get. The body always follows the mind so your current game play is only the result of your past thoughts and feelings about yourself and your game.  </p>  <p>  \t<strong style=\"\">The good news is that I am going to show you how to change your thoughts and feelings today, so that you get better results tomorrow.</strong>  </p>  <p>  \t                  This leading-edge performance course featuring ‘EFT Tapping’ will transform you and your game from the inside out with my amazingly simple step-by-step guide.  </p>  <p>  \t                  You now hold in your hands the keys to tap into the winning mindset, just like the pros!  </p>  <p>  \t<strong style=\"\">Enrol now, you&#039;ll be glad you did.</strong>  </p>", 
    "end_date": null, 
    "title": "Golf: How To Master The Mindset & Play Like The Pro's", 
    "price": "20.00", 
    "instructors": "David Childerley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319540_d4e7_7.jpg", 
    "course_url": "https://www.udemy.com/eft-golf-master-the-mental-game/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T15:58:46Z"
}