{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>If you want to compete and stay on top of your golf game, you’ll need much more than golfing skills.<br></p>    <p>As well as your technique, you also need to train your mind. </p>    <p>Think about how much your level of performance can be negatively affected by having self-doubt, anxieties and fears.</p>    <p>I have been working in the field of hypnosis for the past 14 years.  </p>    <p>In this time, I have written 3 books, worked with 1-2-1 clients and have also taught Sports Hypnosis workshops to hypnosis graduates.</p>    <p>While I have studied sports psychology for many years, I know for an absolute fact that absolutely nothing comes close to hypnosis when it comes to helping golfers perform at their very peak level.</p>    <p>The power of hypnosis enables you to reap the benefits of subconscious peak-performance training.  </p>    <p>By removing mental obstacles, you’ll improve your ability to focus and concentrate.  </p>    <p>This will help transform your golfing performances to a whole new level.</p>    <p>With more major victories than any golfer in history , Jack Nicklaus was a constant user of self-hypnosis.  </p>    <p>Nicklaus has stated many times that he believes that golf is 90% mental and only 10% physical.  </p>    <p>“I never hit a shot, even in practice”, he says, “without having a very sharp picture of it in my head”.  </p>    <p>‘The Golden Bear” has claimed that his entire success came down to his ability to achieve great focus and concentration through self-hypnosis.</p>    <p>No matter what your current golf level  is, hypnosis will help you to:</p>    <p>* Increase Confidence in yourself and your ability</p>    <p>* Optimise Arousal Levels</p>    <p>* Build Motivation Towards Goals</p>    <p>* Focus and Eliminate Distractions</p>    <p>* Mentally Rehearse Perfect Performance</p>    <p>* Ease pain and Recover from Injuries More Quickly</p>    <p>* Mobilise Energy</p>    <p>* Relax At Will</p>    <p>* Get in “The Zone” whenever and wherever you want</p>    <p>* Overcome Slumps and Plateaus</p>    <p>* Develop Positive Feelings and Self-Talk</p>    <p>* Overcome Performance Anxiety and Fear of Failure</p>    <p>Do you feel ready to take your golf game to a whole new level?  </p>    <p>Do you want to get the edge over the competition?  </p>    <p>Do you want to turn your bitter defeats into sweet victories?</p>    <p>If the answer is yes, discover the power of Golf Hypnosis and start this course today!</p><p><br></p><p><strong>                                                        Testimonial </strong></p><p>\"Thank you for the workshop it was fantastic, I had a great time taking the workshop and meeting the other students.</p><p>You teach very well and have included excellent material in your workshop. The amount of interaction and practise in the class very good.</p><p>Thank you again for sharing your knowledge and insights.\"</p>", 
    "end_date": null, 
    "title": "Golf Hypnosis", 
    "price": "45.00", 
    "instructors": "Paul Hurley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680792_71f9.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-golf-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T19:23:56Z"
}