{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><span>Join over 1,000 fellow students and gain valuable skills that you can bring to your sports club.</span></p><p>  \t<span>Are you an athlete, coach or club official?</span>  </p>  <p>  \t    Are you mom or dad with a child in sport?  </p>  <p>  \t    Are you a Massage Therapist or other health professional looking to introduce new services to your clients?  </p>  <p>  \t    Sports taping is a <strong>valuable real world skill that anybody can learn</strong>. Whether you just want to help out at your local sports club or are looking at a career in sports, this comprehensive, easy to follow course will guide you through everything you need to know to tape an ankle, thumb and finger.  </p><p><em><strong>\"Great for review and touch up. </strong>Found course informative and great for a revision on my sports trainers accreditation. Thank you\" - Michael Warren</em></p>  <p>  \t<strong>Gain a solid understanding of the role Sports Taping plays. Discover when and how Sports Taping is best applied in this tutorial for beginners.</strong>  </p>  <ul>  \t<li>Learn about the different types of tape and which tape is best for each taping job. </li>  \t<li>Practice basic taping skills.</li>  \t<li>Recognize the signs of tape allergies.</li>  \t<li>Follow step by step demonstrations on the most common taping techniques.</li>  </ul>  <p><em>As well as the <strong>Udemy 30 day guarantee</strong>, you have my personal promise that you will be  delighted by what you'll learn in the next 2.5 hours</em></p><p><em><strong>\"Excellent, thorough and informative! </strong>I found this course very useful with clear and thorough instruction. The section about the ankle was particularly helpful and since implementing the techniques I have had much less rolling of my feet. I like how Tim explains each step in detail and also gives reasons why tape shouldn't be used in certain situations. Tim's expertise and skills are clearly demonstrated. I would highly recommend this course and further courses by Tim Cooper.\" - Jodie Tunks</em></p>  <p>  \t<strong>Learn a Skill That Is In High Demand And Can Also Earn You An Income!</strong>  </p>  <p>  \t      Knowing how to tape an ankle, thumb and finger is a useful skill for anybody involved with sport. If you're a coach, team manager, club official or volunteer having these skills is extremely useful as you never know when a player may need to be taped and you can't always guarantee that a qualified person will be available at training and competition.  </p>  <p>  \t      Mums and dads with children in sport can benefit greatly by learning how to tape. You will no doubt be called upon to tape an ankle, thumb or finger at some point during your child's sporting career.  </p>  <p>  \t      Sports taping is a skill that is in demand and paid positions are available at all levels from local league to elite national teams.      \t<strong></strong>  </p>  <p>  \t<strong>Content and Overview</strong>  </p>  <p>  \t      This course has been designed with the beginner in mind. As you work through the 41 lectures and 2.5 hours of content you will develop not only the practical knowledge on how to tape and ankle, thumb and finger, but also a solid understanding on the fundamentals of sports taping.  </p>  <p>  \t      The course starts with an introduction to the role sports taping plays, presents the different types of tape, discusses taping on a budget and the importance of using a good quality tape.  </p>  <p>  \t      Basic skills are then introduced, these are the backbone to a successful taping job. How to tension, tear, remove and store tape are discussed in detail.    Detailed information on tape selection is presented along with step by step, easy to follow instructions on how the tape is applied.  </p>  <p>  \t      On completing this course you will be well versed in the basics of taping and have the resources and knowledge on how to tape an ankle, thumb, and finger. These skills can take you a long way in the sports industry.  </p>  <p>  \t<strong>I started as a dad helping out at my son's junior league club which ultimately led to a 10 year career in elite sport.  </strong>  </p>  <p>  \t      Becoming proficient in taping takes time and practice. All the demonstration videos are available for download so you can always have them with you to refer back to.  </p>", 
    "end_date": null, 
    "title": "How To Tape An Ankle, Thumb And Finger: A Beginners Guide", 
    "price": "45.00", 
    "instructors": "Tim Cooper", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/291014_d1aa_6.jpg", 
    "course_url": "https://www.udemy.com/sports-taping-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-31T05:43:45Z"
}