{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">UPDATE - December 2014</strong>  </p>  <p style=\"\">  \t  Special offer as you get ready for both college games and Super Bowl is just around the corner!  </p>  <p style=\"\">  \t  Get a 2-for-1 and learn both football and networking. (If you want to learn the networking later, just skip over that and come back later.)  </p>  <p style=\"\">  \t<strong style=\"\">UPDATE - August 2014</strong>  </p>  <p style=\"\">  \t          Join over 900 registered to learn about American football and networking. You get a 2-for-1 class.  </p>  <p style=\"\">  \t          The season is just starting and there&#039;s lots of talk (good and bad) around the watercooler about football. <strong style=\"\">Don&#039;t be left out!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">UPDATED INFO - August 2013</strong>  </p>  <p style=\"\">  \t            This is a &quot;two-for-one&quot; online class. It&#039;s a combo teaching networking and the fundamentals of football. The purpose was to help people feel they could attend a game or party and participate in the conversation then and later around the watercooler.  </p>  <p style=\"\">  \t            It is unlikely you&#039;ll be ready to be a football commentator after watching it.  </p>  <p style=\"\">  \t            As noted below the class is made from a live event.  </p>  <p style=\"\">  \t<strong style=\"\">DISCLOSURE</strong> - This event was filmed in front of a live audience at the <strong style=\"\">British Consulate</strong>.  </p>  <p style=\"\">  \t      CBS Sunday Morning with Bill Geist filmed this event. There are times when there are multiple cameras angles but it&#039;s not too distracting.  </p>  <p style=\"\">  \t            There were ~ 100 in attendance from 7 countries.  </p>  <p style=\"\">  \t<strong style=\"\">Welcome to Watercooler Football </strong>- where football and networking meet to have fun!  </p>  <p style=\"\">  \t            &lt;/p&gt;  </p>  <ul style=\"\">  \t<li style=\"\">You’re at a party with a football game on, people cheer and you have no idea what happened – do you feel left out?</li>  \t<li style=\"\">At a meeting someone says, “let’s do an end run” – do you feel lost?</li>  \t<li style=\"\">When you hear “football” do you think people mean soccer?</li>  </ul>  <p style=\"\">  \t            If you don&#039;t know how to watch a football, you may be left out. This can have a negative impact on your career and perhaps social life.  </p>  <p style=\"\">  \t            Join former Boston College Athletic Director, <strong style=\"\">Gene DeFillippo</strong>, and published author and networking expert, <strong style=\"\">Diane Darling</strong>, as they talk about Understanding American Football and how to watch it.  </p>  <p style=\"\">  \t            You&#039;ll also learn some best practices for networking. How to pick your events (aka &quot;whether report&quot;), how to get into a conversation, and ... how to get out of one. What are some best ways to follow up?  </p>  <p style=\"\">  \t            Learn how to be a part of the game with tips and from Gene and Diane. (And wait until you hear how they met!)  </p>  <p style=\"\">  \t            Through 7 video lessons, we share with you all the fundamentals you need to know about American football...Simply watch, take notes and have fun as this course has all American Football Explained!  </p>  <p style=\"\">  \t            You can fast forward and repeat as you need.  </p>  <p style=\"\">  \t<strong style=\"\">BONUS</strong> - You&#039;ll also get excellent tips on networking. You&#039;ll learn:  </p>  <p style=\"\">  \t            &lt;/p&gt;  </p>  <ul style=\"\">  \t<li style=\"\">How to pick events</li>  \t<li style=\"\">How to get into (and out of) a conversation</li>  \t<li style=\"\">Best ways to follow up</li>  \t<li style=\"\">What to do when you fumble in networking (eg don&#039;t follow up)</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Category: Sports</strong>  </p>  <p style=\"\">  \t            &lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "How to watch an American football game", 
    "price": "25.00", 
    "instructors": "Diane Darling, Michael Sanders, Gene DeFilippo", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35634_4527_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-watch-an-american-football-game/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-10T20:13:46Z"
}