{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\tClimbing your Best.. This may mean your hardest, but it is really about maximizing your enjoyment and the depth of your experience.\r\n</p>\r\n<p>\r\n\tThis course is filled with insights and advice on how to feel and perform your best-- finding more consistency and success while continuing to develop your abilities.\r\n</p>\r\n<p>\r\n\tTyler had the privilege of climbing a lot from a very early age, and was exposed to many of the top British climbers while they were developing new ways and perspectives on training. A lot of this course is passing on their great knowledge, as well as a lot of things he has been fortunate enough to pick up while climbing with brilliant people all over the world.\r\n</p>\r\n<p>\r\n\tThis is not just another video with beautiful visuals of hard climbs, nor is it just another video showing strong climbers performing hard exercises. This is an attempt at sharing what Tyler has learned over eighteen years of climbing that may help you discover how to climb your best.\r\n</p>\r\n<p>\r\n\tNote from the course producer Scott Moraes: While climbing with Tyler I noticed there was something very different about the way he climbed— it wasn&#039;t just pure strength, better coordination, or sheer will power, It seemed like there was a whole other world behind his abilities and I very much wanted to learn from him.\r\n</p>\r\n<p>\r\n\t<span>As climbing and teaching are my chief passions in life, I began interviewing Tyler over the course of a few months and began to brainstorm a documentary that we both felt could be valuable for other climbers to improve their skills and success.</span>\r\n</p>\r\n<p>\r\n\tThis project has brought me tremendous satisfaction and was an honor to work with and learn from Tyler. I can directly attest to seeing dramatic results by integrating his insights into my climbing approach.  And w<span>hile it may not work for everyone. I very much hope Tyler&#039;s insights, tips, and strategies help you experience more pleasure and fulfillment from your climbing.  As a passionate and active climber, this has been invaluable for me.</span>\r\n</p>\r\n<p>\r\n\t<strong>Potential Benefits</strong>\r\n</p>\r\n<ul>\r\n\t<li>Enjoy more consistent &quot;peak&quot; experiences while climbing</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    Consistently feel like you are climbing very well\r\n\t</p>\r\n\t</li>\r\n\t<li>Understand the mental approaches of many elite climbers</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    Increase your base climbing abilities as well as have a greater understanding of how to achieve your bigger goals\r\n\t</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    Develop a systematic and logical approach to breaking down problems\r\n\t</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    Hone your mental abilities and build true confidence\r\n\t</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    Have a new approach for climbing trips and new areas\r\n\t</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    Take on a new approach on training footwork and leg tension, hand positioning, core control, power, and dynamics\r\n\t</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>\r\n\t\t    Avoid injury\r\n\t</p>\r\n\t</li>\r\n</ul>", 
    "end_date": null, 
    "title": "How to Climb Your Best", 
    "price": "20.00", 
    "instructors": "Tyler Landman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224326_9e6d_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-climb-your-best-tyler-landman/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T19:00:34Z"
}