{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Ever wanted to <strong>LEARN HOW TO JUGGLE</strong>? Look no further! Pro juggler <em>Ryan Christensen</em> will show you how to juggle in a few minutes and you may even find yourself having fun!<strong> </strong></p><p><strong>This course is great for:</strong></p><ul><li><strong>Newbies</strong></li><li><strong>Beginners</strong></li><li><strong>Intermediate</strong></li><li><strong>Advance Jugglers </strong></li></ul><p>Each trick has it's own video, complete with HD slow motion footage so that you never miss an important part of the training session. 40 Training videos in total with multi-angle footage for a comprehensive learning experience!</p><p><br></p><p><strong>What are the requirements for a fast learning curve &amp; students looking to have fun?</strong></p><ul><li>If you have scarfs, bean bags, tennis or racquet balls, rolled up socks, oranges or anything round accessible - you're ready to get started!</li></ul><p><strong>Are you the perfect student for this course? <em>Of course you are!</em></strong></p><ul><li>No matter how talented you are with your eye-hand coordination, fine motor skills or if you're just straight up clumsy - you CAN learn to juggle with this course!!!</li><li>Anyone that wants to be able to juggle to have fun, entertain friends, or be the center of attention at any moment!</li><li>If you already know how to juggle but you want to get better at 3 balls patterns, or if you want to learn how to juggle 4 or 5 balls, or even step it up to club juggling or juggling with a partner!</li></ul><p><strong>What should you expect to get from this course?</strong></p><ul><li>You should expect to at minimum learn how to juggle the 3 ball cascade pattern (basic juggling) - at maximum, you can expect to learn enough tricks to perform a show and get paid money to do so. </li><li>Even if you don't choose to make money juggling for people, you can expect to increase your confidence in yourself and your juggling abilities.</li><li>You should expect to be able to learn a majority of the 3 ball tricks within a couple days.</li></ul><p><em>If you're into unicycles,  yo-yo tricks, hoola-hoops, magic tricks or even kendama - this course is for you! Thank you for purchasing the most complete juggling course available on Udemy and supporting an instructor who's committed to making his student's lives fun and fulfilling!</em></p><p><em><br></em></p><p><em>Sincerely,</em></p><p><em>Ryan Christensen</em></p><p><em>Pro Juggler</em></p>", 
    "end_date": null, 
    "title": "How To Juggle With Ease - From Beginner To Pro In Minutes!", 
    "price": "20.00", 
    "instructors": "Ryan Christensen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606962_7606_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-juggle/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T14:33:15Z"
}