{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">Over 1500 students enrolled already.</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Fully updated for January 2015.</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">By taking this course you will give your child the best chance possible of succeeding in sport and physical activity for life.</em></strong>  </p>  <p>  \t                  The need for age appropriate physical preparation for children is becoming increasingly paramount within schools and sports clubs worldwide.  </p>  <p>  \t                  The benefits of correct preparation are not only physical but psychological as well.  </p>  <p>  \t                  Overtraining at a young age can effect a persons continued participation in physical activity later in life.  </p>  <p>  \t                  Pressure from schools and sports clubs to increase participation can sometimes leave parents feeling overwhelmed as to what is best for their child. With many parents often forgetting that children are in the most important time of their physical development.  </p>  <p>  \t<em style=\"\"><strong style=\"\">In this course you will learn why the physical preparation of children is so important</strong>, both from a public health perspective (we have a<strong style=\"\"> global obesity epidemic </strong>on our hands), and a sports performance perspective (why <strong style=\"\">drop out and injury rates </strong>are a major concern).</em>  </p>  <p>  \t<em style=\"\">You will also learn the physiology of growth and maturation, how different individuals develop at different rates, and understand <strong style=\"\">how important this is for success </strong>not only in sport, but prolonged involvement in physical activity later in life<strong style=\"\">.</strong></em>  </p>  <p>  \t<em style=\"\">You will <strong style=\"\">learn about common injuries</strong> suffered by children, and why <strong style=\"\">old training concepts</strong> may be to blame.</em>  </p>  <p>  \t<em style=\"\">You will be introduced to the very latest Long Term Development Models, and will understand what aspects will <strong style=\"\">work best for your child</strong>.</em>  </p>  <p>  \t<em style=\"\">In this course we discuss the myths around strength training and children, and how it&#039;s a &#039;no brainer&#039; when it comes to <strong style=\"\">success in sport</strong> and physical activity later in life</em>  </p>  <p>  \t<em style=\"\">You will also receive <strong style=\"\">training recommendations for your child</strong> as they grow and develop.</em>  </p>  <p>  \t                This course is not a &#039;quick fix&#039; template to develop the next sporting superstar, it is a detailed account of the <strong style=\"\">latest research</strong> and advice for the <strong style=\"\">best way to prepare your child to succeed</strong> in sport and physical activity.  </p>  <p>  \t                As well as the Udemy 30 day guarantee, you have our promise that you will be wowed and delighted with what you learn in the next 2 hours - you need to get this course now ... right this minute.  </p>  <p>  \t<strong style=\"\">Every minute you delay you are missing out ...</strong>  </p>  <p>  \t<strong style=\"\">Enrol now!</strong>  </p>", 
    "end_date": null, 
    "title": "How to prepare your child to succeed in sport for life!", 
    "price": "20.00", 
    "instructors": "DYMONDstrength LTD", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191584_ab17_6.jpg", 
    "course_url": "https://www.udemy.com/youth-conditioning/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-31T09:25:23Z"
}