{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Insider Sports Betting - Baseball Edition -</strong> is our new sports betting course. This course was made for <em class=\"redactor-inline-converted\">anyone</em> and <em class=\"redactor-inline-converted\">everyone </em>interested in wagering on baseball. From understanding why betting baseball is the best and easiest major North American sport to wager on, to the introduction and explanation of advanced pitching and hitting Sabermetric statistics - this course has it all!!</p>\n\n<p>Whether you are looking to understand wagering on baseball or if you have bet on baseball for years, this course is for you! You <strong class=\"redactor-inline-converted\">WILL </strong>learn something from this course! </p>\n\n<p>This course has been created with <em class=\"redactor-inline-converted\">all levels</em> of baseball enthusiasts in mind with sections dedicated to basic and <strong class=\"redactor-inline-converted\">advanced statistical analysis</strong> as well as sections covering <em>expert</em> sports betting concepts. If you want to develop a sound baseball betting strategy, enroll in this course!!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>With 2.5 hours of video content broken down into 5 manageable sections,<strong class=\"redactor-inline-converted\"> Insider Sports Betting </strong>takes you from learning what a moneyline is, all the way to utilizing a preset bankroll range for all of your wagers. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As an added bonus, this course features tons of screen capture dispersed throughout the lectures in order to <strong class=\"redactor-inline-converted\">SHOW </strong>you how we do what we do! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>To top it all off, we have included a PDF <strong class=\"redactor-inline-converted\">Twitter guide</strong> that lists all the accounts you should follow throughout the MLB in order to stay up to the second with your baseball betting knowledge.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Get out your notebook, put on your lucky shirt and sign up today to get complete access to our industry leading content and start <strong>consistently</strong> picking winners!!</p>\n\n\n\n<p>**In order to place online sports wagers, you require a membership for an online sports book. Prior to signing up, check the legality of sports wagering in your area </p>", 
    "end_date": null, 
    "title": "Insider Sports Betting - Baseball Edition", 
    "price": "20.00", 
    "instructors": "Sergio Pasqua", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715850_d7a3_2.jpg", 
    "course_url": "https://www.udemy.com/baseball/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T18:13:23Z"
}