{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><br>Learn the basics of tennis, the proper way to hit each shot, and eventually have all the skills to teach your first tennis lesson! It's true what they say - you never really learn something until you teach it!</p><p>This course has the following goals : <br></p>\n\n<ul><li>Become familiar with the rules and basics of tennis.</li><li>Hit forehands and backhands at a consistent pace.</li><li>Serve and volley the proper way. </li><li>Learn all other tennis shots including approach shots, drop shots, half volleys, lobs, and others. </li><li><span></span> Learn how to tell a good shot from a bad shot. </li><li><span></span>Improve footwork, agility, and balance through various drills.</li><li><span></span>Learn how to keep score and play doubles.</li><li><span></span>Learn how to teach your own tennis lesson for beginners. </li><li>Share some gear tips</li></ul><p>The course will start off by explaining you the tennis basics. This includes the parts and lines of a tennis court, the rules of tennis, the difference of tennis compared to other sports, what exactly is tennis etiquette, and what makes up a \"correct\" tennis shot. It will also help you in choosing the right tennis racquet and give you other recommendations for things like tennis shoes, balls, strings, and grips. Next, you will learn the elements of a good warmup and prepare you for before you start hitting.</p><p><br>Tennis isn't tennis unless you are actually hitting, right? This course will teach you the main shots in tennis- the forehand, backhand, volley, overhead and serve. Don't worry, you will also learn other shots like the approach shot, lob, drop shot, half volley and other specific shots. Also you will learn common mistakes that may occur and how to correct them. There are also parts where you can choose your own way to play- do you want to hit your forehands and backhands with a closed stance or open stance? Do you want to have a flat serve or a topspin serve? The course will give you room to develop your own style while maintaining a proper stroke. <br><br>Last, but not least, you will learn you how to teach your first tennis lesson. You will find drills and games that you can use on your students when teaching, and can also use on yourself with the help of a ball machine. These drills and games will not only focus on specific strokes but there will also be some that combine them all.<br><br>This course has about 90 minutes of video content, but like any good course it requires you to do some practice and work on your own. With enthusiasm and a little bit of hard work, you can expect this course to help you more than a set of one-on-one private tennis lessons with a pro tennis coach. <br><br></p>", 
    "end_date": null, 
    "title": "Learn How to Play and Teach Tennis!", 
    "price": "45.00", 
    "instructors": "Christian Badulescu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/838224_012e_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-play-and-teach-tennis/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-03T07:10:59Z"
}