{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Dear Friend,</strong></p><p style=\"\">Imagine walking into a dark, smoke-filled bar and feeling the eyes of the drunken &quot;knuckle draggers&quot; <em style=\"\">piercing right through you</em>...</p><p style=\"\">If you&#039;d like to know the most effective dirty boxing techniques that are proven to work on the street, then this will be the most important course you ever get on Udemy and <em style=\"\">here&#039;s why...</em></p><p style=\"\">...what you&#039;ll discover in this course are the guaranteed and street-proven techniques that will <em style=\"\">instantly disable </em>much larger opponents using real boxing and &quot;dirty&quot; boxing techniques.</p><strong style=\"\"><em style=\"\">Here&#039;s what you get:</em></strong><ul style=\"\"><li style=\"\">5 &quot;quick-kill&quot; boxing combinations that will leave your opponent on the floor begging they never picked a fight with you</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">&quot;Street&quot; boxing stance to give you the right balance and stability to attack and defend during the fight (not your average fight stance)</strong></li></ul><ul style=\"\"><li style=\"\">&quot;Off Angle&quot; Footwork patterns that will have your opponent wondering why they keep getting hit and <em style=\"\">never see it coming</em></li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">9 different kinds of punches you need to add to your fighting arsenal (2 of them you&#039;ve probably never used)</strong></li></ul><ul style=\"\"><li style=\"\">The &quot;Cover and Hit&quot; reaction that tricks your opponent into opening their defense up for you to unload a barrage of punches and attacks <em style=\"\">while defending against their wild &quot;John Wayne&quot; style swings</em></li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">The sneaky &quot;ABD&quot; fight strategy that draws your opponent into your planned &quot;BLITZKRIEG&quot; style attack</strong></li></ul><ul style=\"\"><li style=\"\">1 &quot;Blind Spot&quot; every one has during a fight and how you can use it to slip through your opponents defenses <em style=\"\">every time</em> and deliver pain to their face</li></ul><ul style=\"\"><li style=\"\"><strong style=\"\">And much, much more...</strong></li></ul>This is the best course on Dirty Boxing on Udemy and is the<em style=\"\"> fastest way</em> to learn to fight guaranteed. <strong style=\"\">Order the course now and jump right into the juicy &quot;quick kills&quot; section.  </strong>", 
    "end_date": null, 
    "title": "Learn \"Dirty\" Boxing For Street Self Defense", 
    "price": "20.00", 
    "instructors": "Carlos Redlich", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528562_f968_3.jpg", 
    "course_url": "https://www.udemy.com/learn-dirty-boxing-for-street-self-defense/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T13:38:08Z"
}