{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Learn to Sail: The Basics</strong>  </p>  <p>  \t  In 9 Lessons - from the <em style=\"\">Introduction</em> to the <em style=\"\">Next Steps</em>, you will:  </p>  <ul style=\"\">  \t<li>Learn the language of sailing - the terms necessary to communicate effectively on a boat</li>  \t<li>Know the equipment required on a 22 to 26 foot sailboat and how to use it</li>  \t<li>Be able to describe what makes a sailboat go (the physics of sailing) and how to get the boat to stop</li>  \t<li>Learn how to stay safe from the elements – the sun and cold water</li>  \t<li>Be able to obtain and understand weather for day sailing to make sure it is safe to go out on the water</li>  \t<li>Understand the rules of the road that keep boats from colliding and how to avoid dangerous situations</li>  </ul>  <p>  \t  All of this is covered in 51 individual video lessons spanning more than 2.5 hours taught by Rob MacLeod, a certified sailing instructor who has taught 1000s of people to sail across North America and throughout the Caribbean.  </p>  <p>  \t  Each of the 9 lessons has a PDF download to augment your learning. These downloads contain detail of each lesson. Each lesson concludes with a quiz to allow you to confirm your knowledge.  </p>  <p>  \t  Lesson 9 – <em style=\"\">Next Steps</em>, directs you to where you can gain the <em style=\"\">on water experience</em> that will allow you to put <em style=\"\">Learn to Sail: The Basics </em>into practice.  </p>  <p>  \t  This course is based on the learn-to-sail standards of numerous national sailing associations (listed in the handout for Lesson 9) and will prepare you to take the practical aspects of sailing at a sailing school, yacht club or with a competent friend.  </p>  <p>  \t  If you have every dreamed of leaving the dock on a sailboat - <em style=\"\">Learn to Sail: The Basics </em>is your best start.  </p>", 
    "end_date": null, 
    "title": "Learn to Sail: The Basics", 
    "price": "20.00", 
    "instructors": "Rob MacLeod", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343036_f051_5.jpg", 
    "course_url": "https://www.udemy.com/learn-to-sail-the-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T07:49:28Z"
}