{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course you'll learn how to swim 200m backstroke whilst improving your swimming technique, toning your muscles and most importantly - learning how to protect your lower back and neck whilst swimming.</p><p><br>Have you heard that Backstroke is the healthiest swimming technique and therefore tried to imitate Olympic swimmers?<br>The WEST swimming technique's backstroke is actually a far better swimming technique for swimmers over the age of 21!</p><p><br>70% of the people around the world over the age of 21 suffer from lower back pain.<br>When we swim the “normal” backstroke we create an arch on our body which often causes to add stress to your lower back, shoulders and neck. This is why we strongly believe that swimmers must learn and adapt to the WEST technique in order to prevent such pains or injuries.</p><p><br>The course is based on 4 different training workouts for you to perform. Each workout session has 1-10 videos which will help you understand the training drills and stretches you need to do.<br>For each session you'll also receive detailed pictures thoroughly explaining each drill and helping you to remember how to do them correctly when in the pool!<br><br></p><p>We'll guide you step by step until your master your 200 m backstroke with the West technique.<br>This is for sure \" The WEST way to swim\"</p><p>We've done the thinking for you, now we'll guide you step by step to help you swim 200m backstroke with the healthiest swimming technique.</p>\n\n<p>It is for sure\" The WEST way to swim\"</p>", 
    "end_date": null, 
    "title": "Learn to swim backstroke with the \"WEST\" swimming technique", 
    "price": "25.00", 
    "instructors": "Ori Sela, Naomi Dreifuss", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530892_0c64_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-swim-backstroke-in-west-swimming-technique/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T04:02:31Z"
}