{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The WEST freestyle swimming course will teach you how to swim the healthiest swimming technique in the world!</p>\n\n<p>  \tThe WEST swimming technique relaxes your body, treats neck/back pains and helps your recover after any injuries you may have.<br> Today it is that one must adjust his athletics technique to his body shape, physical abilities and lifestyle, rather than force his body to train in one general way.<br>The WEST swimming technique is based on 3 factors suiting itself to each swimmers body shape, physical ability and lifestyle. The technique is specifically modified in order to <strong>ensure</strong> that each  individual swimmer benefits.   </p>\n\n<p>Today's modern lifestyle has taken its toll and nearly 70% of the population suffer from neck and back problems (mainly caused by stress and overloading.)</p><p>During this course you'll enjoy and gain greatly from the many swim WEST benefits and hopefully feel the positive impact it has on you and your quality of life. <br></p>\n\n<p><strong>In this course:</strong></p>\n\n<p>  \t1. Learn and improve your freestyle swimming technique.</p>\n\n<p>  \t2. Learn how to swim taking a breath after every 3 strokes, also learn to swim 200 m freestyle with a loose and easy swimming technique.</p>\n\n<p>  \t3. Get 5 different swimming workouts - every swimming workout has 2-15 videos that will help you understand exactly how to do each training drill.</p>\n\n<p>  \t4. Learn how to stretch your muscles during and after your swimming in order to protect your joints and elongate your muscles - this is really important and helps prevent injuries!</p>\n\n<p>  \t5. If you practice 2 days a week, the course will take you 7-8 weeks, if you practice 3 days a week, it will take you only 5 weeks.</p>\n\n<p>  \tThe amazing thing about the WEST swimming program is that you don't need to think!!<br> We've done all the thinking for you- you just need to swim!</p>\n\n<p>All you need to complete the course is a swimsuit, fins, goggles  and a big smile!<br></p>\n\n<p>Come on, jump straight in!</p>", 
    "end_date": null, 
    "title": "Learn to swim freestyle with the \"WEST\" technique!", 
    "price": "50.00", 
    "instructors": "Ori Sela, Liat Besserglik", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413190_b3e2_4.jpg", 
    "course_url": "https://www.udemy.com/learn-to-swim-freestyle-west/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T14:51:04Z"
}