{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course prepares someone for a lifetime of enjoyment on the slopes, either skiing or snowboarding. It covers what clothing and equipment is necessary and what is unnecessary, how to save money, how to use ski lifts (including chair lifts, gondolas, trams, T-bars, J-bars, Poma/button/platter lifts and rope tows), how to read a trail map, planning a ski or snowboard vacation, the best times and places to go, what to remember for your first trip to the slopes, how to buy boots, skis and snowboards, and many other topics. Black diamond skiers have reviewed this course and been surprised at how much they learned about some topics, like choosing boots and skis or a snowboard. The concepts of determining the shape of a mountain by looking at the trail map is also very advanced; many experienced snowboarders and skiers haven't grasped it. The course includes may tips and tricks that most people take years to acquire; you can have a big head start as you begin the sport. Concepts are clearly explained with photo illustrations or videos of actual equipment and there is a quiz at the end - you may be amazed at how much you've learned!</p><p>This course does NOT teach how to ski and snowboard. As a beginner your ability to diagnose yourself and do the correct exercises correctly is very limited; teaching a student to ski or snowboard is best done live and in person by a professional instructor, not the students themselves. This course covers all the hundreds of other things a snowboarder or skier needs to know, which usually take years to learn via being too cold or too hot, wasting money, not improving, being injured, getting lost, winding up on slopes you can't possibly do, and feeling foolish. This course is intended to save you from all of that. The goal is for you to have as much fun as possible from your first time on the slopes and give you the confidence to take this up as a lifelong activity.</p>", 
    "end_date": null, 
    "title": "Learning to Ski or Snowboard", 
    "price": "20.00", 
    "instructors": "John Weiland", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634712_da8b_2.jpg", 
    "course_url": "https://www.udemy.com/learning-to-ski-or-snowboard/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T10:59:29Z"
}