{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">You probably heard that breaststroke is not healthy or even worse that it&#039;s going to heart and cause pain to your lower back?? So You are right and wrong, you will cause pain if you swim like Olympian swimmers, no you won&#039;t cause pain if you swim in the WEST swimming technique which was developed in order to loosen your body and protect neck and lower back.</p><p style=\"\">So what is the difference? And why is WEST swimming technique breaststroke the best swimming technique for people above the age of 21?</p><p style=\"\">70% of the people around the world at the age of 21+ suffer from lower back pain, when we swim the “normal&quot; breaststroke we create an arch on our body which can lead to stress in our knees, lower back, shoulders and neck, you don&#039;t need to be an expert to understand that throwing your hands above the water while starting the legs is too painful for your lower back.</p><p style=\"\">You probably ask why even bother on learning breaststroke? Maybe learn to swim freestyle? Breaststroke works on the greatest number of muscle groups in the body compare to all the other strokes, the breaststroke is important in order to strengthen more muscles in our body in order to protect our joints.</p><p style=\"\">In this breaststroke WEST swimming technique course you will learn how to elongate your muscles, you will understand why you should stretch your hands under the head and glide 3 seconds, in this swimming course you don&#039;t need to think we did the thinking for you, you will follow the workout step by step, see amazing videos and drills, learn and improve your breaststroke and adopt it to our crazy way of life.</p>", 
    "end_date": null, 
    "title": "Learn to swim breaststroke in WEST swimming technique", 
    "price": "25.00", 
    "instructors": "Ori Sela", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524158_ad65_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-swim-breaststroke-in-west-swimming-technique/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-09T14:01:06Z"
}