{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong> </strong><strong>Mission Possible: Becoming the Champion, Gives You the Tools Needed to Win the Gold </strong></p><p>The only way to consistently reach the podium and earn gold medal results, is to invest in your future with proper planning. Most athletes won't take the time to do online courses, seasonal plans, or use an athletes logbook...and that's why most athletes won't win the gold. They will try, but they won't consistently win. This course provides you with real tools to improve your results right away. The methods have been used over many years to help both amateur and professional athletes to get championship results. </p><p>To become a champion you need to invest in yourself. No one can do this type of work for you. Just remember...the more you do, that other athletes won't, the faster you will pass them by! </p><p><strong>Testimonial:</strong></p><p><em>\"Prior to this, I was a true skeptic and hard-core cynic of these types of 'personal improvement' courses. Since engaging in the MindWorks system I have identified, proceeded toward, and blown away life goals that I thought were only dreams. The performance management framework focuses your thinking around personal goals and then gives you the necessary tools to move towards them at a lightning pace. The wonderful dilemma this experience has delivered is the need to now set new and loftier goals.\"</em> </p><p><em>Sandy Pembroke - World Kickboxing Champion</em></p><p><strong>Course Objective:</strong></p><p>The purpose of this course is to give you the tools necessary to become the champion. The information provided gives you a simple method for developing a mental game that will become unbeatable. The methods are simple to learn and easy to put into action.</p><p>By the time you complete this course you will know exactly what you want as an athlete, why you want it, and what your mission is. From here we develop your master goal list, seasonal plan, as well as other important aspects needed to become a champion.</p><p><strong>This Course Includes:</strong></p><ol><li>29 lectures that give you the ability to develop your mission and seasonal plan</li><li>This course is broken down into 3 easy to follow sections</li><li>A printable notes sheet for each video so you can create your own course manual</li><li>A Seasonal Plan that you can use throughout the years and years to come</li><li>An Athletes Logbook designed to keep you on track with your mission</li><li>The total course time is 51 minutes</li></ol>", 
    "end_date": null, 
    "title": "Mission Possible: Becoming the Champion", 
    "price": "20.00", 
    "instructors": "John McMahon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505614_2354_4.jpg", 
    "course_url": "https://www.udemy.com/mission-possible-becoming-the-champion/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T23:15:13Z"
}