{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Introdução  \t</strong>As competições de rally de regularidade vêm crescendo a cada ano no Brasil, seja utilizando carros com tração nas quatro rodas (4x4) ou veículos com tração em duas rodas (4x2).  </p>  <p>  \t  Esse curso para navegadores principiantes de rally, está baseado nos regulamentos da Confederação Brasileira de Automobilismo (CBA).  </p>  <p>  \t<strong style=\"\">Publico Alvo  \t</strong>Pessoas que desejam ser navegadores de rally de regularidade, ou que desejam conhecer como funciona uma competição deste tipo.  </p>  <p>  \t<strong style=\"\">Material Didático  \t</strong>Vídeos, apresentações, fotos e textos de apoio à instrução, que fornecerão aos alunos exemplos práticos das técnicas de navegação em rally de regularidade.  </p>  <p>  \t<strong style=\"\">Tempo de Duração  \t</strong>Cada aluno tem seu ritmo de aprendizagem, porém em média serão dispendidas aproximadamente 3 horas para execução deste curso.  </p>  <p>  \t<strong style=\"\">Estrutura do Curso  \t</strong>O curso está estruturado nas seguintes seções:  </p>  <ul style=\"\">  \t<li>Introdução ao Rally de Regularidade</li>  \t<li>Planilha de Navegação</li>  \t<li>Equipamentos de Bordo</li>  \t<li>Pontuação e Apuração</li>  \t<li>Dicas Finais</li>  </ul>  <p>  \t<strong style=\"\">Por que participar deste curso?  \t</strong>Participar de um rally de regularidade é muito divertido e saudável, além de aproximar a amizade entre piloto e navegador. Entretanto, participar sem um conhecimento mínimo sobre rally pode ser desestimulante aos competidores. Por esse motivo colocamos este curso à disposição, para que esses novos competidores tenham uma base inicial para se empolgar com esse maravilhoso esporte automotor.  </p>  <p>  \t  Certamento você não se arrependerá em participar do curso, e verá os resultados logo na próxima competição.  </p>", 
    "end_date": null, 
    "title": "Navegação de Rally de Regularidade para Iniciantes", 
    "price": "45.00", 
    "instructors": "Gustavo Monasterio", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297388_81d2_4.jpg", 
    "course_url": "https://www.udemy.com/navegacao-de-rally-de-regularidade-para-iniciantes/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T22:21:29Z"
}