{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\t        This course is designed for new, curious, beginner to intermediate off-road drivers, and will offer tips for advanced, more experienced drivers, or anyone interested in Alaska. In many areas, people with little experience or knowledge get into dangerous, even life threatening situations trying to go off road. This course will offer instruction in the backcountry to show best how to navigate through various kinds of terrain with less damage to vehicles and the environment. The course will take you live on a tour that goes through mud holes and ruts, river crossings, steep mountainsides with loose rock, and sandy glacial flats with everything from sticky mud to quicksand and deep water. We will show some recovery/rescue equipment and methods, and show some common mistakes. We will show vehicles with both &quot;old school&quot; and &quot;new school&quot; modifications that make it possible to get hundreds of miles into the backcountry. You will also see the amazingly beautiful Alaska country accessible to off-roaders that have a little intelligence, practice, and a capable vehicle.\r\n</p>\r\n<p>\r\n\t       This course offers tips and advice based on many years of experience to help you think more carefully about how to improve your off-roading experience. It is by no means intended to give you the only information needed to drive off-road safely. Each situation requires your best judgment, and the responsibility is yours. Please understand that you use any or all of the information in this course at your own risk.\r\n</p>\r\n<p>\r\n\t        As your skills expand, you can return to this course for further study and inspiration.\r\n</p>", 
    "end_date": null, 
    "title": "Off-Road Driving - Tips & Skills", 
    "price": "40.00", 
    "instructors": "G.Kevin Holthaus", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/85750_bb5e_4.jpg", 
    "course_url": "https://www.udemy.com/offroaddriving/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-29T20:22:09Z"
}