{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This online golf clinic from pro coach Lee Crombleholme is a comprehensive nine series training program based on the steps Lee takes his private client through when coaching in person. </p><p>It <strong>IS</strong> comprehensive, but it's <strong>NOT</strong> long-winded! These no-fluff, step-by step guides are easy-to-follow and can be instantly applied to your game.</p><p>The course is delivered via video... </p><p>So whether you're on your lunch break, on your way to the course or just fancy a quick brush-up on your skills there's loads of content for you to dig into.</p><p>Here's what's covered in the training…</p><ul><li><strong>Putting </strong>Holding out drills, distance drills, green reading, feedback drills and more…</li><li><strong>Pitching </strong>Common mistakes, pre-shot routine, practice drill and more…</li><li><strong>Chipping </strong>Common mistakes, fear and anchoring states, bunker play and more…</li><li><strong>Full Shots </strong>Pre-shot routine, practice drills, creating confidence on demand and more…</li><li><strong>Focus </strong>The 1st tee, attributions, switching on and off, body language and more…</li><li><strong>Course Management </strong>Club selection off the tee, recovery shots, play beyond the hole,        2nd shot on a par 5 and more…</li><li><strong>Taking It To The Course </strong>Nerves, finishing a good round off, flow state and the zone and    more…</li></ul>", 
    "end_date": null, 
    "title": "Online Golf Clinic: Improve Your Short Game in 9 Sessions", 
    "price": "20.00", 
    "instructors": "Lee Crombleholme", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505004_d063_3.jpg", 
    "course_url": "https://www.udemy.com/online-golf-clinic-improve-short-game/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T09:06:31Z"
}