{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">What do James Bond, Spider-man, and Altair from Assassin&#039;s Creed have in common?</strong>  </p>  <p style=\"\">  \t   One, they are all objectively awesome.  </p>  <p style=\"\">  \t   And two, <strong style=\"\">they are experts in </strong><em style=\"\"><strong style=\"\">parkour</strong>.</em>  </p>  <p style=\"\">  \tIf you want to drastically improve your health and fitness in a fun way without the ridiculous cost of gyms, parkour is the asnwer.  </p>  <p style=\"\">  \t   If you&#039;re not familiar with parkour, <a href=\"http://www.youtube.com/watch?v=aAhPaiajwDY\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">this</a> should get you up to speed.  </p>  <p style=\"\">  \t <strong style=\"\">With BC-X Parkour from Udemy you will learn to:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Improve your health and fitness using only body weight exercises</li>  \t<li style=\"\">Develop practical, real world strength</li>  \t<li style=\"\">Defy gravity, run vertically, and scale 10 foot walls</li>  \t<li style=\"\">Dive and roll to avoid injuries like a stuntman</li>  \t<li style=\"\">Transform the world into your personal gym and <br style=\"\">  \t   playground</li>  </ul>  <p style=\"\">  \t   Plus you DON&#039;T need ridiculous athleticism or innate talent. You don&#039;t need to be a health and fitness nut.  In fact, BC-X Parkour Training is designed to challenge newbies and fitness gurus alike.  Our flexible &quot;progression model&quot; of teaching allows you to scale the exercises and technique training to the edge of YOUR current abilities so you learn as fast as possible.  </p>  <p style=\"\">  \t   Classes are taught by 8-year parkour veteran and expert trainer Mike &quot;Pyro&quot; Araujo of NYPK and international Team Sanjuu.  He has starred in music videos, performed for thousands, and trained parkour with hundreds of students.  His classes are geared to give you the skills, knowledge, and training you need to practice parkour TODAY.  </p>  <p style=\"\">  \t   Video instruction lasts approximately 40 minutes.  An outdoor training guide is provided as well to ensure optimal practicing once outside as well as maximum health and fitness benefits.  </p>  <p style=\"\">  \t   Though parkour takes a lifetime to master, this course is designed to get you outside and practicing parkour WITHIN THE HOUR.  Without professional training, there is no faster, more comprehensive way to start parkour.  </p>", 
    "end_date": null, 
    "title": "Parkour for Beginners", 
    "price": "20.00", 
    "instructors": "Charlie Houpert", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25392_7885_3.jpg", 
    "course_url": "https://www.udemy.com/parkour-for-total-newbies/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-25T16:03:47Z"
}