{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\"><strong style=\"\">“Fueling the Baseball Athlete: from daily life to triple-headers, learn how to take your game to that next level”</strong> will provide a complete, up-to-date, evidence-based discussion of nutrition principals for athletes involved in the sport of baseball. Information ranging from individual athlete needs, tournament nutrition and sample meal plans are covered in this engaging sixty-minute course. Our target audience includes baseball athletes of any age at any level (youth to NCAA), their parents, coaches, and anyone involved with the sport of baseball.</span>  </p>  <p style=\"\">  \tThe unique needs of baseball athletes goes beyond common nutrition for the general population, and in the course you will learn about proper fueling for optimal performance on and off the field. From the time one wakes up to the time one goes to sleep, there are countless opportunities for athletes to make smart choices and give serious athletes the edge they need to keep their game at the highest level. Proper nutrition starts hours-- even days--before an athletic performance, and in this course you will learn about special situations such as eating on the road, tournaments, and recovery techniques. We have also provided recommendations to allow for those taking the course to walk away with ready-to-implement ideas.  </p>  <p style=\"\">  \tAn emphasis will be placed on the importance of being prepared and eating with a purpose for peak performance. Practical applications are provided in order to quickly apply the information discussed to real-life situations for performance enhancement. Information presented in the lectures of the course will continue to build off of prior lectures, starting with core principles (Everyday nutrition for baseball athletes) and continuing to more specific topics (Practice, game, and tournament nutrition; Eating on the road). Fueling the Baseball Athlete is taught using PowerPoint video with appropriate supplementary course materials (PDF Files, etc.), and the course should take approximately 50-60 minutes to complete. Anyone seeking sound, comprehensive, baseball-specific nutrition information from an expert in sports nutrition will benefit from this course.  </p>", 
    "end_date": null, 
    "title": "Performance Nutrition for Baseball Players", 
    "price": "40.00", 
    "instructors": "Jenna Corbin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/243804_d683_2.jpg", 
    "course_url": "https://www.udemy.com/performancenutritionbaseball/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T01:15:47Z"
}