{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong></strong></p>\n\n<p><em><em><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></em></em><br></p><p><strong></strong>  </p>\n\n<p>  \t<strong>Do you consider yourself too old or out-of-shape to run a marathon? Do you fear that you lack the conditioning, motivation, or emotional strength to finish? If so... Then this is the Udemy Course for You!!!</strong>  </p>\n\n<p>  \t                Running is an extremely popular pastime. It is a very effective way to stay in shape and have a good cardiovascular health range of motion, as well as joint flexibility.  </p>\n\n<p>  \t<strong>Running with the Ancient Greeks Offers:</strong>  </p>\n\n<ul>  \t<li><strong>A 16-week training program that has been proven successful time and time again</strong></li>  \t<li><strong>Methods for physically and mentally preparing to start and finish a marathon</strong></li>  \t<li><strong>Helpful tips regarding equipment, nutrition, and hydration</strong></li>  \t<li><strong>Guidance to help overcome motivational and physical roadblocks</strong></li>  \t<li><strong>And much more!</strong></li>  </ul>\n\n<p>  \t               However, eventually, every runner wants to take the next step from their favorite trail park footpath or treadmill and see how good they really are and for a lot of people, \"Seeing how good you really are\" means running a marathon.  </p>\n\n<p>Nothing is kept secret - I reveal all I know ... and as I test even more\n things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>\n\n<p>\n  \t                                                                     \n                                                           As well as \nthe Udemy 30 day guarantee, you have my personal promise that you will \nbe wowed and delighted by what you'll learn in the next 3 to 4 hours ...\n and <strong>you'll be kicking yourself if you already have a Udemy course</strong> .</p>\n\n<p>  \t               A marathon is a race consisting of a 26.2 mile course or 42 km. This is said to have been the distance from the battle of Marathon back to Athens, Greece. This distance was run by a soldier reporting on the marathon war. He made it back to Greece, delivered his message of victory, and then died from exhaustion. Now marathons are running almost every major city all over the world on an annual or biannual basis.  </p>\n\n<p>  \t               The root of each marathon will vary from city to city and year-to-year with a wide variety of terrain and altitude changes to make the course is challenging as possible.  </p>\n\n<p>  \t                This class is designed to help those that feel they are in decent physical shape and have the necessary background in running. To achieve their goal of running a marathon by the time you complete this course, you will have all the skills and knowledge required to properly train and compete in a marathon.  </p>\n\n<p>  \t<strong>Give yourself a fresh start by enrolling in this life-changing course now .Every moment you delay, you lose out. on Knock one more item off your life's buck-list Simple as that . </strong>  </p>\n\n<p>  \t              Although you may not win outright on your first try, this quest will make sure that you are as competitive as possible during your marathon - giving you the best chance to finish within a 4-hour time limit.  </p>\n\n<p>  \t<strong>As with all my courses:</strong>  </p>\n\n<ul>  \t<li>the initial low price will increase shortly - the course is currently $297, but will next increase to $397</li>  \t<li>you have unlimited lifetime access at no extra costs, ever</li>  \t<li>all future additional lectures, bonuses, etc in this course are always free</li>  \t<li><strong>there's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</strong></li>  \t<li>my help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li>  </ul>\n\n<p>  \t<strong>This will be a truly interactive course with additional bonus routines added over the course of the first year, inspired by the seasons and based on feedback from students.</strong>  </p>\n\n<p>  \t<strong>Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...Scroll up and Enroll Now! </strong>  </p>", 
    "end_date": null, 
    "title": "Run a Marathon ( 26.2 mile) With No (or Little) Training ", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341128_c629.jpg", 
    "course_url": "https://www.udemy.com/how-to-run-a-marathon-in-under-4-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T05:30:03Z"
}