{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Does your son or daughter struggle at the plate...but you don’t know how to help? &nbsp;Are you out of ideas? &nbsp;</p><p style=\"\"><em style=\"\"><strong style=\"\">The 7 Secrets of Hitting a Baseball</strong>,</em><span style=\"\">&nbsp;offers simple insight into the approach and techniques that Major League Baseball Players use to dominate opposing pitchers. The 7 Secrets is a powerful, must have tool for helping your son or daughter hit the ball.</span></p><p style=\"\">Using slow motion video analysis of Major League Baseball stars such as Albert Pujols, Ken Griffey Jr., Robinson Cano, Joey Mauer (and more!), the 7 Secrets program is the first instructional program that illustrates and explains the baseball/softball swing through slow motion video. &nbsp;The learning process is then doubled by using the same video analysis of youth players like your son or daughter, combined with in depth voice-over instruction. The entire program is delivered to parents and coaches through the Internet. &nbsp;</p><p style=\"\">Literally hundreds of coaches and parents are sharing this program with friends, family, and teammates for one simple reason:&nbsp;<em style=\"\">It works. &nbsp;</em>Everything is covered, from bat selection and hand placement, to the&nbsp;intricacies&nbsp;of front elbow control and stride. &nbsp;It&#039;s all there... Taken at your pace, it’s also one of the easiest and fastest ways to learn. &nbsp;Once you purchase the program, it&#039;s yours forever (including all updates and additions to the program). &nbsp;Keep coming back to the material for refreshers, updates, and tips.&nbsp;</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Seven Secrets to Hitting a Baseball", 
    "price": "25.00", 
    "instructors": "Ben  Startzer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47883_7f24_5.jpg", 
    "course_url": "https://www.udemy.com/seven-secrets-of-hitting/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-29T22:38:27Z"
}