{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Discover The Simple 5 Day System Guaranteed To Give You 10 More Yards Of Distance Even If You've Tried Everything In The Past and the best drills to slash 5 shots off your scores with the short game.<br><br>This is the Simple Golf System.<br><br>Simplicity is all the rage...and with good reason.<br><br>Complexity creates so much more opportunity for something to go wrong when it comes to the golf swing, and perhaps worst of all…<br><br>...complexity will almost always kill your distance.<br><br>See, if there are 20 different components that comprise your swing, there are 20 different potential spots where you can ‘leak’ yardage. If you ‘leak’ 3 yards in one area and 5 yards in another, before long you’re hitting the ball 10, 20...even 30 yards shorter than you should. But if you simplify your swing and use the mechanics that are unique to you and your body, then unleashing the untapped power you already inside you is easy.<br><br>Same applies to your short game.<br><br>It’s possible to cut your scores, Even if You’re short on time..<br><br>No fluff and NO B.S. Just the raw information and systems you need to slash 5 shots of your scores.<br><br>So … if you’re super-serious about improving your game, I’m going to give you some vital information … the TRUTH about what it really takes to score – so you can out perform the competition every time you step on the course.<br><br>This Simple Golf Swing System Will Give You A Powerful golf swing and a deadly short game.</p>", 
    "end_date": null, 
    "title": "Simple Golf Swing System: 10 More Yards & to Slash 5 Shots", 
    "price": "30.00", 
    "instructors": "Alex Fortey", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691482_d1bc_2.jpg", 
    "course_url": "https://www.udemy.com/simple-golf-for-10-more-yards-and-slashing-5-shots/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T21:59:19Z"
}