{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  <strong>Sports Betting Simplified</strong> - our brand new sports betting course - is designed for anyone interested in learning about the process of sports wagering, from the analysis phase to placing your first bets. This course features three different video series, each containing more than 20 minutes of video, to cover <strong>everything you need to make money</strong> on your wagers.</p><p>All of this adds up to <strong>over 2 hours of content!</strong></p>  <p>  \t  <em>Video lecture series one covers the basic overview of sports betting.</em>  We talk about all the different types of wagers, which ones pay, and which ones to avoid.  </p>  <p>  \t  <em>In the second video lecture series, we discuss how to pick a team using our three-point analysis system.</em>  </p>  <p>  \t  <em>In the third video lecture series, we discuss money management</em>, advanced betting strategies, and <strong>the methods of taking your wagering to the next level.</strong>  </p><p>Feel free to read some of our reviews.  Here's what people are saying:</p><ul><li>\"I tried 3 other sports betting courses, <strong>and this was the best.</strong>\"</li><li>\"<em>Instructor is very knowledgeable</em> about the subject and is clear to explain the terms in sports betting. I was able to understand some terms I was not familiar with.\"</li><li>\"I was pleasantly surprised by the<em> wealth of very helpful information</em> throughout the course and will definitely try sports betting in the future.\"</li><li>\"This course provides an excellent overview of the basics of sports betting and how to read the betting sites. <strong>Great place to start for a crash course on sports betting </strong>and <em>well worth the listening time</em>.\"</li></ul>  <p>  \t  When you sign up for this course, you'll get instant access to all lectures so you can get started immediately.  You can be placing your first bets tonight.  Sign up now!</p><p>Also, don't forget Udemy's 30-day money back guarantee.  You have nothing to lose, except for the bets you're not currently winning with.  Enroll now!</p><p>***<strong>PLEASE NOTE:</strong> Online wagering in the US is currently illegal, and as such, you will not find any information about how to circumvent this for online play if you're from the US.  In the rest of the world, have at it.  This course is, therefore, centered on playing in casinos, with only a few small sections dedicated to online wagering.***</p>", 
    "end_date": null, 
    "title": "Sports Betting Simplified: A Beginner’s Guide to Get Started", 
    "price": "20.00", 
    "instructors": "Robert Watson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319216_6c6f_3.jpg", 
    "course_url": "https://www.udemy.com/sports-betting/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T08:42:22Z"
}