{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Most people think that they are able to beat the bookies on the long run, but the cold-hard facts tell us that only 1-3% of punters are actually capable of doing this. The 97-99% that fail usually fail because they do not have the knowledge about betting necessary to win.</p><p style=\"\">Would you like to become a part of the winning minority? If so, you have come to the right place.</p><p style=\"\">Brought to you by two betting veterans, each with more than a decade of experience of both working for bookies and betting against them, Sports Betting In Depth: Get Ahead of the Curve will provide you with the knowledge needed to become profitable, and save you years of learning through trial and error.</p><p style=\"\">We will start off by teaching you the mechanics of how the bookies work, and will then talk about the errors that you are likely to make by using faulty logic and emotion. Finally, we will put everything into practice, and show you the things you need to look out for when analyzing games, as well as how to compile your own odds. The course mostly applies to betting on football (soccer), but the principles outlined in it are applicable to just about any sport. </p><p style=\"\">After completing the course, the knowledge that you will have will easily put you in the top 10-15% of punters, and you will also have the foundations set to work your way into the top few percent and become a long-term winner.</p>", 
    "end_date": null, 
    "title": "Sports Betting In Depth: Get Ahead of the Curve", 
    "price": "30.00", 
    "instructors": "Petar Novaković, Paul Barton", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577400_3162_2.jpg", 
    "course_url": "https://www.udemy.com/sports-betting-in-depth-get-ahead-of-the-curve/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T14:05:57Z"
}