{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t             Hi Guys! I have decided to share my secrets that have made me over 250,000 GBP over the last 19 years. In <em style=\"\"><strong style=\"\">Sports Spread Betting for Beginners</strong></em> we are going to take you from knowing nothing to being experts in just under 1 hour. Upon completion you will receive a free offer to receive an Ipad air 16&quot; or Sony 32&quot; HDTV when opening a sports spread betting account through our link.  </p>  <p>  \t             Personally over the last 19 years I have made consistently over <strong style=\"\"><em style=\"\">$2000 a month</em></strong> and on many occasions over <strong style=\"\"><em style=\"\">$5000 per month</em></strong> using the same trading strategies we show you on this course. Its not only great fun but enormously satisfying.  </p>  <p>  \t          My advice is to grab this course whilst you can as I may well take it down over the coming weeks once we have reached our goal and helped enough other people to achieve their goals.  </p>  <p>  \t <strong style=\"\">ABOUT THE INSTRUCTOR</strong>  </p>  <p>  \t         Anthony has successfully traded options and sports spread bets for over 19 years. He was a boxing consultant for IG Index and a boxing promoter with three world champions and has a 90% success rate on his boxing picks. Anthony has the fastest growing global binary options live signals trading room with over 250 students trading daily from all four corners of the globe and is dedicated to helping others fulfil their life goals. Anthony is the founder and CEO of reversetrade.org  </p>  <p>  \t <strong style=\"\">ABOUT THE COURSE</strong>  </p>  <p>  \t          Our goal is to equip you with all the tools you need to be able to trade successfully <em style=\"\">make a profit </em>and to protect yourself from making the common mistakes made by over 95% of all sports spread bettors who lose everything.  </p>  <p>  \t             To achieve this we will cover the following topics;  </p>  <p>  \t             1. What is Sports Spread betting  </p>  <p>  \t             2. Why Do It - Advantages  </p>  <p>  \t             3. Sports Spread Betting types of trades  </p>  <p>  \t             4. 6 Golden Rules Of Success  </p>  <p>  \t             5.  3 Winning Strategies  </p>  <p>  \t             6.  Money Management  </p>  <p>  \t             7. Selecting the right trading company  </p>  <p>  \t             8. How to place a Sports Spread Bet bet on a mobile  </p>  <p>  \t             9. How to place a Sports Spread Bet live online  </p>  <p>  \t             10. Create your own strategy  </p>", 
    "end_date": null, 
    "title": "Sports Spread Betting for Beginners", 
    "price": "20.00", 
    "instructors": "Anthony Stone", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267378_524c_10.jpg", 
    "course_url": "https://www.udemy.com/sports-spread-betting-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T14:46:16Z"
}