{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>LATEST</em>: Course Updated on 3/21/16. Over 900 students from nearly 100 countries are learning about concussions!<br></p>\n\n<p>BRAND NEW course on Udemy! Welcome to the FIRST EVER course series on sports concussions!</p>\n\n<p><strong><u></u></strong></p>\n\n<p>So you've learned what concussions are and how to handle them.  But if you're like most people, you still have more questions than you have answers.  Learn how to understand the deeper subjects on concussion in sport.  This course will provide you will the answers to many of your questions, and help you understand what your healthcare provider is thinking when you seek care for a head injury.</p>\n\n<p>Learn how you can have a profound impact on the safety of your friends, children, loved ones and athletes by learning the basics of sports concussion awareness from Udemy's <strong><u><em>first ever</em></u></strong> concussion education courses! In this course, ill make this mysterious topic a little more friendly. You will also understand how to be the calm among the storm, should you or someone you know suffer a sports concussion.<br></p>\n\n<p><em></em></p>\n\n<p><strong>Gain a Solid Understanding of Head Injuries and Help Protect Yourself and Loved Ones.</strong></p>\n\n<ul><li>Learn About Baseline and Neurocognitive Testing</li><li>Learn About Recovery</li><li>Learn About Multiple Concussions</li><li>Learn About Preparing and Preventing Concussions</li></ul><p><br></p>\n\n<p><strong>The Power To Save a Life...Literally In The Palm of Your Hand</strong><br></p>\n\n<p>Each year, thousands of athletes suffer from concussions. And every year, several young athletes die from head injuries in sports. This course will help you \"step up your game\" when it comes to the safety of your athletes, teammates and children. In this course, you will learn how deep the rabbit hole goes by understanding the <strong><em>more advanced concepts of concussive injury.</em></strong><em><strong></strong></em></p>\n\n<p>Head injuries do happen in sports; they are inevitable. You MUST be able to handle them appropriately. Will <strong><em>You</em></strong> know what to do when a head injury occurs? This course will help you answer \"yes\" to this question.</p>\n\n<p>This course is perfect for anyone involved in athletics in any way, whether they be a parent, athlete, coach, spectator, official or other.</p>\n\n<p><strong>Content and Overview</strong><br></p>\n\n<p>In over an hour of content including plenty of lectures and several challenging quizzes, this course will take you through a sequential order of learning. You will continue your education by understanding the basics of testing and recovery. More importantly you will continue to gain valuable knowledge on preparing for and preventing head injuries.</p>\n\n<p>When coupled with the your education on the previous course, you will be able to give your kids, peers and athletes one of the highest levels of safety one can offer.</p>\n\n<p>Upon completion of this course, you will be able to understand and use the tools available to you in order to be comfortable with the complete process of concussion management.</p>", 
    "end_date": null, 
    "title": "Sports Concussions 2.0: More Secrets That Could Save a Life!", 
    "price": "20.00", 
    "instructors": "Ryan Lowery", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/696772_6e00_4.jpg", 
    "course_url": "https://www.udemy.com/sports-concussions-20-more-secrets-that-could-save-a-life/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T01:56:57Z"
}