{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Hast Du Dich schon einmal gefragt, wie gute Eiskunstläufer und Rollkunstläufer einen Dreifachsprung stehen können?  </p>  <p>  \t  Die Lösung liegt in ihrer enormen Sprungkraft. Vielleicht bist Du auch an einem Punkt angekommen, wo Du die Leistung bei Deinen Sprüngen nur durch ein Sprungkrafttraining steigern könntest. Nur wenigen Sportlern steht allerdings eine spezieller Athletiktrainer oder besonderes Equipment zur Verfügung.  </p>  <p>  \t  Aus diesem Grund ist dieses 10-wöchige Trainingsprogramm entstanden. Pro Woche trainierst Du zweimal á 45 Minuten. Jede Trainingseinheit startet mit einem speziellen Aufwärm- und Mobilisationstraining. Danach folgt eine Sprungtrainingseinheit, gefolgt von einem Krafttraining. Nach zwei Wochen wechselt der Trainingsplan und Du erhältst neue Übungen.  </p>  <p>  \t  Die Videos helfen Dir, die einzelnen Übungen korrekt auszuführen. Außerdem kannst Du Dir Trainingspläne mit den genauen Wiederholungszahlen und Pausenzeiten ausdrucken.  </p>  <p>  \t  Alle Trainingseinheiten sind so konzipiert, dass Du das nötige Equipment in jeder Sporthalle findest. Du brauchst keine Hanteln oder spezielle Trainingsgeräte!  </p>  <p>  \tDu hast Fragen zur Ausführung der Übungen oder dem Programm? Kein Problem, über den Chat helfe ich Dir gerne weiter.  </p>  <p>  \t  Das Beste kommt jedoch zum Schluss: Du kannst Dir alle Trainingseinheiten kostenlos auf Dein Handy herunterladen. So hast Du während des Trainings alle Video-Anleitungen bei Dir.  </p>  <p>  \t  An Ende dieser 10 Wochen wirst Du in wichtigen Gelenken wie dem Sprunggelenk und der Hüfte beweglicher sein. Die Kraftwerte Deiner Bein- und Rumpfmuskulatur werden gestiegen sein und zusammen mit den Sprungübungen bewirken, dass Du höher springen kannst.  </p>", 
    "end_date": null, 
    "title": "Sprungkrafttraining für Rollkunstlauf und Eiskunstlauf", 
    "price": "25.00", 
    "instructors": "Nathalie Heinz", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339718_89ed.jpg", 
    "course_url": "https://www.udemy.com/sprungkrafttraining-fur-rollkunstlauf-und-eiskunstlauf/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T16:42:49Z"
}