{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Are You Interested in Archery But Not Sure How to Start?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Would You be Excited to Hit Multiple Bulls Eyes in a Row?</strong>  </p>  <p style=\"\">  \t<em style=\"\">If so, the course we are about to describe is for you.</em>  </p>  <p style=\"\">  \t<strong style=\"\">Your Teachers</strong>  </p>  <p style=\"\">  \t                As the teachers of archery to UCLA and several celebrities, we have put together our best tips.  Archery Pro is one the largest nationwide archery schools teaching thousand of students.  Our lessons company has been teaching since 2009 and has taught over 15,000 lessons.  We are a certified NRA alliance business member.  </p>  <p style=\"\">  \t<strong style=\"\">Online Archery Course</strong>  </p>  <p style=\"\">  \t            Straight Shot was designed to supplement or replace in-person archery lessons.  The videos are going to cover everything you could learn in lessons plus a whole lot more!  The great thing about Straight Shot is that you will always have the videos as a point of reference!  </p>  <p style=\"\">  \t        The purpose of this course is to take a beginner through the basics of selecting the right equipment to maintaining/stringing their bow to range set up to proper form to landing a bulls eye.  We want to take you through all of the techniques that you need to learn from start to finish.  </p>  <p style=\"\">  \t<strong style=\"\">Who it's For</strong>  </p>  <p style=\"\">  \t            This course is great for those who are learning archery for recreational purposes or for hunting.  We will cover how to score your shots and how to aim accurately for hitting bulls eye or that big buck.  </p>  <p style=\"\">  \t<strong style=\"\">Curriculum</strong>  </p>  <p style=\"\">  \t                -Recurve, compound, and crossbow instruction  </p>  <p style=\"\">  \t                -Equipment training  </p>  <p style=\"\">  \t                -Safe shooting  </p>  <p style=\"\">  \t                -Maintenance  </p>  <p style=\"\">  \t                -Stance and positioning for a proper shot  </p>  <p style=\"\">  \t              -Kneeling, and standing shots  </p>  <p style=\"\">  \t<strong style=\"\">Bow Types:</strong>  </p>  <p style=\"\">  \t            -Training for Recurve, Crossbow, and Compound Bow  </p>  <p style=\"\">  \t            -How to select proper equipment for each of the bow types  </p>  <p style=\"\">  \t      This course was designed to relevant to a diverse group of archers.  So whether you're just getting started or you need a brush up on your skills, this course is for you.  </p>", 
    "end_date": null, 
    "title": "Straight Shot: Archery Course For Beginners", 
    "price": "50.00", 
    "instructors": "Cressler McArthur, Archery Instructor Katrina Wilson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299918_68c4_2.jpg", 
    "course_url": "https://www.udemy.com/online-archery-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-14T03:32:49Z"
}