{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><em>Want \"insider\" access to off-ice training secrets of top junior, college and professional hockey players?</em></strong></p><ul><li>Do you <strong>struggle to gain strength and  lean muscle</strong>, no matter how much you eat or how many different training routines you try?</li><li>Do you <strong>lose puck battles along the boards and in the corners</strong> against bigger and stronger guys?</li><li><strong></strong>Do your <strong>legs feel \"heavy\" </strong>when playing back-to-back games?<strong></strong></li><li>Are you <strong></strong>frustrated<strong> </strong>with <strong>your lack of physical strength?<br></strong></li><strong></strong><li><strong></strong>Do you have <strong>trouble keeping up with the pace </strong>as a game progresses?<strong> </strong></li><li>Do you feel <strong>beat up and get injured</strong> all the time?</li><li>Does Coach <strong>limit your ice time</strong> because you can't produce on the ice?</li></ul><p><br></p><p>If\n you answered \"YES\" to any or all of these questions, then this course\n is right for you. With my strength training program, you’ll have all the \ntools and knowledge you need to...  </p><ul><li><strong>Add solid muscle</strong> all over your frame</li><li><strong></strong>Make<strong> mind-blowing strength gains</strong></li><li>Improve <strong>overall athleticism</strong></li><li><strong></strong>Feel more <strong>confident and powerful on the ice</strong></li></ul><p><strong><em></em></strong></p><p><strong><em></em></strong>This\n course will teach you basic off-ice training tools for developing unstoppable leg strength and power, adding solid mucle to your frame, building superhuman core strength - and most importantly, how to apply these methods in a training program that will boost your performance on the ice. <strong><em></em></strong></p><p><strong><em>*Watch lecture one (free preview) for a course introduction video</em></strong></p><p> If you want to learn the exact off-ice training methods of hundreds of hockey players who have:</p><p><strong>• Donned the national team jersey</strong><br>\n</p><p>• Signed pro contracts</p><p><strong>• Taken giant leaps in on-ice performance</strong></p><p>• Come back from career-threatening injuries</p><p><strong>• And are now stronger, healthier and more athletic than ever before</strong></p><p>...  you NEED to check out this six part, step-by-step, all HD video course \nwhich teaches you everything you need to start making some serious gains in the gym!</p><p>For the price of a few sessions with some run-of-the-mill personal trainer at the local gym whose idea of proper leg training for hockey players involves leg presses, leg extensions and Bosu ball squats, you can have unlimited lifetime access to a \nworld class hockey strength coach with <em></em><strong><em>real experience helping players progress from the juniors to college and the professional level!</em></strong><strong></strong></p><p><strong>I\n am a Certified Strength and Conditioning Coach, have been working with athletes for years, \nand have coached hundreds of hockey players from 8-year-olds to World Champions!</strong></p><p>Lectures feature A TON of HD training videos, where either my hockey players or I (yes, unlike many other \"fitness experts\" out there, I practice what I preach) demonstrate the exercise or movement I'm explaining.</p><p>Plus, if you post a question in the discussion forum, I will personally respond with real individual feedback! I try to check it daily.<br><strong></strong></p><p>No matter\n your age or current level of play, this course will fill in the \"gaps\" and break \ndown strength training for ice hockey in a simple, and most importantly, \napplicable way. </p><p><strong>You won't find a more comprehensive, straight-to-the-point course on strength training for hockey players anywhere.</strong></p><p>After completing this course, you will have the tools to gain that extra step or two over everyone else... And remember, you have a<strong> no questions asked 30 day money back guarantee</strong>. That means, if for whatever reason this course isn't right for you, simply let me know and I’ll refund 100% of your purchase – no hassles, no hard feelings, no questions asked.<span></span></p><p>I personally GUARANTEE\n you won't find another hockey-specific training course on UDEMY (and likely NOWHERE on the internet, either) that lays out all the steps in such a simple and effective way as \nthis one.  I've spent YEARS and TENS OF THOUSANDS OF DOLLARS honing my unique \napproach to physically preparing athletes, and I stand by it 100%.</p><p>Yes, you could try one of those other \"weight lifting\" or \"six-pack abs\" courses on UDEMY, but they are just <strong>generic lifting instructions</strong> that you can find for free online. None of them take into account the demands and requirements for training SPECIFICALLY for the sport of ICE HOCKEY.  <strong>So d</strong><strong>on’t waste your precious time on that cookie-cutter stuff.</strong><br></p><p>But, if you want my personal \"insider\" information - remember, <strong>I've helped numerous hockey players take their game to the next level, whether playing at the World Junior Championships or </strong><strong>with the pros </strong>(and I've never revealed my training methods in such detail before this) - you need to get this course now... right this minute.</p><p>  \t<strong>Every minute you delay is actually taking you further and further away from fulfilling your potential...</strong></p>  <p>  \t<strong>Enroll now!</strong>  </p>", 
    "end_date": null, 
    "title": "Strength Training for Ice Hockey", 
    "price": "50.00", 
    "instructors": "Yunus Barisik, C.S.C.S.", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728824_3294_5.jpg", 
    "course_url": "https://www.udemy.com/hockeyworkouts/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T06:45:41Z"
}