{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you tired of getting injured? <br>\n</p><p>Are you tired of experiencing one disappointing setback after another?</p><p>Are you tired of training for months only to be sidelined with frustration within weeks of your goal race?</p><p><strong>You can do something about it.</strong></p><p><strong>30 minutes of strength work</strong> with the <strong>right exercises</strong> a few times a week can help you train with the <strong>consistency you deserve and get to the starting line healthy</strong>.<strong></strong></p><p>I know the<strong> stress, anxiety and frustration</strong> that comes from <strong>not being able to run when you want to run</strong>. I know the<strong> excitement of getting close</strong> to a goal race only to be derailed by<strong> injury weeks before.</strong></p><p>I know what it feels like to <strong>sacrifice other things you enjoy</strong> as well as <strong>time with your family </strong>only to have your running dreams not come to fruition. As a competitive runner of 20 years, competing distances from the 800 meters to the marathon, <strong>I’ve had everything</strong> from shin splints, to stress fractures, to knee pain (patella tendonitis) to ankle pain (peroneal tendonitis) to IT band syndrome. I’ve even had back pain. Through it all, I was able to achieve a 1:16 Half Marathon and a 2:43 Marathon.</p><p>The <strong>good news</strong> is that with each injury I <strong>learned the running-specific strength and mobility</strong> exercise I needed to do to <strong>reduce or eliminate</strong> the chances of<strong> that injury ever happening again </strong>and now I'm sharing what I've learned.</p><p>This program is not about going to the gym and mindlessly banging out a set of squats at maximum weight or hitting the bench press to garner a winking eye at the beach (although that may happen). <strong>It is about doing exercises that help you avoid injury and get the running results you want.</strong><br></p><p>You don’t have to scour the internet or view dozens of videos for piecemeal ways of addressing your strength needs. You don’t need to wonder about what exercises to do and how many sets or repetitions of each exercises you need to perform. You don’t even need to wonder whether you’re doing the exercises “right”. <br>\n</p><p><strong>Delivered via text, audio and over five hours of high definition video</strong>, this <strong>45 day program</strong> shows you <strong>exactly what exercises to do, how many times to do them and what you should look like while doing them</strong>. And you won’t even need to go to a gym, hire an expensive trainer or get all this fancy equipment to make gains that matter.</p><p>You also won’t need to obsess about whether your strength program is working or not! If you follow the program I’ve outlined for you, it will work! <strong>You’ll not only see results, you’ll FEEL them! </strong>Heck, you’ll even feel strong even while sitting and standing. I guarantee it!</p><p><strong>Here's what others are saying about the course:</strong><br>\n</p><p><em>\"Funny, and I almost hate to put this into writing but before I “met” you or started strength training my training consisted of no warm-up, no cool down, and, of course, zero strength training. As such, I would feel tight and sore after every run which would continue throughout the following days. Simple tasks, such as getting out of bed, standing up after sitting for a while, and walking were all experienced with varying degrees of pain and lethargy. Now, I notice that I am no longer tight in the days and evenings after my runs, I get out of bed with more pep, and I no longer limp around the office after sitting at my desk for long periods. Thank you so much for helping me.”Jesse O.</em></p><p><em>I started “Building Your Strong Running Body” coming back from an injury. I was interested in this because I have had several significant injuries that have set me back in my training. I needed something from a knowledgeable source that I could be confident in implementing into my running. From day one I really liked the dynamic warm-up because I always struggled with knowing the best way to get my muscles ready before running or strength training. I could tell that this quick routine had my legs flexible and ready. The Abdominal and Back Series had my abs sore for a few days after the first workout. For years I have done lots of sit-ups and other ab workouts, but never had soreness, so I knew this workout was doing the trick! I liked the way the course taught which muscles should be engaged in a specific exercise and how it emphasized proper form when doing the exercise. Since starting the course I believe my form is much better and my core and legs are stronger.” - Patricia Tuttle Russell</em></p><p><em>“I am grateful today that you suggested foam rolling when I had my gluteus issues this spring I was skeptical but it cured my glutes issues. Thursday I had physicl training and our instructor pushed us hard, my legs were as sore as after a 50K ultra race, I am not kidding. I have foam rolled 2 times yesterday and 2 times today and am so much better. What a life saver”-</em><em>Gabriella Lundh</em></p><p>Make this the year you take your running to another level.</p><p>I look forward to helping you get strong!<br></p><p>Lisa</p>", 
    "end_date": null, 
    "title": "Strength Training & Injury Prevention for Runners", 
    "price": "45.00", 
    "instructors": "Lisa Hamilton", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640216_fd61_3.jpg", 
    "course_url": "https://www.udemy.com/strength-training-injury-prevention-for-runners/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T10:12:45Z"
}