{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">&quot;Let the game be the teacher&quot; is a commonly heard phrase in youth soccer coaching. But what happens when the teaching doesn&#039;t stick or worse, the players learn the wrong things?</p><p style=\"\">This&nbsp;course will lay out the fundamental ideas about what small sided games (SSG&#039;s) are, how to create your own games, how to recognize when they need adjusting, how to make those adjustments and much more.</p><p class=\"PIN_1373202672624_hazClick\" style=\"\">The course includes a series of structured&nbsp;lectures along with simple and clear graphics. A 186 page workbook, short files and additional external videos are supplied as supplementary material. This course builds on the internationally recognized Better Soccer More Fun website and Street Soccer, An Introduction to Small-sided Games DVD.</p><p class=\"PIN_1373202672624_hazClick\" style=\"\">The course runs a little over an hour lays out a path for continual growth.&nbsp;In the short run,&nbsp;you&nbsp;will have&nbsp;your own SSG&#039;s up and running immediately. In the long run, your appreciation of their&nbsp;influence increases as&nbsp;you&nbsp;work with&nbsp;your own team. Learning never stops&nbsp;while your comfort and expertise continually grows.</p><p style=\"\">The course is structured in seven sections:</p><p style=\"\">1) What is the role of the soccer coach</p><p style=\"\">2) Playing with the elements</p><p style=\"\">3) Phases of learning</p><p style=\"\">4) Festivals and tournaments (a training model)</p><p class=\"PIN_1373202672624_hazClick\" style=\"\">5) Reading the game</p><p class=\"PIN_1373202672624_hazClick\" style=\"\">6) Building your sessions</p><p class=\"PIN_1373202672624_hazClick\" style=\"\">7) Some basic games to build from</p><p class=\"PIN_1373202672624_hazClick\" style=\"\">This&nbsp;is an invaluable aid&nbsp;for&nbsp;young professional coaches just getting started in a career, parent/volunteer coaches&nbsp;in need of&nbsp;quick solutions and clubs looking for a simple and inexpensive curriculum. It is built on years of work with SSG&#039;s, youth players and the methods are recognized by International coaching associations.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Street soccer, a guide to using small sided games.", 
    "price": "25.00", 
    "instructors": "Larry Paul", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58514_7c33_6.jpg", 
    "course_url": "https://www.udemy.com/street-soccer-a-guide-to-using-small-sided-games/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-06T00:34:45Z"
}