{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Looking for the easiest way to begin improving your golf game? Or maybe you're seeking to get more satisfaction and relaxation during your rounds?</p><p>Whatever your motivation to become a better golfer, you've come to the right place. </p><p><em><em>The </em>Complete <em>Golf</em> Guide</em> is THE most simplified, time-efficient, cost-effective, golf-enhancing lecture series you'll find on the web.</p><p>It's a one-stop-shop for everything you need to start mastering the needed skills to hit greats shot more consistently and ultimately - become the best golfer you can be!</p><p>This fast, effective course takes you easily from zero skills to a confident swinging and thinking golfer in just 6 weeks.</p><p>What's involved? </p><p>You'll gain immediate access to 20 uniquely-designed lectures, each developed with ease of learning in mind. </p><p>Using my background as a high-caliber player and teacher I've created crystal-clear, original content which you'll find EASY to Understand - and more importantly - EASY to Absorb. </p><p>You'll find learning both QUICK and FUN! I've used techniques proven to effortlessly lock that knowledge in as you move smoothly through each lecture. </p><p>If you're looking for a genuinely effective course, I personally guarantee this is the course for you. </p><p>Are you ready to transform your world and become a confident, smooth swinging golfer?</p><p>Here's what you get with <em><em><em><em>The </em>Complete <em>Golf</em> Guide</em></em></em>: </p><p>You'll get access to all 20 lectures, and a deep understanding of each topic. </p><p>Each lecture is supported with practice drills for you to learn at your own pace wherever you are.</p><p>Over 20 lectures you will learn: </p><ul><li>Grip</li><li>Alignment</li><li>Stance and Posture</li><li>Golf Kinesiology</li><li>Putting</li><li>Chipping</li><li>Pitching</li><li>Backswing/Takeaway</li><li>Transition</li><li>Impact</li><li>Finish</li><li>Pre Round Routine</li><li>Pre Shot Routine</li><li>Executing The Shot</li><li>Building Momentum On Course</li></ul><p>What else will you get? </p><ul><li>A friendly, informal community to support you every step of the way</li><li>Personal contact with me, the course creator</li><li>Lifetime access to course materials</li><li>Hands-on practice drills to lock that knowledge in and develop muscle memory</li><li>A deep understanding of the fundamentals, short game, full swing, and how to apply those skills on the golf course</li></ul><p>You'll never have to waste your time and hard-earned cash learning from books, expensive online courses and scattered YouTube videos. </p><p>With <em><em><em><em>The </em>Complete <em>Golf</em> Guide</em></em></em> you get everything you need, all under one convenient, easy to navigate platform. Plus, you will get fast, friendly, responsive support by email and on the Udemy discussion forums. </p><p>I will never leave you hanging!</p><p>It doesn't matter your age, physical ability, or previous golf experience. I guarantee that ANY golfer can benefit from this course, whether it's learning to improve a skill you already have or learning the game for the first time.</p>", 
    "end_date": null, 
    "title": "The Complete Golf Guide", 
    "price": "25.00", 
    "instructors": "PREMIUM INSTRUCTOR Garrison Pryce", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/509068_a0a5_4.jpg", 
    "course_url": "https://www.udemy.com/playgolf/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-22T17:41:19Z"
}