{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Overview</strong>  </p>  <p>  \t                               As featured on ESPN, eHow, and Yahoo Sports!, Trick Tutor is the ultimate help guide for new skaters.  It helps students achieve the best balance, increase confidence, and elevate their current skateboard level.  </p>  <p>  \t<strong style=\"\">Comprehensive Video Instruction</strong>  </p>  <p>  \t                                Every skateboarder must first understand the foundation of skateboarding-the transportation techniques.  This makes skateboarding easier, learning quicker, and helps it be safer.  Trick Tutor covers everything you must know about the transportation basics so that you have no fear.  </p>  <p>  \t<strong style=\"\">What You Will Get:</strong>  </p>  <p>  \t<strong style=\"\">-High Quality HD and 720p Instruction Videos</strong>  </p>  <p>  \t<strong style=\"\">-How to Skate</strong>  </p>  <p>  \t<strong style=\"\">-Where to Skate</strong>  </p>  <p>  \t<strong style=\"\">-Equipment to Skate With</strong>  </p>  <p>  \t<strong style=\"\">-A 84 pg. Ebook with Foot Diagrams</strong>  </p>  <p>  \t<strong style=\"\">-A $29.95 Coupon for In-Person Skateboard Lessons Anywhere in US (Through GoSkate Network)</strong>  </p>  <p>  \t                                Understanding the parts of a skateboard is equally important to knowing how to ride.  In this video series, we will teach you how each part of the skateboard effects your skating.  We will help you pick the best skateboard parts for your ability.  </p>  <p>  \t                               Trick Tutor is brought to you by Go Skate, the largest skateboard school, which has over 1300 instructors.  Go Skate has taught over 8,000 new skateboarders how to skate.  </p>  <p>  \t<span>The ultimate \"how-to\" Ebook guide is the perfect compliment to your lessons. The E Book serves as a guide to refer to after the lessons and continue learning!  This is one of the only skate lesson books ever developed.. </span><span>This guide will save you a ton of trouble, time and money!</span>  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Learn Tricks Quickly</strong>  </p>  <p>  \t                                With the foundation set, we will amplify your skating with ramp moves, street tricks, and popular moves like the Ollie.  Regardless of what you want to learn, we promise that this course will be the quickest way to achieve your skateboarding goals.  </p>", 
    "end_date": null, 
    "title": "Trick Tutor- Beginner Skateboarding Lesson Online ", 
    "price": "30.00", 
    "instructors": "Rob Dunfey", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124798_5f7d_10.jpg", 
    "course_url": "https://www.udemy.com/trick-tutor-skateboarding/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-24T21:45:12Z"
}