{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>What is the difference between good and great players? </p><p>Confidence.</p><p>How do you develop confidence? </p><p>By mastering the skills of the game.</p><p>That is what this course is about. Once your child is able to perform the &quot;first most important skills&quot; in basketball, the foundation is set and the opportunities will open up for them. </p><p>What happens when your child doesn&#039;t have a great skill set? Turnovers, lost opportunities, and frustration. Sub par players aren&#039;t bad, they just haven&#039;t learned the skills that the other players have. Don&#039;t let that happen to your child. </p><p>If you know a beginner who wants to be a confident player, or even a current player who wants to sharpen their basketball skills, this is the course for them!</p><p>Ben, a 7 year old who you will meet in the course, surprised us with how much better and stronger, and more confident he was by the time the course was complete. We were amazed by his progress. </p><p>This course is not only packed with drills to increase the most important basic skills, it includes trainings from coaches, former professional players, and wellness professionals  who have all contributed their expertise. It also includes charts for youngsters to keep track of their progress. This course not only covers the important basics of the game, it is presented in a fun and easy way that even young children can follow and find fun.</p><p>Remember, if you want your child to succeed in basketball they need to practice. Every week they don&#039;t get better, is a week they fall behind. </p><p>Get in the game!  Enroll today! </p><p>Act quickly! This course will increase to $99 on Sept 12th. </p>", 
    "end_date": null, 
    "title": "Youth Basketball: How to Get Better at Basketball For Kids", 
    "price": "30.00", 
    "instructors": "Michael N. Olpin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520988_b373_2.jpg", 
    "course_url": "https://www.udemy.com/youth-basketball/", 
    "currency": "USD", 
    "subject_name": [
        "Sports"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-05T04:20:54Z"
}