{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n8.01x is an online version of Classical Mechanics, which is the first of MIT's introductory physics courses. The course covers the basic concepts of Newtonian mechanics, fluid mechanics and kinetic gas theory. A variety of other interesting topics are covered, such as resonance phenomena, musical instruments and astronomical phenomena such as binary stars, neutron stars, black holes, stellar collapse, and supernovae. You will also be given a peek into the intriguing world of quantum mechanics.\n\nThe course follows the MIT on-campus class as it was given by the renowned Professor Walter Lewin in the fall of 1999. This includes his video lectures, problem solving sessions, and, of course, his famous in-class demonstrations. Professor Lewin, proclaimed \"a Web Star\" by The New York Times, has supplemented his lectures by including interactive questions to help students check their understanding during the lectures themselves.\n\nYou will complete automatically graded weekly homework problems and exams to test your understanding and to help you master the material. Lectures are interspersed with questions to be answered. There is a moderated forum for student-to-student threaded discussions. While homework deadlines will be strictly enforced, the lowest homework grade will be dropped. Your grade will be based on the interactive questions during the lectures (10%), homework problems (15%), three midterm exams (15% each), and the final exam (30%). Your grade will be as follows: A (more than 85%), B (70-85%), C (60-70%). At least 60% must be obtained to qualify for a certificate.\n\nThe book is available on line without charge, but you can also buy a printed copy of the book (publisher Wiley). Since the book is a record of things you will soon forget, Professor Lewin recommends you buy the book if you can afford it.\n\nABOUT THE LECTURES\n\nLewin's lectures at MIT are legendary. Many have been shown for over six years (starting in 1995) on UWTV in Seattle, reaching an audience of about four million people. For fifteen years (starting in 1983) he was on MIT Cable TV helping freshmen with their weekly homework assignments. His programs were aired 24 hours per day and were frequently watched by upper-class students. Additionally, his 35 lectures on Newtonian Mechanics, 36 lectures on Electricity and Magnetism and 23 lectures on Vibrations and Waves can also be viewed at MIT'S OpenCourseWare, iTunes U, YouTube and Academic Earth. About 5000 people daily from all over the world watch these lectures - that's about two million people per year! Many teachers show them regularly in their classrooms. Bill Gates even wrote Professor Lewin that he has watched all his lectures more than once and he has learned a lot from them. The many responses that Professor Lewin receives daily are quite wonderful and often very moving.\n\nBefore your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\n                                    ", 
    "end_date": "2014-01-13T00:00:00Z", 
    "title": "8.01x: Classical Mechanics", 
    "price": 0, 
    "instructors": "Walter Lewin, Isaac Chuang and Deepto Chakrabarty", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/mitx/mitx-8-01x-classical-mechanics-853", 
    "duration": "18 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2013-09-09T00:00:00Z"
}