{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nThe course offers a sophisticated view of quantum mechanics and its proper mathematical foundation. It will give you the tools needed to do research in quantum mechanics and to understand many current developments.\n\n8.05 is the second semester of the three-course sequence on undergraduate quantum mechanics at MIT. 8.05 is a signature course in MIT's physics program and a keystone in the education of physics majors. The online course 8.05x will follow the on-campus version and will be equally rigorous.\n\nTo master this material and to follow the course, you will likely need a time investment of ten to twelve hours a week. There will be weekly homework, one mid-term test, and a final exam.\n\nTopics covered\n\nReview of wave mechanics. Variational principle. Spin operators and general spin one-half states. Elements of linear algebra: complex vector spaces and linear operators. Hermitian operators and unitary operators. Dirac bra-ket notation. The uncertainty principle and compatible operators.\n\nSchrodinger equation as unitary time evolution. The Heisenberg picture of quantum mechanics. Coherent and squeezed states of the harmonic oscillator. Two-state systems. Nuclear magnetic resonance and the ammonia maser.\n\nMultiparticle states and tensor products. Entanglement and quantum teleportation. The Einstein, Podolsky, Rosen paradox and Bell inequalities. Identical particles: bosons and fermions.\n\nAngular momentum and central potentials. Representations of angular momentum. Hidden symmetries and degeneracies. Addition of angular momentum. Algebraic solution of the hydrogen atom.\n\nMore on Prerequisites\n\nTo follow this course you will need some basic familiarity with quantum mechanics. You must have seen the Schrodinger equation and studied its solutions for the square well potential, the harmonic oscillator, and the hydrogen atom. You may have learned this by self-study or by taking an introductory one-quarter or one-semester course on the subject. You must be proficient in calculus and have some knowledge of linear algebra.\n\nFAQ\n\nWho can register for this course?\n\n\tUnfortunately, learners from Iran, Sudan and the Crimea region of Ukraine will not be able to register for this course at the present time. \n\t\tWhile edX has received a license from the U.S. Office of Foreign Assets Control (OFAC) to offer courses to learners from Iran and Sudan our license does not cover this course. \n\t\tSeparately, EdX has applied for a license to offer courses to learners in the Crimea region of Ukraine, but we are awaiting a determination from OFAC on that application. \n\t\tWe are deeply sorry the U.S. government has determined that we have to block these learners, and we are working diligently to rectify this situation as soon as possible.\n\t\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n                                    ", 
    "end_date": "2014-08-10T00:00:00Z", 
    "title": "8.05x: Mastering Quantum Mechanics", 
    "price": 0, 
    "instructors": "Saif Rayyan and Barton Zwiebach", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/mastering-quantum-mechanics-mitx-8-05x-0", 
    "duration": "15 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-04-27T00:00:00Z"
}