{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    This physics course offers a sophisticated view of quantum mechanics and its proper mathematical foundation. In this first module of three you will review the basics of wave mechanics and be introduced to the variational principle. You will learn about the technology of spin one-half states and spin operators and get an in-depth look into linear algebra to establish the mathematical foundation necessary to do quantum mechanics. This course concludes by developing the bra-ket notation of Dirac.\n\nTo follow this course you will need some basic familiarity with quantum mechanics. You must have seen the Schrödinger equation and studied its solutions for the square well potential, the harmonic oscillator, and the hydrogen atom. You must be proficient in calculus and have some knowledge of linear algebra.\n\nCompleting the 3-part Mastering Quantum Mechanics series will give you the necessary foundation to pursue advanced study or research at the graduate level in areas related to quantum mechanics.\n\nPart 1: Wave Mechanics,\n\nPart 2: Quantum Dynamics\n\nPart 3: Entanglement, and Angular Momentum.\n\nThe series will follow MIT’s on campus 8.05, the second semester of the three-course sequence on undergraduate quantum mechanics, and will be equally rigorous. 8.05 is a signature course in MIT's physics program and a keystone in the education of physics majors. \n\n \n\nLearner Testimonial\n\n“I’ve thought long and hard to come up with a better MOOC than this one (I’ve completed 25 of these things over the past 2 years) and can’t do it. 8.05x is #1 and I suspect will stay that way for some time to come.”\n\n “Being an engineering student from India trying to shift to Physics, I am often faced with the requirement to study topics on my own. Very often this has led me to feel inadequate. 8.05x was the perfect opportunity for me to both gain knowledge and evaluate my understanding on a high quality international platform. It has really exceeded my expectations. Now, at the end of fifteen weeks, I feel more confident and hopefully I am more knowledgeable.”\n\n                                    ", 
    "end_date": "2016-03-30T00:00:00Z", 
    "title": "8.05.1x: Mastering Quantum Mechanics Part 1: Wave Mechanics", 
    "price": 0, 
    "instructors": "Barton Zwiebach and Saif Rayyan", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "12 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/mastering-quantum-mechanics-part-1-wave-mitx-8-05-1x", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-02-17T00:00:00Z"
}