{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    8.EFTx is an online version of MIT's graduate Effective Field Theory course. The course follows the MIT on-campus class 8.851 as it was given by Professor Iain Stewart in the Fall of 2013, and includes his video lectures, resource material on various effective theories, and a series of problems to facilitate learning the material. Anyone can register for the online version of the course, and students at MIT or Harvard can also register for 8.S851 for course credit.\n\nEffective field theory (EFT) provides a fundamental framework to describe physical systems with quantum field theory. In this course you will learn both how to construct EFTs and how to apply them in a variety of situations. We will cover the majority of the common tools that are used by different effective field theories. In particular: identifying degrees of freedom and symmetries, formulating power counting expansions (both dimensional and non-dimensional), field redefinitions, bottom-up and top-down effective theories, fine-tuned effective theories, matching and Wilson coefficients, reparameterization invariance, and various examples of advanced renormalization group techniques. Examples of effective theories we will cover are the Standard Model as an effective field theory, integrating out the massive W, Z, Higgs, and top, chiral perturbation theory, non-relativistic effective field theories including those with a large scattering length, static sources and Heavy Quark Effective Theory (HQET), and a theory for collider physics, the Soft-Collinear Effective Theory (SCET).\n\nCourse Flow\n\nSince this is an advanced graduate physics course, you will find that self motivation and interaction with others is essential to learning the material. The purpose of the online course is to set you up with a foundation, to teach you to speak the language of EFT, and to connect you with other students and researchers that are interested in learning or broadening their exposure to this subject. Each week you will complete automatically graded homework problems to test your understanding and to help you master the material. You are expected to discuss the homework with other people in the class, but your online responses must be done individually. To facilitate these interactions there will be a forum for student-to-student discussions, with threads to cover different topics, and moderators with experience in this field. Student learning and discussions will also be prompted by questions posed after each lecture topic.\n\nThere will be no tests or final exam, but at the end of the course each student will give a 30 minute presentation on an EFT topic of their choosing. The subject of effective field theory is rich and diverse, and far broader than we will be able to cover in a single course. The presentations will create an opportunity for you to learn about additional subjects beyond those in lecture from your fellow students. To facilitate this learning opportunity, each student will be required to watch and grade eight presentations from among their fellow students. Of these eight, you will view 5 presentations that will be chosen for you, and you will view at least 3 more that you choose yourself from among the available topics.\n\nSince this is a graduate course we anticipate that learning the subject, and having the 8.EFTx materials available as an online resource will be more valuable to most of you than obtaining a grade. Therefore anyone who registers for the course will be able to retain access to the course materials after the course has ended. Since some of you may find a grade useful, we will compute a grade for everyone by using a combination of homework problems (50%) and your final research presentation project (50%).  For many of the course elements you may work at your own pace. The presentation project will be due December 16th.  For those following the suggested schedule there is a one-week break over the Christmas &amp; New Years holiday, and two homework problems that are due in January.\n\nFAQ\n\nWhat do I have to buy in order to participate in the course?\n\n\tNothing. All edX courses are free. \n\t\tThe lectures, homework, and lecture notes are all available online.\n\t\n\tWill certificates be awarded?\n\tYes. Online learners who achieve a passing grade in 8.EFTx will earn for free a certificate of mastery. \n\t\tThese certificates will indicate you have successfully completed the course, but will not include a specific grade. \n\t\tCertificates will be issued by edX under the name of MITx.\n\t\n\tWhat textbook do I need for the course?\n\tIn 8.EFTx readings will be mainly from a latex version of the lecture notes and freely available online arXiv research articles.\n\t\tOccasionally additional reading from commonly available quantum field theory textbooks will be suggested to supplement these free sources.\n\t\n\tWhen can I watch the lectures?\n\tYou can watch the lectures any time at your leisure.\n\t\n\tCan I register to the class after the start date has passed?\n\tYes, you can register at any time between the start date and the end date. \n\t\tTo obtain the certificate, however, you will have to get at least 60% of the total available points for the class.\n\t\n\tI don't have the prerequisites. Can I still take the course?\n\tWe do not check students for prerequisites, so you are certainly allowed to try. \n\t\tHowever, 8.EFTx does depend on experience with quantum field theory.\n\t\n\tWho can register for this course?\n\tUnfortunately, learners from Iran, Sudan, Cuba and the Crimea region of Ukraine will not be able to register for this course at the present time. \n\t\tWhile edX has received a license from the U.S. Office of Foreign Assets Control (OFAC) to offer courses to learners from Iran, Sudan and Cuba, our license does not cover this course. \n\t\tSeparately, EdX has applied for a license to offer courses to learners in the Crimea region of Ukraine, but we are awaiting a determination from OFAC on that application. \n\t\tWe are deeply sorry the U.S. government has determined that we have to block these learners, and we are working diligently to rectify this situation as soon as possible.\n\t\n\n\n                                    ", 
    "end_date": "2015-01-13T00:00:00Z", 
    "title": "8.EFTx: Effective Field Theory", 
    "price": 0, 
    "instructors": "Iain Stewart Saif Rayvan", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "10-14 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/effective-field-theory-mitx-8-eftx", 
    "duration": "17 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-09-16T00:00:00Z"
}