{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Mechanics ReView is a second look at introductory Newtonian Mechanics. It will give you a unified overview of mechanics that will dramatically increase your problem-solving ability. It is open to all students who meet the prerequisites (see right), but is especially designed for teachers and students who want to improve their existing understanding of mechanics.\n\nNewtonian mechanics is the study of how forces change the motion of objects. This course begins with force, and moves on to straight-line motion, momentum, mechanical energy, rotational motion, angular momentum, and harmonic oscillators. Optional units include planetary orbits and a unit whose problems require multiple concepts to be applied to obtain one solution.\n\nNOTE: New Section “Problem-solving Pedagogy”\n\nWe have developed a special approach to organizing the physics content knowledge and for applying it when solving problems.  This approach is called “Modeling Applied to Problem Solving” and has been researched carefully and has proven effectiveness for improving students’ performance in a later physics course on Electricity and Magnetism.\n\nIf you are a teacher looking to improve your knowledge of mechanics, or to learn new approaches to teach your students, we encourage you to sign up in the special teacher section featuring a discussion forum for teachers to discuss teaching ideas and techniques related to the topics discussed in this course.  To join these discussions,  verify yourself as a teacher, and we will sign you up in the teacher forum.\n\nNote that this forum is exclusively reserved for teachers, so please do not register if you are not a teacher.\n\nTeachers in the United States, and especially in Massachusetts, can receive extra benefit from this course. We offer Professional Development Points (PDPs) at no charge to teachers in Massachusetts who complete our course. If you are in a different state, we instead offer Continuing Education Units through the American Association of Physics Teachers. There is a fee for this certificate.\n\nCourse Syllabus\n\nNote: Taking this Course Involves Using Some Experimental Materials\n\nThe RELATE group that authors and administers this course is an education research group, dedicated to understanding and improving education, especially online.  We showed that 8.MReV generated slightly more conceptual learning than a conventionally taught on-campus course  - but we were unable to find exactly what caused this learning.   (So far this is the only published measurement of learning in a MOOC).  This summer we will be comparing learning from different types of online activities that  will be administerered to randomly assigned sub-groups of our students.  At certain points in the course, new vs. previously used sequences of activities will be assigned to different groups.  We will then use common questions to compare the amount learned. Which group receives the new activities will be switched so that neither group will have all new activities.\n\nOur experimental protocol has been approved by the MIT Committee on Use of Human Subjects.  As part of this approval we have the obligation to inform you about these experiments and to assure you that:\n\nWe will not divulge any information about you that may be identified as yours personally (e.g. a discussion post showing your user name). \n\tThe grade for obtaining a certificate will be adjusted downwards (from 60%) to compensate if one group has harder materials.\nNote: By clicking on the registration button, you indicate that you understand that everyone who participates in this course is randomly assigned to one of the groups described above. \n\nWelcome, and we hope you will both learn from and enjoy this course.\n\nFAQs\n\nIs there a required textbook?\n\nYou do not need to buy a textbook. All material is included in this edX course and is viewable online. If you would like to use a textbook with the course (for example, as a reference), most calculus-level books are suitable. Introductory physics books by Young and Freedman, Halliday and Resnick, or Knight are all appropriate (and older editions are fine).\n\n \n\nWhat if I take a vacation?\n\nThe course schedule is designed with this in mind! Course contents are released four weeks ahead of the deadline, so even if you have a four-week vacation, you do not need to miss any deadlines and can still complete all of the material.\n\n \n\nWill I get a certficiate?\n\nYes! This course awards certificates to all who satisfactorily complete the required portion of the course.\n\n \n\nHow are grades assigned?\n\nThere are three parts of the course that are worth points: Checkpoint problems that are folded in with the reading, Homework problems that come at the end of each unit, and Quizzes that are at the end of every 1-2 units. Each is worth a varying number of points, and you will not have to do every problem.\n\nThe course consists of 11 required units and three optional units. You do not need to complete the optional units in order to receive a certificate.\n\nThere is no final exam.\n\n                                    ", 
    "end_date": "2014-09-11T00:00:00Z", 
    "title": "8.MReVx: Mechanics ReView", 
    "price": 0, 
    "instructors": "David E. Pritchard and Colin Fredericks", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/mechanics-review-mitx-8-mrevx", 
    "duration": "15 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-05-29T00:00:00Z"
}