{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    The study of the night sky instilled wonder in our ancestors. Modern astronomy extends the human view to previously unexplored regions of space and time. In this course, you will gain an understanding of these discoveries through a focus on relativity—Einstein's fascinating and non-intuitive description of the physical world. By studying relativity and astronomy together, you will develop physical insight and quantitative skills, and you’ll regain a profound sense of wonder for the universe we call home.\n\n \n\nFAQ\n\nWhat topics will the course cover?\n\n\tSection One—Introduction\n\t\tSection Two—3, 2, 1 … Launching the journey into spacetime\n\t\tSection Three—Special relativity: from light to dark\n\t\tSection Four—General relativity: from flat to curved\n\t\n\t\n\tIs there a required textbook?\n\n\t\n\t\tNo textbook is required. Notes will be posted weekly. A list of supplemental resources, including textbooks, will be provided.​​\n\t\t\n\t\n\t\n\tWhat are the learning outcomes of this course?\n\n\t\n\t\tExplain the meaning and significance of the postulates of special and general relativity.\n\t\t\n\t\t\n\t\tDiscuss significant experimental tests of both special and general relativity.\n\t\t\n\t\t\n\t\tAnalyze paradoxes in special relativity.\n\t\t\n\t\t\n\t\tApply appropriate tools for problem solving in special relativity.\n\t\t\n\t\t\n\t\tDescribe astrophysical situations where the consequences of relativity qualitatively impact predictions and/or observations.\n\t\t\n\t\t\n\t\tDescribe daily situations where relativity makes a difference. \n\t\t\n\t\n\n\n                                    ", 
    "end_date": "2014-03-31T00:00:00Z", 
    "title": "ASTRO2290x: Relativity and Astrophysics", 
    "price": 0, 
    "instructors": "David F. Chernoff", 
    "institution_name": [
        "Cornell University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/relativity-astrophysics-cornellx-astro2290x", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-02-03T00:00:00Z"
}