{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Graphene is the world’s first 2-dimensional material and is the thinnest, strongest, and most flexible material known to exist. Graphene, a special form of carbon,,can conduct electricity and heat better than anything else. In this electronics course, we will introduce you to the exciting world of graphene science and technology. You will learn about the fundamentals of graphene and how this material offers new insights into nanotechnology and quantum physics. You will also learn about emerging practical applications for graphene. Topics covered include material properties, electronics, physics, physical chemistry, synthesis and device fabrication and application.\n\nGraphene offers a wealth of potential future applications; in composites, solar cells, sensors, superchargers, etc. The list is endless. This course takes a closer look at the particular potential graphene offers within electronics, e.g. optoelectronic devices using graphene produced via chemical vapor deposition (CVD), an industrially compatible technique.\n\nThis course content was developed at Chalmers University of Technology who is the coordinator of the Graphene Flagship, EUs biggest research initiative ever. At the Chalmers Graphene Centre research and industry cooperate in the field to achieve interplay and synergies.\n\nIn order to benefit fully from this course you should have an adequate knowledge of general physics and university level mathematics.\n\n                                    ", 
    "end_date": "2017-01-02T00:00:00Z", 
    "title": "ChM001x: Graphene Science and Technology", 
    "price": 0, 
    "instructors": "Jie Sun", 
    "institution_name": [
        "Chalmers University of Technology"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/graphene-science-technology-chalmersx-chm001x", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-10-31T00:00:00Z"
}