{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Energy is essential to life at many levels and its transformation from one form to another – whether in the cells of our bodies or the machines that enable modern society – is governed by the laws of thermodynamics.\n\nThis free online course provides you with an introduction to these laws, and the application of thermodynamics to both everyday examples and issues of global concern.\n\nAnyone interested in finding out more about the course can visit our Thermodynamics Facebook page\n\nThermodynamics, sustainability and nature’s limits\n\nOver five weeks, you will explore some of the challenges associated with energy supply and consumption. You will also perform simple experiments in your kitchen, to develop your appreciation of the significance of the laws of thermodynamics. These will help you discover new ways of thinking about energy, and how we use it and lose it.\n\nGaining new perspectives on the sustainable energy debate is an important skill you will develop, and this will help you to comprehend how we are limited by the laws of nature.  You will also discuss new research that explores the boundaries of these limitations.\n\nUnderstand thermodynamics with a global network of learners\n\nYou will learn with me, Eann Patterson, the AA Griffith Chair of Structural Materials and Mechanics at the University of Liverpool. I will bring my experience of teaching and lecturing in the UK, USA and China, and give you the chance to work alongside University of Liverpool undergraduates, who will be taking this online course as part of their degree course.\n\nIf you are interested in reading more before the course starts, you can find background information in Peter Atkin’s book “The Entropy Vector: Connecting Science and Business”, although this is not compulsory. You can also visit my blog.\n\nDevelop your skills or career as an engineer\n\nThe knowledge you gain from this course may prompt you to consider a career as a professional engineer.\n\nYou may even wish to take your learning further, with the University of Liverpool’s Mechanical Engineering or Aerospace Engineering degrees.\n\n\n                                    ", 
    "end_date": "2016-03-14T00:00:00Z", 
    "title": "Energy: Thermodynamics in Everyday Life", 
    "price": 0, 
    "instructors": "Eann Patterson", 
    "institution_name": [
        "University of Liverpool"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/energy?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-02-08T00:00:00Z"
}