{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    This is an Exploratorium teacher professional development course taught by Teacher Institute staff, open to any science teacher (particularly middle or high school level) and science enthusiast. This is a hands-on workshop that explores topics and strategies teachers can use to help their students become active investigators of light.\n\nWatch a preview video (copy and paste this link into your browser): https://youtu.be/fPvT_quBVIw\n\nThere are four weeks of course content, which require 2-4 hours per week. Each module builds upon the previous one, so we strongly suggest you follow the sequence we've outlined rather than skip ahead or do the course in less time. The course is designed to give you an opportunity to learn and share with others, not test what you know. There are weekly activity and reflection assignments, but these will not be graded. To receive credit for this course, you will need to complete the peer-reviewed final assignment.\n\nAs a participant, you will:\n- Watch videos that demonstrate natural phenomena and the Exploratorium's approach to teaching and learning \n- Conduct personal investigations by engaging in hands-on activities based in those phenomena\n- Reflect and share your experience doing activities\n- Discuss and identify challenges and opportunities for teaching\n- Devise a lesson of your own based on one or more of the activities\n\nEach week, we'll look at a different light-related topic: We will start by examining human visual perception, then take a brief historical tour of our evolving scientific understanding. We’ll also look at optics and optical instruments and finish by looking at the wave nature of light. \n\nTo get the most out of this experience, you'll have to try out some activities! In return, you'll get lots of valuable teaching resources, an in-depth understanding of the subject matter, and useful tips and techniques for the classroom.\n\nNOTE: This is a hands-on workshop, so you will need to buy or find materials. All of the materials required are inexpensive and should be easy to obtain, and we welcome substitutions! A separate list of materials is available for each activity.\n\n                                            Syllabus\n                        Introduction to Exploring Light Welcome to our course! This is a hands-on workshop designed for middle-school and high-school teachers and other people interested in teaching and learning about light. In this first week, we'll introduce you to our pedagogy at the Exploratorium Teacher Institute, which is about supporting educators to incorporate the hands-on, inquiry-based experiences of our museum into classrooms. We'll demonstrate exhibits and teach you how to do activities (which we call \"Science Snacks\") that explore and investigate natural phenomena, and you will need to gather your own materials to do experiments on your own. We hope you will share teaching tips and facilitation strategies with each other as well. We recommend you look through the materials below and follow the suggested course deadlines to get the most out of this experience. We also suggest you browse the discussion forums we've set up. To help you get started and find out who's in this course, please take a moment to introduce yourself in the forum. Please also fill out our pre-course survey, thanks!Week One: PerceptionWe don't just see with our eyes; our brain plays a big role in determining what we see. A huge percentage of the human brain is devoted to processing visual information, but we still can't make sense of everything going on around us, so we rely on certain \"shortcuts\" or tricks. In other words, your brain makes things up!This week, we're going to explore a few interesting visual shortcuts and some of the technologies that have been invented to take advantage of them.Your assignment is to watch the videos below, try some activities at home, and share your experience in the discussion forums.Collect data about your peripheral vision and compare with your classmatesShow off your afterimage designs for Bird in a CageTake pictures of your experiments with Colored ShadowsWe can't wait to see what you come up with!Week Two: History of Our Ideas About LightA historical timeline approach to studying light illustrates the importance of models to the advancement of science. Scientific models of light have changed over the years as more and better experiments were done. At the same time, an important skill as a teacher is choosing the simplest model to help a student towards understanding.This week, we'll revisit some famous experiments and different models of light to advance our own understanding.We'd like you to start off by reading the introductory essay below. Then, watch the video demonstrations and try some activities on your own. This week, we'd also like you to pick an activity or two to share with someone else.Don't forget to post photos, videos and comments in the discussion forum to share with your fellow students.Week Three: Optics and Image MakingThis week, we're exploring optics and how to make images with light. In addition to our exhibit and activity demonstrations, you'll learn how to put activities together into a lesson that helps students develop and test a mental model of how the world works. We want you to do this lesson as a learner and then reflect and discuss with your peers in the forum. The lesson is designed as a series of experiments, each one giving you a piece of information that lets you make a mental model. You'll be presented with several scenarios, asked to make a prediction (it's VERY important that you stop and do this at each stage of the video), and then we'll reveal what happens. You'll have an opportunity to revise and adjust your model at each stage.   For those of you taking this course for credit, we recommend you begin working on your peer-reviewed assignment.  If you want some feedback before you submit your assignment, we suggest you post questions and drafts of your lesson plan in the forum. Week Four: The Wave Nature of LightWhat is light? Sometimes we model it as a wave, sometimes as a particle. Light is light. Nevertheless, the wave properties of light lend themselves towards a rich array of experiments that help further our understanding.This is the final week of content for our course. Please continue to do activities this week, but also take a few moments to share what you learned, and any suggestions you have for us.If you are taking the course for a grade, please submit your final assignment and complete the required peer reviews before the deadline. We hope you have enjoyed this experience and that you'll come check out our museum in San Francisco!\n                                    ", 
    "end_date": "2016-06-26T00:00:00Z", 
    "title": "Exploring Light: Hands-on Activities and Strategies for Teachers", 
    "price": 0, 
    "instructors": "Paul Doherty, Eric Muller and Zeke Kossover", 
    "institution_name": [
        "Exploratorium"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/teach-light-color", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-29T00:00:00Z"
}