{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Science\n                                                                                                    &gt; Physics\n                                                            \n                            \n                                                \n                    \n                    \n                    What is gravity? This fundamental force is the common theme between concepts as intriguing as the Big Bang, black holes, dark energy, space-time, gravitational waves and the expansion of the Universe.\n\nIf these concepts pique your interest, this free online course is for you. It doesn’t require any background in physics or mathematics, just a simple curiosity about the Universe and our place in it.\n\nMark the 100th anniversary of Einstein’s prediction of gravitational waves\n\nThe theory of gravity, Einstein’s theory of relativity, was published in 1915. This course presents in a simple manner the main ideas behind this theory, before explaining why “gravity is the engine of the Universe.”\nOne year later, that is exactly 100 years ago, Einstein predicted the existence of gravitational waves.\n\nWe’ll find out:\n•\twhy the further you look, the more distant the past is; \n•\thow we can tell what happened just after the Big Bang;\n•\twhat the dark components of the Universe are;\n•\twhy we have been so impatiently expecting the discovery of gravitational waves\n•\tand what happens when you cross the horizon of a black hole.\n\nLearn with experts including a Nobel Prize-winning physicist\n\nOver six weeks, you’ll learn with Pierre Binétruy, the Director of the Paris Centre for Cosmological Physics at Paris Diderot University, as well as the cosmologist, George Smoot, who will explain the discovery that earned him the Nobel Prize for Physics in 2006.\n\n\n                                    ", 
    "end_date": "2016-06-20T00:00:00Z", 
    "title": "Gravity! From the Big Bang to Black Holes", 
    "price": 0, 
    "instructors": "Pierre Binétruy", 
    "institution_name": [
        "Paris Diderot University"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/gravity?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-09T00:00:00Z"
}