{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    La physique quantique est une théorie qui permet de décrire le comportement de la matière à l’échelle atomique et de comprendre la nature du rayonnement électromagnétique. Elle est aujourd’hui un élément incontournable pour tous ceux qui veulent comprendre la physique contemporaine. De nombreuses avancées technologiques ont été rendues possibles grâce à cette théorie, comme l’émission laser, l’imagerie médicale ou encore les nanotechnologies. Que vous soyez ingénieur, chercheur, étudiant ou amateur éclairé ayant soif de compréhension du monde scientifique moderne, la physique quantique fait aujourd’hui partie des connaissances indispensables à votre culture scientifique. Ce cours est une introduction à la physique quantique. Il vous permettra de maîtriser les éléments clés de cette théorie, comme la fonction d’onde et la célèbre équation de Schrödinger. Dans ce cours, la physique quantique vous sera présentée sur le plan théorique tout en gardant un lien étroit avec les expériences. Cela vous permettra de comprendre la réalité qui se cache derrière les équations et le formalisme mathématique. A l’issu de ce cours, vous serez donc en mesure d’en maîtriser les concepts de base, tant d’un point de vue théorique que d’un point de vue expérimental, ainsi que de vous en approprier le formalisme mathématique. Vous apprendrez également à résoudre des problèmes simples, que vous pourrez réutiliser dans d’autres contextes scientifiques.\n\n                                            Syllabus\n                        Semaine 1 : Introduction par l’expérience.Semaine 2 : Mécanique analytique.Semaine 3 : Premier et deuxième postulat. Fonction d’onde et équation de Schrödinger.Semaine 4 : Formalisme de Dirac.Semaine 5 : Troisième postulat. La mesure en physique quantique.Semaine 6 : Inégalité de Heinseberg.\n                                    ", 
    "end_date": "2016-05-30T00:00:00Z", 
    "title": "Introduction à la physique quantique - partie 1", 
    "price": 0, 
    "instructors": "Frédérika Augé-Rochereau and Davide Boschetto", 
    "institution_name": [
        "Université Paris-Saclay"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.fun-mooc.fr/courses/ENSTA/73001/session01/about", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-04-25T00:00:00Z"
}