{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Nuclear Magnetic Resonance (NMR) phenomenon is currently exploited for many purposes, including medical imaging using the MRI technique but also the characterization of the structure and the dynamics of matter at atomic scale by NMR spectroscopy, which is a key tool in chemistry, structural biology, pharmacology and material sciences. NMR is also employed for oil exploration or the inspection of artworks.This online course, entitled Nuclear Magnetic Resonance, a compass for the nanoworld, aims at providing students and professionals the basic knowledge about Nuclear Magnetic Resonance (NMR) and an overview of its applications. With the aim of developing the subject from the beginning, this course sets out the fundamental principles of NMR. At the end of the course, you will know about the commonly used NMR experiments and the interpretation of the NMR spectra of solutions and solids. This course will notably highlight the usefulness of NMR spectroscopy for the characterization of organic molecules, proteins, sugars and advanced materials.This course is intended for undergraduate and graduate students as well as educators and professionals who want to learn the basic concepts of NMR and discover its major applications. This multi-disciplinary course will appeal to students and professionals with background in chemistry, physics, material sciences, pharmacology, medicine and Earth sciences. .\n\n                                            Syllabus\n                        Week 1: Importance of NMR and the basic principles of NMR spectroscopy.Week 2: NMR experiment and 1H NMR of organic molecules in solution.Week 3: Probing covalent bonds and connectivities in organic molecules via J-couplings.Week 4: 13C NMR of organic molecules in solution.Week 5: 2D NMR of organic molecules in solution and NMR of proteins.Week 6: A practical work of liquid-state NMR and NMR of sugars.Week 7: Solid-state NMR and the structural study of glasses by NMR.Week 8: NMR of catalysts and batteries as well as a practical work of solid-state NMR.\n                                    ", 
    "end_date": "2016-01-11T00:00:00Z", 
    "title": "Nuclear Magnetic Resonance a Compass to Nanoworld", 
    "price": 0, 
    "instructors": "Olivier Lafon", 
    "institution_name": [
        "Université de Lille"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/lille1/54002/session01/about", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-11-16T00:00:00Z"
}