{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Ce cours vous introduit à la physique subatomique, c'est à dire à la physique du noyau et à celle des particules élémentaires. \n\nPlus spécifiquement les questions adressées sont les suivantes :\n- Quels sont les concepts de la physique des particules et comment sont-ils implémentés?\n- Quelles sont les propriétés du noyau atomique et comment peut on les utiliser?\n- Comment accélérer et détecter des particules et mesurer leurs propriétés?\n- Qu’est-ce qu’on apprend à partir des réactions de particules à haute énergie et leurs désintégrations?\n- Comment fonctionnent les interactions électromagnétiques et comment peut-on les mettre à contribution?\n- Comment fonctionnent les interactions fortes et pourquoi sont-elles difficiles à comprendre?\n- Comment fonctionnent les interactions faibles et pourquoi sont-elles spéciales?\n- Quelle est la masse des objets au niveau subatomique, et comment y intervient le Higgs?\n- Que peut-on apprendre de la physique des particules concernant l’astrophysique et l’Univers tout entier?\n\nLe cours est structuré en sept modules. Suivant le premier module qui introduit notre sujet, les modules 2 (Physique nucléaire) et 3 (Accélérateurs et détecteurs) dépendent peu du reste du cours et peuvent être étudiés séparément. Les modules 4 à 7 approfondissent les notions de la matière et des forces élémentaires.\n\n                                            Syllabus\n                        Matière et forces, mesurer et compterPendant ce premier module on introduira notre sujet en faisant le tour des objets de la physique des particules, c’est à dire la matière, les forces et l’espace-temps. On discutera aussi comment on définit l’intensité d’une interaction entre particules, par le biais de la section efficace, qui est une notion centrale de la physique des particules. A la fin de ce module, on visitera les travaux pratiques nucléaires de l’UniGe pour voir l'expérience Rutherford.Physique nucléairePendant ce deuxième module on parle de la physique du noyau atomique et de ses applications. On visitera les travaux pratiques nucléaire de l’UniGe pour voir les expériences sur la radioactivité. A la fin du module, on visitera un réacteur expérimental à fusion et une centrale nucléaire.Accélérateurs et détecteursDans ce module, on va toucher les bases de la physique des accélérateurs et des méthodes de détection pour les particules. On passera en revue les principes de l'accélération et focalisation de particules chargées par les champs électromagnétiques. On verra comment ces principes sont appliqués dans les accélérateurs et anneau de stockage modernes. Vous serez introduit aux processus physiques qui permettent de détecter les différents types de particules et comment ils sont utilisé dans des détecteurs modernes. Interactions électromagnétiques Pendant ce module on discute les interactions électromagnétiques, via l'échange de photons entre particules chargées électriquement. Vous vous rappellerez comment une réaction est décrite par sa section efficace. Vous en saurez plus sur la relation entre cette quantité et les digrammes de Feynman. Comme la matière consiste en fermions, on introduira le spin, mais d'une manière peu formelle. Vous comprendrez mieux les propriétés de quelques réactions exemplaires, comme la diffusion Compton et l'annihilation électron-positron, que vous avez déjà rencontré dans le module 3. Hadrons et interactions fortesDans ce cinquième module vous verrez comment les expériences de diffusion – typiquement utilisant des photons virtuels comme sonde – nous renseignent sur la structure interne des hadrons. Vous apprécierez le rôle des quarks dans la formation de baryons et mesons. Vous comprendrez mieux la notion de la charge couleur et les propriétés des gluons qui transmettent la force forte. Vous verrez comment cette force emprisonne les quarks à l'intérieur de leurs états liés. Et comment par conséquent les quarks fortement secoués (ou crées en paires dans le vide) se transforment en gerbes de hadrons appelés jets. Interactions électro-faiblesPendant ce module on approfondit notre discussion des forces en y rajoutant les forces faibles. Vous comprendrez mieux la relation entre particules et antiparticules, moyennant les transformation de conjugaison de charge et de parité. Vous rencontrez les charges faibles et les bosons qui transmettent la force faible. A travers quelques réaction exemplaires, vous apprécierez les spécificités de la force faible et sa relation avec la force électromagnétique. Vous rencontrez les propriétés fascinantes des neutrinos. Et vous serez libéré d'un de vos préjugés, qui dit probablement que la masse des quarks et leptons est une de leurs propriétés intrinsèques. Matière et énergie sombre Dans ce dernier module vous rencontrez la matière sombre, qui ne se manifeste que par son action gravitationnel. Vous verrez comment l'énergie sombre accélère l'expansion de notre univers. Vous apprécierez les indices observationnels qui nous démontrent l'existence de ces phénomènes mystérieuses. Et on discutera avec une spécialiste du domaine la nouvelle physique qui pourrait se cacher derrière et qui reste à découvrir. \n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Physique des particules - une introduction", 
    "price": 0, 
    "instructors": "Martin Pohl and Mercedes Paniccia", 
    "institution_name": [
        "University of Geneva"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/physique-particules", 
    "duration": "7 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}