{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    This course introduces the basics of Digital Signal Processing and computational acoustics, motivated by the vibrational physics of real-world objects and systems. We will build from a simple mass-spring and pendulum to demonstrate oscillation, learn how to simulate those systems in the computer, and also prove that these simple oscillations behave as a sine wave. From that we move to plucked strings and struck bars, showing both solutions as combined traveling waves and combined sine wave harmonics. We continue to build and simulate more complex systems containing many vibrating objects and resonators (stringed instruments, drum, plate), and also learn how to simulate echos and room reverberation.  Through this process,  we will learn about digital signals, filters, oscillators, harmonics, spectral analysis, linear and non-linear systems, particle models, and all the necessary building blocks to synthesize essentially any sound. The free open-source software provided will make it possible for anyone to use physical models in their art-making, game or movie sound, or any other application.\n\n                                            Syllabus\n                        Session 1: The Time Domain: Sound, Acoustics, Digital Audio, Noise Vs. Pitch a) Digital Audio, Sampling, Quantization, Aliasing b) Soundfiles, Wavetables, Manipulating PCM c) Pitch (vs. Noise), Spectral Analysis 0.1 d) Time-domain Pitch/Noise Detection: ZeroXings, Autocorrelation, AMDF\r\nSession 2: Physics, Oscillators, Sines &amp; Spectra, Spectral/Additive Synthesis a) Mass-Spring-Damper system, also simple Pendulum b) Fourier analysis/synthesis, Spectrum Analysis 1.0 c) More on additive Sine-wave synthesis\r\nSession 3: Digital Filters, Modal Synthesis a) Linearity, Time-invariance, Convolution b) Digital Filters, Finite Impulse Response (FIR) c) Infinite Impulse Response (IIR) Digital Filters c’) Special Guest: Julius O. Smith III, Digital Filters are Awesome! d) BiQuad Resonator Filter, Modal Synthesis\r\nSession 4: Physical Modeling Synthesis I: 1D Systems a) 1-D systems, Strings, Modal (Fourier) Solution b) Strings II: Waveguide (D’Alembert) Solution c) 1-D systems, Bars, Tubes, solutions d) Advanced Waveguide Synthesis for 1-D systems\r\nSession 5: Physical Modeling II: 2 And 3-D Systems a) 2-D systems, plates, drums, higher-order modes Fourier (Sine and/or Modal) Solutions, Waveguide Solutions b) 3-D systems, rooms, resonators, Waveguide synthesis c) Resonator/Modal view and solution of 3-D systems Pop bottles and other lumped resonators\r\nSession 6: Advanced Physical Modeling a) Non-Linearity, Models for Synthesis b) Stiffness, All-Pass Filters, Banded Waveguides c) Commuted Synthesis c') Special Guest Star: JULIUS, Strings and MoForte d) Gnarly Geometries, Modes and Models e) Scanned Synthesis\r\nSession 7: Particles And Statistical Models a) Formant Wave Functions (FOFs) and Wavelets b) Granular Synthesis c) Particle Models, Statistical Modal Synthesis\r\nSession 8: Even More Synthesis Methods a) Voice Synthesis: Formants and Formant Synthesizers b) Linear Prediction c) FM Synthesis: Horns, Bells, Voices Waveshaping Synthesis, Distortion Modeling\r\nSession 9: Tying It All Together: Synthesis Applications And Control a) Controlling Modal Synthesis (Wii, TouchOSC, more) b) Walking Synthesis, a complete system c) Procedural Audio: Driving synthesis from process, game state, etc.\n                                    ", 
    "end_date": "2016-05-04T00:00:00Z", 
    "title": "Physics-Based Sound Synthesis for Games and Interactive Systems", 
    "price": 0, 
    "instructors": "Perry R. Cook and Julius O. Smith III", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.kadenze.com/courses/physics-based-sound-synthesis-for-games-and-interactive-systems-ii/info", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Kadenze"
    ], 
    "start_date": "2016-03-02T00:00:00Z"
}