{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    In questo corso, imparerete i principi alla base della fisica contemporanea e come essa abbia cambiato la nostra visione del mondo e la nostra vita quotidiana. Dalla teoria della relatività e dalla meccanica quantistica, infatti, sono nate molte tecnologie che usiamo ogni giorno, dai dispositivi elettronici al GPS.\nScoprirete come Einstein, Heisenberg e altri giganti della scienza hanno messo in discussione il mondo di Galileo e Newton, regalandoci un'idea della natura totalmente nuova. Per farlo, non saranno necessarie grandi conoscenze di fisica o matematica. I concetti fondamentali della fisica moderna possono essere compresi con il ragionamento e l'osservazione dei dati. Grande importanza, dunque, sarà data agli esperimenti che hanno fatto avanzare la ricerca. Video e simulazioni vi aiuteranno nella comprensione dei concetti più complessi, su cui gli stessi scienziati si interrogano tuttora. Gli studenti esperti, invece, potranno riflettere sugli aspetti che l'approccio puramente matematico alla descrizione dei fenomeni spesso nasconde. Alla fine del corso, avrete acquisito le conoscenze fondamentali della fisica moderna, le cui scoperte hanno influenzato la cultura anche al di là del pensiero scientifico. Il corso si svolge in italiano.\n\nThis course will focus on the principles of contemporary physics, that is, relativity and quantum mechanics. Such theories have changed our vision of the world and our daily life. Many current technologies, ranging from electronic devices to the Global Positioning System, are based on relativity and quantum mechanics.\nDuring the course, you will learn how Einstein, Heisenberg and other giants of physics have revolutioned the world inherited from Galileo and Newton, providing us with an entirely novel conception of nature, from elementary particles to galaxies. To achieve this goal, special skills in physics or math are not required. Fundamental concepts of modern physics can be understood by simple arguments and empirical observations. During the course, the main experiments that pushed modern physics forward will be described and explained. Videos and simulations will help you in understanding most complex concepts , still debated by scientists. The experimented learner will explore those aspects that are often hidden by a purely mathematical approach. At the end of the course, you will gain a basic knowledge of modern fundamental physics, whose impact goes well beyond scientific thought. This course is taught in Italian.\n\n                                            Syllabus\n                        Introduzione al corsoBenvenuti! In questa prima settimana presenteremo l'organizzazione del corso e faremo il punto della situazione: scopriremo a che punto era la fisica all'inizio del XX secolo. Tutto sembrava già noto, grazie alle teorie di Maxwell e Newton. Ma qualcosa invece non tornava. In più, avrete la possibilità di richiamare alcuni concetti base di matematica, che possono esservi utili (ma non indispensabili) per una migliore comprensione delle leggi fisiche che incontreremo nel corso. Buon lavoro.La teoria della Relatività SpecialeQuesta settimana incontreremo la teoria della relatività. Galileo aveva già capito che la velocità dipende da chi la misura e che due sistemi di riferimento inerziali devono obbedire alle stesse leggi. Ma non tutte le leggi della fisica sembravano coerenti con questo principio. Einstein, basandosi sugli esperimenti sulla velocità della luce e su alcuni semplici ragionamenti, scoprì che anche il tempo e lo spazio sono relativi. Oltre ai video delle lezioni, potrai assistere a un approfondimento sull'esperimento di Michelson e Morley del 1887, che dimostrò che la velocità della luce era la stessa per tutti gli osservatori. Nel laboratorio virtuale, potrai ripetere l'esperimento di Michelson e Morley e osservare il fenomeno della dilatazione temporale, una delle conseguenze più sorprendenti della teoria di Einstein.E=mc² e la Relatività GeneraleEccoci giunti alla teoria della Relatività Generale. Riflettendo sui sistemi non inerziali, Einstein scopre un altro modo per spiegare la gravità: è la massa che piega lo spazio e il tempo e determina la traiettoria dei corpi. Questo spiega alcuni fenomeni altrimenti oscuri: per esempio, come mai la luce non sempre va in linea retta?Gli inizi della meccanica quantisticaEccoci alla quarta settimana del corso. La teoria dell'elettromagnetismo sembrava perfetta. Ma qualcosa ancora non tornava. Furono Plank e Einstein (sempre lui!) a capire che quelle anomalie nascondevano una realtà molto più complessa, in cui le onde luminose si possono comportare come particelle e viceversa. Bohr e de Broglie poi aggiunsero altri \"mattoni\" alla costruzione della teoria. Nacque così la \"meccanica quantistica\". Nel laboratorio virtuale, si potrà osservare l'effetto fotoelettrico e ripetere il ragionamento con cui Einstein giunse a formulare l'ipotesi del fotone.Onde e particelleNella quinta settimana, scopriremo che i corpi, secondo la meccanica quantistica, non hanno più una velocità e una posizione ben definite, come accadeva nella meccanica classica. Per la meccanica quantistica, le particelle sono descritte da \"onde di probabilità\". Dunque, come le onde quando si incontrano, anche le particelle possono provocare o subire fenomeni come l'interferenza e la diffrazione.L’esperimento delle due fenditureQuesta settimana studieremo l'esperimento delle \"due fenditure\". È un esperimento che i fisici effettuano sin dai primi dell'ottocento. Con questo esperimento si può dimostrare che la materia, in certe condizioni, si comporta in modo simile alle onde. Ma si tratta di \"onde di probabilità\". Il risultato della misure di laboratorio, dunque, è \"casuale\", ma continua a seguire leggi fisiche ben precise. Un esperimento virtuale, infine, permetterà di osservare l'effetto tunnel quantistico.Il paradosso EPRQuesta settimana, scopriremo che non tutti i fisici erano soddisfatti della teoria della meccanica quantistica. In particolare Einstein e alcuni suoi colleghi ritenevano che la meccanica quantistica fosse \"incompleta\" e idearono un esperimento mentale per dimostrarlo. Così studiarono per primi il fenomeno dell'\"entanglement\", in cui le particelle quantistiche sembrano comunicare istantaneamente a distanza. Era davvero possibile? Einstein pensava di no.John Bell e la non località della realtàIn quest'ultima risolveremo l'enigma sollevato da Einstein, Podolski e Rosen. Il dibattito sorto intorno al cosiddetto \"paradosso EPR\" condusse i fisici a riesaminare i fondamenti della meccanica quantistica. Il fisico irlandese John Bell concluse che i fenomeni bizzarri della meccanica quantistica non potevano essere ricondotti ad alcuna teoria classica, se non ammettendo che \"qualcosa\" si potesse propagare a distanza istantaneamente. Ma questo sembrava contraddire i principi della relatività di Einstein.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Relatività e Meccanica Quantistica: concetti e idee", 
    "price": 0, 
    "instructors": "Carlo Cosmelli", 
    "institution_name": [
        "Sapienza University of Rome"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/relativita-meccanica-quantistica", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}