{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    This introductory physical chemistry course examines the connections between molecular properties and the behavior of macroscopic chemical systems.\n\n                                            Syllabus\n                        Module 1This module includes philosophical observations on why it's valuable to have a broadly disseminated appreciation of thermodynamics, as well as some drive-by examples of thermodynamics in action, with the intent being to illustrate up front the practical utility of the science, and to provide students with an idea of precisely what they will indeed be able to do themselves upon completion of the course materials (e.g., predictions of pressure changes, temperature changes, and directions of spontaneous reactions). The other primary goal for this week is to summarize the quantized levels available to atoms and molecules in which energy can be stored. For those who have previously taken a course in elementary quantum mechanics, this will be a review. For others, there will be no requirement to follow precisely how the energy levels are derived--simply learning the final results that derive from quantum mechanics will inform our progress moving forward. Homework problems will provide you the opportunity to demonstrate mastery in the application of the above concepts. Module 2This module begins our acquaintance with gases, and especially the concept of an \"equation of state,\" which expresses a mathematical relationship between the pressure, volume, temperature, and number of particles for a given gas. We will consider the ideal, van der Waals, and virial equations of state, as well as others. The use of equations of state to predict liquid-vapor diagrams for real gases will be discussed, as will the commonality of real gas behaviors when subject to corresponding state conditions. We will finish by examining how interparticle interactions in real gases, which are by definition not present in ideal gases, lead to variations in gas properties and behavior. Homework problems will provide you the opportunity to demonstrate mastery in the application of the above concepts. Module 3This module delves into the concepts of ensembles and the statistical probabilities associated with the occupation of energy levels. The partition function, which is to thermodynamics what the wave function is to quantum mechanics, is introduced and the manner in which the ensemble partition function can be assembled from atomic or molecular partition functions for ideal gases is described. The components that contribute to molecular ideal-gas partition functions are also described. Given specific partition functions, derivation of ensemble thermodynamic properties, like internal energy and constant volume heat capacity, are presented. Homework problems will provide you the opportunity to demonstrate mastery in the application of the above concepts. Module 4This module connects specific molecular properties to associated molecular partition functions. In particular, we will derive partition functions for atomic, diatomic, and polyatomic ideal gases, exploring how their quantized energy levels, which depend on their masses, moments of inertia, vibrational frequencies, and electronic states, affect the partition function's value for given choices of temperature, volume, and number of gas particles. We will examine specific examples in order to see how individual molecular properties influence associated partition functions and, through that influence, thermodynamic properties. Homework problems will provide you the opportunity to demonstrate mastery in the application of the above concepts. Module 5This module is the most extensive in the course, so you may want to set aside a little extra time this week to address all of the material. We will encounter the First Law of Thermodynamics and discuss the nature of internal energy, heat, and work. Especially, we will focus on internal energy as a state function and heat and work as path functions. We will examine how gases can do (or have done on them) pressure-volume (PV) work and how the nature of gas expansion (or compression) affects that work as well as possible heat transfer between the gas and its surroundings. We will examine the molecular level details of pressure that permit its derivation from the partition function. Finally, we will consider another state function, enthalpy, its associated constant pressure heat capacity, and their utilities in the context of making predictions of standard thermochemistries of reaction or phase change. Homework problems will provide you the opportunity to demonstrate mastery in the application of the above concepts. Module 6This module introduces a new state function, entropy, that is in many respects more conceptually challenging than energy. The relationship of entropy to extent of disorder is established, and its governance by the Second Law of Thermodynamics is described. The role of entropy in dictating spontaneity in isolated systems is explored. The statistical underpinnings of entropy are established, including equations relating it to disorder, degeneracy, and probability. We derive the relationship between entropy and the partition function and establish the nature of the constant β in Boltzmann's famous equation for entropy. Finally, we consider the role of entropy in dictating the maximum efficiency that can be achieved by a heat engine based on consideration of the Carnot cycle. Homework problems will provide you the opportunity to demonstrate mastery in the application of the above concepts. Module 7This module is relatively light, so if you've fallen a bit behind, you will possibly have the opportunity to catch up again. We examine the concept of the standard entropy made possible by the Third Law of Thermodynamics. The measurement of Third Law entropies from constant pressure heat capacities is explained and is compared for gases to values computed directly from molecular partition functions. The additivity of standard entropies is exploited to compute entropic changes for general chemical changes. Homework problems will provide you the opportunity to demonstrate mastery in the application of the above concepts. Module 8This last module rounds out the course with the introduction of new state functions, namely, the Helmholtz and Gibbs free energies. The relevance of these state functions for predicting the direction of chemical processes in isothermal-isochoric and isothermal-isobaric ensembles, respectively, is derived. With the various state functions in hand, and with their respective definitions and knowledge of their so-called natural independent variables, Maxwell relations between different thermochemical properties are determined and employed to determine thermochemical quantities not readily subject to direct measurement (such as internal energy). Armed with a full thermochemical toolbox, we will explain the behavior of an elastomer (a rubber band, in this instance) as a function of temperature. Homework problems will provide you the opportunity to demonstrate mastery in the application of the above concepts. The final exam will offer you a chance to demonstrate your mastery of the entirety of the course material. Final ExamThis is the final graded exercise (20 questions) for the course. There is no time limit to take the exam.\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "Statistical Molecular Thermodynamics", 
    "price": 0, 
    "instructors": "Christopher J.  Cramer", 
    "institution_name": [
        "University of Minnesota"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/statistical-thermodynamics", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}