{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    ¿Sabes cómo vuelan los aviones, tan pesados y no se caen mientras vuelan? \n¿Sabes que viajamos por el espacio sobre el planeta Tierra que se traslada y gira muy rápido y no lo percibimos?\n¿O acaso, notas efectos de su movimiento?\n¿Cuál es nuestro lugar en el universo?\n¿Podemos viajar en el tiempo?\n\n¡Preguntas, muchas preguntas! Con espíritu de descubridores nuestra curiosidad nos motiva a buscar respuestas, a explorar nuestro entorno, a entrar a lo desconocido y hallar nuevo conocimiento.\n\nRecibimos como verdaderos tesoros las contribuciones de quienes nos antecedieron en la aventura que es la ciencia, la física en particular. Asociamos estos tesoros a los científicos que los hallaron. Conociendo a los descubridores, los conocimientos de la física se tornan más humanos. Nos ubicamos en lo que era el pensamiento de sus contemporáneos para contrastar y reconocer lo extraordinario de sus logros innovadores, cómo impactaron en su momento, y luego tomando distancia, valoramos qué efecto han tenido como resultados notables, que trascienden su época y perduran hasta nosotros y tal vez hasta tiempos lejanos en el futuro.\n\nCon este curso para amantes de la ciencia, sin requisitos previos, adquieres una mejor imagen y perspectiva del universo, de su orden, del cosmos, formas de pensar, principios fundamentales para comprender mejor lo que existe, incluso para maravillarnos con nuestra propia existencia. \n\nObjetivos de aprendizaje:\n•\tReconocer y nombrar cuáles han sido los más destacados descubrimientos en la comprensión del universo físico desde la revolución científica de los siglos XVI y XVII hasta el final del siglo XIX, y cómo se llegó a encontrar este conocimiento.\n•\tAsociar los conocimientos de la física a los científicos quienes hicieron los descubrimientos, a la época y al pensamiento establecido en el entorno en que vivieron estos personajes.\n•\tIdentificar el impacto de los descubrimientos en la época de los científicos protagonistas, cuando hicieron sus contribuciones; y pensar críticamente sobre la trascendencia de este impacto hasta nuestros días.\n•\tFormar y construir una imagen informada de lo maravilloso que es el universo físico, el cosmos del cual somos parte.\n•\tDescubrir nuevas formas de pensar sobre el mundo a nuestro alrededor, reconociendo la belleza intrínseca de las leyes y principios físicos, que hacen posible nuestra existencia. \n•\tEncontrar la motivación para continuar enriqueciendo nuestro conocimiento sobre el universo físico, sobre la labor activa de los científicos en su investigación y sobre su impacto en nuestra vida cotidiana.\n\nPrerrequisitos:\nNo hay requisitos previos especiales para este curso, aunque es de utilidad tener una formación escolar básica. Sólo necesitas una actitud positiva y disposición para adquirir nuevo conocimiento enriquecedor en la cultura, no por la utilidad inmediata de adquirir una nueva destreza práctica, sino… ¡simplemente por el gusto y el placer de conocer mejor el universo y las leyes físicas fundamentales, por las cuales es posible que nosotros los humanos existamos!\n\nMaterial suplementario:\nTodos los videos y textos que encontrarás han sido desarrollados por el profesor, especialmente para este curso. Los materiales complementarios utilizados son de dominio público que puedes consultar a través del Internet, como por ejemplo páginas web “abiertas” donde encontrarás resultados científicos de la NASA, del CERN, etc.\n\n                                            Syllabus\n                        Introducción a los Tesoros y sus DescubridoresCon espíritu de descubridores nuestra curiosidad nos motiva a buscar respuestas, a explorar nuestro entorno, a entrar a lo desconocido y hallar nuevo conocimiento. Recibimos como verdaderos tesoros las contribuciones de quienes nos antecedieron en la aventura que es la ciencia, la física en particular. Asociamos estos tesoros a los científicos que los hallaron. Conociendo a los descubridores, los conocimientos de la física se tornan más humanos. Nos ubicamos en lo que era el pensamiento de sus contemporáneos para contrastar y reconocer lo extraordinario de sus logros innovadores, cómo impactaron en su momento, y luego tomando distancia, valoramos qué efecto han tenido como resultados notables, que trascienden su época y perduran hasta nosotros y tal vez hasta tiempos lejanos en el futuro.Revolución Científica - Parte I (Primero las leyes del Cielo)Ya hemos tenido un primer acercamiento a esos grandes pensadores griegos que generaron un gran impacto en los temas de la física moderna y que de alguna manera están presentes y establecen ese conocimiento que contextualiza a Nicolás Copérnico, uno de los descubridores que estudiaremos en este segundo módulo. Así les damos la bienvenida al módulo 2: La Revolución Científica - Parte I (siglos XVI y XVII), donde primero estudiaremos las \"leyes del cielo\".Los personajes que marcarán esta primera parte de la Revolución científica son Nicolás Copérnico (1473 – 1543), Tycho Brahe (1546 – 1601) y Johannes Kepler (1571 – 1630). Los hechos se darán en varios países de Europa central y también en Italia. El objetivo es reflexionar sobre nuestra ubicación en el cosmos, nuestra importancia en él y así comprender el firmamento y lo que en él observamos.Revolución Científica - Parte II (Unificación de las leyes del Cielo y de la Tierra)En el módulo anterior estudiamos las leyes del cielo y ahora estudiaremos las leyes universales, con lo que les damos la bienvenida a la segunda parte de la Revolución Científica. ¡Bienvenidos al módulo 3! Esta vez los descubridores son Galileo Galilei (1564-1642) e Isaac Newton (1642 – 1727). Las acciones se desarrollan en Italia y al norte de Europa, en el Reino Unido (Inglaterra). El objetivo es reflexionar sobre el conocimiento establecido en la época de Nicolás Copérnico y la veracidad de sus ideas revolucionarias, a través de la búsqueda de Galileo de pruebas y sus descubrimientos con el telescopio, para culminar después esta época de la revolución científica gracias a las contribuciones de Isaac Newton.El conocimiento en época de la Revolución Industrial (átomos en perpetuo movimiento)El progreso nace en la época de Newton, cuando la gente reconoció que la física de esta época era aplicable a diferencia de la física de Aristóteles. Es entonces cuando la actitud de los seres humanos cambió, se volvieron amos y señores de la tierra y se les olvidó que son parte del planeta, más no dueños del universo. Ese cambio de actitud llevó a la era de la ilustración, el siglo de las luces, el siglo XVIII. Así arribó el tiempo del progreso, esto significa que cada generación actual vive mejor que la anterior, algo que antes no ocurría. Con la llegada del progreso y del despertar de una nueva actitud en la humanidad se conoce la máquina de vapor, los ferrocarriles y la industrialización. Es aquí donde se empieza hablar de energía, ¿Cómo funcionan las máquinas?. Este y otro interrogantes permiten que se descubran las leyes de la naturaleza, las leyes de la energía y la entropía .\n\nEn el estudio de la Energía (se conserva) y la Entropía (del universo siempre aumenta). Los científicos que estudiaremos están actuando desde 1750 hasta 1900 y son el Conde Rumford (1756 – 1814), James Prescott Joule (1818 – 1889), Julius Robert Mayer (1814 – 1878), Hermann von Helmholtz (1821 – 1894), Daniel Bernoulli (1700 – 1782), Sadi Carnot (1796 – 1832), Lord Kelvin (1824 – 1907), Rudolf Clausius (1822 – 1888), Josiah Willard Gibbs (1839 – 1903), James Clerk Maxwell (1831 – 1879), Ludwig Boltzmann (1844 – 1906). Los lugares donde se realiza la acción son el Reino Unido (Inglaterra) al Norte en Europa; Francia, Alemania, Austria, Suiza en Europa Central, y Estados Unidos en NorteaméricaUnificación de la electricidad, el magnetismo y la luzDespués de estudiar la Energía y la Entropía, naturalmente llegamos a la unificación de electricidad, magnetismo y luz, que será el tema de este, el módulo cinco. Los descubridores que estudiaremos están actuando desde 1750 hasta 1900 y son Hans Christian Oersted (1777 – 1851), André Marie Ampère (1775 – 1836), Michael Faraday (1791 – 1867), James Clerk Maxwell (1831 – 1879), Heinrich Hertz (1857 – 1894), Guglielmo Marconi (1874 – 1937), Thomas Alva Edison (1847 – 1931), Nikola Tesla (1856 – 1943). Los lugares donde se realiza la acción son Dinamarca, Alemania, Francia e Italia en Europa Central; el Reino Unido (Inglaterra, Escocia) al Norte de Europa; y Estados Unidos en Norteamérica.Conclusiones del cursoEn el módulo anterior estudiamos la unificación de la electricidad, el magnetismo y la luz, y así, naturalmente llegamos a la pregunta ¿de qué está hecha la electricidad? Este aspecto tan interesante es el que nos atañe en este módulo, y que nos lleva a la fascinante búsqueda de la naturaleza de la electricidad. Veremos cómo los experimentos que hicieron los descubridores buscando los constituyentes de la corriente eléctrica los llevaron inesperadamente a una serie de hallazgos maravillosos como los rayos x, la radioactividad, y el electrón. Con esta invitación a reflexionar sobre la física mirando hacia el futuro, cerraremos el curso, no sin antes invitarlos a continuar la exploración de la naturaleza y el estudio de esta ciencia maravillosa.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Tesoros de la Física y sus Descubridores I", 
    "price": 0, 
    "instructors": "Bernardo Gómez", 
    "institution_name": [
        "Universidad de los Andes"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/tesoros-de-la-fisica", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}