{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Этот курс для тех, кто изучал физику в школе или в университете, пусть даже почти ничего при этом не понял, но желал бы все-таки понять; для тех, кто любознателен, кому интересно, как устроен и по каким правилам существует Вселенная, в которой мы живем, и природа, которая нас окружает; для тех, кто собирается в будущем заняться любой творческой работой, требующей кроме прочего хорошего логического анализа. \n\nВ результате прохождения курса вы узнаете многое о том, как устроен и по каким объективным законам существует наш Мир, и какими способами мы можем проникать в тайны его законов и использовать их на практике. Вы узнаете, как отличить действительные знания от мнимых, научитесь отличать псевдознания от “уфологов”, “экстрасенсов” и прочих от подлинного знания, основанного на логике и общих представлениях о принципах организации нашего Мира, заложенных Природой и/или Создателем. Вы сможете продолжить изучение проекта «Физика» на действительно глубоком уровне в последующих модулях нашего курса.\n\nЧто надо знать и уметь, чтобы приступить к изучению этого курса?\n•\tНачальные знания по физике в рамках школьного курса, пусть даже и не слишком твердо усвоенные\n•\tУмение логически мыслить, складывать “два и два”, делать выводы из предпосылок.\n•\tИметь достаточные знания по математике в рамках школьного курса.\n\nПри успешном прохождении курса вы получите сертификат, который будет позитивно оценен и учтен при поступлении, например, в магистратуру технического профиля. Кроме этого сертификат подтвердит наличие у Вас не только физико-математической подготовки, но и наличие развитых способностей к логическому анализу, что высоко ценится умными работодателями, независимо от профиля работы.\n\n                                            Syllabus\n                        Физика от Аристотеля до НьютонаОсновные принципы и подходы глобального проекта \"Физика\"Обобщенная механикаПервая полноценная успешная теорияКонкретная механика“Нет ничего практичнее хорошей теории” От механики к тепловым явлениямПервая полноценная успешная теорияСтатистическая физикаКак Бог играет в костиПоля и волныОткуда у природы берутся силы?Квантовая физикаНовая физика 20-го векаФизика высоких энергийТак как же все-таки устроен этот мир?\n                                    ", 
    "end_date": "2016-08-10T00:00:00Z", 
    "title": "Физика как глобальный проект", 
    "price": 0, 
    "instructors": "Ольчак Андрей Станиславович", 
    "institution_name": [
        "National Research Nuclear University MEPhI"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/physics-global-project", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-15T00:00:00Z"
}