{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Наглядно – интересно – просто – понятно!\nДанный курс представляет собой серию физических опытов, в которых наглядно объясняются основные законы волновой оптики. Демонстрацию физических явлений проводит незаурядный человек, преподаватель, доцент кафедры общей физики НИЯУ МИФИ — Валериан Иванович Гервидс, глубокие знания и огромный преподавательский опыт которого делает курс «Физика в опытах. Часть 4. Волны и оптика» уникальным.\n\nЗачем учить этот курс?\n• Физика – наука экспериментальная. Лучше один раз увидеть, чем сто раз услышать или прочитать! \n• Именно эксперименты позволяют продемонстрировать и легко понять и простые, и сложные аспекты, которые традиционно преподаются в виде теоретического материала и математических моделей\n• Курс поможет Вам научиться использовать: \n   o эксперимент как способ постановки вопроса, \n   o эксперимент как инструмент изучения физического явления\n   o эксперимент как  форму ответа на вопрос\n• Очень часто достаточно «простые» физические вопросы имеют неожиданные ответы, которые зависят от конкретных условий проведения эксперимента. Демонстрация таких опытов и объяснение полученных в них результатов могут оказаться чрезвычайно интересными\n• Вы сможете увидеть применение изучаемых физических явлений в жизни, в технике и в быту\n• Изучая этот курс, вы восполните нехватку времени на экспериментальную, «живую» физику, которая ощущается в обычном учебном процесс\n\nЧему учит этот курс?\n• Пониманию широкого круга как простых, так и сложных физических явлений и процессов по тематике соответствующих разделов\n• Применению физических закономерностей для анализа различных физических явлений и процессов \n• Навыкам  использования эксперимента\n• Базовым знаниям по физике будущих инженеров и специалистов в различных областях деятельности.\n\nДля кого этот курс?\n• Для тех, кто изучает физику, и хочет прояснить для себя различные вопросы (в школе, в вузе)\n• Для тех, кто преподает физику (в школе, в вузе)\n• Для тех, кто использует физику в своем рабочем процессе (инженеры, программисты и т.д.)\n• Для тех, кому это просто интересно\n\n                                            Syllabus\n                        Модели волн. Скорость светаПервый модуль посвящен моделям волн и нахождению скорости света. Мы вспомним, что такое волны, какими они бывают. А модели волн вы и увидите в наших опытах.Поляризация волнВ этом модуле рассмотрены 10 опытов, посвященных поляризации волн. С помощью серии опытов вы узнаете, как можно убедиться в поляризованности электромагнитной волны и в поляризованности света.Законы отражения и преломленияДанный модуль посвящен законам отражения и преломления света. Для того чтобы вспомнить из школьной программы законы геометрической оптики, Валерий Иванович приводит очень интересные и нестандартные иллюстрации этих законов. С помощью установки с генератором трехсантиметровых волн показывается, что законы отражения и преломления великолепно выполняются и для электромагнитных волн других диапазонов.Стоячие волныВ модуле вы увидите опыты получения стоячей волны при интерференции трехсантиметровых и дециметровых электромагнитных волн.Интерференция волнДанный модуль посвящен интерференции волн. Автор напомнит понятие интерференции волн и продемонстрирует это явление. Явление интерференции присуще всем видам волн, в том числе и световым волнам.Дифракция ФренеляСуществует явление, которое также присуще только волнам — это дифракция. Благодаря дифракции волны могут попадать в область геометрической тени. Практически в каждом эксперименте вас ждут интересные комментарии и доступные объяснения рассматриваемых явлений.Дифракция ФраунгофераВ этом модуле понятие дифракции будет рассмотрено в случаях, когда дифракционная картина наблюдается на значительном расстоянии от отверстия или преграды, а размер препятствия много меньше размера зоны Френеля.Волны в анизотропных средахВ данном модуле мы рассмотрим некоторые эффекты, которые возникают при распространении света в анизотропных средах.\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "Физика в опытах. Часть 4. Волны и оптика", 
    "price": 0, 
    "instructors": "Калашников Николай Павлович, Гервидс Валериан Иванович, Клячин Николай Альбертович  and Панебратцев Юрий Анатольевич", 
    "institution_name": [
        "National Research Nuclear University MEPhI"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/fizika-volny-optika", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}