{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Предлагаемый курс «Электричество и магнетизм. Часть 2» является естественным продолжением курса «Электричество и магнетизм. Часть 1»  и включает в себя обсуждение явления электромагнитной индукции, относительности характера электрического и магнитного полей, круга вопросов, связанных с квазистационарными процессами и электрическими колебаниями в линейных электрических системах, а так же спектральным анализом электрических сигналов. Электричество и магнетизм. Часть 2» представляет собой абсолютно самостоятельный курс, для прохождения которого прослушивание курса «Электричество и магнетизм. Часть 1» не является обязательным. Тем не менее, авторы рекомендуют ознакомиться с его материалами для создания необходимого фундамента знаний.\n\n                                            Syllabus\n                        Неделя 1. Электромагнитная индукция в движущихся и неподвижных проводниках. Закон электромагнитной индукции. Правило Ленца. Относительный характер электрического и магнитного полей. Коэффициенты само- и взаимоиндукции. Теорема взаимности. Магнитная энергия и её локализация в пространстве. Объёмная плотность энергии. Энергетический метод вычисления сил в магнитном поле. Подъёмная сила электромагнита.Неделя 2. Квазистационарные процессы. Процесс установления тока в цепи, содержащей индуктивность. Колебания в линейных системах. Колебательный контур. Свободные затухающие колебания. Коэффициент затухания, логарифмический декремент и добротность. Энергетический смысл добротности.Неделя 3. Вынужденные колебания под действием синусоидальной силы. Амплитудная и фазовая характеристики. Резонанс. Процесс установления стационарных колебаний. Комплексная форма представления колебаний. Векторные диаграммы. Комплексное сопротивление (импеданс). Правила Кирхгофа для переменных токов. Работа и мощность переменного тока. Неделя 4. Вынужденные колебания под действием несинусоидальной силы. Амплитудная и фазовая модуляции. Понятие о спектральном разложении. Спектр одиночного прямоугольного импульса и периодической последовательности импульсов. Соотношение неопределённостей. Спектральный анализ линейных систем. Колебательный контур как спектральный прибор. Частотная характеристика и импульсный отклик. Понятие о детектировании модулированных сигналов.Неделя 5. Параметрическое возбуждение колебаний. Понятие об автоколебаниях. Обратная связь. Условие самовозбуждения. Роль нелинейности.Неделя 6. Экзаменационная работа\n                                    ", 
    "end_date": "2014-12-01T00:00:00Z", 
    "title": "Электричество и магнетизм. Часть 2 (Electricity and Magnetism. Part 2)", 
    "price": 0, 
    "instructors": "Stanislav Kozel, Vladimir Ovchinkin and Andrey Gavrikov", 
    "institution_name": [
        "Moscow Institute of Physics and Technology"
    ], 
    "commitment": "4-12 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/course/electricity2", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-10-20T00:00:00Z"
}