{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    Что такое физика и зачем она нужна? Некоторые люди никогда не задаются таким вопросом. Некоторые считают, что физика нужна исключительно для создания различных «девайсов», например холодильников или мобильных телефонов. И они в чем-то правы, ведь сказал же Оскар Уайльд, что «Комфорт – это единственное, что может нам дать цивилизация».\n\nДля нас физика – это умение видеть и понимать окружающий мир, возможность творить то, о чем раньше даже и мечтать было сложно. Мы считаем, что для дальнейшего прогресса человечества необходимы ученые-физики, инженеры-физики и просто образованные люди. Мы готовы делиться нашими знаниями. \n\nПредлагаемый курс «Электростатика и магнитостатика» посвящен рассмотрению ключевых понятий этой области: уравнений Максвелла, записанных в статическом случае как внутри вещества, так и вне его, энергетических подходов для вычисления сил, действующих на объекты, находящиеся электростатическом или магнитном поле, а также рассмотрение свойств для постоянных токов.\n\nСразу заметим – курс не очень простой, для его освоения слушателям необходимо владеть знаниями по физике в объеме школьной программы, основами дифференциального и интегрального исчисления и основами векторного исчисления.\n\nВ течение 10 недель вам будут предлагаться для изучения видеолекции, физические демонстрации и семинары с разбором задач. Основные формулы и тезисы лекций представлены в виде кратких конспектов. Каждая учебная неделя содержит тест и 4 задачи для самостоятельного решения. Экзаменационные недели включают тест и 5 задач.\n\nВ конце курса у слушателя есть возможность решить дополнительную контрольную работу из трёх задач повышенной сложности с ограничением по времени.\n\n                                            Syllabus\n                        Электрический зарядЭлектрический заряд. Закон Кулона. Системы единиц измерения. Электростатическое поле. Напряженность электрического поля. Поле точечного заряда. Кулоновское поле. Принцип суперпозиции электрических полей. Напряженность поля диполя. Дипольный момент. Сила действующая на диполь во внешнем электростатическом поле. Закон сохранения заряда.Теорема ГауссаПоток вектора. Теорема Гаусса. Примеры применения. Консервативность электростатического поля. Теорема о циркуляции. Потенциал. Потенциала поля диполя. Потенциал шара, внесенного в электростатическое поле. Потенциал заряженного шара.Электростатическое поле в вакуумеОсновы векторного анализа. Локальная связь между потенциалом и напряженностью поля. Градиент. Дифференциальная (локальная) форма теоремы Гаусса. Дивергенция. Теорема о циркуляции в дифференциальной форме. Ротор. Формула Остроградского-Гаусса. Уравнение Пуассона. Уравнение Лапласа. Основная задача электростатики. Нахождение распределения потенциала по заданным граничным условиям. Теорема единственности. Метод электрических изображений.Электростатическое поле в веществеЭлектрическое поле в веществе. Проводники в электрическом поле. Поляризация диэлектриков. Вектор поляризации. Свободные и связанные заряды. Теорема Гаусса при наличии диэлектриков. Вектор электрической индукции. Поляризуемость и диэлектрическая проницаемость. Граничные условия на поверхности проводника и границе двух диэлектриков.Промежуточная контрольная работаПовторение пройденного материала и промежуточная контрольная работа по первой части курсаЭнергия электростатического поляЭлектрическая ёмкость. Конденсаторы. Энергия электрического поля и её локализация в пространстве. Объёмная плотность энергии. Взаимная энергия зарядов. Энергия диполя в электрическом поле. Энергетический метод вычисления сил в электрическом поле.Постоянный токСила и плотность тока. Закон Ома в интегральной и дифференциальной формах. Электродвижущая сила. Правила Кирхгофа. Работа и мощность постоянного тока. Закон Джоуля–Ленца. Объёмные токи.Магнитное поле в вакуумеМагнитное поле постоянного тока в вакууме. Вектор магнитной индукции. Действие магнитного поля на движущийся заряд. Сила Лоренца. Сила Ампера. Закон Био–Савара. Магнитное поле равномерно движущегося точечного заряда. Рамка с током в магнитном поле. Магнитный момент тока. Теорема о циркуляции для магнитного поля в вакууме и её применение к расчету магнитных полей. Дифференциальная форма теоремы о циркуляции.Магнитное поле в веществеМагнитная индукция и напряжённость поля. Вектор намагниченности. Токи проводимости и молекулярные токи. Теорема о циркуляции для магнитного поля в веществе. Граничные условия на границе двух магнетиков. Применение теоремы о циркуляции для расчёта магнитных полей.Итоговая контрольная работаКонтрольная работа по второй части курса и дополнительные задачи повышенной сложности.\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "Электростатика и магнитостатика", 
    "price": 0, 
    "instructors": "Станислав Козел, Владимир Овчинкин and Андрей Гавриков", 
    "institution_name": [
        "Moscow Institute of Physics and Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/electrostatica", 
    "duration": "10 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}