{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    电磁学是普通物理系列中最重要的基础课之一，是高等学校每一个理工科学生必修课程，本课程包括静电场、恒磁场、电磁感应、电磁介质、电路、麦克斯韦电磁场理论、电磁波等内容，首次系统地向学生介绍“场”的概念和处理“场”的方法，对学生今后学习和工作有深远的影响。本课程作为中国大学先修课（AP课程）向有志于学习物理及相关专业的学有余力的优秀中学生开放，培养学科兴趣，提高科学素养，打下扎实的物理基础。\n       2014年9月以来《电磁学》已经两度上线开课，教学内容是按周上载，共有十三周课程。考虑到很多大学生和中学生不一定有条件按照我们原来按周上载课件的节奏学习，有的同学反映开始拉下了进度，后面就跟不上了，练习也是有时限的，过了时限就没法记录练习的成绩了。因此我们团队决定将原来上线的《电磁学》课程拆分成两个学习进程在on demand上线，在on demand上，我们将所有课程内容全部上载，没有教学时限，由学生自行安排学习时间和进度，自己完成课后练习，以便随时为需要的学生提供学习的资料和练习。练习题可以多次尝试，只是必须做对每个模块练习题的80%，才可以通过。又考虑到《电磁学》内容比较多，因此将原来十三周的教学内容分成两个学习阶段。《电磁学上》包含的内容是《大学物理通用教程》电磁学的前三章即静电场、导体和电介质以及直流电。这三部分内容属于恒定电场范畴，这些内容应该是深入学习电磁学的基础，在这部分课程结尾，设置了一个结业考试，相当于大学课程的期中考试。第二个学习进程《电磁学下》包含的内容是《大学物理通用教程》电磁学的后五章即恒磁场、磁介质，电磁感应、交流电和电磁场电磁波。建议大家学习了第一进程，通过了结业考试以后再进入第二学习进程《电磁学下》的学习。\n        本课程的课程是按照知识点设置模块，《电磁学上》包含5个模块，《电磁学下》包含6个模块。每个模块又包含几节课，每个模块结束有一个小测，同学们可以自我测试，没有时间限制，大家可以根据自己的需要和时间安排来自主学习，以免一步跟不上，步步跟不上，这对于学习我们这种理论性比较强的课是有利的，已经明白的可以跳过去，不清楚的可以重点学习。\n       《电磁学上》包含以下五个模块\n模块一      库仑定律和电场强度 \n模块二      高斯定理和环路定理\n模块三      导体与静电平衡\n模块四      电介质与电场能量\n模块五      直流电\n欢迎大家选课！\n\n                                            Syllabus\n                        欢迎学习同学们好！    欢迎来关注《电磁学》的第一个学习进程——《电磁学上》课程！    《电磁学上》包含的内容是《大学物理通用教程》电磁学的前三章即静电场、导体和电介质以及直流电。这三部分内容属于恒定电场范畴，这些内容应该是深入学习《电磁学下》的基础，在这部分课程结尾，设置了一个结业考试，相当于大学课程的期中考试。本课程的课程是按照知识点设置模块，《电磁学上》包含5个模块，每个模块结束有一个小测，同学们可以自我测试，没有时间限制，大家可以根据自己的需要和时间安排来自主学习，以免一步跟不上，步步跟不上，这对于学习我们这种理论性比较强的课是有利的，已经明白的可以跳过去，不清楚的可以重点学习。成绩评定原则是每个模块的练习占60%，结业课程成绩占40%。感谢你来学习这门课程，希望在此能获得帮助，也欢迎提出宝贵意见！                            北京大学《电磁学》MOOC建设团队                                2015年9月15日模块一 : 库仑定律和电场强度 一.本模块教学内容概要        作为第一模块的教学内容，主要包含三部分：前言、库仑定律、电场强度。总共9个视频文件。本模块有两节课,第一课包含前言和客轮定律。前言的作用是让大家了解课程的重要性和特点，学习要注意的一些事项；作为电磁学的开篇之作，我们以库仑定律为例来说明物理定律建立的一般过程，如何考察物理定律的内涵和外延，使大家不仅仅学到知识，而且也受到物理文化的熏陶；第二课开始引入电场强度、场强叠加原理，以及介绍如何求电场强度的方法——微元法。所以在这里重点是理解力和场的关系，学会在已知电荷分布的前提下求其周围的电场分布，学会矢量场的叠加，学会写出微元的场，利用对称性分析和微积分。万事开头难，这部分内容的学习也将成为今后进一步学习电磁学的基础。   二.关于课后练习、作业和考试   每个模块都有一些练习题，主要注重对概念的理解，同学们应该可以作为自我测试，独立完成。    课后测试题主要是帮助大家理解概念，检验对一些基本概念认识是否正确，但是同学们要清醒地认识到，要掌握好电磁学精要，仅仅按时完成这些练习是远远不够的，希望大家在理解基本概念的基础上，全面掌握课程内容，达到基本要求，因此，要求大家自己找电磁学教科书每章后面的习题自行练习。作为参考，我在此点出《大学物理通用教程》电磁学相应题号。与本周教学内容相对应的题目是：《大学物理通用教程》电磁学 p44   1-3、4、5、6、7、8、9、11。请同学们自行完成，且不必提交，但这些也是属于我们最后考试的考察范围。同时也要悟物穷理，多思考，适当拓展阅读，充实对电磁学的全面认识，打好基础。 模块二 : 高斯定理和环路定理 作为本模块第一、第二节课主要教学内容是讨论了静电场的基本性质，给出了高斯定理和环路定理。在这里，我们第一次接触到如何处理场的方法，这里我们要接触到通量、环流这两个新的概念，引入描述场的另一个重要概念——电势。第三节课重点讨论了电场强度和电势这两个基本概念的关系,给出了电势梯度的概念，在此基础上将积分形式的高斯定理和环路定理通过数学变换导出了微分形式，从而导出了静电场的场方程。这部分内容对于初学的同学有一定的难度，特别是数学知识准备不足的同学，会感到许多困惑。其实同学们没有必要太紧张，这里重点要掌握场强是电势梯度的负值的概念以及掌握已知电势分布求电场强度。而对于高斯定理和环路定理的微分形式以及静电场方程，只需了解即可。所以本模块学习的重点是相当集中的，不但要理解静电场的性质，而且还应该掌握如何利用高斯定理求电场以及如何求电势的方法，掌握如何利用电势梯度求电场等问题。本模块练设置了若干练习题，主要注重对概念的理解，同学们可以作为自我测试，独立完成。作为参考，我在此点出《大学物理通用教程》电磁学相应题号。与高斯定理内容相应的题目是《大学物理通用教程》电磁学 p46   1-13、14、15、17、18；与环路定理和电势梯度相应的题目是p-47  1-19、20、21、22、24 、26。    请同学们自行完成，且不必提交，同时也要悟物穷理，多思考，适当拓展阅读，充实对电磁学的全面认识，打好基础。模块三 : 导体和静电平衡本模块中第一节课介绍“静电场中的导体”。这里讨论了导体这种物质在静电场的的基本规律，实际是将第一章的静电场的基本规律用到导体这种物质上，讨论具有大量自由电子的导体在受到电场力作用以后的行为，以及达到静电平衡以后的场的性质。第二节课重点讨论了导体空腔、静电屏蔽，最后要介绍一种用电器——电容器。本模块有几道练习题，主要注重对概念的理解，同学们可以作为自我测试，独立完成，如何评分详见评分标准。希望大家在理解基本概念的基础上，全面掌握课程内容，达到基本要求，作为参考，我在此点出《大学物理通用教程》电磁学相应题号。与电势梯度相应的题目是《大学物理通用教程》电磁学与导体静电平衡相应的题目是p88 2-1、2、3、4、5、6、7、8、9。请同学们自行完成，且不必提交。 模块四 : 电介质与电场能量本模块的主要教学内容是电介质以及静电能两部分。大家对电介质这部分内容相对陌生点，感觉学习有一定的难度。其实在之前学习的知识基础上，学会将已经学到的静电场基本规律的知识来分析场对电介质作用的后果，以及电介质对场作用的响应，学习起来就不会觉得太困难了。通过对处在静电场中导体的研究，我们一方面了解了当导体达到静电平衡时导体的性质，同时也学习了如何研究场对物质作用的这类问题的方法，这对于学习处在静电场中的电介质的性质是有帮助的。虽然研究的对象不同，但是研究的方法有共同之处。整个模块分四节课，第一课是介绍电介质的极化，与导体不同之处是，电介质内基本上没有可以移动的自由电子，但是不影响组成电介质的原子分子中的电荷受电场的作用而发生局部的小范围的运动，因此这里的一个非常重要的基本问题是考察组成介质的原子分子作为电偶极子在电场作用下的行为即电介质的极化。重点研究介质的是在电场作用下达到平衡后的性质。所以总体来讲，第一课学习的重点是了解极化机制，如何确定因为极化产生的极化电荷分布，以及这些计划电荷对电场的影响。第二课是第一课内容的通过例题帮助同学们了解如何确定计划电荷分布和求出极化电荷产生的场。第三课的主要内容是讨论有介质存在时电场的性质，即给出了有介质时场的高斯定理和环路定理。第四课主要的内容是电场能量和边界条件，电场能量涉及到静电场的能量是如何聚集起来的，由此讨论到导电体系的自能、相互作用能和总静电能。在讲解相互作用能时，同学们会感觉公式多，理解起来有一定的难度。实际这里采取的是归纳法，从两个点电荷系统出发，逐步推演，推广到多个点电荷系统。从离散的点电荷组系统的相互作用能通过求极限，推广到连续带电体的总静电能，最后讨论了带电体系静电能与电场能量的关系。这样的讨论展示了物理学研究问题的一种方法，是值得借鉴的。所以学习这部分知识，重点在于理解；关于边界条件问题，实际上是在不同介质的交界面上运用高斯定理和环路定理得到的结果。电场能量与边界条件与静电场的基本规律这些知识点互相关联，会出现在综合分析的问题中。本模块也有一些练习题，主要注重对概念的理解，同学们应该在规定的时间内完成，希望大家作为自我测试，独立完成，如何评分详见评分标准。    　除了课后测试题外，本周可参考《大学物理通用教程》电磁学中与电介质相应的题目不多，是《大学物理通用教程》电磁学 p90   2-12、13、14、15、16、17、18、19、20、21。 here模块五 : 直流电本模块主要教学内容是直流电。一共有三节课，第一课主要介绍的恒定条件和欧姆定律。这部分内容是中学生比较熟悉的，学习起来比较轻松，希望大家从大学物理的角度整合以往学到的知识，练习欧姆定律的运用，相应的练习类似于《大学物理通用教程》电磁学p116 3-1、2、3、4、5。第二课是关于电动势、电源。这里给出了电动势的定义，介绍了恒定电路中静电场的作用以及温差电等。第三课的教学内容是直流电路。重点是、简单电路和复杂电路，简单电路是大家熟悉的，可以通过学习复习中学掌握的知识，与大学内容加以整合，至于复杂电路，学习的重点是理解和学会运用基尔霍夫定律。按照规定写出基尔霍夫方程，并且准确计算。相应于《大学物理通用教程》电磁学的习题是p117 3-6、7、8、9、11。本模块也有一些练习题，主要注重对概念的理解，同学们应该在规定的时间内完成，希望大家作为自我测试，独立完成。结业考试 Final exam\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "电磁学上——恒定电场", 
    "price": 0, 
    "instructors": "王稼军   WangJiaJun ", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/dianci", 
    "duration": "7 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}