{
    "selfpaced": false, 
    "topic_name": [
        "Physics"
    ], 
    "description": "\n\n                    \n                    \n                    《电磁学下》是《电磁学》的第二学习进程，教学内容含恒磁场、磁介质，电磁感应、交流电和电磁场电磁波。虽然《电磁学下》内容比较多，但是处理场的基本方法大家已经熟悉和适应了，应该说，电磁学的前两章是整个电磁学的基础。建议大家学习了第一进程，通过了结业考试以后再进入第二学习进程《电磁学下》的学习。本课程的课程是按照知识点设置模块，《电磁学下》包含6个模块。每个模块又包含几节课，每个模块结束有一个小测，同学们可以自我测试，没有时间限制，大家可以根据自己的需要和时间安排来自主学习，以免一步跟不上，步步跟不上，这对于学习我们这种理论性比较强的课是有利的，已经明白的可以跳过去，不清楚的可以重点学习。\n教学大纲\n模块一      恒定磁场的基本规律\n模块二      磁力\n模块三      磁介质\n模块四      电磁感应\n模块五      交流电\n模块六      电磁场电磁波\n\n                                            Syllabus\n                        模块一 : 恒定磁场的基本规律 本模块一总共有三节课，第一课向大家介绍前辈大师建立磁场的一些研究成果，目的在于让同学们了解物理学发展历史上一些极其重要的创造性的工作，期望通过对这些案例的介绍，让大家体会物理学是如何发展起来的，科学家是如何工作的，也可以让同学们欣赏这些卓越的工作；第二课主要介绍磁感应强度的定义，利用毕奥-萨筏尔定律和叠加原理求电流产生的磁感应强度；第三课是讲解了磁高斯定理和安培环路定理。这些应该是学习磁场基本规律最核心的内容，要求掌握如何运用微元法求磁感应强度，也要求会利用安培环路定理求电流具有对称性分布所产生的磁感应强度。应该看到，通过学习电场的规律，我们的已经了解处理场的方法，学会了利用对称性和微元法来解决问题，虽然磁场的规律与电场不同，但作为处理场的问题，都是具有连续分布客体的特点，因而，可以借鉴求电场强度的经验来处理已知电流分布求磁感应压强度的问题，只是要注意磁场与电场的区别，即电场力是径向力，而磁场力是横向力，因而两种场的性质是不同。前者是有源无旋场，后者是无源有旋场。在求磁感应强度的问题中，还要注意掌握叉乘的规律，注意空间方向性等。与微元法求磁感应强度的问题相应于《大学物理通用教程》电磁学p177 4-2、6、7、8、9，与利用对称性和安排环路定理求磁感应强度的问题相应于《大学物理通用教程》p178  4-11、12、14。习题比较多，大家要耐着性子坚持下去，坚持就是胜利！\n    本模块也有一些练习题，主要注重对概念的理解，同学们可以作为自我测试，独立完成。\n模块二 : 磁力本模块有两节课,第一课的主要教学内容是安培力和洛伦兹力，这部分内容大家在中学了解的比较多，关键是要将中学所学到的知识整合到大学的体系中。第二课介绍各种带电粒子在电磁场中的运动的实例，带电粒子在磁场中的运动涉及到的内容十分广泛，因此在学习这部分内容时，要注意抓住重点，必须掌握的内容是洛伦兹力和经典霍尔效应，当然会涉及到一些应用和扩展性知识，对于扩展性知识，主要是了解，清楚基本原理很简单，但很有用，例如回旋加速器\\等离子体的磁约束等一些与带电粒子在电磁场中运动的实例、霍尔效应的原理应用和它的发展，对物理学的发展以及科学技术的发展影响很大，量子霍尔效应和分数量子霍尔效应均获得诺贝尔物理学奖，像这样物理学发展历史上重大事件也是应该有所了解。相应的于《大学物理通用教程》电磁学p178 4- 16、17、19、20 、21、22、23。\n    本模块有一些练习题，主要注重对概念的理解，同学们应该在规定的时间内完成，希望大家作为自我测试，独立完成。\n模块三 : 磁介质本模块的主要教学内容是磁介质，对于大家虽然是个陌生的知识点，但是由于前面接触过电介质极化，两者都是场对物质的作用问题，所以可以与电介质极化类比着学。本模块第一课是磁介质的磁化，这里是以分子电流观点为基本模型讨论磁介质磁化，所以与电介质极化的基本模型不同，首先要了解分子电流模型，接受磁场对分子磁矩的作用，了解作用的后果，明确磁化的规律。为第二课讨论有介质的磁场规律奠定基础。第二课将电流产生磁场的规律与磁介质中的磁场整合在一起，讨论有磁介质存在时的磁场规律即有磁介质存在时的安培环路定理和磁高斯定理。这两个定理说明有磁介质的磁场也是无源有旋场。磁介质可以分为顺磁质、抗磁质和铁磁质，对于不同类型的磁介质被磁化的微观机制和特点不同。对于各向同性的磁介质，求得H就可以求得B和M，而对于铁磁质，H和B不成比例，需要知道M的值方可求得B。第三课重点介绍了铁磁质的性质，这种磁介质的性质比较特殊，同学们可以着重定性的了解铁磁质磁化机制，磁滞回线以及以磁滞回线的特性来对铁磁质分类。最后介绍边界条件，与电场的边界条件类似的方法，将安培环路定理和磁高斯定理用于两种介质的边界上，假如边界上没有传导电流，则可以得到两种边界上B法向连续，H切向连续。本周的习题主要是相应于《大学物理通用教程》电磁学p208 5-1、5-2、5-3、5-5、5-6、5-8。    关于习题本模块有若干道练习题，主要注重对概念的理解，同学们可以作为自我测试，独立完成。模块四 : 电磁感应  本模块的主要学习内容是第六章电磁感应，这部分内容对于来自中学的同学，是比较熟悉的。因此在学习时，要注意在中学学习的基础上提高对电磁感应的认识。第一课介绍电磁感应定律的建立，然后介绍研究产生感应电动势的原因，可以发现作为动生电动势的非静电力实际上是洛伦兹力的后果，而感生电动势的非静电力是涡旋电场力。由此引入了与静电场完全不同的涡旋电场。相应于《大学物理通用教程》电磁学的习题有p258 6-1、2、3、4、5、6、7；第二课通过研究由于电流变化而产生的感应电动势，将感应电动势与电流变化率相联系，因而又引入了自感电动势和互感电动势。如果说电磁感应规律的发现是在物理学历史上一个重大的突破，那么由于区分动生与感生电动势使人们了解了一种完全不同于静电场的涡旋电场，从而使人们更加深入地理解感应电动势的实质；而自感电动势与互感电动势的研究可以进一步推动电磁感应的应用。特别要抓住中学不熟悉的知识点如感生电动势、涡旋电场、自感、互感等。在这一节里,还研究了磁场能量,这里是以长直螺线管自感线圈的自感磁能演绎出自感磁能与磁场的场量（磁感应强度和磁场强度）导出磁能密度，从而进一步给出求磁场能量的普遍公式，由此可以看到磁场能量是定域在场中。相应于《大学物理通用教程》电磁学的习题有p258 6-8、9、10、11、12、14；第三课重点介绍了暂态电路，与第七章的交流电路类似暂态电路是由电感、电阻和电容组成的电路，暂态过程是指电路加载电源以后达到稳态之前的过程。在此过程中，电压、电流均会随时间变化。因而，与大家熟悉的直流电路相比会更加丰富一些，但十分重要。相应于《大学物理通用教程》电磁学的习题有p258 6-15、16、17。关于习题本模块也有若干道练习题，主要注重对概念的理解，同学们可以作为自我测试，独立完成。模块五 : 交流电及解交流电路本模块教学内容是第七章的交流电路，交流电路由电感、电阻和电容组成，但交流电路中加载在电路上的电源是交变的，因此电路中的电压电流也是随时间变化。学习这部分内容，需要准备一些数学知识，如指数函数、一元定积分，三角函数，复数基础知识等；在交流电路中，电压、电流都随时间变化，学习这部分内容时要把握住电压、电流变化的规律，特点和学会如何解电路。本模块的第一课介绍交流电概述特别是分析了简谐交流电的一般特征。考虑到简谐交流电需要用简谐量来描述电路中元件上的电压、电流，而简谐量的叠加不是简单的相加，既要考虑简谐量的振幅，又需要考虑相位关系，因此交流电路中一个元件需要用阻抗和电压电流之间的相位差两个量来描述。这对于同学们来讲是陌生的，但学起来并不困难，需要适应。第二课的主要教学内容是运用第一课学到的有关交流电的基本元件的知识来处理交流电路的问题。交流电路也有简单电路和复杂电路，对于简单电路，我们介绍了矢量图解法和复数解法两种解电路方法，并且介绍了交流串并联电路的应用。而复杂电路就需要引入复数的基尔霍夫定律，这部分内容可以与直流电中介绍的基尔霍夫定律类比着学习。第三课学习重点是谐振电路和交流电功率。这两个问题是在交流电路中经常用遇到的问题，谐振电路重点是串联谐振和并联谐振的特点，电路的Q值的物理意义，功率问题的讨论中重点是了解交流电功率的特性特别是功率因数的意义。而关于变压器和三相电，在实际运用中很有用，但在本课程中将不作为讲解和要求大家学习的重点。大家可以通过看书了解一下，今后如果需要进一步学习，可以专门找电工技术方面的课程学习。本模块的习题比较多，需要多练习。相应于《大学物理通用教程》电磁学p314 7-1、2、3、4、5、6、7、8 ，p316 7-9、10、11、12、13、14。本模块的练习题，也是注重对概念的理解，同学们可以作为自我测试，独立完成。模块六 : 电磁场和电磁波本模块主要教学内容是电磁场电磁波，全模块共有四节课，第一课是一个综述性的讲座，由四个视频文件组成，重点是介绍Maxweii电磁理论建立的历史资料，期望通过这一部分内容的讲解，让同学们了解电磁理论建立的脉络，了解前辈大师们在建立电磁理论过程中的一些原创的思想，遇到些什么样的问题，如何设法解决，一方面让学生从中身令其境地体会他们探索的过程，欣赏他们的工作，同时也是对前面学习过的内容的一个回顾和总结，以便在此基础上学习第二课的内容。第二课中首先建立位移电流的概念，从而给出了麦克斯韦方程组。然后再第三课中应用麦克斯韦方程组来讨论没有传导电流，没有自由电荷的自由空间的电磁波的性质。最后在第四课中讨论了电磁场的能量，引入了能流密度的概念。通常同学们在学习这部分内容时感到比较吃力，特别是在讨论电磁波性质时，数学用得比较多，常常会陷于数学的困惑中。因此在学习第八章时，要抓住重点。这一章引入两个新的物理量位移电流和能流密度，应该深入理解，正确掌握概念和计算；例如电磁波的性质，我们只要求在理解的基础上记住而不要求会推导，也不要求用麦克斯韦方程组解决一个具体问题，这实际上是电动力学的任务，目前可以先放一放。但是这一章要记住的概念还是挺多的，应该梳理一下，该记该背的要下点功夫。本模块的习题比较少，主要是对基本概念和规律的理解。相应于《大学物理通用教程》电磁学p352 8-1、2、4、5。课后的练习题，可以作为同学们的自我测试，独立完成。本模块是《电磁学下》的最后一个模块，也是《电磁学》整门课程的结束模块，至此大家完成了全部学习内容。我们这门课是大学普物中的基础课，就是北京大学的04系列平台课，因此课程要求不低，理论性比较强，能够坚持学下来不是一件容易的事情，感谢从上线到现在一直坚持学习的同学，希望大家最后还是要坚持、坚持再坚持，争取最后结业考试取得好成绩。期末考试\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "电磁学下——恒磁场与时变电磁场", 
    "price": 0, 
    "instructors": "Ms 王稼军   WangJiaJun", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/dianci-2", 
    "duration": "7 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}