{"selfpaced": false, "topic_name": ["K12"], "description": "\n\n                    \n                    \n                    Full course description\r\n\r\nStarts February 23, 2015\r\nBlended learning (the strategic combination of face-to-face and online learning experiences) is growing in popularity within higher education and K-12 settings around the world. The goal of BlendKit: Becoming a Blended Learning Designer is to provide facilitated assistance to faculty members and instructional designers in developing and designing blended courses through (1) a consideration of key issues related to blended learning and (2) practical step-by-step guidance in producing materials for a blended course (e.g., developing design documents, creating content pages, and receiving peer review feedback at one's own institution).\r\nHistory\r\nA Next Generation Learning Challenges (NGLC) grant in 2011 leveraged the University of Central Florida’s expertise to create the Blended Learning Toolkit as a free, open resource for educational institutions interested in developing or expanding their blended learning initiatives. The American Association of State Colleges and Universities (AASCU), UCF’s grant partner, agreed to use its membership to distribute the toolkit and support new course models. The BlendKit course emerged from the grant to assist educators in designing blended courses and has supported three open, online cohorts since 2012.\r\nBlendKit 2015\r\nThe next offering of the free course, BlendKit 2015: Becoming a Blended Learning Designer, begins on February 23, 2015 with a 30-minute orientation session at 2:00 p.m. (ET; -4 UTC) and lasts five weeks. The open course will be offered at no cost.\r\nCertification\r\nRegistered participants may also choose to pursue an official “UCF/EDUCAUSE Certified Blended Learning Designer” credential. Those who choose this more rigorous option will submit the materials they develop during the course for a portfolio review. This portfolio review is available for an $89 fee. Details regarding the portfolio requirements and a link to the payment form can be found within the course.\r\nThose who meet the portfolio review expectations will earn a certificate from EDUCAUSE and the University of Central Florida, along with a digital badge that can be linked to the participant’s EDUCAUSE profile and displayed on professional and social networks.\r\nThis five-week course involves:\r\n\r\nExpert and peer assessment and critique on design work\r\nRegular interactions with facilitators and students\r\nBlogging/social networking interaction opportunities\r\nWeekly webinars with guest presenters\r\nDocument templates and practical step-by-step “how to” guides\r\nReadings from scholarly works pertaining to blended learning\r\n\r\n\n\n                                    ", "end_date": "2016-03-28T00:00:00Z", "title": "Becoming a Blended Learning Designer", "price": 0, "instructors": "Linda Futch and Kelvin Thompson", "institution_name": ["University of Central Florida"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "http://www.canvas.net/browse/ucf/ucf-educause/courses/becoming-a-blended-learning-designer-2", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Canvas.net"], "start_date": "2016-02-22T00:00:00Z"}