{"selfpaced": false, "topic_name": ["K12"], "description": "\n\n                    \n                    \n                    The Disciplinary Literacy for Deeper Learning MOOC-Ed will explore digital literacy, which is the ability to understand and use a range of digital technologies, a critical skill for today’s classroom. This MOOC-Ed is open to all educators in K-12 and postsecondary levels interested in learning more about disciplinary literacy for deeper learning. During the Disciplinary Literacy for Deeper Learning MOOC-Ed you will:\r\n\r\nStrengthen your understanding of what it takes to engage students in deeper learning through disciplinary literacy practices;\r\nExplore the model for inquiry-based disciplinary literacy and how it can promote deeper learning for your students;\r\nEngage in disciplinary literacy practices (e.g., close reading, digital learning, constructing and supporting claims);\r\nExperience multiple opportunities for personalized application of disciplinary literacy to your teaching context;\r\nDesign, critically evaluate, and share inquiry-based disciplinary literacy lessons;\r\nTake action to become a leader by engaging others in disciplinary literacy practices.\r\n\n\n                                            Syllabus\n                        \r\n\r\nUnit 1 - What is Disciplinary Literacy and Why is it Important?\r\n\r\n\r\nUnit 2 - Relating Inquiry to Disciplinary Literacy\r\n\r\n\r\nUnit 3 - Getting Close to Close Reading\r\n\r\n\r\nUnit 4 - Going Digital with Disciplinary Literacy\r\n\r\n\r\nUnit 5 - Assessing Disciplinary Literacy\r\n\r\n\r\nUnit 6 - Take Action! Be a Teacher Leader with Disciplinary Literacy\r\n\r\n\n                                    ", "end_date": "2016-03-14T00:00:00Z", "title": "Disciplinary Literacy for Deeper Learning", "price": 0, "instructors": "", "institution_name": ["Friday Institute", "North Carolina State College of Education"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "https://place.fi.ncsu.edu/course/view.php?id=30", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["MOOC-ED"], "start_date": "2016-02-01T00:00:00Z"}