{"selfpaced": false, "topic_name": ["K12"], "description": "\n\n                    \n                    \n                    How can you help your students to see history as a living, breathing record of the past? How can you motivate students to ask probing questions and seek complex answers? How can you bridge their historical knowledge with a lifelong commitment to civic action?\nWith this course, middle and high school teachers will find new ways to engage students in and out of the classroom. Co-taught by Dr. Kathy Swan, Professor of Education at the University of Kentucky, and Naomi Coquillon, Manager of Youth and Teacher Programs at the Smithsonian’s National Museum of American History, this course will offer teachers useful and readily applicable strategies and tactics to incorporate inquiry-based learning methods into their existing history lessons.\nThe course brings together the new College, Career and Civic Life (C3) Framework for Social Studies with the Smithsonian’s hands-on, museum-based educational techniques that bring historical artifacts to life for millions of visitors each year. Through explanation, demonstration, and dynamic examples, the course offers teachers practical ideas for how to entice students to craft complex and incisive questions; think critically about primary and secondary historical sources; form and support their opinions with evidence; and communicate their conclusions in ways that will prepare them to be engaged citizens of the world. Demonstrations will feature the Smithsonian National Museum of American History’s exhibitions and vast collection of historical artifacts and will offer ideas and resources to help teachers everywhere incorporate object- and inquiry-based teaching techniques and Smithsonian online resources into their own classrooms.\n\n                                    ", "end_date": "2015-11-10T00:00:00Z", "title": "ED1.1x: Teaching Historical Inquiry with Objects", "price": 0, "instructors": "Naomi Coquillon and Kathleen Owings Swan", "institution_name": ["Smithsonian Institution"], "commitment": "3 hours", "subject_name": ["Education & Teaching"], "course_url": "https://www.edx.org/course/teaching-historical-inquiry-objects-smithsonianx-ed1-1x", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-10-06T00:00:00Z"}