{"selfpaced": false, "topic_name": ["Digital Media & Video Games"], "description": "\n\n                    \n                    \n                    This course \nexplores the primary entertainment vehicles that students are exposed to\n on a daily basis through a series of interlinking concepts such as \nImax, a pop tour, an interactive kids toy, Minecraft and more. This \nexamination is supported by a critical evaluation of the various kinds \nof technologies that have emerged along the continuum of entertainment \ntechnology.How have these \ntechnologies shaped the art form? How have these transformations \ninformed styles and genres across theater, recording music, feature \nfilms (esp. Imax and 3d), spectacle and integrated media events (such as\n Cirque du Soleil), game play from consoles to hand-helds and, the \nre-emergence of “virtual reality” and “augmented reality” using low-cost\n devices and tools?   Information\n will be synthesized through an understanding that the common thread has\n been the ever-expanding role of computer systems technologies in all \nforms of commercial and popular art.\n\n                                            Syllabus\n                        Session 1: Introduction To Arts And Entertainment Technologies This session will present an overview of the course, the three pillars of AET and numerous of examples of how they intersect, cross-pollinate, combine and deliver.\r\nSession 2: Popular/Commercial Music Technologies This session will introduce the student to the digital audio workstation and various other music technologies and examine the intersection of music, technology and culture.\r\nSession 3: The Range Of The Concert Experience This session will examine how technologies – ranging from amplification to motion tracking – combine in modern, multi-sensory concert experiences. The German electronic band, Kraftwerk, will serve as a case study.\r\nSession 4: Theater, Spectacle, Robotics In Art This session will examine how a wide range of new theatre performance genres have [developed] alongside the exploding growth of high-precision, expressive, programmable technologies.\r\nSession 5: New Trends In Interactive Art &amp; Education This session will focus on how technology affords a new level of audience engagement and immersion in interactive art and educational installations.\r\nSession 6: The Moving Image This session will look at how software from the Adobe Creative Cloud can be used in nontraditional ways such as the creation recursive animated GIFs in Photoshop to kinetic text in After Effects, to name a few.\r\nSession 7: Gaming This session will focus on the history of the video game and how that history parallels and, in many cases, promotes new innovation in entertainment technology. There will be an additional look at gender issues in gaming.\r\nSession 8: Virtual And Augmented Realities This session will look at how new technologies are used in increasingly sophisticated ways to blur the lines that divides us from our experience of the world around us.\r\nSession 9: New Media This session will focus on the convergence of mobile media, storytelling and bewilderment. What has the podcast done to distort the line between entertainment and information?\r\nSession 10: Makerspace And DIY Electronics This session will explore the world of maker culture. With 700,00 units of Arduino products in circulation and counting, what does this crowdsourcing of innovation mean for the future of entertainment?\r\nSession 11: Gadgets And Interactive Toys This session culls from many of the previous sessions to present a wide variety of gadget and interactive devices that currently entertain the next generation of thinkers and innovators.\r\nSession 12: Subversive Technologies And Wrap Up At what point did Photoshop become a verb? Before wrapping up the course, this section will look at the history of how technology has been perverted to misrepresent, enhance, and even change history. How has technology ultimately redefined what entertains us?\n                                    ", "end_date": "9999-12-31T23:59:59Z", "title": "Foundations of Arts and Entertainment Technologies", "price": 0, "instructors": "Jack W. Stamps", "institution_name": ["The University of Texas at Austin"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.kadenze.com/courses/foundations-of-arts-and-entertainment-technologies/info", "duration": null, "language_name": ["English"], "provider_name": ["Kadenze"], "start_date": "2016-11-27T00:00:00Z"}