{"selfpaced": true, "topic_name": ["Digital Media & Video Games"], "description": "\n\n                    \n                    \n                    '2D Game Development with libGDX' explored the basics of the libGDX game framework, from simple drawing to user input. \n\nThis course will use those skills to create a much more sophisticated platforming game called GigaGal. In creating GigaGal, you'll learn about sprite drawing, keeping track of complex game state, controlling interactions between game entities, and also how to load and manage level data.Why Take This Course?Making and playing games is easily the most fun you can have with a computer, but there are real career opportunities here as well. Over the last decade, mobile gaming has grown into a huge market. Independent game developers are enjoying unparalleled success, and established gaming studios are hiring faster than ever.\n\nIn the course '2D Game Development with libGDX' you learned to build a simple game. Now, you'll learn to build a platformer. These are the skills you'll need to enter the world of professional game development.\n\n                                            Syllabus\n                        ### Level 2-1: Sprites and Animations\nLearn to draw using predefined sprites and combine sprites into animations and stretchable nine-patches. Finally, you'll learn to pack many sprites into a texture atlas that can be efficiently loaded by your game.\n\n### Level 2-2: The Player\nCreate GigaGal and give her the ability to move and jump. You'll add separate sprites for facing left, facing right, standing, and jumping. Then, you will add an animation for GigaGal's walk.\n\n### Level 2-3: The Platforms\nAdd the platforms to GigaGal and allow GigaGal to jump on them and fall off again.\n\n### Level 2-4: The Camera\nSet up the camera to follow GigaGal around the level.\n\n### Level 2-5: The Enemies\nAdd GigaGal's evil robot adversaries. \n### Level 2-6: The Bullets\nLet GigaGal fight back with her arm cannon and create awesome explosions when she scores a hit.\n\n### Level 2-7: Level Loading\nWith the gameplay complete, add the ability to load level data created in an external tool.\n\n### Level 2-8: Adding the HUD and onscreen controls\nAdd a score display, lives counter, and on screen controls for mobile players.\n                                    ", "end_date": "2016-01-26T00:00:00Z", "title": "How to Make a Platformer Using libGDX", "price": 0, "instructors": "Peter Heinrich and Jeremy Silver", "institution_name": ["Amazon"], "commitment": "6 hours", "subject_name": ["Art & Design"], "course_url": "https://www.udacity.com/course/how-to-make-a-platformer-using-libgdx--ud406?utm_medium=referral&utm_campaign=api", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2015-12-01T00:00:00Z"}