{"selfpaced": false, "topic_name": ["Digital Media & Video Games"], "description": "\n\n                    \n                    \n                    In the past, Digital Audio Workstations (DAWs) were programs used only by audio engineers with a highly specific knowledge base, on machines inaccessible to most people. But over the past 10-15 years, DAWs and the act of recording music have evolved from being a luxury of the few to being available to the masses. Ableton Live is one such application. Used by an extremely broad range of music creators, Ableton Live not only facilitates the work of engineers, producers, and writers in professional, home, and mobile studio settings, but it is also a powerful platform for musicians on stage, in the DJ booth, and elsewhere.\n\nIn this course, you will explore some of Live’s most powerful and useful functionality: MIDI programming, audio recording, warping and processing, looping editing, mixing, performing, file management, and troubleshooting. Meant to be a springboard for those who are new to Ableton Live and/or DAWs in general, this three-week course will provide you with a strong knowledge base for using Live to take your musical ideas from conception to final recording. The course breaks down the many barriers of entry into music technology and encourages all those who wish, to create fearlessly.\n\nNote: If you do not own Ableton Live 9, you can download the free, fully featured Ableton Live Trial. The trial version will allow you to save and export your work for 30 days. If you use the trial version, do not download it until the course is scheduled to begin.\n\n                                            Syllabus\n                        Welcome to Introduction to Ableton LiveWelcome to the course! Here we will cover all the details about the course and what you'll need to know to get the most out of your experience. Getting Our Hands DirtyIn this lesson I'm going to demonstrate how to get set up in Live, whether you have an audio interface or just your computer. We'll also look at saving and submitting your sessions, devices, MIDI drums, and MIDI synths.Polishing the SoundWe'll be moving from MIDI to audio and implementing effects, which will give your sessions even more personality and depth. We'll also be diving into Audio Warping, which is one of Ableton's most powerful functionalities and is the cornerstone of remixing. The Endless PossibilitiesThis week we're going to dive into some more advanced production techniques, the very basics of mixing, and I'll get into some valuable information regarding file management and troubleshooting. Hopefully with this new information you'll be able to tie together a lot of what we've learned in the past two weeks and bring your music to the next level.  \n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Introduction to Ableton Live", "price": 0, "instructors": "Erin Barra", "institution_name": ["Berklee College of Music"], "commitment": "4-6 hours", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/ableton-live", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}