{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>   O curso de Língua Portuguesa “online” abrange, quanto aos aspectos gramaticais, a morfologia, a sintaxe e a semântica. Além disso, serão abordados assuntos cujo objetivo é dar subsídios para que se redijam textos (acadêmicos, informativos, dissertativos, profissionais, emails) que estejam de acordo com as normas previstas pela<strong> NGB</strong> (Nomenclatura Gramatical Brasileira).</p>  <p>  O curso de Língua Portuguesa – cuja duração é de 123 horas-aula - será ministrado por meio de aulas online nas quais serão apresentados, separadamente, aspectos gramaticais associados à morfologia, à sintaxe e à semântica. Isso nos dará uma base sólida para resolver questões de Língua Portuguesa e para produzir textos de acordo com o padrão formal da Língua Portuguesa.</p>  <p>  Assistindo às aulas de Língua Portuguesa, os alunos se sentirão seguros para redigir textos formais, ou seja, textos que seguem o padrão formal da Língua Portuguesa. Também ficarão mais à vontade no momento em que estiverem interpretando textos e enunciados de questões de provas e, além disso, perceberão o quanto é importante conhecer as regras da Norma Culta para que se comuniquem melhor, inclusive, no momento em que estiverem falando.</p>  <p>Portanto, o curso de Língua Portuguesa deve ser feito por todos aqueles que querem redigir melhor, interpretar textos e enunciados, resolver questões de provas de Língua Portuguesa, fazer uma reciclagem, sentir-se mais confortáveis no ato da conversação. </p>", 
    "end_date": null, 
    "title": "Acentuação Gráfica", 
    "price": "20.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752258_8217_2.jpg", 
    "course_url": "https://www.udemy.com/estacio-acentuacao-grafica/", 
    "currency": "USD", 
    "subject_name": [
        "Portuguese"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-04T12:17:53Z"
}