{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Aqui na escolaonline, nós temos um jeito especial de ensinar, acreditamos que o caminho para aprender mais rápido e mais fácil qualquer língua, é o mesmo jeito quando somos crianças, ou seja, quando nos eremos bebes ficamos so escutando, depois nos começamos a falar, depois escrever as palavras, e so mais tarde aprendemos a gramatica, nosso curso é dessa forma, o primeiro passo é escutar conversas de nativos e repetir o que eles estão falandoPor que o Árabe egípcio? É a quinta língua mais falada no mundo, quase 500 milhões de pessoas falam o idioma árabe, em mais de 22 países .O árabe ensinado nesse curso é o Árabe Egípcio. E por que árabe egípcio?O árabe egípcio, tem o sotaque mais usado e conhecido no mundo árabe, Egito é o maior país árabe, com mais de 100 milhões de habitantes. Quase todos os filmes, séries e musicas são em árabe egípcio, até mesmo atores e cantores libaneses e sírios falam e cantam em árabe egípcio, pois qualquer pessoa árabe entende o árabe egípcio.Qual é o público alvo?1 – Pessoas que falam Português e querem trabalhar em qualquer país Árabe ou empresa Árabe; 2 - Brasileiros que viajam para o mundo Árabe;Se você quer viajar para Egito, Dubai, Marrocos, etc., esse curso vai ajudar muito!3 - Para quem gosta de aprender Árabe, esse é mais um desafio para evoluir e enriquecer o vocabulário;4 - Pessoas que gostam de aprender novas línguas. </p>", 
    "end_date": null, 
    "title": "Aprenda Árabe Agora", 
    "price": 0, 
    "instructors": "Mohamed Emadeldin Ibrahim Elshenawy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546278_235e_2.jpg", 
    "course_url": "https://www.udemy.com/fala-arabe-agora/", 
    "subject_name": [
        "Portuguese"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T04:23:19Z"
}