{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Fun with Brazilian Portuguese will teach you the structures and vocabulary you need to know to be able to communicate in practical situations in Brazil. You will learn the tricks to speak in a more natural and confident manner and also how to understand how Brazilians really speak in day-to-day colloquial conversation.&nbsp;</p><p><strong>This course is for:</strong></p><p></p><ul><li>People going to Brazil on holiday or for work and need to learn the basics to be able to get by in day-to-day situations.<br></li><li>People who will be going to Brazil for the 2014 World Cup and/or 2016 Summer Olympic Games either to watch or to work in these events, but have no knowledge of the language.</li><li>People who have Brazilian partners/family/friends and would like to be able to speak Portuguese with them.&nbsp;<br></li><li>People who love all things Brazilian and would love to start learning the language!<br></li><li>People who already have some knowledge of Brazilian Portuguese but would like to revise the most common structures and vocabulary for day-to-day situations.<br></li></ul><p></p><p><strong>This course is not for:</strong></p><p></p><ul><li>People with intermediate/advanced knowledge of Portuguese. You might find it too easy!<br></li><li>People only interested in formal Portuguese.<br></li><li>People only interested in learning Portuguese grammar.<br></li></ul><p></p><p>&nbsp;**&nbsp;Downloads are ENABLED for this course! **</p>If you have a slow internet connection, or want to take this course with you on your laptop, smartphone or other portable device, sign up and download all the videos now!<br>  ", 
    "end_date": null, 
    "title": "Fun With Brazilian Portuguese", 
    "price": "25.00", 
    "instructors": "Fernando Nonohay", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15545_cc5c_7.jpg", 
    "course_url": "https://www.udemy.com/colloquial-brazilian-portuguese/", 
    "currency": "USD", 
    "subject_name": [
        "Portuguese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-26T07:57:58Z"
}