{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">Este curso é para pessoas que já tem algum nível de Português e querem aprimorar suas habilidades de comunicação no idioma, todo o material é feito em video aula para que você possa entender melhor as explicações de cada tema abordado.</p><p style=\"\">O curso está dividido em 3 categorias<br style=\"\"></p>  <p style=\"\"><strong style=\"\">* Verbos (10 vídeos) - 100 verbos<br style=\"\"></strong></p><p>Você vai aprender vários verbos que são utilizados no Português do Brasil mas que são muito diferentes do Espanhol</p>  <p style=\"\"><strong style=\"\">  \t  * Expressões do Português (10 vídeos) - 100 Expressões</strong></p><p>É claro que você também quer aprender as expressões que os Brasileiros falam, caso contrário você vai se perder na roda de conversas entre amigos</p>  <p style=\"\"><strong style=\"\">  \t  * Vocabulário em Geral (2 vídeos)</strong></p><p>Nessa parte você vai aprender 20 palavras em geral do Português, todas muito utilizadas no dia a dia no Brasil.</p><p style=\"\">A Metodologia de ensino utilizada é muito prática, o objetivo é que você possa aprender vários verbos, vocabulário em geral e muitas expressões do Português do Brasil, o curso não é recomendado para as pessoas que não tem nenhum nível do idioma, todas as explicações estão em Português para que você tenha a oportunidade de aperfeiçoar o idioma ouvindo, lendo e logo colocando em prática o que foi aprendido !! =)<br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Improve your Portuguese to a Native Level", 
    "price": 0, 
    "instructors": "Philipe Brazuca", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419556_7fed_4.jpg", 
    "course_url": "https://www.udemy.com/improveyourportuguese/", 
    "subject_name": [
        "Portuguese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T20:02:03Z"
}