{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<ul><li>The video classes are for people who want to improve their Portuguese by learning new vocabulary that they would only learn by living in Brazil. If you are looking for Portuguese grammar rules and traditional text books you won't find this at this Course. The Course is dedicated to people who like to learn as a native, by listening and speaking.</li></ul><div><br></div><div><strong>How Should I Start The Course?</strong><br></div><ul><li>If you are a beginner start with Verbs and Vocabulary in General so you will learn the Portuguese structure while you watch the videos. For intermediate and advanced learners you can start based on what you think you need the most at this time; Verbs, Vocabulary in General or General Expressions, up to you.</li></ul><div><br></div><div><strong>How Do I Use The Video Lessons?</strong></div><div><div><ul><li>Repetition is what will make you learn fully. It's recommended that you watch each video at least twice to fully understand the content and use Native Portuguese at least an hour a day – 70% watching videos and 30% taking notes and doing exercises.</li></ul><div><br></div><p><strong>How Can I Improve My Writing Skills</strong><br></p><ul><li>Watch, listen and read native content as much as you can <strong>(check out the native content section)</strong> and get in contact with Brazilians or people who speak good Portuguese where you will have the opportunity to practice what you learned watching the video classes. In short the perfect way to learn and improve a language is by <strong>deep immersion</strong>.</li></ul></div><div></div></div><div></div>", 
    "end_date": null, 
    "title": "Learn Portuguese Vocabulary and Expressions", 
    "price": 0, 
    "instructors": "Philipe Brazuca", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562728_0b70.jpg", 
    "course_url": "https://www.udemy.com/nativeportuguese/", 
    "subject_name": [
        "Portuguese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T15:33:03Z"
}