{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><em></em>This Brazilian Portuguese Course For Traveling  will prepare you to travel to Brazil without stress or embarrassing situations.</p><p>You know that moment when you want to order your meal in a restaurant, but you don't even understand the menu to start with? </p><p>Or when you ask for information on how to get somewhere, but does not understand a word of the directions given to you? </p><p>And when you want to know the boarding gate of your flight but cannot find anyone who understands you? </p><p>All this and many other travel situations are covered in this course so you will not go through embarrassing situations or get stressed on your vacation, after all trips are meant to be enjoyed!</p><p>There are 17 videos lessons composed of key vocabulary and dialogues based on travel situations. There are also written activities for you to practice everything you learn from the videos lessons.</p><p>All the lessons are in English, so even if you have never studied Portuguese you will be able to understand and learn much faster. </p><p>Your Portuguese for traveling doesn't need to be the best, but to avoid embarrassing situations it is important that you know some key vocabulary and key expressions.</p><p>The aim of this course is to teach you precisely this vocabulary and these expressions which will make your trip pleasant and hassle free.</p><p>If you have questions during the course, know that you are not alone! You can post your questions in the discussion section or send me a private message. I answer all messages within 24 hours. Your fellow course mates can also help you!</p><p>Ready to communicate during your trip to Brazil? So sign up now and I'll see you in the course.</p>", 
    "end_date": null, 
    "title": "Learn Brazilian Portuguese to Travel Around Brazil ", 
    "price": "20.00", 
    "instructors": "Luisa Costa De Oliveira", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/484318_4990_3.jpg", 
    "course_url": "https://www.udemy.com/learn-brazilian-portuguese-to-travel-around-brazil/", 
    "currency": "USD", 
    "subject_name": [
        "Portuguese"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-23T14:11:25Z"
}