{"selfpaced": false, "topic_name": ["Public & Global Health"], "description": "\n\n                    \n                    \n                    This course will explore the dynamic factors affecting the health and wellbeing of young people around the world, and how important it is for individuals, communities and nations that we improve the health and life chances of this important population group.\n\nWith over 25% of the world’s population aged between 10 and 24 years, today’s generation of young people is the largest in human history. As the future leaders and drivers of growth, productivity and innovation, young people are our greatest assets, and investment in their health and wellbeing has social, economic and other benefits that continue across the lifespan and into the next generation.\n\nIn this course we will adopt a life-course framework to take a holistic view of youth health and wellbeing. We will explore changing patterns of adolescent health and development, including why adolescence is starting earlier and ending later; how puberty and adolescent brain development may shape future health; and how what happens in adolescence can affect the start to life for the next generation. We’ll also look at the major health and social issues affecting young people and ways of addressing these through policy, practice and programming.\n\nCOURSE FORMAT:\nThis course comprises short video lectures and interviews, required and recommended readings, online discussion, quizzes and written assignments. There is no required text for this course and all readings are provided.\n\nDO I HAVE TO PAY FOR THIS COURSE?\nNo- you may access 100% of material in this course for free. You are also welcome to do as much or as little of the course as you like, including all (or none!) of the assessment tasks- it all depends on your learning goals. The option to pay for this course is there for those who wish to receive a Course Certificate as evidence of completion (which does require you to attempt and successfully pass the assessment tasks). \n\nWHO IS THIS COURSE FOR?\nThis course will be relevant for anyone with an interest in the health and wellbeing of young people. You do not need to be of any particular personal or professional background to benefit from this course, but having some basic undergraduate study experience will be helpful to your learning (particularly if in a health related field).\n\nWHAT IS THE MOST INTERESTING THING I'LL LEARN IF I TAKE THIS COURSE?\nYou’ll learn how so much of what happens during adolescence can impact not only the future health of individuals, but the health of the next generation as well. You’ll develop a greater understanding of the key factors impacting upon youth health and learn how to be a better advocate for the health and wellbeing of young people.\n\n                                            Syllabus\n                        Week 1 - Introduction to adolescent health: developmental and ecological perspectives (Part I)  Welcome! Before getting started on this week’s content, be sure to review the materials under the ‘Introduction’ section below to help you get the most out of this course, whatever your learning goals may be. This week we set the scene for adolescent health as a critical area of human health and development. We introduce the conceptual framework used throughout the course, which will assist greatly in building your learning across each week of material. We discuss different definitions of adolescence and young adulthood, and explore how the biological and social transitions associated with this period of life- and our understanding of them- have changed over time.Week 2 - Introduction to adolescent health: developmental and ecological perspectives (Part II)This week we return to our conceptual framework and unpack the key concepts of social determinants of health and risk and protective factors. We explore what these terms mean and how they influence and shape adolescent health and development. We also begin to apply this knowledge at a practical level in terms of the interventions and actions we can take to improve or maintain health and wellbeing during the adolescent and young adult years, or prevent problems from happening in the first place.Week 3 - Major health problems of adolescents (Part I)This week we explore our conceptual framework for adolescent health as it relates to health-related behaviours and states and health outcomes. By that we mean, how do the biological, social, economic and other influences that we have discussed so far play out in terms of adolescent health outcomes (e.g. death and disability) and behaviours (e.g. those relating to sexual activity or substance use)? What are the major health issues affecting young people around the world today, and how does this differ by region, gender and other variables? We will explore the latter question over the course of this week and next, with the focus this week predominantly on sexual and reproductive health and mental health. Week 4 - Major health problems of adolescents (Part II)This week continues last week's focus on the 'health-related behaviours and states' and 'health outcomes' components of our conceptual framework. We will discuss some of the other major health topics and issues affecting adolescents and young adults around the world today, including infectious diseases, chronic illness and disability, nutrition, physical activity and obesity. We will also highlight injury as a leading cause of death and major cause of disability in young people, and build on last week's discussion of sexual, reproductive and mental health. Week 5 - Adolescent health policy, programming and intervention (Part I)This week we set the scene for understanding the policy and practice context of adolescent health and development through reviewing the functions of family and family policy, the value of education as a resource for health, and the wider influences of peers, advertising and marketing, taxation, legislation and social media in shaping adolescent behaviours.Week 6 - Adolescent health policy, programming and intervention (Part II)This week we continue our exploration of the policy and practice context of adolescent health and development by focusing on the role of health services in responding to the burden of disease experienced by young people. We discuss the elements of quality healthcare for young people and what adolescent-friendly health care means at an individual practitioner and service level. We also highlight the challenge of monitoring and communicating the health status of adolescents at a national and global level, why nations need to be held to account for investing in appropriate actions that promote the health of their young people, and how to promote positive and meaningful youth participation.  As this marks the final week of learning material for this course (Weeks 7 and 8 are devoted to the completion and evaluation of Assignment 2 for those interested), we also discuss learning and networking opportunities beyond GAH for those of you who would like to continue this journey.Weeks 7 - 8 (no new content)Weeks 7 and 8 do not feature any new course material and are for the development, submission and peer marking of the second written assignment for those wishing to do so. Please be sure to review the intro video below for some important information before getting started.  We would also greatly appreciate your feedback on this course via the end of course survey below if you have not already done so- it is so critical for us in our efforts to ensure we are providing our students with the best experience possible. Thank you!\n                                    ", "end_date": "2016-07-31T00:00:00Z", "title": "Global Adolescent Health", "price": 0, "instructors": "Susan Sawyer and George Patton", "institution_name": ["University of Melbourne"], "commitment": "4-6 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/learn/teen-health", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-12T00:00:00Z"}