{"selfpaced": false, "topic_name": ["Public & Global Health"], "description": "\n\n                    \n                    \n                    The course will function like a conference, but it takes place over three months rather than two days, and encourages the transformation from passive audience observer to active participant and thought leader.\r\nThe themes to be addressed are:\r\n\r\nGlobal Health Challenges.\r\nMobile Health Opportunities.\r\nEntrepreneurship in Health Care.\r\n\r\nToday, more people have access to a mobile phone than to clean drinking water. At the same time, health systems around the world struggle to deliver cost-effective care. For example, where the United States confronts unsustainably soaring costs and millions of underserved citizens, Sub-Saharan Africa endeavours to provide medical care in the context of infrastructural challenges, economic shortfalls, and the highest disease burden in the world. Throughout India and China, investments in mobile entrepreneurship are reshaping how health care is delivered to massive populations. Meanwhile South America is experiencing a surge of entrepreneurial activity that promises to reshape how its citizens interact with the health system.\r\nTo expose you to the breadth of activity and opportunity, each class will consist of multiple short presentations from renowned experts. Class discussions about these presentations will also take place online. In the era of expansive and ever-expanding access to mobile technology, ideas can be more readily shared and solutions can more readily reach patients in need, wherever they are. We are more connected than ever before, in many ways: through global dissemination of infectious diseases; through shared challenges such as chronic disease burden; and of course through the Internet and telecom networks. Mobile Health Without Borders aims to realize that promise by providing a platform for participants to increase their capacity to have a meaningful impact on global health. To achieve this, students will work closely with classmates from around the world on small group assignments to prepare for the Health Innovation Challenge: an opportunity to work with a global multi-disciplinary team and world-class mentors to design a solution to a health challenge you care about.\n\n                                    ", "end_date": "2014-08-31T00:00:00Z", "title": "Mobile Health Without Borders", "price": 0, "instructors": "Eric Leroux and Homero Rivas", "institution_name": ["Stanford University"], "commitment": "", "subject_name": ["Health & Medicine"], "course_url": "https://novoed.com/mhealth-2014-2", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["NovoEd"], "start_date": "2014-07-27T00:00:00Z"}