{"selfpaced": false, "topic_name": ["Public & Global Health"], "description": "\n\n                    \n                    \n                    Quantitative Methods in Clinical and Public Health Research is the online adaptation of material from the Harvard T.H. Chan School of Public Health's classes in epidemiology and biostatistics. Principled investigations to monitor and thus improve the health of individuals are firmly based on a sound understanding of modern quantitative methods. This involves the ability to discover patterns and extract knowledge from health data on a sample of individuals and then to infer, with measured uncertainty, the unobserved population characteristics. This course will address this need by covering the principles of biostatistics and epidemiology used for public health and clinical research. These include outcomes measurement, measures of associations between outcomes and their determinants, study design options, bias and confounding, probability and diagnostic tests, confidence intervals and hypothesis testing, power and sample size determinations, life tables and survival methods, regression methods (both, linear and logistic), and sample survey techniques. Students will analyze sample data sets to acquire knowledge of appropriate computer software. By the end of the course the successful student should have attained a sound understanding of these methods and a solid foundation for further study.\n \n\nFAQ\n\nHow much does it cost to take the course?\nNothing! The course is free.\n\nWhen will assignments be due?\nThe course is organized into weeks, and each week will have its own set of assignments. Students will be expected to complete their homework each week.\n\nDo I need any other materials to take the course?\nNope, as long as you’ve got a Mac or PC, you’ll be ready to take the course.\n\nWill the course use any textbooks or software?\nYes! We'll have free access to the book \"Principles of Biostatistics\" written by Marcello Pagano (one of the Professors) and Kimberlee Gauvreau.\n\nIn addition to the textbook, we'll use Stata (a piece of software for doing statistical analysis).\n\nThanks to our friends at Statacorp, we'll have free copies of Stata available for all students to use for the duration of the course (Mac and PC only).\n\nDo I need to watch the lectures live?\nNo. You can watch the lectures at your leisure.\n\nWill certificates be awarded?\nYes. Online learners who achieve a passing grade in a course can earn a certificate of achievement. These certificates will indicate you have successfully completed the course, but will not include a specific grade. Certificates will be issued by edX under the name of either HarvardX, MITx or BerkeleyX, designating the institution from which the course originated. For the courses in Fall 2012, honor code certificates will be free.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code : https://www.edx.org/edx-terms-service. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement : http://harvardx.harvard.edu/research-statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form : https://www.edx.org/contact-us.\n\n \n\n                                    ", "end_date": "2013-01-14T00:00:00Z", "title": "PH207x: Health in Numbers: Quantitative Methods in Clinical & Public Health Research", "price": 0, "instructors": "Earl Francis Cook and Marcello Pagano", "institution_name": ["Harvard University"], "commitment": "", "subject_name": ["Health & Medicine"], "course_url": "https://www.edx.org/course/health-numbers-quantitative-methods-harvardx-ph207x", "duration": "13 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2012-10-15T00:00:00Z"}