{"selfpaced": false, "topic_name": ["Public & Global Health"], "description": "\n\n                    \n                    \n                    The Biology of Water and Health from Tufts University is a water sustainability course (PH241x) that examines increasingly critical water-related issues through a distinctly global and interdisciplinary lens.\n\nThis course focuses on Fundamentals of water and its relationship to human health. You will explore the multi-faceted ways in which water and human health are interrelated, including the influence of waterborne pathogens on public health and the central role of water quantity and quality in preserving health through adequate sanitation and hygiene. You will be introduced to a brief history of U.S. water distribution, waterborne disease cases, epidemiological approaches to public health engineering, and historical evidence of lead (Pb) as a water contaminant.\n\nWe hope that the unique interdisciplinary approach of this course gives the general public, as well as health professionals in a variety of fields, a provocative introduction to the public health and human engineering components involved in the provision of safe water and sanitation.\n\nSign up for The Biology of Water and Health – Sustainable Interventions (PH242x) to further expand your knowledge and professional network related to water sustainability. Starts on September 29, 2015. \n\nTufts University is proud to offer the two Biology of Water and Health courses (PH241x &amp; PH242x) in partnership with the Open Education Consortium (OECx). All course content is openly licensed under a Creative Commons Attribution Non-Commercial Share Alike license. After the course ends, materials will be available through edX as well as on the Tufts University Open Courseware website (ocw.tufts.edu).\n\n                                    ", "end_date": "2015-08-04T00:00:00Z", "title": "PH241x: The Biology of Water and Health – Fundamentals", "price": 0, "instructors": "David M. Gute and Jeffrey Griffiths", "institution_name": ["Open Education Consortium (OEC)"], "commitment": "6-12 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.edx.org/course/biology-water-health-fundamentals-oecx-ph241x-0", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-07-07T00:00:00Z"}