{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    Architecture is the crystallization of the spirit of its age, and this description certainly applied to the architecture of Frank Lloyd Wright.  Wright was a leading architect of the 20th century, pioneering Modern Architecture in response to new materials, changes in society, and a new philosophical worldview.  This course addresses Wright’s role in the 20th century and his relevance for our emerging 21st Century. \r\nFrank Lloyd Wright (1867 – 1959). Before Wright, most architecture was based on the past, as we see, for example in Beaux Arts architecture that referred back to ancient Rome.  After Wright, architecture, including the work of the leading European Modern Architects, was based on an honest expression of the functions, spaces, materials, and structure of a building.\r\nWright was born, grew up, and worked in the Midwestern United States, a region that prided itself on being remote from New York, which, Midwesterners felt, was too close to Europe.  In the Midwest, architects like Louis Sullivan, for whom Wright worked, and then Wright himself could develop a uniquely American, modern, and democratic architecture.  In this course we will come to understand how Wright did just that.\r\nWe will begin with a brief overview of Wright’s work, a biographical sketch, and a look at the architecture at the time he began his career. Then we go into some depth on each of the major works of Wright’s career, including his early Prairie Style houses, his California concrete textile houses, Fallingwater, Johnson Wax, and the Guggenheim Museum, and more.\r\nBut we are not done. Next we will look at the culture and technologies that defined the 20th century and Wright’s role in their unfolding. And finally we will look at what Wright meant by Organic Architecture, and how it unifies the cultures of the West and the East.\r\nLEARNING OUTCOMES\r\nOn completing this course you will be familiar with the arc of Frank Lloyd Wright’s career and have an in-depth understanding of some of his key buildings. You will understand how the relationship between Wright’s architecture and that of key European architects, as well as with Picasso’s Cubism and Einstein’s relativity. You will understand how the 20th century decentered us in every aspect of our lives. You will have an understanding of how architecture is the crystallization of its culture, why architecture is called the mother of the arts, and how architecture embodies and even creates our notion of who we are as human beings. And you will have the ability to apply this broad approach to the understanding of art, architecture, and culture to other areas of your interests.\n\n                                            Syllabus\n                        1: INTRODUCTION WEEK\r\n2: EARLY WORK WEEK\r\n3: CALIFORNIA HOUSES AND OTHER WORK WEEK\r\n4: WRIGHT IN THE 1930s WEEK\r\n5: WRIGHT IN THE 1950s WEEK\r\n6: PATTERNS IN WRIGHT’S WORK WEEK\r\n7: WRIGHT AND THE 20TH CENTURY WEEK\r\n8: ORGANIC ARCHITECTURE WEEK\r\n9: WHAT WRIGHT TELLS US ABOUT TODAY WEEK\r\n10: RE-CREATING WHO WE ARE AS HUMAN BEINGS\n                                    ", "end_date": "2015-10-27T00:00:00Z", "title": "Arch402: Frank Lloyd Wright and the 20th Century", "price": 0, "instructors": "John Lobell", "institution_name": ["Open Online Academy, New York"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.ooed.org/learn/frank-lloyd-wright-and-the-20th-century-fall-2014", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["EdCast"], "start_date": "2015-09-01T00:00:00Z"}