{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    The course will analyse major contemporary architectural ideas, ideologies, and projects in the context of both globalisation and specific local contexts. We will trace the development of architecture since the early 90s by discussing the work of some of the most influential architects of our time.\r\nThe critical reflection on contemporary topics will allow students to better understand the buildings and cities which we live in. When talking about the architectural protagonists of today, we will focus on their most recent work. Some references will be made to their earlier work, but the focus will be on how they adapt their thinking to current design tendencies. We will examine the evolution of their work and at the same time try to understand how they react to current challenges and opportunities in our profession and society.\r\nLEARNING OUTCOMES \r\nThe course will introduce participants to the contemporary architecture scene and allow them to position themselves into it. Students will acquire the essential skills for looking at, analyzing and understanding architecture. The final goal is to turn use architecture as a way to look at the places that we inhabit, an action for positive change, and a generator of a vision for making possible worlds.\n\n                                            Syllabus\n                        Week 1: Globalization and Critical Regionalism: Rafael Moneo, Steven Holl; Design and Online Education, Behind the Scenes\r\nWeek 2: Tectonic, Technology and Structure: Renzo Piano, Richard Rogers, Norman Foster\r\nWeek 3: Critical Discourse and Architecture: Rem Koolhaas, Peter Eisenmann, Bernard Tschumi\r\nWeek 4: Surface, Materiality, and Ornament: Herzog &amp; De Meuron, Jean Nouvel, SANAA\u2028\r\nWeek 5: Form, Sign and Sculpture: Frank Gehry, Daniel Libeskind, Santiago Calatrava\r\nWeek 6: Digital Design and Computation: UN Studio, FOA, Zaha Hadid\r\nWeek 7: Sustainability, Resilience and Social Design: Wiliam McDonough, Kongjian Yu, Norman Foster, Giancarlo Mazzanti, Medellin and Bogota\r\nWeek 8: Final Exam TBD\n                                    ", "end_date": "2016-02-29T00:00:00Z", "title": "Arch101: Contemporary Architecture", "price": 0, "instructors": "Ivan Shumkov and Emanuela Giudice", "institution_name": ["Open Online Academy, New York"], "commitment": "2-3 hours", "subject_name": ["Art & Design"], "course_url": "https://www.ooed.org/learn/contemporary-architecture-fall-2015-1746", "duration": "26 weeks", "language_name": ["English"], "provider_name": ["EdCast"], "start_date": "2015-08-31T00:00:00Z"}