{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    From space to architecture: To structure, order and transform space into architecture.\r\nArchitecture 101\r\nTo learn more about architecture 101, we kindly invite you to read about it in the first part of the course description, here. Eventually, also read the description of part 2 here.\r\nArchitecture 101 (part 3: from space to architecture)\r\nIn part 1 of our course, we explore the state of nothingness and start to understand the idea of “place”. In part 2 we learn to transform a place into a space. Now, we are ready for part 3: to transform a space into architecture.\r\nWhat does it mean to transform a space into architecture?\r\n“Architecture is the thoughtful making of space.” Louis Kahn\r\nIn part 2, we learn that space is composed of mind and matter. Now, in order for us to benefit from this matter, we need to put it in order. And this is exactly what architecture is all about. Architecture is about giving a very specific kind of meaning and symbolic value to a series of different things.\r\nIn this part of the course, we will plan, design and construct a system in which to organize and render coherent important matter (that matters to us). A matter of structure and proportions.\r\nBy doing so, we will give a new sense to place and space.\r\nAre you ready?\r\nOur 6-month online journey will be celebrated at Abadir in Sicily, where we will set up our final exhibition.\r\nCourse Structure\r\nWeek 1: materials Week 2: colors Week 3: sounds Week 4: moving images Week 5: animations Week 6: the video Week 7: about the exam Week 8: break / exhibition / graduation party at Abadir, in Sicily\r\nWeek extra: Architecture 101 Summer Camp at Abadir, in Sicily (where we will build for real). If you are still alive by then, this “physical” 5-day workshop is a course in itself and it will soon be officially announced.\r\nWhat will I learn?\r\nTo see architecture like architects do. To explore the ways in which space becomes architecture. To learn that form follows fiction.\r\nWe will also learn a significative amount of extremely interesting (and totally useless) things.\r\nAll of the above refers to the conceptual part of our course. Then, since we love having our students making practical things, you will also learn lots of technical things using a number of interesting applications.\r\nAt the end, what do I make?\r\nA video (with a given set of constraints) in which you will show your built 1 to 1 architecture. If one thousand people finish this part 3, we will have a fabulous collection of 1000 videos representing 1000 architectural concepts.\r\nPrior knowledge\r\nThis is the 3rd part of a tripartite course called Architecture 101. To have followed the first 2 parts (1 + 2) is highly recommended, however not required.\r\nThen, in terms of other kinds of prior knowledge, nothing in particular is required. However, in terms of technical equipment, this course will be easier to follow for those with access to a smartphone or tablet.\r\nYou don’t need a smartphone or tablet. But, as we wrote, we imagined a class with thousands of people lost in their phones, from all around the world. In commuters, we trust!\r\nWorkload\r\nBetween 3 and 7 hours a week. From Monday to Friday, for a total of 6 weeks, you will receive an email with a 15 second-video to watch (to get you in the mood), and a pdf with some instructions for completing an assignment and a series of references (to go deeper in the subject at hand).\r\nThen, you will get to work on your assignment. Once you complete your assignment, you will upload it to the iversity platform and share it on your preferred social media account(s). Ideally Instagram.\r\nThen, during the weekend, we will give you some time to catch up.\r\nAre you ready?\r\n \n\n                                    ", "end_date": "2015-06-08T00:00:00Z", "title": "Architecture 101 - Part III From Space to Architecture", "price": 0, "instructors": "Petronela Nita, Anne-Sophie Gauvin and Stefano Mirti", "institution_name": [], "commitment": "3-7 hours", "subject_name": ["Art & Design"], "course_url": "https://iversity.org/en/courses/architecture-101-part-iii", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2015-04-27T00:00:00Z"}