{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    This free online course is designed to help current or aspiring commercial photographers get to grips with new media and moving image photography.\n\nUnderstand why personal work is key to commercial photographic success\n\nWe’ll begin by looking at the importance of developing your visual sensibility through personal work, where you’re free to push boundaries, make mistakes, pursue your passions and hone your craft.\n\nYou’ll then find out how to create work that is new, exciting and individual – whether in advertising, fashion or editorial photography – in order to secure commissions. You’ll be encouraged to consider the complex interplay between individual approaches to practice and client-led work.\n\nExplore the relationship between still and moving image photography\n\nWe’ll then explore the relationship between still and moving image in commercial photography, looking at how you can embrace emerging media and potential markets for your work.\n\nWe’ll examine the need for a coherent and consistent visual approach across both disciplines; the differences between narrative filmmaking and moving image photography; and the use of video, CGI, animation, illustration and mobile devices. We’ll also consider sound, as well as image, and the technicalities of using a camera to record.\n\nLearn with expert academics and practising commercial photographers\n\nBased on elements of the Photography courses at Norwich University of the Arts, the course will enable you to learn with expert academics, as well as leading commercial photographers, including Andy Earl and Tim Flach.\n\n\n                                    ", "end_date": "2016-03-14T00:00:00Z", "title": "Commercial Photography: Still and Moving Image", "price": 0, "instructors": "James Smith", "institution_name": ["Norwich University of the Arts"], "commitment": "3 hours", "subject_name": ["Art & Design"], "course_url": "http://www.futurelearn.com/courses/commercial-photography?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-02-15T00:00:00Z"}