{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Visual Arts\n                                                            \n                            \n                                                \n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    art-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Introduction to Art: Concepts &amp; Techniques is an art appreciation course created for individuals without any artistic background. This course introduces you to various art movements, cultural influences, artistic genres, artists, and their artwork. The main emphasis of the course is to teach you hands-on studio arts techniques as you conduct personal research and explore your own creativity. While utilizing historical and contemporary art concepts, the course guides you through different time periods. Examining and discussing artwork is a crucial part of this course, encouraging you to express your opinions about art in an intelligent and articulate manner. By the conclusion of the course, you will compile a portfolio of artworks reflective of your research, understanding, creativity, and personal growth. Subjects discussed: Fantastic Art, Mail Art, Black and White Portraiture Photography, Installation Art, and 3-D Art. Art Concepts explored: Line, Shape, Value, Texture, and Color. Art Mediums used: Graphite Pencils, Charcoal, Pastels, Ink, Watercolor, Acrylic Paint, Collage.\n\n                                            Syllabus\n                        Week 1: Art Elements &amp; TechniquesWeek 2: Fantasy &amp; YouWeek 3: Correspondence with MemoryWeek 4: Stories Through the LensWeek 5: Inside the SpaceWeek 6: Personal CollectionsWeek 7: The Artist Critique\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Introduction to Art: Concepts & Techniques", "price": 0, "instructors": "Anna Divinsky", "institution_name": ["Pennsylvania State University"], "commitment": "5-7 hours", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/course/art", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2013-05-28T00:00:00Z"}