{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    This dynamic course focuses on the history of modern and postmodern art from the 19th and 20th centuries, with an emphasis on major works found in the collection of the renowned Art Institute of Chicago.  Painting, sculpture, photography, and other media, placed within a larger socio-political context, will reveal how aesthetic expression proves a compelling barometer of the modern human experience. \n\nFrom the advent of European democracy and the parallel birth of the avant-garde artist, whose singular vision boldly shattered prevailing styles and norms, to the radical rise of abstract painting and the even more provocative introduction of everyday objects into works of art, this course will unfold modernism’s defiant embrace of the new. This course will engage the major issues of twentieth-century aesthetic practice, from Freud’s description of the unconscious and the play of dreams as fertile source material for the artist, to the explosive rise of pop art and the dizzying information age that has profoundly shaped contemporary practice. To closely study modern and postmodern art is to learn how to look at the world, to take notice of form, color, and image, and to respond to the richness of visual and material culture that is all around us. \n\nThis course will not only provide a canonical repertoire of great works of historic art, as well as the context for understanding them, but through the unfolding of such a narrative, these lectures will allow new ways of observing one’s own contemporary world and reimagining its value.\n\n\n                                            Syllabus\n                        Session 1: The Rallying Cry Of The Avant-Garde: Romanticism, Realism, And Impressionism \r\nSession 2: “Primitivism” And The Emotional Power Of Form: Post-Impressionism, Fauvism, And The Expressionists \r\nSession 3: Painted Blueprints Of Utopia: Kandinsky, Mondrian, And Malevich \r\nSession 4: Dada And Surrealism: Courting The Irrational With Chance, Dreams, And Play \r\nSession 5: The Last Gasp Of Modernism – The Heroics Of The New York School \r\nSession 6: Pop And Its Legacy/Minimalism And Its Renewal \r\nSession 7: Critiquing The Institutions Of Art: Earthworks, Body, Conceptual Art \r\nSession 8: The Cacophony Of Postmodernism In The Information Age \n                                    ", "end_date": "2016-11-26T00:00:00Z", "title": "Touring Modernism:  From the French avant-garde to American Pop and Beyond", "price": 0, "instructors": "Lisa Wainwright", "institution_name": ["School of the Art Institute of Chicago"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.kadenze.com/courses/touring-modernism-from-the-french-avant-garde-to-american-pop-and-beyond/info", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Kadenze"], "start_date": "2016-10-01T00:00:00Z"}