{"selfpaced": false, "topic_name": ["Visual Arts"], "description": "\n\n                    \n                    \n                    Contemporary Japanese architecture started with Kenzo Tange, a symbolic figure in the field and a member of the first postwar generation of architects. He played major roles in 2 national events: the 1964 Tokyo Olympics and the 1970 Osaka Expo, but his work received criticism and rejection from younger generations who sought and pursued new trajectories. Through working to surpass previous generations, the discipline of architecture became intensely contested and engaged. As a result, unique approaches towards addressing architectural problems were established, thus contributing to an understanding of contemporary Japanese architecture as differentiated from architecture in the rest of the world.\n\nIn the half-century period after Tange, social conditions in Japan changed radically - domination of the global economy due to the collapse of the bubble economy, proliferation of information technology, population decline, the Great East Japan earthquake, and preparation for the 2020 Tokyo Olympics. During this period of rapid change, what did leading Japanese architects think, and how did they produce their work?\n\nThis course will explore four facets of contemporary Japanese architecture; theory, technology, city, and humans. The course will also span five generations of architects since Kenzo Tange. Through lectures by instructors and discussions with the most influential Japanese architects, the course will trace the development of contemporary Japanese architecture and will consider its future direction.\n\nIn Part 1, we will focus on two of the four facets of Japanese architecture; theory and technology.\n\nThe theory portion will feature discussions with architects who played a significant role in influencing the development of theoretical frameworks that contributed to guiding contemporary Japanese architecture. Terunobu Fujimori, Arata Isozaki, Hisao Kohyama, Hidetoshi Ohno, and Kazuyo Sejima will visit their buildings and discuss the ideas behind their respective works.\n\nThe technology portion will focus on works by architects who explored the use of technology—from techniques used for traditional crafts to computational processes—as a vehicle for their investigations into the conceptualization and production of architecture. Tadao Ando, Shigeru Ban, Manabu Chiba, and Kazuhiko Namba will visit their buildings to discuss the ideas behind their respective works. \n\nIn Part 2, the following leading Japanese architects will discuss their work — Sou Fujimoto, Hiroshi Hara, Itsuko Hasegawa, Toyo Ito, Fumihiko Maki, Satoko Shinohara, Yoshiharu Tsukamoto, and Riken Yamamoto. Don’t miss the second half of this great course!\n\n                                    ", "end_date": "9999-12-31T23:59:59Z", "title": "UTokyo004x: Four Facets of Contemporary Japanese Architecture, Part 1", "price": 0, "instructors": "Kengo Kuma and Yusuke Obuchi", "institution_name": ["The University of Tokyo"], "commitment": "3-4 hours", "subject_name": ["Art & Design"], "course_url": "https://www.edx.org/course/four-facets-contemporary-japanese-utokyox-utokyo004x", "duration": null, "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-06-30T00:00:00Z"}