{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>(Edited: Course Updated April, 2016)</p>\n\n<p>Tired of baking bricks when everyone else is baking super gorgeous bread with a holey crumb and crispy crust? Change all of that by enrolling in \"Sourdough Baking 101.\"</p>\n\n<p>This is the sourdough baking course you need if you are just starting out in sourdough bread baking. In my other courses, I teach how to bake all sorts of sourdough breads, but in this course, I won't load you down with lots of information, just enough so it is easy and fun to bake your first loaf of sourdough. </p>\n\n<p>Then, once you've taken a basic white sourdough loaf, steaming hot, out of your own oven, you will be ready to move on to more complex formulas. </p>\n\n<p>There are only two sourdough bread formulas in this course. I call them \"First Loaf\" and \"Second Loaf.\" We will follow the easy step by step directions of the process together. The first loaf is easy. It is a round boule with a lower hydration dough, which means it is not too wet or sticky. The second loaf is a high hydration dough and is a batard or French style loaf.  Working together, I will show you how to handle a wet, sticky dough. </p>\n\n<p>This course is for BEGINNERS who have no idea of how to bake with sourdough or those who have tried and stumbled. I have eleven years of experience teaching the newbie sourdough baker, so come on! Let's have some fun! You know want to!</p>\n\n<p>This course would make an excellent gift for the aspiring baker in your family circle, whether an older baker or a young new baker. </p>\n\n<p>Some skills you will learn:</p>\n\n<ol><li>How to make and care for your own sourdough starter</li><li>Why it's important to weigh ingredients. </li><li>Gathering some basic baking equipment</li><li>How to mix and fold dough. No kneading here.</li><li>Shaping, scoring and baking the dough.</li><li>What to do after you've baked your first loaf... hint (bake your second loaf!)</li></ol>\n\n<p><br></p>\n\n<p>Some Student Reviews:</p>\n\n<p>by Pam H - Outstanding</p>\n\n<p>This is an outstanding class on sourdough - well written text lectures, great videos and clear recipes/formulas. I've been a bread baker for 40 years - this class has taken my sourdough baking skill to a whole new level.</p>\n\n<p>by Amanda H - Fantastic Class</p>\n\n<p>I absolutely loved Teresa's Sourdough 101 class. Her directions were easy to follow, full of great info, and I was able to bake incredible sourdough bread!!! I loved it so much that I have already signed up for her other three courses. My family and I say \"thank you Teresa\"!!</p>\n\n<p>by Samira M - Very good</p>\n\n<p>For the first time I could bake a bread a reaaly sourdough bread. The course is really good. Simple and direct. Thank you so much Teresa.</p>\n\n<p>by Ban S  - excellent course for sourdough baking</p>\n\n<p>an excellent course for beginners in sourdough baking and excellent instructor with great experience.</p>\n\n<p>by Robin E - More, More, More</p>\n\n<p>Can't get enough! I love Teresa Greenway's courses. She is so complete and does not just leave you hanging. She is there for you just like in a classroom and helps troubleshoot and encourage. Thank you so much I look forward to the future bakes and classes.</p>\n\n<p>by Simon H - Brilliant!</p>\n\n<p>I've checked out many sourdough baking texts and videos but then I discovered Teresa! Absolutely brilliant, not least, Teresa uses highly accurate gram measurements and not flippin' cups (what's more she explains why cups are an inaccurate measure). The course takes the student by the hand and slow, confidently and kindly walks through each step simply. There's no technical jargon and no assumption that the student knows this or that before setting out. The texts are clear, the videos are clear. This is without doubt the best sourdough bread making course I've ever seen. Thank you Teresa!</p>\n\n<p>by Jeni H - Absolutely fantastic!</p>\n\n<p>I have enjoyed this course so much, I'm baking my loafs right now! I found this course answered so many questions I had about making sourdough, I would highly recommend it to anyone starting out!</p>\n\n<p>by Pam H - Outstanding</p>\n\n<p>This is an outstanding class on sourdough - well written text lectures, great videos and clear recipes/formulas. I've been a bread baker for 40 years - this class has taken my sourdough baking skill to a whole new level.</p>\n\n<p>by Trish D - Perfect for beginners</p>\n\n<p>This is another great course from Teresa. I have also completed two other sourdough courses of Teresa's and totally recommend them. If you are new to sourdough....start here and learn from a friendly and informative teacher. Teresa takes you through the process of sourdough baking and you learn at your own pace. Perfect place to start to enter the wonderful world of sourdough baking. A+++</p>", 
    "end_date": null, 
    "title": "#1 Sourdough Bread Baking 101", 
    "price": "20.00", 
    "instructors": "Teresa L Greenway", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587486_d25f_3.jpg", 
    "course_url": "https://www.udemy.com/sourdough-bread-baking-101/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T15:45:46Z"
}