{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Edited: Updated April 2016</p>\n\n<p><strong>Student Reviews:</strong> </p>\n\n<p><em>\"This course and instructor are heaven sent....</em></p>\n\n<p><em>I joined this course after wanting to \"do\" sourdough for many, many years. I am so thrilled with the clarity and completeness of the content, as well as the ready presence and engaged feedback from the instructor Teresa L. Greenway. I highly recommend this course, and will be eagerly investigating any other offerings from this instructor. I am still working through the materials at my own pace, which is another benefit of using this teaching/learning platform.\"</em></p>\n\n<p><em></em><strong><em>And:</em></strong> </p>\n\n<p><em>\"I am very excited to be taking these baking classes, there is nothing like sinking your teeth into a crusty loaf of Sourdough. Teresa is very knowledgeable, and has a passion for baking with sourdough. It is slow enough for a beginner, contains enough information to make a person a competent baker.\"</em></p>\n\n<p>  \t      Have you ever wondered how anyone can bake authentic sourdough bread? You know the kind of bread I'm talking about, with its crispy, crunchy crust, sour chewy crumb and amazing flavor. How do they do that? Well you can bake real sourdough bread in your own home oven, just like the pros do. I will show you how, step by step, it's easy and fun. You will amaze your family and friends. No one will be able to bake a loaf like you can!</p>\n\n<p>By taking this baking course you will have a better understanding of </p>\n\n<ul><li>How to mix and shape dough</li><li>How to handle sticky, wet dough</li><li>Learn ways to get a crispy, blistered crust</li><li>What one thing is absolutely necessary for a great crust</li><li>How to get large holey crumb </li><li>How to develop dough without kneading it</li><li>Why measurements are important</li><li>How to make your own sourdough starter</li><li>What pre-ferments and motherdough are and how to use them.</li><li>Learn to slash/score the dough</li><li>How to follow a formula.</li><li>What baking equipment you might need for baking hearth loaves</li></ul>\n\n<p>And lots more!</p>\n\n<p>You will get answers to questions like: How can I get those large holes in the crumb? How do I take care of a sourdough starter? Can I make the crust shiny? How can I get those blisters on the crust? Can I really bake professional sourdough in my own oven?</p>\n\n<p>  \t      When you are finished with this baking course you will be able to mix, fold, proof, score, steam and bake a loaf of authentic sourdough bread.  </p>\n\n<p>  \t      You will have a better understanding of dough hydration, fermentation, gluten development, baker's percent and where to find resources to join other home bakers who are passionate about home baking real sourdough too.  </p>\n\n<p>  \t      Best of all you will be able to astound your family and friends with an amazing loaf of real sourdough that you baked yourself, in your own home oven.  </p>\n\n<p>  \t      It will take two weeks to <strong>make your own stable sourdough starter</strong> or  you can purchase one online. While getting your starter going, you will learn a short history of sourdough and go over some of the basic techniques including hydration and measuring. Once your starter is stable, we will begin with an <strong>Alaskan sourdough</strong> and then branch out to wetter high hydration dough like <strong>Ciabatta</strong> and <strong>Tyra Loaf </strong>(which includes motherdough). After that we go on to <strong>Blistered Crust Sourdough</strong> and a mixed whole grain and white loaf called <strong>March Madness Sourdough.</strong> </p>\n\n<p>There are also some sourdough dessert formulas including <strong>Forbidden Sourdough Chocolate Cake</strong> and <strong>Ginger Cake</strong>. Several additional formulas and other resources for baking real artisan sourdough are included and I will be adding additional lectures and formulas in the future.</p>\n\n<p><strong>This is a self paced course with no pressure and instructor support when you have any questions. Come on and join us!!</strong></p>", 
    "end_date": null, 
    "title": "#2 Bake Artisan Sourdough Bread Like a Professional", 
    "price": "50.00", 
    "instructors": "Teresa L Greenway", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383612_5575_5.jpg", 
    "course_url": "https://www.udemy.com/rediscover-real-artisan-sourdough-baking/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T00:58:47Z"
}