{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Edited: Updated April 2016</p>\n\n<p>Sourdough Bread baking for breakfast is back! Are your breakfast and brunch menus predictable and boring? Are you looking to add some healthy pizzazz to your meals to impress and please your family?</p>\n\n\n\n\n\n\n\n\n\n<p>How about a stack of butter slathered sourdough pancakes hot off the griddle or a thick slice of freshly baked tender cornbread? Would the smell of baking spicy warm cinnamon rolls be a welcome surprise for a lazy weekend breakfast? What will your family think when you bring out a plate filled with thick soft sourdough tortillas?</p>\n\n\n\n\n\n\n\n\n\n<p>This sourdough bread baking course is the fourth course in a series of sourdough bread baking courses aimed at learning to bake using a sourdough starter. In this course you will learn to bake old fashioned sourdough quick style breads using not only a sourdough starter (it's easy to make your own starter!) but also baking soda and baking powder. These quick breads, often baked for breakfast and brunch, are like the breakfast breads grandma used to bake up including: </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Sourdough Pancakes  </strong></li><li><strong>Overnight Flapjacks</strong></li><li><strong>Buttery Fluffy Biscuits</strong></li><li><strong>Old Fashioned Bundt Corn Bread,</strong></li><li><strong>Cornbread pan loaf with butter crumbs </strong></li><li><strong>Honey Butter Spread</strong></li><li><strong>Skillet Puff Pancakes</strong></li><li><strong>Pan Scones</strong></li><li><strong>Skillet Soft White Sourdough Bread - Incredibly Soft!</strong></li><li><strong>Warm Spicy Sourdough Cinnamon Rolls - So Mouthwatering!</strong></li><li><strong>Delicious Home Made Sourdough Tortillas!</strong></li></ul>\n\n\n\n<p>It's a lot of fun to bake up these quick types of breads and they are great for breakfast and brunch or for a quick healthy snack. You will learn how to make your own sourdough starter with easy day by day instructions, using not only videos but an e-book as well. <br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The free downloadable e-book in the course will help you easily make your own sourdough starter besides tips on how to care for your starter, how to make motherdough and other pre-ferments while explaining hydration and what hydration means in baker's terms. (You can find it now as a free preview for this course and start making your own sourdough starter today).</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Some of the student reviews:</p>\n\n\n\n\n\n\n\n\n\n<ul><li>by Rachael  <strong class=\"redactor-inline-converted\">Great recipes, great instructor!</strong>Teresa has excellent courses, and she makes everything easy to do in our home kitchen! Thanks for creating another great course, Teresa!</li><li>by Trish <strong class=\"redactor-inline-converted\">Great family baking</strong>There is a lot of different recipes based on your sourdough starter. I recommend this course for people with families to share the good sourdough baking. Teresa's videos are so friendly and informative - easy to follow. You will easily be able to bake great recipes for your family to enjoy together. It's a fun course and very good resources to use. A+++</li><li>by Elsie Creason <strong class=\"redactor-inline-converted\">Wonderful sourdough</strong>The recipes are great, well taught and great tips.</li><li>by Kristi Lambert <strong class=\"redactor-inline-converted\">Beautifully Done with Incredibly In-Depth Knowledge</strong>This course is engaging, entertaining, full of eye candy and tons of actionable material! The recipes are heaven sent for me, as I have been searching for breads that are <strong class=\"redactor-inline-converted\">agreeable to my digestive system and my diet</strong> - this course is just what the doctor ordered - and the results are gorgeous! Thanks so much for this beautiful course!!!</li><li>by Anneke <strong class=\"redactor-inline-converted\">Mouthwatering course!</strong>It is such a pleasure to be able to follow step by step what Teresa does. It is the small things that make the course Top of the Pops. The experience, the showing of how thick dough should be, that \"if the dough works against you\", you should let it rest 20 more minutes, things like that, make the course golden.</li><li>by Jean <strong class=\"redactor-inline-converted\">Such a comprehensive course on sourdough baking </strong>Teresa really knows her subject. There are so many different recipes in this course with different types of breads, flapjacks or pancakes, cinnamon rolls etc. <strong class=\"redactor-inline-converted\">Everything looked to scrumptious that I wanted to start baking right away.</strong> I love sourdough and this is one of the most comprehensive courses on the subject. Teresa is very generous with the number of different recipes she included. A great course.</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So jump right in and start your sourdough baking journey today with these fun, easy sourdough bread baking classes. Your family will be happy you did! </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "#4 Old Fashioned Sourdough Baking", 
    "price": "40.00", 
    "instructors": "Teresa L Greenway", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535304_6b8a_6.jpg", 
    "course_url": "https://www.udemy.com/4-old-fashioned-sourdough-baking/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T17:25:44Z"
}