{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Edited: Updated January 2016</p><p>This course, \"Bake the Best Bagels\" will cover several different types of bagels including: </p><ul><li><strong>Sourdough Sesame Water Bagels </strong></li><li><strong>Sourdough Honey Egg Bagels </strong></li><li><strong>Hybrid Onion Poppy Seed Bagels (bagels made with sourdough and commercial yeast)  </strong></li><li><strong>Sourdough Whole Wheat Cinnamon Bagels</strong></li></ul><p>You will learn different methods of making the bagels, including overnight bagels and one day bagels, bagels made with a mixer and bagels made by hand with dough folding.</p><p>We will cover bagel water baths and washes as well as different toppings and methods of toppings. </p><p>You will also learn how to make your own sourdough starter, easily with a day by day method. Sourdough baking has never been so much fun! </p><p>Join me and bake up a batch of the best bagels! You will never again wonder what to make for breakfast or what food is best to take while traveling...bagels, of course!</p><p>Review:</p><p>by Toni  </p><p><strong>Another Win!</strong></p><p>I've taken most of Teresa's Sourdough classes. Not only are the classes very well taught, the results have been consistently successful and she's extremely responsive to posted questions (a few hours or less). For a new baker these nuances add to my confidence and encourage me to explore new baking territory. I never considered baking bagels until Teresa published her latest video course. I don't think I'll ever purchase bagels again!</p><p>This course published Dec 2015</p>", 
    "end_date": null, 
    "title": "#5 Bake the Best Bagels", 
    "price": "20.00", 
    "instructors": "Teresa L Greenway", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694298_a27b.jpg", 
    "course_url": "https://www.udemy.com/5-bake-the-best-bagels/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T20:53:01Z"
}