{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Course Description</strong>\n\n  </p>\n\n<p>This course will prompt you to enter the kitchen and start preparing your own breakfast dishes. Breakfast is a very important meal of the day. Having a full and satisfying breakfast will make you start your day with energy and enable you to carry out your daily activities with ease.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>The course comprise of common East African Coastal dishes like samosas, flour coated potatoes, crepes, bhajias, cutlets among others. Not only are they cooked in homes, but you can also find them in the streets of the old town of Mombasa. They are commonly served as snacks to visitors and also as accompaniments for the 4 o’clock tea.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>This course will show you a step by step procedure and tips of preparing different breakfast meals. You will be able to learn at your own pace and in your own convenient time. You will have unlimited access to the course materials and revise as much as you want.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>You are at the right place if you love homemade food.\n\n  </p>\n\n\n\n<p>\n\n\n\n</p>\n\n\n\n\n\n<p><strong>What are the requirements?</strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>1.       Cooking stove\n\n  </p>\n\n\n\n\n\n\n\n<p>2.       Basic kitchen utensils e.g. cooking pans, mixing bowls, spoons, plates, knife, fork, cooking stick or spatula\n\n  </p>\n\n\n\n\n\n\n\n<p>3.       Ingredients which are provided for each lesson\n\n  </p>\n\n\n\n\n\n\n\n<p> \n\n  </p>\n\n\n\n\n\n\n\n<p><strong>What I’m I going to get from these course?</strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>-          Tips for cooking different breakfast meals\n\n  </p>\n\n\n\n\n\n\n\n<p>-          Learn the preparation process for each dish before cooking\n\n  </p>\n\n\n\n\n\n\n\n<p>-          Learn to cook different meals\n\n  </p>\n\n\n\n\n\n\n\n<p>-          2 hours of Video footage and recipe notes for each dish\n\n  </p>\n\n\n\n\n\n\n\n<p> \n\n  </p>\n\n\n\n\n\n\n\n<p><strong>What is the target audience?</strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>This course is for beginners, people who want to learn the basics and simple ways of preparing their own meals. I have used common kitchen equipment to allow any person with a kitchen to cook some appetizing meals without necessarily investing in modern kitchen appliances. This makes it possible for anyone to make their own meals with the basic utensils they have in their own kitchen.\n\n  </p>\n\n\n\n\n\n\n\n<p> </p>", 
    "end_date": null, 
    "title": "10 Easy Breakfast Recipes", 
    "price": "20.00", 
    "instructors": "Ms Amida Anyanzwa", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796084_2621.jpg", 
    "course_url": "https://www.udemy.com/10-easy-breakfast-recipes/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T18:25:08Z"
}