{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>If you think your Lékué steam case is just for cooking vegetables then think again! This cooking class presents you with a collection of delicious seafood and meat dishes which are fuss-free and fast to prepare. This course is designed to make the most of your microwave and of course your silicone steam case.</p>\n\n<p>The recipes presented in this course are healthy because the food are steamed and not fried. The use of oil is minimized. So whether your aim is a better diet or simply a delicious meal which you can cook in the microwave, then you've landed at the right course.</p>\n\n\n\n<p>Included in the lectures of this course are:</p>\n\n\n\n\n\n\n\n<ul>\n<li>detailed list of ingredient</li><li>approximate cooking and steaming time</li><li>calorie count for those who are careful</li>\n<li>step by step explanation of the cooking process</li>\n<li>a quick actual cooking footage taken in a time lapse with text overlays</li>\n<li>helpful tips and notes</li>\n<li>a downloadable file of each recipe </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>I would appreciate your participation in learning to cook delicious meals using your Lékué steam case. This course is not to promote or endorse any particular product, I'm just simply sharing to you some dishes I've cooked using my Lékué steam case. You can try to cook the recipes taught in this course in any other brand of silicone steam case.</p>\n\n<p> I have provided 12 recipes adapted from a Japanese Lékué steam case cookbook. I look forward to hear from you in the discussion section. </p>\n\n<p>Every recipe serves two people and can be cooked in minutes. Versatile, simple, and healthy - those are the adjectives that describe the recipes you'll learn in this course. </p>\n\n\n\n\n\n<p>Have fun in the kitchen!</p>", 
    "end_date": null, 
    "title": "12 Easy Main Dish  Microwave Recipes Using Lekue Steam Case", 
    "price": "20.00", 
    "instructors": "Haamalu Limited Liability Company, Pearl Ishizaki", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/813318_79d5_3.jpg", 
    "course_url": "https://www.udemy.com/12-easy-main-dish-microwave-recipes-using-lekue-steam-case/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-05T09:33:17Z"
}