{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t Bienvenidos al mejor Curso de como hacer cupcakes y postres donde enseñaremos como preparar deliciosos cupcakes y postres en videos paso a paso, aprenderas diferentes tipos de masas y 20 decoraciones para tus cupcakes, 4 deliciosos postres y 4 Tortas, conocerás cada uno de los ingredientes y utensilios para preparar todas las recetas, nuestro contenido es único y original, no nos saltaremos ni un solo paso, nuestra experiencia en la filmación de cursos nos hace estar seguros de nuestra enseñanza, contamos con mas de 5 años de experiencia y la producción de 10 cursos diferentes, por eso la gran aceptación de nuestros alumnos. ahora estamos en Udemy para que todo el mundo pueda acceder a este super curso.  </p>  <p>  \t En esta serie de videos también aprenderás las preparaciones de las cremas básicas como la chantilly, cobertura de queso crema, el merengue italiano y fondant, con este último realizaremos varias figuras entre ellas una hermosa decoración navideña para cupcakes.  </p>  <p>  \t Otra de las grandes ventajas de nuestro curso es que aprenderás todo sin salir de casa, además los materiales e ingredientes se pueden encontrar fácilmente en el mercado o reemplazar si se desea para lograr nuevos sabores.  </p>  <p>  \t Al realizar este curso tendrás las bases necesarias para iniciar tu propia empresa o sorprender a toda tu familia con deliciosas recetas hechas por ti misma ya que los cupcakes están de moda en todo el mundo y cada dia crece mas y mas la pasión por estos deliciosos ponquesitos ideales para fiestas y eventos, por eso es el momento ideal para empezar con este maravilloso curso.  </p>  <p>  \t Mi consejo siempre es invitar a cada alumno a que practique, a que no tenga miedo de intentar sus propios sabores o recetas, estoy segura que hoy tendrás una visión diferente de los que es la cocina y cuando tengas tus nuevos cupcakes dale tu nombre, cuéntanos y compártelos. ahora te espero en el curso.  </p>", 
    "end_date": null, 
    "title": "Aprende a preparar deliciosos Postres y Cupcakes", 
    "price": "25.00", 
    "instructors": "Lina Marcela Jaramillo", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/172374_ad2b_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-preparar-deliciosos-postres-y-cupcakes/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-24T21:58:20Z"
}