{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t    Este <strong style=\"\">Curso de Repostería Creativa</strong> consta de 40 videos grabados en alta definición (HD) que podrás detener y retomar cuando quieras.  </p>  <p>  \t    El Curso está diseñado para que cualquier persona, no importando ni el sexo, ni edad, aprenda paso a paso desde el equipamiento básico con el que se debe contar para poder aplicar las técnicas en las que explico <strong style=\"\">recetas</strong>, <strong style=\"\">modos de preparación</strong>, para qué sirven las <strong style=\"\">diferentes pastas</strong> y para qué se emplean, todo lo relacionado con el <strong style=\"\">bizcocho</strong>, <strong style=\"\">secretos y tips que te ayudarán a perfeccionar tu técnica</strong> y muchísimo más.  </p>  <p>  \t    En los minutos previos de cada video (donde requiera la preparación) encontrarás las anotaciones de ingredientes y cantidades que debes emplear para cada técnica.  </p>  <p>  \t    El <strong style=\"\">Curso de Repostería Creativa</strong> está estructurado en <strong style=\"\">6 Módulos</strong> y cada módulo puede variar en número de videos según los diferentes temas sobre los que aprenderás. En total tendrás a tu disposición más de <strong style=\"\">280 minutos de grabación</strong> detallada donde explico cómo hago para preparar la Repostería Creativa para mi negocio.  </p>", 
    "end_date": null, 
    "title": "Aprende a Decorar Tartas Fondant de la A a la Z paso a paso", 
    "price": "20.00", 
    "instructors": "Karol Grosz", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266472_7245_6.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-decorar-tartas-fondant-paso-a-paso-de-la-a-la-z/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T13:37:46Z"
}