{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Have you ever wished you could <strong>bake</strong>?</p><p>Not put some pre-made cookie dough on a cookie sheet baking, but <strong><em>real</em></strong> baking, making breads and desserts that you would find in a high end bakery, or items that you grandmother used to bake.</p><p>Have you tried baking before, but did the recipe not turn out, or was confusing to read?</p><p>Have you received baking equipment as a gift, but they're just sitting in a forgotten cupboard collecting dust?</p><p>Have you wanted to take something delicious to the office to share, or to make something yummy for the kids?</p><p>You <strong>can</strong> do it, and it's not that hard.</p><p>In this course, I am going to show you step by step how to make a delicious <strong>banana bread</strong>  that you can make for your family and friends to enjoy.  Everything will be explained, from choosing ingredients, weighing and measuring, and explaining and showing common baking terms used with the recipe.</p><p>You will learn how to adjust this recipe to <strong>your tastes.  </strong>You can add <strong>chocolate chips</strong>, <strong>nuts</strong>, or decide not to.  You can make this recipe <strong>gluten-free</strong>.  When you make your own bread, the choice is all up to <strong>you</strong>!</p><p>I have even added <strong>metric measurements</strong> to this recipe, so people from all over the world can enjoy this course!</p><p><strong><em>You do not need fancy equipment</em></strong> to make this bread.  You will need an oven, bread loaf pans, a few large mixing bowls, spoons, and a handheld electric mixer.  Recommended equipment would include a kitchen scale and a stand mixer, but these are <strong>not required,</strong> they only speed up the process and help with consistency.</p><p>As a bonus, I will also include a lecture on how to make your own <strong>natural vanilla</strong>!  Vanilla is one of the most common and expensive ingredients in a bakers pantry.  By using this lecture, you can make your own vanilla and save money compared to grocery store vanilla.  And you know exactly where it came from, your own kitchen!</p><p>So come and join me and other Udemy students as we learn how to bake together!</p>", 
    "end_date": null, 
    "title": "Baking Essentials: Learn to Make Banana Bread", 
    "price": "20.00", 
    "instructors": "John Pamperin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660016_6f92_2.jpg", 
    "course_url": "https://www.udemy.com/baking-essentials-learn-to-make-banana-bread/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T13:12:58Z"
}