{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t  We all drink and as such are constantly looking for that trusty go-to bar with quality drinks, good atmosphere, and great company. This class will turn your home, or anywhere you are, into your favorite bar. Want a good martini after a long day? Want to impress your friends at your next dinner party? Maybe you just don&#039;t want to get all dressed up to go out and have a drink. This class will help you learn some simple, but impressive cocktails that will turn you into your favorite bartender.  </p>  <p style=\"\">  \t  &#039;Wait- I don&#039;t have all the tools and ingredients needed&#039;  </p>  <p style=\"\">  \t  No worries. All you need is a martini shaker and a wooden spoon to succeed at bartending in this course. In keeping with the Mad Men theme, you will learn how to make a classic martini, old-fashioned, sazerac, gimlet, whiskey sour, and manhattan -all cocktails debuted in the series and have since come back into favor in the mixology world. While we go through each I will talk about some common variations as well as some brief history that about the origins of the drinks. This is less of a formal class and more of a one-on-one with your bartender- you will learn though.  </p>  <p style=\"\">  \t  By the end of this course you will not only know a few great time honored drinks but have the foundation and confidence to explore further into the fine art of bartending.  </p>  <p style=\"\">  \t  I look forward to mixing with you!  </p>  <p style=\"\">  \t  -Kati  </p>", 
    "end_date": null, 
    "title": "Bartend Like A Mad Man", 
    "price": "20.00", 
    "instructors": "Katrina Rodzon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145998_faeb_3.jpg", 
    "course_url": "https://www.udemy.com/bartend-like-a-mad-man/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-12T22:04:13Z"
}