{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>CHEESE –How to Buy, Store, Taste, Pair, Talk About and Serve How to store cheese, cook, serve a cheese plate, pair cheese and wine and find the best cheese types in a Cheese Shop</p><p style=\"\"><em style=\"\">[March 7, 2015: Upgraded preview video and Course image. March 8 2015: Upgraded audio on lectures 1 and 2, made more lectures previewable. Replaced partial transcript on lesson 1 with full transcript. 3/31/15 improved audio on skinny on fat lecture.]</em></p><p><br style=\"\"></p>Do you love cheese?<p style=\"\">\t Whether new to cheese, or already a cheese aficionado, this course will help you deepen your knowledge and enjoyment of our most cultured, kindest food. Get the knowledge you need to buy, store, serve delicious cheese direct from former President of the American Cheese Society and 5 Star Chef Dan Strongin. Feel at home buying cheese direct on the farm, or in a store, among friends or in a restaurant when choosing cheese.</p>  <p style=\"\">\t<strong style=\"\"><em style=\"\">Learn:</em> </strong>  </p>  <ul style=\"\">\t<li>How to buy in any cheese shop to pick the winners with confidence</li>\t<li>How best to store at home to help the flavor grow</li>\t<li>How to pair cheese and wine without worry</li>\t<li>How cheese is made</li>\t<li>Taster without fear, better than a food snob</li>\t<li>How the fat scare got it wrong and why cheese is an important part of a healthy diet, backed by science</li>\t<li>and much more... so enroll now... the low introductory price will begin to rise on April 1.</li></ul><p><br style=\"\"></p>  <p style=\"\">\t<strong style=\"\"><em style=\"\">Learn how to buy in any cheese shop and choose with confidence</em></strong></p>  <p style=\"\">\t What to look for, and what not: how to select the best possible piece with confidence.</p>  <p style=\"\">\t<strong style=\"\"><em style=\"\">Learn a flavor enhancing way to store cheese at home, like a mini cheese cave, and keep it better and enjoy it longer and throw less away</em> </strong>  </p>  <p style=\"\">\t How to make your chosen cheese happy, scrumptious and long lasting, at home, including Cheese First Aid.</p>  <p style=\"\">\t<strong style=\"\"><em style=\"\">Learn the secrets of pairing and serving Wine and Cheese without worry,</em> </strong>  </p>  <p style=\"\">\t without snobbery or fancy lingo. After all, it is our birthright to enjoy it.</p>  <p style=\"\">\t<strong style=\"\"><em style=\"\">Learn her secrets: How Cheesemakers can make thousands of types of cheese from a single source: Milk</em> </strong>  </p>  <p style=\"\">\t How they can preserve the goodness of the milk over time. Since all milking animals are mothers, Cheese is the food of Love. Become the kind at cheese trivia based on a deep understanding of what it is.</p>  <p style=\"\">\t<strong style=\"\"><em style=\"\">Learn how to taste Cheese like a Professional, with confidence, without having to use fancy terms</em> </strong>  </p>  <p style=\"\">\t Share a tasting of Brie with me using what I call the Geography of The Mouth™. Flavor on your terms; Cheese tasting for the rest of us.</p>  <p style=\"\">\t<strong style=\"\"><em style=\"\">Learn why a healthy diet should include cheese</em> </strong>  </p>  <p style=\"\">\t I will share the hard science on why the <em style=\"\">Fat Scare</em> has it wrong, along with the secrets of diet the World Health Organization calls the healthiest diet in the world.</p>  <strong style=\"\">AND MORE, ENOUGH TO BE A CHEESE AFICIONADO!</strong>  <p style=\"\">\t Over 47 short lectures with supporting materials researched and developed by me for my clients, including the California Milk Advisory Board, helping seed the now explosive growth of Farmhouse and Artisan Cheese in the 1990&#039;s and more from others.</p>  <p>\t With the price of good cheese so high, what you will learn in this course will pay for itself many times over, saving you from the disappointment of a bad piece of cheese and helping you to keep cheese delicious longer. Loving cheese is a wonderful thing. Knowing How to love it is many times better! Seize the Cheese! Enroll Now! The price will begin rise on April 1.</p>", 
    "end_date": null, 
    "title": "CHEESE: How to Buy, Store, Taste, Pair, Serve and Enjoy", 
    "price": "50.00", 
    "instructors": "Dan Strongin", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357302_60a8_3.jpg", 
    "course_url": "https://www.udemy.com/cheese-how-to-buy-store-taste-pair-talk-about-and-serve/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T20:30:31Z"
}