{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>Student Testimonial: \"I love your course so far. I wish I discovered it 22 years ago when I first got married! But it's never too late to improve yourself, I am very happy with your suggestions.\"</em></p>\n\n<p><em>\"Every item that Jenna recommended is one that I've been using often since I've watched the course\"</em></p>\n\n<p>My goal is for you to feel equipped to make savvy, resourceful choices with building your kitchen. That each time you cook, you think \"I'm so glad I have this.\" </p><p>**April 2016 update: I'm proud to announce that 85% of the proceeds from this course has been donated to the medical care of rescued cocker spaniels in the NYC area via Abandoned Angels Cocker Spaniel Rescue. </p>\n\n<p>In less than an hour: <br></p>\n\n<ol><li>this course will walk you through the best recommendations for which cookware equipment to invest in, so you spend your money wisely;</li><li>then we get into what basic ingredients to keep stocked in your kitchen so you can always put together a flavorful, simple, nutritious meal without relying on a recipe every time you want to cook;</li><li>and finally, we talk about what to do if you don't get around to using your fresh food or to eating your cooked food.</li></ol>\n\n<p>This course includes both video and text resources, including a few quick quizzes to test yourself, if you so fancy. You'll be able to download shopping checklists for equipment and food, so the guesswork is taken out of the experience.<br></p>\n\n<p><strong>The course does not get into specific food preparation nor does it provide recipes or cooking techniques.</strong></p>\n\n<p><em>The information in the course is based on equipment and ingredients typical to the US, however, I've tried to keep it basic enough that it can translate to any country/culture.</em><br></p>\n\n<p>The course will be updated with new information, so you'll always be up-to-date on the latest experiments and findings.</p>\n\n<p>This course is set up to watch it once and have a better grasp of your options and how to make strategic decisions. You will feel equipped to buy what you need and avoid being distracted by what you don't really need (no matter how nifty is looks/sounds!). As I update the course with new information, you'll be notified to take part in the updates. </p>\n\n<p>If you're starting a new diet, this course is extremely important to helping you stay ON TRACK with the best equipment to make cooking easier, quicker, and tastier. Your health will increase due to eating fresher foods, especially increasing your vegetable intake. This course is even beneficial to vegetarians, where cooking vegetables is a huge component to staying energized and healthy. </p>\n\n<p>Entrepreneurs, freelancers, web designers, coders, work from home-ers - this course was made for you. You sit at a desk all day, most likely at home, and your creativity is paramount. Be efficient with your time in the kitchen and invest in yourself with cooking.</p>\n\n<p>At the end of the day, eating is a necessity of life and it heavily affects health and happiness. The only way to control what you eat is to fix it yourself. With food being so important to life, make the effort to enjoy the process. Start your lifelong relationship with food and cooking with this course.</p>\n\n<p><em>This course is unique because of my personal background. As a certified Health Coach and former Associate Dean of Entrepreneurship and Coaching Skills for a major online nutrition school, I've spent years breaking down \"assumed\" or \"second-nature\" information so it can be absorbed and put into action, whether for personal health goals or business-oriented dreams. I get that the simplest things aren't the easiest things and when it comes to cooking and eating, we may have forgotten how natural it is. And we may need to be taught that intuitive nature again. I take that approach in this course with the goal of getting you into the kitchen.</em> </p>", 
    "end_date": null, 
    "title": "Cooking Essentials: Equipment for Cooking (Novice Cooks)", 
    "price": "20.00", 
    "instructors": "Jenna Edwards", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400590_85df_7.jpg", 
    "course_url": "https://www.udemy.com/kitchenfundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T00:25:26Z"
}