{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t      Cooking Lessons for Dad is for beginner cooks (like my dad) who want to enhance their health by learning how to cook simple healthy, delicious recipes. By the end of this course you will know how to cook an endless variety of delicious, healthy food. I also expect you will be eating lots of healthy, delicious meals, snacks, and desserts! You will be able to crowd out harmful processed and junk foods, and instead eat more health-promoting foods. Very soon your body will be happier, healthier, and more energetic!  Those you cook for will get to enjoy the same benefits, as well. What a gift of love!  </p>\n\n<p>  \t      Would you like to cook more but you are so busy with life and have an overloaded brain? To top it off, you have no cooking experience? No problem! These cooking lessons are perfect for you! Learning to cook is an important part of a healthy lifestyle. These delicious recipes will help to enhance your health and easily fit into a busy schedule.  </p>\n\n\n\n\n\n<p>  \t      In this course you will receive 29 step-by-step cooking demonstrations to show you exactly how to prepare each recipe (and more to come!). I recommend that you try each recipe soon after you have watched the lesson. With these instructions, along with your free cookbook and kitchen reference chart, you can easily master the recipes and have excellent results.  </p>\n\n\n\n\n\n<p>  \t      I suggest that you complete two lessons and their recipes each week. Each recipe varies in the amount of time and preparation needed, but are all easy. I believe you will be pleasantly surprised when you see several recipes with only one, two or three ingredients! I predict that some of these super-simple recipes will become favorites in your home.  </p>\n\n\n\n\n\n<p>  \t      In this course you will learn:  </p>\n\n\n\n\n\n<ul>  \t<p>  \t\t      ·How to cook many easy, healthy, delicious recipes  \t</p>  \t<p>  \t\t      ·Many cooking techniques and methods  \t</p>  \t<p>  \t\t      ·How to measure ingredients and easily remember basic measurement terms  \t</p>  \t<p>  \t\t      ·How to mix and match many of these recipes and have a huge selection of meals!  \t</p>  \t<p>  \t\t      ·How to sneak chocolate in some already delicious recipes (for you mental health of course!)  \t</p>  \t<p>  \t\t      ·How to create new recipes by varying the ingredients  \t</p>  \t<p>  \t\t      ·Time-saving cooking methods and recipes  \t</p>  \t<p>  \t\t      ·How to be a great cook for yourself and others!  \t</p>  </ul>\n\n\n\n\n\n<p>  \t      The first section of recipes is so-easy you will be amazed! They will help to build up your cooking confidence so you can progress to the more advanced but still simple recipes. As you progress through this course the recipes will include a few more ingredients, but not many. Even so, the last 2 recipes are still easy as pie! Really!!  </p>\n\n\n\n\n\n<p>  \t      So what about shopping for the ingredients? The ingredients are mostly:  </p>\n\n\n\n\n\n<ul>  \t<p>  \t\t      ·Easy to find  \t</p>  \t<p>  \t\t      ·Budget-friendly  \t</p>  \t<p>  \t\t      ·Easy to pronounce (except quinoa!)  \t</p>  \t<p>  \t\t      ·Healthy  \t</p>  \t<p>  \t\t      ·Simple  \t</p>  \t<p>  \t\t      ·Not chocolate (but some are!)  \t</p>  </ul>\n\n\n\n\n\n<p>  \t      You will get to use a variety of cooking appliances such as:  </p>\n\n\n\n\n\n<ul>  \t<p>  \t\t      ·Slow cookers (Crockpot)  \t</p>  \t<p>  \t\t      ·Oven (or toaster oven)  \t</p>  \t<p>  \t\t      ·Microwave (optional)  \t</p>  \t<p>  \t\t      ·Blender (or food processor)  \t</p>  \t<p>  \t\t      ·Stove-top burners  \t</p>  \t<p>  \t\t      ·Refrigerator  \t</p>  </ul>\n\n\n\n\n\n<p>  \t      Necessary materials:  </p>\n\n\n\n\n\n<ul>  \t<p>  \t\t      ·Recipe ingredients (some recipes have optional ingredients or possible substitutions)  \t</p>  \t<p>  \t\t      ·Cooking pots with lids  \t</p>  \t<p>  \t\t      ·Baking dishes  \t</p>  \t<p>  \t\t      ·Baking sheets (or cookie sheets)  \t</p>  \t<p>  \t\t      ·Bowls (various sizes)  \t</p>  \t<p>  \t\t      ·Measuring spoons and cups  \t</p>  \t<p>  \t\t      ·Serving, cooking, and eating utensils  \t</p>  \t<p>  \t\t      ·Hot pads  \t</p>  \t<p>  \t\t      ·Aluminum foil  \t</p>  \t<p>  \t\t      ·Wax paper or parchment paper  \t</p>  \t<p>  \t\t      ·Food storage containers or bags  \t</p>  \t<p>  \t\t      ·Paper towels or napkins  \t</p>  </ul>\n\n\n\n\n\n<p>  \t      If you are a beginner, I think this will be the most valuable cooking course you will ever take. You can try it for 30 days and if you do not see its incredible value, you can get you money back with no questions asked.  </p>\n\n\n\n\n\n<p>  \t      I believe this course will change your food world! Many of the lessons will encourage you to try different variations of the same recipe. In addition, lots of these recipes can be mixed and matched together to make an unlimited variety of meals! By the time you are done with this course you will be able to cook so many different healthy, tasty recipes you will never run out of possibilities! You will be able to prepare an endless variety of delicious, healthy meals for yourself and others. As you easily fit these recipes into your life you will crowd out the junk and processed foods. As you replace worthless foods with simple, health-promoting foods you will be on your way to living a longer, healthier and happier life! Learn how to cook and sign up for this course now to start your exciting new cooking adventures!!  </p>", 
    "end_date": null, 
    "title": "Cooking Lessons for Dad: Learn to Cook the Fun, Easy Way!", 
    "price": "20.00", 
    "instructors": "Karen Breyer", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189224_2719_7.jpg", 
    "course_url": "https://www.udemy.com/cooking-lessons-for-dad/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-26T18:35:59Z"
}