{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">Making Your First Cheesecake Is Easier Than You Think…</em></strong></p><p><em style=\"\"></em><em style=\"\">Over 350 Students!</em></p><p>If you enjoy eating cheesecake at restaurants then you&#039;ve probably thought about baking your own.</p><p><em style=\"\">I know I have</em></p><p><strong style=\"\">Find out how to amaze your friends, your loved ones, and most of all, YOURSELF by creating cheesecake from your own kitchen in as little as one weekend—even if you&#039;ve never touched a pan before, have trouble following recipes or have never baked a day in your life.</strong></p><p>I promise after just <strong style=\"\">one day with cheesecake making course</strong> you will be inspired and thrilled with how satisfying <strong style=\"\">cheesecake making</strong> can be! And once you&#039;ve gotten taste of <strong style=\"\">IMPRESSING your friends and family</strong> by having them taste your cheesecake, you will be <strong style=\"\">completely STOKED!</strong> </p><p>The art of crafting cheesecake is in an <strong style=\"\">easy to follow video</strong> format that is <strong style=\"\">CLEAR, CONCISE</strong>, and geared to give you <strong style=\"\">QUICK RESULTS</strong> that will keep you engaged and excited about your developing skills:</p><p>Many times while tasting a cheesecake at a local restaurant, I&#039;ve thought to myself, “hmm I wander what it would taste like if I added a richer chocolate or infused it with beer flavor or mixed fresh raspberry custard into the mix.&quot; I&#039;ve always felt that some cheesecakes could be improved upon with just a little twist in the recipe, but I had never made a cheesecake before. I had been baking breads, sponge cakes, sham tortes almost my whole life, but had never been trained or even ventured into the world of cheesecakes. The truth is I hadn&#039;t tried cheesecake until I was 23 years old. I know I had been missing out on something so delicious and truth be told it is <strong style=\"\">super easy</strong> to make. I had always thought it would be hard, since something this <strong style=\"\">delicious</strong> couldn&#039;t be easy, but it is.</p><p>This course is a summary of the knowledge I have accumulated over the years in my adventures in cheesecake making.</p><p><strong style=\"\">What You Will Learn From This Course</strong></p><ul style=\"\"><li>An introductory understanding on<strong style=\"\"> how to make cheesecake</strong>.</li><li>Knowledge of how to<strong style=\"\"> make your own cheese</strong> that can go into cheesecake.</li><li>The <strong style=\"\">step by step process</strong> of making your first cheesecake</li><li>The <strong style=\"\">simple secret</strong> to make your own pie crust</li><li>A <strong style=\"\">special</strong> traditional ricotta cheesecake.</li><li>The<strong style=\"\"> Best New York Cheesecake Recipe</strong> I have ever tasted.</li></ul><p><strong style=\"\">Requirements:</strong></p><p>Access to a kitchen</p><p>Basic baking tools (pan, mixer, etc…)</p><p><strong style=\"\"><strong style=\"\">What To Do Next:</strong></strong></p><p>Are you ready to bake your first cheesecake</p><p>I&#039;ll walk you through step by step in this course and be available to answer any questions you have along the way. Think of me as your “Cheesecake guide&quot;.</p><p>It might be confusing where to start but let me make it clear yo you the first step is…</p><p><strong style=\"\">Register for this Course.</strong></p><p><em style=\"\">The next step in your cheese cake making journey is waiting.</em></p><p><strong style=\"\"><em style=\"\">Enroll now!</em></strong> </p><p><strong style=\"\">Your satisfaction is assured through Udemy&#039;s no risk, you-can&#039;t-lose, 100%, no-question-asked. Ironclad money back guarantee.</strong> </p><p><strong style=\"\">If for any reason, you aren&#039;t thrilled and satisfied with your purchase, just contact Udemy directly within 30 days and they will refund 100% of your purchase price.</strong> </p><p>What I&#039;m saying is don&#039;t decide now if this <strong style=\"\">CHEESECAKE 101 Course </strong>is right for you. </p><p>Try it out for a full month—risk free.</p><p>If it doesn&#039;t help you <strong style=\"\">overcome any stumbling blocks</strong> to learn to create cheesecake from your own kitchen, if it doesn&#039;t <strong style=\"\">guide you step by step</strong> through the cheesecake process, if it doesn&#039;t <strong style=\"\">take you by the hand</strong> and teach you exactly how to create simple easy to make cheesecake in your own home— even if you have been labeled a bad baker or never thought you could make cheesecake—if it doesn&#039;t show you the easiest way to create cheesecake, <strong style=\"\">easier than you ever dreamed possible</strong>, and if it doesn&#039;t inspire you to be confident to make cheesecake, then I don&#039;t want your money.</p><p><strong style=\"\">You have nothing to lose!</strong></p><p>So how much is this tremendous experience going to cost you? Well, the regular price for <strong style=\"\">Cheesecake 101</strong> is $199. However for a limited time, we are running an introductory offer and <strong style=\"\">you can have it at a discount</strong> for only $99. <strong style=\"\">Thats nearly 50% off-but you must act now!</strong></p><p>Plus, because you stream the course, you can have this information immediately, and get started learning how to make cheese <strong style=\"\">today!</strong> And </p><p><strong style=\"\">It doesn&#039;t matter if it&#039;s 2 in the morning!</strong></p><p><strong style=\"\"><em style=\"\">Click to enroll today in this CHEESECAKE 101 Course!</em></strong></p>", 
    "end_date": null, 
    "title": "Create Restaurant Quality Cheesecake Today In Your Kitchen", 
    "price": "25.00", 
    "instructors": "John Thomas Mattison", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447328_64f3_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-cheesecake-perfect-cheesecake-recipes-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T16:36:15Z"
}