{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This is a course created by a single dad, for single dads. It quickly became the point of reference for not only single dads, but also single moms and students that need to cook for themselves or their kids. It's a compilation of simple, clear, and good recipees. </p>  <p>  \t   The idea is to provide a survival kit for all those that have to cook but don't have much time, or don't particularly like it. The purpose is not to turn you into a 5 star chef, but rather to give you a turn-key solution that guides you from coming up with ideas for your meals (full weeks already designed for you), to planning the trip to the grocery store, to actually making the dishes.  </p>  <p>  \t <strong>I will regularly add new videos, ideas and tips, so stay tuned!</strong>  </p>  <p>  \t   If I were interested in making Savory souffles accompanied by a choice of Coq au vin, Chicken with truffles Joannes Nandron, and Sausage and Tomato Paella, I'm pretty sure I could find at least ten YouTube videos telling me exactly what to do. <span>All I'd need is a kitchen the size of a football field, an assistant, and a few extras hours per day in prep time.  But what if I don't have that? What if I'm just a single, working parent that needs to make a decent meal for my kids after work?</span>  </p>    <p>  \t So, here's what's great about this course. No dishes with names we can't pronounce, requiring time we don't have. Just simple stuff and most of all, good ideas. After a long day at work, or school, coming up with ideas is a daunting task. The question: \"what can I make?\" is sometimes harder than: \"how do I make it?\"  </p>  <p>  \tMy goal is to keep developing groups of recipes covering a full week at a time. You'll learn both the \"what\" and the \"how\", so you can rest assured you'll always have a plan.  </p>", 
    "end_date": null, 
    "title": "Dad is cooking!", 
    "price": "20.00", 
    "instructors": "Luca Avellini", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170992_9832_29.jpg", 
    "course_url": "https://www.udemy.com/dad-is-cooking/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-22T16:26:43Z"
}