{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Kennst Du das Gefühl, wenn deine Freunde und Verwandten dich besuchen kommen und erwarten, dass sie bei dir nicht nur Spaß haben, sondern auch kulinarisch von dir verwöhnt werden? </p><p>Unangenehm, oder? Denn genau das ist doch der Punkt, der deine Freude an diesen Besuchen beeinträchtigt: Es ist einfach schwer für dich, wie für viele Andere auch, von jetzt auf gleich eine Idee zu haben, wie du einfache, leckere Rezepte in Nullkommanix zaubern kannst, mit denen du echt Eindruck machst. </p><p>Oder möchtest du dein Date vorher erst mal mit geschmacklichen Offenbarungen verführen? Oder bist du jemand, der am liebsten aus wenigen Zutaten Gerichte zaubern möchte, die Freunde ins Staunen versetzen? </p><p>Dann bist du hier genau richtig. In diesem kleinen Online-Kochkurs zeige ich Dir insgesamt 12 Gerichte, die nicht nur absolut lecker sondern mit meiner Anleitung auch schnell nachzukochen sind. </p><p>Mein Ziel ist es, dir Rezepte zu präsentieren, die zu Hause leicht machbar sind und auch funktionieren. Ich zeige dir in den Videos Schritt für Schritt, wie die Rezepte zubereitet werden und wie du sie appetitlich auf dem Teller anrichtest. Denn das Auge isst ja bekanntlich mit und ein überladener Teller sieht bei weitem nicht so lecker aus wie einer, auf dem die Speisen in angenehmen Portionen ansprechend arrangiert sind. </p><p>Du erfährst außerdem, welche Küchengeräte wirklich nötig sind und wo du sie in guter Qualität preiswert bekommst, wenn sie dir noch fehlen.<span></span></p>", 
    "end_date": null, 
    "title": "Das perfekte Menü - Kulinarische Hochgenüsse für Zuhause", 
    "price": "20.00", 
    "instructors": "Marcel Prenz", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660164_45c1.jpg", 
    "course_url": "https://www.udemy.com/das-perfekte-menue-kulinarische-hochgenuesse-fuer-zuhause/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T16:55:22Z"
}