{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Welcome to this online cooking class called \"Delicious Japanese Lunch Sandwich Maker Recipes\". This course will show you just how versatile Japanese dishes can be. </p>\n\n<p>Packed with layers of flavors from Japan. You'll learn how to make use of your leftover yakisoba, spaghetti napolitan or even yakitori. There's also recipes for what they call \"katsu sando\" which means a sandwich with fried breaded filling that is really popular in Japan. And bolder sandwich recipes which makes use of natto (fermented soybeans), chikuwa (fish cake), hijiki (a type of seaweed), and kinpira gobo (side dish made with burdock root).<br></p>\n\n\n\n<p>In each section, you will learn a new sandwich recipe. Under each section you'll find three lectures in which you'll have a detailed list of ingredients, step by step explanation of the cooking procedure as well as a fun timelapse cooking video with text overlays, and a printable file of the recipe. You'll also learn things about Japanese cooking from the tips and pointers I've shared in the lectures.</p>\n\n<p>I have provided 10 sandwich maker recipes for you to start with and I will keep updating this course with new lectures. I am looking forward to hear from you in the discussion section.</p><p><br></p>\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Delicious Japanese Sandwich Maker Recipes for Lunch", 
    "price": "20.00", 
    "instructors": "Haamalu Limited Liability Company", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/811274_f840_2.jpg", 
    "course_url": "https://www.udemy.com/delicious-japanese-sandwich-maker-recipes-for-lunch/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-03T04:33:13Z"
}