{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Crockpot Cooking Lessons for Dad is for beginner cooks (like my dad) who want to enhance their health by learning to prepare simple, healthy, delicious meals in a crockpot (or slow cooker). By the end of this course you will know how to use a crockpot to cook a large variety of of easy, healthy recipes. Preparing more home cooked meals will help you to improve your diet and enhance your health. These crockpot recipes will save you time and effort in preparing delicious food. Often it is hard to fit healthy cooking into a busy lifestyle. by the end of this course I expect you will be eating lots of healthy food! In addition, you can cook in a crockpot when you do not have access to a kitchen.  A crockpot is a great tool that lets you prepare amazing recipes with just a little hands-on time and effort.  </p>\n\n<p>  \t      In this course you will have instructional lessons and well as step-by-step cooking demonstrations. You can take this course at your own pace. I suggest when you are ready to start cooking in your crockpot, you try one new crockpot recipe each week. Before you make the assigned recipe you be able to watch me prepare the recipe in the cooking lesson to get a general idea how to make it. Later you can watch the cooking lesson again as you make the recipe. This method will make it so easy for you to be successful with each recipe. I am also here to answer any questions you have about the course and recipes.  </p>\n\n\n\n<p>  \t      In this course you will receive many step-by-step cooking demonstrations to show you exactly how to prepare each recipe (and more to come!). With these instructions, the free cookbook, and some practice, you can easily master the recipes and have excellent results.  </p>\n\n\n\n<p>  \t      In this course you will learn:  </p>\n\n\n\n<p>  \t      How to use a crockpot (or slow cooker).  </p>\n\n\n\n<p>  \t      The different varieties of crockpots, slow cookers and their functions.  </p>\n\n\n\n<p>  \t      How to cook many easy, healthy recipes in a crockpot.  </p>\n\n\n\n<p>  \t      How to adapt recipes for the crockpot.  </p>\n\n\n\n<p>  \t      How to create new recipes by varying the ingredients.  </p>\n\n\n\n<p>  \t      How to fit healthy cooking into a busy life.  </p>\n\n\n\n<p>  \t      This cooking course is made for beginners that have no or little cooking experience. These course will also be appreciated by busy people who already know how to cook and want to learn more about healthy crockpot cooking.  </p>\n\n\n\n<p>  \t      The ingredients for these crockpot recipes are:  </p>\n\n\n\n<p>  \t      Easy to find  </p>\n\n\n\n<p>  \t      Healthy  </p>\n\n\n\n<p>  \t      Budget friendly  </p>\n\n\n\n<p>  \t      Simple  </p>\n\n\n\n<p>  \t      Easy to pronounce  </p>\n\n\n\n<p>  \t      Tools for this course:  </p>\n\n\n\n<p>  \t      A crockpot (or slow cooker)  </p>\n\n\n\n<p>  \t      Measuring spoons and cups  </p>\n\n\n\n<p>  \t      Cutting board  </p>\n\n\n\n<p>  \t      Sharp knives  </p>\n\n\n\n<p>  \t      Serving, cooking, and eating utensils  </p>\n\n\n\n<p>  \t      This cooking course will really help you to fit healthy cooking into your busy life with little hands on time and effort. No cooking experience is needed. You do not even need a kitchen! By the time you are done with this course you will know how to cook many delicious recipes so you can eat healthy everyday! As you replace worthless processed foods with simple health-promoting foods, you will be on your way to living a longer, healthier, and happier life! Sign up for this course now to start your exciting, new crockpot cooking adventures!  </p>", 
    "end_date": null, 
    "title": "Easy, Healthy, Crockpot Cooking! : Cooking Lessons for Dad!", 
    "price": "20.00", 
    "instructors": "Karen Breyer", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398558_8920_2.jpg", 
    "course_url": "https://www.udemy.com/easy-healthy-crockpot-cooking-cooking-lessons-for-dad/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T22:59:30Z"
}