{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Learn new and exciting sandwich maker recipes which you'll surely enjoy on your break time. The recipes are simple and easy to follow.</p>\n\n<p>The sandwiches are Japanese inspired, you will find that in some sandwich recipes, I will be using some common Japanese ingredients which may be new to you but definitely worth a try.</p>\n\n\n\n\n\n\n\n\n\n<p>You'll find three lectures in each section. The first lecture gives you the list of ingredients you will need so you can prepare it before you make the sandwich. In the second lecture, you'll learn the cooking procedure. You'll also find the actual cooking videos which are filmed in a timelapse format with text overlays at the end of the second lecture. That is the highlight of this course which makes it fun and exciting. The third lecture is the recipe for the sandwich. You can also find the downloadable PDF file of the recipe should you want to print out and have a hard copy.</p>\n\n\n\n\n\n<p>One great take away you'll actually learn from this course is that no matter how simple the ingredients you are using, as long as the combination is right, you'll get your perfect sandwich. Just try a few of the recipes from this course and you'll know what I mean. The sandwiches, even though it's meant for snacks, nothing should stop you from making it for breakfast, lunch or any time of the day. <br></p>\n\n\n\n\n\n\n\n\n\n<p>Make wonders using your friendly sandwich maker. Preheat, have fun in the kitchen and most of all, enjoy your sandwich!<br></p>", 
    "end_date": null, 
    "title": "Easy to Prepare Break Time Japanese Sandwich Maker Recipes", 
    "price": "20.00", 
    "instructors": "Haamalu Limited Liability Company", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856308_39b6_3.jpg", 
    "course_url": "https://www.udemy.com/easy-to-prepare-break-time-japanese-sandwich-maker-recipes/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-22T03:45:44Z"
}