{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<span>In this course, you will learn how to cook various delicious and healthy food easily.</span>  </p>  <p style=\"\">  \t    We explain the steps clearly and detail. Using ingredients with affordable prices, not using any preservatives at all (because we know that you also will not choose food which contain preservatives). Not using flavor chemicals because we only want to produce a super natural food.  </p>  <p style=\"\">  \t                Do think in this course will use many equipment ?  </p>  <p style=\"\">  \t                Take it easy! We don&#039;t use many equipment moreover in general we will always meet them at home.  </p>  <p style=\"\">  \t                In this cooking course video also give information about benefits of the ingredients used in these food, so you don&#039;t need to afraid to choose these food. And also I have designed the course to be simple to understand with put the text in each step.  </p>  <p style=\"\">  \t                Moreover if you are a beginner who have not enter into the culinary world, I&#039;m sure you can make this food. If you are a super busy person, you also don&#039;t need to afraid because to make these food don&#039;t need much time, so your time will not be taken up.  </p>  <p style=\"\">  \t                The final of making various food will make your dining table become special because you make them <strong style=\"\">PERFECT</strong>!  </p>  <p style=\"\">  \t                In each section, you will learn the following :  </p>  <ul style=\"\">  \t<li>Introduction of each food</li>  \t<li>Ingredients of each food</li>  \t<li>Learn step by step easily</li>  \t<li>How to serve each food</li>  </ul>  <p style=\"\">  \t                Take this course <strong style=\"\">NOW </strong>and feel how<strong style=\"\"> LUCKY </strong>you to take this course.  </p>  <p style=\"\">  \t                Learn and try to cook these various food for your family, people around you and especially <strong style=\"\">YOURSELF</strong>!  </p>", 
    "end_date": null, 
    "title": "Easy Cooking: Make Various Delicious and Healthy Foods", 
    "price": "20.00", 
    "instructors": "Cooking Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/395560_9afc_2.jpg", 
    "course_url": "https://www.udemy.com/easy-cooking-make-various-delicious-and-healthy-foods/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-16T07:25:45Z"
}