{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">We assume our food purchases and day-to-day behavior is healthy and just &#039;right&#039;. We take it for granted. This course is about going beyond this assumption and seeing there improvements we can make on the food we purchase and on how we eat it or use it.</p><p style=\"\">The course enables you to discover the main elements being sound and healthy supply chains, so that you can be aware of the impacts of your choices on your health, the environment and communities around the world. This course is also meant for teachers in primary or secondary schools that are interested in raising awareness of the wider implication of food choices.</p><p style=\"\">Material included is ranges from documents to power point presentations giving concrete examples of how to increase the effectiveness of your food choices. The food industry is usually considered relatively environmentally and health friendly. You do discover how the opposite is instead true in many cases, and you can act effectively in favor of your well-being.</p><p style=\"\">The course may take a relatively short time to complete, depending on your time available. We would say a time range between 2 weeks and 1 month is feasible.</p><p style=\"\">When you complete this course you will be able to choose more confidently and to use food in ways that benefit your health, your wallet and the environment. In many cases, this is helping also communities making that food available for you. You will be able to live a win-win choice everyday.</p>", 
    "end_date": null, 
    "title": "Environmental impacts of food industry: your choices count", 
    "price": "25.00", 
    "instructors": "Carmen Miletta Cossa, Davide Parisse", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513982_f43d_2.jpg", 
    "course_url": "https://www.udemy.com/environmental-impacts-of-food-industry-your-choices-count/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T20:07:04Z"
}