{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>In this crash course, learn various ideas that will help you to understand and appreciate food on a higher level! Don't waste any more time not enjoying food to it's fullest!  <strong>Enroll Now!  </strong><em>Course Creation - February 29, 2016</em></p><p>Over <strong>1,0</strong><strong>00 students</strong> enrolled!<br></p><p><strong></strong></p><strong>Understand the Seven Simple Steps Needed to Improve Your Food IQ and Enjoy Your Favorite Foods to their Fullest.</strong><ul><li>Learn what makes a great hamburger</li><li>Learn what kinds of sauces work well with each shape of pasta</li><li>Learn what it takes to eat an amazing steak</li><li>Learn how to find the good chocolate and stay away from the imposters</li></ul><p><strong><br></strong></p><p><strong>Content and Overview</strong><br></p><p>In this crash course, you'll learn how to surround yourself with fantastic food. Whether you're food IQ is just sprouting or you're a seasoned, mature foodie, you'll gain a knowledge of how to get the best out of your favorite food and how to enhance your food satisfaction. </p><p>You'll start off by learning about a great American classic - The Hamburger! You'll get the low down on what it is that makes a great burger. You'll also gain a firm awareness of how to make your burger taste better.<br></p><p>Next, you'll learn about pasta. You'll understand the difference between pasta that has been cooked correctly and pasta that hasn't. You're food IQ will begin to expand as you explore multiple combinations of sauces and pasta shapes!<br></p><p>Then, we'll talk about steak.  Who doesn't love a great steak.  You'll learn the characteristics of a great steak and why they're so important. You'll also gain a firm understanding of how to make your steak taste better.<br></p><p>Next, you'll learn about ice cream. You'll understand the difference between low quality ice cream and high quality ice cream. You're food IQ will begin to soar as your appreciation for Ice cream all its creamy goodness, expands beyond your comprehension!</p><p>Then we'll examine the sandwich and the true way that a sandwich should be made. We'll discuss the layers and how each one interacts with the others! This course will take you to places you never dreamed could exist.</p><p>Then we'll examine the different seasoning mistakes that are made and how to correct them. We'll discuss chocolate, cakes, fruit and so on! This course will take you to a realm you never dreamed of!<br></p><p><br></p><p><strong>By the End of the Course You Will Be Able To:</strong></p><ul><li>understand the concept of great hamburgers and steaks</li><li>understand the essence of delicious ice cream and chocolate</li><li>understand the ins and outs of pasta and pasta sauces</li><li>season your food to perfection</li><li>understand the secret to an amazing sandwich</li><li>make your salmon taste incredible</li></ul>", 
    "end_date": null, 
    "title": "Food, Food and More Food: Crash Course to Boost Your Food IQ", 
    "price": "25.00", 
    "instructors": "Pippin Jag", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/772096_00d7.jpg", 
    "course_url": "https://www.udemy.com/food-food-and-more-food-crash-course-to-boost-your-food-iq/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-23T19:59:57Z"
}