{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">You can find a million books and articles, thousands of websites, and hundreds of courses on the topic of wine…and all promise to &quot;give you a set of new skills&quot; or &quot;get you tasting like a wine expert&quot; or &quot;prepare you for the “rigors” of wine tasting&quot; or even to train you to do a proper &quot;sensory evaluation&quot;…</span>  </p>  <p style=\"\">  \tUm…what? Taste wine like an expert? Learn how to do a proper sensory evaluation? Who the hell cares about that! What about us real people? I&#039;m not trying to be a professional wine judge, nor a snobby wine critic, or even a master sommelier, whatever the hell that is. I just want to enjoy wine to the fullest, and be able to walk the walk, and talk the talk of wine, at least to know enough to totally diss those country-clubber types! I just want to drink this stuff and not look like a goober doing it! And I want to do it right now.  </p>  <p style=\"\">  \tThat&#039;s what Professor Boyer and this course is all about. Real talk to real people about the real deal of this most awesome beverage. This is a truly practical and tactical introduction to the enjoying and understanding wine. Wine is the beverage of moderation, of education, of socialization, and of civilization—and that is no exaggeration. A radical move from beer and hard spirits to wine is underway here in the US, and is creating a younger generation of drinkers that enjoy wine as part of their diet, social interactions, and lifestyles. And they are thirsty for the wine knowledge!!! Stop dipping your toe in the water, let&#039;s get wet…with wine!  </p>", 
    "end_date": null, 
    "title": "Get Wine-Smart", 
    "price": "50.00", 
    "instructors": "John Boyer", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366802_6fcc.jpg", 
    "course_url": "https://www.udemy.com/get-wine-smart/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T18:27:36Z"
}