{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Do you suffer from lactose intolerance, gluten intolerance, constipation, irritable bowel syndrome, yeast infections, allergies or asthma? All these conditions have been linked to a lack of good bacteria in the gut.</p><p style=\"\">It can be argued that antibiotics, pasteurisation, antibacterial soap and disinfectant are just making us sicker!</p><p style=\"\">Your body needs healthy probiotic bacteria to digest, absorb and utilise the nutrients in the food you eat. Lacto-fermented food is a way of introducing and maintaining a healthy population of these probiotic bacteria inside your body.</p><p style=\"\">Would you like to learn how to grow your own nutrient dense and organic vegetables in your garden (whatever the size) to offer your family the best possible nutrition? No previous gardening experience is necessary as I will teach you everything you need to know to begin harvesting your own fresh vegetables.</p><p style=\"\">Would you like to learn how you can ferment this home grown produce and turn them into long lasting, nutritious and tasty food to share with family and friends?</p><p style=\"\">This video based online course will teach your all you need to know about growing and using vegetables and fruit to make tasty and healthy fermented recipes.</p><p style=\"\">In this course you will learn</p><p style=\"\">-what is fermentation</p><p style=\"\">-equipment required.</p><p style=\"\">-what vegetables are good to ferment and what are not.</p><p style=\"\">– the process of fermentation.</p><p style=\"\">-learn what the best companion plants for eggplant are.</p><p style=\"\">-learn how to organically manage pests on your brassicas.</p><p style=\"\">-how to grow beetroot and make Beetroot Kvass.</p><p style=\"\">-how to grow organic plums to make Slivovitz.</p><p style=\"\">-how to grow apples trees in an urban setting for a fermented beetroot and apple dish.</p><p style=\"\">-how to grow organic tomatoes to make your own fermented tomato sauce as an alternative to the sugar laden supermarket tomato sauce.</p><p style=\"\">-How to grow daikon and won bok to make your own kimchi.</p><p style=\"\">-secrets to growing great cabbages for sauerkraut.</p><p style=\"\">-how to turn those giant marrow into a wonderful healthy dish full of natural probiotics.</p><p style=\"\">-Learn how to grow and make aubergine, sunflower petal and chilli pickle.</p><p style=\"\">and much more…..</p><p style=\"\">With just under 2 hours of video lessons you can study at your own pace and schedule. Re visit lessons as you wish. At any time you can contact me, Janet Luke, the teacher if you have any questions.</p><p style=\"\">Are you ready to learn these century old food preserving skills to take you and your family to new healthy heights?</p>", 
    "end_date": null, 
    "title": "Growing and Preparing Your Own Lacto-Fermented Food ", 
    "price": "35.00", 
    "instructors": "Janet Luke", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445502_8d7a_2.jpg", 
    "course_url": "https://www.udemy.com/growing-and-preparing-your-own-lacto-fermented-food/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T05:52:08Z"
}