{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Journey into the world of mixology with Ben Stoller, the veteran instructor of the renowned Harvard Bartending Course.</strong></p><p>With over 20 years of professional bartending experience and more than a decade teaching the Harvard Bartending Course, Ben will give you insider's tips and tricks to succeed in the industry. This course is designed to turn beginners into naturals, and give experts new material to become even better mixologists.<br></p><p>Want to learn how to make popular drinks like Martinis, Manhattan's and Old Fashioned's? This course offers you the tools and insight you need to mix any basic cocktail, and the confidence to approach making ones you've never heard of before. </p><p>Along the way, you will also master the tools a bartender uses everyday on the job, and get insider advice on getting jobs in the service industry.</p><p>This course covers the essential material taught by the Harvard Bartending Course, a historic class founded in 1963 to educate the next generation of bartending greats, and taught in the heart of Harvard University's campus. Now you too can learn the essentials of mixing drinks in just one hour. </p><p>But enough talk. Let's get behind the bar of the historic Queens Head Pub at Harvard and take a closer look at what it takes to make it big in this industry.<br></p>", 
    "end_date": null, 
    "title": "Harvard Bartending Course: Become a Master Mixologist!", 
    "price": "20.00", 
    "instructors": "Ben Stoller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750304_bb17_4.jpg", 
    "course_url": "https://www.udemy.com/harvardbartendingcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T17:11:06Z"
}