{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>We&#039;ll look at how how to make an awesome veggie burger with lots of flavor and the right texture and cooking method for putting on a bun with all the fixings.</p>There will be an introductory section to give you an overview of the main components of a phenomenal veggie burger, and then we&#039;ll dive right in to 10 different veggie burger recipes,which will show you<p> a variety of techniques and flavors to make the right veggie burger for any occasion.</p><p>I&#039;ll explain what I&#039;m doing as I go through - and more importantly why I&#039;m doing it so that you can learn to improv on the basic recipes and start making your own creations.</p><p>Each section and recipe has an accompanying video, so you can see exactly what I&#039;m doing and I can talk you through my thought process. You&#039;ll also get a PDF of the course notes and recipes to keep with you in your kitchen as you try them for yourself!</p><p>If you want to cook healthy, tasty vegan food but don&#039;t know how or where to start, and you want to learn how to make amazingly tasty - and surprisingly healthy - veggie burgers, this class is for you!</p><p>Note: All of the recipes are vegan, sugar-free and oil-free, and most are soy-free, gluten-free, and nut-free. If you have any other dietary restrictions, I&#039;m happy to help you find substitutions.</p>", 
    "end_date": null, 
    "title": "Healthy, delicious, homemade veggie burgers", 
    "price": "35.00", 
    "instructors": "Heather Nicholds", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513262_92c5_4.jpg", 
    "course_url": "https://www.udemy.com/veggie-burgers/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T01:10:04Z"
}