{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t   This course is for anyone who wants to discover the basics of working with Ayurveda herbs and spices.  </p>  <p style=\"\">  \t Students DO NOT need to be an Ayurveda practitioner or go into the complexities of Ayurveda practice to enjoy this course.  </p>  <p style=\"\">  \t   This course was developed so that everyday people could begin to enjoy the simplicity of working with recipes that include the use of spices and herbs often found in the meals of India and from Ayurveda dietary and healing practices.  </p>  <p style=\"\">  \t The reason is:  </p>  <p style=\"\">  \t   1.Foods made in this way are so very delicious.  </p>  <p style=\"\">  \t   2.They are so easy to make &ndash; simple and fast.  </p>  <p style=\"\">  \t   3.The use of these spices and herbs are a great way to offer a variety of ways to enjoy vegetables.  </p>  <p style=\"\">  \t   4.They also aid the body in digestion and other healing modalities.  </p>  <p style=\"\">  \t   Here is what is included:  </p>  <p style=\"\">  \t   Recipes included with full video instruction are:  </p>  <p style=\"\">  \t   1. Fire up your digestion with a delicious morning tea called Agni Tea. This tea has made a huge difference in people&#039;s digestive abilities.  </p>  <p style=\"\">  \t   2. Discover Ghee for cooking.  </p>  <p style=\"\">  \t   3. Kitcheri, a most delicious Mung Dahl porridge that is the staple in India. It is easy to make, affordable and oh so healthy.  </p>  <p style=\"\">  \t   4. Coconut, Cilantro, Ginger Chutney: cooked and raw versions. These chutneys are fantastic as a condiment to every meal.  </p>  <p style=\"\">  \t   5. Green Beans Subji: We used green beans to make this dish that you could make with any vegetable. So simple and flavorful!  </p>  <p style=\"\">  \t   6. Raita &ndash; Another delicious version using the herbs with Asparagus  </p>  <p style=\"\">  \t   7. Coconut Millet with spices and herbs  </p>  <p style=\"\">  \t   The course has 6 (each about 10 minutes in length) instructional videos, with recipes and educational text.  </p>", 
    "end_date": null, 
    "title": "Healing Foods with Ayurveda Cooking", 
    "price": "25.00", 
    "instructors": "Susan Teton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135538_919d_5.jpg", 
    "course_url": "https://www.udemy.com/healing-foods-with-ayurveda-cooking/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-19T06:01:45Z"
}