{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\"> Home Wine Making For Complete Beginners</em> is a course designed to familiarize individuals with the joys of home winemaking! <strong style=\"\">You CAN make wines of your own choice in your home, at an affordable price, to your own palette</strong>.  </p>  <p style=\"\">  \t   You will require several items to make wine, however, these are readily available from your highstreet stores, or if not, then on ebay etc.. <strong style=\"\">you could be making wines of your choice within the next few days.</strong>  </p>  <p style=\"\">  \t   Length / duration:  </p>  <p style=\"\">  \t   Structured as a mix of video tutorials, <strong style=\"\">showing you recorded footage of actual wines being made in a home kitchen,</strong> for your convenience there are fact slideshows and several text documents for your referral for conversion rates etc..  </p>  <p style=\"\">  \t   Why take this course? Why surely everyone has at some time wanted to make or thought of making a wine of their own design in their home?  This course will facilitate your understanding to adequately do this and stay with you for the duration of memory.  Make wine again and again in your home at a fraction of the costs of local bars, and entertainment venues.  Stock your own supply in your home and welcome friends and family to the wonders you can make..  Its a journey, and one we&#039;ll equip you to start in good company.  </p>", 
    "end_date": null, 
    "title": "Home Wine Making for Complete Beginners", 
    "price": "25.00", 
    "instructors": "Mr Ian Moore", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/98756_9bc7_5.jpg", 
    "course_url": "https://www.udemy.com/home-wine-making-for-complete-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-28T14:03:50Z"
}