{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Are you looking for a way to bake fresh homemade bread</strong> without a bread machine?  Maybe you've always wanted to try your hand at bread baking, but don't want to invest in an expensive stand mixer.</p>\n\n<p>With a few basic ingredients and simple tools that you probably already have, you will be baking dinner rolls that taste like you've been baking for years even though its your first time.  </p>\n\n<p>At the end of this course you will be able to confidently bake homemade dinner rolls to share with friends and family. </p>\n\n<p>How will it feel to finally be able to contribute something <em class=\"redactor-inline-converted\">homemade</em> to your kids' school bakesale?</p>\n\n<p>In the course We’ll go over:</p>\n\n<ul><li>basic tools and ingredients you need to start baking bread at home.</li><li>how to test your yeast to make sure it is alive and well.</li><li>how to mix your dough the easy way, without kneading it.  </li><li><em>AND</em> 3 different ways to shape your dinner roll dough.</li></ul>\n\n<p>I created this course for the home baker who wants to learn how to bake bread without having to buy any fancy equipment or hard to find ingredients. </p>\n\n<p>In the course, you will find video lessons that show you in detail what your dough should look like every step of the way. There is also a downloadable recipe book, tools guide and an ingredients guide.</p>\n\n<p>You can complete this course in an hour or two and have your first batch of hot, fluffy dinner rolls under your belt this weekend!<br></p>\n\n<p>If bread baking has been hit or miss for you, or if you've never tried to bake bread at home before, then this is the course for you!<br></p>\n\n<p>Enroll in the no knead dinner roll course now and amaze your friends &amp; family with delicious and beautiful homemade dinner rolls.<br></p>", 
    "end_date": null, 
    "title": "How to Make No Knead Dinner Rolls", 
    "price": "25.00", 
    "instructors": "Kalisha Blair", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/800072_9dad_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-no-knead-dinner-rolls/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T19:11:22Z"
}