{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Do you love sushi?</strong> Want to learn how to make sushi yourself and:</p><ul><li>Save $100’s or $1000’s per year &amp; eat sushi more often?</li><li>Treat your friends &amp; family and get them begging for you to make more for them?</li><li>Discover the possible risks of sushi that if you don’t learn how to easily avoid can send you straight to the hospital?</li><li>Make delicious sushi rolls from a variety of classic, western and experimental types?</li><li>and much, much more…</li></ul><p>If you answered yes to any of these questions, <u>this course is for you</u>.</p><p>Hi, my name is Gabriel, and I’ve been making sushi for over 15 years and eating it since I was 3 years old. I’m very passionate in sharing this information with you so you can learn how to make your very own sushi in less than 60 minutes from rice bag to chopstick.<br></p><p>You’ll be able to look over my shoulder and up close while <strong>I show you step-by-step</strong> how to easily &amp; quickly roll your own sushi.</p><p>This course is a comprehensive guide which also includes also a section on the history of sushi, health benefits, tools needed, and even side dishes that go well with your meal. It’s unlike other courses which just shows you how to make it. <em>Yes, this is the full meal deal.</em></p><p>This course will pay for itself in no time, in savings, winning friends through their tummies, and best of all, being able to eat it any time you want, as much as you want!</p><p><strong>Sign up now</strong>, and you could be making amazing sushi for your next meal!</p>", 
    "end_date": null, 
    "title": "How To Make Sushi With Sushi Express", 
    "price": "30.00", 
    "instructors": "Gabriel Both", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738920_c959.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-sushi/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-23T14:19:44Z"
}