{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>If you always check out the pies when you go to a diner, then How to Bake  Diner-Style Pies is course for you! </strong></p><p><strong><strong>How to Bake Diner-Style Pies</strong></strong> picks up where the companion course - <em>How to Bake an Apple Pie Just Like Mom! </em>leaves off, by teaching students a variety of baking and pie crust finishing techniques, some very cool baking hacks, and how to bake a number of delicious pies - just like you get in a Diner!  You will learn to make:<br></p><ul><li>Lemon Meringue Pie</li><li>S'mores Chocolate Cream Pie</li><li>Butter Tarts</li><li>Different styles for pie crust edging - your pies will Rock!</li></ul><p>You will be baking with me – right in my kitchen! Just like the beginner course, <em><em>How to Bake an Apple Pie Just Like Mom!</em></em>, I will teach you how to make pastry dough and pie crust that you can use in sweet and savoury recipes, expanding your meal planning menus that will ultimately save time and money, by learning to fill up your freezer.   At the end of this course you will have created and baked a number of elegant and tasty pies – you will have fun showing off!</p><p><strong><strong>How to Bake Diner-Style Pies</strong> will enable you to Create Beautiful and Delicious Pies! Course includes FREE ecookbook!</strong></p><p>Here is a quote from one of my students:</p><p><em>\"I know a good thing when I see it. Love to bake. My pie crusts were like cardboard. Getting better! Thanks for all you hard work sharing you wonderful gifts.</em><em>\" Carry</em></p><p><strong>Learn and Master pie baking Step-by-Step with an Experienced Pastry Chef and Baker.</strong><br></p>  <ul><li>Learn professional finishing techniques to create beautiful pies!</li><li>Baking is very creative</li><li>Receive Experienced Advice on the right baking equipment</li><li>Use Ready to print lists for equipment, recipes</li><li>Learn the easiest way to mix a batch of shortcrust pastry dough</li><li>Discover that using baking hacks makes baking pies easy and lots of fun!</li></ul>            <p><strong>An Easy and Fun Course to Learn Everything You need to Make Pie crust and Baking Yummy Pies</strong></p>  <p>I will teach you helpful baking hacks to get it right the first time – mixing the dough, rolling your pastry, and pulling an aromatic, scrumptious pie out of your oven.  After years of experience that includes baking hundreds of pies, I have applied continuous improvement principles and refined the process. You will learn how a little organization can save lots of time!</p>  <p><strong>What <strong>How to Bake Diner-Style Pies</strong> includes:</strong></p>  <p>I designed this course for bakers at all levels, everyone who is curious about baking – or just wants a new experience and to have fun baking.  With 16 lectures, and less than 60 minutes, this course will take you from learning what equipment and ingredients you need to my favorite pie baking hacks that have you completing six different types of baked pies.</p>  <p>I have provided you with templates for shopping, what basic baking equipment to get, and ingredients to stock your pantry with. You will learn how to make pastry quickly, using a food processor. All of the recipes we cover in the lectures are included in the resources sections – for you to print out, including <strong>BONUS </strong>recipes for you to try <strong><em>in an ecookbook - Easy as Pie RECIPES Vol I!</em></strong></p>  <p>You will be mixing pastry dough, learning pie baking hacks and making your pies right alongside me, in my kitchen!</p>  <p>Completing this course will enable you to expand your cooking repertoire, baking pies for school bake sales, hosting dinner parties – offering a home baked pie to the next neighborhood pot luck. It will be time to show off your newly acquired skills!</p>  <p>At the end of <strong>How to Bake Diner-Style Pies</strong> students will be asked to post a photo of one of their finished pies, and to update the Baking Self-Assessment completed in the first section.  </p>  <p>The best part about taking and completing the course?  The homework is delicious! So for an amazing Baking Experience, sign up for this course now!  Over 800 students and growing!</p><p><br></p><p>#baking experience, #diner-style pies, #diner food, #baking, #piecrust, #bakingpies, #bakinghacks, #learntobake, #learnwithudemy, #how to make pastry dough, #how to make pie crust, #lemon meringue pie, #chocolate cream pie, #butter tarts, #bake, #online baking course</p>", 
    "end_date": null, 
    "title": "How to Bake Diner-Style Pies", 
    "price": "20.00", 
    "instructors": "Judy Kahansky", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492136_049a_10.jpg", 
    "course_url": "https://www.udemy.com/easy-pie-baking-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-02T21:10:42Z"
}