{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t        Ever wonder how to make those delicious vinaigrettes and salad dressings you find at most restaurants? Tired of store bought chemical and sugar filled salad dressings and vinaigrettes? Finally an in-depth interactive learning course created and taught by cookbook author &amp; TV host Chef Keith Snow, that will transform your love of salads by teaching you how to make amazing home made dressings and vinaigrettes, saving you money and allowing you to eliminate store bought processed foods your cupboard.  </p>  <p>  \t      Making a salad dressing or vinaigrette is so easy yet most people are eating store bought dressings and vinaigrettes that are made with GMO (genetically modified organisms) sourced oils. Ranch dressing is total crap!!  </p>  <p>  \t      Those of you that love the salad at Olive garden and other restaurants will love this course. You will be able to make dressings and vinaigrettes that taste better then most restaurants and contain only healthy ingredients.  </p>  <p>  \t     A salad is only as good as the dressing or vinaigrette used to dress it. My recipes are tried and true, thousands of people worldwide have used my recipes with great success.  </p>  <p>  \t     This in-depth course not only shows you basic technique but also explains how vinegar is made, oil is produced and what makes up a vinaigrette dressing. You will learn how each component from oil to vinegar to flavorings helps to make the basic dressing and vinaigrette amazing.  </p>", 
    "end_date": null, 
    "title": "How To Make Salad Dressings And Vinaigrettes", 
    "price": "20.00", 
    "instructors": "Chef  Keith Snow", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96700_882e_5.jpg", 
    "course_url": "https://www.udemy.com/healthy-homemade-salad-dressings-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-24T19:13:19Z"
}