{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t    Ever dreamt of baking fabulous artisan bread at home to wow your friends and family? Tired of baking bread that resembles a house brick? Want to be confident that you are baking healthy, tasty bread from ingredients you can trust? Then this is the course for you!  </p>  <p>  \t      Using high quality video the course takes you through the whole process of baking artisan bread at home using the traditional English sponge and dough technique.  </p>  <p>  \t      Our clear and thorough course guides you step by step through the various stages of artisan bread baking, and we give you you an understanding of the reasons why slow fermentation makes so much better bread. By gaining insight into how fermentation, gluten development and other factors affect your bread the course not only enables you to make slow fermented bread in your own kitchen, but gives you the confidence to improvise, devise your own recipes, and further enhance your skills.  </p>  <p>  \t      The course shows you how to make round loaves, batons, baguettes and fougasse. And alongside the video we provide you with downloadable tried and tested recipes (slow white loaf, granary, wholemeal, semolina raisin and fennel, apricot and cinnamon) and instructions that you can print and keep.  </p>  <p>  \t Artisan bread is made with time,  </p>  <p>  \t So are the happiest people.  </p>  <p>  \t Slow down,  </p>  <p>  \t Learn to bake.  </p>", 
    "end_date": null, 
    "title": "How to  Bake Real Artisan Bread", 
    "price": "20.00", 
    "instructors": "DAN MCTIERNAN", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86096_ada3_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-bake-real-artisan-bread/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-30T16:30:57Z"
}