{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>New Update as of March 18, 2016</p><p>This is the one course the wine industry does NOT want you to take. Don't be fooled by the mixed reviews for this course. Wine industry \"experts\" hate that I have exposed their con artistry and have retaliated by trashing this course with low reviews. Actual real people who aren't connected to the wine industry are leaving mostly \"5\" reviews. Please read the individual reviews and judge for yourself.</p><p>***</p><p>The world of wine can seem overwhelming to the beginner. \"How am I supposed to remember thousands of producers over 50 years?\" \"Will I look cheap or stupid if I order this wine?\"</p>  <p>Unfortunately, the wine industry is a rapidly growing world wide big business. And it is often in the business of fooling and intimidating consumers into thinking \"more expensive\" equals \"better.\"</p>  <p>In this course, TJ Walker teaches you how to see through the elaborate cons used by the wine industrial complex to part you from your money. Yes, wine can be a great, life-enhancing experience. But you don't need to devote half your free time or disposable income to enjoy drinking wine.</p>  <p>This course is not for the aspiring wine snob, sommelier or someone who wants to show off his/her \"good taste\" by bragging about a fancy wine collection. This course is for people who are new to wine and want to enjoy wine while spending the least amount of money and time possible learning about all the ins and outs of wine.</p>  <p>The course is filled with simple, practical advice and how to tips on how to get the most enjoyment and value out of every glass and bottle of wine you buy and drink.</p>", 
    "end_date": null, 
    "title": "How to enjoy wine and not get conned by the wine industry", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/778914_21d0_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-enjoy-wine-not-get-conned-get-by-the-wine-industry/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-01T13:40:47Z"
}