{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Are you prone to cooking the same food, in the same way but wish you were more adventurous?</span>  </p>  <p style=\"\">  \t     Do you actually know how to tell if food is seasoned right? Is your meal balanced or is it too sweet?  </p>  <p style=\"\">  \t     Learn fundamental concepts of good cooking that are reusable across all recipes.  </p>  <p style=\"\">  \t     This course is for anyone who want to improve their cooking ability and consistently produce tasty meals without following any recipe cards.  </p>  <p style=\"\">  \t     One day I was feeling adventurous following the recipes of an outstanding celebrity chef, were I needed to get hold of a particular Bavarian sausage as it added the right flavour “that made the dish”. I popped down to my local supermarket and low and behold they were all out (well, they never actually stocked it). So was the dish doomed, yes … not because I didn’t have the sausage I didn’t how to replicate with another ingredient to get the same affect.  </p>  <p style=\"\">  \t     Therefore, I learned how to taste properly, flavour pair and balance tastes and this course is the journey of it.  </p>  <p style=\"\">  \t     I break down the course so you can learn to taste properly, at the primary taste level and then how to learn flavour pairings from your favourite meals.  </p>  <p style=\"\">  \t     This course is more FUN than functional but it will expand your “foodie” experience and turn you from chef-groupie to rock-star cook!  </p>  <p style=\"\">  \t     However, this course is not for everyone:  </p>  <ul style=\"\">  \t<li style=\"\"> If you are an extreme fussy eater and not willing to try new foods (you will have to try different foods to develop you palette in this course)</li>  </ul>  <ul style=\"\">  \t<li style=\"\"> Expert recipe followers who can get hold of every rare ingredient required for their meals (ALL INGREDIENTS IN THIS COURSE CAN BE FOUND AT ANY LOCAL SUPERMARKET)</li>  \t<li style=\"\"> Lazy people – you will need to dedicate time to expand your knowledge by dissecting flavours of tasty meals (Ideally once a week bit minimum one a month)</li>  \t<li style=\"\"> People on fad diets as there is eating involved (including chocolate)</li>  \t<li style=\"\"> Don’t want to cook for other people period (if you are not a confident cook then this course is for you)</li>  </ul>  <p style=\"\">  \t     Change the way you think about food!!  </p>", 
    "end_date": null, 
    "title": "How Food Should Taste", 
    "price": "20.00", 
    "instructors": "Imran Hussain", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/195110_51a5_3.jpg", 
    "course_url": "https://www.udemy.com/how-food-should-taste/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-07T14:58:01Z"
}