{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Hi, welcome to my course on Indian cooking . Love Indian food? Want to make flavorful Indian curries? Then join me in 60 exciting episodes from SizzlingPots Indian Culinary World, and I will prove, that it is not hard to cook Indian food.</p>\n\n<p>I will teach you how to make delicious dishes in your own kitchen and at your own pace. If you are a beginner, then I will show you how to master Indian cooking. If you’re an expert cook, the techniques and methods I have shown here will let you cook smarter, faster, and healthier.<br></p>\n\n<p>Step by step I’ll take you through the art of Indian cooking- you will learn about the top spices and herbs that flavor Indian food and techniques like tempering that show how and when to use these ingredients.<br></p>\n\n<p>My unique method of Cooking Patterns will teach you how to make hundreds of tasty creations by following just 9 repeatable patterns. And finally, you will see these patterns in action, as you learn the top 25 restaurant favorite recipes based on these patterns. In no time, you will enter a fascinating world with you as the star.<br></p>\n\n<p>Sounds interesting? There’s more. I will teach you about the cookware that you will need for cooking Indian food and their replacements. Confused on where to begin? We have it covered with videos that will get you started right away and guide you on stocking up your pantry with essential items. Too many spices to remember? Just learn the magic of five popular Indian spices that impart flavor and taste to Indian cooking.</p>\n\n<p>No more searching the Internet for recipes - now you can create your own unique dishes! Join us at SizzlingPots Indian Culinary World and become certified as an expert in Indian Cooking<br></p>", 
    "end_date": null, 
    "title": "Indian Culinary World - Master the art of Indian Cooking", 
    "price": "50.00", 
    "instructors": "Jyoti Sawant", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465334_4dc1_8.jpg", 
    "course_url": "https://www.udemy.com/indianculinaryworld/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T22:23:13Z"
}