{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>If you ever wondered what it's like to be a vegetarian and felt like you would probably try it for yourself only if someone gave you the most important information about life as a vegetarian then you are in the right place. </p><p><strong>A Beginner's Guide to Life as a Vegetarian.</strong><br></p><p>This course is designed specifically for experienced carnivores curious about meatless existence. You might not be even totally sure whether a vegetarian lifestyle is for you. This course will give you an objective 360 degree view of the subject to help you make an informative decision before you make any changes to your diet. </p><p><strong>Content and Overview<br></strong></p><p>The course starts with covering the most common reasons for turning a vegetarian to assist you with identifying your own motivation as it improves the chances of successful transition. A comprehensive list of pros and cons of vegetarianism will challenge you to think for yourself next time you hear contradicting claims about positive and negative effects of vegetarianism.</p><p>A separate video is dedicated to a common worry of not getting enough protein when on a plant diet and answering the question if it is possible to get an adequate amount of protein from eating plant based food.</p><p>Lots of people would go through similar challenges during the transition. If you know about possible challenges in advance you will be more prepared for the journey. There is a videos that covers five most common challenges of vegetarian newbies..</p><p>If you finally decide to take the plunge a video about possible ways to go through with it will assist you with picking the way that suits you most.<br></p><p>There are no recipes included in this course because of vast free resources available online with countless vegetarian options for any taste. You should have no problem creating your own menus when you are ready to start  </p><p><strong>By the end of the course you will have a good idea about:</strong></p><ul><li>what it takes to be a vegetarian;</li><li>whether you want to become a vegetarian or not;</li><li>painless way to transition from a carnivore to a vegetarian.</li></ul>", 
    "end_date": null, 
    "title": "Introduction to Life as a Vegetarian", 
    "price": "25.00", 
    "instructors": "Tatiana Kelsh", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628138_f75b_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-life-as-a-vegetarian/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T18:24:26Z"
}