{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>We'll have four major levels of ITA (International Tea Academy) certified Tea courses include this one you'll take (Foundation / Intermediate / Milestone / Mastery). The ITA certified tea course - Foundations of Chinese Tea is also available on Udemy right now, this course is focus on: </strong>Chinese Tea Ceremony Part 1: The Art and Science of Brewing Green Tea. <strong>After you complete 4 level of our courses (include currently available online courses and another upcoming courses), we'll have a final exam post on the last level (Mastery level) on Udemy, after you pass the exam (The exam will be easy if you learning every single levels seriously), you'll achieve the ITA tea courses completion certification.</strong></p><p><strong></strong>This ITA certified intermediate (Level 1) online tea course course will help you clarify your understanding of the different varieties of traditional tea ceremonies by looking at:</p><p>1. Where the tea ceremonies came from;</p><p>2. How the tea ceremonies were developed;</p><p>3. How to properly practice the different tea ceremonies;</p><p>4. What it takes to judge the quality of a tea ceremony;</p><p>5. How to utilize the methods of the various proper tea ceremonies to accurately evaluate and appreciate teas.</p><p>After you complete this level:</p><p>No matter where you are,</p><p>who you talking to,</p><p>or how busy your lifestyle,</p><p>you’ll use what you have learned from this course to enrich your life:</p><p>1. You’ll make amazing friends through your participation in tea culture.</p><p>2. You’ll bring tea into your daily life in a fresh, new way, resulting in a whole new level of health and relaxation. </p><p>3. Also, this course will help you start an amazing new career in tea. After you complete this ITA certified Intermediate Tea Course, you will feel even more confident talking about tea than some people who have been working in the tea industry for over a decade.</p><p><strong>As a special\ngift, we are offering a special coupon code to all students enrolled in this\ncourse. Not only will you be able to enroll in our other tea courses covering\ndifferent levels of mastery with the lowest possible tuition, but you can also\nget our tea books accompanying each of our online courses, all of which go into\neven greater detail about the art and business of tea, at discounted prices.\nAfter you complete the course, you will be granted International Tea Academy\nCertification, which will be of tremendous benefit to the development of your\nfuture career in tea.\n\n</strong><strong></strong><br></p><br>", 
    "end_date": null, 
    "title": "ITA Certified Intermediate Tea Course - Chinese Tea Ceremony", 
    "price": "20.00", 
    "instructors": "Shana Zhang", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286330_70d9_6.jpg", 
    "course_url": "https://www.udemy.com/ita-certified-online-tea-course-intermediate-level1/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-23T05:48:28Z"
}