{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  My 5 video lessons and on-the-go audio lessons are rich in details, fun to watch or listen to, and drenched in Italian culture.  </p>  <p>  \t  The class will take you through a four-course meal for two. Step-by-step you&#039;ll learn to make a starter (aperitivo), a first course (primo), a second course (secondo), a side dish (contorno) and a dessert (dolce).  </p>  <p>  \t  Authentic Italian dishes are mostly made with 5 ingredients. Besides mastering an Italian dinner, you&#039;ll learn to principles that guide Italian cookery: how to handle garlic and onion in your sauces; how to craft and cook pasta; how to be dose your ingredients, and how to correctly pronounce food and dishes in Italian.  </p>  <p>  \t  I&#039;ll be with you every step of the way. And I won&#039;t bore you.  The point is not to watch me do everything for hours on end, but to give you well-edited, fun, informative and engaging video lessons that you can replay until you internalize the process. In 20 minutes you will learn how to cook and present a full-fledge Italian romantic dinner that takes 2 hours to make.  </p>  <p>  \t  Plus, I&#039;ve also included a podcast of my recipes, which you can listen to while cooking. And don&#039;t forget to download my Italian glossary, shopping list with quantities for each ingredient and a converting chart for those who use grams. That way, you buy what you need, and nothing more. All my courses end with a recap on time management in the kitchen to give you the confidence and speed of a real expert.  </p>  <p>  </p>  <p>  \t   This course is open to all levels of cooks. And the only requirement for my students is access to a kitchen and a pinch of enthusiasm!  </p>", 
    "end_date": null, 
    "title": "Italian Romantic Dinner", 
    "price": "25.00", 
    "instructors": "Fulvio Paolocci", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415362_ccde_2.jpg", 
    "course_url": "https://www.udemy.com/followfulvio-italian-romantic-dinner/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T21:29:33Z"
}