{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Course Description</strong></p><p><strong></strong>In this course, you will be presented with 10 easy to make Japanese dish recipes. It includes a combination of main dishes, side dishes and soups. These recipes are </p><ul><li>Simple</li><li>Delicious</li><li>Healthy</li></ul><p>These are recipes that your family and friends will love and that you'll want to continue to prepare for them over the coming months.</p><p>The lectures in this lecture are in English. Each lecture has three parts. The first part of the lecture presents the 7 steps in making the dish. The second part is the cooking video. The last part of the lecture are some useful notes and tips for cooking.</p><p>At the end of the course is the list of ingredients and recipes for the dishes discussed in the class.</p><p><strong>What are the requirements?</strong></p><ul><li>Basic cooking utensils: pan, knife, chopping board</li></ul><p><strong>What am I getting from this course?</strong><br></p><ul><li>10 recipes of simple Japanese dish made easy</li><li>Make amazing Japanese recipes including the main course, side dish and soup.</li><li>Make new recipes which you can continually serve at home for the following months.</li></ul><p><strong>Who are the target audience?</strong></p><ul><li>Anyone who wants to learn simple and easy to make Japanese dishes at their home.</li></ul><p><span></span></p><ul><li><strong></strong></li></ul>", 
    "end_date": null, 
    "title": "Japanese Cooking Class: 10 Easy To Make Recipes from Japan", 
    "price": "20.00", 
    "instructors": "Haamalu Limited Liability Company, Pearl Ishizaki", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/727954_29ba_2.jpg", 
    "course_url": "https://www.udemy.com/japanese-cooking-class-10-easy-to-make-recipes-from-japan/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T13:15:25Z"
}