{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Celebrity Juice Diet Helps Jessica Alba Improve Health and Looks!</strong></p>  <p>Are you trapped in a <strong>vicious lifestyle</strong> of health destroying acidic foods? Are you <strong>overweight</strong>? Have you had a checkup with your doctor with a <strong>green light</strong> for juice dieting?<br></p>  <p>If you answered <strong>yes </strong>to the questions above this <strong>high alkalizing</strong>, <strong>low sugar</strong> 7-to-10 day juice cleans is just for you!<br></p>  <p>Introducing the juicing team of <strong>Attorney Daniel Hall</strong> and <strong>Dr. Scott Brown</strong>. Daniel holds a nursing degree from the University of Texas and worked at the <strong>Mayo Clinic</strong>.  Scott has a background in <strong>biochemistry</strong> from Indiana University at Bloomington. <br></p>  <p>Both Daniel and Scott have personally experienced remarkable <strong>health benefits</strong> from juicing.</p><ul><li>The first is that both experienced <strong>dramatic weight loss</strong> on extended juice dieting of 30 to 60 days.  </li><li>This included a surprising and <strong>dramatic surge in energy</strong>.</li><li>They experienced another surge in energy in the <strong>short term cleanse </strong>used to film this course. </li></ul>      <p>There is no more powerful social proof than that of <strong>Australian Joe Cross</strong> who says that “<em>six years ago I looked like I swallowed a sheep.</em>” At that time, he weighed 308 pounds’ <strong>avoirdupois</strong> from years of chowing down on boatloads of pastries and pizza.  </p>  <p>Joe put himself on a <strong>juice diet</strong> for 60 days.  Then he followed a <strong>vegetarian diet</strong> for two years after that. </p>  <p>Aussie Joe now enjoys his perpetual <strong>ideal weight</strong> with regard to his <strong>body mass index (BMI)</strong> and to his <strong>basal metabolic rate (BMR)</strong>. His journey is covered in the <strong>award-winning documentary</strong>, Fat, Sick and Nearly Dead.<br></p>  <p><strong>Enroll</strong> now. <br></p>  <p>Every day that passes is a missed <strong>opportunity</strong> at weight loss. <br></p>  <p>This course comes with a <strong>30-day</strong> money back guarantee fulfilled on a no-questions-asked basis by Udemy staff. <br></p>  <p>Enroll right now by pressing that <strong>blue button</strong> up there to the upper right corner of your screen as you read this. <br></p>  <p>Don’t waste a second to master a <strong>healthy</strong> and more <strong>energetic</strong> lifestyle today! </p>  <p>Waiting to <strong>help</strong> you inside,</p>  <p><strong>Daniel Hall, J.D.</strong> and <strong>Scott Brown, Ph.D.</strong><br></p>  <p><strong>P.S.</strong> Enroll <strong>now</strong>!</p>", 
    "end_date": null, 
    "title": "Juice Cleansing for Weight Loss, Intestine and Liver Repair!", 
    "price": "20.00", 
    "instructors": "Dr. Scott Brown, Daniel Hall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728100_d130_2.jpg", 
    "course_url": "https://www.udemy.com/juice-cleansing-for-weight-loss-intestine-and-liver-repair/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T15:43:30Z"
}