{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Everything you need to know about juice making, from choosing a juicer to combining ingredients, food preparation and storage to nutrition.  Whether you want to get in to juicing to improve your overall health, fitness and well-being or to lose weight this course covers everything you need to know.  </p><p>Increasing the level of fruit and vegetables in your diet increases your health, helps prevent disease, increases energy levels and helps you lose weight.  Juicing is the easiest way to get these benefits in to your daily diet.</p><p>Recipe books can only take you so far, this course will show you how to create your own recipes for a delicious, healthy juice every time.  We'll also look at the health benefits of the top juicing ingredients, showing you why they're so good for you, and helping you make the right choices for yourself.  Whether you want to treat nausea or prevent arthritis we'll show you which ingredients to choose to achieve your goals.</p><p>Buying fresh ingredients can be expensive, this course will show you how to save money be storing your produce correctly and by looking at when and why you might want to choose organic ingredients, as well as when you don't need to.</p><p>Take the course now to see for yourself just how easy and delicious juicing can be, and what a difference it can make to your life. And if you're not entirely happy, the course comes with a 30 day money back guarantee. So what's stopping you from changing your life for the better, today.</p>", 
    "end_date": null, 
    "title": "Juicing for Health and Happiness; a beginners guide", 
    "price": "20.00", 
    "instructors": "Charlotte Louise", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372426_72d4_2.jpg", 
    "course_url": "https://www.udemy.com/a-beginners-guide-to-juicing/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T15:03:31Z"
}