{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t      The Spanish omelette or omelet is beaten egg and then cooked with potatoes and onion. This is one of the classic preparations of Spanish cuisine that can be found in any bar or restaurant. Also great cooks as Ferran Adrià have put his interest on it.  </p>  <p>  \t      Legend told that it was General Thomas Zumalacárregui who, during the siege of Bilbao, invented the omelette as simple, fast and nutritious dish to satiate the hardships of the Carlist army. Although it is unknown if it is true , it seems that the tables began to spread during the first Carlist Wars . Another version of the legend says invented an anonymous housewife from Navarre  (north of spain), who was poor and all they had were eggs, onions and potatoes, ended up doing an upset with this, scrambled liked that the general, who then popularized among his troops  </p>  <p>  \t      So this course is about learning to prepare this fantastic Spanish TAPAS. There is a lot of versions; as many as cooks ; here I&#039;ll give the basic way to do it very juicy and good. After you get the knowledge, then you &#039;ll be able to cook your own &quot;tortilla de patatas&quot;.  </p>  <p>  \t      I&#039;ll show how to make some montaditos&quot; with the omelette. A montadito is bread with some thing added, in this course it&#039;ll be tortilla with zucchini.  </p>  <p>  \t      In this course I use mainly videos to show you the steps. The good news is the complete course is about 30 mn.. Very fast.  </p>  <p>  \t      This course will show you a brief presentation of the ingredients, then you&#039;ll have 3 main parts.. And at the end we&#039;ll make one &quot;montadito&quot;.  </p>  <p>  \t      If you don&#039;t have plenty of time to cook, and if you want to wow your family or your friends then this course is for you !  </p>", 
    "end_date": null, 
    "title": "Learn to cook a spanish omelet", 
    "price": "20.00", 
    "instructors": "Luis Diaz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313344_874f_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-cook-a-spanish-omelet/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-04T14:11:49Z"
}