{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>In This Step by Step Sushi Master Video, <br>Keiko will guide you find easy to follow this sushi courses, and <br>you will start making Sushi for yourself, family and friends in a few days.</p><p>End result is so rewarding<br>You don't have to buy Sushi any more!</p><p>You could enjoy it whenever you like, exactly the way you like it. </p><p>Learn how in this Sushi Master Class step by step with me!<br><br>If this course wasn't for you, money back guaranteed for 30 days<br>There is no risk for your side, <br>why not have a go with this Sushi Master Class Video.<br><br></p><p>No more day-old pre-packaged unimaginative sushi from the store. Use whatever's freshest at a nearby fish market together with the ingredients and seasoning you like best.</p><p>You can find countless gadgets on the market, but precious few really good sushi \"cookbooks.\" </p><p>Besides, wouldn't you really rather have Sushi video lessons showing you all of the proper cutting, slicing, and rolling motions so that everything looks, as well as tastes, fantastic? Especially it's from a trusted source like Udemy.</p><p>I'm the \"Sushi Queen,\" Keiko Yamamoto. For the last 15 years I've been a sushi evangelist through my own cooking classes, catering, and as a professional chef. </p><p>I've worked with prestigious restaurants in London UK</p><p>I have been filmed by UK Channel 4 for a New food program in 2015. </p><p> For Beginners to Private Chefs, I've carefully designed this course to take you from the very beginers to the level of master. It covers <em>everything</em>, including the best way to cook rice and preparing your own sushi vinegar, wasabi, and other seasoning. You'll learn the proper way to cut vegetables as well as raw fish, and the step by step preparation of numerous sushi favourites. I've even included unique and unexpected chocolate and fruit sushi rolls!</p><p>The course is 2 hours long, broken down into 31 bite-sized and easily-digestible 3/4 to 8 1/2 minute classes. </p><p>Plus you'll receive an 8-page listing of ingredients and 7 pages of written instructions.</p><p>Once you've completed the course, and practised a bit, you'll be ready to delight friends, relatives, and loved ones with sushi parties, lunch bentos, and picnics. They'll be amazed at your skill and expertise. And you'll love your beautiful and delicious creations yourself.</p><p>Get started today!<strong></strong></p><p>I'm excited to bring sushi-making to a broader audience, and especially to sushi lovers. and enthusiasts such as yourself.</p><ul>  \t<li>How to prepare sushi rice - washing, cooking and mixing</li>  \t<li>How to make Umami rich - sushi vinegar seasoning</li>  \t<li>How to cut vegetables for sushi rolls - avocado, cucumber &amp; daikon radish</li>  \t<li>How to slice raw fish - salmon and Tuna</li>  \t<li>How to cook prawn for Nigiri</li>  \t<li>How to roll thin hoso maki sushi rolls</li>  \t<li>How to roll carlfornia inside out sushi rolls</li>  \t<li>How to make big futo maki sushi rolls</li>  \t<li>How to make sushi hand rolls</li>  \t<li>How to form nigiri sushi</li>  \t<li>How to present sashimi</li>  \t<li>How to grate wasabi</li>  \t<li>How to cook Inari pocket</li>  \t<li>How to use nori seaweed</li>  \t<li>How to cut sushi rolls</li>  \t<li>How to cook miso soup</li>  \t<li>How to make chocolate &amp; Fruit sushi rolls</li>  \t<p>  \t\t        After you've learnt this course, you could make sushi everyday, you could throw a sushi party with your friends and family, sushi night-in with your special someone, and impress your sushi skill, also you could prepare sushi for your sushi lunch bento box, and for picnics!  \t</p>  \t<p>  \t\t        Happy Sushi Making !</p><p>Arigato &amp; Thank you</p>  </ul>", 
    "end_date": null, 
    "title": "Learn How to Make Sushi from Scratch - Sushi Made Easy ", 
    "price": "50.00", 
    "instructors": "Keiko Yamamoto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368820_4459_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-make-sushi-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T14:05:24Z"
}