{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t Hi and welcome to Bella Rouge Southern Kithchen.  My name is Brent Stevenson and will be your guide to cooking Southern dishes that I hope your family and friends will enjoy just as much as mine.<br style=\"\">  \t <br style=\"\">  \t I was born in New Orleans and raised right outside in a town called Labadieville (aka Labadie).  Our traditions were always centered around Momo&#039;s kitchen table.  In my family, my grandmother is called Momo.  However, if she is your great-grandmother, then you called her Monsie.<br style=\"\">  \t <br style=\"\">  \t Also in my family, Sunday dinners and every holidays were spent together cooking and sharing.  And in the South, we don&#039;t just cook, we throw down BABY!  Almost everybody in the neighboorhood gets a plate, so if you go hungry, then that&#039;s on you!<br style=\"\">  \t <br style=\"\">  \t My grandmother is 93, so now we get to cook for her.  But don&#039;t misunderstand me, these are a combination of my mother and my momo&#039;s foundational recipes in which I&#039;ve tweaked.  I have fond memories of them in the kitchen creating a passion for cooking that I hope to share with you.  </p>  <p style=\"\">  \t At the end of this course, you will have a better understanding of the type of food in the South, key things to look for when cooking and learning how to cook with love!  </p>  <p style=\"\">  \t Each lecture is entailed of a well thought out video that gives you the ingredient list, tips, etc. that you would need to stay engaged with the content.  </p>  <p style=\"\">  \t The course will take a little over 35 minutes to complete.  </p>", 
    "end_date": null, 
    "title": "Learn How to Cook Southern Style Dishes", 
    "price": "30.00", 
    "instructors": "Brent Stevenson", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/110774_bc23_8.jpg", 
    "course_url": "https://www.udemy.com/bella-rouge-southern-kitchen/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-25T23:48:44Z"
}