{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">The Kingsbury Chocolate company will teach you <strong style=\"\">how to make chocolate truffles</strong> that are amazingly delicious and as professional as the chocolates you will find in gourmet stores. You will make three kinds of <strong style=\"\">chocolate truffles</strong> that include:</p><ul style=\"\"><li style=\"\">White chocolate strawberry lemon truffles</li><li style=\"\">Milk chocolate lavender honey truffles</li><li style=\"\">Dark chocolate mocha truffles</li></ul><span style=\"\"></span><p style=\"\">You will learn the secrets behind making fantastic truffles that you can serve to friends and family at parties and special events. We will start by teaching you how to make and prepare ganache. Then the techniques for dipping and decorating your truffles. Finally you will learn how to decorate each truffle to create a sumptuous chocolate experience.</p><p style=\"\">Kingsbury Chocolates opened for business in November, 2001. Self-trained chocolatier Rob Kingsbury embraced his Vermont maple sugar roots and inherited his love of confection making from his grandparents. Starting with his family&#039;s recipes, Rob tweaked them with finer imported chocolate and novel ingredients. Today his maple popcorn crunch drizzled in chocolate is a daily thank you to his grandparents love of family and sweets — who sold their original maple popcorn at a roadside stand. Today&#039;s chocolates and confections showcase Kingsbury&#039;s sophisticated whimsy.</p><p style=\"\">This course will share with you some of Robert&#039;s chocolate heritage and will be sure to impress your friends and family with these amazing <strong style=\"\">chocolate truffles</strong>.</p>", 
    "end_date": null, 
    "title": "Learn How to Make Chocolate Truffles", 
    "price": "30.00", 
    "instructors": "Doug C, ROBERT KINGSBURY", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462378_5987_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-make-chocolate-truffles/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T20:59:04Z"
}