{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  This course shows how to make sushi at home for people who have little to no experience from Roll sushi, Nigiri sushi and much more. <br>Taking this course you will learn all the steps and tricks you need to know on how to make sushi.</p><p>There are 26 lectures that explain step by step on how to prepare, roll and make sushi, etc. Taking the course won't take that long since the lectures are very simple and easy to understand. </p><p>It will take only about an hour to finish watching this whole course. Then all you have to do is get all the ingredients and cook! </p><p>The course has a \"Before you start cooking\" section, a \"While you are Cooking\" section, an \"After Cooking\" section, and some other sections showing the different types of sushi and how you can make them. This means the course is divided into 8 sections. <br>It will also explain and tell you all the tips and tricks that will make cooking sushi much easier and help you learn a lot faster. </p><p>Taking this course would be a good idea based on its easy-to-understand content and the simple explanation. <br>Also, the video itself will give a lot of information with arrows and lines to guide you through the hard parts such as rolling the sushi or spreading out the rice<br></p><p>If you really like sushi and want to try making it yourself. <br>This will be very helpful.</p>", 
    "end_date": null, 
    "title": "Let's have a sushi party: How to make sushi at home.", 
    "price": "20.00", 
    "instructors": "Masahiro Wake", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611276_e984.jpg", 
    "course_url": "https://www.udemy.com/lets-have-a-sushi-party-how-to-make-sushi-at-home/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T03:25:42Z"
}