{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Learn to bake up the best pizza crust ever! The pizza's crust is the foundation of a great pizza. How often have you eaten a pizza with a dense crust or a tough crust and just wished for the perfect pizza crust? Well your search is over! Join now and easily make this Neo-Neapolitan pizza to serve to your family and friends. </p>\n\n<ul><li>Learn the one thing that's absolutely necessary to make great pizza!</li><li>Follow easy step by step directions</li><li>Download the dough formula and print it out for easy reference. </li><li>Make up a pizza today!</li><li>Have a pizza party and invite your friends over to delight them with a terrific pizza!</li><li>Be the pizza expert in your neighborhood.</li></ul>\n\n\n\n<p>This pizza crust is made using both sourdough and commercial yeast, bringing the best of both to make the very best pizza crust. You will learn to make your own sourdough starter in the course but there is <strong>a variation for using just commercial yeast or just using sourdough starter. So if you don't have a sourdough starter, you can still make up a pizza crust for dinner today!</strong> </p><p>Not to worry though, I also teach you how to make your own sourdough starter. </p>\n\n\n\n<p>This course covers how to make up this one pizza crust with several variations. It does not cover making sauces or toppings, although we will talk about them both. Come on and join me and ... make the best pizza ever!</p>", 
    "end_date": null, 
    "title": "Make the Best Pizza Crust", 
    "price": "20.00", 
    "instructors": "Teresa L Greenway", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830160_e77f_3.jpg", 
    "course_url": "https://www.udemy.com/make-the-best-pizza/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-23T18:17:29Z"
}