{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t    Yes, you can have your chocolate and eat it too! <br style=\"\">  \t<br style=\"\">  \t    Chef Teton makes out of this world decadent chocolate recipes that are super quick and easy to make and actually healthy for you!<br style=\"\">  </p>  <p style=\"\">  \t Raw cocoa or chocolate has become the rave as health practitioners and culinary artists discover how good it is for you and how good it can taste.  </p>  <p style=\"\">  \t Traditionally candy made with chocolate and/or cacao has been known to be fattening or unhealthy, but now we now otherwise. In the past it was not the cacao or chocolate that made it a less than excellent food. Historically it was some of the other ingredients used to make it taste good. These would include ingredients like high-fructose corn syrup, hydrogenated fats, high sodium levels and artificial ingredients.  </p>  <p style=\"\">  \t But it is a new day. Raw cacao or roasted cacao can be included with many great ingredients to produce not only healthy foods, but foods delicious beyond your dreams.  </p>  <p style=\"\">  \t New healthy and luscious ingredients include coconut oil, coconut cream concentrate (sun-dried coconut meat ground into a cream), honey, pure maple syrup, avocados and herbs and spices to name a few.  </p>  <p style=\"\">  \t In this course you will learn how to work with unsweetened cocoa (raw or roasted) and the ingredients mentioned above to make truffles, mousse, smoothies, and hot drinks.  </p>  <p style=\"\">  \t The recipes are simple and do not involve cooking. The visual training is highly professional with the use of two cameras. It also includes recipes.  </p>  <p style=\"\">  \t This course will give you the foundation to work with raw desserts.  </p>", 
    "end_date": null, 
    "title": "Make Orgasmic Healthy Raw Cacao Desserts", 
    "price": "25.00", 
    "instructors": "Susan Teton", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/127454_2e58_16.jpg", 
    "course_url": "https://www.udemy.com/make-orgasmic-healthy-chocolate/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-30T23:36:01Z"
}