{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Have you ever struggled to make beautiful delicious pies? I once did. That is why I dedicated years developing recipes to make consistent wholesome artisan pies! Using quality ingredients and following these recipes, you too can make great pie.</p><p>My name is Marie. I owned and operated a pie shop, Passionate For Pies, outside of Seattle. There, I developed a step-by-step system that is easy to follow. It is the same techniques that my employees used at the shop, and many of them had no experience with pie. </p><p>You will learn:</p><ul><li>a delicious and simple 100% butter crust</li><li>an array of fruit pie fillings</li><li>how to make nutritious homemade puddings for Cream Pies</li><li>several sweet &amp; savory tarts to share with your family or friends</li><li>chicken pot pie made from your own chicken stock!</li><li>and much more...</li></ul><p><span></span>Are you wanting more? Then come on and join me! I believe that if you want to Master Pie Making, it can be done. I will start to show you the way.</p><p><strong>Step-by-Step HD 720p Video recipe tutorials </strong>will show you how easy it is to make delicious flaky buttery pastry dough.</p><p><strong>Multiple Camera Angles </strong>give you a closeup, entertaining, &amp; mouth watering view into the learning process.</p><p><strong>Quality Audio. </strong>Narrated by me, Marie</p><p><strong>***************************************************************************************************</strong></p><p><strong>Why does Pie Making seem so challenging?<br></strong></p><p>The biggest challenge to pie making is not having a consistent recipe for dough. Classic pie recipes are a struggle for most beginners because they all lack precision. Ever wondered why the amount of water is never exact in classic pie dough recipes? The answer is simple, and so is the solution.</p><p>Cutting the butter into flour by hand has so many variables. One being how it affects the amount of water needed. This requires advanced knowledge from the baker of the exact feel and texture. It can be frustrating and not fun. And has scared many away from making their own delicious pies from scratch.</p><p>I want to change that and show you a super easy way! Fool-proof almost. Why? Because I love pie so much and want every one to feel confident to make it at home themselves. </p><p>How you ask? By following carefully composed recipes. The video recipes in this course will show you through all the action! They are consistent and precise every time!!!! That's why I know you can succeed. I have done the challenging work of getting the recipes right. So you can just enjoy the process. And take all the credit from your loved ones!</p><p>Since I am a visual learner, that is how I teach. Step-by-step, follow me in your own kitchen. And by the time we are done, your pies will be beautiful and scrumptious. That I guarantee.</p><p>*****************************************************************************************************<br></p><p>I begin by showing you the first pies I mastered: Crumb pies - Peach, Spiced Rhubarb, and Jumbleberry. </p><p>Then will be how to make classic Double-crusted pies - Apple, Strawberry Rhubarb, Wild Blueberry, Blackberry, and Bumbleberry. </p><p>For some of my favorite Specialty pies - Pecan Brownie, Dark Sweet Cherry, and Fresh Butternut Pumpkin Pie. </p><p>Cream pies are better than icing on a cake! My favorites are - Lemon Cream, Chocolate Cream, and Coconut Cream all with fresh whipped cream of course! </p><p>And lastly you will make a delectable Chicken pot pie, the way it should be!  (full-flavored chicken stock with amazing health benefits turned into your own homemade gravy). </p><p>Oh and let's not forget...Tarts are even easier than pie. Spinach Mushroom and Gruyere Tart, Smoked Salmon &amp; Leek Tart, Caramelized Onion Tomato &amp; Goat Cheese Tart, Fresh Raspberry Tart, and Cheese Apple Tart. Perfect for any casual meal or picnic.</p><p><strong>****************************************************************************</strong></p><p>A few pie reviews from customers at Passionate For Pies:</p><p><strong>\"Wow. Just. Wow...</strong>The crust is flaky and buttery, melt in your mouth amazing. The chicken pot pie was delectable in every way. The fruit pies were also amazing....\" - Camille V. - Tacoma, WA</p><p><strong>\"Been looking forward...</strong>since I read about it in <em>The Wall Street Journal</em>, and it lived up to our expectations. Delicious.\" - Renay Portland, OR</p><p><strong>“If heaven could exist in a pie,</strong> you would find it here. We shared the spiced rhubarb pie and the dark chocolate coconut cream pie. The fresh organic cream on the coconut was amazing. It was all the best pie I have ever had... \" -Rob S. Austin, TX</p><p><strong>\"Unbelievable</strong>...I am a pie maven, but I bow to \"Passionate for Pies\". The best crust ever, not too sweet, really fantastic. We will go back tomorrow to take some home on the plane! \" - Kathleen R. Fayetteville, NY</p>", 
    "end_date": null, 
    "title": "Master Pie Making | Pie & Tart Pastry Baking Course", 
    "price": "30.00", 
    "instructors": "Marie Bigbee", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464162_9ac0_6.jpg", 
    "course_url": "https://www.udemy.com/master-pie-making/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T16:26:05Z"
}