{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Enroll in one of the most impressive baking courses of it&#039;s time! Learn to make beautiful breads and treats that weave and twist into the most delicious and heavenly treats! We will drive right into our easy step by step process and begin making a Double Braided Bread (as viewed in course cover photo). Then when we have designed and eaten pure beauty, we will start making making our delicious Calzones! Our stomachs will get a personal tour of Italy! After that, we will enjoy a sweet treat, Almond Cinnamon Twist! Most of the course is in video format, and in crystal clear 1080p HD! Plus, you can download the recipes in .pdf form and follow along on paper. Not to mention, every section ends in a quiz, just to make sure you get it all right! If you want to bake beautiful breads and treats, &quot;Wow&quot; your friends and family, and make your taste buds dance all at the same time, then this is the course for you!</p><p style=\"\">We understand that baking isn&#039;t easy, and that sometimes it is hard to follow along with a YouTube video, or a cooking show. That&#039;s why this course was designed for everyone from beginner to pro! We accommodate anyone who wants to learn. You can cook at the same pace as Lisa as she teaches us how to make wonderful food! Use the downloadable recipe to follow along while Lisa shows you exactly what your baking project should look like at that moment. This course even covers some &quot;What-Not-To-Do&quot; areas of baking! On top of everything else in this course, we want you to have fun with it. Make baking your new passion and enjoy yourself while you learn and master new skills! Take your baking to the next level! Take the course! </p><p style=\"\"><br style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Mastering 3 Impressive Bread Projects in Under an Hour!", 
    "price": "30.00", 
    "instructors": "Austin Hull, Lisa  Hull", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443222_6314_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-3-impressive-bread-projects-in-under-an-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T00:56:05Z"
}