{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t      Aprenderás un menú completo  sana vegetariana para una comida :Con 4 platos más otra receta de regalo.  </p>  <ul>  \t<li><span><strong>Una ensalada super rica en Calcio, </strong></span></li>  \t<li><span><strong>un entrante oriental como es el tahini, pasta de sésamo.</strong></span></li>  \t<li><span><strong> unas hamburguesas vegetarianas  hechas de copos de quinoa</strong></span></li>  \t<li><span><strong>y un postre saludable como bizcocho de plátano. </strong></span></li>  \t<li><span><strong>junto con una infusión mítica como es el yogitea.</strong></span></li>  </ul>  <p>  \t Estas recetas sirven de pequeño adelanto al <strong>estilo divertido, sencillo y fácil</strong> del curso completo de  cocina sana  del instituto sana desde la casa de reposo la perezosa. En el disfrutarás de todo el menú de una semana!!!.  </p>  <p>  \tMATERIAL:  </p>  <ul>  \t<li><span>El curso consta de 5 vídeos divertidos y de fácil comprensión. Añadimos un 6º vídeo como avance del curso de cocina sana:</span><span>Cuscús oriental super fácil y sabroso!.</span></li>  \t<li><span>Además te añadimos material complementario descargables sobre temas de nutrición y dietoterapia para que puedas entender los beneficios de los alimentos y lo importante que es la alimentación, la cocina y la nutrición en tu salud. </span></li>  </ul>  <p>  \tPor ejemplo como conseguir el calcio sin tener que recurrir a los lácteos o como empezar a utilizar la quinoa, un alimento catalogado como super-alimento por la organización mundial de la salud , aquí te enseñaremos una ricas hamburguesas de quinoa que te permitirá ampliar tus cualidades nutricionales.  </p>  <p>  \t<span><strong>Cuanto tiempo invertiras:</strong></span>  </p>  <p>  \t<span></span><span>En menos de una hora aprenderás estos platos y recetas.</span>  </p>  <p>  \t      Puedes ver los vídeos siempre que quieras y en cualquier parte del mundo.  </p>  <ul>  \t<li><strong>POR QUÉ REALIZAR ESTE CURSO:</strong></li>  </ul>  <p>  \tPara aprender recetas sencillas y empezar a integrar nutrición y alimentación sana mejorando tu salud y tu estilo de vida.  </p>  <p>  \tTe permitirá empezar a ampliar tu espectro culinario y conocer más ingredientes, recetas y formas de mejorar tu salud a través de la dieta y la alimentación.  </p>  <p>  \tAdemás te permitirá pertenecer a la comunidad sana y comentar sugerencias, preguntas y consultas sobre alimentación,salud y cocina.  </p>  <p>  \tPara mejorar tu salud, al reducir los alimentos más perjudiciales y fomentar el uso de alimentos más saludables, como son los cereales, las verduras, las ensaladas, etc...  </p>", 
    "end_date": null, 
    "title": "Mini-Menu cocina sana", 
    "price": 0, 
    "instructors": "Pascual Valle, Tita Mellado", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/261664_f4be_4.jpg", 
    "course_url": "https://www.udemy.com/mini-menu-cocina-sana/", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-15T09:58:26Z"
}