{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Over 25 years I have trained more than 30000 of the world's finest cocktail bartenders and now, for the first time I am making this same cocktail mixing course available online for less than 2% of the live training price..... to everyone.</strong></p><p><strong>Whatever your experience, this course will leave you making world-class examples of 16 of the most popular cocktails of our time.</strong></p><p>Indeed, this course is for absolutely anyone that would like to mix <strong>word-class cocktails</strong>. Whether you are a home enthusiast or a professional bartender, this course will guide you through the principals and techniques for mixing truly fabulous drinks.</p><p>You will learn key mixing techniques, how to produce the finest examples of the great classic cocktails, the secrets and methods for producing the most popular contemporary cocktails perfectly, and finally how to produce some show-stopping cocktail garnishes to give your cocktails that 'rock-star' presentation. By the end of this course, I will have helped you to master 16 of the most popular cocktails including mixing a perfect Mojito, a sublime Cosmopolitan and a Dry Martini that will satisfy the thirst of the most demanding guests.</p><p>This easy to follow course is designed to demystify the whole topic of mixology, sharing all the best advice and knowledge from my 25 year career, allowing students to create the standard of cocktails that will have their guests wanting more!</p><p><strong><em>In addition to Udemy's 30-day money back guarantee, I offer my personal promise that you will be accessing the very same level of training delivered by me to thousands of the world's most talented mixologists. In addition, to give you a 'try before you buy' experience, I have made 2 of my masterclass lectures available for FREE PREVIEW, so why not take a look? Finally, if the course isn't what you were looking for, you can get a refund, NO QUESTIONS ASKED, at any time within the first 30 days.</em></strong></p><p><strong>So, what are you waiting for? If you are ready to start making some amazing cocktails, Enrol Now..... </strong></p><p><strong>Look forward to seeing you on the course.</strong></p>", 
    "end_date": null, 
    "title": "Mix World-Class Cocktails - Secrets of a Champion Mixologist", 
    "price": "40.00", 
    "instructors": "Paul Martin", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541062_b2ff_6.jpg", 
    "course_url": "https://www.udemy.com/mix-world-class-cocktails-secrets-of-a-champion-mixologist/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T10:51:16Z"
}