{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  Hello everyone and welcome to <strong>Moonshine Making... the Right Way: The 27 Most Frequently Asked Questions About Making Moonshine</strong>.  </p>  <p>  \t  My name is Steven Shine and over the course of these videos, we’ll cover the top, most-frequently asked questions people ask about making moonshine.  </p>  <p>  \t  You’ll learn:  </p>  <li> How to really make great tasting, inexpensive, moonshine… the right way.</li>  <li> The biggest mistakes beginners make</li>  <li> The top 10 biggest misconceptions—and straight out lies—being pushed out there by people on TV and Youtube.</li>  <li> How to make sure you never get another hangover again… for as long as you live.</li>  <li> The 3 things most beginners do—that’s completely wrong—when making their first batch of tasty moonshine.</li>  <li> Why being able to distill just might give you some much needed security… and maybe even save you life in an emergency.</li>  <li> And much more.</li>  The way this course is structured is simple.  <p>  \t  We’ll list each of the 27 top asked questions in the beginning of each video and then we’ll answer them one by one.  </p>  <p>  \t  We’ll outline exactly what it takes to get started and how to continue on and become truly skilled at this wonderful hobby.  </p>  <p>  \t  That said, I want to take a step back and give you a little more complete overview of this course, what we’ll cover, and why exactly I’m sharing this information with you.  </p>  <p>  \t  First off, my name once again is Steven Shine.  </p>  <p>  \t  I’ve spent the last dozen years learning exactly how to make great tasting home distilled alcohol.  </p>  <p>  \t  I’ve read every book on the subject. I’ve scoured the internet and read every article, every forum, and I’ve watch every instructional video.  </p>  <p>  \t  And then I’ve compared it to real life and real, time tested and proven practices. And you know what?  </p>  <p>  \t  I’ve found that there is tons of misinformation and straight out and out lies being pushed.  </p>  <p>  \t  I’d say the ratio of bad—and often dangerous—information to good information is around 100 to 1.  </p>  <p>  \t  And that’s being very conservative!  </p>  <p>  \t  It seems like in the last few years, there’s been an explosion in interest in making moonshine.  </p>  <p>  \t  And with that, a complete and utter explosion in misinformation, lies, and terrible and dangerous information being pushed by people who either don’t really know what they’re doing when it comes to making real moonshine… or worse, have an agenda in misleading you.  </p>  <p>  \t<strong>The truth is you’ve been straight up LIED to.</strong>  </p>  <p>  \t  We’ll expose all of this misinformation and replace it with good information, methods, concepts, and practices.  </p>  <p>  \t  That said, let me spend a minute talking about who this course is for.  </p>  <p>  \t  This course is for anyone that has any interest in making moonshine the right way.  </p>  <p>  \t  It’s for those who may have tried in the past and have failed through no fault of their own, solely because they’ve received bad advice, overly complicated instructions, or have been mislead and lied to about just how to make moonshine the right way.  </p>  <p>  \t  It’s also for people who want to be prepared in the event that the “you know what” hits the fan.  </p>  <p>  \t  We live in a dangerous world right now… a world where any number of things can happen that can put you, your family, and your loved ones in harm’s way.  </p>  <p>  \t  In the event of an emergency, having the ability to distill alcohol cheaply and effectively might just be the most valuable resource you can have.  </p>  <p>  \t  In such an emergency, your distilled alcohol can become an extremely valuable thing…  </p>  <p>  \t  Something that can be used for medical supplies, as fuel for transportation and electricity generation, or enjoyed as something that can bring some “normalcy” into your’s or others’ lives.  </p>  <p>  \t  Moonshine, especially quality moonshine, might just become the most valuable commodity there is.  </p>  <p>  \t  And this course will show you the right way to make it…  </p>  <p>  \t  Safely, cheaply, and relatively easily.  </p>  <p>  \t  So with that… let’s get this course started and answer these top 27 questions.  </p>", 
    "end_date": null, 
    "title": "Moonshine Making: the Right Way", 
    "price": 0, 
    "instructors": "Steve Shine", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274822_3a1f_4.jpg", 
    "course_url": "https://www.udemy.com/moonshine/", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T23:08:07Z"
}