{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Whether you have been vegan for sometime, just made the switch or are just curious about what vegans eat, you'll know or soon find out that desserts can be the trickiest foods to \"veganize.\" Besides ice cream, they are also the foods that you're least likely to be able to purchase at a grocery store and definitely at a local restaurant. This leaves those of us with a sweet tooth in an unsatisfying situation. Deciding to remove animal products from your diet shouldn't mean that you have to go without the foods you crave and love. </p><p>This course will give you tested and omnivore-approved recipes for some of our favorite desserts. These recipes will fool any meat-lover and I strongly encourage you to avoid mentioning the \"v\" word when you serve them :) Just let them happily eat and enjoy them, then casually mention later that they happen to be vegan. </p><p>I've divided the course into sections for different categories of desserts. Note that I will be adding to the course over time, so when you enroll, be on the lookout for notices that I've added new recipes. </p><p>If you've ever wanted to make vegan desserts for your family and friends that they will rave about, this course is for you! Check out the free preview videos and downloadable recipes and if you like what you see, join our class. There's a 30 day money back gurantee, so if you're not pleased you can get a refund.</p>", 
    "end_date": null, 
    "title": "Mouthwatering Homestyle Vegan Desserts", 
    "price": "20.00", 
    "instructors": "Michelle Johnson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412174_4629_3.jpg", 
    "course_url": "https://www.udemy.com/vegan-desserts/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T12:47:29Z"
}