{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t 9 Lessons - Gluten Free Bread Baking. From the teacher that brought you &#039;Learn The Pastry Arts Level 1&#039;, and &#039;The World Of Cookies&#039;.  </p>  <p>  \t ---  </p>  <p>  \t Build the essential skills you require to create tasty, &#039;bread&#039;, that is year, gluten and wheat free!<br>  \t <br>  \t New or old to the art of the culinary journey, this course is designed for speed and ease. Join us!  </p>  <p>  \t Have you ever wanted to dive into the art of bread baking? Maybe you are a student or pastry professional who needs access to high quality recipes and videos?  </p>  <p>  \t Pastry Training Centre - A pastry arts training program, with a timeline that fits your schedule.  </p>  <p>  \t But what are our students saying?  </p>  <p>  \t &ldquo;Just wanted to thank you for the fabulous classes and training of the past<br>  \t few weeks! Thank you for the generosity of your time,  the high-quality impeccable<br>  \t ingredients you use, for sharing all of your tools, your incredible<br>  \t knowledge and especially the sharing of your recipes &ndash; I will keep them safe<br>  \t and honored. I have not met yet such a generous and fine teacher.&rdquo;  </p>  <p>  \t -Caroline Witteveen, Past Student.  </p>  <p>  \t Videos are all shot with TWO ANGLES in a professional pastry kitchen, learn from the best. All recipes are PDF Downloads, and easy to read and follow.  </p>  <p>  \t Owner and instructor Chef Marco Ropke is a fourth generation pastry chef from Germany with over twenty five (25) years of international pastry experience.  </p>  <p>  \t He now brings his knowledge of European, Asian, and North American pastries to an easy to use online school.  </p>  <p>  \t The pastry training centre reflets Marco&#039;s deep passion for his trade and strong teaching ethics.  </p>  <p>  \t What to expect?  </p>  <ul>  \t<li>Lessons and Knowledge: Hands down the best resource and speedy but extensive knowledge into the basics and fundamentals of the bakery kitchen for gluten free recipes.</li>  \t<li>Video Walk-Throughs: Every single recipes published will have a full video walk-through in 720p HD with TWO CAMERA ANGLES!. We know how important it is to have close-ups of the footage, but also feeling connecting with the teacher.</li>  \t<li>The science behind the art: Learn from Marco Ropke, who not only teaches you the methods and recipes, but also the science behind the art. Understand why things turn out a certain way, and be your own creator and create your own pastry recipes in the future that hold the fundamental basics to success in the kitchen.</li>  \t<li>History &amp; Characteristics: Learn the history of many items you are going to be baking, and the characteristics that define their definition.</li>  \t<li>If you suffer from Celiac disease, or just wish to eat wheat free - this course is great for you.</li>  \t<li>What is yeast? What is Gluten? That&#039;s right. Be informed, and know the answers you need to succeed.</li>  </ul>  <p>  \t Lessons Covered?  </p>  <ul>  \t<li>Intro: We start with an intro to gluten, and what you need to understand about the bread baking process.</li>  \t<li>Baking Fundamentals: We go over alternate starches, and ingredients you can use to create a great tasting, gluten free bread.</li>  \t<li>Introduction to yeast: Learn to understand what yeast is, and how it works with bread baking.</li>  \t<li>Recipes are then covered - Gluten Free Bagels, Gluten Free Focaccia, Gluten Free Artisan Trail Bread, Gluten Free Scones, Gluten Free Banana Bread (tasty!), Gluten Free Waffles.</li>  </ul>  <p>  \t We are excited to share these tried tested and true recipes with our fans!  </p>", 
    "end_date": null, 
    "title": "Online Pastry School - Gluten Free Bread Baking Course", 
    "price": "25.00", 
    "instructors": "Marco Ropke", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135118_3fc8_4.jpg", 
    "course_url": "https://www.udemy.com/gluten-free-bread-baking-course-pastry-training-online/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-18T05:39:16Z"
}