{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "6 Pastry Training Courses - 58 Lessons - 10.5 Hours Of Video Content &amp; Recipes - 1 All Inclusive Price<div style=\"\"><span style=\"\">---<br style=\"\"></span><div style=\"\">Build the essential pastry training skills, and dazzle all of your friends in the kitchen. <br style=\"\"><br style=\"\">New or old to the art of the culinary journey, this course is designed for speed and ease. Join us!<p style=\"\"><span style=\"\">    </span></p><p style=\"\"><span style=\"\">Have you ever wanted to dive into the pastry arts? Maybe you are a student or pastry professional who needs access to high quality recipes and videos?</span></p>    <p style=\"\"><span style=\"\">Pastry Training Centre - A pastry arts training program, with a timeline that fits your schedule.</span></p>    <p style=\"\">But what are our students saying?</p>    <p style=\"\"><span style=\"\">&ldquo;Just wanted to thank you for the fabulous classes and training of the past<br style=\"\">  few weeks! Thank you for the generosity of your time,  the high-quality impeccable<br style=\"\">  ingredients you use, for sharing all of your tools, your incredible<br style=\"\">  knowledge and especially the sharing of your recipes &ndash; I will keep them safe<br style=\"\">  and honored. I have not met yet such a generous and fine teacher.&rdquo;</span></p>    <p style=\"\"><span style=\"\">-Caroline Witteveen, Past Student.</span></p>    <p style=\"\"><span style=\"\"><br style=\"\">  </span></p>    <p style=\"\"><span style=\"\">Videos are all shot with TWO ANGLES in a professional pastry kitchen, learn from the best. All recipes are PDF Downloads, and easy to read and follow.</span></p>    <p style=\"\"><span style=\"\">Owner and instructor Chef Marco Ropke is a fourth generation pastry chef from Germany with over twenty five (25) years of international pastry experience. </span></p>    <p style=\"\"><span style=\"\">He now brings his knowledge of European, Asian, and North American pastries to an easy to use online school.</span></p>    <p style=\"\"><span style=\"\">The pastry training centre reflets Marco&#039;s deep passion for his trade and strong teaching ethics.</span></p>    <p style=\"\">What to expect?</p>    <ul style=\"\">  \t<li style=\"\"><span style=\"\">Lessons and Knowledge: Hands down the best resource and speedy but extensive knowledge into the basics and fundamentals of the pastry kitchen. </span></li>  \t<li style=\"\"><span style=\"\">Video Walk-Throughs: Every single recipes published will have a full video walk-through in 720p HD with TWO CAMERA ANGLES!. We know how important it is to have close-ups of the footage, but also feeling connecting with the teacher.</span></li>  \t<li style=\"\"><span style=\"\">The science behind the art: Learn from Marco Ropke, who not only teaches you the methods and recipes, but also the science behind the art. Understand why things turn out a certain way, and be your own creator and create your own pastry recipes in the future that hold the fundamental basics to success in the kitchen.</span></li>  \t<li style=\"\"><span style=\"\">History &amp; Characteristics: Learn the history of many items you are going to be baking, and the characteristics that define their definition.</span></li>  </ul>  <p style=\"\">Lessons Covered?</p>    <ul style=\"\">  \t<li style=\"\"><span style=\"\">Intro: We start with an intro to the pastry arts, the kitchen essentials, conversions, recipe understanding, and how to adjust based on different ovens, and climate temperatures in the kitchen.</span></li>  \t<li style=\"\"><span style=\"\">Baking Fundamentals: The next section dives right into the world of baking, getting you up to speed and an expert on the fundamentals and basics of baking. Essential tools while moving forward to the next course.</span></li>  \t<li style=\"\"><span style=\"\">European Classical Cakes: With so many wonderful cakes coming out of Europe, this teaches you the classics, the tried tested and true cakes, their history and importance in the pastry arts.</span></li>  \t<li style=\"\"><span style=\"\">Baking With Chocolate: Chocolate is a wonderful ingredient, we then guide you down the history and outline of using chocolate (white, dark, and pure) in your recipes, while using examples of how they can be applied to recipes.</span></li>  \t<li style=\"\"><span style=\"\">The World Of Cookies: Not your average cookies, these cookies are fit for royalty. Learn about the traditional mixing methods, cookie styles, shapes, and methods. We outline a wide variety that spans many different skill sets and methods to make you an expert on the high-tea, cookies, and the characteristics that make them great!</span></li>  \t<li style=\"\"><span style=\"\">Fundamentals of Cake Mixing:<span style=\"\"> This section outlines and builds upon the cake mixing skills. Strong emphasis on proper technique to achieve the best results whether it is a rustic cake or a polished and pretty one.</span></span></li>  </ul>  <p style=\"\">Dive right in and take the helm!</p>  <p style=\"\"></p>  </div></div>", 
    "end_date": null, 
    "title": "Online Pastry School - 1 Week Mastery Course", 
    "price": "50.00", 
    "instructors": "Marco Ropke", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59799_dc7d_7.jpg", 
    "course_url": "https://www.udemy.com/the-pastry-arts-online-pastry-training-centre-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-13T03:27:56Z"
}