{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Hello and Welcome to Popular Cocktail Recipes(PCR), my name is Elliot Neave and I am the director, producer and owner of PCR. I was inspired to make this video course as a keen chef and cocktail drinker I wanted to make a great one stop shop for great cocktails, and PCR was born, this is the first Volume and we would love to make more, hopefully with your support we can make this possible! </p><p style=\"\">Our head Bar man and your mixoligest Yan, is a master in the cocktail industry and has one of the best cocktail establishments in the UK, Panda &amp; Son&#039;s. </p><p style=\"\">Yan has also worked as a cocktail professional for decades winning numerous awards along the way. He is also the name behind some well-known training programs inside the drinks industry specifically for aspiring young cocktail professionals.</p><p style=\"\">In this video course Yan walks you through 23 of the most popular cocktail recipes around at the moment, from The Classic Daiquiri to the <strong style=\"\"></strong>The Bloody Mary from your French 75 to a Moscow Mule its all in there! With over 25 clearly narrated tutorials we explain how to use ingredients, alcohol, cocktail utensils and utensils from around the house that can be substituted to get the same effect and get your tastebuds tingling. </p><p style=\"\">We also look at there terminology used in cocktail making to give you an understanding of how these are used in practice. </p><p style=\"\">We also give you a run-through of how to stock your bar from glassware, ingredients and alcohol. </p><p style=\"\">Our course runs for 2 hours but once you have mastered all the utencils, equipment, ingredients you can work your way through the menu and pick and choose what cocktails you want to make. </p><p style=\"\">So if you love cocktails you will love this course, and for the non alcohol drinkers we have a couple of non-alcohol mocktails on hand for you to try!   </p>", 
    "end_date": null, 
    "title": "Popular Cocktail Recipes - A masterclass in cocktails", 
    "price": "20.00", 
    "instructors": "Elliot Neave", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/459586_0fae_2.jpg", 
    "course_url": "https://www.udemy.com/popular-cocktail-recipes-a-masterclass-in-cocktails/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-26T11:06:16Z"
}