{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>In this course we'll create, together, perfect crepes in your kitchen. </strong></p><ul><li>French Crepe Suzette an orange liquor infused, buttery lemon crepe, with a flambe' bright orange bourbon rum sauce.</li><li> Savory basil breakfast crepes wrapped around eggs and spicy sriracha sour cream.</li><li>Sweet strawberry Whip Cream crepes. </li><li>Healthy crepes for those on a strict summer diet.</li></ul><p>Learn a simple trick to paper thin crepes, testing, batter control, heat fixing, types of pans, storing crepes for get togethers. As <strong><em>you</em> </strong><em><strong>look over my shoulder</strong></em> any fears, doubts, or trouble in creating your own crepe for you, your family to enjoy at home will be taken away. Even if you have never cooked or you burn toast, <strong><em>YOU will be able to create crepes after this course</em></strong></p><p><em>Start your own Holiday breakfast tradition</em> making crepes together with your husband, your wife, your children, your mom, your dad, your boyfriend, your girlfriend, your close friends. It's  tradition in my family that on Christmas morning everyone gathers in the kitchen for Crepes, we each get a turn at seeing who can make the perfect crepe. Some laugh at how bad they burned there crepes, while others are proud of how well there crepe turned out. If they have never made a crepe before, <strong>YOU can teach them</strong> and give them a lasting memory and a skill. Trust me even if you have never cooked before. You will be a cooking master in their eyes.</p><p>Don't worry you can prepare a batch of crepes for everyone ahead of time, like I do and I'll show you how to store and reheat them up, so they taste like they were just made fresh.</p><p><strong>So please come \"Join me inside.\"</strong></p><p><em>\"I am excited to meet <strong>YOU!</strong></em>.\"<br></p><p>John</p>", 
    "end_date": null, 
    "title": "Restaurant Crepes You Can Make To Impress Family And Friends", 
    "price": "25.00", 
    "instructors": "John Thomas Mattison", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/602770_e5ca_3.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-make-crepes-from-scratch-in-your-own-kitchen/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-04T19:57:56Z"
}