{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong>Clorofila: Alimento de luz, la base de la vida!</strong>  </p>  <p>  \t  Este curso trata sobre la clorofila. Un pigmento de color verde con muchas propiedades terapéuticas, utilizado por algunas culturas desde la antigüedad para curar distintas enfermedades. Hipócrates alrededor del año 400 AC ya mencionó las propiedades de los alimentos como fuente de medicina.  </p>  <p>  \t  Durante los años 1960-1990 en Boston, La Dra. Ann Wigmore demostró personalmente las virtudes de este pigmento, que utilizó para tratarse el cáncer en dos ocasiones, con excelentes resultados, y para restablecer la función de sus piernas tras un accidente de coche cuando los médicos que la asistieron solo podían concebir una amputación total.  </p>  <p>  \t  Ella logró recuperarse por completo con dieta cruda basada en la incorporación y aplicación directa sobre las heridas de clorofila fresca varias veces al día.  </p>  <p>  \t  La clorofila es la sangre de los vegetales y es exactamente igual a la hemoglobina de nuestra sangre a nivel de forma molecular.  </p>  <p>  \t  La clorofila promueve la actividad de enzimas protectoras, enzimas detoxificadoras del organismo que ayudan a prevenir el desarrollo de distintas enfermedades, entre ellas el cáncer.  </p>  <p>  \t  La sangre es la vida liquida de las personas. Mantenerla libre de toxinas y con alta concentración de oxigeno mantiene en perfecto estado de equilibrio todo el sistema.  </p>  <p>  \t  Es por eso que la clorofila puede ayudar a curar infinidad de enfermedades.  </p>  <p>  \t  Es un recurso al alcance de todos para aumentar la capacidad de oxigenación de la sangre.  </p>  <p>  \t  A medida que la sangre pierde su capacidad de transportar oxigeno los glóbulos rojos, que son los encargados de llevar oxigeno a todos los tejidos y órganos del cuerpo, sufren un fenómeno llamado Rouleau o pilas de moneda. Este fenómeno lo podemos ver en enfermedades crónicas, y cuanto más avanzada mayor es el apilamiento de globulos rojos. Esto también se relaciona con el grado de toxicidad que tiene la sangre y por lo tanto con la acidificación del medio interno.  </p>  <p>  \t  La clorofila aumenta la alcalinidad del medio interno yayuda a la desintoxicación de los órganos filtrantes de la sangre como hígado, riñón, intestino y pulmones, por lo que ayuda amejorar la calidad de la sangre. De esta manera, con órganos que funcionan correctamente, el cuerpo tiene capacidad de auto regeneración.  </p>  <p>  \t  También es capaz de limpiar la sangre de nicotina, cuyos restos podemos ver en esta muestra de sangre.  </p>  <p>  \t<strong>Ventajas de la incorporación de clorofila en nuestra dieta:</strong>  </p>  <ul>  \t<p>  \t\t  ·Limpia la sangre y órganos de toxinas y metales pesados.  \t</p>  \t<p>  \t\t  ·Alcaliniza el medio interno.  \t</p>  \t<p>  \t\t  ·Aumenta la oxigenación de la sangre por lo cual aumenta la oxigenación de los órganos. Esto eleva el nivel de energía en todo el cuerpo.  \t</p>  \t<p>  \t\t  ·Es fuente de enzimas, oligoelementos, vitaminas y minerales, especialmente hierro, calcio y magnesio.  \t</p>  \t<p>  \t\t  ·Estimula la cicatrización y regeneración de los tejidos.  \t</p>  \t<p>  \t\t  ·Equilibra la flora intestinal y repara la membrana intestinal, aumentando así la auto-inmunidad.  \t</p>  \t<p>  \t\t  ·Desodoriza el cuerpo.  \t</p>  \t<p>  \t\t  ·Mejora el sistema circulatorio, digestivo, reproductivo y circulatorio por su capacidad antioxidante y antiinflamatorio.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Salud y vitalidad: la clorofila", 
    "price": "20.00", 
    "instructors": "Conscientes Tv Portal de evolución humana", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329218_6c1c_2.jpg", 
    "course_url": "https://www.udemy.com/clorofila/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T11:43:08Z"
}