{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>Whether \nyou want to entertain friends and guests at home or  make more money and be the \nbest Bartender on your staff, this course is perfect for you as it takes you \nfrom properly gripping the  bottle to becoming the Master at your Bar when \nsomeone wants that special cocktail.</em></p><p><em><br></em></p><p><em>Welcome \nto the ShowTenders International Basic BarTending Course Level 1-Jigger \nPouring.</em><br></p><p><em><br></em></p><p><em>Top industry \nprofessionals have called ShowTenders <strong>“The Innovative Training Leaders in the Beverage \nIndustry”</strong></em><br></p><p><em><br></em></p><p><em>The \nCreators of <strong>“American Style BarTending With Attitude” </strong>are for the first time \never giving you the secrets to becoming a World Class BarTender.</em><br></p><p><em><strong><br></strong></em></p><p><em><strong>“Magic \nMike” </strong>Werner and James Michael Patrick Skeadas have been training together for \nover 30 years in 37 countries and have given well over 100,000 people just like \nyourself the access to the tools to learn the trade of the “World’s Oldest \nProfession”.</em><br></p><p><em><br></em></p><p><em>Want \nto become the head bartender at your restaurant, maybe learn a little fast \nflair, perhaps rise to become the beverage director of your chain or even one \nday become a World Champion BarTender like others who have taken the ShowTenders \ntraining?  Then don’t hesitate to get certified on this course and be on the way \nto getting your CockTail College Diploma and realizing your \ndreams.</em><br></p><p><em><br></em></p><p><em>ShowTenders International Basic \nBarTending is the first step in the CockTail College Experience which is the \npreeminent online destination for training, information, and certification for \nthe Bar and Restaurant Industry</em><br></p><p><em><br></em></p><p><em>Cocktail College is a thorough \nclass curriculum that covers; Bar Setup &amp; Systems, Jigger &amp; Mechanical \n(Free) Pouring, Building a Recipe Foundation, Drink Making Techniques, Do’s \n&amp; Don’ts of the Bar, Alcohol Awareness, Bar Entertainment, Fast Flair \nInstruction, Advanced Bottle Flipping, Tricks &amp; Trivia, and everything you \nneed to be an industry expert.</em><br></p>", 
    "end_date": null, 
    "title": "ShowTenders: Basic Bartending - Jigger", 
    "price": "50.00", 
    "instructors": "Showtenders' Magic Werner, Noble Carter, Tony Miranda, Jimmy Skeadas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/167058_679f_2.jpg", 
    "course_url": "https://www.udemy.com/showtenders-basic-jigger/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-19T05:14:26Z"
}