{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "\t\t\t<p style=\"\">  \t\t\t\tWe all know we should eat healthier, but how many of us actually know how to do so? So much  \t\t\t\tof how we look and feel comes down to how we feed ourselves, yet so few of us choose to  \t\t\t\tprioritize our health and invest in eating quality food. Think it&#039;s too hard? Too time consuming? To  \t\t\t\tcomplicated? Too expensive? Let Red Jen teach you how easy it is to make simple, seasonal dishes  \t\t\t\tthat are as scrumptious as they are nutritious. Stop choosing the convenience of processed foods,  \t\t\t\tfull of sugar, sodium, preservatives and other chemicals that weigh you down, tire you out and add  \t\t\t\t10 years to your age! Isn&#039;t it time to learn to invest in your health - to improve the way you look  \t\t\t\tand feel? Let Red Jen teach you how to cook simple seasonal dishes that taste delicious and are  \t\t\t\thealthy for you, too.  \t\t\t</p>  \t\t\t<p style=\"\">  \t\t\t\tBy enrolling in this course, you&#039;ll learn step-by-step cooking lessons a la Julia Child with Certified  \t\t\t\tHealth Coach Red Jen Ford. Jen teaches you how to enjoy the Autumn harvest while online access  \t\t\t\tallows you to learn at your own pace: to master one recipe at a time or to watch them all and dive  \t\t\t\tin where you are most inspired. Never used kale or winter squashes before? Never fear! Red Jen  \t\t\t\tunlocks the mysteries of hard-to-handle fruits and vegetables, shares with you how these foods can  \t\t\t\timprove your health, and actually makes them taste good!   \t\t\t</p>  \t\t\t<p style=\"\">  \t\t\t\tRed Jen teaches a conscious approach to eating, one in which you realize that you deserve beautiful  \t\t\t\tfood made from quality ingredients full of nutrition with surprisingly brilliant colors that tastes  \t\t\t\tamazing without impacting your waistline; this is what she calls ", 
    "end_date": null, 
    "title": "Simple, Healthy Fall Recipes", 
    "price": "20.00", 
    "instructors": "Red Jen Ford", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/9707_88ef_3.jpg", 
    "course_url": "https://www.udemy.com/fall-recipes/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-09-16T00:56:58Z"
}