{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Hello fellow baker!</p>\n\n<p>Sourdough Bread Baking Experiments is a fun course for advanced bakers. In this course we will be playing around and experimenting with a very high hydration dough called Cristal Bread. It's all the rage right now!</p>\n\n\n\n\n\n\n\n<p>We will also boil bread, try out low inoculation rates, bake a motherdough only loaf, use double hydration and mix different flour together as we explore some heritage grains. </p>\n\n\n\n<p>There is also a failed experiment with double hydration. Yes, failed!  There's nothing like failure to learn the most and be the best baker you can be.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This main purpose of this course is to have fun and open your mind to exploring and experimenting with sourdough baking.</p><p>See some of the reviews from my other popular sourdough baking courses: </p>\n\n\n\n\n\n\n\n<ul><li>This course for me was a success!! Bravo!</li><li>Another great course, Teresa! My family is enjoying your cornbread frequently and your cinnamon rolls are fabulous! Thank you!</li><li>great detail, I find Teresa's explanation and demonstration incredibly helpful.</li><li>Teresa is an excellent instructor; is informative and makes sourdough baking enjoyable.</li><li>Videos are such a great help when learning how to mix your dough. If you want to learn the proper way to make sourdough, enroll in this class. It is fun to do and you get fabulous results!</li><li>Everything is easy to understand, step by step and we can go back and review information. Both ways of learning, reading the material and then watching by video is provided (to be followed eventually by our own hands-on learning) It is at a nice comfortable pace, not rushed. I am very impressed and happy with this course.</li><li>Clear instructions, easy to follow. Teresa is a great teacher.</li><li>I haven't seen anything this thorough. She covers a recipe from A to Z videos included. You have to take this course and her other courses. Your bread baking skills will no doubt be boosted with Teresa's courses. Her videos are fantastic and honestly, you get more than what you paid.</li><li>Very well done, I learn by watching then doing. Teresa is very good at show and tell...Thanx Teresa</li><li>This course has been so helpful, as I think I would have struggled without it. The instructions and videos are very clear. I would definitely recommend it!</li></ul>\n\n\n\n\n\n\n\n<p>So come on and join in the fun! Teresa</p>", 
    "end_date": null, 
    "title": "Sourdough Bread Baking Experiments", 
    "price": "50.00", 
    "instructors": "Teresa L Greenway", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722002_a380_3.jpg", 
    "course_url": "https://www.udemy.com/sourdough-bread-baking-experiments/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T17:47:39Z"
}