{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t Get ready to enjoy the bliss of eating the most delicious sensual food experience on Earth.  </p>  <p style=\"\">  \t Learning how to make Raw Food inspired the beginning of my health and beauty adventure! I learned by “doing” when I went away to a Shaman Training in Oklahoma 24 years ago. No one had heard of Raw Food then, and that included me. I was surprisingly awakened to a sensuality with food that I had never even dreamed of.  </p>  <p style=\"\">  \t Within a few days the puffiness around my eyes, as well as the rest of the body, disappeared. My joints moved easily and the light came back to my eyes. I had been a constant dieter and now I was free. I never counted another calorie and ate freely whatever I wanted from vital food from the Earth. I literally reversed signs of aging and you can too.  </p>  <p style=\"\">  \t Basically, the reason Raw Food works so well for people is 4 fold:  </p>  <p style=\"\">  \t 1.You are getting an abundance of nourishment that your body is most likely craving.  </p>  <p style=\"\">  \t 2.You simply cannot over eat it – it is so satisfying.  </p>  <p style=\"\">  \t 3.You will never have to count calories, fat or carbohydrate grams, and portion sizes again. You can eat to your heart’s content.  </p>  <p style=\"\">  \t4. Seriously, it is so delicious you will not even believe it.  </p>  <p style=\"\">  \t Raw food is easy, but takes learning some new techniques. This is why I created this course in visual format. Once you understand it and “see” how it is made, rather than read how it is done, you will have the simple tools that will give you a lifetime of nourishment and intense pleasure.  </p>  <p style=\"\">  \t In addition, once you learn the techniques, you can pick up any raw food preparation book and instantly know what the author is talking about and how to do it.  </p>  <p style=\"\">  \t Here is what&#039;s included in this course:  </p>  <p style=\"\">  \t 1. First, you learn the basics of working with nuts and seeds. This includes soaking, sprouting and blending.  </p>  <p style=\"\">  \t 2. In the videos I show you how to do it all with close ups, which my students find extremely helpful.  </p>  <p style=\"\">  \t 3. Since nuts and seeds are at the core of Raw Food, once you understand the simplicity of working with them and how to maximize their flavor and vitality, you will find a new way to nourish and bring substance to your meals.  </p>  <p style=\"\">  \t 4. You will learn how to put excellent fats and oils into your daily life; oils that nourish you and aid you in weight loss. Utilizing them with other raw foods will deliver sauces and dressings so delicious that you will want to drink them, and you can if you want.  </p>  <p style=\"\">  \t Raw &quot;living&quot; foods are the best way to begin to nourish you in a way that your cells love. Nourishment means &quot;beauty&quot;.  </p>  <p style=\"\">  \tNourishment means &quot;vitality&quot;.  </p>  <p style=\"\">  \tNourishment means &quot;radiance&quot;.  </p>  <p style=\"\">  \t These can all be yours now by learning to incorporate Raw &quot;living&quot; foods into your life.  </p>  <p style=\"\">  \t Once you learn the basics you will learn how to blend foods together to make outstanding entrees, such as:  </p>  <p style=\"\">  \t a. Raw Soups  </p>  <p style=\"\">  \t b. Raw Food Pizza  </p>  <p style=\"\">  \t c. Rich Luscious Sauces &amp; Dressings  </p>  <p style=\"\">  \t d. Roll Ups  </p>  <p style=\"\">  \t e. Yummy bread-dough crackers  </p>  <p style=\"\">  \t f. Juices  </p>  <p style=\"\">  \t g. Seed Cheeses  </p>  <p style=\"\">  \t h. Nut &amp; Seed Milks  </p>  <p style=\"\">  \tI. Desserts to Live For  </p>  <p style=\"\">  \t j. Pairing with Organic Wine  </p>  <p style=\"\">  \t The Raw Food Basic &amp; Entree&#039;s Course is designed to give you everything you need to incorporate raw &quot;living&quot; Foods into your daily life.  </p>  <p style=\"\">  \t Use this course to awaken you to the sensual pleasure of eating vibrant food from the Earth, full of aroma, flavor and richness.  </p>  <p style=\"\">  \t The course has 15 Instructional Cooking Shows (4 hours) with photos and recipes. Enjoy!  </p>", 
    "end_date": null, 
    "title": "The Complete Raw Food Course: Basics, Entrees & Desserts", 
    "price": "50.00", 
    "instructors": "Susan Teton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135542_e76c_8.jpg", 
    "course_url": "https://www.udemy.com/make-tasty-raw-foods/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-19T06:12:53Z"
}