{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">We will use <strong>Step-by-Step  Video recipe tutorials </strong>to  teach you how to cook some famous Northwest Chinese Food with most simple methods!. </p>Use one hour of your life to watch this video, you will benefit in your life by being able to cook delicious Chinese food at home to save money and impress your friends and family!!<p><br></p><p>Introduction of Northwest Chinese Food:</p><p>The gigantic provinces of <strong>Gansu</strong>, <strong>Qinghai</strong> and <strong>Xinjiang</strong> spread across the whole of the Chinese northwest, an almost dizzying agglomeration of desert, grassland, raging rivers and colossal mountains.</p><p>There are many Muslim people live in this area, that is why the Northwest Chinese Food also called <strong>Chinese Islamic cuisine.</strong></p>Northwest Chinese Food relies heavily on beef, mutton and chicken. Luckily, all the materials are available in Australia Market.<p><br></p><p>People in Australia generally like eating mutton, chicken and beef. It would be good if people can learn a new way to cook mutton, chicken with authentic Northwest Chinese Style.</p><p>This course is structured by three parts and will teach you three famous Northwest Chinese Dishes.</p><p>The first one is <strong>Big Dish Chicken</strong>, the main material is chicken, potato and green pepper.</p><p>The second one is <strong>Mutton Eaten with hand</strong>s, mainly utilizing mutton, carrot and onion.</p><p>The third one is <strong>Chicken with Chilies</strong>, cooking with chicken fillets, dry chili.</p>Chinese food cooking is much easier than you think, let's start the lecturers!", 
    "end_date": null, 
    "title": "Three Famous Dishes from Northwest China", 
    "price": "20.00", 
    "instructors": "Tingting(Joanna) Liu Cheng Chen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553188_cf53.jpg", 
    "course_url": "https://www.udemy.com/three-famous-dishes-from-northwest-china/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T10:04:30Z"
}