{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t   My purpose for this cooking class is to teach you some of my favorite recipes and techniques, as well as help simplify the cooking experience for beginners. I want to introduce you to my mosaic technique which is all about cooking with style, imagination, and without time consuming measurements. The mosaic technique helps to create dishes that look like they come from a ritzy restaurant, but don&rsquo;t break the bank. Most of my recipes are cost effective and all of them are flavorful. Overall, these recipes are healthy and have low fat content.  </p>  <p style=\"\">  \t   In most non-baking recipes you can see that exact measurements do not make a big difference in the flavor of the dish, so we will focus more on flavor synthesis. The Mosaic technique will help make cooking effortless in respect to preparation time and effort. After all, cooking is the art of combining different flavors to come up with something exciting and new. By taking this course you will gain the experience that is needed to first reproduce the recipes (with or without measuring) and then create your own dishes based on variation and experimentation. Included is a list of ingredient substitutions; these will help you create even more recipe variants! I have also included comprehensive information on different herbs and spices that complement poultry, seafood, meats, and vegetables. Imagine being able to satisfy your family every night with a recipe that you created yourself. This is the way my mother and grandmother cooked, and it truly makes cooking enjoyable.  </p>  <p style=\"\">  \t   *You do need to be specific with ingredients in baking as well as pay attention to the amount of strong flavored ingredients like garlic, herbs, spices or vinegar etc. in every dish.  </p>  <p style=\"\">  \t   Disclaimer: the risks of cooking are inherent. Cook all meats, poultry and seafood to recommended temperatures for safety. Stoves and oven are hot&hellip;, knives are sharp, use at your own risk.  </p>", 
    "end_date": null, 
    "title": "Vechey's Effortless Gourmet", 
    "price": "20.00", 
    "instructors": "Linda Vechey", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112884_cb16_6.jpg", 
    "course_url": "https://www.udemy.com/effortlessgourmet/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-30T18:04:50Z"
}