{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t Vegetarian Done Right is a comprehensive, step-by-step course on making the easy transition to a meatless (or less meat) diet.  It consists of multiple, easy-to-digest videos and supplementary recipes that you can watch at your own pace.  </p>  <p style=\"\">  \t <strong style=\"\">Why should I take this course?</strong>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">What if you could make a small change in the way you eat that would lead you to having more energy, more stamina, feeling great, looking great, and living longer?</strong></em><br style=\"\">  </p>  <p style=\"\">  \tIf your health isn&#039;t where it should be; if you&#039;re  suffering from high blood pressure, heart disease, obesity, or other  diseases, you should take this course.  </p>  <p style=\"\">  \t If you want to lose a few pounds and nothing else has worked, you should take this course.  </p>  <p style=\"\">  \t If you find you don&#039;t have as much energy as you used to, you should take this course.  </p>  <p style=\"\">  \t If you want to help save the lives of millions of animals PER DAY and  safeguard the environment, you should definitely take this course.  </p>  <p style=\"\">  \t This one course could change the rest of your life.  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">How long will it take me to watch this?</strong>  </p>  <p style=\"\">  \t Most of my students watch the lectures (each about 10 minutes) over the course of a couple weeks, but you could consume the entire course in a day or two if you were really motivated.  </p>  <p style=\"\">  \t <strong style=\"\">What am I getting by purchasing this course?</strong>  </p>  <p style=\"\">  \t The course is divided up into three main sections:  </p>  <ol style=\"\">  \t<li style=\"\">Introduction to Vegetarianism; Why Make the Change and the Basics on How to Do It</li>  \t<li style=\"\">Cooking for Yourself and Your Family at Home</li>  \t<li style=\"\">Going Out to Eat, Holidays, and Other Social Occasions</li>  </ol>  <br style=\"\">", 
    "end_date": null, 
    "title": "Vegetarian Done Right", 
    "price": "20.00", 
    "instructors": "Benjamin Portnoy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109196_d1a4_6.jpg", 
    "course_url": "https://www.udemy.com/vegetarian-done-right/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-22T15:23:43Z"
}