{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t   In this course you will learn how to make some of the <strong style=\"\">most popular Vietnamese dishes </strong>enjoyed around the world including Pho, <span style=\"\">Bun Thit Nuong (a delicious pork noodle dish)</span><span style=\"\"> and </span><span style=\"\">Vietnamese Spring Rolls.</span>  </p>  <p style=\"\">  \tVietnamese cooking uses <strong style=\"\">healthy ingredients</strong> and a wonderful mix of spices and sauces that light up the palate. In my course on Vietnamese cooking you will learn exactly how to make some of the tastiest Vietnamese foods in a<strong style=\"\"> step-by-step</strong> format.  </p>  <p style=\"\">  \t   I have designed the course to be <strong style=\"\">simple to understand</strong> with <strong style=\"\">clear illustrations</strong>, examples, and videos showing <strong style=\"\">exactly how to prepare these dishes</strong>.  </p>  <p style=\"\">  \tPho is a famous dish that is recognized as a signature Vietnamese staple all around the world. Pho developed into it&#039;s current form over<strong style=\"\"> hundreds of years of cultivation</strong> by my ancestors, which is why it tastes so good. And while a seemingly simple soup, Pho is actually <strong style=\"\">quite tricky to  make correctly</strong> and takes some time to prepare. I will show you exactly how to do it the way my ancestors made it, which you can&#039;t learn from any book.  </p>  <p style=\"\">  \t<strong style=\"\">Bun Thit Nuong</strong>, the second dish that we will learn in the course, uses a special type of Vietnamese noodle called &quot;Bun&quot;, which is <strong style=\"\">native to the Hue region of Vietnam</strong>. The dish consists of pork seasoned with special Vietnamese spices, Vietnamese Spring Rolls, and various native herbs.  </p>  <p style=\"\">  \tThe final Vietnamese dish you will learn about in the course are fried <strong style=\"\">Vietnamese Spring Rolls</strong>. These Spring Rolls are delicious by themselves and are also used in various other Vietnamese dishes.  </p>  <p style=\"\">  \tIn each section, you will learn the following:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Special Vietnamese ingredients</span></li>  \t<li style=\"\"><span style=\"\">How to prepare Vietnamese ingredients</span></li>  \t<li style=\"\"><span style=\"\">How to could each part of the dish</span></li>  \t<li style=\"\"><span style=\"\">Special tips for best results</span></li>  \t<li style=\"\"><span style=\"\">How to dish up and present each dish Vietnamese style</span></li>  </ul>  <p style=\"\">  \t   Join my course, and learn how to prepare these wonderful Vietnamese meals for <strong style=\"\">your friends and family</strong>!  </p>", 
    "end_date": null, 
    "title": "Vietnamese Cooking Made Simple", 
    "price": "20.00", 
    "instructors": "Kim Tuyen Huynh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/290774_98c0_2.jpg", 
    "course_url": "https://www.udemy.com/vietnamese-cooking-made-simple/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-30T17:23:38Z"
}