{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Have you ever wished you knew more about the world of wine, but didn&#039;t know where to start learning? Or lacked the time to participate in lengthy courses and expensive wine tasting sessions? This course will teach you the basics of wine and wine tasting in just 60 minutes! Through a series of short lectures, you will gain an understanding of the wine making process, become familiar with the top red and white wine varietals, learn how to taste and evaluate wine, and learn how to serve wine for maximum enjoyment. All in just one hour!</p><p>After completing this course, you will: </p><ul style=\"\"><li>Understand what viticulture is and some of the key environmental factors that impact grape growing.</li><li>Know the components of the grape and the role each plays in the wine making process.</li><li>Know how to properly observe, smell, and taste a wine.</li><li>Be able to evaluate the elements of color, clarity, body, and mouthfeel.</li><li>Be familiar with the top red and white wine varietals from around the world, and know the flavor and characteristics to expect from each.</li><li>Know how to serve wine for maximum enjoyment - including correct serving temperature, when to aerate or decant a wine, and what type of glasses to choose.</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\"><em style=\"\">You will be able to answer questions such as: </em></p><ul style=\"\"><li><em style=\"\">What is terroir, and what is a terroir-expressive wine?</em></li><li><em style=\"\">How does the grape growing environment impact the final wine?</em></li><li><em style=\"\">What makes a wine sweet vs dry?</em></li><li><em style=\"\">What are tannins and how can one identify them?</em></li><li><em style=\"\">What is the impact of barrel aging on a wine?</em></li><li><em style=\"\">What is malolactation fermentation?</em></li><li><em style=\"\">What do the terms clarity, body, and mouthfeel mean?</em></li><li><em style=\"\">How can I tell the difference between a light and full bodied wine?</em></li><li><em style=\"\">What is the &#039;finish&#039; of a wine and why is it important?</em></li><li><em style=\"\">Do I need to age this wine?</em></li><li><em style=\"\">What temperature should my wine be stored at? </em></li><li><em style=\"\">Should a red wine really be served at room temperature?</em></li><li><em style=\"\">What is the most efficient way to chill a bottle of wine?</em></li><li><em style=\"\">What is the difference between aerating and decanting a wine?</em></li><li><em style=\"\">How did Cabernet Sauvignon become so popular?</em></li><li><em style=\"\">How did popular culture influence the fate of Merlot in the United States?</em></li><li><em style=\"\"></em><em style=\"\">Is Syrah the same as Shiraz?</em></li><li><em style=\"\">How do Chardonnay wines from various regions differ from one another?</em></li><li><em style=\"\">What does it take for a wine to be called Champagne?</em></li><li><em style=\"\">What is the famous Sauternes wine and how is it made?</em></li><li><em style=\"\">What is &quot;noble rot&quot; and how can it benefit wine production?</em></li></ul><p><em style=\"\"><br style=\"\"></em></p><p>This course is designed for the beginner or intermediate wine drinker. Whether you have zero wine knowledge or already understand some of the fundamentals, this course will help you expand your knowledge base and increase your appreciation for the art of winemaking.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Wine in One Hour", 
    "price": 0, 
    "instructors": "Nicole @ WineIQ", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471052_601d_2.jpg", 
    "course_url": "https://www.udemy.com/wine-in-one-hour/", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T18:17:59Z"
}