{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Welcome to Wine for Beginners!  !  I cannot wait to ignite your passion and prepare yourself to go on a life journey through a glass of wine.  Let’s face it though, the subject of wine is very difficult to learn.  Think about it:  You have to figure out what wine’s grape (or varietal) is, then what appellation or (wine growing area) it comes from, then what vintage (or year) the wine is made.  Then you taste the wine and you have to figure out what the wine looks, smells, and tastes like. </p>    <p>Up to this point, you may be going into a wine without proper information.  A lot of times, people get confused because they don’t understand what the wine actually looks, smells, and tastes like.  We all been there.  I remember when I first learned wine at a fine dining restaurant, I described a wine to a guest so well that the guest ordered an Iced Tea!  I’ll never forget it!  I said then, “This Pinot Noir tastes like cherries...light…no tannins” I mean it was terrible!  </p>    I designed Wine for Beginners today because I want to showcase to you the process of how I began my wine education.  I will be “Developing the Sommelier in You!” by creating the “structure” to enable you to process wine knowledge quickly.  Without structure, studying wine and learning will be difficult.<p><br></p><p>In order to complete this course, you will receive the following:</p><p>    *Wine Description Boards that showcase the seven characteristics of each grape</p><p>    *Course Category Boards which describes the varying levels of intensities of each flavor characteristics</p><p>     *Varietal Comparison Sheet that you can track your progress throughout the course</p><p>I want to \"Develop the Sommelier in You!\"  This is the foundation that will propel your wine knowledge.  Enjoy!</p><p><br></p><p>Mario Luna, Certified Sommelier</p>", 
    "end_date": null, 
    "title": "Wine for Beginners", 
    "price": "20.00", 
    "instructors": "Mario Luna", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648246_757c_11.jpg", 
    "course_url": "https://www.udemy.com/wineforbeginners/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T21:20:33Z"
}