{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Are You Overwhelmed By the Subject Of Wine?</strong></p><p style=\"\">Sure, wine can be a confusing and intimidating subject. But if your goal is to simply enjoy wine more, there&#039;s no reason you need to become an instant wine genius.</p><p style=\"\">My name is David Baer, and since the late 1990s, I&#039;ve been pulling back the curtain on the world of wine for clients ranging from soccer moms to service professionals to corporate executives. And, today, I&#039;d like to do the same for you.</p><p style=\"\">But instead of teaching you about grape varieties and growing regions, I think it&#039;s better to help you get past your wine fears and discomforts, and set you on a path to exploring and enjoying wine at your own pace.</p><p style=\"\"><strong style=\"\">Over the years, I&#039;ve worked with:</strong></p><p style=\"\">• A sales professional who failed to win a contract with a wine-loving prospective client at a business dinner, because he awkwardly tried to fake his own wine knowledge.</p><p style=\"\">• A young woman who was embarrassed on a first date by a guy who spent the evening showing her how to hold her glass “correctly,” and how to taste wine “properly.”</p><p style=\"\">• Dozens upon dozens of consumers who admitted to not ordering or buying wines simply because they couldn&#039;t pronounce the name… or were not willing to ask questions about a wine that interested them.</p><p style=\"\">Do any of those situations sound familiar?</p><p style=\"\"> If so…</p><p style=\"\"><strong style=\"\">I&#039;d like to Introduce You to WINE CONFIDENCE</strong></p><p style=\"\">WINE CONFIDENCE is an online video course designed to demystify wine and help you discover simple techniques for ordering and buying wine even if you don&#039;t know much about the subject.</p><p style=\"\"><strong style=\"\">Why Did I Create This Course?</strong></p><p style=\"\">You&#039;ve already read about some of the stories from my clients above. But those are just a few of the many things people have shared with me about their wine encounters. Other questions have been about things like finding the perfect wine to go with a meal or confusion over what to do when a waiter hands you a cork.</p><p style=\"\">It&#039;s become clear to me that wine has caused a lot of people a great deal of anxiety. So I decided to do my part to help clear the air, bring clarity to the world of wine, and increase the wine confidence for those like you who are longing to get past the nonsense and just enjoy wine on your own terms.</p><p style=\"\">So after years of collective personal experience, hundreds of hours hosting consumer and corporate wine events, and countless discussions with wine professionals, I&#039;ve compiled a simple-to-follow series of videos that will help bring you closer to wine.</p><p style=\"\"><strong style=\"\">When you invest in WINE CONFIDENCE today… </strong>not only will learn what got us in this mess in the first place, but you&#039;ll also discover exactly how to sit down at a restaurant, be handed one of those hundred-page wine lists, and dazzle your dining companions as you order with confidence and ease…</p><p style=\"\">Plus, you&#039;ll also receive a collection of BONUS INTERVIEWS I conducted with wine industry experts, filled with golden gems of wisdom for you to take with you on your next wine outing!</p><p style=\"\">So if you are ready to take control of your wine enjoyment, and confidently engage with your dinner guests, dates, and sommeliers about wine, then you owe it to yourself to invest in this course, and yourself, today.</p>", 
    "end_date": null, 
    "title": "Wine Confidence - Enjoy Wine Without Being An Expert", 
    "price": "50.00", 
    "instructors": "David Baer", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544806_a78d_2.jpg", 
    "course_url": "https://www.udemy.com/wine-confidence-enjoy-wine-without-being-an-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T13:32:13Z"
}