{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>&lt;UPDATED MAR 12, 2015&gt;</strong><br></p>\n\n<p><strong>Are you interested in wine, but you're not sure where to start? This course is for you. </strong></p>\n\n\n\n\n\n<p><em>\"Thank you so much for all the work you have put into this course. Very informative.</em><em>\"</em></p>\n\n\n\n\n\n<p><em>\"I just want to let you know that I appreciate the work you've put into this course and are continuing to put in to it to add to its already bountiful, richness!!! </em><em>I am learning a lot and know others are too.\"</em></p>\n\n\n\n\n\n<p><em>\"Great intro to wines and the winemaking process.\"<br></em></p>\n\n\n\n\n\n<p><em>\"I very much enjoyed taking this course, and found it very informative.\"<br></em></p>\n\n\n\n\n\n<p><em>\"I found this course very informative and the instructor was disarmingly charming while still imparting significant knowledge in viticulture and winemaking. The course modules are succinct, allowing me to watch in bite-sized chunks. Terms were clearly defined, and the language was accurate but not filled with the normal pretentiousness one often finds associated with wine. A definite recommendation for wine newbies, but also for folks who know wine well and want to know more about the vineyard.\"<br></em></p>\n\n\n\n\n\n<p><strong>This course has 2,498 students in 116 countries and it's growing daily!</strong></p>\n\n\n\n\n\n<p><strong>This is a comprehensive, easy-to-understand course on all aspects of wine. What will we cover?</strong><br></p>\n\n\n\n\n\n<ul><li>Wine defined and where it came from</li><li>A full year in the vineyard, exploring practices and tasks of vineyard workers</li><li>How the heck wine is made</li><li>Building your confidence in buying the right wines</li><li>How the heck to taste it \"properly\" (spoiler alert: however you want)</li><li>Wine \"lingo\" and how to wade through the jargon</li><li>How and where to buy wine on a budget<strong></strong></li><li>Frequently asked questions about wine (and if your question isn't not on the list, I'll answer it within 1 day)<strong></strong></li><li>An interview with a wine retailer covering what to look for in wine stores</li><li>Principles of pairing wine and food <strong>(coming late May)</strong></li><li>A list of recommended wine resources (books, apps, seasonal gift ideas, etc.)</li><li>How to tell what kind of wines you would or wouldn't like (<strong>coming late May)</strong></li></ul><p><strong>What are the features?</strong></p>\n\n\n\n\n\n<ul><li>Lifetime access. No limits.</li><li>iPhone, iPad, and Android accessibility</li><li>Certificate of Completion</li><li>Slides from the course lectures in pdf format</li><li>Download the course to your mobile device: watch and interact while you're on the go</li><li>You'll get my personal email for any burning wine questions or recommendations you have for adding content to the course (within a day!)</li></ul>\n\n\n\n\n\n<p><strong>Why take this course?</strong></p>\n\n\n\n\n\n<ul><li>Enhance your enjoyment of wine, in your own unique way</li><li>Feel the hubris of wine confidence, and put that wine snob you know to shame =) </li><li>Just kidding, we're not about shaming here</li><li>But heck, you can become a wine snob yourself, if you'd like</li><li>I personally enjoy the term \"wine geek\" much more. In this course we'll teach you how to geek out on wine.</li></ul>\n\n\n\n\n\n<p><strong>How is the course structured?</strong></p>\n\n\n\n\n\n<ul><li>Informative video lectures in the form of talking head clips and some powerpoint slides</li><li>Take this course with a friend! Pop that bottle open and park yourself!</li><li>It's structured to be informative and fun. Even more so with wine. Cheers!</li></ul>\n\n\n\n\n\n<p><strong>Make sure to check out the lectures marked as Free Previews!</strong><br></p>\n\n\n\n\n\n<p><strong>Enjoy!</strong></p>", 
    "end_date": null, 
    "title": "Wine: Everything You Want to Know, Taught by a Winemaker", 
    "price": "20.00", 
    "instructors": "Michael Macfarlan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207468_236e_6.jpg", 
    "course_url": "https://www.udemy.com/the-a-to-z-guide-to-wine-for-newbies-taught-by-a-winemaker/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T20:35:15Z"
}