{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>The cookbook industry is big business and what could be more fun that creating your own cookbook that you can share with friends and family and sell to the world?</p><p>Whether you’re a budding foodie, an instafood obsessive or just a keen amatuer cook, this course is designed for people who love to cook and to turn their creations into a professional product that can be sold to a worldwide audience.</p><p>At the end of the course you’ll have a beautifully designed, fully fledged cookbook that’ll  serve as a wonderful place to store and cherish your culinary creations!</p><p>You will learn:</p><ol><li>Planning - how to create the perfect cook book plan </li><li>Photography - why photography is key, how to take the perfect photo to bring your recipes to life</li><li>Writing - writing recipes is a skill. Learn how to write recipes in a way that truly engages your audience</li><li>Creating your book - The tools you’ll need to produce your digital cookbook</li><li>Sales and marketing - the most effective ways to sell your book to a global audience online, using your own self-hosted website or blog</li></ol><p>This course is designed for:</p><ul><li>Food bloggers, chefs and instagrammers who are looking at ways to monetize their existing blog</li><li>Passive income enthusiasts looking for their next project</li><li>Foodies who love cooking and talking about food</li><li>Budding authors who don’t quite know how to turn their ideas into tangible products</li><li>Amateur photographers who enjoy taking photographs of food</li><li>Anyone with an interest in keeping a record of all their favourite recipes!</li></ul><p>No prior knowledge of ebook creation is required as we’ll go through all the steps involved, right from having your first moment of culinary inspiration through to selling your book on your own website.</p>", 
    "end_date": null, 
    "title": "Write a recipe ebook and sell it to the world", 
    "price": "20.00", 
    "instructors": "Richard Holmes", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656518_b966.jpg", 
    "course_url": "https://www.udemy.com/write-a-digital-cookbook/", 
    "currency": "USD", 
    "subject_name": [
        "Food & Beverage"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-31T19:27:56Z"
}