{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Losing weight on a tight schedule has never been easier. Learn how I did it only by investing as little as 15-20 minutes a day, twice a week, no equipment needed. Create your own personal schedule which fits your needs perfectly.</p><p style=\"\"><strong style=\"\">Build the Body You Desire by Only Investing 1 Hour a Week with This Complete <span style=\"\">Step-By-Step Fitness Guide.</span></strong></p><p style=\"\">✄ Lose weight</p><p style=\"\">✄ Build muscle</p><p style=\"\">✄ Save money </p><p style=\"\">✄ Be healthy</p><p style=\"\">✄ Look &amp; feel <em style=\"\">AWESOME</em></p><p style=\"\"><strong style=\"\">Quick &amp; Simple, Personal Fitness Plan at Your Fingertips</strong></p><p style=\"\">Learning the strategies and tactics to increase your exercise effectiveness will allow you to develop and maintain healthy body as well as save time and money doing so.</p><p style=\"\">Following the course will provide you with all the knowledge required to create your very own fitness plan so you don´t have to adapt yourself, but rather the plan will adapt to all your needs and wants. </p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">Suitable for beginning trainees, throught the course of 17 HD video lectures and 1 hour of content, you will learn all the fitness fundamentals and establish strong understanding behind the concept of super effective training sessions. Every step includes complete guide and fill-out forms how to progress further.</p><p style=\"\">Beginning with the why and assesing your starting point, this course will take you through measuring, setting the targets and motivation you need to keep yourself accountable.</p><p style=\"\">With these mastered, the course will take you step by step through warm up routine, all the basic trainig types as well as the cool down. You will learn how to use them a put them to practice so you can create quick and effective workout.</p><p style=\"\">Students completing this course will have all the knowledge needed to lose weight and create their very own personalied training plan using the least time possible.</p><p style=\"\">Complete with step by step guides including the exercise advancement guide that allows you to start at the easiest exercise and advance further on, you can train and develop the body you have always wanted</p><p style=\"\"><br style=\"\"></p>  <p style=\"\">  \t<em style=\"\">If you will enroll now you will get:</em>  </p>  <ul style=\"\">  \t<li style=\"\">17 HD Video lectures</li>  \t<li style=\"\">17 HQ Audio lectures to-go</li>  \t<li style=\"\">Measurements guide - How to measure yourself and identify your fitness level</li>  \t<li style=\"\">Basic exercises step-by-step guide - Step-by-step tutorials with real-life trainees                                        training from home</li>  \t<li style=\"\">5 minute warm up guide - How to warm yourself up in 5 minutes</li>  \t<li style=\"\">5 minute stretchng guide - How to stretch your whole body in 5 minutes</li>  \t<li style=\"\">and a TON of knowledge!</li>  </ul>  <p style=\"\">  \t<em style=\"\"><br style=\"\">  \t</em>  </p>", 
    "end_date": null, 
    "title": "1 Hour a Week Fitness: How to Lose Weight on a Busy Schedule", 
    "price": 0, 
    "instructors": "Ondrej Juríček", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433006_e22a_3.jpg", 
    "course_url": "https://www.udemy.com/1-hour-a-week-fitness-how-to-lose-wright-on-a-busy-schedule/", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T14:01:25Z"
}