{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>If you are a beginner exerciser and wish you had better upper body strength this course is designed for you. It will teach you how to do a proper push-up, help you understand what muscles are involved and give you a step by step program to achieve your goal of doing 10 push-ups in 10 weeks. </p><p><strong>Become physically and mentally stronger by progressively improving your push-ups with this course.</strong></p><ul><li>Learn through video demonstrations </li><li>Download supplemental motivational tools</li><li>Follow progressive phases to stay challenged</li><li>Track your progress </li></ul><p><strong>Strength and motivation literally in the palm of your hand</strong></p><p>This course is laid out for you, the beginner exerciser, to help improve your muscular strength and build enough endurance to do 10 push-ups in a row. The lectures are video based with supplemental downloadable content, so you understand exactly how to do the exercise properly to get the most out of it and avoid injury. The progressive calendar has easy to follow phases to make it easy to track your progress on your way to getting stronger and more toned. Most importantly this program is simple and we provide motivational tools to keep you motivated and show you how you're improving. </p><p>Finally an exercise program you can actually stick to and prove to yourself you can have a strong upper body and the perseverance to do 10 push-ups in a row.</p>", 
    "end_date": null, 
    "title": "10 Weeks to 10 Push-Ups", 
    "price": "20.00", 
    "instructors": "Jonathan Chant", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/549382_89eb_5.jpg", 
    "course_url": "https://www.udemy.com/10-weeks-to-10-push-ups/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-08T19:50:59Z"
}