{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>UPDATED JUNE 2016</strong></p>\n\n<p><strong>Have you been struggling…</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>With weight loss?</li><li>With stubborn body fat?</li><li>To take inches off of your waistline</li><li>Te make time to go to the gym or workout</li><li>To eat healthier?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>So how do you lose weight and get ripped without spending THOUSANDS of dollars on... </em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>A gym membership $40-$149/month</li><li>Fitness classes $180-$349/month</li><li>Personal training: $60-$100/session. Typically at 2-4 sessions per week</li><li>Semi-private training: $20-$40/session. Typically at 2-4 sessions per week</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>See how this can all start to add up? </strong>Don't get me wrong here, I believe that your health is absolutely worth it. Treating your body right with the proper diet and exercise program is not only a means of losing weight, getting a ripped physique, and showing off your six pack abs.<br>Exercise and eating right can save you tens or HUNDREDS of thousands of dollars of the years on doctors appointments, physical therapists, medications, and even surgeries.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em><br></em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>If you need a weight loss program and a way to lose body fat but don’t have the time, energy, or desire to workout or go to the gym,</em></strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>I have just the solution for you.</em></strong> </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My name is Jack Wilson and I am currently <strong>teaching 30,000 students on Udemy </strong>to mater weight loss, build lean fat-burning muscle mass, and make a lasting positive change in their lives by making a few healthier decisions. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em><strong>**I have trained hundreds of clients in person and THOUSANDS online. Do you want to know something that you and my other students have in common?</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>You work hard, you have a family, you have a serious career or multiple jobs, you may be going to school or pursuing some kind of demanding academic career, and you don’t have the time or energy to workout.</li><li>You would love to see serious weight loss results, trim some stubborn body fat, and get into better shape,<strong> but who has the time?</strong></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>***This course is specifically designed for YOU and your schedule. Seriously! It is.***</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>How This Course Works</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I have reached out to thousands of my students on Udemy, and have found out that most of them have two important things in common. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>They are all unhappy with the way they look and feel</li><li>They don’t have the time, finances, or resources to go to the gym for 5-10+ hours per week to get to their weight loss goals.</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>This course is designed so that you can</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Workout outdoors, with no gym or fancy equipment required!</li><li>Limit your workouts to 15 minutes, 4 times per week</li><li>Workout 4 hours PER MONTH and lose all of the weight that you have been wanting to lose for months or years.</li><li>Melt stubborn body fat to accelerate your weight los</li><li>Save time and save money on personal trainers, fitness classes, nutrition counseling, and other health services.</li><li>Increase your energy levels and be more productive at work</li><li>Sleep better at night</li><li>Transform your body, and keep it off for good this time with my 15 minute weight loss program.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My courses are designed to be the easiest, most efficient, and most effective methods for losing weight and accomplishing your goals. The best part for you is that you are going to experience weight loss naturally, and get into the best shape in your life, for a one time purchase. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>With this course, you purchase it one time and you get to keep it for life! Why spend thousands of dollars on the above services and products for your weight loss, when you can buy this course once, lose weight, and get into the best shape of your life? </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>100% Money Back Guarantee</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What’s the risk? You can try this course for 30 days and if you can’t completely satisfied with your results, you can get your money back. The only risk that your running is putting off your body, your weight loss, and your health for even longer. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Let’s get started!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>-Jack</p>", 
    "end_date": null, 
    "title": "15 Minute Athletic Workouts for Weight Loss", 
    "price": "25.00", 
    "instructors": "Jack Wilson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624202_8998_3.jpg", 
    "course_url": "https://www.udemy.com/15minuteworkouts/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T01:37:15Z"
}