{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Are you sick and tired of feeling sick and tired?</em>  </p>  <p style=\"\">  \t<em style=\"\">Have you been finding it hard to squeeze a yoga or Pilates class into your busy schedule?</em>  </p>  <p style=\"\">  \t<em style=\"\">Do you feel like you’ve lost your sense of calm and your flexibility?</em>  </p>  <p style=\"\">  \t<em style=\"\"><br style=\"\">  \t</em>  </p>  <h5 style=\"\"><strong style=\"\">Then the 21 Day StretchBodyMind Bootcamp might just be for you!</strong></h5>  <p style=\"\">  \t    The 21 Day StretchBodyMind Bootcamp is a series of lessons containing hints and tips from me which you use to stretch your body and your mind over the next 3 weeks (or all at once if you like a challenge).  </p>  <p style=\"\">  \t    The daily lessons from the 21 Day StretchBodyMind Bootcamp can be read and acted upon in less than 10 minutes so they won’t eat into your busy schedule and may help you to cope better with the daily stresses of life.  </p>  <p style=\"\">  \t    I am really looking forward to us working together to create an upward spiral of energy so that we no longer feel so sick and tired or so isolated in our body-mind practices. Each lesson will be different but expect to see elements like:  </p>  <ul style=\"\">  \t<li style=\"\">Yoga</li>  \t<li style=\"\">Pilates</li>  \t<li style=\"\">Barre</li>  \t<li style=\"\">Meditations</li>  \t<li style=\"\">Relaxations</li>  \t<li style=\"\">Life coaching exercises</li>  \t<li style=\"\">Nutritional advice (and maybe even a recipe or two!)</li>  </ul>  <p style=\"\">  \tI initially launched the 21 Day StretchBodyMind Bootcamp in October 2013, based on some of the work I did for the live Yoga Body Bootcamp back in 2012 as well as on new work I have done in Life Coaching and NLP. And now it is offered as a self-directed programme through Udemy which<span style=\"\"> costs just $63 (this</span><span style=\"\"> works out at just $3 a day).</span><span style=\"\"> Just think – you’re getting all my best tips and techniques for less than a Chai Tea Latte at Starbucks!</span>  </p>  <p style=\"\">  \tNow, it may be called a Bootcamp but I promise it’s not as hard as it sounds! Just a daily series of lessons to help you stretch your body and your mind. You’ll LOVE it and I’d LOVE to have you with us!  </p>  <p style=\"\">  \tHere’s what a couple of intrepid bootcampers have to say so far:  </p>  <p style=\"\">  \t<em style=\"\">“I am enjoying purposefully taking the time to read and follow everything which might just sit for several days.“</em> ~Carol  </p>  <p style=\"\">  \t<em style=\"\">“I am really enjoying the bootcamp,  especially as there are a variety of activites to do.“</em>~Eilis  </p>  <p style=\"\">  \t<em style=\"\">“Loved this!  What a fabulous start to my day! Wishing you a magnificent day as well!“</em><span style=\"\"> ~Ellen</span>  </p>", 
    "end_date": null, 
    "title": "21 Day StretchBodyMind Yoga, Pilates & Barre Bootcamp", 
    "price": "20.00", 
    "instructors": "Victoria Cunningham-Downey", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231318_8ea3_7.jpg", 
    "course_url": "https://www.udemy.com/21-day-stretchbodymind-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T22:45:16Z"
}