{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>5 Minute Workout System is a course designed after over 20 years of fitness and athletic experience.  The focus is on hard core workouts for personal trainers and fitness enthusiasts who want to take their fitness to a new level.   The course is for the person who is already training but wants to add in finishers or new routines.   The course includes workouts done by a trainer and done by a client with instruction.  There are workouts with body weight, bands, kettlebell, ropes, weights, and more.  The entire system is based around the philosophy that exercise efficiency and and exercise progress is the key to long term results.  </p><p>Here is what is included</p><p>1.  Exercises and workouts that helped one client increase conditioning by about 25% in two short months training twice a week.</p><p>2.   Workouts that can be done at home, at the gym, or even at the office.</p><p>3.   The philosophy and background of the instructor and why he uses these exact workouts.</p><p>4.   The mentality needed to do well and how use the workouts.</p><p>5.   Demonstration of exercises and how to do them and much more.</p><p>6.  Finishers at the gym to take strength to a new level.  </p><p>7.  Great for athletes, personal trainers, or other fitness enthusiasts.  </p><p>Take your fitness to the next level and do it with 5 Minute Workouts!</p>", 
    "end_date": null, 
    "title": "5 Minute Workouts for Personal Trainers And Fitness Diehards", 
    "price": "35.00", 
    "instructors": "Jeremy Belter BS, CPT, RBT", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660794_ebcd_2.jpg", 
    "course_url": "https://www.udemy.com/5minuteworkouts/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T05:22:25Z"
}