{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>========== 8 Week Body Transformation Challenge ==========</p><p>=====&gt;<em> Updated: November 2015<br><em>PLUS - NOW INCLUDING 30 DAYS AB CHALLENGE BONUS PROGRAM</em><br></em><br></p><p><strong>Want To Lose Weight and Body Fat?</strong></p><p><strong>Build And Gain a Huge Amount of Muscle, Lose Fat and Get Healthy?</strong></p><p><strong>Get Fit For Life?</strong></p><p><strong>Finally, Learn How To Get Fit and Burn That Fat For Good This Time!</strong></p>Take Control of Your Fitness....<p>8 week challenges take dedication, drive, and consistency. If you haven't taken the challenge, it's time to leave the locker room and step into the gym.</p><p>So what's so different about this program?</p><p>I will be with you every step of the way!</p><p>I give you a video, for every single training day. Plus the optional extra to access a nutrition program to learn the all there is to know about macronutrient nutrition mastery.</p><p>Everything I do in my life, I put my money where my mouth is. If I cannot do it, then I do not teach it.</p><p>Now the biggest problem in the fitness industry, is everything contradicts itself, and everyone tries to over complicate things.</p><p>The program we will be doing together is going to be simple, but TOUGH! Be prepared to feel sick in the stomach and light-headed after every workout.</p><p>Simplicity makes it easier to get into the habit. Getting into the habit changes your life FOREVER!</p><p>Everyone taking this course will learn how to <em><strong>Lose Fat</strong></em><em><strong>, Build</strong></em> and <strong><em>Gain </em><em>Muscle Size &amp; Strength</em></strong>. Also <em><strong>Boost Cardiovascular Health, Increase Mental Health, </strong></em><em><strong>Reach</strong></em> and <strong>Sustain Form</strong>. As well as <em><strong>Increase General Health</strong>, <strong>Reduce Stress</strong></em> and will help you stay <em><strong>Disease Free.</strong></em></p><p>This 8 week challenge is designed for all levels, from beginner right up to intermediate challengers. </p><p>Everyone learns in different ways, everyone feels a different experience and this course covers all bases. When you join this course, you will receive bonus material from time to time, that is also added to the VIP Facebook area's that you have the opportunity to access for a lifetime.</p><p>This comprehensive 8 week transformation includes tools and techniques such as self healing, transformational breath work, personal development, functional core fitness, high performance training, life longevity, meditation, detox diet, cleansing and of course a progressive designed strength and cardiovascular transformation program.</p><p>What does it take? Dedicated time each day, disciplined action and commitment, faith and belief that everything is possible and a positive attitude.</p><p>Even if you do not want to start yet, purchase it now as you have lifetime access.</p><p><em><strong>It Is Time To Take Action, Click \"Take This Course\" At The Top Right, Enrol In This Course Now And Learn The Nutrition &amp; Health That Will Get You The Body You Desire!</strong></em></p><p><em>See you on the inside,</em></p><p><em>Mitch</em></p>", 
    "end_date": null, 
    "title": "8 Week Body Transformation Challenge", 
    "price": "20.00", 
    "instructors": "Mitch Asser", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/525702_1fb0.jpg", 
    "course_url": "https://www.udemy.com/8-week-body-transformation-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T04:34:08Z"
}