{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Willkommen bei der Akupressur für Fitness &amp; Schönheit - Der Ort bei Udemy, um Akupressurpunkte für Spitzensportleistungen und Schönheit zu lernen!</p><p>√ Erreichen Sie Spitzenleistungen im Sport und verbessern Sie Ihr Aussehen ohne Medikamente selbst mit altbewährten Chinesischen Massagepunkten</p><p>√ Finden Sie die richtigen Massagepunkte leicht mit einfachen und kurzen Full HD Videoclips</p><p>√ Akupressurpunkte, um Sport und Fitness Leistungen inkl. Yoga zu erhöhren, sind im Kurs enthalten.</p><p>√ Akupressurpunkte, um Falten zu glätten, sind im Kurs enthalten.</p><p>√ Akupressurpunkte, um mit Rauchen aufzuhören, sind im Kurs enthalten.</p><p>√ Akupressurpunkte, um alltägliche Krankheiten zu lindern, sind im Kurs enthalten.</p><p>√ Akupressurpunkte für Entspannung sind im Kurs beinhaltet.</p><p>√ Akupressurpunkte für Frauenkrankheiten sind im Kurs beinhaltet.</p><p>&quot;Kurz gesagt, [Akupressur] bietet den maximalen Nutzen ohne gefährliche Nebenwirkungen, die mit vielen Ansätzen der konventionellen Medizin verbunden sind.&quot; </p><p>-William Michael Cargile, B.S., D.C., F.I.A.C.A., Forschungsvorsitzender des Amerikanischen Verbunds der Akupunktur und Orientalischen Medizin</p><p>Die Akupressur ist wunderbar für Sie geeignet und mit dem Kurs sofort anwendbar. Denn:</p><p>√ Zeitraubende Arztbesuche sind nicht erforderlich.</p><p>√ Nennenswerte Geldausgaben sind nicht notwendig.</p><p>√ Es besteht keine Gefahr der Verletzung, Infizierung oder Schmerzen.</p><p>√ Sie massieren die Punkte sanft mit Ihrem Finger.</p><p>Die angebotenen Massagepunkte sind:</p><p>√ besonders wirkungsvoll</p><p>√ leicht und ohne fremde Hilfe zu finden</p><p>√ mit professionellen Full HD Photos und Videos dargestellt</p><p>&quot;Mit dem Kurs konnte ich mein Fitness-Level signifikant erhöhen und meinen Gesichtsfalten zu Glättung verhelfen. Mit den im Kurs angebotenen Videos sind die Akupressurpunkte sehr einfach zu finden. Ich bin so froh, den Kurs immer dabei zu haben, auf meinem iPhone und iPad!&quot;</p><p>-Jannie, Manager bei BMW in Germany</p><p>Tausende haben es bereits gemacht. Jetzt haben auch Sie die Möglichkeit, an diesem Akupressurkurs teilzunehmen. Damit werden Sie sich selbst ohne Medikamente und Arztbesuche behandeln können! </p><p>Für einen Bruchteil der Kosten eines Arztbesuchs bekommen Sie einen bewährten Akupressurkurs zur lebenslangen Nutzung mit kostenlosen Updates, die weitere Massagepunkte beinhalten werden.</p><p>Ich wünsche Ihnen viel Spass mit dem Kurs! Melden Sie sich jetzt an! </p><p>Ihr Dr. Bargak - 30 Jahre efolgreicher Akupressurpraxis</p><p>Haben Sie noch Fragen? Gerne würde ich sie bei Facebook beantworten: suchen Sie einfach nach Dr. Bargak<span></span></p>", 
    "end_date": null, 
    "title": "Akupressur für Fitness und Schönheit: natürlich fit & schön", 
    "price": "20.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508310_50f7_5.jpg", 
    "course_url": "https://www.udemy.com/akupressur-fur-fitness-und-schonheit-naturlich-fit-schon/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T18:43:02Z"
}