{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t        Ce cours s'adresse à celles et ceux qui veulent avoir une meilleure posture.  </p>  <p style=\"\">  \t       Avoir une bonne posture vous rendra plus mobile, flexible et droit, ce qui augmentera votre confiance en vous. Cela peut aussi soulager des Troubles Musculo Squelettiques (TMS) liés à la mauvaise posture.  </p>  <p style=\"\">  \t        À travers de simples exercices,  nous découvrons d'abord le mouvement respiratoire naturelle, puis, comment se tenir debout sans avoir mal au dos.  </p>  <p style=\"\">  \t        La leçon sur la marche sur l'avant pied est excellent pour éviter les douleurs des articulations et détendre la colonne vertébrale. Ceci peut souvent aider contre des lombalgies et d'autres douleurs.  </p>  <p style=\"\">  \t        Enfin, la leçon sur la position assise s'adresse aux personnes ayant un travail sédentaire. Apprenez comment restez assis longtemps sans vous fatiguer et en massant et musclant la colonne vertébrale. Fini le mal de dos après une journée de travail.  </p>  <p style=\"\">  \t        Les exercices, qui ne demandent pas d'être sportif, ni d'avoir des connaissances particulières, sont ludiques et présentent un excellent travail préparatoire si vous souhaitez commencer des leçons de danse, d'arts-martiaux ou une autre pratique sportive.  </p>  <p style=\"\">  \t        Un peu de théorie (en anatomie et biomécanique) sans termes médicaux complètera vos connaissances et approfondira votre compréhension.  </p>  <p style=\"\">  \t        Ce cours est également un excellent accompagnement pour toute personne actuellement en traitement chez un ostéopathe ou kinésithérapeute, car le succès d'une telle démarche ne pourra être durable, si le patient n'adapte pas sa posture.  </p>", 
    "end_date": null, 
    "title": "Améliorez votre posture et réduisez le mal de dos", 
    "price": "50.00", 
    "instructors": "Peter Scholten", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/102958_738c_4.jpg", 
    "course_url": "https://www.udemy.com/ameliorez-votre-posture/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-08T09:25:47Z"
}