{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Have you ever been at a public place such as the pool or beach and been too embarrassed to remove your shirt?</p><p style=\"\">Are you not happy with the shape of your chest and size of your arms? </p><p style=\"\">This course aims to change all that. </p><p style=\"\">The Chest and Biceps Program is a specialized training routine, which targets these areas from every possible angle, giving you the best chance for lean muscle growth and definition.</p><p style=\"\">The course begins with helping the student develop a plan to accurately measure his or her progress through proper record keeping and other forms of documentation. </p><p style=\"\"><strong style=\"\">A powerful lecture on how to manipulate your nutrition for optimal success quickly follows the previous lesson.</strong> </p><p style=\"\">From there, the course takes the student through the science of building lean muscle and the best method(s) available to do so.</p><p style=\"\"><strong style=\"\">Next, the student is taken step-by-step and shown the safest and most effective ways to execute the exercises found in the Chest and Biceps program. After proper technique is observed and practiced, the student will then have an opportunity to review his or her new specialized training program.</strong></p><p style=\"\">Finally, the course concludes with a powerful lecture on sport psychology and the power of visualization. You will have an opportunity to learn tactics from a man who some say had the best chest and arms in the business! </p><p style=\"\"><strong style=\"\">If this course sounds like something that would improve the quality of not only your physique, but also your life, then you owe it to yourself to sign up for this course.</strong></p><p style=\"\">Just click the “Take This Course” tab on the right and let&#039;s get started!</p>", 
    "end_date": null, 
    "title": "Athletic Bodybuilding: Powerful Chest & Biceps Program", 
    "price": "20.00", 
    "instructors": "Professor Matthew Elam", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516548_8a1b_4.jpg", 
    "course_url": "https://www.udemy.com/athletic-bodybuilding-powerful-chest-biceps-program/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T01:58:21Z"
}