{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Welcome to my course</p><p style=\"\">The purpose of this course is to teach students how to perform fundamental exercises with correct technique.</p><p style=\"\">The course runs through exercises and breaks them down into easy to follow steps, outlining the most important factors in each exercise allowing students to perform the exercises correctly, thus not only giving them the best results from the exercises but also preventing injury from occuring.</p><p style=\"\">The goal of the course is to teach students in such a way that they can incorporate the exercises into their daily workout routines and gain all the benefits of great exercises.</p><p style=\"\">I myself have spent 8 years in the gym environment and am a qualified personal trainer, I'm always willing to learn from those around me and also from what my own body is telling me, I have noticed that many of my friends and clients struggle with some of the fundamental exercises, yet not everyone can afford to constantly fork out money for one on one personal training sessions, thus I have decided to provide a more affordable alternative for those looking for some guidance when performing these exercises.</p><p style=\"\">I run through the exercises and am happy to help anyone who has any questions, please feel free to contact me, I enjoy your feedback and enjoy learning from my students.</p><p style=\"\">I hope this course gives you the satisfaction it has given me creating it.</p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Basics to building a better body", 
    "price": "20.00", 
    "instructors": "Dylan Tyack", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409868_a6a5.jpg", 
    "course_url": "https://www.udemy.com/basics-to-building-a-better-body/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T12:34:56Z"
}