{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  Many people struggle to get healthier for one of two simple reasons: either they can&#039;t find the time to exercise, or they&#039;re not sure which exercises they should be doing in the first place.  </p>  <p style=\"\">  \t  Simply put, the mainstream approach of making time to go to a gym several times per week just doesn&#039;t work for most people. That&#039;s why learning a simple bodyweight exercise routine can be life-changing.  </p>  <p style=\"\">  \t<strong style=\"\">This course will teach you a simple, basic bodyweight exercise routine that you can do almost anywhere in 20 minutes or less.</strong>  </p>  <p style=\"\">  \t<span style=\"\">In this course, we will cover:</span>  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Eleven distinct movements that will warm up and work out your entire body</span></li>  \t<li style=\"\"><span style=\"\">Tips on tweaking the routine to fit your current situation</span></li>  \t<li style=\"\"><span style=\"\">Adjustments to make as you get stronger and fitter</span></li>  \t<li style=\"\"><span style=\"\">General thoughts on staying focused and successful</span></li>  </ul>  <p style=\"\">  \t<strong style=\"\">You really can get in better shape, at home, in just 20 minutes per day.</strong>  </p>  <p style=\"\">  \tThe best part of this course is that it&#039;s short and to the point<span style=\"\">—you can get the information you need as quickly as possible, and start applying it right away.</span>  </p>  <p style=\"\">  \t<span style=\"\">First, we&#039;ll discuss the proper mindset to have when you begin the course. Then, we&#039;ll learn the eleven movements that comprise the three parts of the routine. Finally, we&#039;ll learn about the best way to implement the information we&#039;ve covered, and how to stay focused and successful as we move forward.</span>  </p>  <p style=\"\">  \t<span style=\"\">The ideal student for this course is interested in bodyweight exercise, but isn&#039;t sure how to execute a complete, full-body bodyweight workout. If you&#039;re interested in getting in shape without going to a gym, click the enroll button and get started today.</span>  </p>", 
    "end_date": null, 
    "title": "Basic Bodyweight Exercise To Get Strong, Lean, And Healthy", 
    "price": "20.00", 
    "instructors": "Patrick Barrett", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359104_81f1_4.jpg", 
    "course_url": "https://www.udemy.com/basic-bodyweight-exercise-to-get-strong-lean-and-healthy/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T15:30:00Z"
}