{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Have you ever tried to lose weight before? Chances are you've probably encountered so many challenges and roadblocks that you didn't know which strategy, tactic, workout or diet to follow.</p>\n\n<p>If you've ever felt overwhelmed and told yourself that losing weight was impossible, you're not alone.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I used to think that losing weight meant starving myself &amp; training like hell. I used to wonder if what I was doing was the right thing because I was losing weight at such a glacial pace. And that's why I decided to become a certified personal trainer and what I found out was that the workouts and diet were the opposite of what I was doing. More importantly, it was a lot simpler than I thought and all I needed to do was build these crucial habits to give me some momentum to lose weight and gain muscle easily and permanently. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>I will share everything I've learned during my Masters in Health Science and as personal trainer. </li><li>You'll learn how to increase your metabolism even when you're not working out and make your fat loss automatic.</li><li>You'll discover how to lose fat in a sustainable way as you make small lifestyle changes.</li><li>You'll stop getting frustrated once find out how you can overcome and avoid unnecessary fat loss plateaus.</li><li>You'll be able to gain muscle and achieve a toned body when you learn 3 crucial workout routines.</li><li>You'll save time as you effectively burn fat using only a few key exercises instead of doing the excessive cardio workouts that you see on dvd's</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Right now you're probably wondering if losing weight is even possible for you and I can tell you that with this course, it definitely is. This course is perfect for those who want to focus all of their efforts only on the most effective and scientifically proven tactics to losing weight instead of chasing weird tips and fad diets.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What's included in this course?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>With 21 lectures, 2.5 hours of content, and a quiz at the end of each section - you will learn the following. </p>\n\n\n\n\n\n\n\n\n\n<ul><li>Answers to your questions on how to lose weight easily and permanently</li><li>Equations to use to know what to eat for your height, age, and gender</li><li>Short and simple but effective strength training and cardio workouts</li><li>Tips on how to lose those last few pounds and get past the weight loss plateau</li><li>Free resources designed to help you lose weight</li></ul>", 
    "end_date": null, 
    "title": "Be Your Own Personal Trainer: Lose Weight w/ a Custom Plan", 
    "price": "25.00", 
    "instructors": "Dana Habayeb", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793406_f5b2_2.jpg", 
    "course_url": "https://www.udemy.com/be-your-own-personal-trainer/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T08:58:15Z"
}