{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">Do You want to transform your body?</strong></em></p><p><strong style=\"\"><em style=\"\">Do you want to create a positive change to your body and become a truly better version of yourself but don&#039;t know where to start or how to begin???</em></strong></p><p><strong style=\"\"><em style=\"\">Are you tired of not getting the results you desire out of your workouts?</em></strong></p><p><strong style=\"\">LET ME SHOW YOU EXACTLY WHAT DO TO!!!!</strong></p><p>What you can accomplish in 90 days is absolutely mind blowing.  In only 3 months you will completely transform the way you look and feel.</p><p>I will show you what I do day in and day out.  Exactly what got me to where I am today. </p><p>I used to be out of shape and dissatisfied with how I looked and felt so I made it a must to make a change!</p><p>I spent the last 5 years testing the most effective ways to train, diet and perform cardio with myself as the guinea pig. I have learned what works and what is a waste of time.</p><p><strong style=\"\">In this course I will give you access to powerfull and effective techniques to:</strong></p><ul style=\"\"><li>Drop excess body fat</li><li>Build and Tone muscle</li><li>Learn the secrets of proper food selection and timing!</li></ul><p>This course will give you the tools to look better, feel better, and have more confidence; all which are positive life altering changes that affect all areas of your life.</p><p><strong style=\"\">****Why is this course different than all the others?****</strong></p><p><em style=\"\">Because of its efficiency.  You won&#039;t be in the gym for hours, doing strange and dangerous exercises, or starving on a diet.  Everything comes from a place of practicality which makes is easy for you to follow and easier for you to stick with.</em></p><p>It doesnt matter if you are a beginner or someone with years of experience, the principles of this program apply to everyone.</p><p>Knowing where you want to go and having that desire is half the battle.  You need a <strong style=\"\">roadmap</strong><strong style=\"\"> </strong>to guide you! That is what this course is for. </p><p>Why do some people see consistent results, always seem to be in shape and have a toned physique year round? Let me tell you it is not luck or chance but a set of simple and basic principles that are followed day in and day out. Tried and true fundamentals to living a healthy and fit life.</p><p>Its actually way more simple than people realize to make these changes.</p><p>I will take you through all the steps showing you everything you need to know to transform your physique and subsequently your life. </p><ul style=\"\"><li><strong style=\"\">See exactly how I train in the gym with guided workouts.</strong></li></ul><ul style=\"\"><li><strong style=\"\">Learn exactly what to foods you should be buying at the grocery store.</strong></li></ul><ul style=\"\"><li><strong style=\"\">Eliminate the guess work with a Sample Diet.</strong></li></ul><ul style=\"\"><li><strong style=\"\">Learn how to eliminate cravings.</strong></li></ul><ul style=\"\"><li><strong style=\"\">Know when to eat certain foods and when to cut them out.</strong></li></ul><ul style=\"\"><li><strong style=\"\">Learn how to do less cardio yet burn more fat than ever before!</strong></li></ul><p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p>The 30 Money Back Guarantee is there to assure you that you are getting the highest quality training and instruction available and my personal promise that you will have success just as  my previous clients have had in the past.</p><p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p>Leading a healthy and fit lifestyle has so many benefits beyond just your physical appearance.  You move better, sleep better, do the things you love better and feel better about yourself.  You have more confidence and acquired self discipline, and even think more clearly, which ultimately carries over into every aspect of your life.  In the end it isn&#039;t a destination but a journey. and a way of life!  </p><p><strong style=\"\">90 Days IS NOTHING FOR A LIFETIME OF HEALTH AND VITALITY!<em style=\"\"></em></strong></p><p><strong style=\"\">ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "Beach Body Secrets Revealed - Burn Fat and Build Muscle", 
    "price": "20.00", 
    "instructors": "Daniel Damico", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444274_8863_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-burn-fat-build-muscle-and-transform-in-just-90-days/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T22:39:40Z"
}