{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>A Beginners Guide to Effective Weight Training with an Upper/Lower Body Split Training Program!</strong>  </p><p>=====&gt;<em> Updated: November 2015<br>PLUS - NOW INCLUDING <strong>30 DAYS AB CHALLENGE</strong> BONUS PROGRAM</em></p><p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>Want To Lose Weight and Body Fat?</strong>  </p>  <p>  \t<strong>Build And Gain a Huge Amount of Muscle, Lose Fat and Get Healthy?</strong>  </p>  <p>  \t<strong>Get Fit For Life?</strong>  </p>  <p>  \t<strong>Finally, Learn How To Get Fit and Burn That Fat For Good This Time!</strong>  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>  \t</strong>  </p>  <strong>Take Control of Your Fitness....</strong>  <p>  \t<strong>  Upper/Lower body split training</strong> takes dedication, drive, and consistency. If you haven't taken the challenge, it's time to leave the locker room and step into the gym.  </p>  <p>  \t                                So what's so different about this program?  </p>  <p>  \t                                I will be with you every step of the way!  </p>  <p>  \t                                I give you a video, for every single training day. Plus meal and supplement recommendations. Along with a few little extras along the way.  </p>  <p>  \t                                You see, when I was working as a <strong>Fitness Professional</strong>, I discovered there were too many \"<strong>Wannabe's</strong>\" out there.  </p>  <p>  \t                                They were given a Fitness Certificate because they knew the theory, but what they didn't know, was how to do it themselves.  </p>  <p>  \t                                I am talking about personal trainers who are <strong>FAT</strong> teaching people to lose weight, or trainers who are <strong>SCRAWNY</strong> teaching people to get ripped.  </p>  <p>  \t<strong>  WRONG</strong>!!!  </p>  <p>  \t                                Why the hell would you listen to someone who can't do it themselves. And that should be the same with everything in life.  </p>  <p>  \t                                So, as with everything I do in my life, I put my money where my mouth is. If I cannot do it, then I do not teach it.  </p>  <p>  \t                                Now the biggest problem in the fitness industry, is everything contradicts itself, and everyone tries to over complicate things.  </p>  <p>  \t                                The program we will be doing together is going to be simple, but <strong>TOUGH</strong>! Be prepared to feel sick in the stomach and <strong>light-headed</strong> after every workout.  </p>  <p>  \t                                Simplicity makes it easier to get into the habit. Getting into the habit changes your life <strong>FOREVER</strong>!  </p>  <p>  \t  You will be:  </p>  <ul>  \t<li><strong>THE FITTEST YOU HAVE EVER BEEN</strong></li>  \t<li><strong>STACKED WITH MUSCLE</strong></li>  \t<li><strong>RIPPED AND VEINY </strong></li>  \t<li><strong>SHREDDED MORE THEN YOU EVER HAVE BEEN IN YOUR LIFE</strong></li>  </ul>  <p>  \t                                But here is a warning:  </p>  <p>  \t                                If you don't turn heads now, you soon will. You will be noticed by your local restaurant staff, by the girls you always see and the hotties in the nightclub.  </p>  <p>  \t<strong>  How do I know?  </strong>  </p>  <p>  \t                                After only 4 weeks of doing this program, this began happening to me.  </p>  <p>  \t                                So imagine what it will be like after 12 weeks.  </p>  <p>  \t                                Everyone taking this course will learn how to <strong><em>Lose Fat</em><em>, Build</em></strong> and <em><strong>Gain Huge Amounts Of</strong></em><strong> Muscle. </strong>Also<strong> </strong><strong><em>Boost Cardiovascular Health, Increase Mental Health, </em><em>Reach</em></strong> and <strong>Sustain Form. </strong>As well as<strong> <em>Increase General Health, Reduce Stress</em></strong> and will help you stay <em><strong>Disease Free.</strong></em>  </p>  <p>  \t<strong>Gain Weight</strong> if you are too skinny with my nutrition lean bulk diet   </p>  <p>  \t<span></span><strong>Build Muscle</strong> with a proper training split program   </p>  <p>  \t<strong>Increase Energy</strong> and life vitality by simply following each video   </p>  <ol>  \t<li><strong>Too skinny</strong>? No problem, we will bulk you up into a ripped beast.</li>  \t<li><strong>Too Fat</strong>? Perfect, you will shred all of that fat and turn it to pure muscle.</li>  \t<li><strong>Never Trained Before</strong>? Too easy, we've got you! Every step of the way</li>  </ol>  <p>  \t                                You will receive all updates free of charge. It really is too good to miss right now. So don't leave this page without purchasing the program first.  </p>  <p>  \t                                Even if you do not want to start yet, purchase it now as you have lifetime access.  </p><p><em><strong>It Is Time To Take Action, Click \"Take This Course\" At The Top Right, Enrol In This Course Now And Learn The Nutrition &amp; Health That Will Get You The Body You Desire!</strong></em></p><p><em>See you on the inside,</em></p><p><em>Mitch</em></p>", 
    "end_date": null, 
    "title": "Beginner Weight Lifting: Upper/Lower Body Split Training", 
    "price": "25.00", 
    "instructors": "Mitch Asser", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357560_ea8f_2.jpg", 
    "course_url": "https://www.udemy.com/lifestyle-lean-muscle-gainer/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T05:14:38Z"
}