{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul><li>LATEST COURSE UPDATE - <em>10th March 2016</em></li></ul><p>Have you been in the gym for at least a year training hard but haven't gotten the results you wanted so you quit?</p><p>Have you been in the gym for years and years but still struggle to put on any amount of size-able muscle gains?</p><p>Do you want to build the kind of muscle that guys envy and women want to be around.</p><p>Or</p><p>Maybe you're just starting out but don't know what the best training split is and are confused as to where to start.</p><p>And finally...</p><p>Not getting the results you want. Confused with too much information. \nFailed with other methods and want to give up. Fit but not happy with \nyour look. Tired of working hard but not getting to the \"sculpted\" image\n you had imagined?</p><ul><li><em>Got flat delts that resemble pancakes? This is for you!</em></li><li><em>Sick and tired of your spaghetti noodle arms? This is for you!</em></li><li><em>Fed up with your chicken legs? This is for you!</em></li><li><em>Want a beautiful and strong v-tapered back? This is for you!</em></li><li><em>Want a full and “gladiator-looking” chest? This is for you!</em></li><li><em>Want cow calves? Eye-popping abs? This is for you!</em></li><li><em>Got a perfectly balanced body? This is not for you!</em></li></ul><p>Imagine \nright <strong>NOW</strong> what a <strong>KILLER</strong> body will do for you in your job, marriage, \ndating relationships, winning the respect of others around you, \nrekindling an old flame, passion and the most valuable currency of all, \ntime!</p><p>Imagine \nhow you'll feel right NOW when everything seems to go your way \neffortlessly because of your NEW physique that only took you a minimal \namount of time to achieve.</p><p><em>Imagine that...</em></p><p><em></em></p><p><em></em></p><p>What IF you could have me on call to help you with your weight training so that you can reach your muscle building goals?  </p><p>What IF you didn't just have to \"hope\" you follow a \nprogram you've already invested in?  </p><p>What IF you can have all your \nimmediate questions about your specific situation answered by me \npersonally?  </p><p>What IF you had a workout plan laid out for you to follow when you train a particular muscle group?</p><p><em>Now You CAN!</em></p><p><em></em></p><p>You can do it! I know because I've helped others who were where you are now...</p><p>Get the body you want - no - the confidence and self-esteem of a person who's UNstoppable!</p><p><strong>Introducing:  Weekly Wednesday Workouts</strong><br></p><p><em></em></p><p>Weekly Wednesday Workouts is an ongoing course where workouts are uploaded weekly on each muscle groups.</p><p>Students will learn how to workout efficiently and effectively to building a better body.</p><p>The only thing is required is that students must have access to a local gym.  Workouts can be done at home if the student has the proper equipment.  </p><p><br></p>", 
    "end_date": null, 
    "title": "BEST Muscle Mass Exercises To Build A Better Body FAST!", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654562_24ff_4.jpg", 
    "course_url": "https://www.udemy.com/weekly-wednesday-workout/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T14:02:02Z"
}