{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong></p><p>Want to be a bikini competitor? Here's my exclusive, all-inclusive survival guide to bikini competing!</p><p>I designed this course to take out the guesswork, for when you prepare to transition from the gym to the stage. I wanted to share the tidbits that I’ve learned along the way. This course will teach you what to expect, what to do and how to do it, what to bring, and about the financial side of this glamorous sport.</p><p>After this course, you’ll be able to rock the stage with full confidence. You can do it, and I can help.</p><br>What are the requirements of this course?<p>The best things in life are free! Bring your positive attitude and personality and you’re already winning! Optional things that will benefit you during this course would be a pair of heels and a bikini to practice in, a place to lift weights, and get in your cardio!</p><p><br></p><p><strong>What am I going to get from this course?</strong></p><ul><li>More than 20 lectures and 45 minutes of video </li><li>5 quizzes to test your knowledge</li><li>The confidence to rock the stage</li></ul><p><br></p><p><strong>What will I know after the course is complete?</strong></p><ul><li>What a Bikini Competition is</li><li>What a Bikini Competitor does</li><li>The rules of the sport</li><li>Who can compete</li><li>What Bikini Competitors eat to slim down</li><li>Workouts specific for a Bikini Competitor</li><li>How to model, walk, pose and flex gracefully </li><li>Posing terminology</li><li>Mandatory posing required on stage</li><li>The cost to compete</li><li>Who should do my make-up and how it should look</li><li>What type of jewelry I should wear</li><li>What type of shoes I should wear</li><li>Bikini waxing and competition tanning</li><li>What I’ll need to feel prepared before going backstage</li><li>How to win a bikini competition </li><li>How to go pro</li></ul><p><strong>Who is the target audience?</strong></p><ul><li>An instructor who’s gauging a prospective client’s interests and wants to give her an intro to the sport.</li></ul><ul><li>Anyone interested in learning about competing, for themselves or someone else.<ul><li>first timers, beginners, females 21-35 with a desire to compete, whether as a career, a workout, or because it’s popular and fun</li></ul></li><li>Mom's wanting to put some excitement in their lives.</li><li>Dancers who want to build strength and confidence</li><li>Trainers unfamiliar with bikini competing and ‘posing’</li></ul>", 
    "end_date": null, 
    "title": "Bikini Competing 101: Beginner's Guide ", 
    "price": "20.00", 
    "instructors": "Brittany Nicole Dixon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450652_78e9_2.jpg", 
    "course_url": "https://www.udemy.com/bikini-competing/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T21:45:37Z"
}