{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This program is for the men and Ladies of all ages, shapes, sizes and fitness levels. The hard Hardworking  executives, the busy moms and dads, the grandmother’s and fathers that don’t let their age get in the way of having the body of their dreams.<br></p>\n\n<p>This program if for the people who have this ONE problem in common…</p>\n\n<p>The PANCAKE BOOTY, The SAGGY BOOTY, The SECRETARIAL SPREAD</p>\n\n\n\n\n\n<p>Is this you?   Have you ever been called those names?</p>\n\n\n\n<p>Or even worse… have you called yourself these names?  HORRIBLE RIGHT?</p>\n\n\n\n\n\n<p>Do you refer to yourself as having absolutely NO  junk in the trunk?</p>\n\n\n\n<p>NO BOOTY, FLAT BUTT SYNDROME, NO ASSATALL</p>\n\n\n\n<p>Are you unhappy with the shape of your bum?</p>\n\n<p>Have you ever attempted to get a bigger butt  before? Chances are you've probably encountered so many challenges and setbacks that you didn't know which strategy, tactic, or exercise program to follow.</p>\n\n\n\n<p>If you've ever felt overwhelmed and told yourself that getting a bigger, more appealing butt was impossible, you're not alone. </p>\n\n<p>I used to feel the same way, my first attempt at getting a bigger booty was very frustrating.<br></p>\n\n\n\n<p>I used to think that the only way to get a bigger butt meant that I needed to train for 6 days a week, utilize extra heavy weights and do multiple exercises and sets each time.                This method works, but I encountered a few problems along the way.</p>\n\n<p>Problem #1- This takes A LOT of time, about 2-3 hours a day in the gym. The average person does not have that kind of time to spend in the gym, away from family and other obligations.</p>\n\n<p>Problem #2- I was EXCRUCIATINGLY SORE!  so sore that the thought of walking up a flight of stairs, or walking at all was painful.</p>\n\n<p>Problem#3- The soreness led to a lack of motivation- I didn't want to go back to the gym. which lead to starting over again multiple times.</p>\n\n<p>I discovered that I didn't need to any of these and that I could avoid most, if not all of those problems. All I needed to do was design a program with simple enough to follow and easy enough that it keeps the momentum and motivation flowing.</p>\n\n<p>In this program, I'll teach you those exact same simple and easy techniques that I used.</p>\n\n<p>BOOTY UP! is For women and men of all fitness levels, who want to build bigger glutes, while spending less time in the gym!<br></p>\n\n\n\n<p>* Learn the\n hidden exercise technique that is the key to Building a  bigger butt, and the correct exercises that target the glute muscles.</p>\n\n\n\n<p>In this course the you will learn about:</p>\n\n\n\n<p>* The muscles that make up the Gluteus Maximus</p>\n\n\n\n<p>* The proper exercise program needed to build a bigger butt.<br></p>\n\n\n\n<p>*Exercise technique</p>\n\n\n\n<p>*Exercise selection</p>\n\n\n\n<p>*Proper nutrition</p>\n\n\n\n<p>*Ways to stimulate muscle growth</p>\n\n\n\n<p>*Glute Killers- What you need to stop doing that’s keeping your glutes inactive and \ntechniques that you need start doing ASAP to see results quickly!<br></p>\n\n\n\n<p>WHAT'S INCLUDED<br></p>\n\n\n\n<p>&gt; The Booty up Manual-  You'll receive a highly targeted manual with greater depth about the gluteal muscles and why certain exercise work.</p>\n\n\n\n<p>&gt; A plethora of  different exercises to choose from- no more plain old squats… unless you want to do them...</p>\n\n\n\n<p>&gt; 30-60 day accountability sheet</p>\n\n\n\n<p>&gt;measurement tracker</p>\n\n\n\n<p>&gt; before and after pic template to see your results..</p>\n\n\n\n<p>&gt; How-to Videos- My videos will take the guesswork out of performing all of the exercises correctly.</p>\n\n\n\n<p>so if you’re a beginner and you’ve never worked out before, my program will be perfect for you!</p>\n\n\n\n<p>there will be no question of what exercises to do or how to do them.</p>\n\n\n\n<p>&gt;Insider tips-  Learn simple tips and cues that will help you be more efficient and the exercises more effective.</p>\n\n\n\n<p><br></p>\n\n\n\n<p>This is a 30-60 day course, however if you want to continue to see results, It's suggested that you incorporate this program into your regularly scheduled daily/weekly exercise program.</p>\n\n\n\n<p>Right now you're probably wondering if getting a bigger but is even possible for you and I can tell you that with this course, it definitely is. This course is perfect for those who want to focus and building a bigger butt, along with utilizing their regular total body exercise program.</p>\n\n<p>Do you want a bigger butt, but don't know where to start?<br></p>\n\n\n\n<p>Have you tried countless programs, only to be back where you started?</p>\n\n\n\n<p>Forget the Butt injections, Plastic surgery, or butt pads and other butt enhancing clothing</p>\n\n\n\n<p>Get my program and permanently boost your confidence, gain sex appeal, improve  \nyour posture, gain knowledge and the experience to make it happen\n in as little as 10 MINUTES per day…<br></p>", 
    "end_date": null, 
    "title": "Booty UP- How to get a bigger booty fast!", 
    "price": "50.00", 
    "instructors": "Ireyna Parker", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678612_643d_3.jpg", 
    "course_url": "https://www.udemy.com/booty-up/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T20:20:02Z"
}