{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><strong><strong>*<strong>UPDATED JUNE 2016 </strong></strong></strong><br></strong></p>\n\n<p><strong>*Join Udemy's </strong><strong><strong>FASTEST GROWING course on Building Muscle</strong></strong></p>\n\n\n\n\n\n\n\n<p><strong><strong>*Over 10,000 successful students</strong></strong></p>\n\n\n\n\n\n\n\n<p><strong>All your life have you...</strong></p>\n\n\n\n\n\n\n\n<ul><li>Been picked on for being <strong>too skinny or stick-thin?</strong></li><li><strong>Intimidated by others who are bigger and stronger than you?</strong></li><li>Felt <strong>small or weak?</strong></li><li>Worried about <strong>defending yourself</strong> or <strong>standing up for yourself in a fight?</strong></li><li><strong>Lacked the strength to help your friends move furniture or equipment?</strong></li><li>Been <strong>overlooked in romantic relationships</strong> because of your <strong>frail body type or build?</strong></li><li><strong>Lacked confidence in your current relationship because of how you look?</strong></li></ul>\n\n\n\n\n\n\n\n<p><strong>If you answered YES to one, any, or all of these questions, this course is just for you. You don't need to be concerned, intimidated, weak or self conscious any longer. You can start building the muscle that you have always wanted RIGHT NOW!</strong></p>\n\n\n\n\n\n\n\n<p><strong><em>***If you have been dying to </em></strong></p>\n\n\n\n\n\n\n\n<ul><li>Get bigger and put on some muscle</li><li>Gain 20, 30, 40+ pounds of muscle mass</li><li>Build self-esteem and confidence </li><li>Get stronger</li><li>Look ripped and intimidating</li><li>Get respected, admired, and complimented by others </li><li>Gain more self respect</li></ul>\n\n\n\n\n\n\n\n<p><strong>By enrolling in this course, you are about to transform your body and your life forever. You are going to break the walls of your genetic potential, and unlock size and strength that you never thought were possible. </strong></p>\n\n\n\n\n\n\n\n<p>Gaining muscle is awesome because it's all about looking big and feeling great, <strong>but it is so much more than that as well.</strong> </p>\n\n\n\n\n\n\n\n<p><strong>What You are Getting in this Course</strong></p>\n\n\n\n\n\n\n\n<p>In this course you are going to be getting full lifetime access to..</p>\n\n\n\n\n\n\n\n<ul><li>How to stay lean while <strong>building muscle mass</strong></li><li>The ONE THING You Need to <strong>gain serious muscle</strong> </li><li>The complete list of <strong>mass gaining super foods </strong>and the diet that will transform your body forever</li><li>Your<strong> biggest enemies</strong> in gaining muscle mass</li><li>Simple diet hacks to <strong>optimize muscle development</strong></li><li><strong>The Secret Weapons to Enhanced Muscle</strong></li><li>The <strong>best exercises</strong> for gaining muscle mass</li><li>Your Personalized <strong>Mass Gaining Training Plan</strong></li><li><strong>How to create your own muscle building workouts</strong></li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><strong><em>So how do you get ripped and build muscle without spending THOUSANDS of dollars on... </em></strong></p>\n\n\n\n\n\n\n\n<ul><li>A gym membership $40-$149/month</li><li>Fitness classes $180-$349/month</li><li>Personal training: $60-$100/session. Typically at 2-4 sessions per week</li><li>Semi-private training: $20-$40/session. Typically at 2-4 sessions per week</li></ul>\n\n\n\n\n\n\n\n<p><strong>See how this can all start to add up? </strong>Don't get me wrong here, I believe that your health is absolutely worth it. Treating your body right with the proper diet and exercise program is not only a means of losing weight, getting a ripped physique, and showing off your six pack abs.</p>\n\n\n\n\n\n<p>Exercise and eating right can save you tens or HUNDREDS of thousands of dollars of the years on doctors appointments, physical therapists, medications, and even surgeries.</p>\n\n\n\n\n\n<p>Also, if you find that this plan does not work for you,<strong> I want to make sure you find the plan that does. </strong>Try it out for 30 days, and if you aren't satisfied <strong>get 100% of your money back, guaranteed.</strong> </p>\n\n\n\n\n\n\n\n<p>You can try this course at no risk, and potentially enroll in something that will <strong>change your body, confidence, and self-perception for the rest of your life.</strong> </p>\n\n\n\n\n\n\n\n<p><strong>My Clients and Personal Experience in Mass Gaining</strong></p>\n\n\n\n\n\n\n\n<p>My first client of all-time, was a friend of mine who was underweight, unhappy, and under-confident in the way he looked and felt. He said that he felt weak, insignificant, and really self-conscious. He said that he was hungry for change, and he wanted me to train him. </p>\n\n\n\n\n\n\n\n<p>In four months, this same client <strong>gained almost 25 pounds of muscle mass</strong> and radically changed his life. From a broken shell of a man with a lowered head and a thin frame, I watched a <strong>muscular, confident phoenix emerge.</strong> </p>\n\n\n\n\n\n\n\n<p>He started getting compliments like <strong>\"Wow! You look great\" </strong>and <strong>\"What have you been doing the last few months?\" \"How can I look like that?\" \"How have you gained all that muscle?\"</strong></p>\n\n\n\n\n\n\n\n<p>I watched life spring into him. This transformation made me realize that<strong> gaining muscle is more than just getting bigger and stronger.</strong> It isn't just about being respected, intimidating, or getting people to notice you. </p>\n\n\n\n\n\n\n\n<p><strong>*It's about breaking mental and physical barriers, redefining your genetic potential, building confidence, and building a better existence. </strong></p>\n\n\n\n\n\n\n\n<p><strong><em>Don't put off your life for another minute.</em></strong></p>\n\n\n\n\n\n\n\n<p><strong>You could spend thousands of dollars </strong>on personal training sessions and dietary consultation <strong>to gain the muscle that you want.</strong> At the end of that though, you aren't going to know why or how you got there. </p>\n\n\n\n\n\n\n\n<p>You will walk the path to muscle mass <strong>without ever knowing exactly what you were doing to get there.</strong> Those professionals <strong>will make you dependent on their recurring service</strong> to get you where you want to be, and keep you there</p>\n\n\n\n\n\n\n\n<p>You will fall off track, lose that mass, regain your old habits and go back to square one. </p>\n\n\n\n\n\n\n\n<p><strong><em>***So why is this course on gaining muscle mass different from other fitness solutions?</em></strong></p>\n\n\n\n\n\n\n\n<p>With this course, <strong>you are getting the total package and 100% life-time access</strong> for a one time purchase. That includes any and all additions and updates that I will make to this course to enhance your muscle mass. </p>\n\n\n\n\n\n\n\n<p>You are not just going to get the results you want. I am going to teach you <strong>why and how you got there</strong> so that <strong>you are going to be an expert </strong>on your own. With this course I am giving you all of the tools, knowledge, and experience you need to <strong>succeed on your own.</strong></p>\n\n\n\n\n\n\n\n<p><strong>Click \"Take this course\" to get started</strong> on building the body of your dreams and transforming your life forever. </p>\n\n\n\n\n\n\n\n<p>I can't wait to hear about your results. See you on the inside!</p>\n\n\n\n\n\n\n\n<p>-Jack</p>", 
    "end_date": null, 
    "title": "Build Muscle: The Ultimate Guide to Gain Muscle Mass", 
    "price": "35.00", 
    "instructors": "Jack Wilson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424526_768a.jpg", 
    "course_url": "https://www.udemy.com/gainmuscle/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T02:43:11Z"
}