{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hey there,</p><p>This course is designed to help skinny guys<strong> Gain Weight and Build Muscle </strong><strong>.</strong>  You'll be able to build maximum amount of muscle, avoid over-training and prevent countless hours of lost time.</p><p>You will experience growth boosting workouts for maximal metabolic stress designed to awaken every muscle fiber and add size quickly even to the weakest of body parts.</p><p>You'll be able to maximize your own anabolic hormones.  With these workouts you'll experience an increase in growth-producing hormones without having to take dangerous drugs, powders or potions.</p><p><strong>This course comes complete with:</strong></p><ol><li>Supplement Guide</li><li>A Formula to Gain Weight and Build Muscle with the Proper Nutrition</li><li>Six Pack Ab Workout Plan</li><li>8 Week Muscle Building Workouts</li></ol><p>Many skinny guys think they are eating and training enough to ignite  muscle growth, but they don't know what techniques to use or how to eat the right kinds of food. And they are under the impression that \"training hard\" by themselves will give them their desired result.</p><p>Well, you've probably ended up pretty confused, gave up the gym and frustrated. </p><p>This course will help you reach untapped muscle building techniques which requires highly specific routines that vary in volume, intensity, frequency and density over an 8 week period.</p> The untapped techniques are simple<p>and very SPECIFIC targets that you must follow and they HAVE to be done in a very specific way in order for you to visually see muscle. </p><p>Here are some of the benefits that you'll begin to experience below: <br></p><ul><li><strong>Packing on maximum muscle mass</strong> without hours in the gym;</li><li><strong>Achieve a body that</strong> demands respect and will give you confidence.</li><li><strong>Having a body so fit</strong> it makes women take notice of you &amp; men envious.</li><li>Sky-rocketing your sexual attractiveness and confidence. </li></ul><p>The materials included in this course are spelled out crystal clear: Reps, Sets, Rest, Periods, Exercises, lifting speed and loads in step-by-step formats (VIDEO and PDF) to help put you put on quality muscle mass and sculpt a world-class body in 8 weeks or less!</p>", 
    "end_date": null, 
    "title": "Build Muscle and Gain Weight - A Skinny Guys Guide to Muscle", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266834_7224_8.jpg", 
    "course_url": "https://www.udemy.com/8-week-muscle-makeover2/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T21:27:33Z"
}