{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong><em>- Last Updated March 17th, 2016</em></p><p><em></em><strong>Added Today (March 17th), 2 PDF's </strong></p><ol><li><strong>19 Page Muscle Building Formula PDF</strong></li><li><strong>22 Page Fat Burning Formula PDF</strong></li></ol><p><em></em><strong></strong></p><p><strong>I'm going to show you how you can Build Muscle and Lose Fat ALL at once by spending less time in the gym but is BIG on results!</strong></p><p><strong>But first, let me ask you a question.</strong><br><strong></strong>\n</p><p><strong></strong>\n</p><p><strong>Is This You?</strong><br><strong></strong>\n</p><ul><li>Have you been BUSTING your ass in the gym and have LITTLE to NOTHING to show for it?</li></ul><ul><li>Have\n you been in the gym for years and years but still struggle to put on \nany amount of size-able muscle gains while losing that stubborn 10-20-30\n pounds of belly fat?\n\t</li></ul><ul><li>Do\n you want a flexible diet and workout plan without starving yourself \nwith the so called, \"Chicken and Broccoli\" diet or living in the gym?\n\t</li></ul><ul><li>Do you want more \"Confidence\" around your friends, dating relationships or your job?</li></ul><ul><li>Do you lose motivation easily?</li></ul><ul><li>You can't afford a personal trainer or nutritionist? </li></ul><p>And Finally... Do You Ever Get The Feeling Of Just Giving UP?\n</p><p>THAT'S WHY THE 180 MUSCLE METHOD IS BUILT FOR YOU! YOU'LL NEVER HAVE TO WORRY ABOUT THESE ISSUES AGAIN.\n</p><p><strong>180 Muscle Is A 12 Week Transformation Program Where You’ll Experience \nVolcano-Grade Burns And Body-Altering Effects That Will Maximize Every \nSingle Ounce Of Your Strength Potential And Catapult Your Physique Into \nThe Next League In Only 180 Minutes A WEEK!\n\t</strong>\n</p><p><strong>What's The Significance To The Number 180? </strong>\n</p><ul><li>\n\t<strong>The Number 180</strong>  You\n might be wondering the significance of the number 180? The number 180 \nis the most important number in this program because it is the number \nthat has the most scientific significance in 180 Muscle.\n\t</li><li>\n\t<strong>Antagonist/Agonist</strong>  The\n term One Eighty literally means, “Opposite Direction.”  The entire 180 \nMuscle method program is a complete 12 week workout program where you \ntrain antagonist/agonist muscle groups or (opposing muscle groups).\n\t</li><li>\n\t<strong>180 Minutes A Week</strong> (4 \nDays)One Eighty is representative of the number of minutes in the \nprogram (180 minutes a week). Train only for 45 minutes a day, 4 days a \nweek which equals 180 minutes total a WEEK!\n\t</li><li>\n\t<strong>                                180 Most Optimal</strong>  The\n number 180 was chosen because of the fact that it is the MOST optimal \nnumber for many of these variables when it comes to unleashing your \nbody’s own anabolic hormones for maximum muscle growth – naturally!As\n will be explained in the program, 180 minutes a week has been proven to\n be the most optimal amount of time you need a week to notice any amount\n of muscle gains.\n\t</li><li>\n\t<strong>Reps</strong>  One\n Eighty is the ideal amount of reps (90 reps antagonist/90 reps agonist)\n needed to not only build size but, to burn stubborn fat all over your \nbody.\n\t</li></ul><p><strong>With 180 Muscle You’ll Be Able To:</strong>\n</p><p><strong></strong>\n</p><ul><li>Experience volcano-grade burns that will take your physique to places it's never been before</li><li>Experience\n a body-altering effect that feels unlike anything else. It's time to \ngrow again by awakening every untapped and underutilized muscle fiber.\n\t</li><li>Learn techniques that will help to ensure every single workout is a winning workout and that out-performs the previous workout.</li><li>Use\n a very specific finishing move (DRTS) that will help to flush blood and\n nutrients into the muscles when added to the end of your normal \nbody-part workout\n\t</li><li>Maximize every single ounce of your strength potential and catapult you physique into the next league.</li><li>Builds what I like to call, “Confidence Boosting Muscle” that leaves you UN-Stoppable!</li></ul><strong></strong><p><strong><strong><strong><strong></strong></strong></strong></strong><strong></strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Build Muscle and Burn Fat in 180 Minutes a Week! -180 Muscle", 
    "price": "50.00", 
    "instructors": "Tim Ernst", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691466_594c_4.jpg", 
    "course_url": "https://www.udemy.com/the-180-muscle-method/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T21:43:48Z"
}