{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn how to do a pull-up by using the proper movement patterns in your upper back and following a progressively more challenging series of phases.</p><p><strong>Build a strong foundation by using the proper movement mechanics in this course for intermediate exercisers.</strong></p><ul><li>Understand Upper Back Anatomy</li><li>Muscle Movement 'Grooving'</li><li>Progressive Exercise Programs</li><li>Proper Pull-up Mechanics </li></ul><p><span style=\"\"><strong>Upper Body Strength You Can Rely On  </strong></span></p><p><span style=\"\">Learning the movement pattern of a pull-up first is essential to build strength in your back and develop the strong muscular back you've always wanted. Pull-ups are a great upper body exercise that focuses on your back to improve your posture and help everyday activities become easier. </span></p><p><strong>Overview</strong></p><p>This course was built for the intermediate exerciser. If you are accustomed to exercising but lack consistency or have never been shown how to move 'properly' and effectively you will get a lot out of this course. We use video lessons so you understand how to do everything properly and we built progressive programs and supplemental material to download to help you avoid injury and build a strong functional back. By the end of this course you will understand how your back and shoulders are supposed to move and you should be able to do an overhand grip pull-up. </p>", 
    "end_date": null, 
    "title": "Build Your Back with Pull-Ups", 
    "price": "20.00", 
    "instructors": "Jonathan Chant", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595918_a9a8.jpg", 
    "course_url": "https://www.udemy.com/build-your-back-with-pull-ups/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T13:56:14Z"
}