{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em><strong>- Last Updated March 15th, 2016 (2.5 Hours MORE Content!)</strong></em></p><p><em>★★★★★ \"Very good contents, special for a low priced course. recommended to anyone who needs to have good start.\" </em>- Hamood<em><span></span></em></p><p><em><em>★★★★★</em> \"Coarse was concise and delivered in a very professional manner. \nDefinitely picked up a lot that will help me in achieving my own goals.\" \nThanks - </em>David Kimberley</p><p><em><em>★★★★★</em></em> \"yes true grate excellent course highly recommended to all practitioners.\" - Mr Themis Koutras</p><p><em><em><em>★★★★★</em></em> \"Well thought of Tim i enjoyed the 5 commandments and all of it is true \nto the science. Keep up for the good work and i will be checking out \nyour other course as well maybe you may start a course of Periodization \nfor a suggestion.\"</em> \n\nThanks Tim. -\n\nSaleem</p><p><em><em><em>★★★★★</em></em></em> \"Brief but jam packed with a lot of helpful information for folks like me\n who are new to building muscle.  If you're looking to step up from \nrecreational exercize then this is probably a good place to start.\" - Lionel Myles<br></p><p><span></span><em><span></span></em>  \t  </p><p>Dear friend,<br>  \t  </p><p>Do you want to look BIGGER, STRONGER, and have the most CONFIDENCE you've ever felt?<br>  \t <br>  \t  -<em>Are you tired of looking in the mirror and not liking what you see?<br>  \t  </em></p><p><em>-Do you think it is possible for someone as skinny as you to gain weight and build muscle? <br></em>  \t  </p><p><em>-Are you tired of getting \"BULLIED\" and getting REJECTED by girls?<br></em>  \t  </p><p><em>-Have you tried EVERYTHING to Gain Weight and failed?<br></em>  \t  </p><p><em>-Do you believe that gaining weight and muscle is all about GENETICS?<br></em>  \t  </p><p><em>-Do you think that you can never have the body you have always dreamed of?</em></p><p><strong>OR</strong></p><p><strong><em>-</em></strong><em>Are you struggling to lose fat?</em></p><p><em>-Are you sick and tired of diets that have failed you in the past?</em></p><p><em>-Do you feel embarrassed in your swimsuit when you go to the beach?</em></p><p><em>-Do lack the energy in your job, playing with your kids and are you to tired to enjoy fun activities with your friends and family?</em><strong></strong><br>  \t <br>  \t  If you answered \"YES\" to any or all of these questions, then it is time for you to Discover 5 Muscle Building/Fat Loss Methods to a KILLER body!<br></p>  <p>  \t   Hi I'm Tim a former skinny guy from Florida.<br>  \t   </p><p>For years I struggled to gain weight and build muscle.<br>  \t   I got picked on,<strong> \"bullied,\"</strong> had no<strong> confidence</strong>, and worst of  all no <strong>girls</strong>.<br>  \t   </p><p>Then I discovered 5 simple \"Muscle Building\"/Fat Loss Methods that helped me gain 30<br>  \t   POUNDS of muscle WITHOUT the fat in the shortest time possible.  </p>  <p>  \t   Now people see me with respect, I got more confidence than I <br>  \t   know what to do with, and most of all I married the women of MY DREAMS!  </p>  <p>  \t   <strong>To learn exactly how I did this…and how you can do the same…simply join the course.<br>  \t   And you'll get FREE instant access to ALL of these below:</strong></p><ol><li>FREE 19 Page Downloadable PDF on The Perfect Formula to Gaining Weight and Building Muscle</li><li>Download Your Free Muscle Building Calculator In The First Lecture So You'll Know Exactly When and How To Eat</li><li>FREE 22 Page Downloadable PDF on The Perfect Formula to Burning Belly Fat While Building Muscle At The Same Time!</li><li>Download Your Free Fat Burning Calculator In The Second Lecture So You'll Know Exactly When and How To Eat For Fast Fat LOSS</li><li>BEST of ALL...Get 2.5 Hours of \"Bulk For Gains\" Video Series As I Take You Behnd\n The Scenes And Show What It Takes To Build Muscle Through My Eating and\n Workouts While Having Family LIFE!</li></ol>  <p>  \t   <strong></strong>This info packed course will change the way you think about building muscle  forever.  This former Hard-Gainer reveals 5 Commandments you must  absolutely know about to increase your muscle size NOW! <br></p><p>  \t <br>  \t<strong>Here 's what else you'll discover in this course below:</strong> <br>  \t <br>  \t<em>1. Why some popular supplements Will Not  get you your desired physique. <br>  \t      2. Why Progressive Overload will accelerate your results fast! <br>  \t      3. Why you can build muscle even if you have a busy schedule.  Train Less For Better Results <br>  \t      4. Why Heavy Weights Doesn’t Equal Bigger Muscle’s <br>  \t      5. A Proven Muscle Building Formula…And So Much More!</em></p><p>  \t <br>  \t      I have discovered 5 basic methods that will help any skinny guy to <em><strong>gain weight, build muscle and strength. </strong></em><br>  \t <br>  \t      I have also discovered the <em><strong>method to keeping that weight and muscle on</strong></em> and I want to share these secrets with you! </p><p>You may be thinking, <strong><em>\"I don't want to gain weight, I want to lose weight.\"</em></strong></p><p><strong><em></em></strong><strong></strong>I have NOT left you out.<strong><em></em></strong><br><strong><em></em></strong></p><p><strong><em></em>This course will cover your fat loss goals to!</strong></p><p><strong></strong>Follow this course and I'll guarantee you this:<strong><em></em></strong><br>  \t <br>  \t<strong>Never again</strong> will you look in the mirror and not like what you see. <br>  \t <br>  \t<strong>Never again </strong>will you be afraid to take off your shirt, in the yard, the beach or anywhere else! <br>  \t <br>  \t<strong>Never again</strong> will you feel that you don’t have the kind of body that will attract the opposite sex. <br>  \t <br>  \t      I want to show you how to get the most out of your training for better  results! I also want to teach you the amazing truth about supplements  and how progressive overload overtime will help you to see fantastic  results. <br>  \t <br>  \t      Of course that is just the tip of the iceberg, there is much more! <br>  \t <br>  \t      I am going to share with you methods that will not only develop you  physically, but secrets that will help you to gain the respect you  deserve, let’s face it, people respond to what they see and a great  physique, commands respect! <br>  \t <br>  \t<em><strong>Women also respond to what they see</strong></em>, a better body means that you  will <em><strong>attract more members of the opposite sex</strong></em>, it also means that you  can re-ignite the interest and desire of your current partner!  <br>  \t <br>  \t      I could charge a lot for that kind of information and knowledge, I  mean, these are life changing methods. Methods that will <em><strong>build your  self-esteem and confidence,</strong></em> this self-esteem and confidence will spill  over into other areas of your life and give you the kind of  transformation that you have probably only dreamed about up to this  point. <br>  \t <br>  \t      I could charge a bundle but I won’t, today I am going to give you all this information <strong>at a </strong><strong>VERY LOW Cost!</strong><br>  \t <br>  \t      Why? <br>  \t <br>  \t      Because I have been where you are right now, I wish someone had  shared these EASY methods that I now know with me sooner, it would have saved  me a lot of frustration and grief. </p><p>I don’t want to see you struggle with  the same issues I did any longer. It’s time for you to get your hands  on this life transforming information! <br>  \t <br>  \t      You literally have nothing to lose and Everything To Gain! Start the course Right Now!  </p>  <p>  \t      After taking this course you'll have the option to try my BEST Selling Course,  <strong>180 Muscle Method </strong><em>\"The system that uses a flexible diet and workout plan to build \"LEAN\" and \"RIPPED\" muscle in just 180 minutes a week!\"</em><strong><em></em> </strong></p><p><strong>ALL Right Here on Udemy!  </strong></p><p>So let's get started.<strong></strong><br><strong></strong></p><p>Hope to see you inside!<br><strong></strong></p>", 
    "end_date": null, 
    "title": "Build Muscle For Beginners: Your Guide To Building Muscle!", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/239382_01ee_4.jpg", 
    "course_url": "https://www.udemy.com/turnaroundfitness/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-08T10:54:50Z"
}