{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>When you train <strong>HARD</strong> with all-out intensity by pushing past your limits, eat right, and get a chance to perform a breakthrough training protocol, extraordinary things can happen. </p><p>That's EXACTLY what occurred to a group of ordinary people in a clinical study using these 5 advanced training methods of this course.</p><p>Now keep in mind that everyone's potential is different, and because of that, your results will only be as good as the effort that you put into your own training program.</p><p>This is not theory or hype. </p><p>Several researchers in the Journal of Strength &amp; Conditioning showed that several bodybuilding training methods appear to promote muscle growth because they incite one or all 5 factors that activate 2 types of hypertrophy in muscle. </p><p>Apply these 5 proven methods in your workout and take the 180 Muscle Method Challenge when you are finished with the course.  </p><p>If you are looking for NEW and FRESH ways to building a desirable physique, this course is vital to your muscle building and fat loss goals.</p><p> In this video course you will learn <strong>5 advanced training methods </strong>to <em>building size, strength and lose that last 10-15 pounds</em> of belly <em>fat</em> at the same time WITHOUT sacrificing time spent in the gym. </p><p>These 5 methods will teach you the most effective ways to get the results you're looking for in a great physique.</p><p>Each video explains 5 training methods you can start using today to incorporate into your current training program.  </p><p>Include in the program is a downloadable PDF to go along with the videos.</p><p>These methods are for <em>beginner</em>s, <em>intermediate</em> to <em>advanced</em> lifters with at least 1-2 years of lifting experience.</p>", 
    "end_date": null, 
    "title": "BUILD Muscle and A Ripped Body WITH These 5 Methods", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535084_8f47_2.jpg", 
    "course_url": "https://www.udemy.com/5-advanced-weight-training-methods/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T13:26:03Z"
}