{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t      Learn how to work out your entire body with natural exercises and movements, just using your body weight!  </p>  <p style=\"\">  \t      With these exercises you will never need to join a gym, and will be able to put them together into a routine that you can do from your home, office, or a nearby park. Calisthenics is a fantastic way to work out, and that is what some of the most fit looking people tend to prefer.  </p>  <p style=\"\">  \t<strong style=\"\">Save Thousands Of Dollars You Would Spend On A Gym</strong>  </p>  <p style=\"\">  \t      Do you currently go to the gym, or are thinking of going there? The calisthenics exercises and routines you will learn in this course will help you avoid the gym, and save you thousands of dollars in gym fees over your lifetime.  </p>  <p style=\"\">  \t<strong style=\"\">Follow The Course Lectures For A Full Body Workout</strong>  </p>  <p style=\"\">  \t  Every day you can give yourself an amazing full body workout by simply following the lectures in this course. You can even make this an aerobic workout by adding a quick pace to the exercises that you do, or a workout focused more on body building and muscle building if that is what you want.  </p>  <p style=\"\">  \t  This course can function as a class you might take in a gym.  </p>  <p style=\"\">  \t<strong style=\"\">Lifelong benefits</strong>  </p>  <p style=\"\">  \t  Once you get comfortable with the exercises in this course, you will have a lifelong exercise, muscle and strength building routine that you can do anywhere at any time for the rest of your life. This will help you transform your body and keep it that way!  </p>  <p style=\"\">  \t<strong style=\"\">Start creating a better, more muscular and more fit body today</strong>  </p>  <p style=\"\">  \t  Sign up for the course and start doing the exercises, and the exercise routines recommended in this course. If you don&#039;t like it, there is no risk because you can get your money back since every course on Udemy is backed by a 30-day money back guarantee. But we are sure that you will love this.  </p>  <p style=\"\">  \t  Calisthenics is something everyone needs to know to maintain a healthy and toned body throughout their lives.  </p>", 
    "end_date": null, 
    "title": "Calisthenics: full body weight training with NO GYM", 
    "price": "20.00", 
    "instructors": "Alex Genadinik, Joey Zanca", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399104_4dc9.jpg", 
    "course_url": "https://www.udemy.com/calisthenics-full-body-weight-training-and-body-building/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T14:59:27Z"
}