{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">There are secrets to mastering your bodyweight. Usually only passed on to professional athletes training for things like gymnastics, this knowledge is imperative to gain control in all forms of movement.</p><p style=\"\"> Arrow-like handstands frozen in time, strict muscle-ups with no kip or momentum, and levitating into levers are no longer myths but achievable goals for anyone with the correct information and training paths.</p><p style=\"\">Calisthenics is a form of strength and power training utilising only compound bodyweight exercises. Using isolation exercises doesn&#039;t teach the body how to coordinate its strength and balance through the core and into the limbs – Calisthenics helps you to develop that through the pursuit of clean and &#039;Strict Form&#039;. The techniques learnt can then be mixed with each other into routines (Freestyle Calisthenics/Street Workout), or weight can be added to the movement once strict form has been achieved to keep overloading the body.</p><p style=\"\">Calisthenics strengthens the body holistically as a unit – it is incredibly useful for those who use their bodies for performance, for example in sports, martial arts, dance and yoga. Whether aiming to improve your ability to keep possession of a ball, developing your punching/kicking power, perfecting your balance or simply just to get stronger, it is an age old training system which will benefit you hugely.</p>", 
    "end_date": null, 
    "title": "Calisthenics 101: Supreme Bodyweight Training & Fitness", 
    "price": "45.00", 
    "instructors": "Ricky Warren", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477060_5033_4.jpg", 
    "course_url": "https://www.udemy.com/calisthenics101/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T13:05:55Z"
}