{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>Boost your flexibility for climbing with these 20 minute yoga classes designed for climbers by a climber. </strong>  </p>  <p>  \tDon't just listen to me, listen to what some of our students say:  </p>  <p>  \t<em>\"<strong>Great sequence for both climbing and general fitness. </strong>As a climber, I very much appreciate Elan's 20-minute sequences targeting different body areas. I use the lecture usually on it own as a cool down after a long day of work to keep my body ready for the climb on the weekend. <strong>It's been very effective, and I have had a significant improvement on the flexibility of my hips.</strong> I also like the way she presents the posture, <strong>very easy to follow for beginners</strong>.\"</em> - Cindy G.  </p>  <p>  \t<em>\"<strong>Perfect! I really enjoyed these lessons.</strong> After few weeks of practicing <strong>I am feeling better during my climb</strong> [...] Thanks a lot. <strong>I highly recommend this course</strong>.\" </em>- Thomas L.  </p>  <p>  \t<em>\"<strong>Enjoyed the course material.</strong> [...] <strong>The material is presented clearly and relevant for climbers. I especially like the individual sessions that focus on certain areas.</strong> It allows me to mix and match the sessions for whatever body part needs the attention.\"</em> - Linda W.  </p>  <p>  \t<em>\"<strong>Effective lessons that fit perfect into my day</strong> [...] <strong>I love having all sessions broken up with each 20 mins having a purpose.</strong> When I have time I can do many, or just one when my days run long. Elan keeps it functional, effective and I can take my class anywhere.\"</em>- Jeff M.  </p><p>“<em><strong>I discovered these wonderful videos and was very glad to purchase the full set of lessons on Udemy.</strong><strong> I think these classes are absolutely fantastic</strong>. 20 minutes is perfect for me and Elan's instruction is absolutely perfect in each video. She focuses on just the right things and has many good tips for the poses, breathing and relaxing.<strong> I've tried and have many different videos as well as yoga apps and this nine-part series is by the best of any of them.</strong></em>” - Adrian C.<br></p>  <p>  \t<strong>Course Details:</strong>  </p>  <p>  \t                                                  This course contains a series of 9 step-by-step streaming video lessons that will teach you to improve flexibility. You can learn these yoga postures and stretching routines in only 20 minutes per lesson.  </p>  <p>  \t                                                  These lessons will specifically teach you how to improve your arms, back, core, hips, shoulders, and side body flexibility for climbing while implementing yoga breath.  </p>  <p>  \t                                                  Since a balance of repetition and new skill adoption is ideal for yoga and stretching, during each session we focus on a key body area as well as integrating poses learned in earlier lessons.  </p>  <p>  \t<strong>Course Length:</strong>  </p>  <p>  \t                                                  The course can be completed in less than 3 weeks if you watch and practice a new lesson every other day. (If you watch and practice only once per week, it can take as little as 9 weeks.)  </p>  <p>  \t<strong>Instructor Availability:</strong>  </p>  <p>  \t                                                  Having trouble with a specific pose and want advice on a modification? Have any other questions? No problem - questions will be answered on the class forum the same week when posted, and often sooner.  </p>  <p>  \t<strong>Instructor Expertise:</strong>  </p>  <ul>  \t<li>Climber-Focused Yoga Experience &amp; Dual Passion: Elan has been teaching yoga for climbers since 2012 and is extremely passionate about both yoga and climbing.</li>  \t<li>Yoga Teaching Certification: Elan holds a 200-hour yoga teaching certificate issued by Bala Vinyassa Yoga based in Naples, Florida</li>  \t<li>Climbing Teaching Background: Elan has been teaching climbing since 2006 and is a Certified American Mountain Guides Association (AMGA) Climbing Wall instructor. She has taught climbing to all ages, from 2.5 years old to 60 years old.</li>  </ul><p><strong></strong></p><p><strong>Course Level:</strong></p>  <p>  \t                                                  This course is geared towards healthy adult climbers.  </p>  <p>  \t                        Yoga and stretching beginners are welcome and so are those who have some basic yoga and stretching experience. If you find any poses too challenging, feel free to skip them or ask the instructor for an easier modification. If you have a current injury or have health issues that can be worsened by yoga and stretching, don't take this course.  </p>  <p>  \t<strong>What Others Say About the Instructor's Studio Classes:</strong>  </p>  <p>  \t<em>Elan was truly the star yoga teacher in our yoga program at MetroRock Climbing Center. It's hard to describe the remarkable enthusiasm students had for her classes. She brings a warmth and playfulness, together with a masterful teaching style, that really set her apart from most yoga teachers I've known. I can't recommend her highly enough! You'll laugh, have fun, feel guided and encouraged into new possibilities, and in the process Elan's yoga will enhance not only your climbing but your sense of ease, flexibility, strength, and focus on and off the rock.</em>  </p>  <p>  \t                                                  - Ken Miller, Phd - Registered Yoga Teacher, Yoga Coordinator &amp; Associate Professor of Holistic Psychology  </p>  <p>  \t<em>I had the pleasure of taking Elan's class at MetroRock climbing gym in Massachusetts. Her unique sequencing of poses and clear verbal cues made the class interesting and exciting. As a fellow yoga teacher, I always learned something new from Elan, and admired the passion that she has for teaching her students anything from the basics to a funky arm balance. She definitely encourages a fun, safe and challenging environment where students can build confidence and develop their practice further.</em>  </p>  <p>  \t                                                  - Kayla Mazzara, Yoga Teacher  </p>  <p>  \t<em>Elan has amazing energy and is very in tune with her students' interests and levels of comfort. She's very motivating and provides many levels of intensity in poses while maintaining a very smooth flow of movement.</em>  </p>  <p>  \t                                                  - Matthias Bahlke, Yoga Student  </p>", 
    "end_date": null, 
    "title": "Climber Yoga: 20-Minute Flexibility Routines for Climbers", 
    "price": "20.00", 
    "instructors": "Elan Solveson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151438_741d_8.jpg", 
    "course_url": "https://www.udemy.com/climberyoga/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T15:37:56Z"
}