{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  Years ago, many of Japan&#039;s top Judo players were also educators (After all, Judo itself was founded by a doctor of education in the late 1800&#039;s).  Scores of these teacher-athletes were sent all over the world to spread the study of the popular Japanese sport.  </p>  <p>  \t  Through their hard work Judo has become a &quot;staple&quot; in many Asian and European physical education classes, as well as become the 3rd most popular contact sport in the world (behind soccer and hockey).  </p>  <p>  \t  Here in the United States however...not so much.  </p>  <p>  \t  Although we Americans love wrestling, boxing, and Ultimate Fighting; Judo just never caught on.  </p>  <p>  \t  The proud Japanese considered this lack of interest a &quot;slap in the face&quot; to their ego, and they decided to do something about it.  </p>  <p>  \t  The top Judo teachers originally sent to the United States were &quot;recalled&quot; to attend a top level, strictly &quot;hush-hush&quot; symposium in Japan... Including my coach.  </p>  <p>  \t  The Japanese government also consented (for the first time ever) to reveal to a panel of hand picked &quot;American apprentices&quot; the details of an incredible new training system that had been developed over the last ten years.  </p>  <p>  \t  And as an educator, coach, and former competitive player, I had received an official invitation to attend.  </p>  <p>  \t  Entering the super-secret workout labs of the Japanese Olympic Judo Team (the same guys who beat the piss out of everyone else in the world every 4 years) it was revealed to those of us in attendance, that top Japanese scientists, psychologists, coaches, and elite athletes had been working to determine a solution for the lack of American involvement in their national sport.  </p>  <p>  \t  Why all the &quot;hub-bub&quot; over American involvement? Why else...MONEY!!  </p>  <p>  \t  Hard statistics don&#039;t lie...Whenever the American public embrace something foreign, whether a product, service, sport, etc. the providing country&#039;s tourism, media, and manufacturing revenue shoots up like a rocket.  </p>  <p>  \t  On a larger scale, everyone knows that whatever America does, the world follows suit...so we&#039;re talking about a virtually untapped market worth Millions and MILLIONS of dollars per year to the Japanese if they could pull it off.  </p>  <p>  \t  The Japanese were convinced that the American lack of interest in Judo was based solely on the fact that learning even the basics of Judo are time consuming and physically taxing. And free time and physical fitness are two things Americans are in short supply of.  </p>  <p>  \t  Therefore the Japanese believed, if they could lure Americans into official Judo schools with a patented, time-efficient, super results workout they would &quot;de-throne&quot; the Billion dollar American health club and gym industry as the &quot;King&quot; fitness solution and they would soon be rollin&#039; in truckloads of Yen.  </p>  <p>  \t  The handful of us in attendance actually were invited along with Japanese officials to serve as witnesses for the &quot;unveiling&quot; of this new program.  </p>  <p>  \t  And when I learned these Japanese secrets, my jaw dropped.  </p>  <p>  \t  Simply put, the Japanese trainers had thrown out practically everything we and the Europeans believe in when it came to how the body builds strength, power, and endurance at a rapid rate - and they&#039;d developed and perfected a much higher-level training approach that produced results myself, my colleagues, and especially the Japanese officials had a hard time believing were possible.  </p>  <p>  \t  The experimental exercise program consisted of no weights, no machines, no fancy equipment.  </p>  <p>  \t  Using animals in the wild as evidence, the program&#039;s creators showed how animals are stronger, faster and more flexible than humans - yet, they don&#039;t lug a machine or barbell around when they train. They got their abilities by working with nothing more than their own bodyweight when they hunt or play.  </p>  <p>  \t  Now, we all know that bodyweight exercises are nothing new. In fact, if you take a look at military history, they&#039;ve been doing calisthenics to prepare for battle since the dawn of civilization.  </p>  <p>  \t  What was different with the Japanese program was that its development team had conducted literally thousands upon thousands of experiments over the last few years to determine what bodyweight exercises worked best and what didn&#039;t.  </p>  <p>  \t  And they had stumbled onto something absolutely amazing....  </p>  <p>  \t  They discovered that if certain bodyweight exercises were performed in a very specific sequence all within a certain time &quot;window&quot;...almost superhuman improvements in strength, endurance, and fat loss are in a matter of only a few days! DAYS!!!  </p>  <p>  \t  And when I say dramatic, I mean that their program would double the rate of your muscle development and QUADRUPLE the rate of body-fat loss (actual statistics from the Japanese training facility) in as little as 6 to 8 days!  </p>  <p>  \t  After returning home I put the program to the test. Learning the ins and outs of the program as well as using the experimental program for my own conditioning, I began to see instantaneous results.  </p>  <p>  \t  And my life changed almost immediately...  </p>  <p>  \t  At the end of one week, I began to feel physically &quot;better&quot;. I could breathe deeply, walk at a more rapid pace, and the stiffness in my neck and shoulders was gone.  </p>  <p>  \t  But the best part? I lost an incredible 11 pounds! And that was only ONE WEEK!  </p>  <p>  \t  During week two I began to sleep like a log; eight hours of deep sleep was no longer a goal it became automatic. I would wake up refreshed and ready to &quot;rumble&quot; every morning. (And still do!)  </p>  <p>  \t  Within three weeks I had packed what can only be called functional muscle onto my legs, chest and back that I&#039;ve never had before. No &quot;bulk&quot; to really speak of, just lean muscle making me super flexible while getting incredibly stronger.  </p>  <p>  \t  By week four my endurance had tripled and my athletic skills started to improve by leaps and bounds. And no wonder...when I stepped on the scale I was shocked to see that I had already dropped 30 pounds!  </p>  <p>  \t  At the end of week five I was given a body-fat analysis. The results? Well, it seemed that in only those five weeks time I had burned off enough excess body fat to the point where I could eat more than I normally did and still continue to lose weight!  </p>  <p>  \t  In week six I noticed something truly amazing...the years of pain I had sustained from countless injuries both in the gym and on the Judo mat. No more shoulder pain from benching, back pain from dead lifts, or neck pain from being tossed on my head during practice.  </p>  <p>  \t  My favorite week was week seven. That week I seemingly gained explosive strength, energy, and a remarkable increase in athletic speed out of thin air. I felt pliable and springy, like a tiger.  </p>  <p>  \t  Finally, by the eighth and last week I was in such incredible physical shape that I once again became a holy terror on the Judo mat. And even more important...I looked damn good!  </p>  <p>  \t  All and all, I lost 70 plus pounds, plunged my body fat to below 10%, and brought my resting heart rate to around 54 beats per minute.  </p>  <p>  \t  At the drop of a hat I could blast out 100 pushups, 20 pull-ups, and then run a mile all without getting winded or out of breath....at 185 lbs.  </p>  <p>  \t<strong>But Here&#039;s The Best Part...</strong>  </p>  <p>  \t  The entire workout, although intense, only took 15 minutes!!  </p>  <p>  \t  I know it sounds absolutely crazy, and trust me...I also thought they were absolutely bonkers when it was laid out on the table, but you just can&#039;t argue with results. And as you saw in my own personal experience, those 15 minutes is all you need to whip yourself into incredible shape.  </p>  <p>  \t  These exercises work much better than weights, and a zillion times better than cardiovascular equipment. Although the routine is intense, the exercises are fun, quick, and energizing.  </p>  <p>  \t  And since you are using your own bodyweight, you never have to worry about injury, overtraining, or best of all...ever needing to waste another dollar or wait on line for machines at a gym.  </p>  <p>  \t  That eighth week, when I showed up back at my coach&#039;s Judo school to resume training, I received some startling news.  </p>  <p>  \t  Although my coach slapped me on the back, and congratulated me on my personal success using the program, he informed that the American public would never see it implemented.  </p>  <p>  \t  It turns out that only a week after we returned from Japan, he had received an official phone call from the Japanese training center.  </p>  <p>  \t  So impressed were the Japanese officials who attended the demonstration that they completely changed their minds about the &quot;American Judo problem&quot; and decided to only reveal the program to their own professional and Olympic athletes.  </p>  <p>  \t  In typical Japanese snobbery, they felt that the program was too good...Too Powerful... to share with the rest of the world.  </p>  <p>  \t  (And four years later, at the Athens 2004 Olympics, their incredibly dominating Gold medal performance in both men&#039;s and women&#039;s&#039; Judo, Wrestling, Swimming, and (most surprisingly) the Hammer Throw...proved it.)  </p>  <p>  \t  All the Japanese affiliated Judo schools that attended were threatened with everything from lawsuits to being thrown out of the Judo federation and their status revoked if they taught the program to their American students. (Or for that matter, any other nationality besides Japanese citizens as well)  </p>  <p>  \t  Oh well, I thought. Sucks for Judo...BUT GREAT FOR ME!!!  </p>  <p>  \t  I had no ties, no affiliation, and most importantly, no loyalty to the Japanese government.  </p>  <p>  \t  If I wanted to teach my fellow Americans these training secrets that had been perfected in the lab and proven in competition, there was not a damn thing they could do to stop me....  </p>  <p>  \t  If you are serious about changing your body...If you want enormous strength, tightly defined muscles, a massive chest, slender waist, powerful arms and legs, and the attention and benefits of being a walking, living comic book superhero, I can make it happen faster and easier than you ever imagined possible. But not necessarily without hard work.  </p>  <p>  \t  Remember, the approach I will reveal to you requires only 15 minutes each day, but it does require you to use that time far differently than you could ever imagine.  </p>  <p>  \t  I can honestly give my word that you will see undeniable increases in your muscle size, strength and appearance -- a total body change --within the first 21 days of applying the <strong>15 Minute Hell </strong>program. <strong>I did it...and so can you.</strong>  </p>  <p>  \t  And I also promise you this: If you&#039;ll only invest those 15 minutes each day following the principles of this incredible training system --there will be no stopping you.  </p>", 
    "end_date": null, 
    "title": "Close Combat Fitness: Ultimate 15 Minute Bodyweight Workout", 
    "price": "20.00", 
    "instructors": "Captain Chris Pizzo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/233260_657e_4.jpg", 
    "course_url": "https://www.udemy.com/15-minute-hell/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-29T20:26:07Z"
}