{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  Can you touch your toes? If you answered &#039;no&#039; then this course is for you...  </p>  <p style=\"\">  \t  This is a complete stretch program that is for anyone who has longed for the desire to touch their toes. Touching your toes is a sign of a healthy, flexible body, and not just for gymnasts or yoga instructors. Everyone, after properly stretching, can get their body back to the naturally flexible &amp; healthy state it was meant to be. In the process you’ll relieve lower back pain, knee pain, foot pain and general overall tightness.  </p>  <p style=\"\">  \t  By taking this course you’ll learn how to on a daily basis to do proper stretching to relieve lower back pain, knee pain, foot pain and general overall tightness, while having the fun goal of being able to touch your toes.  </p>  <p style=\"\">  \t  In this course you will learn the essential techniques to properly stretch your:  </p>  <ul style=\"\">  \t<li style=\"\">Calves</li>  \t<li style=\"\">Hamstrings</li>  \t<li style=\"\">IT Bands (and learns what this is)</li>  \t<li style=\"\">Glutes (all three)</li>  \t<li style=\"\">Quads</li>  \t<li style=\"\">Lower, Mid &amp; Upper Back</li>  \t<li style=\"\">Breathing techniques to enhance all exercise.</li>  </ul>  <p style=\"\">  \t  This program spans over 7 comprehensive modules containing 14 High Definition instructional videos filmed specifically to show you exactly how to PROPERLY stretch each muscle group.  </p>  <p style=\"\">  \t  You can complete this course in as little as 2 hours, but it should be followed daily until you can touch your toes. Then repeat 1 - 2 times per week.  </p>", 
    "end_date": null, 
    "title": "Complete \"Touch Your Toes\" Stretch Program", 
    "price": "25.00", 
    "instructors": "Maarten Van Nus", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286246_2248_2.jpg", 
    "course_url": "https://www.udemy.com/touchyourtoes/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-23T00:58:47Z"
}