{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<em><strong>*** LATEST: COURSE LAST UPDATED ON NOVEMBER 17TH!!! ***</strong></em>  </p>  <p>  \t<em><strong>*** OVER 400 SUCCESSFUL STUDENTS ENROLLED WITHIN 24 HOURS OF LAUNCH!!!!! ***</strong></em>  </p>  <p>  \t<em><strong>*** SIGN UP NOW!!!... AND LOCK IN TODAY&#039;S PRICE FOR LIFETIME ACCESS!!! GUARANTEED PRICE INCREASES WILL OCCUR WITH EACH AND EVERY UPDATE!!!! *** </strong></em>  </p>  <p>  \t<em><strong>_____________________________________________________________________</strong></em>  </p>  <p>  \t<strong>A PROVEN MARATHON TRAINING PLAN FOR RUNNING A FULL 26.2 MILE MARATHON IN UNDER 4 HOURS BY AN ACCOMPLISHED IRONMAN TRIATHLETE</strong>  </p>  <p>  \t<strong>THIS COURSE IS DESIGNED FOR </strong><strong>COMPLETE BEGINNERS, </strong><strong>THOSE WHO HAVE NOT EXERCISED FOR YEARS, AND THOSE WHO HAVE NEVER RUN A MARATHON BEFORE!</strong>  </p>  <hr>  <p>  \t                                Have you always dreamed of running a marathon or half-marathon, but never got round to it?  </p>  <p>  \t                                Are you motivated to run a marathon or half-marathon but don&#039;t know where to start?  </p>  <p>  \t                                Do you want to learn the simple training strategies and techniques that I used to juggle my marathon and Ironman triathlon training with 12 hour+ work days?  </p>  <p>  \t                                Best of all... do you want to do this in a fun, engaging and hassle free way?...  </p>  <p>  \t<strong>Then join our comprhensive community of Udemy marathon runners and you too can run a full 26.2 mile marathon in well under 4 hours... even if you&#039;ve never done anything like this before!</strong>  </p>  <hr>  <p>  \t<strong>IN THIS COURSE I AM GOING TO REVEAL HOW TO: </strong>  </p>  <ul>  \t<li><strong>How any beginner can run a full marathon with this 12 week marathon training plan!</strong></li>  \t<li><strong>How you can fully prepare for a marathon with only 2-3 hours of training per week!</strong></li>  \t<li><strong>The Jedi mind tricks I use to keep me happy, positive and driving forward during ultra-long endurance events!</strong></li>  \t<li><strong>The anatomy of a perfect marathon that will have you running like a pro!</strong></li>  \t<li><strong>How you can run a full marathon AND in under 4 hours!</strong></li>  </ul>  <hr>  <p>  \t                                      Does spending 2-3 hours a week for 12 weeks in order to accomplish a true life time achievement sound appealing to you??  </p>  <p>  \t                           This course shares with you the secrets and simple strategies that I learned in order to transform myself from a hearty 230lb to a lean 160lb Ironman triathlete. I share with you the unique training program that I&#039;ve used time and again to complete half marathons, marathons, triathlons and other ultra-endurance events with minimal training time.  </p>  <p>  \t                         This video course is unique. It is a very direct and clear presentation that most efficiently gets the knowledge from my brain to yours. It&#039;s broken into easy to learn modules that explain the theory and shares the specific training program that I&#039;ve used to complete many marathons.  </p>  <p>  \t                         If you have, or are planning to run a marathon, <strong>I GUARANTEE you that this investment will be the best you will ever make! It will guide you, step-by-step, through every element of training all the way through to race day and what you MUST do after the marathon. This truly is THE all-in-one resource for anyone wanting to run a marathon.</strong>  </p>  <p>  \t                         I will also personally respond to all questions and queries (and even provide my personal email address!) so that you can implement these simple strategies in a fool-proof way.  </p>  <p>  \t                         I know the power of having these marathon strategies, and I can&#039;t wait to help you get there!  </p>  <p>  \t<strong>See you on the inside :)<br>  \t                         - Adrian Knight</strong><br>  \t<br>  \t<strong>PS:</strong> This decision is a no brainer. I have the best refund policy in the world!!<br>  \t                         If you do not like the course in any way then I will refund all of your money!! There is nothing to lose and everything to gain! Make this investment in one of the most life changing accomplishments you will ever do today...  </p>", 
    "end_date": null, 
    "title": "Complete Your First Marathon - Full Beginners Blueprint!", 
    "price": "20.00", 
    "instructors": "Adrian Knight", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325696_adc2_2.jpg", 
    "course_url": "https://www.udemy.com/marathon-training-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T14:31:59Z"
}