{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn how to strengthen your abdominal muscles in a functional way without hurting your back and neck. </p><p><strong>Build a strong foundation of core strength and understand the role your abdominal muscles play in your body.</strong></p><ul><li>Core function</li><li>Progressive Exercises</li><li>Effective Exercise Programs</li><li>Real-life Movement Skills </li></ul><p><strong>Become Better at Everyday Activities</strong></p><p>It's never too late to build the foundation for a stronger core but the earlier you start the easier it is to maintain for the rest of your life and the more effective all your exercises become. This means you can exercise less, maintain your strength and be better at all the activities you love to do like playing sports, gardening and moving boxes. (Well maybe you don't love the last one but having a strong core sure makes it a lot easier)  </p><p><strong>Course Content</strong></p><p> This course is perfect for the beginner exerciser or someone that wants a stronger and more functional core.  If you're at risk for osteoporosis, want to be stronger playing sports or hurt your back and neck while doing abdominal exercises this course is a good fit for you. we teach this course through instructional video and supplemental downloadable files.  It will take about 2 hours to go through, but we encourage you to do the programs or some variation of them for the rest of your life. If you want to struggle less doing everyday activities and have less back and neck pain while you exercise, we encourage you to take this course and learn what it actually means to have a stronger and more functional core.</p>", 
    "end_date": null, 
    "title": "Core Mastery Course", 
    "price": "20.00", 
    "instructors": "Jonathan Chant, Richard Tardif", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581168_65dd_2.jpg", 
    "course_url": "https://www.udemy.com/core-mastery-course/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T14:19:59Z"
}