{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you having trouble losing weight?  Ever wonder how to gain lean muscle mass?  Are you having trouble eating healthy?  In this course, we will address those issues and more to help you obtain the physique you have been striving for through a complete fitness program.</p>\n\n<p>Created for the novice to advanced level, this course covers how to eat clean, burn fat, and build lean muscle through a fitness-training program and includes healthy food information.  \n\n  </p>\n\n<p>This course is a condensed and shortened version of my full course. In this course you get one month of cardio and strength programming. Not all exercises are demonstrated and explained. For more information and to get a full 3 MONTH plan, contact me today!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You will learn how to master your way around a gym and pair it with healthy eating. </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will cover everything you need to know to earn a lean physique including:\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>A complete one month strength      training program</li><li>A complete one month cardio fitness program</li><li>Supplementation Information</li><li>Strength training demonstrations</li><li>Assessing fitness progress</li><li>and much more!</li></ul>\n\n\n\n\n\n\n\n<p><strong>Earn the physique you have always wanted today!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Learning how to eat clean while creating the right strength program and cardio program for fat loss and muscle growth to achieve success can be confusing.  There may be a lot of trial and error and available information to review.   This course puts it all together for you in one complete fitness program, from eating healthy, to strength exercises, to cardio and supplementation.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Whether you want to compete, get in shape for a big event, get healthy, lose weight, or gain muscle mass, by understanding how all the pieces fit together, you can go to the gym with confidence, cook with enthusiasm and walk your own path to success.  This course shows you exactly how to do it. </p>\n\n\n\n\n\n\n\n\n\n<p>\n  <strong>Contents and Overview</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Regardless of your experience, this course is designed to provide you everything you need to achieve fitness results. You will learn how to change your lifestyle through diet and exercise to become healthier and feel better about yourself.</p>\n\n\n\n\n\n<p>You will start with an overview of everything covered in this course. You will learn about how your attitude and mindset will open the door for success in this program.</p>\n\n\n\n\n\n\n\n<p>You will then learn how to become prepared before beginning this program, for example, the equipment you might need as well as the proper food and nutrients.\n\n  </p>\n\n\n\n\n\n\n\n<p>You will then continue on and learn about the benefits of strength training, and terminology.  \n\n  </p>\n\n\n\n\n\n\n\n<p>You will also learn about the benefits of cardiovascular training and the different types of cardio that are part of this fitness program.\n\n  </p>\n\n\n\n\n\n\n\n<p>After learning the background and details of this program, you will have an opportunity to view demonstrations of some and learn which muscles are the primary focus of the strength exercise.  \n\n  </p>\n\n\n\n\n\n\n\n<p>Lastly, you will learn about different supplements and what I recommend as part of this fitness program.\n\n  </p>\n\n\n\n\n\n\n\n<p>\n\n  By the end of this course, you will have the knowledge and tools at your fingertips to earn the physique you have always desired. You will know how to eat clean, burn fat, and build lean muscle.  You will be more knowledgeable in the gym and understand fitness terms.  And will know why cardio and weights are both important in a fitness program.</p>", 
    "end_date": null, 
    "title": "Earn a Lean Physique: A Training and Nutrition Plan", 
    "price": 0, 
    "instructors": "Jen Puzio", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802172_31f4.jpg", 
    "course_url": "https://www.udemy.com/earn-a-lean-physique-a-complete-training-and-nutrition-plan/", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T19:37:12Z"
}