{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Do you have a tough time finding time or motivation for exercise?</strong></p><p>Most people know they need to sit less and move more but they don't? Why is that?</p><p>One reason is because their subconscious mind in sabotaging them. In this powerful, mind-bending course, Joan Kaylor, MSEd., LPC, DCEP, Licensed Professional Counselor, Expert EFT (Emotional Freedom Technique) practitioner, brings her 20 years of experience in helping people just like you <strong>smash through your self-imposed limitations and become the person you always wanted to be. Healthy! Strong! Fit!</strong></p><p>In this course, you will learn how to use EFT to <strong>r</strong><strong>elieve mental and emotional obstacles</strong> to achieving your life goals.</p><p><strong>We cover:</strong></p><ul><li>EFT and Tapping Basics</li><li>7 EFt sessions to deal with specific issues</li><li>How to make your own EFT Tapping sessions</li><li>An effective one month Tapping plan</li><li>How to get as much support as you need</li><li>And much more!</li></ul><p><em>Every single EFT technique which is revealed in this course is easy to put into place in minutes - and can give you instant returns in motivating you to exercise.</em></p><p><em>Nothing is kept secret - I reveal all I know ... and as I test even more things, those that are successful are added to the course - at no extra cost to you! This is a course that will continue to grow and grow.</em></p><p><strong>Every minute you delay is actually COSTING you pounds of weight-burning muscle....</strong></p><p><strong>Enrol now!</strong></p><p><strong>Disclaimer:</strong><br>The information contained on this course is educational in nature and is provided only as general information and is not psychological advice. Transmission of this information is not intended to create, and receipt does not constitute a client-therapist relationship. As part of the information presented on this course, you understand you will be introduced to meridian based energy healing modalities identified as Emotional Freedom Techniques (“EFT”) hereinafter sometimes called “Energy Techniques”. Due to the experimental nature of the Energy Techniques, and because they are relatively new healing approaches and the extent of their effectiveness, as well as their risks and benefits are not fully researched, you agree to assume and accept full responsibility for any and all risks associated with viewing this course and using the Energy Techniques as a result of viewing this website. You understand that your choice to use either EFT is of your own free will, not subject to any outside pressure, and is only for your own personal use. You further understand that if you choose to use the Energy Techniques, it is possible that emotional or physical sensations or additional unresolved memories may surface. Emotional material may continue to surface after using the Energy Techniques, indicating other issues may need to be addressed. Previously vivid or traumatic memories may fade which could adversely impact your ability to provide detailed legal testimony regarding a traumatic incident.<br></p>", 
    "end_date": null, 
    "title": "EFT Weight Loss - Tapping into Exercise", 
    "price": "45.00", 
    "instructors": "Scott Paton, Joan Kaylor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617078_1d6b_4.jpg", 
    "course_url": "https://www.udemy.com/eft-weight-loss-tapping-into-exercise/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T06:35:48Z"
}