{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>I'm so excited to share the long awaited Shoulder Pain Home Program. I designed this program because I continually have friends and family members from other parts of the country who needed to deal with their shoulder pain and I felt I couldn't help them through a simple email or phone call. This program shows you all the steps. </p>\n\n<p><strong>What You're Getting:</strong></p>\n\n<ul><li> You're own personalized game plan to reduce or limit your shoulder discomfort</li><li>A progression of exercises to limit stress and strain on the shoulder</li><li>A way to avoid going to the doctor</li><li>Save money</li></ul>\n\n<p><strong>How long will this take?</strong></p>\n\n<ul><li>There is a 4 minute description of what we'll be doing and how we're going to do it</li><li>Then a 10 minute video showing you the progression of exercises</li><li>You will want to refer back to this course multiple times</li><li>So 15 minutes for the first run, then about 2-3 minutes to review every time you're ready to progress to the next exercise.</li></ul>\n\n<p><strong>Who Has This Video Helped?</strong></p>\n\n<p>Robby Bursey - former collegiate pitcher - “\"I spent my first 21 years pitching competitively for my Little League, high school, and collegiate baseball teams. For most of that time I found myself to always be loose, flexible and healthy. Unfortunately, as I have entered my 30's I have been struggling with shoulder pain from the overuse created during all of those years playing ball. After consulting with Dr. Hoar I noticed improved flexibility and performance within my shoulders. The combination of training and education has dramatically improved the number of activities that I can participate in. I am now in two softball leagues and I swim and bike regularly. I've visited plenty of doctors in the past but nothing has worked as well as this.\"</p>", 
    "end_date": null, 
    "title": "Exercise Away Your Shoulder Pain", 
    "price": "40.00", 
    "instructors": "Dr. Scott Hoar", 
    "commitment": "26 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551896_e0bd_3.jpg", 
    "course_url": "https://www.udemy.com/exercise-away-your-shoulder-pain/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T16:48:53Z"
}