{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Course Description</strong></p><p style=\"\">This course is for those who are interested in making their weight loss goals a reality but have no idea where to begin.</p><p style=\"\">If you need to lose weight, and don&#039;t have any experience of doing this challenging task, you&#039;ll learn by understanding the fundamental concepts of fat loss, and then putting together the only plan you&#039;ll need to lose fat in the easy-to-follow lessons in this course.</p><p style=\"\"><strong style=\"\">Create A Plan, Set A Due Date, No Exercise Is Necessary</strong></p><ul style=\"\"><li style=\"\">Learn The Why Behind Fat Loss Success Stories</li><li style=\"\">Set Up A Comprehensive Plan You Can Follow</li><li style=\"\">Make Fat Loss Easy By Creating Habits</li></ul><p style=\"\"><strong style=\"\">Weight Loss Will Change Your Life Forever</strong></p><p style=\"\">You&#039;ll jump right into this course by learning the fat fundamentals, bonus tricks to attack fat, and get your fat burning to fall off before you know it.</p><p style=\"\">Too many people make the mistake of jumping into weight loss expecting that they can rough through on will power alone. There&#039;s a reason why most diets are broken at night. </p><p style=\"\">In this course you&#039;ll learn methods to leverage your body and your mind to work for you. If your body could take more calories to metabolize and digest a food, why would you eat that food?</p><p style=\"\"><strong style=\"\">Contents and Overview</strong></p><p style=\"\">After a brief introduction to energy&#039;s important role in fat loss, you&#039;ll learn what makes a good calorie so you can choose the right food to eat to keep you full while losing fat at the same time.</p><p style=\"\">You&#039;ll then tackle energy management by means of freestlying, or skeleton planning. You&#039;ll get to know the value of using calories and kinds of calories, as well as how easy they are to work with.</p><p style=\"\">Once your RMR and lifestyle energy are calculated, you&#039;ll add tricks used from the megabooster section to provide a strong parachute to your goal weight. </p><p style=\"\">Example plans, and set up are spread throughout the course along with the choice to stick to a freestyle plan where you can choose to lose fat by understanding the fundamentals I will teach you.</p><p style=\"\">I back up what I say with facts, studies, and results that have been gaining traction in the fitness community as fat loss needs become greater in the industry with more people desiring weight loss.</p><p style=\"\">By the time you complete this course, you&#039;ll have gone from a complete novice on fat loss, energy, and their relationship to a results-based informed train on its track to a weight loss goal with a plan to keep them on track along with a habit creation schedule.</p><p style=\"\">You&#039;ll be getting additional content as I continue to add to this course, and answer any questions that you may message me with, or post in the discussion section of this course.</p>", 
    "end_date": null, 
    "title": "Fat Loss Blueprint: Lose Weight Starting This Week", 
    "price": "20.00", 
    "instructors": "Andrew Gallgan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585904_5022_7.jpg", 
    "course_url": "https://www.udemy.com/lose-fat-complete-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T00:18:28Z"
}