{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>UPDATED JUNE 2016</strong></p><p>Discover How <strong>ANY Man </strong> Can Dramatically <strong>SHRINK</strong> and <strong>TORCH</strong> “Stubborn” Belly Fat In ONLY 8-16 Minutes A Day <strong>WITHOUT A Gym Membership, Weights, or Your Typical LONG and BORING Cardio</strong> (The Dreaded Treadmill)!<br></p>\n\n\n\n<p>This “metabolic secret” could just be the BIGGEST exercise discovery that will instantly \"reactivate\" DECLINING fat loss hormones helping even the most frustrated men SEE their belly get <strong>flatter and their trouble spots get tighter in just 8-16 minutes a day!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>If you have suddenly STOPPED losing fat and don’t want to bother with gym memberships, expensive equipment or weights, these “at home exercises” will make you feel YEARS younger, burning MORE belly fat than an entire HOUR of traditional exercise.</p>\n\n\n\n\n\n\n\n\n\n<p>It will be unlike anything you've ever tried before. </p>\n\n\n\n\n\n\n\n\n\n<p><strong>You’ll be able to:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Tighten up sagging skin and <strong>Firm Up Embarrassing Trouble Spots</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>REIGNITE</strong> \"Youth\" Hormones <strong>Making You Look and Feel YEARS Younger Than Your ACTUAL Age...</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li>Takes <strong>Only 8-16 Minutes</strong> A Day Right In The Comfort Of Your OWN Home</li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li>Enjoy and Eat Your Favorite Carbs to INCREASE Your Insulin Sensitivity So You'll Be Able To <strong>Eat LOTS Of Your Favorite Foods WITHOUT Storing Fat</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li>Discover the \"fountain of youth\" metabolic trick—AND how you can use it to <strong>SHRINK and INCINERATE your most stubborn fat cells in ONLY 8-16 minutes FLAT</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>REPROGRAM </strong>Your Body To Use Fat First, NOT Last!</li></ul>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><strong><em>So how do you lose weight and get ripped without spending THOUSANDS of dollars on... </em></strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>A gym membership $40-$149/month</li><li>Fitness classes $180-$349/month</li><li>Personal training: $60-$100/session. Typically at 2-4 sessions per week</li><li>Semi-private training: $20-$40/session. Typically at 2-4 sessions per week</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>See how this can all start to add up? </strong>Don't get me wrong here, I believe that your health is absolutely worth it. Treating your body right with the proper diet and exercise program is not only a means of losing weight, getting a ripped physique, and showing off your six pack abs.</p>\n\n\n\n\n\n\n\n<p>Exercise and eating right can save you tens or HUNDREDS of thousands of dollars of the years on doctors appointments, physical therapists, medications, and even surgeries.</p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Fat Loss for Guys: Get Ripped and Workout at Home", 
    "price": "20.00", 
    "instructors": "Jack Wilson, Tim Ernst", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/763560_f8c1_4.jpg", 
    "course_url": "https://www.udemy.com/get-ripped-and-workout-at-home-without-weights-or-gym/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-15T20:47:53Z"
}