{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>- Last Updated on March 10th 2016</em><br></p><p>I'm going to show you how running for weight loss is actually hurting your health rather than helping it for those 40 years of age and older.</p><p><strong>In fact, I'm going to show you how you can consistently burn MORE calories for 48 hours after your workout using this one \"simple trick\" <br></strong></p><p><strong></strong>If you've been running for longer periods of time and have STOPPED seeing results, I'm going to show you how you can do it FASTER and in only 15 minutes a day GUARANTEED!<br></p><p>If You're <strong>FRUSTRATED</strong>, Lack <strong>ENERGY</strong>, and <strong><em>\"Sick and Tired\"</em></strong> Of Being <em><strong>\"Sick and Tired\" </strong></em>this course will put you back on the path to help you reach your weight loss goals, no matter where you're starting!<strong></strong><em><strong></strong></em></p><p>You've probably Found  Yourself Once Again Dieting and Stepping Off The Treadmill Week After Week, Month After Month Only To Find Out The Next Morning You Haven't Lost A Single <strong>POUND!</strong></p><p>I'm Willing to Bet You Gave It Your <strong>ALL </strong>and You're Thinking about Throwing In The Towel Once Again Going Back To Your Regular Boring Routine.</p><p>You May Have Looked At Yourself In The Mirror With A BLANK Stare On Your Face Of Defeat, You Figure That You Gave It Your Best Shot and You Finally <strong>QUIT</strong>.</p><p>Maybe You Haven't, But Your Thinking About It.<br></p><p>Well...I'm Here To Tell You, It's <strong>NOT</strong> Your Fault.</p><p>You Didn't Fail Your Last Diet and Workout Program - <strong>Your Diet and Workout Program Failed YOU!</strong></p><p>You've Also Been Mislead Into Believing That Doing <strong>MORE</strong> Will Give You Better Results.</p><p>Nothing Could Be Further From The <strong>TRUTH.</strong></p><p>Starting Right <strong>NOW,</strong> Is Where All Of That Changes.</p><p>Hi, I'm Tim</p><p>And I've Been Exactly Where You Are <strong>NOW!</strong></p><p>Today you'll learn why one of the most popular exercises actually accelerate aging &amp; cause weight-gain for people over 40.</p><p>I'm here to tell you that not all exercises are good for you. In fact, recent scientific studies have \ndiscovered that exercises once considered to be an effective way to trim\n belly fat, get lean &amp; fit and look younger...have now been shown to cause <strong>middle-age belly fat</strong>, LOSS of <strong>lean toned muscle</strong> and <strong>inflammation</strong> that CAUSES you to age faster.<br></p><p>Today You'll Hear The <strong>TRUTH</strong> on How You Can Lose Weight <strong>EASY, FAST</strong> And With <strong>LESS</strong> Effort Than You Ever Though <strong>Po</strong><strong>ssible.</strong></p><p><strong></strong>Imagine Feeling, For The First Time… Like The Person You've Always <strong>DREAMED</strong> Of.</p><p>I Can Tell You That Dream Is Not Far Off. You Can Drop The Belly Fat and Have That <strong>TIGHT, LEAN</strong> Body You Want And You Can Do It With No Powders, Pills Or Potions.</p><p>So Please STOP Imagining. Make it reality. If You Are Not Happy With How You Look, You Probably Never Will Be <strong>UNLESS</strong> You Make A Change.</p><p>If This Excites You, You're Going To Be Able To:</p><ul><li>Reprogram Your Body to Burn 142% MORE Overall Calories From Fat \n(EVERY time you use this one trick to help your body  \"burn \nfat\"—<em>faster</em>)</li></ul><ul><li>Discover how to use movements that are SPECIFICALLY designed for people \nover 40 to instantly create a natural SURGE of fat-burning hormones \nthat's <strong>scientifically documented to \"break apart\" your stubborn fat cells</strong> so you can burn them off.</li></ul><ul><li>Burn more fat in your workouts, build more lean muscle, and improve your health more from at HOME exercise.</li><li>Use an effective and easy at HOME routine for FASTER fat loss WITHOUT any lifestyle changes.</li><li>Implement a little known TRICK to keep burning calories far after your exercise and KEEP burning for 24-48 hours!</li><li>Choose the right exercise to prolong energy and weight loss by \nmaking 1 or 2 SMALL CHANGES to DRAMATICALLY change the way your body \nlooks!</li><li>Put an END To gut-wrenching workouts and reveal how to burn MORE Fat with LESS effort than ever before!</li><li>Put an END once and for ALL to slapping on layers and layers of sweats and running 10 miles on the treadmill.</li><li>Perform a \"mini-workout\" that is a powerful way to work your \nmuscles for an instant metabolic turbo-boost (works especially well at \nwork)!</li><li>Perform FAST and EASY body-weight circuits for FASTER weight loss</li><li>Discover how some exercises ACCELERATE the aging process (NOT good!)</li><li>Perform workouts that burn abdominal fat faster than typical \"cardio\"</li><li>Start seeing results IMMEDIATELY!</li></ul><p>So What Are You Waiting For?</p><p>Let's Get You Started Today And I'll See You Inside The Course.</p><p><br></p><p><br><br></p>", 
    "end_date": null, 
    "title": "Fat Loss: Burn Fat UP To 48hrs Using This 1 Simple Trick", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757370_07bc_5.jpg", 
    "course_url": "https://www.udemy.com/best-weight-loss-methods-for-faster-fat-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T17:09:01Z"
}