{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">*UPDATED MAY 2016</strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Where are you now?</strong></p>\n\n\n\n\n\n\n\n<ul><li>Have you been struggling with weight loss?</li><li>Do you have nagging body fat around your hips, thighs, stomach, love handles, and underarms?</li><li>Have you been slowly gaining weight for months or years now?</li><li>Have you fallen off track with working out or exercising?</li><li>Are you intimidated to start exercising to help you lose weight?</li></ul>\n\n\n\n\n\n\n\n<p>Weight loss is one of the most difficult and daunting things that you can do in your life. It's not easy, it takes serious discipline, and without guidance or support it can seem almost hopeless. </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">You know what's the absolute WORST?</strong><br></p>\n\n\n\n\n\n\n\n<p><em><strong>Do you want to know what is even more frustrating about trying to lose weight?</strong></em> It's that your guy friends, your boyfriend, your fiance or husband, and the rest of the men in your life seem to have no problem AT ALL when it comes to weight loss. It is almost like they can just will the weight right off of them. </p>\n\n\n\n\n\n\n\n<p>Do they just have faster metabolisms or simpler hormones when it comes to losing weight? Do they manage stress better than you do? </p>\n\n\n\n\n\n\n\n<p>Does it have something to do with how many calories they burn or how much muscle they can build when they start working out?</p>\n\n\n\n\n\n\n\n<p><strong><em>Why is it so different for women? What do they have that you don't?</em></strong><br></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why you may be struggling to lose weight...</strong></p>\n\n\n\n\n\n\n\n<p>Here are some of the most common reasons why you may be struggling to lose weight. </p>\n\n\n\n\n\n\n\n<ul><li>You don't have the support or accountability of your friends, family significant other, or spouse. </li><li>You get burnt out on the same, bland healthy meals and want to eat the foods that you love. </li><li>You get burnt out on doing exhausting, time-consuming workouts that don't deliver results. </li><li>You hate cooking or don't have the time. </li><li>You hate going to the gym or don't have the time to. </li><li>You aren't sure how to eat healthy or where to start. </li><li>You aren't sure how to exercise or how to get started. </li></ul>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"></strong></p>\n\n\n\n\n\n\n\n<p><em><strong>Ladies, if you need a new, no B.S. weight loss solution that works for you, THIS IS IT! </strong></em></p>\n\n\n\n\n\n\n\n<p>No more complex workout programs</p>\n\n\n\n\n\n\n\n<p>No more crazy diets and cleanses that burn you out</p>\n\n\n\n\n\n\n\n<p>No gym needed</p>\n\n\n\n\n\n\n\n<p>No equipment required</p>\n\n\n\n\n\n\n\n<p>And everything you need <strong>is right here. </strong></p>\n\n\n\n\n\n<p><strong>What you Are Getting in this Course</strong></p>\n\n\n\n\n\n<ul><li>A customized workout program specifically designed to help women lose weight. </li><li>How to lose weight and lose stubborn body fat by working out for about 1 hour per week, from the comfort of your own home. </li><li>How to lose weight with flexible dieting, so that you can still eat the foods that you love and lose weight. </li><li>What foods are the worst and the best for fat loss and weight loss</li><li>What carbs are the best and worst for fat loss and weight loss</li><li>How to burn more fat and more calories during your workout, and for up to 30 hours after your workout is over. </li><li>Why building muscle is one of the best solutions for sustainable weight loss</li><li>How to get that lean, toned, sculpted, athletic look that you have always wanted. </li><li>How to workout less, eat more, and master weight loss. </li></ul>\n\n\n\n<p><strong>What else you are getting...</strong></p>\n\n\n\n<ul><li>New videos, workouts, content added every month to help you lose weight. </li><li>Bonus material that will help you break through your weight loss plateaus.</li><li>Weight loss secrets that will help you lose belly fat and optimize your hormones for weight loss and fat loss. </li><li>A 4 week, repeatable workout program that you can do from the comfort of your own home with no equipment required. </li></ul>\n\n<p><strong>The best Time to Start is RIGHT NOW!</strong><br></p>\n\n<p>Don't put off your health, your body, or your goals for one more minute. You deserve to be healthy ladies. You deserve to be happy and comfortable in your own skin. </p>\n\n<p>No more waiting. No more excuses. <strong>Let's do this!</strong><br></p>\n\n<p><strong>100% Money Back Guarantee</strong><br></p>\n\n<p>The best part is that you can try this course risk free for 30 days, and if you aren't happy with your results, you can get 100% of your money back. </p>\n\n<p>What are you waiting for? Let's do this together. </p>\n\n<p>-Kailee and Jack</p>", 
    "end_date": null, 
    "title": "Fat Loss For Women", 
    "price": "30.00", 
    "instructors": "Jack Wilson, Kailee Sisson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753782_7f77_8.jpg", 
    "course_url": "https://www.udemy.com/weight-loss-for-women/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T20:33:32Z"
}