{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><em>Course updated on January 5th, 2016 : Check out the Workout Templates for all Fitness levels worth $597. They are only to my students.</em></strong></p><p><strong><em>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</em></strong></p><p><strong><em>Be Courageous to start over. It's a new chance to rebuild what you want!</em></strong></p><p>Getting onto a Healthier Lifestyle has never been this easy and simple. We all need that little push at some point in our lives to achieve our Goals and this course exactly delivers that and much more. It keeps you Motivated throughout your Fitness Journey. Whether you are starting on your Fitness Journey as a beginner or as an advanced athlete or want to resume it after a break or want to keep your momentum going forward, this course is for you!</p><p>With this comprehensive course <strong><em>KICK START YOUR FITNESS JOURNEY IN 7 EASY STEPS</em></strong> I want to give YOU a practical guide to help YOU get on to Your Healthy Lifestyle </p><p><em><em>Hi, I am <strong>Ravi Kumar G</strong>, Founder of <strong>RKG FIT</strong><sup><strong>TM</strong></sup> and Mathematics Lover. I have spent several years in researching about how to live a healthy and better life with minimal efforts so that anybody irrespective of age, sex and locality can enjoy their Life to the fullest. After all, Health is Wealth.</em></em></p><p><strong><em>               ==============================SET GOALS. TAKE ACTION.==============================</em></strong></p><p><strong><em>How is the course structured?</em></strong></p><p>This course is divided into different sections for your convenience and better understanding where each section focuses on different step to Kick Start your Fitness Journey. Each step is accompanied with an action template to get the most out of this course. There are also few sample templates of workouts for all levels which you can download and start working out. Apart from that I have also included some Templates to keep your Motivation levels high all the time. By the end of this course you will be motivated enough to move forward and Kick Start your Fitness Journey. </p><p><em><strong>What kind of materials are included?</strong></em></p><p>1. Video lectures </p><p>2. Action templates for each step to Kick Start your Fitness Journey </p><p>3. A downloadable transcript for every lecture for your convenience </p><p>4. Workout Templates for all levels of Fitness</p><p><strong><em>Why You should take this course?</em></strong></p><p>This course is for anyone who wants to live a Healthier and Better Life, no matter who and where you are. This comprehensive course will keep your motivation up all the time by guiding you, making you more focused and organised in a simple way. This comprehensive course will help you in deciding your WHY, helps you in realizing the importance of Diet, How to overcome your obstacles and how to set Goals and achieve them and much more.</p><p><em><strong>This course is a blueprint to your Healthy Lifestyle, Not just another e-course with some vague ideas.</strong></em></p><p><em>So what are you waiting for? Go ahead and Kick Start Your Fitness Journey!</em></p><p><em>Good Luck,</em></p><p><em>Ravi Kumar G.</em></p>", 
    "end_date": null, 
    "title": "Fit for Life  in 7 Easy Steps", 
    "price": "20.00", 
    "instructors": "Ravi Kumar G", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482896_9028_5.jpg", 
    "course_url": "https://www.udemy.com/kick-start-your-fitness-journey/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T06:06:53Z"
}