{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Course Summary</p>    <p>Over 30% of the population on the earth suffer from an unhealthy sedentary lifestyle</p>  <p>which is linked to various diseases like heart attack, cancer as well as many other </p>  <p>problems of the daily life.This physical inactivity causes a big percentage of deaths</p>  <p>every year.</p>    <p>This  course is designed to take you away from this unhealthy lifestyle and transform</p>  <p>your body into fitness example for the people around you.</p>    <p><strong>Build a strong and ripped body and stay throughout your life with this modern training </strong><strong>method</strong>. </p>    <p>-With this course you will:</p>  <p>-Make every part of your body strong and ripped</p>  <p>-Lose belly fat</p>  <p>-Be flexible and reduce stress</p>  <p>-Increase your metabolism and your energy</p>  <p>-Grow your muscle mass</p>  <p>-Be healthy and happy in your life</p>  <p>-Train maximum 1 hour everyday</p>  <p>-Build ripped abs</p>  <p>-Improve your vertical jump</p>  <p>-Gain reactive strength (plyometric strength)</p>  <p>-Gain pure power with isometric exercises</p>      <p><strong>A stronger and ripped body in one month</strong></p>    <p>It is possible with this course to transform your body in one month if you follow correctly every workout routine. You will notice in yourself the first results after little time of following this course. You will feel stronger healthier and you will feel the first pounds missing of your body.</p>    <p><strong>Overview</strong></p>    <p>More than 6 hours of content, this course is a complete training method consisting by 6 sections (each one is a training day) and 21 lectures. In this course you will find cardio routines that will help you to lose belly fat as fast as possible and reduce your weight.<br>  Also transform your body and make stronger every muscle group. Build ripped abs with the powerful abs workout program and create bigger muscles with a special workout mix of bodyweight exercises.  Although I’m going to show you the best way to create an exemplar upper body.<br>    It is all about  training 1 hour everyday. My teacher in university  reminded us every morning in the class his favorite phrase : “always remember that  a strong body can be specified  by the strength of the shoulders and legs”. After many years I realized what this phrase deeply means and how my teacher was right. Today I have the chance to share with you one of the most powerful leg workouts. The plyometric routine that we have designed represents a modern training method to increase the reactive strength of your legs , improve your jumping technique and your vertical jump.<br>  Apart from plyometrics in this course you will learn some basic isometric exercises to gain pure power. Isometric are static exercises that provide you muscle strength without building muscle bulk.<br>   Finally stretching is one of the most important parts of training. Above the flexibility that offers, it can be a significant  factor of injury reduction as well as stress elimination. Generally this course is the way to make your life better by offering health and happiness, through a strong and beautiful body. Take care of your body, it’s the only place you have to live…</p>    <p>See you in the course! <br> <br> </p>  <p>-George Katsilidis</p>", 
    "end_date": null, 
    "title": "Fitness - Workout Routines for a Perfect Body", 
    "price": "20.00", 
    "instructors": "George Katsilidis", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708808_2faf_2.jpg", 
    "course_url": "https://www.udemy.com/fitness-workout-routines-for-a-perfect-body/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T18:29:28Z"
}