{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em><strong></strong></em></p>\n\n<p><em><strong>HIT PADS</strong> is a brand new course brought to you by Expert Personal Trainer and Kickboxing Instructor, Leo Diez.</em>  In HIT PADS I take you through all the basic techniques of kickboxing, and lead you through a full tailor-made stimulating workout that can be used anywhere; on a punch bag, using pads, or even on your own with 1kg weights.  This course is about discovering an exciting way to train and learning a new method to stay in shape for life no matter where you are in the world. </p>\n\n<p><strong>Learn My Kickboxing Techniques, Put Them Into Action With The 'Hit Pads' Workout, And Your Reward Will Be An Awesome Body!</strong></p>\n\n<p><em><strong>What else will I get from this course?</strong></em></p>\n\n<ul><li>Learn Kickboxing skills for life</li></ul>\n\n<ul><li>Discover a way to stay in shape no matter where you are in the world</li></ul>\n\n<ul><li><strong>Burn up to 800 calories in the Hit Pads workout</strong></li></ul>\n\n<ul><li>Feel confident in the gym on the punch bag</li></ul>\n\n<ul><li>Lose fat..not just weight, (there is a big difference!</li></ul>\n\n<ul><li>Improve your physical strength, stamina and endurance.</li></ul>\n\n<ul><li>See dramatic positive changes in physical appearance and body composition</li></ul>\n\n<ul><li>Improve your self esteem, and confidence</li></ul>\n\n<ul><li>Increase your energy levels and get a better night's sleep</li></ul>\n\n<ul><li> Relieve stress and feel more relaxed on a day to day basis.</li></ul>\n\n<p><strong>Kickboxing exercises every muscle, you will be getting a full body workout so you can expect real results in a shorter time frame.  </strong></p>\n\n<p>This course is structured with 100% professional video and we start with all the basic kickboxing techniques.  I take my time to show you the moves and repeat actions in slow motion so you can really see the form that we use for kickboxing and have an easier learning experience.  I also include some useful tips on perfecting your technique throughout the course.  You will then get a chance to put your new moves into action on the HIT PADS workout which is slightly over an hour and includes a good lengthy warm up, skipping, body weights and an intense training session.  </p>\n\n<p>The whole course is professionally filmed so you will be able to workout with me on the screen!  (suitable for all levels). The HIT PADS course is great if you're looking for a skill to learn but would also like to combine it with a personal fitness goal.. such as losing fat, toning up, or getting stronger.  This course is also particularly good if you haven't done kickboxing before because I am with you throughout the whole workout. </p>\n\n<p><strong><br></strong></p><p><strong>This is your personal journey to amazing body definition, and you will see the changes in just 14 days. </strong></p><strong>\n\n</strong><p><strong></strong><br></p><p>The beauty of HIT PADS is that it can be used anywhere and for any purpose.  If you want to learn the correct techniques from a kickboxing professional then you've got it.. but you also have the chance to implement your new skill in the workout.  </p>\n\n<p><strong>If you are wanting to really unlock the secret to your perfect body then kickboxing is the perfect way to shape you up in a short amount of time.. its exciting, challenging and highly effective at improving your body and even your mind!</strong>  In fact you can really expect to feel calmer in general day to day life as another bonus of HIT PADS is that its the perfect stress reliever.  </p>\n\n<p>You can use the HIT PADS workout with a friend on pads, on a punch bag or on your own with 1kg weights. So even if you're travelling, or on your own at home there's an option for everyone. At the end of this course you will walk away with a new skill and confidence in the way you implement your kickboxing technique. If you are committed to the course you will also see a change in your body for the better, increased energy, inner calm, and an improved fitness level. As well as the Udemy 30 day guarantee, you have my personal promise that this course is full, extensive and a valuable learning experience.<br></p><p><strong>So don't delay, enrol now and start to embrace life again with some new air in your lungs, (some new gloves on your hands) and a stimulating programme! Let's do this!</strong></p>\n\n<p><strong><em></em></strong></p>", 
    "end_date": null, 
    "title": "FITNESS KICKBOXING Lose body fat fast & look incredible now!", 
    "price": "35.00", 
    "instructors": "Leo Diez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481918_ced9_3.jpg", 
    "course_url": "https://www.udemy.com/fitness-kickboxing-lose-body-fat-fast-look-incredible-now/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T07:11:53Z"
}