{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Thank you for Looking at my FREE online weight and fat loss success course! </strong></strong><br></p>\n\n<p>My Udemy course on fat and weight loss contains all the information I've painstakingly learned through hours and hours of reading, working with one on one with people, and applying this to my own life. The picture you see above is of me. I used the tactics that I am going to explain step by step to you in this course to go from zero to hero. The course is designed to teach you what I wish was taught to me in school. Everything you need to build a solid foundation in weight loss success. It is 100% free for you, and I am constantly updating it using user feedback as well as any information I feel you need to know. </p>\n\n<p><strong class=\"redactor-inline-converted\">Why My Course is Different From Others</strong>: Weight Loss Made Simple<br></p>\n\n<ul><li>Most weight loss programs teach you things with a goal of knowing the information. My goal is to get you to <strong class=\"redactor-inline-converted\">understand </strong>the information I present so that you can formulate your life to meet your personal lifestyle goals</li><li>I teach you why Fad Diets will ultimately make you worse off in the long term</li><li>Finally, I teach you how simple it really is to obtain any goals. Stop making your life and nutrition plan so difficult on yourself, you have enough things in your life that cause stress! What you eat on a daily basis shouldn't be one of them!</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">You're busy, don't have time, and are tired of not getting REAL results...</strong></p>\n\n<p>You've come to the right place. In my course, I simplify all the information out there giving you your freedom back. I am giving you a nutritional foundation that took me years to cultivate and understand. I distill what works from what doesn't and show you how to problem solve for yourself in real time and stop relying on outdated and worthless methods.<br></p>\n\n<p><strong class=\"redactor-inline-converted\"><u>Fad Diets are dead. DEAD.</u></strong></p>\n\n<p>Well, they should be. People are far too intelligent to get sucked into their marketing schemes. They claim to lose outrageous amounts of weight in short periods with little or no work. Or conversely to lose outrageous amounts of weight after paying some \"<em class=\"redactor-inline-converted\">expert</em>\" thousands of dollars. <u>What most people don't know is the real secret behind fad diets, I will show you how to not buy into the hype in my course. </u></p>\n\n<p><strong>IIFYM</strong></p>\n\n<p>This simple phrase that is changing the way people think about eating habits. However, it is not as simple as some would think. </p>\n\n<ul><li>IIFYM Defined</li><li>Can I just eat candy all the time?!</li><li>It can't be that simple, can it?</li><li>How to use IIFYM positively vs negatively</li></ul>\n\n<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Why should YOU take this course:</strong></p>\n\n<ol><li><em class=\"redactor-inline-converted\">Take this course if want to learn the fundamentals of nutrition and information I wish they taught me in school.<br></em></li><li><em class=\"redactor-inline-converted\">Take this course if you are tired of losing weight in the short term but can't achieve long term success</em></li><li><em class=\"redactor-inline-converted\">Take this course if you are a busy person who wants a simple, effective way to integrate weight loss into your life without sacrificing everything.</em></li><li><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Take this course if you are ready to change your life for the better! There is NO risk, only reward!</strong></em></li></ol>\n\n<p><strong class=\"redactor-inline-converted\">Here What you are Getting for free in this course:</strong></p>\n\n<ul><li><em>Knowing Something vs Understanding It</em></li><li><em>The Most Important Factor in Weight Loss</em></li><li><em>What are Macro-nutrients? And...</em></li><li><em>How Many Calories Does Each Have?</em></li><li><em>What is IIFYM?</em></li><li><em>Diet vs Lifestyle: The KEY to Success</em></li><li><em>What are Fad Diets?</em></li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><u>BONUS CONTENT</u>: ENROLL NOW, WITHIN THE COURSE I WILL GIVE YOU INSTRUCTIONS ON HOW TO <u>GET MORE FREE INFORMATION</u>. I WILL ALSO PROVIDE YOU WITH SEVERAL WAYS TO GET IN TOUCH WITH ME PERSONALLY TO ANSWER YOUR BURNING PERSONAL QUESTIONS. </strong></p>\n\n<p><strong>What you need to complete this course:</strong></p>\n\n<ul><li>Nothing other than a willingness to learn!</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Who is the Target Audience:</strong></p>\n\n<ul><li>Beginners, weekend warriors, and people who value <strong class=\"redactor-inline-converted\">knowledge</strong>!</li></ul>\n\n<p>Losing weight can be one of the hardest things you do in your life, <strong class=\"redactor-inline-converted\">but it doesn't have to be.</strong> If you have been struggling to lose weight or are intimidated to start, this is the solution for you.</p>\n\n", 
    "end_date": null, 
    "title": "Free: Understand Weight & Fat Loss - No more Fad Diets!", 
    "price": 0, 
    "instructors": "Nick Helton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790790_609e_5.jpg", 
    "course_url": "https://www.udemy.com/onebetterfatloss/", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-12T18:49:16Z"
}