{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course you will learn high intensity interval training which is a special type of training used by many professional athletes, and people like firefighters whose jobs depend on them to be fit. </p><p>High intensity interval training (sometimes called HIIT) is what the popular Crossfit exercise system is based on. Crossfit is the latest popular exercise trend, and it is based on what we will teach you in this course! So go ahead and sign up, and begin having some awesome high intensity workouts.<br style=\"\"></p><p>High intensity interval training (sometimes called HIIT) works all the major muscle groups of your body while at the same giving you a great aerobic exercise because you are constantly out of breath. That way, in just 30 minutes you have the equivalent of a jog and a weight training exercise.</p><p>Unlike regular dumbbell-based exercise, you don&#039;t sit around and waste time between repetitions and sets. Instead, you choose your 5 to 7 exercises and rapidly go through them. Once you are done with all of them, you start doing them again, only next time with fewer repetitions. And you keep going for a few cycles of all the exercises.</p><p><strong style=\"\">Money back guarantee</strong></p><p>Every Udemy course comes with a money back guarantee. So if for some reason you don&#039;t like the course, you can get a refund within 30 days of the purchase. But I am sure you won&#039;t want a refund because you will love the course! So go ahead, sign up and begin your high intensity workouts today!</p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "High Intensity Interval Training: Crossfit is based on this", 
    "price": "20.00", 
    "instructors": "Alex Genadinik, Joey Zanca", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490394_4b78_3.jpg", 
    "course_url": "https://www.udemy.com/high-intensity-interval-training-hiit/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T14:35:11Z"
}