{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><strong style=\"\">&nbsp;I Lost 100 lbs in 106 Days</strong></p><p style=\"\">Can you do that too?&nbsp; Maybe, but even if you do a fraction of what I did you&#039;d be pretty happy wouldn&#039;t you?&nbsp; This is a detailed day by day guide showing you exactly:</p><ul style=\"\"><li style=\"\">What to eat</li><li style=\"\">When to eat it</li><li style=\"\">What to do for strength training</li><li style=\"\">When to do strength training</li><li style=\"\">What to do for cardio training</li><li style=\"\">When to do cardio training</li><li style=\"\">How to keep focused</li><li style=\"\">How to stay motivated<br style=\"\"></li></ul><p style=\"\">This 21 day program is a proven system that I used to lose my weight.&nbsp; I started at 340 lbs and finished at 240 lbs.&nbsp; It took me 106 days to do this.&nbsp; But this is a shorter version so that you can see results quickly and experience what it&#039;s like to finally lose weight and keep it off. <br style=\"\"></p><p style=\"\">Weight loss is a mindset and a lifestyle change.&nbsp; You can do it all on your own, but it&#039;s not easy.&nbsp; We go through the 4 pillars of weight loss and you get accountability to the group on our Facebook Page too.</p><p style=\"\"><strong style=\"\">3 Levels To Choose From</strong></p><p style=\"\">We offer 3 levels for you since we understand that everyone is different, has a different situation and different comfort levels.&nbsp; Not to mention some have never lifted a weight in their lives so showing them a program where they have to go into a gym and &quot;pump iron&quot; would be not be a good idea!&nbsp; So we set out 3 levels as follows, you get to pick which one suits you best:</p><ol style=\"\"><li style=\"\"><strong style=\"\">Beginner:</strong>&nbsp; This is for people who have never been in a gym, have no interest in lifting weights and want to take it a bit slower to get started.&nbsp; There is nothing wrong with this level, a lot of people will choose this.</li><li style=\"\"><strong style=\"\">Intermediate:&nbsp; </strong>This is for people who might have a gym membership, may have taken a step class or aerobics class in the past and are keen to move a little faster then the beginner level.</li><li style=\"\"><strong style=\"\">Advanced:</strong>&nbsp; This is the level that was done to achieve 100 lbs lost in 106 days.&nbsp; It involves jogging and free weight training.&nbsp; If you have experience in the gym or want to experience the gym, this is for you.&nbsp; (We do suggest purchasing a book by<em style=\"\"> </em>Arnold Schwarzenegger at this level, it is available in book stores and on amazon.com, it&#039;s optional to buy as well but explains free weight exercises better then we could ever do).<br style=\"\"></li></ol><p style=\"\">The videos walk you through each level and how to choose the one for you.&nbsp; You can switch levels at anytime too, so if you start at the beginner level and are feeling motivated, you jump to the other levels at anytime.<br style=\"\"></p><p style=\"\"><strong style=\"\">The First &quot;Online Trainer&quot;</strong></p><p style=\"\">Think of the class as your own online trainer.&nbsp; If you can follow simple instructions you can do this.&nbsp; You don&#039;t need to pay someone big bucks to lose weight.&nbsp; Don&#039;t bother following expensive programs that are just out to empty your wallet.&nbsp; This works and is proven by me.</p><p style=\"\"><strong style=\"\">Do It With A Buddy</strong></p><p style=\"\">It&#039;s been proven that when you lose weight with a buddy you tend to have more success.&nbsp; So we do encourage you to do the program with a buddy.&nbsp; HOWEVER you can think of the group as your online weight loss support buddies.</p><p style=\"\">Ready to finally get off the weight loss and gain rollercoaster?</p><p style=\"\">Take the program now.<br style=\"\"></p><p style=\"\"><br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "How To Lose 19.8 lbs In 21 Days", 
    "price": "50.00", 
    "instructors": "Will Haimerl", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51194_16ae_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-lose-weight-in-21-days/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-24T23:23:32Z"
}