{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you new to push-ups? You might have been trying to perform your very first rep of push ups for some time and fail or you might even be completely new to the exercise. Whatever it is, this program will ultimately help you achieve 10 reps of consecutive push up in 5 weeks.</p><p>There are lists of exercises that you can try out but if there is one workout that works best, PUSH UP will be it. Push up is a total body workout that works on your entire body from your shoulder, triceps, arms, chest, core and etc. This is the workout that you should strive to do if you are completely new to working out.</p><p>If you are completely new to push up, do not worry as this is what this program is all about. I made this to help you kick-start your very own fitness journey.</p><p><strong>By taking up this program, you will be getting:</strong></p><ul><li>A FREE pdf weekly workout schedule to help you stay on track.<span></span></li><li>Comprehensive workout video guides and video tutorials to help you.</li><li>Week by week program explained and demonstration.</li><li>FREE Burpees Workout Starter Toolkit to kick-start your burpees workout routines right after the program completion worth $27 in value. (Burpees is a total body conditioning workout that works on your entire body- good complement to this program)</li><li>Full support &amp; participation from me to help clear your doubts.</li></ul><p><strong>How is this course structured?</strong></p><p><strong></strong>Unlike other program that dive into push ups immediately, i understand the importance of building up your body strength before diving into the exercise itself. My program is structured in such a way where:<br></p><ol><li>You will first watch through the video guides and tutorials where I will be guiding you from getting the exercise right to preparation that you will need.</li><li>Week 1 &amp; 2 of the program will focus entirely on strength building.</li><li>Week 3 - 5 will be focusing on building up the reps.</li></ol><p><strong>Here's why you should take up this course:</strong></p><ul><li>I was a beginner myself and I know how tough it is. My program is structured to cater to beginners. I personally go from 0 push up to where I am with my own program.</li><li>This program is unlike other program that fail to take into account that most people who took up such program are actually beginners. This program take you through step by step from building up the strength then building up the reps.</li><li>Your journey do not end here. You will be getting a FREE Workout Starter Toolkit worth $27 in value (more than the course value itself) to help you kick-start your own workout routine with Burpees.</li></ul>", 
    "end_date": null, 
    "title": "How to go from 0 Push up to 10 Push up in 5 weeks", 
    "price": "20.00", 
    "instructors": "Fit With Burpees .", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640294_aeee.jpg", 
    "course_url": "https://www.udemy.com/how-to-go-from-0-push-up-to-10-push-up-in-5-weeks/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T12:23:51Z"
}