{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Wow...absolutely extraordinary. Thank you for this in-depth tutorial. </em><em style=\"\"><br style=\"\">  \t     --Jordan S., </em>How to Deadlift<em style=\"\"> student</em>  </p>  <p style=\"\">  \t<strong style=\"\">Are you ready to gain incredible strength and lifelong body resilience through deadlifting? </strong>  </p>  <p style=\"\">  \t    FACT: The deadlift is the most important and <em style=\"\">safest </em>exercise you can perform at the gym. It used to be called the &quot;health lift&quot; due to its incredible total-body benefits.  </p>  <p style=\"\">  \t    This comprehensive course  will teach you everything you need to know about the lift, with 19 lectures, over 60 minutes of video, extensive cues and troubleshooting, and a step-by-step strength training program that will transform your body.  </p>  <p style=\"\">  \t        You will:  </p>  <ul style=\"\">  \t<li style=\"\">Build total-body strength</li>  \t<li style=\"\">Prevent injury</li>  \t<li style=\"\">Improve your quality of life</li>  \t<li style=\"\">Participate in sports at a higher level of athleticism</li>  </ul>  <p style=\"\">  \t     You should join <em style=\"\">How to Deadlift</em> if:  </p>  <ul style=\"\">  </ul>  <ul style=\"\">  \t<li style=\"\">You want to get stronger</li>  \t<li style=\"\">You&#039;re a beginner, just learning to lift</li>  \t<li style=\"\">You&#039;re an intermediate looking to take your strength to the next level</li>  \t<li style=\"\">You&#039;re an athlete looking to gain a competitive edge by being stronger than your opponents</li>  \t<li style=\"\">You&#039;re a personal trainer or fitness professional seeking a tried-and-true method for teaching the deadlift to your clients</li>  </ul>  <p style=\"\">  \t            The deadlift is the test of ultimate total-body strength -- but it isn&#039;t just for brawny meatheads and beefy athletes! <em style=\"\">Everyone</em>, no matter your current state of physical fitness, should be performing this lift regularly.  </p>  <p style=\"\">  \t <em style=\"\">             How to Deadlift </em>is composed of 19 video lectures that break down the lift, piece by piece:  </p>  <p style=\"\">  \t<strong style=\"\">Section 1: Preparation </strong>- Learn the most effective warmup sequences to prepare for deadlifting, including foam rolling, diaphragmatic breathing, and activation drills for the core, glutes, and hamstrings.  </p>  <p style=\"\">  \t<strong style=\"\">Section 2: Setup &amp; Execution </strong>- We&#039;ll deconstruct the exact setup procedure used by the world&#039;s strongest deadlifters and learn how to create total-body tension that prevents injury and allows you to exert your maximum strength potential.  </p>  <p style=\"\">  \t<strong style=\"\">Section 3: Troubleshooting </strong>- Learn how to spot the most common technique mistakes. Includes detailed demos and a series of easy-to-follow corrections.  </p>  <p style=\"\">  \t<strong style=\"\">Section 4: Variations </strong>- Familiarize yourself with 4 common deadlift variations (conventional, kettlebell, hex-bar, and rack) and their respective pros and cons, depending on your individual goals.  </p>  <p style=\"\">  \t<strong style=\"\">Section 5: Training Program </strong>- I&#039;ve outlined a detailed, day-by-day training program that&#039;s simple, thorough, and guaranteed to get you stronger. Includes a downloadable training log to track your progress. You&#039;ll build tremendous strength while avoiding injury and strain.  </p>  <p style=\"\">  \t    As effective as premium one-on-one coaching, <em style=\"\">How to Deadlift</em> outlines a program that will produce months of safe, productive training, <em style=\"\">guaranteed</em> to get you stronger. I have 100% confidence you&#039;ll get huge results from this training method and will experience incredible strength gains. Hope to see you in class.  </p>", 
    "end_date": null, 
    "title": "How to Deadlift: The Ultimate Strength Exercise", 
    "price": "30.00", 
    "instructors": "Marshall Roy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/163776_56b6_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-deadlift/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-13T19:17:38Z"
}