{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul style=\"\">  \t<li>Have you secretly wanted to compete in a Bikini Competition but are unsure of what steps to take to feel sexy, confident and look amazing onstage?</li>  \t<li>Are you a woman who is obsessed with feeling comfortable in her own skin, and would enjoy the challenge of redefining the hot, healthy, and sexy limitations of your beautiful body?</li>  \t<li>Do you feel up for the challenge of trying an experience that will completely blow your mind?</li>  \t<li>Are you ready to bring your sexiest package to the stage in 2015?</li>  </ul>  <p>  \t<em style=\"\">Please note this is a course to help you participate on stage in a Bodybuilding Bikini Competition, this is not a course for a Bikini Competition that is done at a bar.</em>  </p>  <p>  \t<em style=\"\">Sexiness is earned, not given. This course is meant for women who are willing to work for everything that they get - rep by rep. </em>  </p>  <p>  \t                                    The sexiest part of a Bikini Competition is the prep. If done correctly the prep will not only sculpt your body but you will become addicted to not only the process, but the strong, beautiful and confident woman that you will become.  </p>  <p>  \t                                  When you stand on stage your greatest competition is not the other women that are standing next to you on stage.<strong style=\"\"> Your greatest competition is the woman that you are now, compared to the woman that you have the potential to become.  </strong>  </p>  <p>  \t                                  I have been a personal trainer for the past 7 years and nothing has challenged me fitness wise in terms of how far I could take my body then when I became a bikini competitor for the first time.  </p>  <p>  \t<strong style=\"\">          But at the same time, I made a lot of mistakes...mistakes that I want to save others from the embarrassment of making.  </strong>  </p>  <p>  \t                            There is information that I found out from competing that is not found on YouTube, Google, or a &quot;bikini prep ebook.&quot; I spoke with different competitors, did my research, and drew from my background in Exercise Science and personal trainer certification but there were a bunch of small details that I never found out about until the last minute.  </p>  <p>  \t  Learning from my mistakes will help to save you from the embarrassment that I faced and I will show you how to make your bikini prep fun, sexy, challenging, and rewarding.  </p>  <p>  \t                            This course is that guide that I wish I had in the beginning. The information inside this course will not only save you from starvation diets but it will also save you time and money along the way.  </p>  <p>  \t                          In this course you will learn...  </p>  <ul style=\"\">  \t<li>How to Feel Confident and Look Sexy Onstage. </li>  \t<li>How to Cover up your Stretch Marks for Your Competition ( the one part of bikini prep that doesn&#039;t take any work).</li>  \t<li>The Top 10 Bootylicious Exercises to Shape your Booty.</li>  \t<li>How to get a Smooth &amp; Sexy Bikini Line.</li>  \t<li>Fake Boobs vs. Real Boobs: The best trick for making your real &quot;girls&quot; look even perkier than fake ones.   </li>  \t<li>Reveal the Truth about &quot;Peak Week.&quot;</li>  \t<li>The best exercise to do right before going on stage (trust me, your booty will look fabulous after doing this for only 5 minutes or less!)</li>  </ul>  <p>  \t              To show you my love and faith <em style=\"\">I&#039;m offering you a 30 day, 100% unconditional guarantee. </em>If for any reason within 30 days of taking this course it is not what you are looking for then I will give you a full refund, no questions asked.  </p>  <p>  \t              This 14 section and 37 lectures and counting course holds all the questions, tips, and tricks that every Bikini Competitor should know, and is the ultimate guide to sculpting a rock hard body while enjoying the ride.  </p>  <p>  \t              Can&#039;t take any more excitement Gorgeous?  </p>  <p>  \t                Click the &quot;take course button&quot; above and get ready for one sexy little ride!  </p>  <p>  \t            xoxo,  </p>  <p>  \t            Jasmyne Teoma  </p>  <p>  \t                P.S. You are already beautiful, now you are just becoming, healthier, fitter, and even sexier.  </p>", 
    "end_date": null, 
    "title": "How to Prepare for Your First Bikini Competition ", 
    "price": "20.00", 
    "instructors": "Jasmyne Teoma", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339326_0f54_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-prepare-for-your-first-bikini-competition/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T16:32:00Z"
}