{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    Do you want to take the challenge and see how it will work wonders for you and change the way you live your life for the better?  </p>  <p>  \t<p>  \t\t   If you are someone who’s looking to shed off some excess fat or someone dreaming of attaining that enviable toned body then this course is just perfect for you! This instructional guide is also fitting for those people who want to maintain a healthy lifestyle and gain control over their energy levels.  \t</p>  \t<p>  \t\t<p>  \t\t\t    Look no further -- may you be a health newbie or an old-timer health buff that can’t get enough of all the ways, means and methods available out there to get fit and healthy, we’re here to assist and guide you and make this course as easy as 1-2-3! No need to be intimidated! Don’t let money or time hold you back from attaining your dream body shape! You’ll soon find that your body’s well-being is an investment which you must take seriously.  \t\t</p>  \t\t<p>  \t\t\t Our exciting program/course includes the following:  ·  \t\t</p>  \t\t<p>  \t\t\t Nutrition guides – this will help you control the calories intake and regulate the right amount of protein, fats, good cholesterol, vitamins and minerals to boost your energy and ensure proper nutrition based on your lifestyle and body-built  ·  \t\t</p>  \t\t<p>  \t\t\tRecipes – healthy food does not necessarily equate to bland and uninteresting stuff. We made sure that you will get all the nutrition you need in a balanced diet while eating scrumptious and mouthwatering dishes with a wide array of choices from our healthy recipes  ·  \t\t</p>  \t\t<p>  \t\t\tInstructional videos – step-by-step guidelines and know-hows that will keep you on track during this healthy course  ·  \t\t</p>  \t\t<p>  \t\t\tWorkout videos – healthy living does not mean nutritious food alone; you also need to keep moving and burn out the unwanted fats to achieve your desired, well-sculpted body.  ·  \t\t</p>  \t\t<p>  \t\t\tWorkout manuals – every groovy body-shaping, muscle-toning workout comes with easy-to-understand manuals that will guide you every step of the way  \t\t</p>  \t\t<p>  \t\t\t What’s even great is that you can take control of your time and do your workout whenever you can, wherever! Starting out is easy. If you are eager to experience fast results that is noticeable in short amount of time, devote at least 20 minutes a few times per week to see and feel the difference in your body and health.  \t\t</p>  \t\t<p>  \t\t\t You can tweak your workout based on your needs to achieve your desired results. And do remember – this program is only as effective as the amount of effort and commitment you put in it. But worry not for  I, your online personal trainer, assure you that it s also my commitment to push you to succeed in this course.  \t\t</p>  \t\t<p>  \t\t\t Basically, you’ll start with the manuals and readings to get you familiarize with this course, then you need to take it a notch up by moving forward to the instructional videos and then finally the work-out. You need to complete the Workout 1&amp;2 back-to-back session, 3x per week. But since this course is tailor-fit for everybody’s needs, we can customize your program to suit you best.  \t\t</p>  \t\t<p>  \t\t\t You are the one in charge to take things slow or fast depending on your commitment to yourself. To ensure that you will have a variety of courses to choose from, we take it upon ourselves to update your options so that you will feel motivated and interested all the time.  \t\t</p>  \t\t<p>  \t\t\t So what are you waiting for? Take control of your life and take part in this exciting course that will definitely lead you on to a healthy lifestyle! Make a smart choice by joining us, and your body will definitely thank you afterwards!  \t\t</p>", 
    "end_date": null, 
    "title": "How I gain explosive power and strength using kettlebells", 
    "price": "20.00", 
    "instructors": "Fred Owen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241242_868b_2.jpg", 
    "course_url": "https://www.udemy.com/learn-the-kettlebell-to-build-muscle/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-11T09:12:23Z"
}