{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled 'Hypnosis- Reduce Abdomen And Hips Using Self Hypnosis' By Pradeep Aggarwal , you will learn -</p><p>Many women face the problem of weight gain around their abdomen and hips. Weight gain around abdomen and hips can be very difficult to lose. There may be many reasons for weight gain around abdomen and hips, whatever reason may be, self hypnosis can help your program your subconscious mind to reduce the excess weight. Sometimes frustration to lose weight could be an underlying factor for weight gain. Stress, frustration, anxiousness and impatience to lose weight are emotional conditions. Emotions can be successfully handled with self hypnosis.</p><p>Learn about conscious mind and subconscious mind and how we can program our subconscious mind for better health conditions and changing habits. Also get a detailed insight into self hypnosis. There are lots of myths attached to self hypnosis, let go of all the myths you may have about self hypnosis. Self hypnosis is natural, safe and effective method to treat many of the physical and health problems.<br></p><p><strong>Some Useful Tips and Closing:</strong><strong></strong></p><ul><li>Eat lots of nutritious and healthy foods.</li> <li>Include physical activities in your daily routine.</li> <li>Manage your stress and anxiety.</li> <li>Take enough rest and sufficient sleep.</li> <li>Control your intake of alcohol and caffeine.</li> <li>Practice meditation, relaxation and self hypnosis.</li><li><br></li><li>You will be able to reduce weight around the abdomen and hips and feel more happy , confident and energetic using powerful self hypnosis exercises and affirmations.</li></ul><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English including a bonus E-book</p>", 
    "end_date": null, 
    "title": "Hypnosis- Reduce Abdomen And Hips Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607724_bab0.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-reduce-abdomen-and-hips-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T07:21:42Z"
}