{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p></p><p>Do you cringe when you stand in front of a  full-length mirror? Do you yearn for an earlier time when you felt more fit and  healthy? Whether you’re getting older, had a baby, or are recovering from an  illness or injury, your body may no longer look or perform the way you’d like.  This fun, instructive seminar offers tips and techniques to get back in shape,  improve your nutrition, achieve mind-body-spirit balance, and maintain a  positive attitude to look and feel better than you ever have before.</p><p></p><p><strong style=\"\">Featuring:</strong></p><p></p><p></p><ul style=\"\"><li><span>Kerry Corcoran, clinical nurse specialist and owner of The Dailey Method  exercise studio in Berkeley, California, offers simple, effective strategies to  get back in shape, have a healthy (but still tasty) diet, and heal your  injuries.</span><br style=\"\"></li><li><span>Kurt Petersen, 10-year fitness aficionado, shares how to maintain  discipline and a positive mind set to achieve both your health and life goals.</span><br style=\"\"></li><li><span>Laurie puts on her hat as a master wellness  practitioner and former personal trainer, teaching about mind-body-spirit  connection and how to make fitness fun.</span><br style=\"\"></li></ul><p></p><p><strong style=\"\">NOTE:&nbsp;</strong>This seminar is the 4th of 6 in Laurie Gardner&#039;s Courageous U series, &quot;Big Shell or Bust: Making and Managing Change.&quot;&nbsp;Enroll in each seminar separately or enjoy the whole series.&nbsp;</p><p>Also note that this seminar was originally offered as a live teleseminar. Udemy participants who have questions should type them on Udemy rather than following the instructions for phone Q &amp; A.</p><p></p><p><strong style=\"\">What people are saying about &quot;I Want My Body  Back!&quot;:</strong></p><p></p><p></p><em style=\"\">“There is a glut of health and fitness advice out there; it is hard to sort through it   all and find and maintain a routine that works for me. This seminar hit   the nail on the head. Thank you, Laurie!” - Jack L., San Francisco</em><p><em style=\"\"></em></p><p><em style=\"\"><em style=\"\">&quot;Laurie’s seminar is really helping me refocus on what is important to me and to start getting rid of all of my distractions and excuses. Thank you!”&nbsp; - Scott H., Portland, ME</em></em></p><p></p><p></p>  ", 
    "end_date": null, 
    "title": "I Want My Body Back!", 
    "price": 0, 
    "instructors": "Laurie Gardner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40540_fac1_12.jpg", 
    "course_url": "https://www.udemy.com/i-want-my-body-back/", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-07T18:34:24Z"
}