{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p></p><p>Do you want to become more fit, more flexible and more relaxed? </p><p>This complete 10-week Tai Chi for beginners course taught by Rami Rones will teach you in a  <strong>simple, step-by-step proven method</strong>  an important Tai Chi form.&nbsp; You will go  much deeper than just learning the Tai Chi form.&nbsp; You will learn various stretches and  movements to become more flexible and stronger.&nbsp;  In addition, you will learn the power of deep breathing and meditation  and will become more relaxed, lowering any stress you may have.</p><p><strong>Rami has synthesized  over 30 years of Tai Chi and mind-body teaching and practice</strong> to create this Tai Chi for Beginners course. You will  experience the same teaching he has done with the thousands of elite athletes,  adults, teenagers, “weekend warriors”, martial artists and others to become  more successful and confident.</p><p>He has designed a number of medical clinical trials such as the  investigation of the <strong>benefits of Tai Chi  and Fibromyalgia</strong>, T<strong>ai Chi and Knee  Osteoarthritis.</strong>&nbsp; Much of his  research design is also included in this course.&nbsp; His Fibromyalgia and Tai Chi study was <strong>published in the New England Journal of  Medicine</strong> and featured in <strong>the New  York Times</strong>.</p><p>You will also benefit from his extensive teaching at the <strong>internationally recognized Dana-Farber  Cancer Institute, Tufts Medical Center and the Boston Medical Center</strong> where  he continues to help patients deal with, and recover from, a wide variety of  ailments and and the side effects that often occur with various treatments. </p><p>Rami’s incredible knowledge, teaching ability and engaging personality  makes this Tai Chi for Beginners course a joy for anyone interested in improving their  physical and mental well-being.</p><p>                        </p><p>By investing 10-20 minutes a day over a 10 week period, you will learn Tai Chi, its basic  concepts  and you will become stronger, more flexible and much more relaxed.</p><p></p>  ", 
    "end_date": null, 
    "title": "Improve Your Physical and Mental Success with Tai Chi", 
    "price": "25.00", 
    "instructors": "Ramel Rones", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21256_ef8e_6.jpg", 
    "course_url": "https://www.udemy.com/improve-your-physical-and-mental-success-with-tai-chi/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-16T16:11:03Z"
}