{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>*****UPDATED MAY 5, 2015*****</strong></p><p><strong>If you go to the gym four times a week for an hour each time then you are being physically active for roughly 2.4% of that week.</strong></p>  <p>  \t                                    So it's safe to say that in order to see any significant results we must strive to give 100% of ourselves WITHIN those 2.4%. But performing at 100% all the time is impossible. So what do you do?  </p>  <p>  \t                                    Should you focus in just working out harder? No, you should focus in training smarter.  </p>  <p>  \t                                    This course is about giving you a better way to workout.  </p>  <p>  \t<strong>But first let me ask you a few questions.</strong>  </p>  <p>  \t                                    Do you ever get stuck trying to figure what workouts to do and how to put them together?  </p>  <p>  \t                                                    Do you have a limited amount of time that you must dedicate to training?  </p>  <p>  \t                                                    Are you fed up doing the same cardio workouts over and over again?  </p>  <p>  \t                                                    Does your current routine need an overhaul?  </p>  <p>  \t                                                    The sole purpose of this course is to teach you an effective, purposeful and organized way to approach your strength and fat loss goals. <strong>And to save you time, lots of it</strong>.  </p>  <p>  \t<strong>Why should you learn to use kettlebells? Why should you incorporate bodyweight training into your workout routines?</strong>  </p>  <p>  \t                                                    There are tons of ways to get fit but successful training should meet a couple of criteria:  </p>  <ul>  \t<li>It should be somewhat enjoyable. </li>  \t<li>It shouldn't be too long where you might get bored or even dread the idea of even starting.</li>  \t<li>They must be challenging.</li>  \t<li>It should be purposeful. Failing to plan is planning to fail.</li>  </ul>  <p>  \t                                                    This course blends all these attributes together.  </p>  <p>  \t<strong>Redefining cardio.</strong>  </p>  <p>  \t                                                    A complete exercise regimen should address not only resistance training but cardiovascular training as well. Approaching your fitness this way is essential to your training success.  </p>  <p>  \t                                                    Incorporating bodyweight training and kettlebells into your routine allows you to bring cardio and strength training into the same session.  </p>  <p>  \t                                                    You think running or cycling is the ONLY way to enhance your cardio respiratory fitness?  </p>  <p>  \t                                                    Think again, cardio fitness is described as the ability of the circulatory and respiratory systems to supply oxygen to skeletal muscles during sustained physical activity.  </p>  <p>  \t                                                    Keyword in the prior sentence is <strong>SUSTAINED</strong>.  </p>  <p>  \t                                                    In this course you will do your workouts in circuits, moving from exercise to exercise. But not just ANY exercise.  </p>  <p>  \t                                                    Not ONE exercise in this course <em>isolates only one muscle</em>.  </p>  <p>  \t                                                    Performing total body movements is essential for optimal fat burning.  </p>  <p>  \t                                                    Sitting from machine to machine is not going to make your burn fat efficiently.  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>Experience a complete body transformation.</strong>  </p>  <p>  \t                                                    Yes, the movements in this course will increase fat loss.  </p>  <p>  \t                                                    Yes, the movements in this course will help you get stronger.  </p>  <p>  \t                                                    But….  </p>  <p>  \t<strong>                You will also work on flexibility, posture, range of motion, mobility, stability and even power by using total body movements that require awareness, skill and control.</strong>  </p>  <p>  \t                                                    Working on these other aspects of training improves our day to day activities.  </p>  <p>  \t                                                    Having great abs is a pretty a cool achievement. But having great abs with a weak back sucks.  </p>  <p>  \t                                                    There's so much more to core training than just doing crunches. In this course you will practice movements that will work on your core while working on other important aspects like stability and mobility.  </p>  <p>  \t                                                    The Turkish Get Up (TGU) is an example of this.  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>Keep burning calories AFTER your training sessions are over.</strong>  </p>  <p>  \t                                                    Burning calories during your workout is only one part of your training. More importantly is how can we continue to burn calories AFTER our training sessions?  </p>  <p>  \t                                                    The way to do this is to approach your training with workouts that elicit high levels of EPOC (Excess Post Oxygen Consumption). EPOC is a state where our body is in an oxygen deficit. The only way to achieve this is by increasing the intensity of the workout.  </p>  <p>  \t                                                    During this state, our oxygen consumption is elevated and our bodies go through different metabolic processes to bring it back to it's normal state. This causes our bodies to burn tons of calories.  </p>  <p>  \t                                                  Kettlebell swings for example, are a  popular movement that is often integrated into circuits that produce high levels of EPOC.  </p>  <p>  \t<strong>Learn to warm up properly.</strong>  </p>  <p>  \t                  We were once told to stretch before engaging in physical activity. People still do this. Stretching before working out inhibits power production. It can reduce performance up to 5% according to the the Journal of Strength and Conditioning Research.  </p>  <p>  \t                  In this course I show you the right way to warm up. And you can use this warm up for other physical activities as well.  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>Sitting is the new smoking.</strong>  </p>  <p>  \t                                        So let's say you already go to the gym. But most of your routine (without you being really aware of it) requires you to sit down to either push, pull or crunch.  </p>  <p>  \t                                        We spend time sitting, commuting in our cars, bound to our work desk, slouched over our keyboards and yet we go to the gym and most of our training is sitting.  </p>  <p>  \t                                        In a 2012 study published in the International Journal of Behavioral Nutrition and Physical Activity, researchers reported that people spent an average of 64 hours a week sitting and 28 hours standing!  </p>  <p>  \t                                        Sixty four hours a week!  </p>  <p>  \t                                        We were designed to move and this course gives you just that.  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>Here are some of the workout templates that will be included in your 34 page full colored guide.</strong>  </p>  <ul>  \t<li>Time Based Workouts</li>  \t<li>Circuit Style Training</li>  \t<li>DIY (Do It Yourself) templates where you incorporate exercises from this course.</li>  \t<li>Core Based programs that will ignite your midsection.</li>  \t<li>Lower Body focused programs</li>  \t<li>Six Weeks Strength and Conditioning programs</li>  \t<li>Enjoy workouts to increase weight loss, improve oxygen utilization and improve metabolism. </li>  \t<li>And much more..</li>  </ul>  <p>  \t<strong>DOWNLOADS ARE ENABLED FOR THIS COURSE.</strong>  </p>  <ul>  \t<li>Some of the exercises in this course are unique to kettlebell training.</li>  \t<li>Crunches are so 1990, train not JUST your abs but your entire core.</li>  \t<li>Enjoy already done for you programs. <em>More programs will be added throughout the year.</em></li>  </ul>  <p>  \t<strong>ENJOY THE ACCESSIBILITY OF CLOSED CAPTIONS ON EVERY SINGLE VIDEO.</strong>  </p>  <p>  \t                                    If you don't absolutely enjoy my course then get your money back with a <strong>30 day money back guarantee</strong>. NO questions asked.  </p>", 
    "end_date": null, 
    "title": "Intro to Kettlebells & Bodyweight Training", 
    "price": "25.00", 
    "instructors": "Juan Lugo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325256_b541_2.jpg", 
    "course_url": "https://www.udemy.com/burn-fat-get-fit-with-kettlebells-bodyweight-training-by-juan-lugo/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T21:35:34Z"
}