{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">The key to getting lean and cut requires smart training, having a plan and being consistent. </p><p style=\"\">I've taken the same approach I use with my female clients and placed it in this course.</p><p style=\"\">The whole purpose of this program is to make your life easier and to give you  structure on how to approach your strength training. I'm going to give you a little secret:</p><p style=\"\"><strong>THE QUICKER YOU REALIZE THAT STRENGTH TRAINING<em> IS THE MOST EFFECTIVE </em>WAY TO APPROACH FAT LOSS, THE QUICKER YOU WILL GET THE RESULTS YOU ARE AFTER.</strong></p><p style=\"\">Every exercise in this course has a purpose, there's no fluff here. You're NOT going to see me prescribe an exercise where you stand single leg as you do bicep curls on top of a Bosu. </p><p style=\"\">You will not BULK UP with the exercises and the formats I will prescribe in this course. </p><p style=\"\"><strong>When you lift weights, blood TEMPORARILY flows into muscles and pumps them up. You see that in a gym mirror. It makes you think that you are bigger than you actually are. It is truly psychological.</strong></p><p style=\"\"><strong></strong><strong>Get 5 workout programs to help you BURN FAT, GET LEAN and BOOST YOUR METABOLISM for sustainable fat loss.</strong></p><ul><li><strong>\"The Bridal Workout\"</strong></li><li><strong>\"The Butt Kicker\"</strong></li><li><strong>\"The Alpha Female\"</strong></li><li><strong>\"The Spartan Woman\"</strong></li><li><strong>\"Done in 26\"</strong></li></ul><p>Most of the workouts laid out in this course are total body workouts. Why total body? The more muscles you use in one session, the better hormonal response you will elicit post workout. Hormones that are responsible for muscle growth and fat loss. Targeting one muscle or muscle group at a time isn't as efficient as training your whole body as a whole. You will burn more calories this way and you will make better use of your time.<br></p><p>Having more muscle mass on your body will accelerate your metabolic rate. <strong>Meaning you will burn more calories at rest by simply having more muscle! </strong></p><p style=\"\">Talking about time, some of these workouts in this course are no longer than 30 minutes, not including your warm ups. You don't have to train for two hours. More is not better. Quality is what we are aiming for, not quantity. If you go to the gym and you don't have a plan and you are winging it then of course you might take longer. But not when you have a system laid out for you.</p><p style=\"\">You are NOT going to use machines in this course. You are going to use dumbbells, kettlebells (if you have access to them), a swiss ball and a mat.</p><p style=\"\"><strong>CAN YOU LOSE FAT BY JUST EATING RIGHT? SURE YOU CAN. I'VE SEEN THIS HAPPENS TONS OF TIMES. BUT YOU ARE NOT GOING TO <em>MOLD</em> YOUR BODY. </strong></p><p style=\"\">You want:</p><ul><li>Sexy legs</li><li>Firm butt</li><li>Thin waste</li><li>Lean arms</li></ul><p>You are not going to get that from JUST running or JUST doing dance or by JUST taking a barre class. These training modalities can help, yes of course. I have nothing against this forms of training and I believe it is extremely important to participate in something that you enjoy. But tackling your fitness goals by <u>prioritizing</u> strength training FIRST can help you get the body you are looking for a lot quicker.</p><p>Through out the course I go over correct form, common training mistakes, different variations of exercises, proper warm ups and even how to use a kettlebell correctly.</p><p>The weight you choose should require some effort to move. You don't have to go super heavy, but don't pick up <em>light weight</em> either. Get comfortable with the idea that you will have to get uncomfortable picking up heavier weight to see change in your body, true change.</p><p>I am excited to share my experience and knowledge with you, enroll in my course today and start training smart.</p><p><br></p>", 
    "end_date": null, 
    "title": "Lean & Cut for Women", 
    "price": "25.00", 
    "instructors": "Juan Lugo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546972_910a.jpg", 
    "course_url": "https://www.udemy.com/beginner-workouts-for-women/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T17:48:42Z"
}