{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  ****$15 FOR A LIMITED TIME ONLY!****  </p>  <p style=\"\">  \t              There is no need to suffer from chronic aches and pains.  </p>  <p style=\"\">  \t           And simply taking time off isn&#039;t enough to get rid of the pain.  </p>  <p style=\"\">  \t           While rest is important, self massage or foam rolling is another important part of recovery.  </p>  <p style=\"\">  \t          Any good workout program should start with foam rolling because it inhibits the tight muscles and gets them to relax so you can stretch them.  </p>  <p style=\"\">  \t          Self-myofascial release or foam rolling allows you to relax muscles, reduce pain and restore muscles to their normal length-tension relationships and function.  </p>  <p style=\"\">  \t          Self-myofascial release (SMR) does this by “autogenic inhibition.” Basically what that means is that the pressure you apply with your hands or a foam rolling tool (roller, ball or such) on the tight muscle forces the muscle’s own receptors to relax it.  </p>  <p style=\"\">  \t         Not sure you need to include foam rolling in your routine? Check out these benefits:  </p>  <ul style=\"\">  \t<li style=\"\">Corrects muscle imbalances by loosening tight muscles to restore a proper length-tension relationship</li>  \t<li style=\"\">Improves joint range of motion because no muscles are tight and causing restriction</li>  \t<li style=\"\">Relieves muscle soreness and joint stress</li>  \t<li style=\"\">Increases extensibility of musculotendinous junction, giving you more flexibility and a full range of motion</li>  \t<li style=\"\">Improves neuromuscular efficiency aka a better mind-body connection so that you can recruit the correct muscles</li>  \t<li style=\"\">Maintains normal functional muscular length, muscles are at their proper length and not tight or short</li>  </ul>  <p style=\"\">  \t         The basic guidelines to foam rolling are – find areas of tightness and hold on those areas until pain lessens a bit and use the smallest hardest tool you can to dig out those areas.  </p>  <p style=\"\">  \t         In this course, you will learn techniques to roll out from head to toe. You will learn how to use different SMR tools so that no matter what you have on hand, you can always roll out and loosen up. We will also teach you which tools are best to use to reach certain areas of tightness.  </p>  <p style=\"\">  \t         After this course, you will be able to start alleviating those minor aches and pains!  </p>", 
    "end_date": null, 
    "title": "Learn How to Foam Roll to Prevent and Alleviate Injury", 
    "price": "20.00", 
    "instructors": "Cori Lefkowith", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/213982_c4c7_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-foam-roll-to-prevent-and-alleviate-injury/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-09T16:30:14Z"
}