{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong style=\"\">Course Description</strong></p><p>*learn how to stop sabotaging these areas:</p><p>- health and weight</p><p>- relationships</p><p>- your job and success </p><p><strong style=\"\">Note:</strong> health, fitness, and an improved life does not start in the gym. It starts with your heart-programming. Weight loss is an inevitable benefit of this course, yet the focus is bigger than just weight loss. You are going to get much more. Weight loss and a sexier body is the easy part.</p><p>*Get a Free Copy of the book Breaking Normal before normal breaks you</p><p></p><p><strong style=\"\">*Do You Suffer From...</strong></p><p>- losing weight only to have it come right back?</p><p>- wrecking relationships before they get too serious?</p><p>- constantly finding abusive relationships?</p><p>- depression or sadness?</p><p>- constantly being irritable?</p><p>- chronic anxiety or fear?</p><p>- wanting the next level but never feeling able to get there?</p><p>- feeling insecure in how you look?</p><p>- wanting to meet new people but feeling to scared to introduce yourself?</p><p>- single and want to change that?</p><p>*If you are suffering from any or all of these symptoms, you are most likely experiencing the results of poor heart-programming.</p><p>You may be thinking that<strong style=\"\"> how you see yourself isn&#039;t that big of an issue</strong>...but it&#039;s <strong style=\"\">more than just an issue, it&#039;s your entire life</strong>.</p><p>POOR HEART-PROGRAMS CAN PUT YOU AT A SIGNIFICANTLY GREATER RISK FOR...</p><p>- increased <strong style=\"\">body fat</strong></p><p>- <strong style=\"\">stress</strong> induced diseases</p><p>-<strong style=\"\"> insomnia</strong></p><p>- <strong style=\"\">insecurity</strong></p><p>- social <strong style=\"\">phobias</strong></p><p>-<strong style=\"\"> romantic</strong> loss</p><p>- relational <strong style=\"\">loss</strong></p><p>- <strong style=\"\">financial loss</strong></p><p>- and much more</p><p>***don&#039;t let poor heart programming wreck your quality of life and end your life sooner. Poor heart programming is a common condition that is easily corrected, takes very little effort and time, and anyone can do it.</p><p><strong style=\"\">***note: </strong>it doesn&#039;t matter how old you are, what your previous experiences have been, or where you currently are in life. You can begin right now where you are to begin positive healthy transformation.</p><p><strong style=\"\">About this course</strong></p><p>- Over 50 videos of high quality information</p><p>- No previous experience required to benefit from the teachings</p><p>- Full lifetime access</p><p>- Massive discounts on future courses</p><p>- Free copy of the book Breaking Normal before normal breaks you</p><p>By enrolling in this course, you can start transforming every area of your life with techniques you can apply<strong style=\"\"> right now!</strong></p><p>Here are just a few of the many benefits to reprogramming your heart to a positive program...</p><p>- <strong style=\"\">Increase energy</strong> levels as you start making healthy dietary changes</p><p>- <strong style=\"\">Elevate confidence</strong> as you identify who you REALLY are and what you&#039;re capable of</p><p>- <strong style=\"\">Sleep better</strong> knowing you&#039;re living life to the fullest</p><p>- Make <strong style=\"\">more money</strong> as your elevated confidence empowers you to step out</p><p>- Have <strong style=\"\">better sex...</strong>nuff said</p><p>- <strong style=\"\">Be with the one you want to be with</strong> as you become the person you want to be</p><p>- <strong style=\"\">Improve </strong>relationships</p><p>- <strong style=\"\">Lose weight </strong>and keep it off</p><p>- Build muscle</p><p>- Live longer</p><p>- <strong style=\"\">Stop the cycle of self sabotage</strong></p><p>- <strong style=\"\">Enjoy life</strong> for once</p><p><strong style=\"\">In this course you are going to learn...</strong></p><p><strong style=\"\">- how to identify what is causing you stress</strong></p><p><strong style=\"\">- how to replace that stress with confidence and peace</strong></p><p><strong style=\"\">- how to identify limiting beliefs</strong></p><p><strong style=\"\">- how to recognize the internal &quot;voices&quot; and which ones you should trust</strong></p><p><strong style=\"\">- exactly why you&#039;ve been wrecking relationships</strong></p><p><strong style=\"\">- why you haven&#039;t gotten the promotion at work</strong></p><p><strong style=\"\">- how to get what you want</strong></p><p><strong style=\"\">- how to stop the &quot;yoyo effect&quot; of weight loss</strong></p><p><strong style=\"\">- how to get the best relationship ever</strong></p><p><strong style=\"\">- and plenty more</strong></p><p>Don&#039;t let something like poor heart programming ruin your quality of life and end your life earlier.</p><p>Heart Programs affect <strong style=\"\">every area of life. They determine how much money you make, who you marry, how long you stay married, what your body looks like, even what kinds of vacations you go on IF YOU EVEN GO ON ANY.</strong></p><p><strong style=\"\">For example:</strong></p><p><strong style=\"\">I was a relationship saboteur. </strong>Maybe you can relate. I was in a 2 year relationship that ended up being the worst two years of my life, and <strong style=\"\">NOT because of her.</strong></p><p>Ever since I was sixteen I would date a girl and the first 30 days would be fine. On the 31st day, I would then swell up with anxiety and stress and would start &quot;hearing voices&quot; like;</p><p>- you&#039;re <strong style=\"\">making a mistake</strong></p><p>- you&#039;re going to <strong style=\"\">marry the wrong girl</strong></p><p>- she&#039;s<strong style=\"\"> too good for you</strong></p><p>-<strong style=\"\"> you&#039;re not good enough</strong> for her</p><p>- you&#039;re a <strong style=\"\">loser</strong></p><p>- maybe <strong style=\"\">when you look better</strong></p><p>- maybe<strong style=\"\"> if you lost some weight</strong></p><p>- she&#039;s <strong style=\"\">not interested</strong></p><p>- and many more</p><p>have you<strong style=\"\"> ever said any of these to yourself at any time?</strong></p><p>Thinking these &quot;voices&quot; were true, I would break up with the girl. <strong style=\"\">Not feeling any better</strong>, I would regret it and come back to her.</p><p>If she took me back, the cycle would repeat and <strong style=\"\">THIS HAPPENED FOR 10 YEARS!!!</strong></p><p>During that time I was a successful personal trainer, award winning amateur body builder, and I had a very large circle of friends and social achievements. Yet these accomplishments did not solve the struggles within me. It was when I discovered what heart-programs are and how they work is when dramatic transformation took place in my life. <strong style=\"\">IT IS BECAUSE NOTHING YOU DO EXTERNALLY WILL FIX YOUR PROBLEMS HAPPENING INTERNALLY.</strong> Heart-programs must be changed from within. Heart-programs will express themselves through you, whether they are helping you or hurting you. It is your responsibility to determine what they say.</p><p></p><p>What do all these have in common?</p><p>- being <strong style=\"\">overweight</strong></p><p>- <strong style=\"\">can&#039;t</strong> find a date</p><p>- consistently dating <strong style=\"\">the wrong person</strong></p><p>- <strong style=\"\">never offered </strong>a promotion at work</p><p>- dreams never fulfilled</p><p>- <strong style=\"\">struggles</strong> in relationships</p><p>- chronic <strong style=\"\">fear</strong></p><p>- chronic <strong style=\"\">boredom</strong></p><p><strong style=\"\">The answer is: heart programs.</strong> The poor heart-programs you have might not be your fault, but they are your responsibility now. You have to trust me and all the other top gurus of self improvement in the world when I say the only person in this world that can fix your problems is YOU. If you are continually seeking for someone else to make everything better, you&#039;re going to be waiting a long time and this course is not for you. But this is the good news! Because that means <strong style=\"\">you can start transformation now. You can learn how to program your heart with the programs you actually want!</strong></p><p><strong style=\"\">Here&#039;s what I&#039;m not saying</strong></p><p>- that you can&#039;t do it on your own</p><p>- that you&#039;re going to do it all on your own</p><p>- that I&#039;m not going to help you</p><p>- that others can&#039;t help you</p><p><strong style=\"\">Here&#039;s what I am saying</strong></p><p>- you are able now</p><p>- you are ready now</p><p>- you have what it takes now</p><p>- you are a creative being that can customize your own life NOW</p><p>As someone whose learned the hard way, I can show you how to get there and <strong style=\"\">how it works, quicker than what it took me </strong>to find the way.</p><p>By the end of this course you will have a <strong style=\"\">higher self confidence,</strong> your <strong style=\"\">body fat percentage will be down</strong>, you&#039;ll <strong style=\"\">feel better about yourself</strong>, you&#039;ll possess a <strong style=\"\">higher sense of courage</strong>, and if you&#039;re zealous enough you <strong style=\"\">might even have a date with that cute person you&#039;ve always wanted to talk too!</strong></p><p>You might be saying, &quot;how can this one course affect my weight, relationships, AND finances?&quot; Let me explain, this is not a course about weight, relationships, and finances. <strong style=\"\">It&#039;s about YOU, and YOU are the common denominator in every area of your life. If YOU improve, your life improves with it.</strong> All these <strong style=\"\">areas of your life WILL IMPROVE DRAMATICALLY because success</strong></p><p><strong style=\"\">is based on certain principles, and the principles I will be sharing with you work every time.</strong></p><p><strong style=\"\">*Get These Added Bonuses When you Sign up Today</strong></p><p>- My book Breaking Normal before normal breaks you E-book</p><p>- Fundamentals of Creating a Workout Plan Template</p><p>- Eating Strategy for Losing Weight and Staying Thin</p><p>- Eating Strategy Menu</p><p><strong style=\"\">One note in closing...</strong></p><p>*As a personal trainer, I can help you lose weight.</p><p>As a leadership coach, I can help you become more productive.</p><p>But as a personal trainer and leadership coach, I can&#039;t force you to apply any of the secrets I&#039;ll be sharing. Only you can apply what you learn and THAT is where transformation comes from. Not in the gaining of facts, but in the application of them. Every minute you hesitate to start re-programming for success, you are stepping further, and further away from the body, relationships, and life you deserve. <strong style=\"\">The body and life you&#039;ve always wanted</strong>. The reality is, <strong style=\"\">you are much closer now than you even know.</strong></p><p><strong style=\"\">There is a better way to lose weight and gain success </strong>than what you&#039;ve seen on the infomercials and in magazines. If you are looking at this course right now, <strong style=\"\">you know something needs to change in your life.</strong></p><p><strong style=\"\">*Please, don&#039;t put your health off any longer. Start to lose weight and improve life now, and potentially change everything forever...</strong></p><p>This course is going to give you everything that you need to <strong style=\"\">lose weight, improve results, and keep it all FOR LIFE.</strong></p><p><strong style=\"\">Think about this:</strong> For the price of this course you would ONLY be able to <strong style=\"\">afford 2 coaching sessions with me</strong>, and then they would be gone. *<strong style=\"\">That doesn&#039;t include the hundreds </strong><strong style=\"\">of dollars you would spend</strong> on my eating strategies, exercise plans, or fitness consultations.</p><p>Remember that this is a risk free way to make that change. If you aren&#039;t happy in 30 days, <strong style=\"\">you have a 100% Money Back Guarantee.</strong></p><p>Click <strong style=\"\">&quot;take this course&quot; </strong>and<strong style=\"\"> lose weight while building the body of your dreams now.</strong></p><p>I can&#039;t wait to see and hear about your results.</p><p>Your friend;</p><p>-Brian James</p>", 
    "end_date": null, 
    "title": "Limitless Health Using the Power of Your Subconscious Mind", 
    "price": "20.00", 
    "instructors": "Brian James, Body Builder, Gym Owner Ty Quinn, Actress, Model, Futurist Alyssa Wyspianski", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539030_412e_8.jpg", 
    "course_url": "https://www.udemy.com/breakingnormal/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T03:38:44Z"
}