{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Do you want to finally get rid of the excess body fat you&#039;ve been carrying around? Do you want to look sexier and FEEL better every day?</p><p style=\"\">In this course you&#039;ll learn how to lose body fat and keep it off for a lifetime, even with your busy lifestyle. You&#039;ll discover the most effective ways to exercise, how to make long-lasting changes to your diet and what to do in nearly every difficult situation - social eating, exercise when traveling and so much more!  </p>  <p style=\"\">  \t<strong style=\"\">Develop the right habits that lead to fat loss, make the most of your time and finally get results that last. </strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"></strong>Learn what good nutrition actually looks like (Hint: It&#039;s not perfect!)</li>  \t<li style=\"\">Discover how to make healthy eating more convenient</li>  \t<li style=\"\">Find an exercise plan that works for you and your specific lifestyle </li>  \t<li style=\"\">Receive a 52 week step by step exercise and nutrition guide to help you not only get results, but makes those results maintainable in the long term. </li>  </ul>  <p style=\"\">  \t<strong style=\"\">Learn the actionable steps you can take to not only lose fat, but live a healthier lifestyle - without spending hours everyday in the gym or giving up all the foods you love.</strong>  </p>  <p style=\"\">  \t    The amount of fat loss information that has been made available in the last few years is astounding! However, with all that information the problem has now become information overload. How do you know what you should do?  </p>  <p style=\"\">  \t    Furthermore, most people looking to lose body fat and get in better shape simply try exercising more. While exercise is a critical component, nutrition is even more important.  </p>  <p style=\"\">  \t    What make this course unique is it outlines exercise AND nutrition strategies that will last. The course is designed to teach you how to systematically get results, what to do in every scenario you&#039;ll run into and how you can lose body fat and get results with any type of lifestyle. There is no one-size-fits-all program for exercise and nutrition - everyone is different and has different needs. Through this course you&#039;ll learn what will work best for you.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t    Complete with 57 lectures on exercise, nutrition and developing the right mindset, this all-encompassing course will teach you all you need to learn and more about losing body fat and living a healthier lifestyle, even when you constantly feel busy.  </p>  <p style=\"\">  \t    Improving your nutrition doesn&#039;t have to be as difficult as it seems. Throughout the course <strong style=\"\">you&#039;ll work on improving one aspect of your nutrition at a time</strong>. Your diet doesn&#039;t have to be perfect, but by simply working on improving each day you can get results.  </p>  <p style=\"\">  \t    An important part of good nutrition involves putting yourself in the best environment for success. Through this course you&#039;ll learn how to do just that - making healthy eating convenient, learning what should be on your grocery list and other nutrition strategies for long term success.  </p>  <p style=\"\">  \t    Of course exercise is a huge part of fat loss as well and through this course you&#039;ll learn how to do it better. I&#039;ve included ways to exercise if you have 2, 3, 4, 5, 6, or 7 days each week to devote to it and also <strong style=\"\">how to exercise if you only have 5-10 minutes</strong>! Achieving success with exercise is all about consistency and you&#039;ll learn how to utilize short workouts, even bodyweight workouts done at home, to keep you on track.  </p>  <p style=\"\">  \t    On top of that I&#039;ve included a 12 week exercise program that will give you a huge jump start on your progress. <strong style=\"\">I&#039;ve used variations of this very program to help clients lose 20, 25 and even up to 70 pounds!</strong> The best part? You can customize the program based on your exact schedule.  </p>  <p style=\"\">  \t<strong style=\"\">    You&#039;ll walk away from this course knowing exactly what you need to do get results</strong>, but you can also take comfort in knowing that you&#039;re not alone. I&#039;ll be here to support you and continue to add more lectures to ensure you have the best resources available to you. I care deeply about each and every student&#039;s success and will do whatever I can to help. Don&#039;t worry, you&#039;re in good hands!  </p>", 
    "end_date": null, 
    "title": "Long Term Fat Loss for Busy People", 
    "price": "20.00", 
    "instructors": "Justin Gordon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358196_37f5_2.jpg", 
    "course_url": "https://www.udemy.com/long-term-fat-loss-for-busy-people/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T02:43:06Z"
}