{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>*UPDATED JUNE 2016 <br></strong></p><p><strong>*Join over 3,000 successful students, and lose weight by eating what you want</strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>One of the greatest concerns that I get from 90% of my clients when they want to lose weight, is that they don't have the time and energy to workout, cook, and eat healthier.</em> </p>\n\n\n\n\n\n\n\n\n\n<p><strong>Work is all consuming. </strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>They need to lose weight, but believe that because they don't have the time during the week. Just the mere dream to lose weight can seem hopeless.</strong> </p>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Are you busy with your job or career?</strong> (working 40-70+ hours per week)</li><li>Do you spend<strong> late nights and early mornings in the office </strong>and at work?</li><li><strong>Are you exhausted </strong>when you get home from work?</li><li>Do you have family and friends that you wish <strong>you could spend more time with?</strong></li><li><strong>Do you have hobbies </strong>that have taken the backseat to work and obligations?</li><li><strong>Have you gained 10, 20, 30, 40+ pounds in the last 1-5 years?</strong></li><li>Are you having trouble<strong> fitting in your jeans?</strong></li><li>Have you tried other programs to lose weight, <strong>but have failed to stick with it?</strong></li><li>Do you want to be healthy for your wife, husband, parents, children, friends, and family, <strong>but feel like you don't have time to eat healthier or workout?</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<ol><li><strong>Not enough time to cook and make healthier eating choices, to help them lose weight</strong></li><li><strong>No time to workout to lose weight</strong></li><li><strong>They are completely exhausted at the end of everyday.</strong> </li></ol>\n\n\n\n\n\n\n\n\n\n<ul><li>Burns just as many (if not more) <strong>calories than running does</strong></li><li><strong>Burns fat during your workout, and up to 32 hours after your workout is over</strong></li><li>Is a combination of <strong>strength and cardiovascular training </strong></li><li>Takes a minimum amount of time:<strong> 10-20 minutes per workout</strong></li><li>Is significantly<strong> lower impact</strong> than most any other cardiovascular activity</li><li>Is affordable and portable, <strong>so that you can workout anywhere</strong></li><li><strong>Builds muscle and increases your metabolism</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong><em>So how do you lose weight and get ripped without spending THOUSANDS of dollars on... </em></strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>A gym membership $40-$149/month</li><li>Fitness classes $180-$349/month</li><li>Personal training: $60-$100/session. Typically at 2-4 sessions per week</li><li>Semi-private training: $20-$40/session. Typically at 2-4 sessions per week</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>See how this can all start to add up? </strong>Don't get me wrong here, I believe that your health is absolutely worth it. Treating your body right with the proper diet and exercise program is not only a means of losing weight, getting a ripped physique, and showing off your six pack abs.<br>Exercise and eating right can save you tens or HUNDREDS of thousands of dollars of the years on doctors appointments, physical therapists, medications, and even surgeries.</p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p>So if you have been struggling to lose weight, and you need to lose weight but don't think that you have the time to commit to overhauling your lifestyle completely, <strong>you don't have to. </strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>*This program is designed to help you...</em></strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Workout less</li><li>Achieve more</li><li><strong>Eat all the foods you love, and still lose weight</strong></li><li>Save time in the kitchen and at the grocery store so you can focus on the things and people in life that are more important. </li></ul>\n\n\n\n\n\n\n\n\n\n<p>If you are hesitant about taking this course, no worries at all. When you purchase this course you have 30 days to test it out to see if it works for you. If it does not or you don't like it, <strong>you have the Udemy 100% money back guarantee. </strong><em><strong>Think of this as test-driving this course for 30 days. If you aren't happy with it or your results, you basically got an entire programs worth of strategies and workouts on how to lose weight for free. </strong></em><em><strong>You won't get that kind of trial at any gym or fitness center. </strong></em>If this kettlebell course is not the right solution for you to lose weight, I want you to find the program that works best for you so that you can lose weight successfully. Otherwise, if you are ready to start saving time, saving money, and losing weight right now, simply click \"take this course\" and let's get started. You are well on your way to potentially transforming your body, your attitude, and your life forever, and I am so excited and thankful to be a part of that process. Looking forward to hearing about your results. -Jack<strong></strong><strong><strong></strong></strong></p>", 
    "end_date": null, 
    "title": "Lose Weight and Eat What You Want. Lose weight w/Kettlebells", 
    "price": "30.00", 
    "instructors": "Jack Wilson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496276_e29f.jpg", 
    "course_url": "https://www.udemy.com/kettlebell/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T21:19:11Z"
}