{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tNext update I will slowly add more workout videos to this course for you to follow!  </p>  <p>  \t                    This course was updated 2-8-2015, over 475 students already! Live like a Champion!  </p>  <p>  \t                      Quit wasting time in the weight room, feeling like you are lost on what to eat, do you dread looking in the mirror, have a feeling that you are wasting your time with your cardiovascular exercise, is exercise not fun anymore, feel like you are stuck, like nothing is ever going to work that you try?  </p>  <p>  \t                          Take Action now, we all procrastinate, stop it and make a move now.  You are not as healthy as you want to be, ENROLL in this course right now, and by next week you will be on our way to better health!  </p>  <p>  \t                              Build the muscle you want in the weight room, train in different so called zones to get the maximum benefit, learn the importance of making lifestyle changes in your diet so that you can live healthier longer and enjoy life, get that missing ingredient in your exercise routine so that it is fun and you would never want to miss it again, and keep your mind refreshed, charged and on target! All of this and much, much, more in this exciting 5 part lecture on health! Section 1 is on Strength Exercise, which is very important for proper muscle, ligament, and bone mass, normal metabolism, increased mood, decreased girth measurements, and the post workout burn benefit! Section 2 is on Cardiovascular Exercise. It is very important for an increase in healthy heart function, better blood flow throughout the body, to aid in the loss of fat, to build healthy lungs, and to decrease stress. Section 3 is on Diet, which is very important for higher energy levels, better looking skin, losing weight, being regular in the bathroom, and a whole bunch of things when dealing with overall health. Section 4 is on Getting Help so that you can see results in your health, know that being healthy is fun, keep your workouts different, and get REAL answers to questions that you have by having an expert around. Section 5 is on Affirmations and Goals, they will help prep your mind, feed it the right stuff daily for support and confidence, encourage you, and keep you on track to reach whatever you desire!  This is designed for anyone who really wants to take charge of their health, who wants to live an epic healthy life, who may be tired of being tired, who may already exercise but need something a little more, or anyone who wants to learn something new on health.  If you take something away from this course, that is a win! Get started, so that you quit procrastinating!  </p>  <p>  \t            I am so excited and confident in this course that there is a 30 day money back, full refund, no questions asked!  </p>  <p>  \t                          Again, Take Action NOW! We all procrastinate, stop it and make a move now.  You are not as healthy as you want to be, enroll in this course right now, and by next week you will be on our way to better health! Remember to live F.I.T., Forever In tune with your mind, body and life, everyday!  </p>", 
    "end_date": null, 
    "title": "Lose Weight Doing Exercise, Diet, & Goals Like a Champion ", 
    "price": "20.00", 
    "instructors": "Robert Jay Martin", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346768_7c43_3.jpg", 
    "course_url": "https://www.udemy.com/proper-health-and-lose-weight/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T00:58:05Z"
}