{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you 18yrs and over and want to get fitter, tone up, shape up, lose weight, increase your stamina and strength, balance your hormones, make better nutritional choices? Do you need to do exercise from home? Do you need to have a complimentary exercise regime to your existing one? Do you want short workouts of 30 minute duration which still produce results? Do you like the idea of HIIT or Rest Based High Intensity Interval Training? Do you want a programme with a lifetime access which is progressive and taylored to your body without needing a functional nutritionist? Are you fed up of struggling with food? Have you gone on all sorts of diets which worked for a bit but then backfired? Do you want to educate yourself on the hormones which play a role on body weight/ shape? Do you want to have a nutritional guide which helps you eat cleaner but is not a diet and its not about cutting out completely? Do you want to step it up in terms of nutrition without needing a functional nutritionist who costs lots and needs to do blood tests? Are you fed up of being unhappy with your body shape? Do you want to have a programme that is affordable yet extremely effective if used? Do you want to contribute to changing lives in Uganda (10% of the money goes to Whisper The Worlds Orphanage Fund)? </p><p>If you have answered yes to 1 or more of the above then this course is for you! </p><p>There are 2 main components and the 3rd component which is on mindset is a bonus component.</p><p>The Rest Based HIIT component is your exercise and there are 4 sets of exercises. We recommend at least 2 weeks per set but it is up to you how you progress through it. There are videos for each exercise, there is a warm up section and there is a breakdown of stretches recommended. There are explanatory intro videos on how to carry out the session exactly.</p><p>The nutritional guide is a gem and instead of keeping it for the select few, we have decided we wanted to make a bigger impact and so we are releasing it through this course! You will analyse your hormone profile through a simple questionnaire and then follow the plan guide thats best for your body based on your total score. There are explanatory videos on this too and the rest is on pdfs you can keep. This is incredible as its one step up from the generic nutritional guides out there and one step down from having to have blood tests with a functional nutritionist which is costly. </p><p>The mindset section is a bonus as it a a big passion of mine too. There is a chance more clips will be added on there for you but its a small section to get you started! 80% of success comes from the correct psychology! <br></p><p>Myself (Des) and Nicola hope you get great value out of this. That you enjoy it. That you make the most of it. </p><p>What is life without our health? </p><p>See you on the course! </p><p>Des</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Lose Weight, Tone Up and Balance Your Hormones", 
    "price": "30.00", 
    "instructors": "Despina (Des) Hapeshis", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/862176_e8bd_3.jpg", 
    "course_url": "https://www.udemy.com/lose-weight-tone-up-and-balance-your-hormones/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-28T11:56:22Z"
}