{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Through this course, we will take a research based approach to lower back pain relief. It is estimated that 80% of Americans will suffer from lower back pain. The primary cause of lower back pain is poor postural patterns caused by tight muscles. The Corrective Exercise approach to lower back pain is a Research based 3 Step  system: Relax, Lengthen, and Strengthen. </p><p>The first stage is to relax tight muscles. In this video, we demonstrate how to use a technique called \"Self Myo-fascial\" release to relax muscles that are tight or \"over active\". We use specific tools to relieve the muscle tension such as tennis balls and a foam roll. </p><p>Once we relaxed the tight muscles aggravating the back, we move to the Lengthening stage. In this stage, we focus on specific stretches to target over active muscles.  The stretches will lengthen the tight muscles to a proper length and tension. <br></p><p>Our final phase is to strengthen muscles that are too weak or \"under active\". In this phase we focus on strengthening all parts of the core and developing strength through the hips as well. We end with a functional and dynamic exercise to teach the body to move together with proper mechanics.</p><p>This video is based on Research and you will experience the results. </p><p>Thank you for your time and I hope to hear from you soon, </p><p>      Matthew Tanoue <em>CES, PES, cPT</em><br></p>", 
    "end_date": null, 
    "title": "Lower Back Pain: Relaxation and Therapeutic Exercise", 
    "price": "20.00", 
    "instructors": "Matthew Tanoue, Corwin Perdomo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823930_3cf4_2.jpg", 
    "course_url": "https://www.udemy.com/lower-back-pain-relaxation-and-therapeutic-exercise/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-16T20:18:57Z"
}