{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>The PersistentlyFit workout</strong><br></p><p>The PersistentlyFit Workout system will allow you to become fit by performing a few simple exercises regularly.<br></p><p>The best workout is the one you keep doing, regularly. This is the only way to see real results. The PersistentlyFit workout is designed so that you can never have any excuses. You can do it anywhere. No special equipment is required, and no prior experience is assumed. Doing it regularly is just a bit harder than brushing your teeth.</p><p>The program will also teach you a few mental tools to help you keep persisting with your workout, even at times when you don't really feel like doing it. The hard part with any workout is not overcoming earth's gravity, but overcoming your own mind.</p><p><strong>Why take this course?</strong></p><p>This program will teach you how to become and stay fit, under any condition. Being fit is one of the best ways to invest in yourself. It costs so little time and effort, and it has so many benefits:</p><ul><li>Be healthier.</li><li>Be more productive.</li><li>Improve your sleep.</li><li>Improve your mood.</li><li>Improve your sex life.</li><li>Become more attractive.</li><li>Add discipline to your life. </li><li>Train your mind.</li></ul><p><br></p><p><strong>What results should I expect?</strong></p><p>For 20 minutes a day, 3 days a week, you can become very fit. You will not become a body builder, but you will gain great core muscles. I do this workout 6 days a week, about 35-40 minutes a day. You can take a look at the videos to see the results it has given me.<br><strong></strong></p><p><strong>Who is this program for?</strong></p><p><strong></strong>If yo<strong></strong>u can walk and sit, most likely you can do this workout. If you are the kind of person that doesn't have much time, or you spend much of your time flying around the world, this is definitely for you. You can also use this program as complementary workout for any other sport you are doing.</p><p>If you have any special conditions or other doubts, you should consult a doctor or a professional physician.</p><p><strong>The course structure</strong></p><ul><li>Introduction</li><li>The three main techniques: Pushups, situps and back exercises.</li><li>Example workouts:<ul><li>A basic workout you can do right now.</li></ul><ul><li>An advanced workout, combining all the techniques.</li></ul></li><li>Some workout tips</li><li>Mental tools to persist with the workout.</li></ul>", 
    "end_date": null, 
    "title": "PersistentlyFit Workout", 
    "price": "20.00", 
    "instructors": "Lukas Forsberg", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669730_209c.jpg", 
    "course_url": "https://www.udemy.com/persistentlyfit-workout/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-14T16:38:39Z"
}