{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\"<em><strong>A few well-designed movements, properly performed in a balanced sequence, are worth hours of doing sloppy calisthenics or forced contortion</strong></em>.\" <em>Joseph Pilates</em> </p><p>This course is summed up so well in this quote.  I have seen clients transform their bodies in a few short months by following the complete Pilates matwork sequence.  Although the physical changes are astonishing in such a short time, the benefits to their health are equally amazing.  Most become more body aware within 3 classes, chronic back pain disappears, energy levels improve, sports injuries are less frequent and clients report  that they feel calmer and less stressed. </p><p>Anyone can do Pilates: you don't have to be young or a contortionist, so once you have learned the sequence, you have it for life. </p><ul><li>This course consists of a Pilates Guide booklet in PDF format; </li><li>11 hours of videos: workshops, classes for beginner, intermediate and advanced</li><li>The complete matwork sequence suitable for that level. </li></ul><p>The workshops teach the basics of Pilates and so this is where you start and refer back anytime you need a reminder.</p><p>The classes teach you all the exercises you will need for the matwork sequence and each prepares you for the next.  You should practice each class until you feel comfortable to move on.  The sequence should be repeated at least 10 times, every other day.  You will then be ready to move on to the next level.</p><p>It is possible to complete this course within 3 months for the fit and injury free; 5 to 6 months is achievable for most people. </p><p><strong><em>\"In 10 sessions you will feel the difference. In 20 you will see the difference. And in 30 you will have a whole new body.\" </em></strong><em>Joseph Pilates</em> </p>", 
    "end_date": null, 
    "title": "Pilates: A New Body in 30 Sessions", 
    "price": "50.00", 
    "instructors": "Josie McKenlay", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626912_5340.jpg", 
    "course_url": "https://www.udemy.com/pilates-a-new-body-in-30-sessions/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T11:20:29Z"
}