{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Whey protein</strong> is the <strong class=\"redactor-inline-converted\">WORLD'S NUMBER ONE</strong><strong class=\"redactor-inline-converted\"> most popular selling workout supplement.</strong></p>\n\n<p>Yet, when most people buy it because of someone's recommendation, they have no idea what they are buying or how to use it for maximum results.</p><p><strong class=\"redactor-inline-converted\">In this 90 minute FREE course,</strong> not only will you will learn all of the incredible muscle-building benefits of this complete protein, I will ensure that you will finish this course more educated than your local personal trainer.</p><p>Not only will I give you science-based advice (all references included), I will also draw upon practical examples of \"real world\" whey protein packaging so you are able to apply science to real-world purchasing decisions.</p><p>After completing this course,</p><ul><li>You will know exactly <strong class=\"redactor-inline-converted\">what</strong> you are buying and <strong class=\"redactor-inline-converted\">why</strong> you are buying it.</li><li>You will learn how to read nutrition labels so you know exactly where you are spending your money (<strong class=\"redactor-inline-converted\">and you may even SAVE money</strong>!).</li><li>You will learn the basic concepts of whey protein, whey peptides, and other scientific principles to complete your understanding of the practical advice given in this course.</li><li>You will be given <strong class=\"redactor-inline-converted\">practical strategies</strong> backed by peer-reviewed scientific research for calculating <strong class=\"redactor-inline-converted\">how much protein you need everyday</strong> to meet your training goals.</li><li>You will know exactly <strong class=\"redactor-inline-converted\">how much</strong> protein you need post-workout and within what <strong class=\"redactor-inline-converted\">time frame</strong> after your workout.</li><li>You will know precisely where the science stands for high protein dieting and kidney and liver function.</li><li>You can <strong class=\"redactor-inline-converted\">learn with confidence</strong> knowing that advice and concepts in this course are all backed by the latest in peer-reviewed scientific research, with citations included throughout.</li></ul><p><br></p><p><strong>Enrol in this course today </strong>and start learning what I wish I had access to many years ago when I started my fitness journey!<br></p>", 
    "end_date": null, 
    "title": "Protein Education Series: The Complete Guide to Whey Protein", 
    "price": 0, 
    "instructors": "Brad Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/852058_4aea_2.jpg", 
    "course_url": "https://www.udemy.com/whey-protein/", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-17T16:25:58Z"
}