{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t          Do you suffer from lower back pain?  Would you like to find a safe way to improve your quality of life?  </p>  <p style=\"\">  \tIn this  course, Ramel (Rami) Rones will guide you through a series of stretches, movements and elements of Tai Chi and Qi Gong that will help you recover from acute back pain as well as long term chronic pain.  In addition, you will learn the power of deep breathing and meditation and will become more relaxed, lowering any stress you may have.  </p>  <p style=\"\">  \t<strong style=\"\">Rami has synthesized over 30 years of Tai Chi and mind-body teaching and practice</strong> to create this Relieve and End Back Pain course. You will experience the same teaching he has done with the thousands of elite athletes, adults, teenagers, “weekend warriors”, martial artists and others to live a more pain free life.  </p>  <p style=\"\">  \t          He has designed a number of medical clinical trials such as the investigation of the <strong style=\"\">benefits of Tai Chi and Fibromyalgia</strong>, <strong style=\"\">T</strong><strong style=\"\">ai Chi and Knee Osteoarthritis.</strong>  Much of his research design is also included in this course.  His Fibromyalgia and Tai Chi study was <strong style=\"\">published in the New England Journal of Medicine</strong> and featured in <strong style=\"\">the New York Times</strong>.  </p>  <p style=\"\">  \t          You will also benefit from his extensive teaching at the <strong style=\"\">internationally recognized Dana-Farber Cancer Institute, Tufts Medical Center and the Boston Medical Center</strong> where he continues to help patients deal with, and recover from, a wide variety of ailments and and the side effects that often occur with various treatments.  </p>  <p style=\"\">  \t          Rami’s incredible knowledge, teaching ability and engaging personality makes this Tai Chi for Beginners course a joy for anyone interested in improving their physical and mental well-being.  </p>  <p style=\"\">  \t          By investing 20 minutes a day you will greatly improve your quality of life and enjoy activities that you have not been able to enjoy.  </p>", 
    "end_date": null, 
    "title": "Relieve and End Your Lower Back Pain with Tai Chi & QiGong", 
    "price": "20.00", 
    "instructors": "Ramel Rones", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/89094_3080_5.jpg", 
    "course_url": "https://www.udemy.com/relieve-and-end-your-lower-back-pain-with-tai-chi-qigong/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-06T16:30:16Z"
}