{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Shoe School is a comprehensive academy!  In this course, we will begin with the history of modern athletic shoes and then dive into the details on shoe anatomy, structure, and function.  We will show you how to evaluate shoes, perform a running analysis, and understand the principles of buying motion control shoes.  </p><p style=\"\">This course is made up of 5 sections.  Within each section are lectures which will take you through the necessary steps to select the perfect shoe for YOU! Each section has a PowerPoint presentation as well as the supplemental text for the presentation.  There are videos in each section as well, and those help to illustrate some or more difficult things to demonstrate without a visual aid.  We have also included a running analysis checklist in section 3.  All files are yours to download, print and share as you wish! </p><p style=\"\">Each section gets right down to business without a lot of &quot;fluff.&quot;  We want you to be able to take this course without a huge time investment, because we know you want to go out and run for yourself!  </p><p style=\"\">Whether you are a coach, personal trainer, shoe store owner, or just a running enthusiast, you will find the value in this course!  Learning how to properly identify the parts of a shoe, and recommend a certain style of shoe for someone can dramatically increase the value of your coaching, or training.  We hope that you learn as much taking this course as we did creating it.  We hope you have as much fun, too! </p>", 
    "end_date": null, 
    "title": "Shoe School! How to Pick the Perfect Running Shoes", 
    "price": "20.00", 
    "instructors": "Tyler Coody, Scott Gordon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563010_9d44_3.jpg", 
    "course_url": "https://www.udemy.com/shoe-school-how-to-pick-the-perfect-running-shoes/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T20:46:43Z"
}