{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Have you ever attempted to get six pack abs before? Chances are you've probably encountered so many challenges and roadblocks that you didn't know which strategy, tactic, workout or diet to follow. </p>\n\n<p>If you've ever felt overwhelmed and told yourself that getting six pack abs was impossible, you're not alone. </p>\n\n<p>I used to feel frustrated and confused during my first few attempts at getting six pack abs. </p>\n\n<p>I used to think that getting six pack abs meant starving myself &amp; training like hell. I used to wonder if what I was doing was the right thing because that belly fat never seemed to go away even after losing massive amounts of weight. And that's why I decided to become a certified personal trainer and what I found out was that the workouts and diet were the opposite of what I was doing. More importantly, it was a lot simpler than I thought and all I needed to do was build these crucial micro habits to give me some momentum to get six pack abs. </p><p>In this course:</p>\n\n<ul><li>You'll learn how to make your fat loss automatic when you learn these effective micro habits</li><li>You'll discover how to lose fat sustainably as you stack these small habits to add more accuracy and precision so you can get six pack abs faster.</li><li>You'll stop getting frustrated once find out how you can overcome and avoid unnecessary fat loss plateaus. </li><li>You'll discover the 5 training protocols and 2 dieting protocols to burn off those last few pounds of lower belly fat.</li><li>You'll get abs that are more defined when you learn these 3 crucial ab exercises</li><li>You'll save time as you effectively burn fat using only a few key exercises instead of doing those cardio moves that you see on dvd's</li></ul>\n\n\n\n<p>Right now you're probably wondering if getting six pack abs is even possible for you and I can tell you that with this course, it definitely is. This course is perfect for those who want to focus all of their efforts only on the most effective tactics to get 6 pack abs instead of chasing weird tips and tactics.</p>", 
    "end_date": null, 
    "title": "Six Pack Abs Masterclass: Lose Those Last Few Inches of Fat", 
    "price": "50.00", 
    "instructors": "Adam Lee", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544398_212e_3.jpg", 
    "course_url": "https://www.udemy.com/honest-six-pack-abs-lose-those-last-few-inches-of-belly-fat/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T21:33:48Z"
}