{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Improve mobility &amp; flexibility, boost strength and increase endurance with the ultimate train anywhere system.</strong></p><p>The Spitfire programme will help you move better, improve your performance and build your strength. Whether you're training for athletic performance or to just improve your general health and mobility Spitfire is ideal. </p><p>Train without equipment using just using your own bodyweight to get a full body workout in only 30 minutes.   </p><p>Mobility is a key indicator of general health and fitness yet it is ignored in most exercise systems.</p><p>Spitfire is different. </p><p>By building upon a core of sound movement practice Spitfire will build your strength, stability and flexibility to ensure that you can train effectively and without injury.</p><p>Spitfire is a workout that you can do anywhere. In the gym, at home, in a hotel or outdoors. </p><p><strong>All you need is some floor space to move in and your own bodyweight.</strong></p><p>It’s a system that you can, quite literally, take anywhere.</p><p>With as little as 2 sessions per week you will notice a huge difference in your movement patterns, you will increase your range of motion, you will burn calories, lose weight and build strength. </p><p>Whether as a complement to your existing training regime or as a complete exercise system Spitfire will revolutionize your training. </p><p><br></p>", 
    "end_date": null, 
    "title": "Spitfire Bodyweight Programme", 
    "price": "40.00", 
    "instructors": "Paul Gray", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/701056_0b3e_4.jpg", 
    "course_url": "https://www.udemy.com/spitfire/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-18T21:29:43Z"
}