{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Have you been working out for many years?</p>  <p>Are you gymed out from the routine, and cant get any stronger?</p>  <p>Did you have enough spending long hours on running or doing cardio?</p>  <p>Do you have joint pains from the long runs</p><p>Would you like to have a simple, time saving workout, which can boost your bodies recovery system and regeneration to keep you young, super fit and healthy</p><p>        Welcome to my Ultimate HIIT Superfit workout.</p><p>This is a  hyper-intensity Interval training, which is  a special fusion of power yoga and plyometric interval and circuit training.</p><p>Plyometric exercises give the work bouts of the interval training and the power yoga part gives the resting bout of the workout.</p><p>The benefits are the huge time saving, saving the wear and tear on the joints while becoming stronger than ever with any kinds of workout before.</p><p>Superior Growth hormone production post exercise which gives you strong and high energy for the entire day. When you do long runs you het the fatigue period of the day, with this workout you simply go all day long on 100% and retire on the end of the day.</p><p>I m 46 years old at the time of this recording and I have been working out with this system the past 5 years. I feel stronger and healthier than ever. My immune system working it all out by itself.<br></p>", 
    "end_date": null, 
    "title": "Super Fit HIIT Workout by Dr Zsu", 
    "price": "20.00", 
    "instructors": "Dr Zsuzsanna Fajcsak", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752040_1ef7_5.jpg", 
    "course_url": "https://www.udemy.com/super-fit-hiit-workout-by-dr-zsu/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-04T06:09:56Z"
}