{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Do you want to get into shape but don’t know where to start? Do you find yourself doing the same exercises and routines over and over? Do you find it hard to get your workout in on the road due to lack of training facilities or imagination? Do you feel embarrassed to step into a gym and prefer to work out at home? Has lifting weights constantly or improperly wreaked havoc on your joints? Or, like most people do you just not have enough time to workout consistently?</p><p>If you answered “yes” to any of these questions, then How to Be Your Own Personal Trainer is for you. In this course you will be given the tools you need to create your own workouts based on your needs and goals.</p><p>Need to do cardio but hate to run? There’s a routine for that. Can’t do more than 1 pushup? There’s a routine for that. Got just 15 minutes? There’s a routine for that. Do lower back issues affect your daily living? There’s a routine for that. Want to enhance that backside? There’s a routine for that. Want to increase weight loss? There’s a routine for that. But even better, with all these exercises and knowledge of what they do, you’ll be able to create a training program best suited to you, your workout space and time constraints.</p><p>Each exercise has an easier and harder modification for newbies and veterans alike so everyone can benefit from this course. All you need is yourself and some dedicated time.</p><p>Through videos, slide presentations and PDF files, this comprehensive course will provide the tools you need to get the most out of bodyweight exercises.</p>    <!--EndFragment-->", 
    "end_date": null, 
    "title": "Take Control of Your Fitness with 101 Bodyweight Exercises", 
    "price": "50.00", 
    "instructors": "Charles Smith", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319036_b79b_8.jpg", 
    "course_url": "https://www.udemy.com/bodyweightexercises101/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T18:38:36Z"
}