{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>UPDATED JUNE 2016<br></strong></p>\n\n<p><strong>Join OVER 6,000 students who are getting SIX PACK ABS!</strong></p>\n\n\n\n\n\n\n\n<p><strong>Questions to Ask Yourself:</strong><br></p>\n\n\n\n\n\n\n\n\n\n<ul>  \t<li><strong>Have you been fighting to lose weight and lose belly fat your whole life?</strong></li><li>Are you <strong>terrified of stepping on the scale?</strong></li>  \t<li>Having <strong>trouble fitting in your favorite pair of jeans?</strong></li>  \t<li>Have you been <strong>struggling for years</strong><strong> to lose weight and get rid of body fat </strong>in those hard-to-get places? On your <strong>Abs? Back? Arms? Hips? Thighs?</strong></li>  \t<li><strong>Are you embarrassed to be seen in your bathing suit?</strong></li>  \t<li>Are you clinging to cravings and unhealthy <strong>habits that are keeping you from getting the body you deserve?</strong></li>  \t<li>Trying to tone your muscles,<strong> </strong><strong>but have no idea how to do it?</strong></li><li>Have you always wanted to lose weight and get <strong>flat, ripped abs, but never had them?</strong></li>  </ul>\n\n\n\n\n\n\n\n<p><em></em></p>\n\n\n\n\n\n\n\n<p><strong><em>So how do you lose weight and get ripped without spending THOUSANDS of dollars on... </em></strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>A gym membership $40-$149/month</li><li>Fitness classes $180-$349/month</li><li>Personal training: $60-$100/session. Typically at 2-4 sessions per week</li><li>Semi-private training: $20-$40/session. Typically at 2-4 sessions per week</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>See how this can all start to add up? </strong>Don't get me wrong here, I believe that your health is absolutely worth it. Treating your body right with the proper diet and exercise program is not only a means of losing weight, getting a ripped physique, and showing off your six pack abs.</p>\n\n\n\n\n\n\n\n<p>Exercise and eating right can save you tens or HUNDREDS of thousands of dollars of the years on doctors appointments, physical therapists, medications, and even surgeries.</p>\n\n\n\n\n\n\n\n<p><em>If you feel this way, <strong>this course is for you</strong>. This program is an intense, results driven, 360 degree lifestyle modification program</em><strong><em> that will help you lose weight and get stellar abs!</em></strong><br></p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    It is systematically<strong> designed to optimize fat loss while minimizing the amount of time you spend cooking and working out</strong>. This course will give you all the tools and information that you need to lose weight around your stomach and become the <strong>leaner, stronger, more confident YOU</strong> that you've always wanted to be.</p>\n\n\n\n\n\n\n\n\n\n<p>  \t<em><strong>    *Haven't worked out a day in your life? No worries!</strong></em>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    I've included modifications for all of the  exercises and workouts to meet you at wherever you are in fitness. It doesn't matter if you're a college athlete, a new mom, a busy executive, or a 70+ grandparent.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    I've trained everyone from <strong>special ops officers </strong>in the armed forces to <strong>60 year old grandmothers</strong> using the same principles and methods I've laid out for you in this course.   \t<strong></strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>Want to know what they all have in common? </strong>They've all lost weight and gotten ripped abs!<strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>This Course is going to show you exactly...</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>How to <strong>workout only 60 minutes PER WEEK, lose weight, and get six pack abs</strong> at any age</li><li>How to lose weight by building lean, fat-burning <strong>muscle </strong><strong>mass</strong></li><li>Why <strong>building muscle is the best way to get six pack abs, and lose weight around your stomach.</strong></li><li>How to<strong> tone your entire physique</strong> from butt and back, to biceps</li><li>Workouts that <strong>increase your metabolism</strong>, and<strong> </strong><strong>burn belly fat for 24 hours AFTER your workout</strong></li><li>The exact foods you need<strong> </strong><strong>to lose weight. Lost 20, 30, 40, 50+ pounds of body fat around your stomach.</strong></li><li>How<strong> eating more frequently can help you lose weight and</strong><strong> burn more body fat</strong></li><li>Why <strong>eating massive meals</strong> <strong>can help you lose weight and accelerate your </strong><strong>fat loss, </strong></li><li>How you can <strong>save money by eating healthy</strong></li><li>Simple techniques to <strong>make 5 star restaurant meals in under 20 minutes</strong></li><li><strong>The exact formula I use to build the best fat burning, ab-ripping workouts so that you can make your own!</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>About this Course: </strong>  </p>\n\n\n\n\n\n\n\n\n\n<ul>  \t<li><em>You'll get full lifetime access</em></li>  \t<li><em>FREE full lifetime access to my course How to Lose Fat and Keep it Off (just send me a message and I'll send you the link to get it free!)</em></li>  \t<li><em>Free future course updates, bonus features, and new workouts. I'm continuing to add new material to the course, and you'll get it for FREE.</em></li><li><em><strong>Udemy 30 Day 100% Money Back Guarantee. If this solution isn't the best for you, I want you to find the one that is.</strong></em></li>  </ul>\n\n\n\n\n\n\n\n\n\n<p><strong>Get these Free Added Bonuses When you Sign up Today</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li><em></em></li><li>New content added every month</li><li>How Eating Massive Meals Can Help you Lose Body Fat and get six pack abs</li><li>How to Cut Your Grocery shopping time in Half</li><li>One Big Trick that Saves Hours in the Kitchen</li><li>How to Eat Healthy on the Go</li><li>A downloadable 30 day workout schedule to get you ripped and ready for any event</li><li>The downloadable fat loss food guide that will get you the body you've always wanted</li><li>Access to all of my favorite six pack abs recipes</li><li>Free metabolic calculator guide for optimizing fat loss around your abs</li></ul>\n\n\n\n\n\n\n\n\n\n<p>  \t                    Trendy fitness plans are designed the same way. To throw your body into <strong>extreme cycles of calorie cutting and wild exercise</strong>, sending you into a crash. <strong>You'll burnout, give into cravings, start binge eating, and gain back all of the weight you lost AND MORE!</strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    I've personally tested and thrown out the gimmicky, ineffective workout methods and diets that you see on infomercials and in magazines, <strong>to bring you the most effective methods of losing weight, burning serious body fat, and getting great abs.  </strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    <strong>I want you to have the body you deserve </strong>and I'll help you get there one day at a time. </p>\n\n\n\n\n\n\n\n\n\n<p>I've broken down <strong>10 years</strong> of training experience, workout protocol testing, diet experimentation, habit implementation, and health research to give you only the best methods of getting great abs.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t<em>No gimmicks. No Crash Courses. No excuses. </em>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t<em><strong>Just real data, tasty food, effective workouts, and hard results.</strong></em></p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    Take it from me,<strong> who was almost 50 pounds overweight </strong>before fitness and eating right changed my life.<strong> I'm NOT genetically inclined to be ripped and have super six-pack abs</strong>. I can't just eat burgers and fries and be completely shredded like the gifted guys and girls we see on TV and in the movies  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    I've worked my butt off to get down to 8-10% body fat, get six pack abs, and stay there! <strong><em>I want you to know that you can do the same, and I've helped thousands of others like YOU get there.</em></strong>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    You've wanted this kind of body your whole life, and I'll be honest with you. Every second you wait to do something about it, <strong>the further you walk away from the body you dream of having. </strong>Don't put it off any longer.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    Remember that this is a risk free way to <strong>make that change. </strong>If you aren't satisfied with this course or you don't think it's the right solution for you, you have My <strong>Udemy 30 Day 100% Money Back Guarantee. </strong></p>\n\n\n\n\n\n\n\n\n\n<p><em><strong></strong>I want you to find the right solution for you, even if this isn't it.  </em></p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    Click <em><strong>\"Take this course\"</strong></em> to lose weight, body fat, and start sculpting the abs and ripped body that you've always wanted. Take before pictures, <em><strong>because the after pictures will change your life.  </strong></em>  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                I can't wait to hear about and see your results.    </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                See you on the inside!</p>\n\n\n\n\n\n\n\n\n\n<p>-Jack W.</p>", 
    "end_date": null, 
    "title": "The Secret to Six Pack Abs: Get Shredded Abs in 60 min/week", 
    "price": "35.00", 
    "instructors": "Jack Wilson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302400_6881_4.jpg", 
    "course_url": "https://www.udemy.com/rapid-fat-loss-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T21:05:09Z"
}