{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t                    Whether you just got a Suspension Trainer for your home gym or want to learn how to use the one at the gym, this course will teach you 30 different Suspension Trainer Exercises to work your upper body, lower body and core.  </p>  <p style=\"\">  \t                  The Suspension Trainer is a great training tool because it is super core intensive, even when working your upper or lower body, and helps you build core strength and stability. Building core strength and stability helps to prevent and alleviate many injuries, including low back, hip, knee and even shoulder and neck pain.  </p>  <p style=\"\">  \t            In this course, we will show you moves to strengthen your shoulder and upper back to prevent upper back, neck and shoulder pain. We will also show you moves to strengthen your core, glute and leg to help you prevent low back, hip, knee and even ankle and foot pain and injury.  </p>  <p style=\"\">  \t          And with each of these 30 Suspension Trainer Exercises, we will show you how to tailor the moves to meet your specific fitness level. The Suspension Trainer is an awesome tool for exercisers of all levels because it can make bodyweight exercises both easier for the beginner or more advanced for the advanced exerciser!  </p>  <p style=\"\">  \t    Once you&#039;ve completed each section of the course, you are then ready to take on our Suspension Trainer Workouts. Each section has its own workout using the exercises discussed in that section (Upper Body, Lower Body or Core Moves). And once you&#039;ve completed all three sections, you can then try our two Full-Body Suspension Trainer Workouts!  </p>  <p style=\"\">  \tJoin our Suspension Trainer Course and learn how to get in a Full-Body Workout to develop upper body, lower body and core strength and prevent pain and injury!  </p>", 
    "end_date": null, 
    "title": "The Full-Body Suspension Trainer Workout Program", 
    "price": "20.00", 
    "instructors": "Cori Lefkowith", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406250_69a3_2.jpg", 
    "course_url": "https://www.udemy.com/the-full-body-suspension-trainer-workout-program/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T06:29:06Z"
}