{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">The 30-Day Core Challenge will help you strengthen and tone your entire core in 30 days using just your own bodyweight. </p><p style=\"\">Often when people think about training their Core, they think of six-pack abs and crunches. They think about aesthetics. </p><p style=\"\">And while a good Core Training Program, can help you get great looking abs, Core Training is about more than getting a six-pack. </p><p style=\"\">A strong core means less risk for pain and injury and it also means you can lift more and run faster (and even do more pull ups and push ups). </p><p style=\"\">What many people also don&#039;t realize is that Core Training is about more than working your abs – it is about strengthening everything from your shoulders to your knees. </p><p style=\"\">That is why in this 30-Day Core Challenge we will provide you with exercises and workouts that work everything from your shoulders to knees, including the muscles down your frontside and your backside. </p><p style=\"\">This 30-Day Course will even strengthen your glutes because your glutes are a key part of your Core and are often overlooked because people spend most of their time focused on working their abs with crunches. </p><p style=\"\">Our Core Program doesn&#039;t waste your time with crunches because a proper Core Training Workout Routine isn&#039;t about doing a million crunches. Crunches don&#039;t give you much bang for your buck. They don&#039;t burn many calories to burn the fat potentially hiding your abs and they don&#039;t strength many muscle groups at once to make you functionally strong. </p><p style=\"\">That is why in this 30-Day Core Challenge, we will provide you with a variety of Plank Variations, Hanging Core Exercises, Crunchless Core Moves and Glute Bridges to strengthen and tone your entire core.</p><p style=\"\">Get started today with our 30-Day Core Challenge Workout Program and build a stronger Core without crunches!</p>", 
    "end_date": null, 
    "title": "The 30-Day Core Challenge ", 
    "price": "30.00", 
    "instructors": "Cori Lefkowith", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455472_38b9.jpg", 
    "course_url": "https://www.udemy.com/the-30-day-core-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T05:17:27Z"
}