{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">+++CLINICALLY PROVEN TECHNIQUES!+++</strong>  </p>  <p style=\"\">  \t<strong style=\"\">You&#039;re About To Eat Constantly &amp; Easily Lose up to 30 lbs in 30 Days...</strong>  </p>  <p style=\"\">  \t<strong style=\"\">GUARANTEED (Without Pills, Deprivation, or Exercise...)</strong>  </p>  <ul style=\"\">  \t<li style=\"\">No Pills, or Supplements</li>  \t<li style=\"\">No Deprivation</li>  \t<li style=\"\">No Exercise</li>  \t<li style=\"\">No Appointments</li>  \t<li style=\"\">No Meetings</li>  \t<li style=\"\">No Restrictions</li>  \t<li style=\"\">No Strict Diets</li>  \t<li style=\"\">No Pain</li>  \t<li style=\"\">No Surgery</li>  \t<li style=\"\">No Health Risks</li>  </ul>  <p style=\"\">  \t                        It&#039;s ridiculously simple to start losing weight with this <strong style=\"\">clinically proven extreme fat shedding program</strong> even if you&#039;ve never been able to lose long term weight before...  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Just &quot;Listen, Relax&quot; And &quot;Eat &amp; Lose&quot;</strong></em>  </p>  <p style=\"\">  \t                    While experiencing a dramatic change in how you look &amp; feel!  </p>  <p style=\"\">  \t                    Finally, a brand new hybrid weight loss concept that will have you instantly relaxing and quikcly shedding pounds without ever breaking a sweat!  </p>  <p style=\"\">  \t                    This is the only 100% clinically proven weight loss program based on solid clinical studies that proves it works quickly and for the long term. Using this comprehensive weight loss program, you&#039;ll notice that you&#039;ll lose weight fast, and that fat comes off your body while you eat and relax!  </p>  <p style=\"\">  \t                    In clinical studies which this unique treatment process was built upon, users lost more weight than 90% of those not using the treatments... and they kept the weight off permanently! The results speak for themselves.  </p>  <p style=\"\">  \t                    The true secret to this concept is that you&#039;re not killing your appetite, but actually feeding it. Where other diets says, don&#039;t eat... this remarkably successful concept has you actually EATING... and you&#039;re never hungry! NEVER! And you lose fat, look &amp; feel amazing, and you&#039;ll keep weight off FOR GOOD!!!  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">It&#039;s So Delicious &amp; Easy!</strong></em>  </p>  <p style=\"\">  \t              You&#039;ll enjoy short daily relaxing  &quot;Eat &amp; Get Slimmer&quot; treatment sessions, where you&#039;ll actually feel your stomach shrinking to the size of a tennis ball, making it impossible to eat too much.  </p>  <p style=\"\">  \t              Through special cognitive treatments, your mind will begin working with your body, instead of against it, to eliminate cravings and emotional eating patterns that have been firmly established from your childhood.  </p>  <p style=\"\">  \t              These breakthrough treatments are scientifically and clinically established through the largest study ever conducted, and have been well documented and proven to perform 30 times more effective in losing  a whopping 90% more weight loss  than without it.  And best of all, the weight never comes back!!.  NEVER!!  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">It&#039;s REALLY That Simple!</em></strong>  </p>  <p style=\"\">  \t            109 people completed a  treatment for weight management  one group used this concept, the other group did not. At the end of the 9-week program, both interventions resulted in significant weight reduction. At 8-month and 2-year follow-ups, the  subjects  using this concept were found to have continued to lose significant weight, while those in the control  group showed little further change.  </p>  <p style=\"\">  \t            Researchers analyzed 18 studies comparing treatments involving this concept .  </p>  <p style=\"\">  \t            Those who received the treatments based on this concept lost more weight than 90 percent of those not receiving  this treatment and maintained the weight loss two years after treatment ended.  </p>  <p style=\"\">  \t            The concept used in this program  can more than double the effects of traditional weight loss approaches<br style=\"\">  \t<br style=\"\">  \t            An analysis of five weight loss studies reported in the Journal of Consulting and Clinical Psychology in 1996 showed that the &quot;… weight loss reported in the five studies indicates that when this concept was used, it  can more than double the effects&quot; of traditional weight loss approaches.  </p>  <p style=\"\">  \t            Presenting...  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">  The Ultimate Weight Loss &amp; Health Improvement Training</em></strong>  </p>  <p style=\"\">  \t<em style=\"\">Scientifically/Clinically Based Weight Loss Program<br style=\"\">  \t        The Most Powerful &amp; Effective Weight Loss Program Available On Earth</em>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">  Who Is This For (Anyone who wants to...)</em></strong>  </p>  <ul style=\"\">  \t<li style=\"\">lose 5 lbs to 200 lbs or more</li>  \t<li style=\"\">be healthy</li>  \t<li style=\"\">look amazing in a slimmer, healthier body</li>  \t<li style=\"\">feel better about their looks and feel more comfortable around other people</li>  \t<li style=\"\">a better social life... losing weight has even helped people get better jobs</li>  \t<li style=\"\">sleep better</li>  \t<li style=\"\">get off Diabetes / blood pressure meds</li>  \t<li style=\"\">have more fun</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Here&#039;s Why You&#039;ll Absolutely Love The Surefire &quot;Eat &amp; Get Slimmer&quot; Program:</em></strong>  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">You&#039;ll Feed Your Appetite</strong> - As you experience the daily &quot;Eat &amp; Get Slimmer&quot; treatments, you&#039;ll be more acutely sensitive to what specific brain signals are telling your body... and you&#039;ll automatically respond appropriately by feeding your appetite instead of killing it.<br style=\"\">  \t</li>  \t<li style=\"\"><strong style=\"\">You&#039;ll Finally Experience Rapid Weight Loss</strong> - As you experience the daily &quot;Eat &amp; Get Slimmer&quot; treatments, you&#039;ll feel your stomach literally  shrink to the size of a tennis ball, making eating too much impossible.<br style=\"\">  \t</li>  \t<li style=\"\"><strong style=\"\">Your Metabolism Will Sky Rocket</strong> - Using the daily SlimmerSipper Formula, you&#039;ll experience a lasting increase in your metabolic rate, so you&#039;ll automatically burn more fat than ever before.... for the long term.<br style=\"\">  \t</li>  \t<li style=\"\"><strong style=\"\">You&#039;ll Block Starches That Bloat Your Belly </strong> - As part of the treatments, the daily SlimmerSipper will also serve to block unwanted starches... this alone will shed pounds and prevent you from gaining future unwanted weight.<br style=\"\">  \t</li>  \t<li style=\"\"><strong style=\"\">Break Down Stored Fat</strong> - Finally, for the first time ever, your body will harness the power of the special  SlimmerSipper Formula that specifically targets stored fat in your body, then systematically breaks the stored fat down so that your body is able to finally burn it up.... causing you to finally lose fat you&#039;ve never lost in your life.  This is permanent removal of fat that your body has likely never before released!<br style=\"\">  \t</li>  \t<li style=\"\"><strong style=\"\">You&#039;ll Quickly Notice Dramatically Improved Health &amp; Vitality</strong> - The combination of daily &quot;Eat &amp; Get Slimmer&quot; treatments, plus a unique detoxification vehicle, plus the daily SlimmerSipper Formula will all work together to act as an amazing &quot;Health Tonic&quot;.  You&#039;ll experience improved digestion by balancing intestinal bacteria, while regulating blood/sugar levels by providing an anti-glycemic effect, which also regulates blood pressure.  This in turn lowers cholesterol particles and prevents oxidization, thus protecting the LDL cholesterol particles.  Now who doesn&#039;t want that?<br style=\"\">  \t</li>  \t<li style=\"\"><strong style=\"\">You&#039;ll Look Amazing</strong> - Not only will you look slim and become physically fit, but your skin will radiate with youthful vitality.  You&#039;ll finally fit into that amazingly attractive outfit you&#039;ve been wishing you could wear.  People will take a double look at your new slim, tone, and attractive body with envy and wonder what in the world is your secret?</li>  </ol>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">More Cool Stuff...</em></strong>  </p>  <p style=\"\">  \t  The daily &quot;Eat &amp; Get Slimmer&quot; cognitive/behavioral  treatments are the rock solid foundation to this amazingly effective weight loss program.... but  there is so much more to this incredibly comprehensive weight management concept than just foundational treatments.  We know how busy you are and how confusing it is to try to figure out meal planning.  So this program also includes specifically targeted meal plans designed for your absolute success during your treatment phase.  And we&#039;ve also included many  tasty recipes that you&#039;ll love.  </p>  <p style=\"\">  \t  Because research also shows that lasting weight loss will only occur when daily affirmations plus journaling are incorporated.... we&#039;ve included  a journal for you, plus an entire months supply of ready to go POWERFUL &amp; EFFECTIVE  daily affirmations.  This makes the &quot;Eat &amp; Get Slimmer&quot; program the most comprehensive clinically sound weight loss program on the planet.  No other program is  this effective  or this comprehensive.  </p>  <p style=\"\">  \t  Looking forward to see you inside!<br style=\"\">  \t<br style=\"\">  \t  Very bests,<br style=\"\">  \t  Susie &amp; Sandor  </p>", 
    "end_date": null, 
    "title": "The Ultimate Weight Loss & Health Improvement Training", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Susie Phillips", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394262_c8ca_4.jpg", 
    "course_url": "https://www.udemy.com/ultimate-weight-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T20:05:46Z"
}