{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p class=\"p1\"><p>The 10 Minute Invigorator Course is  your <strong style=\"\">quick routine for a high-energy day</strong>. The number one benefit of this  course is Boosting Energy for your natural  productivity on emotional, physical, mental and creative levels and you can get  to this benefit in only 10 minutes a day!&nbsp;</p>    <p>This course shows you How to Increase Energy by switching off your  fatigue and change midday slumps with invigoration to productive afternoons.  You learn to do all of this with natural and efficient techniques. Natural  because all you need is your body to create the movements and the breathing  techniques that I show you step-by-step, and efficient because it only takes <em style=\"\">10  minutes a day</em> and you can do them <em style=\"\">anywhere, </em>at home or on the road  or in a hotel or at a friend&#039;s house.</p>    <p><em style=\"\">Just imagine, what would it feel  like to have <strong style=\"\">more energy</strong> through the day?</em></p>    <p><em style=\"\">How would it feel NOT to have to <strong style=\"\">fight  that annoying fatigue</strong> when you have so much to do?</em></p>    <p>In this Boosting Energy  course I will teach you how to wake up your  natural energy (because you have more energy than you are using right now) and  then how to end your fatigue. Did you know your own energy goes dormant and  then is wasted if you don&#039;t know how to access it? You learn how to reverse  that process in this course.</p>    <p>Here are the <strong style=\"\">Top 8 Benefits</strong>&nbsp;of  the 10 Minute Daily Invigorator routines according to initial user  testimonials:</p>    <p>1. <strong style=\"\">Evening Energy Boost Power:</strong>  You will get through your day with a constant and natural source of energy and  still have enough oomf to tackle your personal projects in the evenings.</p>    <p>2. <strong style=\"\">Clarity to Solve Problems:</strong>  Your mind will buzz with new ideas and you will solve your problems and  overcome roadblocks much better with a new sense of clarity.</p>    <p>3. <strong style=\"\">Single-minded Focus for  Productivity:</strong> You will be able to focus more intently on a single task at a  time, which ultimately makes you far more productive. Goodbye multitasking!</p>    <p>4. <strong style=\"\">Higher Efficiency and Time  Saving:</strong> When you are focused with clarity of mind, you become more  efficient. You start to take control of your time. You avoid distractions. You  accomplish more in less time with a happier state of mind and body.</p>    <p>5. <strong style=\"\">Pleasant Around Your Family:</strong>  You will be less stressed, less impatient, and less tense around your family  and friends when you feel more energized and relaxed in your body. Everyone  benefits from this one!</p>    <p>6. <strong style=\"\">Natural Interest in Healthy  Eating:</strong> When your body feels energized and invigorated, it starts to <em style=\"\">crave  healthy food</em> without you forcing it into anything; your body just pulls you  into a healthier direction.</p>    <p>7. <strong style=\"\">Boost in Creativity:</strong>&nbsp;When  you do the breathing exercises, they clear your mind of worry and stress and  other roadblocks. When you are able to open those pathways, your creativity  starts to flow. Ideas will come to you even during the 10 minute routine as you  fill your body with energy and breath.</p>    <p>8. <strong style=\"\">Deep Sense of Happiness:</strong>  Your body awakens its own natural energy with these unique routines and you  feel in balance and harmony with everything around you.</p>    <p>The 10 minute Invigorator on How to Increase Energy works as long as you are <strong style=\"\"><em style=\"\">willing</em></strong>  to give it a chance. You don&#039;t need any prior exercise or yoga or any other  experience. You don&#039;t need to be flexible or strong - yet you will get both of  those side-benefits with the program.&nbsp; </p>    <p>I made this course in such a way that <em style=\"\">anyone</em> can do it. I show  you modifications and I talk you through all the moves methodically. You are  going to have fun and increase your productivity in this unique approach to  tapping into your internal energy!</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "The 10 Minute Daily Invigorator: Less stress, more happiness", 
    "price": "30.00", 
    "instructors": "Farnoosh Brock", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22603_a2d4_5.jpg", 
    "course_url": "https://www.udemy.com/10minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-10T12:29:56Z"
}