{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t                          If you want to lead a healthier lifestyle and have more energy and motivation to do what you love then building exercise into your routine is the ultimate habit that will help you do it.  </p>  <p>  \t                          We all know we should exercise more but in our hyperconnected society it can be really, really hard to find the time and motivation. I can change this for you.  </p>  <p>  \t<em style=\"\">My mission is to show you how to build the exercise habit into your routine in a way that fits your busy lifestyle. </em>  </p>  <p>  \t                          Exercise doesn’t have to be boring or miserable hard work and you don&#039;t need to go to an expensive gym to get fit. In this course, I will teach you how to make exercise a fun, challenging adventure that feels a lot like play.  </p>  <p>  \t                          To create the habit of exercise, I guide you through how to use &quot;quantified self&quot; apps on your iPhone or Android phone — self-tracking tools that allow you to set clear goals, track your progress and create accountability systems that keep you motivated. Next, I show you how to use game mechanics (the psychology behind why video games are so addictive) to &quot;gamify&quot; the whole experience with all kinds of exciting challenges and achievements.  </p>  <p>  \t                          There is a well-research process to forming new habits that stick. In the first part of this course, I guide through the process of building your own <strong style=\"\"><em style=\"\">habit forming blueprint</em></strong>. Then, I teach you how to build the right exercise habit for your lifestyle: walking, running, biking, yoga, pilates and all kinds of workout routines you can do from the comfort of your home.  </p>  <p>  \t                          Save a fortune on a gym membership and a personal trainer by doing guided high intensity workouts at home using your smartphone, tablet or even by beaming the instructional workouts to your Apple TV or Google Chromecast.  </p>  <p>  \t                          Here&#039;s a quick summary of what you learn how to do in this course:  </p>  <p>  \t<strong style=\"\">1. Reverse of the negative effects of sitting all day.</strong> Sitting is the new smoking. Learn simple exercises you can use to increase your energy at the office, eliminate your afternoon slumps and minimize the effects of sitting all day. If you regularly sit more than 6 hours a day, these simple practices will add years to your life.  </p>  <p>  \t<strong style=\"\">2. Stay fit while traveling.</strong> When you are passing through airports, eating lots of restaurant food and staying at hotels, it is easy to fall into an unhealthy rut. I&#039;ll show you how to do high intensity workouts on the road and stay fit even when your normal routine is disrupted by travel.  </p>  <p>  \t<strong style=\"\">3. Exercise at home without any weights or equipment.</strong> Get fit at home using high intensity interval training and you won&#039;t need to buy any expensive equipment or waste your time commuting to a gym. Plus, I&#039;ll show you the new scientific research that is showing how a 10-15 minute high intensity workout at home or outside can be better for you than hours spent at the gym.  </p>  <p>  \t<strong style=\"\">4. Hack the process of building the exercise habit.</strong> I&#039;ll walk you through a holistic process of habit formation based on the latest psychology and cognitive science research into how we form new habits in our brains.  </p>  <p>  \t<strong style=\"\">5. Employ the power of exercise gamification. </strong>Apply the game mechanics that make people addicted to video games and make exercise a rewarding adventure full of small wins, challenges, achievement milestones and rapid feedback on how you are improving.  </p>  <p>  \t<strong style=\"\">6. And most importantly, you will learn how to make exercise fun! </strong>I will show you all kinds of different ways that will work for you to make walking, running, biking, working out and just being outside in general both great exercise and even greater fun!  </p>  <p>  \t                                  Take the next step by joining me in this course and start enjoying all the health and productivity benefits you will gain when you start building the exercise habit.  </p>", 
    "end_date": null, 
    "title": "The World Is Your Gym: How To Build The Exercise Habit", 
    "price": "30.00", 
    "instructors": "Kyle Pearce", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399786_e760_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-the-exercise-habit/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T05:33:03Z"
}