{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>I’m excited to share a new cutting edge thought process when it comes to health that I think all of you can relate to. Thrive is a collaboration of movement and nutrition, and was created to help educate people on the idea that you can’t heal nutrition without movement and you can’t heal movement without addressing nutrition. </p><p>If you have experienced chronic low back pain, or have stretched and mobilized but cant seem to get more mobility in your joints, there maybe more this equation then you may realize. Or maybe you’ve cleaned up your diet but still can’t seem to lose the weight that you want? Or your digestion is still fighting you and making you feel uncomfortable? Did you know that part of your general health and most of your immunity starts in your gut? And that things like poor diet, breathing, sleep, stress &amp; disease can cause your gut to not function properly? </p><p>As a physical therapist, I have interacted with a variety of patients from Moms, Dads to high level athletes and regardless of your lifestyle, this information can potentially change the way you feel every single day. The best part about this? I’m going to teach you how to get your guts moving in the comfort of your own home. Brief videos will introduce you to why you need to have mobile guts, how to get your guts moving better and ways to limit irritation to your gut. I have also added in resources to help you learn and further your learning in areas that may be out of my scope of practice as a physical therapist. My hope is that you finish this course with the knowledge and application to take your life to the next level. And share with the people you love!</p>", 
    "end_date": null, 
    "title": "Thrive with Gut Mobility", 
    "price": "20.00", 
    "instructors": "Dr. Missy Albrecht DPT, CSCS", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612052_495c_2.jpg", 
    "course_url": "https://www.udemy.com/thrive-with-gut-mobility/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T19:47:05Z"
}