{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\t   This course is about the basic movements that will strengthen and develop the muscles of the legs. The program is mostly comprised of video lectures demonstrating the movements and often discuss the muscles in action. In addition, the course is backed up with text documents and motivational pictures to facilitate learning and comprehension. As a bonus, at the conclusion, each student will receive a full workout program with beginner, intermediate,and advanced levels.\r\n</p>\r\n<p>\r\n\t By learning 4 sections per week, the student can expect to finish the learning stage of the course in three weeks. In can take more or less time, depending on the motivation of the student. The real life application of the course (last two sections) can be ongoing.\r\n</p>\r\n<p>\r\n\t   The course is structured with an introduction video at the beginning of each segment. Following the video lecture, comes a text document describing the key points, and finally the segment concludes with a series of video lectures showcasing the variations of the exercise. Each student will be asked to demonstrate the basic technique at the end of each section.\r\n</p>\r\n<p>\r\n\t   Any student interested in learning how to increase their muscular strength, definition, and performance should take this course. This program will show them how to improve their fitness and provide them with plenty of motivation and entertainment.\r\n</p>", 
    "end_date": null, 
    "title": "Top Secrets for Ripped and Athletic Legs", 
    "price": "20.00", 
    "instructors": "Beyond Fitness Media Media, LLC, Jeanette Ortega", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/132482_ef7e_4.jpg", 
    "course_url": "https://www.udemy.com/top-secrets-for-ripped-and-athletic-legs/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-11T21:29:06Z"
}