{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul><li>Hello,</li></ul><p>I am so excited to share with you these amazing techniques on strengthening your core all the way around the body.  My goal is to help as meany people with these movements and principles and to help YOU have a super strong core from the inside out. </p><p> We are not just working \"abs\", this is a total body core strength course that will change the way you see your core and the way you workout.</p><p>You can expect to get results very quickly (2-4 weeks depending on the frequency of your core workouts) following the protocols and demos in the video.  Using these techniques I have helped hundreds of clients get stronger in their core all around, improve posture, reduce or eliminate back pain, and increase proper posture and quality of life.</p><p>I have used these techniques with student athletes all the way up to 80 plus year young clients.  If you are looking for movements that create stability, strength and a better quality of life, you have found it. </p><p>This is NOT a \"lose weight quick\" or \"Get a 6-pack in 6 days\" program.  We are taking you through a very thorough program to build core strength from the inside out so you can live your life to the maximum and be as injury free as possibly in all your daily activities.  Each workout can be added to our current routine or if you are just getting started use it as a stand alone workout.<br></p><p>This course is perfect to build a foundation starting from scratch and informative and challenging enough for verteran gym goers.  Every client I have worked with using these movements and techniques has improved their workouts, running, posture, has had a reduction in joint, back, and knee pain, or if they were just getting started, build a super stable foundation for future goals such as losing weight, building more muscle, or even starting to compete for events such as running marathons.  </p><p>The movements are very basic and easy enough for anyone to learn and do.  We have made the videos as user friendly and professional as we can so getting going is simple yet effective.<br></p><p>I look forward to sharing this course with you and hearing how it has improved your life.</p>", 
    "end_date": null, 
    "title": "Ultimate Core Strength Made Easy", 
    "price": "45.00", 
    "instructors": "Noah Krisch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695936_997a.jpg", 
    "course_url": "https://www.udemy.com/ultimate-core-strength-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T21:48:13Z"
}