{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t <strong style=\"\">Course Description</strong>  </p>  <p style=\"\">  \t           This Vertical Jump Training Course will provide you with all of the information needed to add inches to your vertical in weeks. With 18 lectures from a division 1 basketball athlete, this program breaks down the concepts, nutrition, and workout schedule that is essential for any player, coach, or trainer looking to take their athleticism to the next level.  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">What this course includes</strong>  </p>  <ul style=\"\">  \t<li style=\"\">A 12-week program breaking down concepts, plyometric workouts, strength workouts, nutrition, and schedule</li>  \t<li style=\"\">Adds 8 to 12 inches to your vertical</li>  \t<li style=\"\">Training from former Division 1 basketball player</li>  \t<li style=\"\">Available 24-hours a day, 7 days a week on your PC, tablet, or mobile device.</li>  </ul>  <p style=\"\">  \t           Over 15 lectures analyzing every aspect of vertical training, this course takes you day-to-day through what it takes to become a more athletic and explosive athlete.  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">What to expect</strong>  </p>  <p style=\"\">  \t           This course begins with a detailed explanation of why it is that some people are able to jump higher than others and how anyone, if they train the correct way, is able to increase their vertical.  After the introduction and breakdown of concepts, we get right into it and talk about the necessary exercises; analyzing each individual workout. Although the weight room is very important for seeing increases in your vertical, we will discuss how nutrition is equally important and I will introduce you to several crucial supplements including my personal opinion of which ones are necessary.  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Is This Course For You?</strong>  </p>  <p style=\"\">  \t        This course is intended for any athlete, trainer, or coach who wants to apply or share the knowledge of vertical jump training.  Having a high vertical and being explosive is crucial for sports like basketball, volleyball, football, baseball, track, and soccer.  If you are looking to improve your jumping ability, speed, or quickness then this course is for you.  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\">What You Will Gain From This Course</strong>  </p>  <p style=\"\">  \t          It is not a coincidence that the highest jumpers are also the fastest sprinters.  Jumping high and running fast go hand-in-hand and have very similar training styles.  Upon completing this course, following the routines and training regiment of the program, understanding the techniques and concepts of vertical training,  and following the nutrition guidelines and supplements, you will add 8 to 12 inches to your vertical jump and have significant gains to your speed and quickness.  Follow this course&#039;s guidelines and become a more explosive athlete BEFORE YOUR NEXT SPORT SEASON!  </p>", 
    "end_date": null, 
    "title": "Vertical Jump Training", 
    "price": "40.00", 
    "instructors": "Kaleb Marquis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/223578_16de_2.jpg", 
    "course_url": "https://www.udemy.com/vertical-jump-training/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T03:53:12Z"
}