{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong style=\"\">Do you wake up stiff, stumble your way through your morning routine before heading off to work dreery eyed? If the answer is yes then this little course could be one of the steps help you start your day with more get up and go!</strong></p><p> The fascia that interfaces the muscles allows tissues to slide over each other smoothly without sticking. However, when we are sedentary for a long period of time, such as during sleep or if we adopt the same position throughout the day (like sitting at a desk) a type of &#039;fuzz&#039; builds up in these sliding layers which makes them begin to stick.</p><p> This is the reason we often feel a little slow or achy in the mornings and need to mak<span>e a stretch. Anyone with dogs or cats will be familiar with this &#039;waking stretch&#039;. The &#039;fuzz&#039; is essentially melted by these stretches allowing the interfaces to slide smoothly.</span></p><p>With movements specially selected from the arts of Tai Chi and Chi Gung, this course will guide you through a series of exercises to remove the stiffness from your body, improve the circulation and smooth out the breathing. You will feel more alive, more free and more ready to tackle your day!</p><p>If your aren&#039;t a &#039;morning person&#039; or if you are looking to set up a morning routine that works for you then this Course can provide the exercises to help you succeed. Even Monday mornings can be fun!</p>", 
    "end_date": null, 
    "title": "Wake up! A 15 Minute Morning Routine for Daily Energy", 
    "price": "20.00", 
    "instructors": "Christopher Davis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544730_314b_3.jpg", 
    "course_url": "https://www.udemy.com/wake-up-a-morning-routine-for-daily-energy/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T10:23:40Z"
}