{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Updated JUNE 2016<br></strong></p><p>  \t<strong>*JOIN OVER 13,000 STUDENTS WHO HAVE BEEN SUCCESSFUL AT LOSING WEIGHT.</strong></p>\n\n\n\n\n\n\n\n<p><strong>Have you been struggling...</strong><br></p>\n\n\n\n\n\n\n\n<ul><li><strong>With your weight loss?</strong></li><li><strong><strong>Finding a weight loss program that works,</strong><strong> only to gain all your weight back after you quit your program?</strong></strong></li><li><strong>To lose weight and fat around your belly? hips? thighs? waist? arms?</strong></li><li>With <strong>fitting into your favorite clothes or jeans</strong> anymore?</li><li>With dramatic <strong>weight gain?</strong></li><li>With gaining muscle or building<strong> lean, fat burning muscle mass?</strong></li><li><strong>With embarrassment </strong>from <strong>being seen in your bathing suit?</strong></li><li>From low confidence and self esteem?</li><li><strong>With Sadness</strong>?</li><li><strong>Depression</strong>?</li><li>Getting <strong>winded from walking up a small flight of stairs?</strong></li></ul>\n\n\n\n\n\n\n\n<p><strong><em>So how do you lose weight and get ripped without spending THOUSANDS of dollars on... </em></strong></p>\n\n\n\n\n\n\n\n<ul><li>A gym membership $40-$149/month</li><li>Fitness classes $180-$349/month</li><li>Personal training: $60-$100/session. Typically at 2-4 sessions per week</li><li>Semi-private training: $20-$40/session. Typically at 2-4 sessions per week</li></ul>\n\n\n\n\n\n\n\n<p><strong>See how this can all start to add up? </strong>Don't get me wrong here, I believe that your health is absolutely worth it. Treating your body right with the proper diet and exercise program is not only a means of losing weight, getting a ripped physique, and showing off your six pack abs.</p>\n\n\n\n\n\n<p>Exercise and eating right can save you tens or HUNDREDS of thousands of dollars of the years on doctors appointments, physical therapists, medications, and even surgeries.</p>\n\n\n\n\n\n<p>  \t<strong>Note: </strong><em>It doesn't matter who you are, how old you are, or what kind of shape you are in. I've trained college athletes, new </em>moms,<em> 72+ year old grandmothers, and people who have never worked out in their lives. </em></p>\n\n\n\n\n\n\n\n<p><em>This weight loss program has worked for <strong>every single one of them. </strong></em></p>\n\n\n\n\n\n\n\n<p><strong>They have all seen sustainable, REAL weight loss</strong>. They have all gotten <strong>in the best shape of their lives</strong> sticking to this program.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>About This Course</strong></p>\n\n\n\n\n\n\n\n<ul>  \t<li><strong>More than 21- Five star reviews</strong></li>  \t<li><strong>No previous exercise experience required</strong></li>  \t<li><strong>No previous cooking skills necessary</strong></li>  \t<li><strong>Full lifetime access</strong></li>  \t<li><strong>Free future course updates, bonus features, and new workouts. I'm continuing to add new material to the course, and you get it for FREE.</strong></li>  </ul>\n\n\n\n\n\n\n\n<p>  \t                            By enrolling in this course, you can start losing weight with techniques that you can apply <strong>right now!</strong></p>\n\n\n\n\n\n\n\n<p><strong>You'll Learn...</strong></p>\n\n\n\n\n\n\n\n<ul><li>Why<strong> popular diet and exercise programs </strong><strong>DON'T WORK for lasting weight loss.</strong></li><li>Exactly what you have been doing <strong>that is</strong><strong> wrecking your body, and ruining your weight loss.</strong></li><li>What you need to be <strong>eating to see real weight loss and transform your body</strong><strong>.</strong></li><li><strong>Simple </strong><strong>tricks</strong> you can use every day to master your weight loss and trim inches off of your waist line<strong>.</strong></li><li>How to<strong> put your weigh loss into overdrive, and burn more calories from fat</strong><strong> than you would on other weight loss programs.</strong></li><li>Why strength training and<strong> building muscle is ideal for weight loss. </strong></li><li>Why weight loss is better when you STOP counting calories<strong>.</strong></li><li>How to make<strong> 5 star quality meals IN MINUTES</strong>, that will enhance your weight loss.<strong></strong></li><li>How <strong>cheating on your diet is GREAT for weight loss.</strong></li><li>How you can<strong> see incredible weight loss results by working out at home</strong></li><li>Why <strong>spending less time working out (80% less), is better for weight loss and building muscle.</strong></li><li>Different<strong> time-saving exercise routines</strong> that can help <strong>you build muscle lose weight</strong></li></ul>\n\n\n\n\n\n\n\n<p><strong>And so much more...</strong></p>\n\n\n\n\n\n\n\n<p>  \t                            When<strong> I was nearly 50 pounds overweight</strong>, I knew I needed to change, but I had no idea where to start. <strong>I'm sure you're feeling the same way right now.</strong> </p>\n\n\n\n\n\n\n\n<p>The joke that<strong> the average person loses hundreds of pounds over the course of their life</strong> is completely true. <strong>Most of you have gone on diets before</strong>, lost weight, got burnt out, started binge eating, <strong>and gained back all of your weight and more.</strong></p>\n\n\n\n\n\n\n\n<p>  \t                            This endless cycle <strong>will destroy your health, and prevent you losing weight that you have been struggling with. </strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                            By the end of this course you'll have <strong>everything you need to lose weight</strong> and<strong> build muscle </strong>in your legs, arms, and stomach. <strong>You will know exactly how to lose weight</strong>, <strong>keep it off forever,</strong> and <strong>melt</strong> all of that <strong>stubborn body fat</strong> you have been hanging onto for years.</p>\n\n\n\n\n\n\n\n<p>  \t                            I've made some of my most <strong>important lectures on how to lose weight available for FREE preview</strong> so you know exactly what you are getting.</p>\n\n\n\n\n\n\n\n<p><strong>*Get These Added Bonuses When you Sign Up Today</strong></p>\n\n\n\n\n\n\n\n<ul><li><strong>How to Effortlessly Make 5 Star Quality Meals to lose weight</strong></li><li><strong>The 7 Factors of Fat Loss Downloadable E-book</strong></li><li><strong>Stepping up Your Game with The Fat Loss Food Guide</strong></li><li><strong>Bonus Weight Loss Workout: The Total Body Burpee Clincher</strong></li></ul>\n\n\n\n\n\n\n\n<p>  \t<strong>One note in closing...</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                            *Every minute you hesitate to start a diet and exercise program, you are stepping further, and further away from the body you deserve. <strong>The body you've always wanted. </strong>The reality is, <strong>you are much closer now than you even know.</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                            <strong>There is a better way to lose weight and body fat</strong> than what you've seen on the infomercials and in magazines. If you are looking at this course right now,<strong> you know something needs to change in your life. </strong></p>\n\n\n\n\n\n\n\n<p><em><strong>*Please, don't put your health off any longer. </strong></em><strong><em>Start to lose weight now, and potentially change your life forever...</em></strong></p>\n\n\n\n\n\n\n\n<p>This course is going to give you everything that you need to<strong> lose weight and keep it off FOR LIFE. </strong></p>\n\n\n\n\n\n\n\n<p><strong>Think about this:</strong> For the price of this course you would ONLY be able to <strong>afford 4 personal training sessions</strong> with me, and then they would be gone. *That doesn't include t<strong>he hundreds of dollars you would spend</strong> on a gym membership, nutrition consulting, and group classes.</p>\n\n\n\n\n\n\n\n<p>  \t                            Remember that this is a risk free way to make that change. If you aren't happy in 30 days, <strong>you have a 100% Money Back Guarantee. </strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                            Click <strong>\"take this course\" </strong>and <strong>lose weight while building the body of your dreams now.</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                            I can't wait to see and hear about your results.  </p>\n\n\n\n\n\n\n\n<p>  \t                            See you soon!  </p>\n\n\n\n\n\n\n\n<p>  \t                            -Jack W.  </p>", 
    "end_date": null, 
    "title": "Weight Loss Mastery: Weight Loss the way it should be", 
    "price": "40.00", 
    "instructors": "Jack Wilson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/78284_1716_8.jpg", 
    "course_url": "https://www.udemy.com/lose-fat-and-keep-it-off/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-14T00:09:03Z"
}