{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \tAre you looking at making the switch?  </p>  <p style=\"\">  \tThis course is a step-by-step guide to helping you finally make that change and get in the best shape of your life. This course is ideal for somebody that is looking to: lose some extra body fat, gain a little lean muscle, and improve energy levels as well as overall health.  </p>  <p style=\"\">  \tMaybe there has been something holding you back so far? Time? Motivation? Finances?  </p>  <p style=\"\">  \tI am here to tell you it doesn&#039;t have to be that way. I will be there with you every step of the way to help you achieve a body you truly feel proud of. Whether you are new to health and fitness, or are a seasoned veteran that is looking for that extra &quot;push&quot;.  </p>  <p style=\"\">  \tIncluded in the program: nutrition guides, recipes, instructional videos, workout videos, workout manuals, and - if there is enough interest - a closed Facebook group for interaction with me and other Udemy members taking the course.  </p>  <p style=\"\">  \tAll the workouts are held in the comfort of your own home, on your own time, with minimal time commitment. In as little as 15-20 minutes a few times a week, you will start to see some serious improvements in your level of health and fitness.  </p>  <p style=\"\">  \tWith a few minor changes we will be making week to week, you will certainly get some serious results. And be warned, this course will only work if YOU are willing to put in a little effort. It is one thing to sign up for a course, it is quite another thing to do it. With me as your virtual personal trainer, I will make it my mission to see you succeed if you are willing to at least try.  </p>  <p style=\"\">  \tYou will start with the &quot;documents&quot;, move on to the &quot;instructional videos&quot;, and then it is on to the workouts. In an ideal situation, I would like you to complete &quot;Workout 1&quot; three times a week followed by &quot;Workout 2&quot; during the same session. However, I am flexible. I want to make this part of your lifestyle. Whatever you find works for you, I am open!  </p>  <p style=\"\">  \tFinally this is lifestyle choice, and you can decide how fast or slow you want to take it. Ideally, a few times a week is all you need. The same goes for maintaining your results. There will be new courses updated on a regular basis to give you enough variety and options to keep you motivated to come back for more.  </p>  <p style=\"\">  \tI want to set you up with an achievable amount of fat loss while gaining some lean muscle, and make it part of your lifestyle.  </p>", 
    "end_date": null, 
    "title": "Weight Loss Made Easy- Exercise - Kettlebells - Fat Burn Fun", 
    "price": "20.00", 
    "instructors": "Brandon Crowe", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236626_7bd6_5.jpg", 
    "course_url": "https://www.udemy.com/weight-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-03T19:53:08Z"
}