{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hello UDEMY Student,<br></p>  <p>Can I ask you a few questions?</p>  <ul><li>Do you <strong>struggle to gain lean muscle-mass</strong>, no matter how much you eat or how many different training routines you try?</li><li>Do you feel like you are <strong>genetically locked into “skinny-genes”</strong> that prevent you from gaining muscles?</li><li>Are you trying to lose a few stubborn pounds of extra weight <strong>but still can't no matter what diets you try?</strong></li><li>Do you want to <strong>approach the opposite sex with confidence</strong>,<strong> </strong>without anxiety, and without fear of rejection?</li><li>Do you want to <strong>catch the attention of other attractive people?</strong></li><li>Have you been <strong>bullied</strong>? Do you want to <strong>feel respected among other men</strong> when in social or business situations?</li><li>Do you lack the <strong>confidence to feel comfortable in your own skin</strong>?</li></ul>            <p><br></p><p>If you answered \"YES\" to any or all of these questions, then my new course is right for you. With my weight-lifting program you’ll have all the tools and knowledge you need to transform your life:</p>  <ul><li><strong>Gain 10-30 pounds of bulging muscle</strong></li><li>Build a physique that<strong> gives you confidence </strong>and<strong> gets respect</strong> at the beach, club or boardroom</li><li>Appear <strong>attractive</strong> in the eyes of the others</li><li>Feel <strong>healthy</strong><strong> and happy</strong> when you look at yourself in the mirror.</li></ul>        <p><br></p>  <p>When you register for this course, you will get the complete blueprint to <strong>break through your genetic limitations</strong> and transform your body into a walking Greek statue.</p>              <p>Enroll in this life-changing course today, completely risk-free. You can rest easy knowing that I offer:</p>  <ul><li>A <strong>30-day money back guarantee. </strong>That’s a<strong> 100% full refund with no questions asked.</strong></li><li>Once enrolled, you have <strong>unlimited, lifetime access to the course.</strong></li><li>You will have <strong>instant and FREE </strong>access to ANY and ALL updates added to the course.</li><li>I will give you <strong>my full support</strong> regarding any issues or suggestions related to the course.</li><li>Check out the curriculum and FREE lectures for a course preview.</li></ul>          <p><strong><u><br></u></strong></p><p><strong><u>What Makes This Course Different From All The Others?</u></strong></p>  <p>The truth is, I’ve been in the fitness and wellness industry pretty much my whole life (from age 14-36). It’s not something I do part-time to pay the bills - <strong>no, it’s part of my core identity and an essential part of my lifestyle. I live, breathe and sleep what I preach 24/7.</strong></p>  <p>If nothing else, look at the current pictures of my physical condition<strong> (YouTube channel, Instagram feed, Facebook page, Blog)</strong> and you will see “the proof is in the pudding”. The idea for this course came to me this past August, when<strong> I turned 36 years of age. </strong>People are always shocked to hear that - but I credit it to my active lifestyle and clean diet.</p>  <p>How many other instructors are living in Thailand training 5-days a week? None, they all have a full-time job they're juggling and UDEMY is only a side-job for them.</p>  <p>With my course, you are going to get <strong>results-driven knowledge direct from me on how to attain the best possible physique for you</strong>. I’ll walk you step-by-step on each part of this <strong>life-transforming journey. </strong>By the end, you’ll look and feel different and have all the tools necessary to keep doing it by yourself.</p>  <p><strong><u><br></u></strong></p><p><strong><u>Don’t Wait Another Day to Get in the Best Shape of Your Life!</u></strong></p>  <p>Every moment wasted is one step further away from achieving the ideal physique that you deserve.</p>  <p>You could try one of those other free courses on UDEMY, but they are just <strong>generic lifting instructions</strong> that you could find anywhere else. In the end they are just trying to sell you on another paid course that they created. <strong>Don’t waste your precious time.</strong></p>  <p><strong>Click \"Take this course\" to </strong>take the first step to forever changing your body, mindset and life. I’m grateful for this opportunity to help you achieve your fitness goals, and I’m excited to watch your progress. See you inside.</p>  <p>-Chris</p>", 
    "end_date": null, 
    "title": "Weight Lifting, Training & Nutrition - Get Ripped, Lose Fat", 
    "price": "50.00", 
    "instructors": "Christopher Chiu", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648618_3d21_12.jpg", 
    "course_url": "https://www.udemy.com/weight-lifting-gain-muscle-confidence-get-ripped-lose-fat-gym-workout/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T07:04:31Z"
}