{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Добро пожаловать в \"Акупрессуру для фитнеса и спорта\" - лучшее место на Udemy, чтобы узнать об акупрессурных точках, отвечающих за спортивные показатели и красоту!</p><p><br></p><p>√ Улучшите ваши спортивные показатели и свою красоту самостоятельно и без использования медикаментов, при помощи традиционных китайских точек для массаж</p><p><span></span>√ Находите нужные точки легко, используя простые и профессиональные видеозаписи в формате Full HD</p><p><span></span>√ Курс изучает точки для улучшения показателей в спорте и фитнесе, включая занятия йогой.</p><p><span></span>√ Курс изучает точки для устранения морщин.</p><p><span></span>√ Курс изучает точки для отказа от курения.</p><p><span></span>√ Курс изучает точки для борьбы с повседневными заболеваниями.</p><p><span></span>√ Курс изучает точки для релаксации.</p><p><span></span>√ Курс изучает точки, отвечающие за женское здоровье.</p><p><br></p><p><span></span>\"В двух словах, она [Акупрессура] обеспечивает максимальную пользу без риска возникновения побочных эффектов, свойственных многим подходам классической медицины.\" </p><p><span></span>-Уильям Майкл Каргайл, бакалавр наук, доктор хиропрактики, F.I.A.C.A., Председатель отдела исследований Американской ассоциации акупунктуры и восточной медицины</p><p><br></p><p><span></span>Акупрессура - это прекрасно подходящий для Вас метод лечения. Используйте его при помощи данного курса. Тогда:</p><p><span></span>+ Вам больше не понадобятся требующие много времени визиты к врачу.</p><p><span></span>+ Не понадобятся ощутимые денежные затраты.</p><p><span></span>+ Отпадёт опасность внесения инфекции, повреждений тела или болей.</p><p><span></span>+ Вы мягко массируете точки пальцем руки. </p><p><br></p><p><span></span>Предлагаемые точки массажа:</p><p><span></span>+ Особенно эффективны</p><p><span></span>+ Находятся легко и без посторонней помощи</p><p><span></span>+ Представлены в профессиональных и высококачественных Full HD видеоклипов</p><p><br></p><p><span></span>\"Благодаря курсу я смогла значительно улучшить общие показатели в спорте и фитнесе, и избавилась от морщинок. Благодаря видео, поиск точек не составляет большого труда. Я счастлив, что курс всегда со мной, на моем iPhone и iPad\"</p><p><span></span>-Дженни, Менеджер в компании BMW, Германия</p><p><br></p><p><span></span>Тысячи людей уже используют этот курс. Теперь Вы тоже можете им воспользоваться и помочь себе без медикаментов и визитов к врачу.</p><p><br></p><p><span></span>За малую долю цены одного визита к врачу, вы навсегда получаете проверенный опытом и временем курс акупрессуры, с бесплатными обновлениями, которые будут содержать новые массажные точки. </p><p><br></p><p><span></span>Проводите время весело, изучая курс! ПРИСОЕДИНЯЙТЕСЬ ПРЯМО СЕЙЧАС!</p><p><br></p><p><span></span>Ваш доктор Баргак</p><p><span></span>- 30 лет успешной практики в акупрессуре</p><p><br></p><p><span></span>У вас есть вопросы? Не стесняйтесь писать мне в Facebook - просто введите Dr. Bargak в поисковую строку</p>", 
    "end_date": null, 
    "title": "Акупрессура для фитнеса и красоты - естественная красота", 
    "price": "20.00", 
    "instructors": "Dr. Jakob Bargak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527226_88a3.jpg", 
    "course_url": "https://www.udemy.com/acupressure-fitness-beauty-chinese-massage-tcm-russian/", 
    "currency": "USD", 
    "subject_name": [
        "Fitness"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T04:25:33Z"
}