{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><strong class=\"redactor-inline-converted\">There is one misspelled word in this description. Bet you can't find it! (no one has yet).  Shoot me a message if you think you've found it.</strong></li><li><strong class=\"redactor-inline-converted\">Please check out the video above.</strong></li></ul>\n\n<p>  \t                                                        Here's <strong class=\"redactor-inline-converted\">what students are saying</strong> about 2-Hour Digital Products:  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>The course was more than I thought it was going to be and an unbeatable value for the price - thanks so much, Matt! I was stuck because I just didn't know where to start, but now I have a much better understanding of what options are realistic for a beginner. Next step is to take action!</em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>      \"[Matt] makes this course very easy to understand and not intimidating. Anyone can do this, it just takes a little time and effort on your part and [Matt] gives you all the steps to make it happen and allow you to bring in some more income! I can't wait to implement these steps!!!\"</em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tNo fluff. No filler. What this course does have is a simple, step-by-step process for creating an <strong class=\"redactor-inline-converted\">extremely profitable digital product</strong>.  You'll learn how to:  </p>\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>Generate <strong class=\"redactor-inline-converted\">multiple, profitable niche ideas</strong></li>  \t<li>Create nearly any type of digital product</li>  \t<li>Figure out your demand before you even create it</li>  \t<li><strong class=\"redactor-inline-converted\">Create a viral name</strong> and USP for your product</li>  \t<li>Determine <strong class=\"redactor-inline-converted\">the optimal price</strong> <strong class=\"redactor-inline-converted\">for maximum demand</strong></li>  \t<li><strong class=\"redactor-inline-converted\">Establish expertise</strong> and authority in six weeks</li>  \t<li>Test the idea to save you time and money</li>  \t<li>Build hype and <strong class=\"redactor-inline-converted\">an audience that begs for your product</strong></li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                  In addition, you'll receive <strong>$175 worth</strong> of Google/Bing and Facebook advertising credits, a list of more than <strong class=\"redactor-inline-converted\">2,000 niche ideas </strong>and a great interview with Tony Robbins on selling digital products.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                    Did you know that only 10% of people complete a Udemy course?  Most people don't have the time or patience to sit around and listen to somebody for six hours.  And I don't want you to.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                    That's why I've spent dozens of hours condensing the material into two hours of <strong class=\"redactor-inline-converted\">actionable</strong>, <strong class=\"redactor-inline-converted\">easy-to-understand</strong> steps and strategies - all without any of the filler.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                    You'll learn the tools to create nearly any type of digital product - an online course, e-book, how-to video, podcast, audio book, instructional guide, digital magazine, whatever you'd like (except software).  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                    In essence, this course is a <strong class=\"redactor-inline-converted\">compilation of 100s of books, articles, videos and interviews </strong>on information/digital product development along with several original ideas and strategies.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                    To make the course easy to digest, each lesson is <strong class=\"redactor-inline-converted\">screen recorded in HD 1080p</strong> and I've included<strong class=\"redactor-inline-converted\"> transcripts and checklists </strong>in case you prefer text to audio or video. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p> These checklists are great for review but also include a link to everything you see in the videos so you can easily find anything you need.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                    I'll personally be answering any questions you have and I'll be happy to provide links, resources and <strong class=\"redactor-inline-converted\">any help I can offer you </strong>in developing your ideas. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p> I'll also be updating the course every month with new tactics and approaches to digital product development so that you're<strong class=\"redactor-inline-converted\"> always up-to-date.</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                    Let's be honest: passive income makes life a little easier.  And digital products are the best way to guarantee that peace of mind.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Click</strong> <strong class=\"redactor-inline-converted\">Take This Course</strong> at the top right of the page and start earning that passive income – for life. Every second you wait is just money lost!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Did you find the mispelled word?</p>", 
    "end_date": null, 
    "title": "2-Hour Digital Products: Learn How to Create & Sell Online", 
    "price": "25.00", 
    "instructors": "iMarket XL, Matt Jensen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/233954_604f_13.jpg", 
    "course_url": "https://www.udemy.com/2-hour-digital-products-learn-how-to-create-and-sell-online/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-30T16:09:28Z"
}