{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    What to call it?  </p>  <p style=\"\">  \t    It’s a dilemma that has many novelists, nonfiction authors and writers of children’s books gnashing their teeth.Others give their book title little thought, only to discover later that they’ve made a massive error.  </p>  <p style=\"\">  \t    “Brainstorming a Better Book Title” gives you an effective title-finding process to follow and over 150 analyzed examples that make the stakes of this search very real.Discover how to avoid titles that could cause problems for your book and learn how to identify and select your best options.  </p>  <p style=\"\">  \t    This course helps whether you’re a literary, academic or commercial writer, whether you write fiction, nonfiction or something unclassifiable and whether you’re just starting your book, in the final stages or trying to repair a title mistake.  </p>  <p style=\"\">  \t    Besides18 lessons that total more than an hour and a half of information-packed video content, you have access to full written transcripts of the lessons, online brainstorming resources and a checklist for final winnowing of your top title candidates.  </p>  <p style=\"\">  \t    Instructor Marcia Yudkin has more than 25 years of publishing experience, including several books with major New York publishers, self-published works, coaching of new academic, self-help and business authors, and more than a decade as an on-call editor for a small press.She now heads a naming firm, Named At Last, that helps entrepreneurs come up with appealing and appropriate names for companies, products and books.  </p>  <p style=\"\">  \t    Here is some of what you’ll absorb as you go through the course:  </p>  <p style=\"\">  \t    * How and why to come up with a set of criteria for your title<br style=\"\">  \t    * The three components of a book title, one mandatory and two optional, and how they play out in both fiction and nonfiction<br style=\"\">  \t    * Can you protect a book title? The main answer and some important exceptions<br style=\"\">  \t    * Why fashionable naming tools like crowdsourcing and contests can badly steer you wrong<br style=\"\">  \t    * Step by step, how to brainstorm loads of word and phrase options for your book title<br style=\"\">  \t    * Creative sources of title ideas besides looking up and listing words<br style=\"\">  \t    * A wide variety of title patterns to consider for fiction, nonfiction and book series<br style=\"\">  \t    * The top six factors to consider in rejecting or embracing title candidates<br style=\"\">  \t    * The original and final titles of fifteen well-known books, illustrating principles discussed in the course<br style=\"\">  \t    * What not to do after you choose the title you plan to use  </p>  <p style=\"\">  \t    Since you enjoy lifetime access to this course once you enroll, you get warnings, procedures, methods and resources you can revisit many times as your publishing career develops.Sign up now to get your book on track with an exciting, fitting title.  </p>", 
    "end_date": null, 
    "title": "Brainstorming a Better Book Title", 
    "price": "35.00", 
    "instructors": "Marcia Yudkin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256410_b21b_4.jpg", 
    "course_url": "https://www.udemy.com/book-title/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-06T10:09:05Z"
}