{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">I created <strong style=\"\"><em style=\"\">How to Make $42,000 With One Simple EBook </em></strong><em style=\"\"> </em>When I saw how many people were dealing with not knowing where to start making money online. And judging by all the feedback I've already gotten, I'm quite confident it<strong style=\"\"> can help YOU too</strong>.</p><p style=\"\">I have created a system that can take you step by step to your first online income no matter if you are a total beginner or you are a professional internet marketer.</p><p style=\"\">The number people generating from a product creation are crazy and you can easily can be a part of this online business cake so if you are interested to make your own online business and create digital products that sell fast and easy thiscourse is absolutely for you.   You see, I've created this so that you can make some serious cash... FAST.   You'll discover:</p> <ul style=\"\"><li style=\"\"><strong style=\"\">The exact methods I used to generate $42,000 in online sales.</strong></li><li style=\"\"><strong style=\"\">I'll show you my step-by-step methods for finding the hottest selling niches. </strong></li><li style=\"\"><strong style=\"\">I'll show you every single resource I used to create simple products.</strong></li><li style=\"\"><strong style=\"\">How simple it really is to become an authority in any niche.</strong></li><li style=\"\"><strong style=\"\">Hot simple it is to create your digital product – whether it be an EBook, Video, Software App, Service, etc.</strong></li><li style=\"\"><strong style=\"\">Where to go to find FREE resources to create your products.</strong></li><li style=\"\"><strong style=\"\">How to market your digital products quickly and easily.</strong></li><li style=\"\"><strong style=\"\">How to generate a stampede of traffic to your products.</strong></li></ul> <p style=\"\">And although this sounds like your investment is going to be tons of money... <strong style=\"\">it won't.</strong> </p><p style=\"\">So act fast and start generate online income right away.</p>", 
    "end_date": null, 
    "title": "Create and Publish Your Own Digital Products Online", 
    "price": "20.00", 
    "instructors": "Elnur Aliev", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529432_c78c_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-42000-with-one-simple-ebook/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T12:51:45Z"
}