{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course I walk you through how I took a simple idea, turned it into a short eBook and then <strong>promoted the eBook to make over $1000</strong><strong>.</strong></p><p>It all starts with finding one simple niche idea that you can discuss that will help other people.</p><p>Most people have knowledge of a specific topic or skill that they could teach to someone else. Most people are willing to pay for this type of knowledge.</p><p><strong>So why not create your own short eBook and sell that knowledge to others?</strong></p><p>I'm going to walk you through everything I did to create my simple eBook, get it launched and then show you how I continued to make sales from it over a long period of time. </p><p>I even share with you the exact eBook I used, that only took me just a few days to write based off of a very simple idea. </p><p><strong>Here is what I cover in this course:</strong></p><ul><li>Coming up with a niche idea for your eBook</li><li>Creating your eBook - Using a simple tool to build a professional looking eBook</li><li>Building a sales page for your eBook</li><li>Creating a sales funnel to collect leads and upsell other products</li><li>I explain the various payment processors you can use for selling your eBook</li><li>How to Promote your eBook through forums, affiliate marketing and more</li></ul>", 
    "end_date": null, 
    "title": "eBook Product Launch: A Step-by-Step Guide for Beginners", 
    "price": "20.00", 
    "instructors": "John Shea", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721068_3cff_2.jpg", 
    "course_url": "https://www.udemy.com/ebook-product-launch-a-step-by-step-guide-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T18:35:41Z"
}