{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I have been selling on Fiverr for over 2 years now and haven&#039;t always been successful. In the beginning I tried many hit and miss methods of trying to pick a gig that would sell, but I fell short. You don&#039;t have to take the road of disappointment I had taken because I have been there and found a way to earn money from Fiverr. Here is what the course is going to cover to help you succeed.</p><ul style=\"\"><li>I walk you through the Fiverr website and show you how to navigate the site.</li><li>I give you about 8 different gigs that sell well on Fiverr and training on how to do these gigs.</li><li>I supply you with some templates to use for a few of these gigs.</li><li>You&#039;ll get a guide on some resources of tools to get to create other gigs.</li><li>You will gain knowledge at the end of this course to scout out more gigs to offer.</li><li>The course is broken down in small videos so your attention span don&#039;t wear out.</li><li>You can complete this course within around 2 hours if you go through it.</li></ul><p>This course is structured beginning with the introduction and then showing you in a separate video each gig I recommend and how to do it. You will be able to run a serious business online with Fiverr once you complete this course.</p><p>You should take this course if you have been looking for legitimate ways to make extra money online. There are thousands of people needing things done for them and Fiverr is the place they come for this.</p><p>Don&#039;t put off your dreams any longer and let Fiverr work for you, and it will if you apply what I teach you in my course. This course will help get your wheels turning to come up with new services to sell on Fiverr and you can use the many gigs I give you to start earning money right now.</p>", 
    "end_date": null, 
    "title": "Fiverr Domination", 
    "price": "20.00", 
    "instructors": "Bryant Dodd", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564896_667b_2.jpg", 
    "course_url": "https://www.udemy.com/fiverr-domination/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T06:19:46Z"
}