{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>We all know that the World is our marketplace. Unlike a &#039;Brick &amp; Mortar&#039; business which typically has a limited geographic market to serve, the Internet allows us the opportunity to sell out information products to every singly person on the planet. And the great thing is that the there is no inventory to stock. The buyer simply downloads the material to his or her hardware. And that&#039;s it!</p><p>This course, which consists of 7 &#039;no-frills&#039; videos (plus a Bonus Video) takes you step by step on how and why you need to create Information Based Products to make money on the internet. </p><p>I will show you how to research what you should sell and how and where to find relevant information. I explain why people are always looking for help and how you can satisfy their needs. I also go into some detail on researching Public Domain Material to get as much information as you want. This is a &#039;sleeping giant&#039; that not many people spend time on.</p><p>Finally, you would learn how to build your content from scratch interviewing experts. These experts are all around us. I will show you how to find them and what you need to do thereafter.</p><p>Remember, this is a <strong style=\"\">basic course</strong> and much of your success depends on your ability to take <strong style=\"\">ACTION</strong>. So put all your limiting beliefs behind you and just do it! </p>", 
    "end_date": null, 
    "title": "How to Create Information Products from Scratch", 
    "price": 0, 
    "instructors": "Jerome Marquez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517564_defc_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-information-products-from-scratch/", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T23:24:46Z"
}