{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will teach you the difference between a freebie seeker email list, and a buyers email list. You will learn why it is important to have a buyers list, and how building a freebie list is still important. When it comes to getting sales you will definitely want to build a buyers list of people that are eager to pull out their credit card to buy from you.</p><p>Will also learn how pick a product to promote as an affiliate and choose the right keywords to rank for in the search engines so your squeeze pages will be found faster that has your optin form on it. You must be able to rank for the right keyword or you waste money on a domain.I even went a step further to show you how quick you can rank a video on the first page of the search engines.</p><p> You will learn free methods and paid methods of building your buyers email list. You will also learn the free methods of building the freebie email list. We will explore free traffic methods as well as paid traffic methods, to bring people to you. I even give you a premium Wordpress theme to use for building your landing pages.</p><p>This course will be taught using video incorporated with slides, and you will get pdf handouts so you can refer back to them while you build your email lists. You will also be quizzed during the course to make sure you understand the materials being taught. You will have a lifetime access to the course and any updates that are made.</p><p>By the end of this course you will understand the difference between a freebie list and a responsive buyers list. You will be able to start making affiliate sales and sales from your own product if you have one. You will also know how to keep your email list active and subscribed to you.</p><p>We will not learn how to create a product in this course, or how to sign up as an affiliate. You should be able to go through the entire course in about 2 hours, but you can learn at your own pace. This course focuses directly on building a buyers email list and a freebie list. <br></p>", 
    "end_date": null, 
    "title": "How to Create a Buyers Email List", 
    "price": "20.00", 
    "instructors": "Bryant Dodd", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653610_69c1.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-buyers-email-list/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T16:58:19Z"
}