{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Imagine opening up your laptop, spending 15 minutes on an email, clicking send and having thousands of dollars flooding into your bank account.</p><p>With the How to Be a Copywriter (Even is You Don't Like Selling) you'll learn how to make money with your emails and more.</p><p>Check this out, I never wanted to be a copywriter.  I started my business 6 years ago and over the years I've learned the principles of sales psychology that lets me make a few thousand dollars with just a few words and a click of a button. I honestly never thought that I would ever get to be doing what I'm doing and want you to experience the same thing.</p><p>With this course you'll start to understand what your customers want.  You'll know them so well that they will literally tell you what they want to buy and all you'll have to do is put that product or service in from of them.  The is 100% serious stuff</p><p>You'll not only learn how to be a copywriter, you are going to discover the psychology of selling.  You'll see how, by just understanding a few principles, you'll be able to increase sales significantly.</p><p>I'll also be sharing templates that you can use right away to start making some amazing copy, and you'll also see expert interviews from some of the best copywriters in the world.</p><p>Last but not least, you are going to look over my should as I spend 18 minutes developing one email that generated thousands of dollars in revenue.  Would you like to be able to command thousands of dollars from a single email too?  I'll show the EXACT method how.</p><p>You deserve this. Let me teach you how to be a copywriter even if you hate selling. Click the buy button now and let's start getting paid for the words that you write.</p>", 
    "end_date": null, 
    "title": "How to Be a Copywriter (Even if You Don't Like Selling)", 
    "price": "50.00", 
    "instructors": "Dean Soto", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645466_f33e_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-copywriter-even-if-you-suck-at-selling/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T03:44:33Z"
}