{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t          Is writing a bestselling book a dream of yours? There&#039;s no better way to spread your message, help other people, earn credibility in your industry, and even earn author royalties for your efforts.  </p>  <p style=\"\">  \t          But for most people, that&#039;s where the dream ends; as they wake up to the daunting reality.  </p>  <p style=\"\">  \t          They don&#039;t know where to begin, how to publish their work, or how they can possibly get noticed in the sea of <em style=\"\">3 million</em> competing titles.  </p>  <p style=\"\">  \t          This course puts an end to the confusion and shares the <strong style=\"\">proven, systematic way to take a book from idea to Amazon bestseller.</strong>  </p>  <p style=\"\">  \t          I&#039;ve done it myself -- with a book I didn&#039;t even have any particular qualifications to write, and I&#039;m confident you can too. That title earned me <strong style=\"\">over $1400 in author royalties</strong> in its first month and continues to make sales every day!  </p>  <p style=\"\">  \t          We&#039;ll walk through step-by-step what&#039;s required to get your book to the top of the Amazon charts, starting at the ground level and working our way up.  </p>  <p style=\"\">  \t          This course is specifically for people WITHOUT an established &quot;audience&quot; in the form of a big email list or social media following.  </p>  <p style=\"\">  \t        You&#039;ll learn how to:  </p>  <ul style=\"\">  \t<li style=\"\">Research the competition to best serve your readers.</li>  \t<li style=\"\">Find the best keywords and categories for maximum exposure.</li>  \t<li style=\"\">Build buzz for your launch and recruit a team of book ambassadors.</li>  \t<li style=\"\">Create a winning cover, book description, listing page, and author page.</li>  \t<li style=\"\">&quot;Hack&quot; your book content to win in Amazon&#039;s search results and gain long-term customers.</li>  \t<li style=\"\">Professionally format your book, upload it to Amazon, and even create a paperback version (for free!).</li>  \t<li style=\"\">Price your book to optimize sales, income, and perceived value.</li>  \t<li style=\"\">Use Amazon&#039;s massive reach and internal workings to promote your book for you.</li>  \t<li style=\"\">Generate a critical mass of reader reviews.</li>  \t<li style=\"\">Leverage dozens of free promotional outlets to spread the word about your book.</li>  \t<li style=\"\">Maximize your social media reach on Facebook, LinkedIn, Twitter, and more.</li>  \t<li style=\"\">Keep the momentum of your launch going after your big promotional push.</li>  </ul>  <p style=\"\">  \t          95% of other Kindle authors don&#039;t know or don&#039;t execute on these tactics, so you&#039;ll have a huge advantage and be able to win the top positions -- and the authority and income that come with it.  </p>  <p style=\"\">  \t          Ready to begin your journey to bestseller status? Let&#039;s get started!  </p>", 
    "end_date": null, 
    "title": "Kindle Launch Plan: Publish and Market an Amazon Bestseller", 
    "price": "50.00", 
    "instructors": "Nick Loper", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317496_d625_3.jpg", 
    "course_url": "https://www.udemy.com/kindle-launch/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-10T23:17:20Z"
}