{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t  You may have a great product, but if you launch it wrong, you’re leaving money on the table.  </p>  <p style=\"\">  \t  everyday, product launches happening.  Some do enormously well and some don&#039;t make a couple dollars.<br style=\"\">  \t  You could spend months or even years to get a product developed, but if the product launch planning is done incorrectly, you won&#039;t get the results you want.  You see....my goal here is to get you to launch a good product, so you can help people, and in the end you will make the profits you want.<br style=\"\">  \t <br style=\"\">  \t   Remember...Help people get what they want, and they’ll help you get what you want.<br style=\"\">  \t <br style=\"\">  \t   Now keep in mind that this is not a get rich quick system either, and it takes hard work.  </p>  <p style=\"\">  \t  But just with any business, if you have the right plan to go by, then your chances of doing well is greater.<br style=\"\">  \t <br style=\"\">  \t   The biggest mistakes people make is launching a product without doing the proper testing and planning.  </p>  <p style=\"\">  \t<br style=\"\">  \t   Ultimately failure in the end is success if you learn from it.  With that said, you don’t have to make the same mistakes ,,,  </p>  <p style=\"\">  \t  Condition:  You must have a product and have at least a month ahead of your launch before you use this video product.  If you don’t have a product, but still want to plan ahead, go right ahead.  But I want to let you know in advance and be honest that you&#039;ll be receiving information about Product Launches.  </p>", 
    "end_date": null, 
    "title": "Learn how increase your profits Online Product Launch", 
    "price": "50.00", 
    "instructors": "Coach  Jeffrey T.E.H", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/207308_7cb9_3.jpg", 
    "course_url": "https://www.udemy.com/online-product-launch-learn-how-increase-your-profits/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-29T15:46:32Z"
}