{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>Latest update Jan 5th 2016</em></p>\n\n<p><em></em><strong>EXCLUSIVE COURSE ON UDEMY: PERFECT GIFT IDEA FOR A NERD OR A GEEK</strong><br></p>\n\n\n\n\n\n\n\n<p>  \t                                            You heard about flipping houses and stocks, but what about flipping LEGO sets? This course is unique, and will teach you how to invest in LEGO sets, and how to flip sets or Minifigures for profit. You will also learn what to look for when you are buying LEGO if you want to be a collector. </p>\n\n\n\n\n\n\n\n<p>  \t                                  Enrolling in this course will help you learn how to buy smart sets or Minifigures, when to sell, and exactly what sets you should buy to invest in the long term. I have done this for years, and the profit on a flipped LEGO set can be as high as 1000% in rare cases. </p>\n\n\n\n\n\n<p>This class will be taught mostly in keynote, screen capture and actual video.  </p>\n\n\n\n\n\n\n\n<p>Complete comprehensive guide to making money with buying &amp; selling LEGO with potential earnings over 100%! This course is constantly updated to show you latest LEGO sets to buy and invest in. Every future update of this course is at no extra fee for you. Topics covered are the following:  </p>\n\n\n\n\n\n\n\n<p><strong>*How to get sets on deep discount</strong><br></p>\n\n\n\n\n\n\n\n<p>  \t<strong>*Where to find cheap LEGO</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>*Get LEGO sets nearly for FREE!</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>*LEGO special discount page</strong>  </p>\n\n\n\n\n\n\n\n<p><strong>*Guide to listing LEGO on eBay</strong></p>\n\n\n\n\n\n\n\n<p><strong>*Which sets &amp; Minifigures to collect</strong><br></p>\n\n\n\n\n\n\n\n<p>  \t<strong>*How to flip sets buy low sell high</strong></p>\n\n\n\n\n\n\n\n<p>Plus many other LEGO secrets and tips. Overall, you will make more then the cost  of this course. Using methods taught here you should be left with many LEGO pieces and sets as well as make money.<br></p>\n\n\n\n\n\n\n\n<p><em><strong>Buy this for yourself, give this course to someone as a gift ,or share this class with a LEGO fan</strong></em></p>\n\n\n\n\n\n\n\n<p><em>Disclaimer: LEGO® is a trademark of the LEGO Group of companies which  does not sponsor, authorize or endorse this product.</em><br></p>", 
    "end_date": null, 
    "title": "Lego Investing: Complete guide to investing in Lego sets", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357854_bf1e_21.jpg", 
    "course_url": "https://www.udemy.com/legovesting/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T16:23:22Z"
}