{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t        Amazon offers self publishers a great opportunity to get their books out to the world. But publishing is just a small part of the process. Marketing is critical!  </p>  <p style=\"\">  \t    If you want to have real success in publishing your book you need to have a complete marketing plan and strategy.  </p>  <p style=\"\">  \t    This course gives you all the strategies I used to get my book to #1 in my category on Amazon.  </p>  <p style=\"\">  \t        At the end of this course you will:  </p>  <p style=\"\">  \t        -  have an overview of social media platforms and how to choose the right one to promote your book to you \"ideal audience\"  </p>  <p style=\"\">  \t        - have learned social media strategies to get engagement and sales  </p>  <p style=\"\">  \t        - understand how to build your email list and then how to use your list to promote your book on an on-going basis  </p>  <p style=\"\">  \t        - know the value of joint ventures and how  to build joint venture partnerships to promote your book (this is one of the most powerful promotion tools you can use!)  </p>  <p style=\"\">  \t        - understand the value of quality beta readers and reviewers, and how to find them  </p>  <p style=\"\">  \t        - how to best manage your launch day for maximum benefit  </p>  <p style=\"\">  \t    - have strategies for ongoing promotions.  </p>  <p style=\"\">  \t        Also included is a list of resources.  </p>", 
    "end_date": null, 
    "title": "Make Your Book Popular on Amazon Without Marketing", 
    "price": "20.00", 
    "instructors": "Wendy McClelland", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436150_98ae_2.jpg", 
    "course_url": "https://www.udemy.com/make-your-book-popular-on-amazon-without-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T03:41:03Z"
}