{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<em style=\"\">This course is fully updated for August 2015</em><p style=\"\">_______________________________________________________</p><p style=\"\">A strategy and a plan are both necessary to successfully launch a digital product  and create an income stream</p><p style=\"\">And it&#039;s essential that you do everything right in order to trump the massive competition and finish on top..</p><p style=\"\">But why do some people make millions in just a few days, but your product launch fell flat, or <strong style=\"\">even worse, you didn&#039;t take action yet </strong>?</p><p style=\"\">It&#039;s actually quite simple - there&#039;s a few simple, easy things to do .. but - and let&#039;s be honest here – Rich gurus don&#039;t seem to trip over to spill the beans about their success, do they ?</p><p style=\"\">I spent the last 6 months testing, tweaking, re-testing, improving and eventually succeeding at product launches and have now put this course together for you - to which you have full lifetime access including all the updates for free.</p><p style=\"\">See exactly as I take you by the hand, why I&#039;m so successful on JVZOO and Warriorplus, and how you can do, doing exactly what I did.</p><p style=\"\"><strong style=\"\">This course covers </strong>:(1) Creating Amazing Sales Pages &amp; JV pages -easily(2) JV attraction and finding 5 figures partners(3) Following up with email marketing, and FREE traffic generation Nothing is left out - you see everything... and my help and assistance to Udemy students is well-known</p><p style=\"\">Students of this course get full, free, instant lifetime access to my &quot; Product Launch - Setting up your automated business &quot; Udemy course, which has over x very happy students.</p><p style=\"\">Don&#039;t forget ! You are backed up by an unconditional <strong style=\"\">30 days money back guarantee</strong> -my personal promise that you will succeed.</p><p style=\"\"><strong style=\"\">So click the « Take This Course » button now and let&#039;s get started. Every minute you delay is an advantage for your competitors.</strong></p><p style=\"\">To your success,Steven Yeo</p>", 
    "end_date": null, 
    "title": "Product Launch - Setting up your automated business", 
    "price": "20.00", 
    "instructors": "Steven Yeo, Howard Lynch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572414_3c7d_2.jpg", 
    "course_url": "https://www.udemy.com/product-launch-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T13:44:00Z"
}