{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Start making money from your home by creating your own website ,and creating website for your Customers No Code is needed to build your website.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t      This is not a course like any other course you can find online. It’s not about the technical aspects of building a website ,it is about mastering the skills that you will learn during the lecture and apply it on your website.  </p>  <p style=\"\">  \t      Do you know professional website builder are paid more than 290$/hr just for creating a website. In addition, it will cost you more than $2,000 to build a simple website that contain only text and pictures. <strong style=\"\">So we can say that you can get more than $200,000 a year for just </strong><strong style=\"\">creating a websites for your customers</strong>.  </p>  <p style=\"\">  \t      In this course I will teach you how to create a website for free. I am using two different websites so you can choose which website is better for you and it is very easy to upgrade your website of course you should pay money for the website to get unlimited data.  </p>  <p style=\"\">  \t      In this course you will learn how to build your website from scratch. in addition, marketing your services ect.... for customers in USA , Canada, Middel East and around the world. Also, I will show you how to create a website for your customers and get paid a lot of money. Finally, making your website and make your website more popular on any search engine.  </p>  <p style=\"\">  \t<strong style=\"\">So Why Not Make a Career Out of This Skill?</strong>  </p>  <p style=\"\">  \t<em style=\"\"><br style=\"\">  \t</em>  </p>", 
    "end_date": null, 
    "title": "Run an Online Business from Home by Creating Websites", 
    "price": "50.00", 
    "instructors": "Mohd Isam", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398278_b73f_5.jpg", 
    "course_url": "https://www.udemy.com/run-an-online-business-from-home-by-creating-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T18:27:08Z"
}