{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are you struggling to earn a decent income online?</strong> Have you tried almost everything your instructor said, but to just earn peanuts? You're not born for that. Look no further as I present you the most effective and incredible method of 2016, that will force you to quit your boring regular job and live the life the way you're supposed to.</p>\n\n<p>This is a no-fluff course that directly speaks about the method rather than wasting time on \"Umm, Ahh, Aaa\" or whatever the other instructors use to take the lecture further.</p>\n\n\n\n\n\n<p>Watch over my shoulder as I teach you the exact strategy that banks me <strong>$4.8k a week.</strong> By doing what? <strong>Selling simple websites.</strong> </p>\n\n\n\n<p>Inside this course, you will discover:</p>\n\n\n\n\n\n<ul><li> My complete blueprint which banks me $4.8k+/week</li><li> How to effortlessly cash in 2-3 sales a day</li><li> How to find an avalanche of hungry, targeted buyers willing to throw money</li><li> Start seeing jaw dropping results within 24 hours</li><li> 100% newbie-friendly. Even a 12 year old can replicate this</li><li> Untold, unrevealed methods of finding clients. TOTALLY a new innovation</li></ul>\n\n\n\n\n\n<p>....And there's soo much more in it, that I can't describe here.</p>\n\n\n\n\n\n<p>I've been doing this business from the past 4 months, <strong>and it just won't stop handing me money for every time I try it.</strong></p>\n\n\n\n\n\n<p>Best of all? <strong>It works on any niche.</strong></p>\n\n<p><strong>Make sure to grab it while you can.</strong></p>", 
    "end_date": null, 
    "title": "Website Selling Business: How I Earn a Living From Home", 
    "price": "20.00", 
    "instructors": "Adnan Rehan", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/784850_11f9_2.jpg", 
    "course_url": "https://www.udemy.com/website-selling-business/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T10:42:55Z"
}