{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t                ▁ ▂ ▃ ▅ ▆ █ <strong>ОПИСАНИЕ:</strong> █ ▆ ▅ ▃ ▂ ▁  </p><p><strong><em></em>Поторопитесь приобрести курс по минимальной цене, с 4 апреля цена курса автоматически вырастет до 20$ в связи с новой ценовой политикой Udemy!<em></em></strong><br></p>  <p>  \t                Данный курс обучит вас <strong>всему процессу создания сайта на Wordpress с нуля</strong>, от момента регистрации домена и хостинга, до поиска темы Wordpress, ее настройки, наполнения сайта контентом.  </p>  <p>  \t                    Используя мои видео материалы и PDF учебник (прилагается к каждому разделу курса), вы постепенно соберете сайт торговой компании, который рассматривается как пример для обучения. Сайт компании, продающей отопительное оборудование довольно универсальный и подойдет так же для любого другого бизнеса: турагентства, консалтинга, продажи каких-либо услуг.  </p>  <p>  \t                      Весь материал нацелен на то, чтобы научить вас создавать сайты быстро и массово, под любые ваши потребности и идеи.<strong> Ваш первый сайт вы соберете за 12 часов!</strong> Именно столько времени необходимо на освоение курса (выходные, или несколько вечеров после работы). В курсе нет лишнего, информация подается кратко и лаконично, чтобы максимально сократить время вашего обучения.  </p>  <p>  \t                      Курс рассчитан на новичков. Если вы совершенно не понимаете как функционируют сайты и откуда они берутся - этот материал именно для вас! Лекции разбиты на видео-уроки и дублирующий PDF учебник со скриншотами экрана. Как учебник, так и видео демонстрируют пошаговые действия по созданию и настройке сайта на экране компьютера, учитесь читая учебник, или просматривая видео - как вам удобнее.  </p>  <p>  \t<strong>Почему именно Wordpress?</strong> Эта платформа позволяет собирать сайты как конструктор, из визуальных элементов. К тому же, под нее уже сделана уйма бесплатных и тонны платных шаблонов, которые вы просто берете и подгоняете под свои потребности. Сайты на Wordpress выглядят современно, ярко, функционально и легко настраиваются. На Wordpress можно собирать не только простые сайты, но и целые интернет магазины с карточной оплатой и множеством модулей (но это, после того, как вы освоите сборку простых сайтов, чему и посвящен мой курс ;)  </p>  <p>  \t                ▁ ▂ ▃ ▅ ▆ █  <strong>ОГЛАВЛЕНИЕ:</strong> █ ▆ ▅ ▃ ▂ ▁  </p>  <ol>  \t<li>Вступление: Как устроен интернет, и что необходимо знать про управление сайтами;</li>  \t<li>Регистрация домена и хостинга. Настройка домена. Привязка домена к хостингу;</li>  \t<li>Настройка хостинга. Установка Wordpress на хостинг - 2 способа;</li>  \t<li>Выбор шаблона Wordpress и его первичная настройка;</li>  \t<li>Наполнение страниц шаблона, работа с виджетами, а именно:</li>  </ol>  <ul>  \t<li>    Создание меню сайта;</li>  \t<li>Настройка визуальных элементов лицевой страницы сайта: заголовок, слайдер, виджеты;</li>  \t<li>Настройка нижней части сайта: подвал/footer, установка кнопки подписки, текста и изображений;</li>  \t<li>Создание продуктовой страницы и страницы с контактами: контактная форма и виджет отзывов покупателей; </li>  </ul>  <p>  \t                      После обучения, вы соберете свой первый современный сайт, который будет выглядеть лучше чем сайты многих других компаний вашего города. Никто не усомниться в том, что вы поработали на славу!  </p>  <p>  \t                      Вы будете  понимать как устроен ваш сайт, как добавлять новую информацию, настраивать продуктовые страницы и обновления.  </p>  <p>  \t                            Итак, вы готовы заявить миру о себе? Интернет уже ждет ваш первый сайт или блог!  </p><p>♛<strong> </strong>Просьба, оставить отзыв о курсе, это даст мне понимание того, что вам, \nмои уважаемые слушатели, важно. Добавляйтесь в друзья в Facebook, всех рад видеть! ♛<span></span><br></p>", 
    "end_date": null, 
    "title": "Курс Webbuilder - полноценный сайт компании за 12 часов!", 
    "price": "20.00", 
    "instructors": "Andrew Kass", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368746_df55_3.jpg", 
    "course_url": "https://www.udemy.com/webbuilder/", 
    "currency": "USD", 
    "subject_name": [
        "Product Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T10:45:25Z"
}