{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Course fully up-to-date and new lectures added as of this month.</em></p><p><strong><strong>JOIN 1,000s OF STUDENTS WHO ARE</strong> IMPROVING THEIR WRITING, GRAMMAR, BUSINESS COMMUNICATION, AND ENGLISH LANGUAGE SKILLS.<br></strong></p><p>1. Would you like to <strong>improve your writing </strong>and grammar skills without having to go back to school?</p><p>2. Are you interested in adopting technology <strong>that will simplify</strong> your writing process?</p><p>3. Do you want to appear more professional and educated to <strong>attract better opportunities</strong>, income, and sales?</p><p>If you answered \"yes\" to at least one of these questions, then this course is for you!</p><p>Writing skills are <strong>a critical component of communication skills</strong> and <strong>can influence</strong> decisions made by customers and human resource managers. Can you describe the difference between active and passive voice; use commas correctly in long sentences; explain the difference between every day and everyday? Perhaps like many others, your grammar skills aren't at as proficient as you would like them to be.</p><p><em>10X Your Writing Skills and Grammar </em>provides tools and tips to improve your writing skills with ease. I designed this mini-course for anyone who communicates in written form, for example, through emails, documents, presentations, blogs or information products. After completion of this course, you'll be able to <strong>enhance your writing skills</strong> within twenty-four hours.</p><p>As you navigate this course, you'll gain insights and learn about the tools I use in my online business. Upon successful completion of this course, you'll be able to:</p><ul><li>Adopt writing enhancement tools to improve your work</li><li>Appear more professional and educated among your peers and customers</li><li>Identify areas of your writing that need improvement</li><li>Increase your productivity so that you can produce more value driven content</li><li>Enhance your creative writing environment and activities</li><li>Implement practices and habits to yield greater results</li><li>And much more</li></ul><p><br><span></span></p><p>Sign up and experience this course to <strong>improve your communication skills and more.</strong></p><p><strong>Start Learning!</strong></p><p>Enroll now and improve your writing TODAY!</p>", 
    "end_date": null, 
    "title": "10X Your Grammar, Writing, and Business Communication Skills", 
    "price": 0, 
    "instructors": "Chad Tennant, Make Money Online - Home Business", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338422_6b23_12.jpg", 
    "course_url": "https://www.udemy.com/email-management-training/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T12:34:04Z"
}