{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you frustrated with difficult people?  Do you find difficult people to be challenging?  Who are some difficult people in your life?  Your boss?  Your spouse/partner? Coworkers and customers?  Difficult people cause us undue stress and that's not healthy.  Wouldn't it be great to have a few key strategies that make dealing with difficult people a lot easier?  By the end of this course, you will have 12 different strategies that will help you better deal with difficult people.</p>\n\n<p>By mastering the strategies and tactics of this course you will:</p>\n\n\n\n<ol><li><p>Improve your safety</p></li><li><p>Increase your overall level of professionalism</p></li><li><p>Reduce your stress level</p></li><li><p>Improve your morale</p></li><li><p>Decrease the number of complaints you may receive</p></li><li><p>Lower your personal liability.  </p></li></ol>\n\n\n\n<p>All of this adds up to a healthier and happier personal and professional life.  This could mean greater productivity for employees and fellow co-workers which would likely increase profitability.  For example, what would your office be like if everyone just “got along” with one another?  </p>\n\n\n\n<p>This course is primarily a series of video lectures that outline the strategies.  The lectures contain personal stories and real-life examples of how I've used these strategies and tactics in my career in law enforcement, customer service, and sales.</p>\n\n\n\n<p>This course was designed specifically for individuals and employees,who work in a professional environment that is often unpleasant due to difficult co-workers, supervisors, customers and/or clients.  It’s about taking control of the situation instead of being controlled by the situation.</p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "12 Strategies for Dealing With Difficult People", 
    "price": "30.00", 
    "instructors": "Mr. Steve Schmidt", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430604_c82f_2.jpg", 
    "course_url": "https://www.udemy.com/12-strategies-for-dealing-with-difficult-people/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T04:20:48Z"
}