{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course, you will learn to become aware of your body, emotions, and language so you can <strong>choose and control</strong> how they impact the way you converse with others and interact with the world around you.</p>This course explores the <strong>intention (or purpose) of conversation</strong>. The way we can become effective communicators is to learn what it is we're actually saying. When we know what we're saying, then we understand how we see the world.<p>To put it another way: we can choose to engage in full, <strong>rich, satisfying conversations</strong> with others through understanding language use and how our word selection reflects our perception of and expectation from human interactions. </p><p>We learn how to improve communication skills through the six speech acts:</p><ul><li>Requests</li><li>Offers</li><li>Promises</li><li>Assertions</li><li>Assessments</li><li>Declarations</li></ul><p><strong>T</strong><strong>hrough practice</strong>, we become skilled at conversation with our networks, bosses, colleagues, teams, friends, and loved ones.</p><p>By the end of this course, you'll understand how the actions you take in your life – based on the Ontological Methods you learn in the course videos and materials – can lead to <strong>new perspectives, great conversations, and increased opportunities</strong> for positive human connection. </p><p><strong>What Is Ontological Coaching?</strong></p><p>Ontology, as taught by the Newfield Network, is the knowledge of how you are <strong>\"being\" in the world through your body/movement, thoughts/emotions, and language</strong>. Your body, thoughts and language are all interrelated. When you change one of these three components, you cause the other two to <strong>change or shift</strong> – for better or worse.</p><p>Ontology affects your conversations and their outcomes at work, home, and play. <strong>Conversation is more than talk;</strong> it's about how we move our bodies, feel and interpret emotions, and choose our words.</p><strong>Take Action &amp; Enroll</strong><p>Enroll now, make the commitment and jump straight into the course right now. I know this course will revolutionize the way you look at language!</p><p>See you on the inside and check out the preview videos to see what value you'll be getting!</p><p>Talk soon,</p><p>Thushyanthan</p>", 
    "end_date": null, 
    "title": "3 Steps To Improve Your Communications Skills", 
    "price": "40.00", 
    "instructors": "Thushyanthan A", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436842_fba1_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-improve-communication-skills-with-ontological-methods/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T19:52:39Z"
}