{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>ULTIMA REVISIONE (NOVEMBRE 2015)</strong></p><p><strong>UNISCITI A OLTRE 130 STUDENTI ITALIANI!</strong></p><p>------------------------------------------------------------------------------------------------------------</p><p><strong></strong></p><p>  \t  Impara a realizzare e tenere presentazioni persuasive. Saper motivare l'audience è fondamentale per promuovere le tue idee, le tue soluzioni, la tua carriera e te stesso. Malgrado ciò molti fanno fatica ad essere efficaci e anzi parlare in pubblico diventa un'occasione di disagio.  </p>  <p>  \t  Questo corso è fantastico per chiunque faccia presentazioni e voglia migliorarsi e/o diventare più efficace. Si tratta di un corso introduttivo ma questi 5 principi sono garantiti per fare il salto di qualità.  </p>  <p>  \t  Quasi 20 anni ad aiutare le persone a parlare in pubblico mi hanno insegnato cosa davvero è importante e lo presento in maniera semplice e soprattutto facilmente applicabile. Sono linee guida che <strong>tutti possono adottare</strong> senza nessuna capacità particolare richiesta ed i cui benefici saranno visibili già alla prossima occasione.  </p><p>Otterrai:</p><ul><li><em>Accesso completo per tutta la vita</em></li><li><em>Tutti gli aggiornamenti futuri inclusi</em></li><li><em>Garanzia soddisfatti o pienamente rimborsato per 30 giorni - la mia promessa personale per il tuo successo!</em></li></ul><p>Parlare in pubblico efficacemente aumenta i risultati e le possibilità di carriera: non sprecare le opportunità, iscriviti ora!</p>", 
    "end_date": null, 
    "title": "5 principi per realizzare e tenere presentazioni persuasive", 
    "price": "20.00", 
    "instructors": "Paolo Pelloni", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376328_8627_2.jpg", 
    "course_url": "https://www.udemy.com/5-principi-per-realizzare-e-tenere-presentazioni-persuasive/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-23T15:09:36Z"
}