{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you want to impress <strong class=\"redactor-inline-converted\">employers, editors, or online readers</strong> with your writing? Do you want to get <strong class=\"redactor-inline-converted\">A grades</strong> on term papers and essays? Do you want to become a good writer – in <strong class=\"redactor-inline-converted\">creative non-fiction, journalism, fiction, or academic writing</strong> – as quickly as possible? \n\n  </p>\n\n<p>The secret to this writing success is <strong class=\"redactor-inline-converted\">not</strong> studying 200 grammar and style points in the comprehensive writing textbooks. Instead, this course – designed by an experienced university professor and published author with Oxford University Press – shows you the only <strong class=\"redactor-inline-converted\">sentence-level lessons</strong> you need to know to write well. These are the <strong class=\"redactor-inline-converted\">7 most common problems</strong> found in people’s writing. These problems most likely lurk – like weeds – in your writing right now. \n\n  </p>\n\n\n\n\n\n\n\n<p>If you complete the <strong class=\"redactor-inline-converted\">lessons, exercises, and assignments</strong> honestly and fully as outlined in this course, then your writing will improve in just a few weeks of intensive study. If you do not find this course helpful, you may request a refund within 30 days, no questions asked. \n\n  </p>\n\n\n\n\n\n\n\n<p>These lessons, exercises, and assignments were designed and tested at the University of Toronto and York University with thousands of undergraduate students. Many undergraduate students improved their grades by <strong class=\"redactor-inline-converted\">a whole grade category </strong>after completing these lessons, finding that this short list of key lessons provides clarity. Students have applied these lessons in the workplace to great success. </p>\n\n\n\n\n\n\n\n<p>Enrol now and complete this course to produce writing that gets you the job, earns you an A grade, lands you a writing contract, or impresses that magazine or newspaper editor. \n\n  </p>\n\n\n\n\n\n\n\n<p>In this comprehensive course, I will help you:</p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">See</strong> sentences more objectively;</li><li><strong class=\"redactor-inline-converted\">Understand</strong> the factors that interfere with communication;</li><li><strong class=\"redactor-inline-converted\">Remove</strong> dead language – such as dead verbs and weak nouns – from your writing;</li><li><strong class=\"redactor-inline-converted\">Avoid</strong> embarrassing clichés;</li><li><strong class=\"redactor-inline-converted\">Write</strong> more clear, direct, and precise sentences;</li><li><strong class=\"redactor-inline-converted\">Use</strong> adjectives and adverbs more carefully, in targeted ways;</li><li><strong class=\"redactor-inline-converted\">Write</strong> poetically and rhythmically with parallelism and sentence variation;</li><li><strong class=\"redactor-inline-converted\">Add</strong> detail to your writing;</li><li><strong class=\"redactor-inline-converted\">Plant</strong> vivid images in readers’ minds; and,</li><li><strong>Become</strong> an original writer, not a copy.</li></ul>\n\n\n\n<p>Your writing transformation awaits...</p>", 
    "end_date": null, 
    "title": "7 Lessons for Becoming a Standout Writer at Work or School", 
    "price": "20.00", 
    "instructors": "Dr. Duncan Koerber", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/871638_d706_2.jpg", 
    "course_url": "https://www.udemy.com/7-lessons-for-becoming-a-standout-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-07T19:32:07Z"
}