{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Students will have the opportunity to create a presentation in Prezi and explore the educational benefits of the Prezi canvas and image-based learning. </p>\n\n<p>In this course, you’ll learn how to create a new Prezi, navigate the 3D canvas, use each of the tools provided by Prezi, and import PDF and PowerPoint files. The course begins with a discussion of how to design an effective presentation at a strategic level and concludes with detailed direction for adding text, images, shapes, charts, diagrams and multimedia. <br></p>\n\n<p>Be prepared to work! This is a hands-on course that will result in a presentation that's ready for your audience.  Reworking YOUR presentation on paper before transitioning to the online platform to ensure you maximize the use of images to support your message. Applying the basic and in some cases advanced techniques available through Prezi that will make your message memorable.          </p>\n\n<p>This session is perfect for current Prezi users who want to learn more about the science behind why Prezi helps students understand and remember big-picture concepts and small details, facilitators who have tried to use Prezi but gave up - either because the technology didn't make sense or the design/animation just didn't seem to work and any instructor interested in converting an existing presentation to a more engaging format. </p>\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "A Beginner's Guide to Creating an Engaging Prezi", 
    "price": "30.00", 
    "instructors": "Amy Jauman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/804610_32ab_5.jpg", 
    "course_url": "https://www.udemy.com/prezibasics/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-26T18:20:24Z"
}