{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t         Welcome!\r\n</p>\r\n<p>\r\n\t         As a trial and appellate attorney for nearly 40 years, my livelihood depends on constructing practical real-world winning arguments. Whether simple or complex, those arguments must be both logical and clear to my audience. And as an adjunct law professor for advanced argumentation, teaching students how to quickly and easily make such quality arguments is my mission.\r\n</p>\r\n<p>\r\n\t <strong>In this course, I would like to share with you how to use or teach the same simple natural language logic template that I rely upon in court to ensure that any argument is both logical and clear. </strong>\r\n</p>\r\n<p>\r\n\t         I just fit the sentences of my reasoning within that logic template and out comes a logical and clear argument every time. It’s fail-safe, rigorous, robust, and nearly automatic. The type, complexity, or subject matter of the reasoning does not matter—the logic template is universal. And if the reasoning cannot be made to fit within the structure, you know that the reasoning is not logical.\r\n</p>\r\n<p>\r\n\t         Fortunately, you will NOT need to learn or teach about the typical long list of logical argument and reasoning curriculum topics. Just scratch them off your list of “need-to-know” to construct logical and clear arguments. There are just five simple steps to follow to complete the logic template.\r\n</p>\r\n<p>\r\n\t         It is academically sound as an extension of the seminal work of Professors Fred Sommers and George Englebretsen in the natural language <em>New Syllogistic</em> and peer-reviewed (<em>Oxford Journal</em> <a href=\"http://inferenceincourt.com/papers/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">articles</a>). And it has been field tested for years in actual litigation.\r\n</p>\r\n<p>\r\n\t         Of course, like improving any expertise, you will need to practice. But you only need to practice the same five simple steps for any argument.\r\n</p>\r\n<p>\r\n\t         To the contrary, based on traditional curriculum, studies have shown that practical logical reasoning “is often ill understood and poorly deployed even among those in the upper tiers of our educational systems.”(van Gelder, T., Bissett, M., &amp; Cumming, G. (2004). Enhancing expertise in informal reasoning. <em>Canadian Journal of Experimental Psychology</em>, 58, 142–152.)\r\n</p>\r\n<p>\r\n\t <strong>Hasn’t the time come for learning and teaching how to make logical and clear arguments to stop being so complex and difficult? We have all been working at it harder than is really needed! The right tool makes all the difference.</strong>\r\n</p>\r\n<p>\r\n\t         The focus of this course is narrow—how to easily construct practical clear logical arguments every time whether supporting your own position or attacking another position. That’s it!\r\n</p>\r\n<p>\r\n\t         While there is certainly more to critical thinking than constructing logical and clear arguments, without real competence in this one skill, the other important areas of critical thinking cannot overcome its absence.\r\n</p>\r\n<p>\r\n\t         QUESTIONS ALWAYS WELCOME!\r\n</p>\r\n<p>\r\n\t         Joseph\r\n</p>", 
    "end_date": null, 
    "title": "A Clear Logical Argument Guaranteed", 
    "price": "50.00", 
    "instructors": "Joseph A. Laronge", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147994_a1ff_10.jpg", 
    "course_url": "https://www.udemy.com/a-clear-logical-argument-guaranteed/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-16T20:39:56Z"
}