{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Communication plays a key role in any setting, be it in professional or personal life. Do you feel like your voice is not heard? Are you not able to say the right thing at the right moment, only to mentally face palm yourself later, when you think of something brilliant? Well, we can fix that!</p>\n\n<p>Firstly, we must understand that communication is not simply the transmission of words and sounds between two or more people, but includes more. It includes your posture, your tone, your words, your context, your writing skills, your writing tone, your volume, etc. Communication is limitless and can include anything under the sun, from what you say to what you leave out.</p>\n\n\n\n<p>Communication especially plays an important part when it comes to businesses and could actually be the make it or break it moment during a business transaction. Who wants to sign a deal with someone that is rude? Research suggests that communication skills are one of the top skills demanded by employers and also plays a huge factor when it comes to growth in a company. </p>\n\n\n\n<p>Saying the right thing at the right time is most often considered one of the greatest skills. So is, if you can subtly pick up on how the person is feeling using non-verbal cues.</p>\n\n\n\n<p><strong>If any of this interests you, then this is the right course for you!</strong> So, why this course?</p>\n\n\n\n<p>Our Business Communication course has been designed from the ground up to be THE comprehensive course on communications in the business setting. Learn about all communications that take place at the office, from co-workers to clients to even your boss!</p>\n\n\n\n<p>In this course, you will learn what to say, how to say it, how to effectively get your meaning across with the right words and the right tone. It will also cover how to write, what to write and how you can modify your writing tone to get your meaning across in the right way. </p>\n\n\n\n<p>That’s not all! This extensive course also covers communication when it comes to non-verbal cues, business e-mails, reports (formal and informal), presentations (formal and informal), meetings, negotiation and so much more.</p>\n\n\n\n<p>With so much packed in one exquisite course, this tutorial should definitely be your go to for learning all forms of communication related to business. So, come on let’s make you a brilliant conversationalist and get you that raise you’ve been eyeing!</p>", 
    "end_date": null, 
    "title": "A Complete Guide For Effective Business Communication", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/826808_a38b_3.jpg", 
    "course_url": "https://www.udemy.com/a-complete-guide-for-effective-business-communication/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-20T05:20:22Z"
}