{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>From the team that runs the world's largest, 21st Century leadership course, we present to you a next-generation course on communication &amp; control. </strong>  </p>\n\n<p><strong>Warning</strong>. This advanced course focuses on communication in the context of information flow, control &amp; decision-making. It is not a standard, average, 20th Century management communication course that talks about body language. \n\n  </p>\n\n<p>Our course is the only one built on the 21st Century science of cybernetics (the science of communication and control).  We have used this incredibly powerful science to provide you with 21 clear, practical and powerful communication tools.\n\n  </p>\n\n<p>By attending this course you will discover one of the key secrets of the 21st Century leaders; the fundamental relationship between communication &amp; control. Just like finance ensures the smooth running of a team or organisation by organising the flow of money, advanced communication skills organise the flow of information throughout the organisation. By attending this course, you will\n\n  </p>\n\n<p>·         Discover 21 advanced communication tools that are specifically designed to help leaders communicate in today's complex, uncertain and rapidly-changing world. \n\n  </p>\n\n<p>·         Dramatically improve your ability to think clearly, communicate concisely and learn quickly. \n\n  </p>\n\n<p>·         Master the control cycle &amp; upgrade your ability to perform the 5 crucial leadership activities of setting goals, planning, communicating, implementing and learning.\n\n  </p>\n\n<p>Sign up and join the information age.\n\n  </p>\n\n<p> \n\n  </p>\n\n<p> </p><p><br></p>", 
    "end_date": null, 
    "title": "Advanced communication skills for 21st Century leaders", 
    "price": "25.00", 
    "instructors": "Leadapreneur Academy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/196320_5f3e_6.jpg", 
    "course_url": "https://www.udemy.com/advancedcommunicationskills/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-09T12:39:41Z"
}