{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Your credibility as a presenter is directly affected by your ability to provide\nvaluable and knowledgeable answers to questions from your audience. In this\nprogram you will learn everything you need to know to confidently inspire\nquestions and provide answers, even when you have none. </p><p>People often ask me how I always seem to know the answer to every question in\nmy presentations. Answering questions effectively is so important to the success\nof our programs that I have developed a step-by-step system for doing it, and\nbeing knowledgeable is only part of the equation. My simple system can help you\nbe prepared to confidently handle any question no matter what your level of\nexpertise about your topic.</p><p>I am an adult learning specialist that can deliver a fast paced results-oriented\ntraining program. I approach everything from the perspective of both a presenter\nAND an audience member to help you learn by modeling everything I suggest\nyou do. Presentations and public speaking is at the core of what I do so I have\nspent a lot of time on it. For that reason, this program has become the go-to\ncurriculum for companies and institutions nationwide.\n</p><p>I have spent over fifteen years researching presenters. I have observed over ten\nthousand hours of presentations and have taking over two-hundred thousand\npages of feedback that I have personally delivered to thousands of presenters.\nBoomerang offers specific tools and practical guidance, not theoretical fluff. </p>", 
    "end_date": null, 
    "title": "Answer Questions Like a Pro", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698588_3f00_3.jpg", 
    "course_url": "https://www.udemy.com/boomerang-answer-questions-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T22:02:24Z"
}