{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t         The APA Survival Guide provides you with a <strong style=\"\">convenient, effective, and FUN way to learn APA style!</strong>  </p>  <p style=\"\">  \t         Inspired by the series Schoolhouse Rock, the course includes 30 lessons with 2 hours of educational – and ENTERTAINING - instruction to sharpen your APA skills. According to a <a href=\"http://apasurvivalguide.com/?page_id=107\" target=\"_blank\" rel=\"nofollow noreferrer\" class=\"external-link\" style=\"\">2014 national study</a>, college students who participated in APA Survival Guide training had <strong style=\"\">3 to 5 times more APA knowledge</strong> as students who learned APA on their own!  </p>  <ul style=\"\">  \t<li style=\"\">Learn the rationale for each guideline – so APA style makes more sense!</li>  \t<li style=\"\">Hear ‘easy-to-understand’ descriptions of each style guideline – so you know exactly what to do!</li>  \t<li style=\"\">Watch how to configure APA style in Microsoft Word – so your papers sparkle!</li>  \t<li style=\"\">Understand the core elements of APA citations and references – so you add credibility to your writing.</li>  \t<li style=\"\">Self-assess your learning with fun quizzes – so you know right away if you’re getting it!</li>  </ul>  <p style=\"\">  \t <strong style=\"\">What are college students saying about the APA Survival Guide?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">&quot;This video series was so well done! It amazed me how easy APA is to format once you understand the rules!&quot;</li>  \t<li style=\"\">“The APA Survival Guide is extremely valuable to students of all ages. The course definitely helped me understand the APA manual and formatting guidelines much better!”</li>  \t<li style=\"\">“I wish I had APA Survival Guide program 10 years ago!”</li>  </ul>", 
    "end_date": null, 
    "title": "APA Survival Guide", 
    "price": "25.00", 
    "instructors": "Ruby Daniels", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226234_0feb_8.jpg", 
    "course_url": "https://www.udemy.com/apa-survival-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T14:56:20Z"
}