{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p class=\"PIN_1372858432463_hazClick\" style=\"\"><p class=\"PIN_1372858432463_hazClick\" style=\"\">La comunicación interpersonal es un tema  central para la constitución humana y su relación con otros. Es un proceso  complejo y su comprensión es clave para un mejor entendimiento y optimización  de las relaciones. Mantener una buena comunicación con las personas que nos  rodean parece ser uno de los principales retos del ser humano. &nbsp;</p>    <p style=\"\">La comunicación obedece a órdenes de alta complejidad, donde intervienen  una serie de variables que pocas veces son tomadas en cuenta cuando tal  complejidad se transforma en complicación. La comunicación interpersonal es considerada  como el proceso de intercambios de mensajes entre dos o más personas, con la  finalidad de alcanzar determinados objetivos. Es importante resaltar que la  persona capaz de mantener una comunicación interpersonal adecuada, contribuye  al bienestar y calidad de vida de sí misma y de los demás. Para mantener  excelentes relaciones interpersonales es importante contar con recursos de  personalidad que nos permitan utilizar y manejar de forma acertada y efectiva  las habilidades comunicativas en dependencia con los diferentes contextos  sociales en el que nos desenvolvemos.</p>    <p style=\"\">Sin embargo, muchas veces no somos conscientes de la importancia de  comunicarse de manera clara, evitando malentendidos y confusiones. Hasta  podríamos afirmar que somos poco responsables, es decir, no damos crédito al  impacto de nuestras palabras, gestos o actitudes. No somos concientes del  efecto que provocamos y del efecto que, a su vez, nos causa la comunicación con  el otro. También somos escasamente respetuosos con la respuesta del otro.  Muchas veces no los escuchamos, damos preeminencia a nuestra propia respuesta  que se superpone a la del interlocutor y, cuando respondemos, contestamos a  nuestro propio imaginario, creando así parte de la génesis de futuros embrollos  comunicacionales.</p>    <p style=\"\">En este curso empezamos por comprender qué es la comunicación interpersonal,  sus características, tipos de comunicación interpersonal, funciones de la  comunicación y elementos de la comunicación interpersonal. Con todos estos  conocimientos, el alumno podrá entender y manejar los conceptos básicos de la  comunicación interpersonal.</p>    <p style=\"\">Luego en la Lección 2, hacemos una exposición amplia de la Comunicación  No Verbal, que es un espectro de lenguajes que incluye la gesticulación y el  movimiento del cuerpo, entre los mas conocidos, que también comprende la  conducta táctil, el uso del entorno y del espacio personal, todos ellos  relacionados con el concepto de territorialidad, tan importante en el comportamiento  humano. </p>    <p style=\"\">Con el aprendizaje de las Lecciones 1 y 2, el alumno estará en  condiciones de conocer y manejar los principales fundamentos de la comunicación  verbal y no verbal, para que a partir de ello y estudiando la Lección 3, pueda  incorporar a sus conocimientos los estilos de comunicación y cuáles son los  componentes básicos para una comunicación eficaz.</p>    <p style=\"\">Finalmente en la Lección 4, el alumno podrá aprender y aplicar las  principales técnicas de comunicación; tales como, el parafraseo, el replanteo,  aprender a formular diversos tipos de preguntas tales como, preguntas abiertas,  cerradas, circulares&nbsp; y preguntas  activas.&nbsp;</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Aprende a Comunicarte Mejor en 4 Semanas", 
    "price": "20.00", 
    "instructors": "José Oscar Guzmán Mendoza", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59316_9845_7.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-comunicarte-mejor-en-4-semanas/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-10T22:13:32Z"
}