{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Regularly $97 now discounted to $20 for a limited time</strong><br style=\"\">  \t<br style=\"\">  \tWe are in a new world, one driven by fast paced technology, invasive social media and yet effective communication has never been a more necessary skill to have.  Our diminishing inventory of time demands stronger interpersonal skills, an increase in social awareness and an expert level of flexibility.  Why? to stand out from the rest.  </p>  <p>  \t      We know that time no longer equals money as it did in the industrial revolution. Now… relationships equal money.  And there are many skills that the most powerful people in the world have learned to harness and leverage in order to win every conversation, as per Susan Scott &#039;the conversation IS the relationship&#039;.  </p>  <p>  \t      This course aims to unveil some of the secrets in how to effectively read, understand and communicate with anyone whether it be in relationships with a spouse or family, in business with partners or teams or professionally with clients or prospects.  </p>  <p>  \t      We aim to explain WHY we are ineffective in the first place, WHAT it is we can do to improve on every level and HOW to go about it starting TODAY.  Waste no time in learning how to communicate like some of the most successful people in the world and watch your relationships improve dramatically, just with these 10 videos dissecting exactly how you can get results whether you are a leader or a start up entrepreneur.  </p>  <p>  \t      We have begun teaching this information over the past year through seminars and courses with clients and teams in Canada, America, Australia and the UK, with glowing testimonials of how theses skills have improved not only their relationships but also their results… Here is just some of what you will learn with us today!  </p>  <ul style=\"\">  \t<li>5 key principles for success (the 5 things you need to know and master!)</li>  \t<li>Understanding how we work (the science behind how we communicate)</li>  \t<li>Building and maintaining rapport (YES, there is also a science to this!) </li>  \t<li>Handling problems and overcoming objections (4 questions to destroy problems)</li>  \t<li>How to pitch and sell to hit 100% of your audience (do the MATH!)</li>  \t<li>Clearing the mind with a checklist (Use 12 steps to drop the spinning plates!)</li>  \t<li>MINDSET (why this is the make or break and how to get it RIGHT!)</li>  \t<li>Gratitude (everyone talks about it, we teach HOW to get results with this!)</li>  </ul>  <p>  \t      What if you could ultimately WIN every conversation, close 100% of the time and build effective relationships without even opening your mouth.  All of these skills will set you apart from the rest.  Time for you to master relationships through effective communication and learn how to WIN.  </p>  <p>  \t      Cheers to your success!  </p>  <p>  \t      Chris Messenger  </p>  <p>  \t      www.thechrismessenger.com  </p>", 
    "end_date": null, 
    "title": "Are You Ready To Win..?", 
    "price": "20.00", 
    "instructors": "Chris Messenger", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179170_e141_3.jpg", 
    "course_url": "https://www.udemy.com/howtowin/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-08T23:11:25Z"
}