{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Relationships</strong>: we all want better professional and personal relationships. Improving your <strong>questioning skills</strong> is a powerful way to build stronger, better relationships. That's why, according to Anthony Robbins, <strong>successful people ask better questions</strong>.</p>\n\n<p><strong>Asking questions</strong> is a critical communication skill that most of us pay little attention to. It is the linchpin to building <strong>stronger relationships</strong>, both <strong>professionally and personally</strong>. Learn to understand others before making, and acting on, inaccurate judgments that end up making things worse rather than better.</p>\n\n<p><strong>Ask better questions</strong> and you will develop:</p>\n\n<ul><li>open, more trusting relationships</li><li>a deeper understanding of others and their perspectives</li><li>a way to stop judging and start listening</li><li>decisions based on information rather then assumption</li><li>reduced levels of tension and conflict</li></ul>\n\n<p><em>1330+ students have recognized the positive difference strong questioning skills will make to their relationships</em>.</p>\n\n<p><em>***** </em><em>Even asking question is an art. It's short and concise and I've learned a lot. Thanks for the course </em>- Chris Tamin<em> *****</em><br></p>\n\n<p><strong>You will learn:</strong></p>\n\n<p>To stop judging people and start listening to others.</p>\n\n<p>  \t                    Key questions types and their uses  </p>\n\n<p>  \t                    Common question traps we fall into everyday  </p>\n\n<p>  \t                    How to sequence questions to fully understand  </p>\n\n<p>  \t                    What to listen for and why it is critical to success  </p>\n\n<p>Explore the different types of questions and the impact they have on your conversations. <strong>Eliminate problem questions</strong> from your repertoire and replace them with questions that <strong>build rapport </strong>and help you <strong>gain a deeper understanding</strong> of the other person. Avoid the everyday traps that most of us don't even realize we are making.</p>\n\n<p>  \t                    Learn what to listen for as people answer your questions and how to  <strong>keep the conversation focused</strong> on the important issues.  </p>\n\n<p>  \t                    Develop better questioning skills and you'll <strong>be amazed at the impact</strong> it has and <strong>the positive responses</strong> you get.  </p>\n\n<p>  \t                    This course comes with a 30-day money-back guarantee and lifetime access to course material, including updates and additions. You will receive a certificate of completion on finishing the course. Courses can be accessed on computers, iOS devices and Android making it easy to learn anytime in any place.</p>", 
    "end_date": null, 
    "title": "Ask Better Questions - Build Better Relationships", 
    "price": "20.00", 
    "instructors": "Richard Lock", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285934_4aac_2.jpg", 
    "course_url": "https://www.udemy.com/build-better-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-22T14:02:57Z"
}