{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Updated for 2016!</em></strong><br></p>\n\n<p>A comprehensive introduction by the only Udemy Instructor to be endorsed by Prezi as an Official Independent Expert. This course answers your basic questions:</p>\n\n<ul><li>What is Prezi?</li><li>What can you do with it?</li><li>How does it work?</li><li>Is it hard to learn?</li></ul>\n\n<p>This basic tutorial offers clear explanations, demonstrations, quizzes, and hands-on exercises. It will give you a basic understanding and a bit of practical experience so you can decide for yourself if Prezi is right for you.</p>\n\n<p><strong>See what others are saying about this course:</strong></p>\n\n<p><strong><em>Excellent - </em></strong><em>Your course is A+ clear and comprehensive</em></p>\n\n<p><strong><em>Perfect course - </em></strong><em>I had been wanting to check out Prezi and then I saw this course listing. I'm glad that I decided to take it because it helped me make sense of the platform.</em></p>\n\n<p><strong><em>Staight to the point to start today! - </em></strong><em>This was a very easy but comprehensive tutorial on how to create Prezi. You will be able to start doing Prezi presentations quickly and go from beginner to intermediate in a short period of time. I use it for my lectures in the University. Thank you Robin and great tutorial!</em></p>\n\n<p><strong>Find out why millions of people have switched to Prezi</strong></p>\n\n<p>Professional speakers, trainers, teachers, marketers, and anyone else who presents ideas to others will benefit from taking this course. If you regularly use Microsoft PowerPoint or Apple Keynote, you won't want to miss this opportunity to compare them to Prezi. Its open, infinite canvas gives you the freedom to break away from typical linear slideshows and wow your audience with exciting, cinematic movement. </p>\n\n<p>This course is taught by a professional trainer, so you will benefit from instruction that is carefully designed to maximize your learning investment. Prezi concepts are clearly explained, and skills are carefully demonstrated. Detailed, step-by-step instructions for hands-on exercises are available to download and print. Experiential learning is a must for mastering the nuances of Prezi. </p>\n\n<p><strong>Learn from a Prezi Expert</strong></p>\n\n<p>Veteran software trainer, Robin Pierman, is one of a selected few to be recognized by Prezi as an expert trainer. Interact directly with her by completing the exercises and submitting your custom Prezi project for her expert feedback. Discuss ideas and questions with the instructor and fellow students as you learn about this exciting online software application. </p>\n\n<p>Take advantage of this opportunity to learn Prezi from a professional instructor who has truly mastered the software.</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Basic Prezi Tutorial - Learn from an Official Prezi Expert", 
    "price": "20.00", 
    "instructors": "Robin Pierman", 
    "commitment": "27 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/652514_54c4_4.jpg", 
    "course_url": "https://www.udemy.com/basic-prezi-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T17:21:04Z"
}