{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is for people who serve (or are considering serving) on a board as a director or board member. The focus of this course is make sure you stay out of trouble by knowing your rights, obligations and duties as a board member. </p><p><b>Become a More Effective and Knowledgeable Board Member with this Comprehensive Course</b></p> <ul><li>Learn the basics of what governance is</li><li>Find out who stakeholders are and why they are important</li><li>Recognize your rights as a board member or director</li><li>Discover the actions that make you liable</li><li>Learn my: Board Decision Making Framework (ADAPPT) </li><li>Find out how you can stay out of trouble</li></ul> <p><b>Board Members Need to Understand Governance to do their job correctly</b></p><p>This course covers the most important issues that come with serving on a board, whether corporate, non-profit or as a volunteer. In my 20+ years of speaking professionally on governance to a variety of boards, I continue to see examples of what not to do. With this course I want to give you the necessary information to not make mistakes and not get in trouble. Important things like a members' legal responsibilities is not common knowledge to most. You may do something completely ordinary and not realize you are violating your duty as a board member. For example, a 'parking lot meeting.'</p><p>This course covers every major topic you need to practice good governance. The course is comprised of 11 lectures divided into 3 sections. At the end of each section is a quiz that will help you retain the information you just learned.</p><p>Each lecture contains a video of me talking and many lectures have slides accompanying the material. Learning resources for the course are a workbook (PDF) and Part 1 of my book (PDF), Basic Board Governance, which this course is based on. </p><p>When you have finished this course, you will be a better board member and understand what it will take to stay out of trouble.</p>", 
    "end_date": null, 
    "title": "Basic Governance for Board Members", 
    "price": "30.00", 
    "instructors": "Debi Peverill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508288_885e.jpg", 
    "course_url": "https://www.udemy.com/basic-governance-for-board-members/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T18:25:47Z"
}