{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">How would you like to learn how to become a successfully marketed author, get published, make a lot money from your dream, and learn from a top-literary agent who was helped his authors collect over $3 billion in royalties from book sales? <br><br>How would you like to build a career with the same success of top published authors that you see on the bookshelves across America?</strong></p><p>What if you knew the tricks of the trade that make the careers of those authors sing and their paychecks dance off the page?<br></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What could knowing those principles do for you, your family, your desires, dreams, and your potential readers? </strong></p>\n\n\n\n\n\n\n\n<p>You're about to discover a powerful new knowledge-base that will change forever your passion of writing into a sustainable career, teach you how-to become a published author, and how-to successfully build publicity around your work. </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">And you will learn from an instructor who went from a completely unknown self-published author into one of the brightest young stars now writing with the world’s largest english publisher, Penguin/Random-House. </strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">You will also learn from his literary agent, one of the top agents in the world, who has helped his authors earn over $3 billion in sales, and has represented the number one selling book in America 5 out of the last 10 years. </strong><br></p>\n\n\n\n\n\n\n\n<p>Success as an author isn’t just luck. The framework for how most authors build their careers is one of the most important skills you need for climbing up the career ladder and making a living from writing. </p>\n\n\n\n\n\n\n\n<p>But while plenty of people can write, very few have actually made a livelihood out of it and have become successfully published. </p>\n\n\n\n\n\n\n\n<p>The authors who have successfully positioned themselves in this overcrowded marketplace know heaps of tricks, tactics and principles to make their books stand out dramatically from the crowd and get the much-needed publicity to build a strong readership. </p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I'm going to reveal those secrets to you here. Once you've learned them, you'll realize it's always been as easy as understanding a few key principles and then applying them.</strong></p>\n\n\n\n\n\n\n\n<p>By the end, you'll know exactly how to give your writing and marketing a massive edge over the work of your competitors.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">These elite skills will help:</em></strong></p>\n\n\n\n\n\n\n\n<ul><li><em class=\"redactor-inline-converted\">Simplify your process of building a legitimate career as an author.</em></li><li><em class=\"redactor-inline-converted\">Make your target audience instantly ‘get’ your book.</em></li><li><em class=\"redactor-inline-converted\">Make media influencers feature you on their shows and blogs, even though you’re not famous, yet.</em></li><li><em class=\"redactor-inline-converted\">Attract more loyal readers to your blogs and books. </em></li><li><em class=\"redactor-inline-converted\">Attract the attention of top-notch publishers. </em></li><li><em class=\"redactor-inline-converted\">Learn how to successfully position and market your work without forking over thousands of dollars to publicists and marketing gurus. </em></li><li>Build all your own marketing and PR. </li><li><em>Learn how to successfully pitch your work and catch the attention of media outlets.</em></li><li><em>Understand how top authors make a living writing books. </em></li><li><em>Learn how to create all the press materials a marketing expert would charge you thousands of dollars for, using proven samples as outlines for your work. </em></li><li><em>Learn about how to build a successful career from one of the world’s top literary agents, who has helped his authors collect over $3 billion in book sales. </em></li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">DISCOVER THE ADVANCED TACTICS THAT MAKE SOME AUTHORS GO FROM ZERO TO HERO, GET PUBLISHED AND BUILD A REAL CAREER.</strong><br></p>\n\n\n\n\n\n<p><strong>Learn the basics strategies, concepts, and tools that you will need to build a successful career as an author and become published. </strong><br></p>\n\n\n\n\n\n\n\n<p><strong>Learn and Master The-Book-World Quickly Using Proven Methods That Have Helped Authors Like Me Become Published And Sell Tens of Thousands of Copies, Without Publicity Budgets And Marketing Gimmicks. </strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>A Powerful Knowledge Base Few Authors Learn</strong></p>\n\n\n\n\n\n\n\n<p>Learning the fundamentals of how the publishing industry works and how successful authors market themselves and build their careers puts a very useful tool at your fingertips. </p>\n\n\n\n\n\n\n\n<p>The average U.S. nonfiction book is now selling less than 250 copies per year and less than 2,000 copies over its lifetime. </p>\n\n\n\n\n\n\n\n<p>This course will teach you how to build your career from scratch and will give you an inside look at how top-selling authors successfully position themselves in a competitive market. </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Content and Overview </strong></p>\n\n\n\n\n\n\n\n<p>In this course you will learn everything that nobody knows about the publishing world, how to market your work, do our own publicity, pitch media, sell books, and build a real, profitable career.</p>\n\n\n\n\n\n\n\n<p>Each chapter closes with exercises, putting your new learned skills into practical use immediately to move closer to your ultimate desire of a successful career. </p>\n\n\n\n\n\n\n\n\n\n<p>By the end of this course you will know the strategies to build a successful career without forking over thousands of dollars for marketing, or hiring top-dollar publicists. </p>\n\n\n\n\n\n\n\n<p>Starting with a feature from one of the world’s most high-profile literary agents ($3 billion in sales for his authors), this course will take you through how to start from scratch, register your first 1,000 sales, create your press materials, how to pitch desired media outlets successfully, and what you’ll need to accomplish to catch the interest of big-time publishers. </p>\n\n\n\n\n\n\n\n<p>With these basics mastered, the course will take you through what does and does not work in today’s marketplace, something most unsuccessful authors have yet to discover. </p>\n\n\n\n\n\n\n\n<p>When you complete this course you will have the knowledge to create successful traction with your books, and have a clear understanding of how to get your career off the ground without paying publicists and marketers to do it for you. </p>\n\n\n\n\n\n\n\n<p>Knowing how to move books, reach readers and attract publicity is a skill you simply <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">must have</strong></em> to make a strong impression if you wish to do something magical with your dream. </p>\n\n<p>Being able to pitch media with clarity, precision and elegance will also get you much further in any business endeavor. On the flip-side, not knowing how to attract an audience and command the attention of media influencers will always set you back. </p>\n\n\n\n\n\n\n\n<p>Very few people are able to take their publicity and sales destiny into their own hands.</p>\n\n\n\n\n\n\n\n<p>This is a rare chance to discover how many top authors, publicists, agents, and publishers do their <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">magic</strong></em> and to make your writing career catapult by incorporating <em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">their</strong></em> tactics.</p>\n\n\n\n\n\n\n\n\n\n<p>You'll discover these principles from an author with Penguin/Random-House whose first self-published book ended up selling over 25,000 copies, became required curriculum in public school districts throughout California, landed him on the TEDx stages, and got the attention of the world's largest english publisher for his next few books.  </p>\n\n\n\n\n\n\n\n<p>As authors we assume that if we pay publicists, marketers, or get lucky and get a publishing contract, then we will find success and reach our desired readers.That poor mentality is exactly what makes 95% of books fail to sell. </p>\n\n\n\n\n\n\n\n<p>What if you knew how to bypass all that lame conditioning and suddenly reach media and readers? </p>\n\n\n\n\n\n\n\n<p>Accomplished authors know a bunch of cool tricks that make their work get out to the world, and come back as paychecks and notoriety. </p>\n\n\n\n\n\n\n\n<p>For the very first time, I reveal in intimate detail exactly how those authors achieve those astounding results.  </p>\n\n\n\n\n\n\n\n<p><strong>In this course you will take</strong> one giant step forward toward author wizardry. So get the tactics that will help make your dreams come true. <br></p>\n\n\n\n\n\n\n\n<p>You'll get up close to a bunch of techniques I've mastered by hanging around some of the world's top publicists, marketers and best-selling authors.</p>\n\n\n\n\n\n\n\n<p>The potent tactics, given here as easy-to-digest key principles alongside strategic exercises, will help transform your career into something you can make a living from. </p>\n\n\n\n\n\n\n\n<p>You'll be armed forever with principles that can help you get your work out into the world.</p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Do you struggle to gain publicity or sales? </em><em class=\"redactor-inline-converted\">Have you wondered whether your lack of understanding the publishing business is holding you back? Do you assume </em><em class=\"redactor-inline-converted\">you either will get lucky or you won't, and therefore don't bother to learn how the professionals build their careers?</em></p>\n\n\n\n\n\n\n\n<p>I'm here to tell you you can improve--and faster than you ever imagined! </p>\n\n\n\n\n\n\n\n<p>In <strong>THIS COURSE</strong> I break it down precisely. The invaluable knowledge, laid out in this easy-to-follow course, will propel your career to another dimension without wasting time or money on marketing gimmicks. </p>\n\n\n\n\n\n\n\n<p>I lay out all the rules and techniques you can immediately begin applying to make your career spark. </p>\n\n\n\n\n\n\n\n<p>You'll notice the improvement quickly with more interviews, features in media, and a steady growth of a real community around your work. </p>\n\n\n\n\n\n\n\n<p>I go step-by-step over the key principles I've picked up working within my career of becoming a successful published author as well as the tricks to the trade I've learned from countless other successful authors. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Be Your Own Book Publicist: The Step by Step Guide", 
    "price": "40.00", 
    "instructors": "Jake Ducey", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856062_09c3_2.jpg", 
    "course_url": "https://www.udemy.com/be-your-own-book-publicist/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-21T19:12:02Z"
}