{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">You Can Benefit from my Experience in <em>Days</em> Without the Years of Struggle.<br></strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Ever feel like you can't get ahead because your writing doesn't stand out? Want to start seeing changes in your writing today, but don't know what to do? I know how it feels to work hard, and still not see results, because I don't have the right tools to succeed. This course will give you specific tools to start seeing results today.</strong></p>\n\n\n\n\n\n<p>From my own writing and life experience overcoming these challenges, this course offers real strategies to help you see true results in your writing immediately. Competitors offer similar courses at higher prices, but my chief goal is to see you succeed, because I know how it feels to struggle, and I want to help you know how it feels to succeed while offering you great value and real experience. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course offers actionable guidelines from every level of the writing process in a humorous and compassionate manner by someone who has years of real experience teaching writing and knowing how to make writing understandable for people like you. You can benefit from my experience without the years of struggle. I have included what I have learned in this course. </strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Average Student Review--5 Stars </strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">2600+ Students and growing</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">One of the best selling writing courses on Udemy</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Taught by a university professor and team lead with over 13 years experience teaching writing to thousands of students one on one and getting proven results</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Strapped for cash? **One of the Best Values for a comprehensive writing course on Udemy!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>What makes this course better for you than other courses: </p>\n\n<p>1. Many courses don't include visuals and exercises right alongside the lectures on different stages in the writing process. This course always does, and I explain each slide, visual, or exercise.<br><br>2. This course is one of the best values on Udemy where quality meets value. Since prices have risen, this course offers a great deal for the price you are paying compared to competitor courses without compromising on the course or content quality. The reviews speak for themselves.</p>\n\n<p>3. Compassionate teacher who cares about your success--I have struggled in my own writing, and I have learned through experience what works and what doesn't. I present personal anecdotes, stories, tricks, and experiences to help you benefit from my experience without the struggle. <br><br><strong class=\"redactor-inline-converted\">Here is what students in the course had to say. The proof is in the results students get and share in reviews:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<strong class=\"redactor-inline-converted\">Straight forward - No nonsense\"</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Excellent nuts and bolts for anyone interested in crafting a message that connects their audience with the intended meaning. Each section has not only video but slide examples! Thank you for building this course.\" </em><strong class=\"redactor-inline-converted\">Bob Marx--Udemy Student</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"Clear and precise!\"</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"This teacher has a very clear way of communicating the lessons she wants us to learn and all in all, this will be a very helpful course for my writing - no doubt! So I will, most definitely, recommend this course for any and all that would like to improve upon their writing skills. +1\" </em><strong class=\"redactor-inline-converted\">Geir Rødde--Udemy Student</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"A course for everybody - Superbly put together!\"</em><strong class=\"redactor-inline-converted\">  </strong><strong class=\"redactor-inline-converted\">Whojr01--Udemy Student</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">\"</strong>Amazing! </em><em class=\"redactor-inline-converted\">Great course! . . .  Very interesting structured course and a lot of tricks and tips for writers.</em><em class=\"redactor-inline-converted\">Thank you for this opportunity to write much better!\"  </em><strong class=\"redactor-inline-converted\">Elena Kostadinova--Udemy Student</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Rachel: Many thanks for creating wonderful courses! I am amateur learner. I took your two courses. I found your courses useful in two ways. First, your courses provided insights \"why\" I had been writing in a particular way. Second, I got some teaching tips. I am teacher by profession. Impressed with your teaching passion. Keep creating good courses.\"</em>  <strong class=\"redactor-inline-converted\">Dr. Ajit Kumar--Udemy Student</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"This is an great course, especially for a novice writer like myself. I learned so much about structure, word usage, organization, etc. The course is taught by an excellent teacher. I can't thank you enough!\" </em><strong class=\"redactor-inline-converted\"> Sandra Eastman--Udemy Student</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"I will be a better writer as a result of this course. Thank you</em><strong class=\"redactor-inline-converted\"> . . . </strong><em class=\"redactor-inline-converted\">\"  </em><strong class=\"redactor-inline-converted\">David Gulp--Udemy Student</strong></p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"This is the perfect course for anyone who has to do any type of writing . . . it was very much worth my time.\"  </em><strong class=\"redactor-inline-converted\">Larry Sweet--Udemy Student</strong><br></p>\n\n\n\n\n\n\n\n<p><br><strong class=\"redactor-inline-converted\">What This Course Does</strong></p>\n\n\n\n\n\n\n\n\n\n<p>  \t                    Weak writing will not sell. Clean writing sells. This course will help you write with style to create immediate results, and increase chances of a sale.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t    Learn to make your writing streamlined, stylish, and sexy. Make it stand out from the crowd. By taking this course and applying the lectures, the results from your writing will be  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>more sales</li>  \t<li>competitive quality</li>  \t<li>higher visibility</li>  \t<li>increased credibility</li>  \t<li>achieved writing goals</li>  \t<li>engaged readers.</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                    If you apply this fundamental, thorough, and professionally engineered writing system, your writing will get the attention you desire.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                    Join the 2600+ students benefitting from over 50 lectures and 5 hours of in-depth instruction, examples, and exercises.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                      This course is designed and taught by a university writing professor and published writer with extensive university training in writing and twelve years experience coaching thousands of students like you on the fundamentals and habits of effective writing style with powerful results and consistently high teaching evaluations.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Where do I start? </strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                            One of the biggest frustrations writers from all levels and genres face in improving their writing is \"where do I start?\"  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                            Do you feel like your writing style needs something more to stand out and be effective, but you're not sure what? Are you a new writer that needs more tools to hone your craft effectively? Or are you an experienced writer looking for ways to improve, get your reader's attention, and sell your writing?  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What Is Unique About This Course</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t      Tips without habits for execution will not accomplish results. That is why habits and attitudes are of equal importance. This course covers the fundamentals of effective writing style from the ground up, and it covers important habits and attitudes of effective writing.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t      In just a few days, you can also practice habits and attitudes that will help you get the most out of these tips. You will see lasting success at beating your competition.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Similar courses out there sell for $300, $400, $500, and $1000, and this course uses an academically researched approached based on a pedagogical (teaching) approach called \"Bloom's Taxonomy.\" This course is based on a carefully built system that produces results, and you get greater value for the price of this course with high quality instruction and results. </strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Also, unlike a book on the topic, this course is personalized and interactive, which produces real results as you follow the exercises and suggestions on a real piece of writing. You also have access to the instructor via Udemy email and questions are always welcome. I love to help. I love questions!</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Who Can Benefit From This Course</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">This course is designed for those learning the writing craft, </strong><strong class=\"redactor-inline-converted\">needing a thorough review on writing style, or wanting to tighten their prose. </strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>bloggers</li>  \t<li>business writers</li>  \t<li>people who write for profit</li>  \t<li>journalists</li>  \t<li>creative writers</li>  \t<li>academic writers</li>  \t<li>students</li>  \t<li>new writers</li>  \t<li>lifetime learners</li>  \t<li>copywriters</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">How This Course Is Designed</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                    The course is broken down into four sections, each section containing two strategies to help you improve your writing style, approach, and habits. These strategies will help you improve the clarity, flow, presentation, and results you create in your writing. The ultimate outcome and goal is writing that stands out and sells.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                    You will learn eight strategies, each with several techniques. Each technique contains a slideshow and a synchronized video lecture that elaborates on each slideshow. Each technique includes the following:  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol>  \t<li>The technique in a nutshell. </li>  \t<li>An explanation that elaborates on and clarifies each technique and best practices.</li>  \t<li>Examples to explain the technique in practice.  </li>  \t<li>Exercises and/or quizzes at the end of each overall strategy to test your knowledge, reinforce the material, and allow you to put the techniques into practice right away.</li>  </ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                          By the end of the course you will know how to do the following:  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Words and Sentences</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>Build better clarity, flow, and conciseness in sentences through better word economy.</li>  \t<li>Improve tone and structure through activated sentences.  </li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Structures and Paragraphs</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li> Increase the effect of each sentence through optimized word order.</li>  \t<li>Grab your reader's attention and keep it throughout the piece.</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Purpose and Presentation</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>Set clear goals and build unity in a writing piece to convince your reader. </li>  \t<li>Build credibility, back ideas with strong logic, and achieve desired results for writing that sells.  </li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Attitudes and Habits</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>Practice effective attitudes that will maximize results and improve your efficiency. And it will make the process a lot funner! </li>  \t<li>Create healthy writing habits that will increase productivity, improve results, and increase your chances of success.</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                    Each category includes a skill set to help you sharpen your style and craft. Enroll in this course now to get started on writing with quality that sells.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Please note that some of the videos call the course Writing That Sells: Techniques That Will Transform Writing, but the name of the course is now </strong>Become a Professional Writer<strong class=\"redactor-inline-converted\"> to more accurately reflect for the student the content of this course. Nothing else in the course has otherwise changed. </strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t      If you sign up for this course today, you can start writing like a professional almost immediately!</p>", 
    "end_date": null, 
    "title": "Become a Professional Writer: Build Prose From the Ground Up", 
    "price": "20.00", 
    "instructors": "Rachel Leroy                                 BA, MA, MFA", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242856_90fb_7.jpg", 
    "course_url": "https://www.udemy.com/writing-that-sells-techniques-that-will-transform-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-13T17:48:19Z"
}