{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>LinkedIn is the largest professional network in the world. Every person who wants to grow their career or business should use it. With over 380 million people around the global engaging with customers, colleagues and influencers, no sane business person should neglect the power of LinkedIn today. </p><p>But...</p><p>For most people, LinkedIn is strange and confusing...</p><p>The tools are unfamiliar, the thought of reaching out to strangers is uncomfortable and most people can't seem to see the value in it. </p><p>This happens because most people have never been trained on how to build a strong LinkedIn profile. </p><p>LinkedIn measures profile strength using the Social Selling Index score (SSI).</p><p>Most people have a score of about 25 out of 100. That's bad...</p><p>I have a score of 94...but it took me a long time to figure it out.</p><p>About a year ago my SSI score was about 50.</p><p>But I took a LinkedIn training course that changed everything.</p><p>By investing about 5 minutes per day in my LinkedIn profile, I was able to raise my score up to a 94 today. </p><p>This puts me in the top 1% of my company, industry, and all of LinkedIn. </p><p>This course helps you get there. </p><p>By following our step-by-step guide, committing to invest 5 minutes per day, you can have a LinkedIn SSI score of 85 or more in 90 days. </p><p>We walk you through the ideal profile photo, headline, how to add 500+ connections, and how to post content that others LOVE, all while making you an expert in your field. </p><p>Join today to start selling more, building your business, expanding your network, and reaching stratospheric business and personal success.</p><p>Look forward to meeting you.</p>", 
    "end_date": null, 
    "title": "Become A Top 1% LinkedIn Seller in 90 Days", 
    "price": "20.00", 
    "instructors": "Chad Pavel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651954_b5ec_2.jpg", 
    "course_url": "https://www.udemy.com/top-linkedin-seller-in-90-days/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T02:21:29Z"
}