{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tThe most  successful people in business can clearly and concisely share complex  technical concepts with anyone.  They run large firms. They are  venture capitalists. They are &quot;thought  leaders.&quot; They know how to communicate effectively and they are usually quite wealthy.  You can be that person.</p><p style=\"\">Here is where it all  starts.</p>  <p style=\"\">  \tBefore  you can &quot;wow&quot; them, before you can present the fancy graphics, before  you become a dazzling speaker, you must learn the fundamentals. You need  effective communication skills.  For those of you who are American  football fans, it would be like trying to execute a complex defense  before you know how to block and tackle.  </p>  <p style=\"\">  \tIn  this short seminar we present a simple, robust STUCTURE that we  use all the time for our presentations, seminars and especially emails  to senior leaders.  For those of you who are technical people (like the  staff at Communication for Geeks) and not authors, this structure  provides a very robust &quot;crutch&quot; that will help you be clear, organized  and extremely effective.  </p>  <p style=\"\">  \tLike  you we come from technical backgrounds, so we decided to use an example  from our past. Throughout this seminar, we&#039;ll use a real example of how  to communicate highly technical information to non-technical people. We  will show you how to<em style=\"\"> &quot;put it in terms that are important to the listener.&quot;</em>  </p>", 
    "end_date": null, 
    "title": "Become a Superstar at Work Without Going Back to School", 
    "price": "25.00", 
    "instructors": "Communication for Geeks®", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/323448_ad48_11.jpg", 
    "course_url": "https://www.udemy.com/communication-fundamentals-1-structure/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-20T18:31:01Z"
}