{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                                           Learn 7 Comedy Habits to be better at public speaking, consistently funnier and help rid the world of boring presentations!  </p>  <p>  \t                                                       This courses teachings, as referenced in Inc, Forbes, Fast Company, Lifehacker and featured by Prezi as one of the 5 best online training courses for presenters, outlines easy to apply steps from the world of standup comedy to improve your presentation and public speaking skills, using one of the most powerful tools available to us: Laughter.  </p>  <p>  \t                                                      What students are saying about it:  </p><p><em>\"This course was engaging, entertaining and filled with great speaking tips. I loved it! Thank you! It was like reading a great book, I couldn't turn it off.\"</em><br></p>  <p><em>\"The course is awesome! Hands down the best collection and presentation of resources I have found on public speaking (not normally the most exciting topic, but here it most certainly is!). Highly recommended.\"<br></em></p><p><em>“This course is great. I haven’t taken it yet but David drew a picture when he was 6 years old of a penguin drinking beer in a Chinese restaurant and it was clear the potential for slight wisdom and misguided creativity were there.” —Marita Nihill</em><em>, David’s Mother</em></p>  <hr>  <p>  \t                                              Top business speakers are using humor.  </p>  <p>  \t                                              They are developing laugh lines using the same process as comedians.  </p>  <p>  \t                                              You don't need to be a natural comedian to get laughs.  </p>  <hr>  <p>  \t                                                           We de-construct the process from standup comedy into 7 Habits and show you how to translate them into public speaking skills for the world of business. These 7 Comedic Habits are aimed at helping you deliver a more memorable, entertaining and engaging presentation, every time.  </p>  <p>  \t                                                           Whether you are a seasoned presenter or someone with a real fear of public speaking (like me!) these easy to apply steps will help you stand out from the crowd. These techniques are being applied by numerous TED talks, start-ups, entrepreneurs, keynotes, interviewees and professional speakers to further engage their audiences and we take you through how to do the same.  </p>  <p>  \t                                                           There are step by step assignments following each section that will help you develop your comedic writing styles and delivery methods. This is further supplemented with engaging viewing material from a number of TED talks and business presenters on the covered areas. This includes an impromptu performance by Robin Williams and video of my own jokes at some of California's top comedy clubs highlighting the techniques covered in the course.  </p>  <p>  \t                                                                           Most presentations are really boring. With application of these habits yours will not be!  </p>  <p>  \t                                                          These techniques will your make presentations more engaging and entertaining by:  </p>  <ol>  \t<li>Teaching you stand-up techniques that work in public speaking contexts.</li><li>Teaching you how to replicate the techniques being used by top TED speakers.</li>  \t<li>Showing you how to craft your key message into a memorable and humorous story.</li>  \t<li>Showing you to extract the funny and build it into joke structures through comedy writing techniques</li>  \t<li>Preparing you to test these jokes and stories on live audiences</li>  \t<li>Showing you techniques used by comedians to overcome stage fright and improve your delivery</li>  \t<li>Instructing you on how to open and close strong, make a great and funny first impression while getting laughs every time</li>  \t<li>Teaching you how to evaluate performances and identify which comedic elements should be added to your presentations</li>  \t<li>Teaching you how to manage an audience and hold their interest</li>  </ol>", 
    "end_date": null, 
    "title": "Become Better and Funnier at Public Speaking", 
    "price": "50.00", 
    "instructors": "David Nihill", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144228_0cc4_6.jpg", 
    "course_url": "https://www.udemy.com/7-comedic-habits-to-be-consistently-funnier-presenting/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-08T23:01:57Z"
}