{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">So you&#039;re writing... and that makes you a writer!</strong>  </p>  <p style=\"\">  \tAnd just like every athlete needs great warm-up exercises; so every writer needs great writing exercises.  </p>  <p style=\"\">  \t        This course is designed to get you started as a writer. To practice writing your words onto paper or onto your computer so that you can build confidence to write and publish your work.  </p>  <p style=\"\">  \t<strong style=\"\">What Makes &quot;Good&quot; Writing?</strong>  </p>  <p style=\"\">  \t        In this online writing course you’ll learn how to write the four clear principles of good non-fiction writing. The four &quot;C&#039;s&quot; I call them. And all the exercises are carefully designed to fit within that structure. Every time you do one, you are building technique in one of those four principles.  </p>  <p style=\"\">  \t        It&#039;s just like flexing a muscle at the gym - getting fitter helps you play your chosen sport better.  </p>  <p style=\"\">  \t<strong style=\"\">Practice Makes Perfect?</strong>  </p>  <p style=\"\">  \t        When people tell you that you need to practice whatever level of writer you are. But it can be hard to know what that means. This course gives you twelve exercises to choose from to get the practice you need, to find your own style when you&#039;re first starting to write, and to get into the groove quickly the more you master your craft. It helps you build the confidence to put your writing into the world and to press &quot;publish&quot;, whatever that means for you. Go through the exercises one by one, day by day, or just pick any single one as you feel like it to just get started or to get unstuck.  </p>  <p style=\"\">  \t<strong style=\"\">Who&#039;s This For?</strong>  </p>  <p style=\"\">  \t        This online writing course is designed for <strong style=\"\">authors and bloggers</strong> at any level, from this course you will learn how to write from good to great in just three minutes a day!  </p>  <p style=\"\">  \t        If you&#039;re taking any of <a href=\"https://www.udemy.com/u/cathypresland\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">my other courses</a>, then these are perfect exercises to get you into the writing groove in the first week of that course while you&#039;re planning out your book.  </p>  <p style=\"\">  \t        This online writing course to help you become a better non-fiction writer is also a perfect fit for anyone creating video, audio or any kind of written <strong style=\"\">information product</strong> - the same principles apply and these exercises will help you learn how to write engaging content whatever format you are using.  </p>", 
    "end_date": null, 
    "title": "Becoming A Writer", 
    "price": "20.00", 
    "instructors": "Cathy Presland", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38097_ccac_7.jpg", 
    "course_url": "https://www.udemy.com/becoming-a-writer-exercises/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-25T12:03:39Z"
}