{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Door knocking is perhaps the most important aspect of any political campaign. The interaction you will have with constituents allows you to develop a better understanding of the community's pulse, not only for what they wish to see government do, but also how they are likely to vote. Political parties spend a vast amount of time during elections door knocking, yet non-verbal communication is often overlooked by politicians and campaigners despite making up between 55% and 66% of what we communicate during typical door knocking interactions.</p><p>This course is suitable for all those who are on the campaign trail with seasoned politicians, new candidates, volunteers and campaign staff all finding value in this course, and applies to elections at all levels of government! No prior knowledge of body language of deception detection is needed as we cover all of this in this course!</p><p>This course will teach you </p><ul><li>The importance of non-verbal communication in door knocking</li><li>How to use your body language to maximize your message while door knocking. </li><li>How to detect deception in constituents resulting in better data for your campaign driving your GOTV efforts.</li><li>How to recognize emotional deception through micro-expressions. </li><li>How to use culturally normative body language practices to engage with minority populations in your riding!</li><li>How to use verbal and non-verbal cues in conjunction to manage conversations and create the proper power dynamics for D2D interactions.</li><li>How to use a variety to psychological principles to create report with constituents.</li></ul>This course includes<ul><li>49 videos including examples of key non-verbal and deceptive gestures you are likely to see while door knocking.</li><li>Approximately two and a half hours of condensed material so you can get out and use this information on the campaign trail without delay! </li><li>Life time access to the videos</li></ul>", 
    "end_date": null, 
    "title": "Body language for politics", 
    "price": "50.00", 
    "instructors": "Matthew Kane", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438264_a7e8_2.jpg", 
    "course_url": "https://www.udemy.com/body-language-for-politics/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T03:51:05Z"
}