{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Building relationships</strong> is something that we all do having learnt these skills from birth.  Developing healthy relationships as adults means building on these skills and refining them so that we can adapt around others’ needs as well as our own.  We <strong>interact with other people in many different ways</strong> - some of these interactions are transient whilst some of these interactions are deep and meaningful.</p>  <p>Building healthy relationships is one of the ways that you use your <strong>emotional intelligence</strong>.  The course covers the awareness and action part of how you interact with others in the outer world. </p>  <p>This course is a stand alone course for anyone interested in understanding themselves better and communicating with other people with more impact.  It forms part of a comprehensive course that explores emotional intelligence in more depth.</p>  <p><strong>Healthy relationships</strong> are built around mutual understanding that involves <strong>empathy</strong>, <strong>trust </strong>and an acceptance of each other’s <strong>values</strong>.  Some <strong>disagreement and conflict </strong>will be inevitable as this is where <strong>learning</strong>, <strong>creativity</strong> and <strong>understanding</strong> occurs.  It is not that conflict occurs that is the issue, it is how it is managed.  </p>  <p>In this course, we will explore the way that you build relationships using empathy, how you develop trust, <strong>manage conflict </strong>and work within <strong>ethical boundaries</strong>. </p><p>The course covers the <strong>DISC model</strong> looking at the behaviours of <strong>Dominance</strong>, <strong>Influence</strong>, <strong>Steadiness</strong> and <strong>Compliance</strong> and how these work together in teams. You get the opportunity to look at the four behavioral styles and how you can work better with others who have a different style to your own. <br></p><p>You'll receive all the information that you need and will be <strong>coached</strong> using<strong> loads of practical hints</strong> that you can use straight away.</p>  <p>The course is made up of a series of lectures and contains a comprehensive workbook. There are a series of interactive exercises that involve some activity with other people and some reflection.</p>  <p>The course material makes up a one to two day workshop so is equivalent to 8 -12 hour's training.  It forms part of our <strong>advanced emotional intelligence course</strong> endorsed by the <strong>Institute of Leadership and Management</strong>.</p><p>Please note that all programmes are continually\nrefined and updated to ensure they remain current and relevant.<br></p>", 
    "end_date": null, 
    "title": "Build Healthy Relationships using Emotional Intelligence", 
    "price": "30.00", 
    "instructors": "Robin Hills", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639348_3cd0_5.jpg", 
    "course_url": "https://www.udemy.com/interpersonal-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T15:27:54Z"
}