{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>JOIN OVER 600 STUDENTS ALREADY TAKING THIS COURSE!</p>\n\n<p><strong></strong><em><strong>Update:</strong> </em>Course last updated April 2016</p>\n\n<p>This is one of the most comprehensive courses on Effective Business Networking available on Udemy!  </p>\n\n<p>  \t    By taking this course, you'll be able to <strong>grow your network</strong>. As a result, you'll have <strong>deeper relationships</strong> with your colleagues, get <strong>better clients</strong>, and of course, <strong>make more money</strong>.  </p>\n\n<p>  \t   This course is perfect for you even if you don't consider yourself a \"people person\" and you dread the thought of going to networking events.  </p>\n\n<p>  \t   I myself am one of those people! I'm the classic introvert who would rather stay at home over going to one of those events where I have to schmooze and small talk. Yuck!  </p>\n\n<p>  \t   That said, I've figured out how to build a <strong>large network of colleagues, clients, and other professionals</strong> all of whom have helped me to grow my business in some way.  </p>\n\n<p>  \t   In fact, because of the network I created, I was able to take my business online and move to the Caribbean together with my family.  </p>\n\n<p>  \t   If I can do it, so can you!  </p>\n\n<p>  \t  In this course, I detail everything you need including how to:  </p>\n\n<ul>  \t<li><strong>Use key mental triggers to help others open up to you</strong></li>  \t<li>Know what the real \"magic word\" is when it comes to networking </li>  \t<li><strong>Answer the question, \"What do you do?\" in a way that gets people wanting to know more</strong> </li>  \t<li>Spot your ideal client from across the room and focus on only them</li>  \t<li><strong>Avoid events that will waste your time</strong></li>  \t<li>Skip the small talk that wastes time and money</li>  \t<li><strong>Use your body language to get people to respond positively before you even say a word</strong></li>  \t<li>Ask powerful questions that will give you amazing insight</li>  \t<li><strong>Know exactly how and when to follow up key contacts</strong></li>  \t<li>Know how to form a dream team and take your networking to the next level</li>  </ul>\n\n<p>  \t<strong>The main reason you should take this course is if you're interested in making your networking efforts actually pay off.</strong> If you want better clients and to grow your business, consider taking this course.  </p>\n\n<p>The main questions answered in this course include: </p>\n\n<ul><li>how to network for business</li><li>how to network effectively</li><li>networking for introverts</li><li>the right way to network</li><li>successful networking hacks</li><li>how to network the right way</li><li>and more! </li></ul>\n\n<p>  \tThrough networking effectively, I built a solid business and was able to take off with my family on an international adventure.  </p>\n\n<p>  \tNow, through this Udemy course, it's your turn!  </p>\n\n<p>  \t<strong>Get moving today by scrolling up and click the “Take This Course\" button!</strong>  </p>\n\n<p>  \t<strong>::</strong>  </p>", 
    "end_date": null, 
    "title": "Business Networking: Double Your Network & Make More Sales", 
    "price": 0, 
    "instructors": "Sean Marshall", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367062_cfc8_4.jpg", 
    "course_url": "https://www.udemy.com/double-your-network/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T03:01:33Z"
}