{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  <strong>Improve your business writing in a few easy steps.</strong>   </p><p>This course will teach you how to easily, quickly, and effectively write powerful business messages. </p><p>You will learn key strategies to</p>    <ul><li>Communicate the most understanding in the least time</li><li>Engage and keep your reader’s attention</li><li>Save time and expense for you and your reader</li></ul>        <p>You will also learn how to</p>    <ul><li>Develop a conversational tone and use positive language</li><li>Use plain expression and familiar words.</li></ul>    <ul><li>Identify the purpose of the message</li><li>Understand your audience</li><li>Apply tactics for adapting the message to the audience</li><li>Distinguish components of complete and effective sentences</li><li>Emphasize important ideas and de-emphasize unimportant ones</li><li>Write concisely by eliminating wordiness</li><li>Revise message to eliminate fillers, repetitious words and redundancies</li><li>Revise message to use jargon appropriately and sparingly, avoiding slang and clichés</li><li>Avoid words that explain the obvious or provide excess details</li><li>Use power words to show confidence and commitment </li></ul><p>Each lecture contains a writing guide, instructive slides, and an assignment and quiz to help you practice and develop effective writing skills. To get the most from this course, take an active role in reading, absorbing and completing the activities. </p>", 
    "end_date": null, 
    "title": "Business Writing - Write Powerful Messages with Success!", 
    "price": "25.00", 
    "instructors": "Lisa Kleiman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628024_348c_6.jpg", 
    "course_url": "https://www.udemy.com/powerful-business-writing-easily/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T15:45:03Z"
}