{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Through face-to-face lectures, stories and hands-on exercises, Tony Ruesing, a Professional Speaker, Personal Coach and Life-improvement Author, will guide you through how to deal with people that are thought of as “<em>difficult</em>.”</strong><br></p>\n\n<p>Tony has been an entrepreneur and speaker for over four decades. And through observation, networking, and personal interaction with thousands of people, he’s been able to accumulate a vast amount of knowledge that he wants to share with you.\n\n  </p>\n\n\n\n<p>Now you can access the information he shares with companies and organizations, along with other valuable insights you can apply to your own life, in business or at home.\n\n  </p>\n\n\n\n<p>Tony will show you how you can take what he has witnessed, learned and studied so you can utilize it to create your own way to getting along with others. This is one of the hardest but most beneficial things to learn in life.\n\n  </p>\n\n\n\n<p>Communication is as much an art, as it is a science, requiring both sides of your brain. All of us have had times when we wish we had said something differently.  It is less stressful to deal with difficult people with proactive rather than reactive responses.  \n\n  </p>\n\n\n\n<p>People are not nasty, and yet they have the potential for acting that way.  When they do, we sometimes identify their behavior as “<em class=\"redactor-inline-converted\">difficult</em>.”  All of us have had times when we wish we had said something differently.  It is unproductive to go through life always desiring perfection.  \n\n  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn how to deal with others, so you can stay on target and not get tangled in their web of craziness.</strong></p>", 
    "end_date": null, 
    "title": "Business Communications", 
    "price": "25.00", 
    "instructors": "Tony Ruesing, CSP - Member of the National Speakers Association", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/784382_1f08.jpg", 
    "course_url": "https://www.udemy.com/dealing-with-difficult-people/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-06T22:20:28Z"
}