{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Be better on camera with more confidence, authority, and comfort!</strong></p><p><em>Do you get nervous when speaking on camera?</em></p><p><em>Do you wish you felt more confident and had a better on camera presence?</em></p><p><em>Are you trying to be on television, a YouTube vlogger, or an online teacher?</em></p><p><em>Do you have to be on camera for an interview, and need quick media training?</em></p><p><strong>If you answered yes to any of those questions, this is the perfect course for you. </strong>Camera Confidence, will help you feel more confident, speak more clearly, and have an overall better on camera presence no matter what kind of video you are a part of.</p><p><em><strong>Learn from a television professional!</strong></em><br></p><p>Christian Hartnett is a multimedia journalist with over a decade of on camera experience. He has a bachelor of arts in broadcast journalism and was recently the youngest field reporter for CBS San Francisco. He's learned many tips and tricks over the years that have helped him be successful. He's also made a lot of mistakes and struggled to be confident on camera, <em>just like you.</em><br></p><p><strong>Course Overview:</strong></p><ul><li>Start off with daily routines that help you speak better</li><li>Learn the basics of on camera preparation</li><li>Be more passionate and ready for your topics with research, outlining, and scripting,</li><li>Practice speaking on camera and get our helpful feedback to improve</li><li>Use your body (voice, breathing, face, eyes, mouth, hands, arms, legs) to be more comfortable on camera</li><li>Learn specific techniques to be better for TV appearances, YouTube vlogs, and online courses</li></ul><p><strong>What makes this class the best? <em>Practice &amp; get feedback!</em></strong></p><p>To succeed in this course, you'll need to take action and participate in our practice exercises. Some of these include submitting practice videos where we'll give you honest, critical, and helpful feedback. Use this feedback to improve!</p><p><strong>Enroll now to be better on camera!</strong><br></p><p>Increase your confidence for your next video, television appearance, YouTube vlog, or online course. </p><p>Cheers,</p><p>Phil &amp; Christian</p>", 
    "end_date": null, 
    "title": "Camera Confidence Media Training: Be Better On Camera", 
    "price": "20.00", 
    "instructors": "Phil Ebiner, Christian Hartnett", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/760814_1bdc_3.jpg", 
    "course_url": "https://www.udemy.com/camera-confidence-media-training/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-12T17:38:17Z"
}