{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Important notes:</em>  </p>  <ul style=\"\">  \t<li style=\"\">Current promotional price is $29, but      will increase to $149 </li>  \t<li style=\"\">New lectures and updates </li>  \t<li style=\"\">Support </li>  </ul>  <p style=\"\">  \t          Good communications is about developing image, reputation, credibility and authority. It influences opinion and behaviour all organisations have to communicate.  </p>  <p style=\"\">  \t      They have no choice.  </p>  <p style=\"\">  \t      They must influence all those groups around them, upon which their success relies, by the projection of their actions and reactions.  </p>  <p style=\"\">  \t      Manufactures, producers, retailers, suppliers all have to make sure their messages are communicated consistently and coherently to every audience both inside and outside of the business.  </p>  <p style=\"\">  \t      Development of a strong brand positions a range of products and services a company brings to the market. It conveys the value of the company.  </p>  <p style=\"\">  \t      Branding is increasingly important where product differentiation is less easy to establish. The rise of social media and technology and the ability to deal direct with the end consumer, is generating significant complexity in the supply chain.  </p>  <p style=\"\">  \t      As today’s consumers have been conditioned by multiple industries, to expect personalised interactions across different channels.  </p>  <p style=\"\">  \t      It is all about customer connectivity. Omnichannel retailing has created multiple sales opportunities for retailers. Simultaneously it is creating havoc in their operating model and upstream supply chains, whilst they attempt to integrate the e-commerce purchasing volumes. Allowing them to develop the buy-anywhere-fulfil anywhere and return anywhere retail consumer experience.  </p>  <p style=\"\">  \t      This course provides a practical examination of the communication process within the modern SC&amp;L.  </p>", 
    "end_date": null, 
    "title": "Communications in the Supply Chain", 
    "price": "20.00", 
    "instructors": "Nigel Devenish", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307782_abae_3.jpg", 
    "course_url": "https://www.udemy.com/communications-in-the-supply-chain/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-25T17:38:18Z"
}