{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        In this course you will learn, examine and be able to apply; what questions are, what they can do and why we ask them. As well as examining and practicing active listening and common body language cues. In additional you will be able to recognise and respond to both positive and negative question responses.  </p><p><strong>**UPDATED OCTOBER 2015**</strong></p>  <ul>  \t<li><strong>This Ultimate guide to questioning and listening will give you all the skills, tools and techniques you need to become a phenomenal interpersonal communicator...today! </strong></li>  \t<li>Learn what questions are and why we ask them </li>  \t<li>Appreciate the importance of recognising and responding to what is not said </li>  \t<li>Understand and practice active listening </li>  \t<li>Understand and be conscious of body language cues -both yours and the responder(s)</li>  \t<li>Examine and be able to apply 12 common question types </li>  \t<li>Appreciate and be able to communicate with people exhibiting a variety of question responses - both positive and negative</li>  \t<li>Download a series of 'Top Ten Question' lists </li>  </ul>  <p>  \t<strong>There is a reason questions are referred to as 'The Swiss Army Knife of Language' - They have the power to enable you to become an unrivalled communicator.</strong>  </p>  <p>  \t<strong>Content &amp; Overview</strong>  </p>  <p>  \t        Suitable for all levels, this course contains; 21 videos, quizzes, activities and supporting documents.  </p>  <p>  \t        I will take you through all stages of questioning and responding from the basics of what it is though active listening and body language, the 12 main question types and finally possible responses.  </p>  <p>  \t        All this will enable you to understand verbal interactions at a higher level, interact better with those around you and become an outstanding interpersonal communicator.  </p>  <p>  \t<strong>Think about it - how many questions do you ask each day? ....So what could you do if all of those questions were more productive, better constructed and response driven? The possibilities are endless!</strong>  </p>", 
    "end_date": null, 
    "title": "Communication: The Ultimate Guide to Questioning & Listening", 
    "price": "20.00", 
    "instructors": "Sarah Simpson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386660_ec0a_6.jpg", 
    "course_url": "https://www.udemy.com/your-ultimate-guide-to-questioning-listening/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T13:54:18Z"
}