{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>AHORA 7 HORAS DE VIDEO! Y MATERIAL EXTRA DESCARGABLE!</strong>  </p>  <p><strong>El Único Curso De Locución Online Que Abarca Técnicas y Ejercicios, Con La Sinergia De Producción De Audio Y El Español Neutro. Si eres emprendedor/a, Apúntate!</strong></p><p>  \t<strong>A partir de ahora te invito a sumarte a este video curso. Mediante Udemy les hago llegar esta propuesta que me parece muy enriquecedora!</strong>  </p>  <p>  \t<strong>Aprender a transmitir conceptos, ideas, vender a través de la voz, pero sobre todo aprender a hablar y expresarse mejor. Que nuestra comunicación sea limpia, clara y entendible.</strong>  </p>  <p>  \t<strong>A continuación les dejo las preguntas más recurrentes de mis interesados, las que he tratado de responder:<br>  \t<br>  \t        ¿Qué es un curso de locución?<br>  \t<br>  \t        Un curso de locución, es un plan de estudios, que en este caso tiene una duración de algo más de 6 horas, en donde bloque a bloque y capítulo a capítulo, a través de intensa práctica, se busca explotar y desarrollar las cualidades fónicas naturales de cada persona a través de ejercicios de lectura, dicción, vocalización, la incursión de los matices en la lectura, diferentes tonalidades e intenciones al transmitir un mensaje, concepto, etc.<br>  \t<br>  \t        ¿Por qué inscribirse?<br>  \t<br>  \t        Si nos ponemos a pensar que la principal, o una de las principales formas de comunicación que tenemos las personas es a través de la voz... ¿Porque no mejorar y perfeccionar nuestra voz y comunicación a través de una buena y correcta pronunciación? La dicción es muy importante. Problemas con diferentes vocales y consonantes (o la combinación de estas), por ej la letra “X\", muchas personas tienen problemas al pronunciarla cometiendo el error frecuente de pronunciarlas como \"S\", porque es más fácil y con menos esfuerzo de dicción. Para ser mas gráficos, por ej. la palabra “excelente\", muchas veces escuchamos decir “eSelente\" y no eXcelente. Comentiendo un vicio de dicción frecuente.  También en diferentes grupos consonánticos por ejemplo \"GN\" – escuchamos “Inasio\" en vez de “IGnacio\", o “NS\", \"tranporte\", en vez de “tranSporte\", falta de vocalización en diptongos, triptongos, etc.<br>  \t<br>  \t        Todo ese tipo de ejercicios que aparecen en el curso, nos van a servir por un tema de locución profesional, pero también nos va a servir para la comunicación en lo cotidiano, en nuestro trabajo, etc. Si eres una persona que no articula bien al hablar, este curso te servirá de mucho!<br>  \t<br>  \t        Para los que aspiran a ser locutores profesionales, también encontraremos otras facetas como es la entonación, matices, expresión, capacidad histriónica, correcta lectura, etc, una serie de elementos que se van aprendiendo y ejercitando paulatinamente.<br>  \t<br>  \t        Es muy interesante los bloques de edición de audio, donde el alumno aprende durante el curso a grabar y producir sus propios audios, spot, es decir, aprende  a grabar y editar de forma digital, sin depender de estudios externos, si no que recibe también esa capacitación conjuntamente con otro módulo que le hemos puesto \"inserción laboral\" donde vamos explicando, conociendo, cómo, que pautas seguir, ventajas, preparación, conocimientos, radio, la grabaciones para el extranjero, cómo, donde y de qué forma presentarse, etc.<br>  \t<br>  \t        Ahora y no menos importante, una última recomendación: Este curso es sin duda imprescindible para quienes realizan video tutoriales, como Yo. <br>  \t<br>  \t        ¡Un buen saludo y hasta pronto!<br>  \t<br>  \t        Mauro Martínez.</strong>  </p>", 
    "end_date": null, 
    "title": "Como Mejorar Tu Voz y Vencer Todos Tus Miedos: Locución PRO", 
    "price": "50.00", 
    "instructors": "Locutor / Productor. Mauro Martinez", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164812_9c67_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-locucion-y-mejora-tu-voz/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-15T17:21:03Z"
}