{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t Sobre que es este curso?\r\n</p>\r\n<p>\r\n\t Este curso es único , lograra resolver tus dudas de cómo empezar a ordenar tus ideas para escribir un libro conocerás métodos convencionales y alternos, Temas altamente emocionales, Metáforas exitosas, neuromarketing para tu titulo y portada, estrategias para hacerlo realidad!!\r\n</p>\r\n<p>\r\n\t Que clase de materiales incluye?\r\n</p>\r\n<p>\r\n\t Podrás tener acceso a vídeos donde te explico directamente algunas clases así como presentaciones en cada modulo donde narro cada paso explicándolo de forma amena y practica.\r\n</p>\r\n<p>\r\n\t incluye vídeos presentaciones, ejercicios, esta estructurado de forma inteligente para que todas tus dudas queden resueltas, que esperas cumple tu sueño!\r\n</p>\r\n<p>\r\n\t Cuanto tardaras en completar el curso?\r\n</p>\r\n<p>\r\n\t El tiempo estimado si lo realizas en una sola sesión con todo y los ejercicios es de 4 horas\r\n</p>\r\n<p>\r\n\t Como esta estructurado el curso?\r\n</p>\r\n<p>\r\n\t Se encuentra estructurado en lecciones numeradas para que las realices de forma secuencial con el propósito de iniciar tu viaje conectando con tus dudas desde como empezar pasando por métodos, titulo , contenido y finalizar con la difusión de tu libro\r\n</p>\r\n<p>\r\n\t Porque tomar el curso?\r\n</p>\r\n<p>\r\n\t Porque la simple razón de hacer realidad tu libro\r\n</p>\r\n<p>\r\n\t cuento con la experiencia de haber escrito mas de 10 libros, 5 de ellos publicados a nivel nacional en mi país, cuento con lecciones y métodos no convencionales que te ayudaran a ver materializado tu libro más rápido,\r\n</p>\r\n<p>\r\n\t siempre me preguntan como puedo empezar, escribir, terminar mi libro\r\n</p>\r\n<p>\r\n\t he dado esta clinica de forma presencial muchas veces con alto exito, el 40% de los asistentes publican su libro de 3 a 6 meses!\r\n</p>\r\n<p>\r\n</p>", 
    "end_date": null, 
    "title": "Como Escribir un Libro", 
    "price": "25.00", 
    "instructors": "Fernando Sande", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/211132_6e9a_4.jpg", 
    "course_url": "https://www.udemy.com/como-escribir-un-libro/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-05T20:25:57Z"
}