{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tConference Calls-You Can Present Well On Any conference Call  </p><p>Imagine knowing that you can be great every time you present on a conference call. Wouldn&#039;t it be comforting to know that you have the ability to make people understand you and remember your key points anytime you give presentations on conference calls?</p>  <p>  \tIn this &quot;How to Present on Conference Calls&quot; course you will learn many practical tips, plus dos and don&#039;ts on how to speak effectively on telephone meetings. Teleconferences can seem deceptively easy and yet it can be hard to present in a way that captures and keeps attention from all the participants. Speaking on the telephone presents unique challenges, i.e., you can&#039;t see your audience or if they are paying attention. But teleconferences remain an important part of most organizations&#039; communication procedures.  </p>  <p>  \tThis course is structured around a series of lectures. The trainer is speaking to you and asking you to record yourself speaking in mock conference call exercises. learning how to speak more effectively can only be done by speaking more and by listening to yourself.  </p>  <p>  \tIn this course you will learn the following:  </p>  <p>  \t* Common conference call blunders to avoid.  </p>  <p>  \t*Best practices for preparing to present on conference calls.  </p>  <p>  \t*How to keep listeners engaged to your call, even when you can&#039;t see your audience.  </p>  <p>  \t*How to use notes effectively while on a conference call.  </p>  <p>  \tWhy wait any longer? You may have an opportunity to speak on a conference call as soon as tomorrow. so why not do what it takes now so that you will be great for your next presentation opportunity.  </p>  <p>  \tYour trainer, TJ Walker, has been coaching executives how to present more effectively on conference calls for decades. Now, for the first time, you can receive the same training he gives to Fortune 500 executives and world leaders, but at a small fraction of the price.  </p>", 
    "end_date": null, 
    "title": "Conference Calls-You Can Present Well On Any Conference Call", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341496_de59_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-present-on-conference-calls/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T16:24:15Z"
}