{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong>Multiple 5 Star Reviews already!</strong></p><p>I grew up in a village in South Africa during the Apartheid period. Given my Indian heritage, I was classified as \"non-white\" and had to live in an Indian designated area.</p><p>As a \"non-white\" person, there were restrictions placed on us. We were not allowed to eat at certain restaurants, not allowed to try out clothes in certain departmental stores, not allowed to visit certain beaches, and only allowed to use \"non-white\" bathrooms.</p><p>I made a decision at a young age that I would make something of my life and be someone.</p><p>Connect is a collection of the lessons I discovered by accident. </p><p>These lessons have resulted in me getting to meet some amazing people. I have been invited to the Playboy Mansion a number of times. I have been invited to meet Sir Richard Branson a number of times.</p><p>I have even been able to partner with a finalist from The Apprentice, the hit TV Show (the one with Donald Trump)</p><p>In addition, I've been able to meet one of my childhood idols, Russell Simmons, who was the manager of the group Run DMC. He is an amazing business magnate and a media mogul.</p><p>These introductions and invitations have only come about after implementing the lessons taught in Connect.</p><p>If you are ready to have a dream life, with incredible connections and access to many influential people, then this course is for you.</p><p>Start today and connect like you have never done before.</p>", 
    "end_date": null, 
    "title": "CONNECT - Become Influential and Connect with Anyone", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/637834_bc58_2.jpg", 
    "course_url": "https://www.udemy.com/connect-course/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T04:04:34Z"
}