{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Want to increase your confidence in speaking face-to-face? Need to engage or motivate an audience? Worried, anxious or even afraid of speaking in front of others?</p>  <p>Get rid of the fear of public speaking forever and gain the confidence to actually enjoy it. It’s possible and it’s not as hard as you think.</p><p>  <strong>Overcome the fear of public speaking, make an impact, and increase your confidence at work and in your personal life.</strong></p><p>Confident public speaking is a valuable skill for people in business and all walks of life. If you need to communicate, convince and connect with others, being a confident public speaker is a vital skill for your success.</p>  <p>Confident public speakers become leaders, people of influence and people others look up to.</p><p>Whether you’re a first-time presenter or public speaker or you have a lot of speaking experience, this course will teach you what you didn’t know about developing, maintaining and projecting confidence. </p>  <p>This is not a course on how to relax, or a course in what other (famous) people do to be confident speakers. Instead, you’ll get personal tools that you can use to develop your own unique skills and strategies to make sure that you – your authentic self and style – shine through and feel great when you have an important message to deliver.</p><p><strong>Content and Overview</strong></p>  <p>This highly practical course is suitable for those new to the world of public speaking and seasoned speakers who want to lower their anxiety, eliminate nerves and feel more confident.</p>  <p>The course provides practical techniques that will make you look and feel more confident. You’ll learn real strategies and develop the knowledge and skills to look and feel confident in every speaking situation, and ultimately enjoy the experience.</p>  <p>We’ll start with coping with fear. Then once we have those natural fears out of the way, you’ll start to develop the necessary skills to prepare yourself (mind and body) in advance and in between presentations. Then you’ll learn a number of specific and effective techniques for staying calm right up to and throughout your presentation. </p>  <p>This program is about what to do and how to feel, rather than about what to say. If you look and feel confident, you’ll be an engaging speaker. Without that, what you say becomes largely irrelevant to your audience and to you, because neither you nor they will have a pleasant and memorable experience. </p>  <p>After completing the course, you’ll have real techniques, tools and exercises that, if practiced, will build your confidence higher and higher every time you speak to an audience or group of people.</p>  <p><strong><em>My commitment to you</em></strong></p><em>  </em><p><em>I will continue to update the course on a regular basis, adding more content and exercises for your success. </em></p><em>  </em><p><em>I'm always available in the discussions and via private message to answer any questions you have.</em></p><em>  </em><p><em>I've been a journalist, communications coach and leadership mentor for many years and I know what works. So this course comes with a 30 day money back guarantee. Some people prefer different teaching styles, but I guarantee that what you’ll get from my program will be more than just theory or information. You’ll get practical skills and tools that will enhance your communications skills and your confidence. I've trained thousands of executives and leaders in numerous industries, all over the world and I’m confident that you will build your skills, knowledge and tools for greater success too.</em></p>", 
    "end_date": null, 
    "title": "Cool, Calm and Commanding: Public Speaking with Confidence", 
    "price": "20.00", 
    "instructors": "Warren Clarke", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657442_fc6a.jpg", 
    "course_url": "https://www.udemy.com/cool-calm-and-commanding-public-speaking-with-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T04:11:05Z"
}