{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong><br>  \t   IMAGINE, REGULARLY GETTING MORE THAN $3,000 FOR WRITING JUST 10 PAGES</strong>  </p>\n\n<p>  \t   That's how much <em>inexperienced</em> White Paper copywriters earn (source: Stelzner survey 2007).<em> Experienced</em> White Paper writers <strong>charge an average of $5,000 - $6,000</strong>. Every year. As for experienced freelance copywriters, I write a paper for the financial services sector every year – 8 pages long, $9,000.<br>  \t<br>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>You'll become an 'expert' writer</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   At the end of this short course, whether you're a copywriter, business owner, entrepreneur or marketing professional, you will be fully trained up to write your OWN White Papers. With confidence.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Just like me, you'll learn to be an expert writer, <em><strong>without being an expert in anything</strong></em>, Your client is the expert – you're paid simply to capture it on the page.<br>  \t<br>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>Learn from the best</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   What do I know about White Papers? Well, try doing a Google search for 'White Paper copywriter' and you'll see that I'm position number one, worldwide, out of 2.7 million websites.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   I've written them for companies like Oracle, PricewaterhouseCoopers, The Bain Company, IBM, Travelex and Lloyds.<br>  \t<br>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>Why is this course </strong><strong></strong><em><strong>unique</strong></em><strong>?<br>  \t</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   First of all, I share my own, personal STRUCTURE for a White Paper. I even give you a 'fill-the-blanks' template. I let you watch over my shoulder as I write a White Paper from scratch – and, if you want to, you can write it yourself – your very first!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   And I don't stop at showing you how to research them and write them. I show you how to promote them – successfully.<br>  \t<br>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>A shoulder to lean on</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Just like my other courses, I'm always available to answer your queries, or to explain things further, usually within 24 hours; I love to help. And, just like my other courses, this one will grow over time as students raise queries. It's a LIVING course that's yours for life.<br>  \t<br>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>Who'll benefit?</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Existing copywriters who are struggling to make ends meet, writing 'content' for five bucks a page. Aspiring copywriters, and anyone who's completed my course <em>How to Become a Successful Freelance Copywriter, Working from Home</em>. This course will really boost your business-writing skills.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   Entrepreneurs, start-ups and business owners will gain too. Learning how to write papers for their own organization – boosting sales leads and becoming a thought leader in their industry.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t   And remember, this is a Udemy course, so you have the security of a no-quibble, 100% money-back guarantee. You've nothing to lose, so join me right now in what I can promise will be a fascinating journey.  </p>", 
    "end_date": null, 
    "title": "Copywriting White Papers – An All Levels Strategy", 
    "price": "20.00", 
    "instructors": "Len Smith, Sean Kaye", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394084_6e23_3.jpg", 
    "course_url": "https://www.udemy.com/copywriting-how-to-write-a-white-paper/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T16:56:37Z"
}