{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><strong>Not getting job interviews? Write a great cover letter that gets you the job you want! </strong></strong>Badly written job cover letters <strong>eliminate 90% </strong>of job applicants. Most applicants are not competing against other applicants for scarce jobs — they are<strong> competing against themselves</strong>! </p><p><strong><strong>Take</strong> this </strong>university-level course, taught by an <strong>experienced</strong> <strong>business communication professor, </strong>that outlines the secrets behind every step in writing effective cover letters.</p><p>Give yourself the best chance to get the job you want by making a <strong>great first impression </strong>with an effective cover letter. </p><p>Write a cover letter in <strong>just over one hour </strong>as you follow detailed lessons that outline the main problems found in <strong>real cover letters produced by actual job applicants</strong>.<br></p><p>The course presents a logical process that works through the 3 parts of a job cover letter:<strong> the header, the body, and the footer</strong>.<br></p><p>In this comprehensive course, I help you:</p><ul><li><strong>deconstruct</strong> the advertisement to engage with the job's requirements;</li><li><strong>avoid</strong> the typical mistakes in the header;</li><li><strong>write</strong> clearly and <strong>edit</strong> for perfection;</li><li><strong>format</strong> the letter to create a pleasing page design;</li><li><strong>make</strong> a great first impression with the opening paragraph;</li><li><strong>remove</strong> vague, empty statements about your work experience;</li><li><strong>go beyond</strong> static statements about \"holding positions\";</li><li><strong>place</strong> your valuable skills in context;</li><li><strong>include<strong> </strong></strong>factual evidence and short stories of success; and,</li><li><strong>conclude</strong> in a straightforward way that avoids flattery.</li></ul><p>Udemy offers a <strong>30-day guarantee</strong>: if this course doesn't satisfy your needs, you can get a refund -- there's no risk to you!<br><br></p>", 
    "end_date": null, 
    "title": "Cover Letter Mastery to Get the Job You Want", 
    "price": "20.00", 
    "instructors": "Dr. Duncan Koerber", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694130_a067_3.jpg", 
    "course_url": "https://www.udemy.com/cover-letter-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T17:18:59Z"
}