{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p> Welcome to Design Your Presentation and Wow Your Audience course!<br style=\"\"></p><p> Learn crucial communication skills to set you apart from your peers<br style=\"\"></p><p>I am Rama, Amazon Best-Selling author of &#039;The Ultimate Public Speaking Survival Guide&#039; and Award Winning Speaker of more than 25 speaking contests. More than an author or a speaker, I am researcher and I keep looking for what works and what are the best practices.</p><p>We have designed this course to help you:</p><ul style=\"\"><li style=\"\">Get Creative Ideas to design your own presentation as quickly as possible. If you follow what is taught, you can even design it in an hour.</li><li style=\"\">Plan Your Content Properly. Unless you are confident of what you are going to say, you&#039;ll always feel a level of uncertainty. Say Bye to Bye to this sick feeling.</li><li style=\"\">Be Confident in Your Delivery. My mentor once said, &quot;You Win in Speaking by Writing&quot;. So, by creating and planning your content, you&#039;ll become confident to deliver your presentation.</li></ul><p>This contents of the course are based upon highly researched, time tested best practices followed by Professional speakers, TED speakers and highly effective communicators. </p><p>You could use this to create quick, meaningful and sensible presentations at your company, school or business. </p><p>Enroll Now or check out our preview to know more!</p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Craft Clear Content for Public Speaking", 
    "price": "20.00", 
    "instructors": "Ramakrishna Reddy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479656_c28c_2.jpg", 
    "course_url": "https://www.udemy.com/design-your-presentations-now-and-wow-your-audience/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T10:21:42Z"
}