{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Learn the basic concepts and methods that you will need to become the writer you wish to be. Acquire the knowledge of the proper writing tools to use, good habits to precede your writing session, how to find the appropriate Narrative Voice for each of your projects, tips on how to organize your writing day or night, a proven method to break through Writer&#039;s Block, ways to find your subject matter and how to go from one work to the next. Through all of this useful, often amusing, information, you will be guided by a seasoned, caring professional author and editor.  “I am determined to share all that I have learned in the publishing and writing worlds, all for the purpose of serving your needs, whether it be to improve, hone, and sustain your writing skills; or to provide you with step-by-step processes of publishing your work; or to satisfy your curiosity of what a professional writer&#039;s life is like. I have designed this course to allay any of your trepidations about the world and practice of writers and writing and to provide you with the day-to-day workable means of becoming the best writer you can possible be.</p><ul style=\"\"> <li style=\"\">Become a happy and successful writer through the lessons, techniques, and professional guidance provided in this course.</li> <li style=\"\">Discover the kind of writer you wish to be. Find your Brand.</li> <li style=\"\">Learn proven methods that cultivate your creative self.</li> <li style=\"\">Find out how to publish E books and/or trade paperbacks. The content of an effective cover letter. Resources on finding agents, editors and publishers. Learn, practice and master the three distinct stages for writing a successful work either of fiction or nonfiction.</li> <li style=\"\">Learn the literary devices that master writers have used to achieve their great effects.</li></ul><p style=\"\"><strong style=\"\">A Rounded, Realistic View of the Writer&#039;s Life &amp; Work </strong></p><p style=\"\">This workshop&#039;s environment is friendly, supportive and compassionate as it is based on decades of professional experience in the publishing and writers&#039; worlds. We learn from well-known writers such as Shel Silverstein and Kurt Vonnegut, Jr--with whom Mr. Valerio has worked--many of the lessons and techniques offered by this course.</p><p style=\"\">Writers of all levels--mainly practitioners of fiction &amp; nonfiction--can utilize this workshop to learn the processes of writing, revising and publishing; to practice the exercises provided; to refresh their writing skills; and also to have at will an inspiring approach to the life of a writer and his/her connection to the wonderful craft of writing.</p><p style=\"\"><strong style=\"\">In this course, together, we will fix--</strong></p><ul style=\"\"> <li style=\"\">instances of Writer&#039;s Block</li> <li style=\"\">a poorly written submission letter</li> <li style=\"\">anxiety over not having enough time to write</li> <li style=\"\">an unstructured writing life</li> <li style=\"\">“What do I cut?&quot;</li> <li style=\"\">“I cannot find my narrative voice.&quot;</li></ul><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">Suitable for beginning, intermediate and advanced writers, this animated multi-hour workshop will usher you into the workplace and life of a professional writer and editor. You will come to know what it&#039;s really like to be a writer, how a writing career is built one writing credit to the next—all for the purpose of finding the kind of writer you wish to be. This is <em style=\"\">your</em> workshop.</p><p style=\"\">Supporting by animation, you will receive step-by-step guidance on how to publish your work, both the self-publishing process and agencies and more commercial publishing. You will become professional in regards to writing an effective cover letter to literary agents, editors, and publishers. You will know which reference books to use in order to achieve your publishing goals.</p><p style=\"\">Culled from decades of writing study and practice, your instructor will show you through multiple lectures, examples and readings the literary devices master writers use to achieve their magical effects. You can listen along with your instructor as he reads a Short-Short in its entirety and then work along with him in breaking down the masterpiece into its components such as Time Sequence, Action, Dialogue, Image, Narrative Voice. You will begin to read and work in a professional way.</p><p style=\"\">By completing this course, you will have a greater knowledge of who you are as a writer and be inspired to practice the great art in a realistic way. In addition, you will receive a verifiable certificate of completion upon completing this course.</p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><p style=\"\">At the end of this course, “I hope…&quot; you will be inspired to write, and to have acquired the knowledge on how to prepare, structure and execute your work on hand. Take away with you that you can always return to your course for the knowledge that enables you to carry through, complete and, if you wish, publish your work. You will possess guidelines on choosing not only your subject matter and/or what your next project can be but also the <em style=\"\">kind</em> of writer you want to be--the “literary terrain&quot; you wish to occupy. Your uniqueness, if you will. Your Brand. You will have discovered the appropriate narrative voice foe each of your projects, as a good portion of your animated workshop of several hours and 12 lectures and examples and readings is devoted to exactly that: finding your narrative voice. You will know and utilize the three stages of effective composition. You will have mastered those literary devices great writers have used over the centuries—these devices will provide you with sufficient options, or tolls, to write your piece. You will know the reference points to gauge when your work is ready to send out to an editor, agent or publisher.</p><p style=\"\">“I designed this writing course to be accessible to beginning writers as well as to intermediate and experienced writers. I designed it so that it can remain a companion to you in your writing life, whenever and wherever you sit down to write. It is designed in a way to make your writing a happy, healthy, productive experience. Happy Writing!&quot;--Anthony Valerio</p>", 
    "end_date": null, 
    "title": "Creating Bestsellers: Concept to Sales", 
    "price": "40.00", 
    "instructors": "Anthony Valerio", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470234_bf5f_4.jpg", 
    "course_url": "https://www.udemy.com/learn-from-the-masters-anthony-valerio-on-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T21:08:23Z"
}