{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                         OVER 800 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE  </p>  <p>Learn how to give riveting presentations and be a great presenter.</p><p>Whether you are making a pitch to venture capitalists to fund your project, your boss to let you lead the next project, a prospective client to close a sale, or the local government officials about recycling, you want to make a presentation that is persuasive, inspiring, and motivating. Why is it that some presentations are boring and others are riveting? That's what you are going to learn in this course.  Whether you are new to presenting or an experienced speaker, this course will teach you how to go to the next level and beyond.  </p>  <p>  \t                                         Examples of what is in this course:  </p>  <ol>  \t<li>What you need to know about how people think learn, listen and see</li>  \t<li>The latest brain science on what grabs people's attention and how people learn</li>  \t<li>The psychology of how people react to you -- your voice, hand gestures, body posture</li>  \t<li>The \"Magic Formula\" to use when putting together a talk</li>  \t<li>Whether or not to use slides, and if you do, what to put on them</li>  \t<li>What motivates people to take action</li>  \t<li>Whether, when, and how to do a Q&amp;A</li>  \t<li>How to decide on a call to action for your particular audience</li>  \t<li>Quizzes to test what you are learning</li>  \t<li>Exercises to practice what you are learning</li>  </ol>  <p>  \t<em>and much, much more!</em>  </p>  <p>  \t<em>About This Course:</em>  </p>  <p>  \t<em>Over 800 very happy students</em>  </p>  <p>  \t<em>Unconditional 30 day money back guarantee from Udemy</em>  </p>  <p>  \t<em>All future upgrades and lectures are included for FREE</em>  </p>  <p>  \t<em>Includes a free evaluation of your presentation video</em>  </p>  <p>  \t                                         Click the \"Take This Course\" button at the top right of this page now and get started right away. You don't want to delay learning how to create and deliver persuasive, motivating and inspiring presentations.  </p>", 
    "end_date": null, 
    "title": "Create Great Presentations", 
    "price": "50.00", 
    "instructors": "Susan Weinschenk, Ph.D.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49464_ea20_9.jpg", 
    "course_url": "https://www.udemy.com/be-a-great-presenter/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-12T02:10:55Z"
}