{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tWhatever your position in the organization, you have to work with and for other people to get things done. Within every business environment, interpersonal friction is inevitable.  <br>  \t<br>  \tMaking the situation worse is that today we are all overworked and overwhelmed.  <br>  \t<br>  \tWhether it’s your boss, colleagues, or direct reports, people are prone to react emotionally, and they may prioritize their own agendas instead of focusing on what you need from them. In turn, these behaviors cause you friction in the form of distraction, frustration, and work delays. <br>  \t<br>  \tHere’s your chance to get immediate solutions for turning around every one of those difficult or out-of-control relationships.  <br>  \t<br>  \tThis webinar provides the concrete tactics, sage advice, and proven techniques for alleviating the friction and discomfort in all of your business relationships.  </p>  <p>  \t<strong>About Your Instructor:</strong>  </p>  <p>  \t<strong>Sharon Melnick</strong>, PhD, is an executive coach and dynamic corporate trainer who combines leadership effectiveness coaching with behavior change methods she developed over ten years as a psychologist at Harvard Medical School. She is also a leading authority on practical techniques to help executives be resilient in high-stress conditions. Her clients have included, among others, Deutsche Bank, Monster Worldwide, Oracle Corp., Merrill Lynch, Pitney Bowes, Deloitte Consulting, UBS, Korn/Ferry International, Northwestern Mutual Financial Network, Visiting Nurse Service of NY, and Carpenter Technology.  </p>", 
    "end_date": null, 
    "title": "Creating Friction-Free Relationships", 
    "price": "20.00", 
    "instructors": "American Management Association", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/275492_bd54.jpg", 
    "course_url": "https://www.udemy.com/creating-friction-free-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-05T20:29:15Z"
}