{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>So, why do you want to\nlearn more about having better ideas faster?</strong><br></p><p>You might be thinking that\nyou are neither <strong>TALENTED </strong>nor creative? Or you doubt as to whether\ncreativity can be learned at all? Or you are looking for <strong>INNOVATION\n</strong>for your new product or service? Or you are stuck in <strong>PROBLEM SOLVING</strong>?</p><p>For many people,\ncreativity and creative thoughts are associated with <strong>FEARS </strong>and\n<strong>ANXIETIES</strong>. Do you feel the same way?</p><p>If you said YES to some of\nthe questions, you have come to the right place!</p><p><strong>Experience</strong></p><p>Based on my many years of\ndealing with this topic, and the work I have done with thousands of\npeople and organizations I know that you can be creative, too!</p><p><strong>Latest Research</strong></p><p>You will have access to\nthe results of latest scientific research and practical tools, and\nyou will be able to test your creativity. Various exercises will\nsupport you in your intentions. The exercises are proven to work and\nhelped people and organizations to rediscover their creative sources.</p><p><strong>Learn 6 easy Proven Steps </strong><strong></strong><br></p><p>Learn how to easily follow\n6 Proven Steps to make sure that your thoughts and ideas are not\none-day wonders. You will learn how to implement and test them as\nwell as turn them into innovations – if you like.</p><p>Therefore, I wish you much\nfun, enjoyment and the real new brain storm with the most satisfying\nactivity by being creative!</p>", 
    "end_date": null, 
    "title": "Creativity - Get Better Ideas Faster and Make Them Reliable", 
    "price": "30.00", 
    "instructors": "Michèl Keller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705752_7c84_3.jpg", 
    "course_url": "https://www.udemy.com/creativity-get-better-ideas-faster-and-make-them-reliable/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T13:16:38Z"
}