{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>_________________________________________________________________________</strong></p><p><strong>✓ Updated as of November 2015<br>✓ Free Access to my course on How to create professional Website in a Day.<br>✓ Teacher with over 3,000 Happy Students<br>✓ 100% Student questions solved. Also via skype.<br>_________________________________________________________________________</strong></p><p>Students, just need a computer, and an internet connection to get started.</p><p>No specific software required, nor additional materials. No need for big effort or patience. Very straight forward and suitable for any mindset!</p><p>100% Beginner-Friendly.</p><p>No matter where you are located, what your nationality or age is, you will get a vast knowledge and entire description on the process of how to create a personal email address. It's 2015. Let's face it. No matter if you have a car shop or a multi million dollar cake-shop business, you need a professional email address that doesn't finish in @google or @yahoo - There is no other way that people are going to take you serious.</p><p>In this course, I commit to teaching you how to:</p><ol><li>How to study this course.</li><li>How to create your Zoho Account.</li><li>How to find out how you want your domain to look like</li><li>Purchase it via WIX (if not already purchased)</li><li>Link your mail services to WIX</li><li>Create your email accounts</li><li>Test-send your first email (you're set up from there)</li></ol><p>The terminology utilized in this course is easy to understand for non-native english speakers, for the purpose of making the learning of this course possible for anyone who has a basic english level. There is no necessary previous experience for taking this course. You will learn absolutely everything necessary in this course, and you will earn a huge knowledge on how to create your very own and high-end email address. As your teacher, I commit, to solving any doubt wherever it might appear. Please use this service at all times! It should take a couple of days, on an average, to effectively complete the course, since it's structured on easy-to-follow lectures put in a chronological order for the ease of learning. Make the most out of your free time. It will be a very easy beginning, and those who show enthusiasm and are constant on the course instructions, will feel very well compensated.</p><p>Ready for a change?<br>Get yourself a personalized email address!</p><p>Best,<br>Gonzalo</p>", 
    "end_date": null, 
    "title": "Create a Professional Email Address in 10min [CUSTOM & FREE]", 
    "price": 0, 
    "instructors": "Gonzalo F", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599800_e2e5_3.jpg", 
    "course_url": "https://www.udemy.com/professional-email-address/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T22:28:22Z"
}