{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Imagine that one of your airline's planes has gone missing and you must explain thing to the world's news media. It's not a pleasant situation, but you appear confident, you have a straightforward message and reporters are satisfied that you have been transparent and helpful. Wouldn't it be great to know that no matter how awful the crisis is, you can always speak to the media in a way that you convey confidence and can communicate the facts as they are known at that moment?</span>  </p>  <p style=\"\">  \tIn this Crisis Communications Training for Airline Executives course, you will learn the following:  </p>  <p style=\"\">  \t*How to prepare messages (in advance) for any airline crisis  </p>  <p style=\"\">  \t*How to make the media realize you are being transparent and helpful  </p>  <p style=\"\">  \t*How to avoid the common blunders made by other airline executives in times of crisis  </p>  <p style=\"\">  \t*How to answer tough questions in times of crisis  </p>  <p style=\"\">  \t*How to speak in sound bites and get the quotes you want  </p>  <p style=\"\">  \tThis course is delivered primarily through spoken lecture. Because the skill you are learning is speaking related, it only makes sense that you learn through speaking.  </p>  <p style=\"\">  \tThe skill you will learn in this class is not primarily theoretical or academic. It is a skill that requires physical habits. That is why you will be asked to take part in numerous exercises where you record yourself speaking on video, and then watching yourself. Learning presentation skills is like learning how to ride a bicycle. You simply have to do it numerous times and work past the wobbling and falling off parts until you get it right.  </p>  <p style=\"\">  \tThis course contain numerous video lectures plus several bonus books for your training library.  </p>  <p style=\"\">  \tTJ Walker has been coaching and training people on their presentation skills for 30 years. Now, through the power of Udemy's online platform, he is able to give you the same high quality training that he gives in person to CEOs, Fortune 500 executives, and Presidents of countries. Only you can now receive the training at a tiny fraction of the normal fee for in-person training.  </p>  <p style=\"\">  \tHow long this course takes is up to you. The longest part of the course involves you speaking on video, critiquing yourself, and doing it over until you like it. But if you get to the point where you love how you look and sound when you present it will be well worth the time spent. And having this skill will save you time for all future media presentations in your life.  </p>  <p style=\"\">  \tYou can begin improving your media presentation skills right now. You may have an opportunity to speak out as soon as tomorrow, so why waste another day worried that your media presentation skills are not up to high standards. Please enroll today.  </p>", 
    "end_date": null, 
    "title": "Crisis Communications Training for Airline Executives", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364190_910c_3.jpg", 
    "course_url": "https://www.udemy.com/crisis-communications-training-for-airline-executives/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T19:11:09Z"
}