{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t Imagine you wake up one morning and read a news flash on your smartphone or other mobile device that a major fire threatens your office building. You immediately remember that your organization recently practiced its quarterly disaster preparedness exercise. You know what to do, who to contact, and the location of the alternate office to use in case of an emergency. You are concerned, but you are confident that you have a plan in place. As a key member of the organization&rsquo;s crisis communication team (CMT), you know your role. You help management immediately prepare a news release and update the company&rsquo;s website with factual information on the who, what, when, and where details of the event. You use social media, such as Twitter and Facebook, and traditional media, such as radio and TV, to inform internal stakeholder groups (e.g., senior leadership, employees, and investors) and external stakeholder groups (e.g., customers, clients, local officials, and the general public) with appropriate key messages. During times of crisis, the public relations specialist helps management communicate that sound, safe, and responsible actions are being used to protect and defend the organization from harm or damage.  </p>  <p style=\"\">  \t Crisis communication is one of the many specialized areas or functions of public relations. This course will specifically focus on the use of crisis communication to protect and defend a company or organization facing a problem or challenge that threatens to harm its brand or reputation. As a sudden and unexpected serious event, a <em style=\"\">crisis</em> can fall into four categories: acts of God, mechanical problems, human error, and management decision or indecision. You may recall examples of crisis in news media coverage of killer earthquakes and tsunamis, grounded airplanes, stranded cruise ship passengers, and senior government officials or CEOs who are fired or asked to resign following adulterous affairs. If you want to learn to become a professional public relations specialist, it is important to have a basic understanding of the important role public relations has in helping guide a company or organization through a crisis or serious event.  </p>  <p style=\"\">  \t This course is designed for practical applications of crisis communication principles. This course will explain what communication problems look like, the different phases of crises, how to deal with them, and how to anticipate crises as part of conducting effective public relations program. It will also explain the role of a crisis communication team and teach you how to write a crisis communication plan. Most importantly, it will emphasize the value and importance of using social media in a crisis communication plan and in marketing. Through case studies, you will examine best practices that have worked for others. A diverse selection of resource materials will help guide and supplement your understanding for practical application. This course will cover certain crisis cases, including BP&rsquo;s oil rig explosion, a Wendy&rsquo;s customer&rsquo;s false claims, and a UPS employee strike. After completing this course, you may also be interested in conducting your own research to find examples of other crisis cases, such as: Carnival&rsquo;s Costa Concordia cruise ship, Lance Armstrong and the Livestrong Foundation, the Susan G. Komen Foundation, Penn State, or Toyota&rsquo;s 2010 recalls. These cases will give you an appreciation and understanding of the necessity to have a well-thought out crisis communication management system. The overall goal of the course is to help develop your skills and abilities as part of a crisis management team to help an organization or company develop a credible and tested communication plan to effectively respond to a crisis.  </p>", 
    "end_date": null, 
    "title": "Crisis Communication", 
    "price": 0, 
    "instructors": "Saylor Academy", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/139746_21ee_5.jpg", 
    "course_url": "https://www.udemy.com/crisis-communication/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-30T18:37:46Z"
}