{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Why Public Speaking?</em></strong><br></p>\n\n<p>Every single day we all have come across situations where we have to stand up in front of some kind of audience and speak. Maybe the place could be different. It can be your <strong>College, Corporate or Community.</strong> Believe it or not but <strong>p</strong><strong>ublic speaking is one of the most important skills you will ever develop in your life.</strong><br></p>\n\n\n\n\n\n<p>Your audience will take away only based on how you made them feel about what you have to say. Essentially, public speaking seems simple but only if you get the basics right.</p>\n\n\n\n\n\n<p><strong><em>Why should you listen to me?</em></strong> </p>\n\n\n\n\n\n<p>I have won more than 25 Public Speaking contests conducted by Toastmasters - world's largest community on communication and leadership. I have written 3 Best-Selling books 'Public Speaking Topic Ideas\", \"Toastmasters Secret\", \"The Ultimate Public Speaking Survival Guide\" in amazon.<br></p>\n\n\n\n\n\n<p><em><strong>Do you have any of these feelings?</strong></em></p>\n\n\n\n\n\n<ul><li>What will audience think if I make mistakes</li><li>I do not have an eye-catching look</li><li>I am not sure how to practice the skills</li><li>Not sure how to connect with my audience</li><li>Not sure how to use eye-contact, voice modulation, body language, and more</li><li>Not sure how to tackle presentation day butterflies.</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><em><strong>What Course is this all about?</strong></em><br></p>\n\n\n\n\n\n<ul><li>This course is a short,simple and step by step course that'll help you <strong>overcome all the above listed jitters and make your presentation as smooth as possible.</strong></li><li>You'll learn the <strong>strategies to speak like a true champion</strong>. From the Get-Go, it is going to be absolute content. If you are looking for something complicated, then this is not for you.</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>If you want '<em>No Fluff</em>' but just <em>'Pure Content'</em>, then taking this course will be the next best thing. (the best thing is to 'implement' what is given)</p>\n\n\n\n\n\n<p>If you have come till here, then chances are that you liked the course details. These are the same strategies and techniques which has personally helped me grow as a speaker. If you did not like, you'll always get your money back. However, if you like it and it helps - <strong>You'll Speak as smooth as silk</strong><strong>!</strong></p>\n\n\n\n\n\n<p><strong>Words have power that it can make heart soar or sore. </strong>So use the techniques mentioned in the course to win the hearts of your audience.<br></p>\n\n\n\n\n\n<p>  \t<strong>Every minute you delay is actually COSTING you - maybe at your job, at your community or in your business circle. </strong>  </p>\n\n\n\n\n\n<p>  \t<em>Enroll now!!! click top right!!!</em>  </p>\n\n\n\n\n\n<p>And remember, I'm here to help you anytime!<br></p>\n\n\n\n\n\n<p>Rama</p>", 
    "end_date": null, 
    "title": "Crucial Public Speaking Skills", 
    "price": "20.00", 
    "instructors": "Ramakrishna Reddy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297254_7992_9.jpg", 
    "course_url": "https://www.udemy.com/speak-as-smooth-as-silk/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-10T01:50:37Z"
}