{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>What do you do when you have to prepare a speech or a presentation? If you are like me a few years ago or like most people, you get anxious. Every time you think about the presentation you have to give you feel overwhelmed and you leave it for later. You keep procrastinating until you really have no more time left and you quickly prepare your presentation or speeches. Then you more or less wing it while presenting or giving your speech and you miss the opportunity to make an impact. Although you are still alive, you have a lingering feeling that the whole process could have been a lot better. And you are right.,</p><p>I want to help you get on the right track as you prepare your presentation or speech so you start well and you finish with a bang. In this course you will learn a practical 5-step process to craft a powerful presentation or speech that you can begin using straight away. This process will help you distill a clear message that your audience will understand, care about, and act upon.</p><p>A good preparation will help you communicate so people listen to you, remember you, and act on your ideas. This in turn will enable you to move others to action and get your startup funded, sell your products, get backing for your projects, and advance your career.  </p>\n\n<p>The course is structured around the 5 steps summarized in the acronym AIMER: Audience, Intention, Message, Explain, Review. This course is an investment in your communication skills. You will not only have an outline for your next communication, you will learn a process that you will be able to apply to every presentation you have to give for the rest of your life. Sign up now and start making an impact. Thirty-day money back guarantee applies.</p>\n\n<p>  \tUpdated August 2016.</p>", 
    "end_date": null, 
    "title": "Cut the Anxiety from Preparing Your Presentations", 
    "price": "50.00", 
    "instructors": "Dr Pablo F German", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/163302_c541_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-powerful-message/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-13T09:23:29Z"
}