{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">Why should you take this course?</strong>  </p>  <p>  \t                       People serious about making money take this course because they have to deliver a make-or-break presentation to:  </p>  <ul style=\"\">  \t<li>Do a pitch for a startup </li>  \t<li>Convince a big client</li>  \t<li>Get more sales</li>  \t<li>Gain support from their boss</li>  \t<li>Get a promotion</li>  \t<li>Get any audience to do what they want</li>  </ul>  <p>  \t <strong style=\"\">A simple elevator pitch won&#039;t do it for you...</strong>  </p>  <p>  \t                          Do you like to listen to the elevator pitch of other people? Of course not. So, why would others want to hear yours?  </p>  <p>  \t                          What WILL help you is to ensure that you have a true value proposition that&#039;s interesting, provocative, and shows your audience what&#039;s in it for them.  </p>  <p>  \t                       This course will show you how to make what you say valuable so you can persuade and motivate others to act on it. I will personally model the exact techniques and specific skills you need to do just that. You&#039;ll learn dozens of techniques you’ve never seen before to get <em style=\"\">YOUR</em> audience to do what you want.  </p>  <p>  \t<strong style=\"\">Don&#039;t take my word for it.  Hear what others have to say...</strong>  </p>  <p>  \t                       &quot;I figured Jason Teteak might have a few new tricks—but not much that I hadn’t heard before. I was wrong. Jason integrates the latest research on presenting, learning, and audience dynamics with a captivating style that plays with the ironic fact that he is doing presentations… about presentation skills. And therein lies the secret to this marvelous program.&quot;  </p>  <p>  \t<strong style=\"\"> - Philip Deloria</strong> - Professor and Associate Dean, University of Michigan  </p>  <p>  \t                          &quot;It&#039;s pretty simple. Jason Teteak walks the talk. In this day and age, finding a true thought leader amongst many is the key to getting to new levels. Listening to Jason and benefitting from his teachings will take you to that new level you seek. He is cutting edge, extremely practical and connects in a way that is motivating, informing and memorable. Some of the biggest benefits received from Jason are tactics, ideas and methods that are immediately implementable. Watch Jason’s program before your competition does.&quot;  </p>  <p>  \t<strong style=\"\">- Al Lautenslager</strong> - Best-selling Author, Guerrilla Marketing in 30 Days  </p>  <p>  \t                      “I have been to several seminars on public speaking and giving presentations, including Dale Carnegie training.  I truly went into this thinking that I couldn&#039;t possibly learn anything new, but I found myself scribbling notes like a mad woman during the presentation.  I quickly realized that these were tips and techniques that I had never heard before, and that I could use immediately upon my return to the office.”  </p>  <p>  \t<strong style=\"\">- Joey Monson-Lillie</strong> - Human Resources Manager  </p>", 
    "end_date": null, 
    "title": "Deliver an Effective Business Presentation", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/77652_22a9_13.jpg", 
    "course_url": "https://www.udemy.com/deliver-money-making-presentations-put-power-in-your-pitch/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-12T18:41:08Z"
}