{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\">Fragen Sie sich auch ab und zu, warum Sie es eigentlich nicht schaffen mit Ihren Kollegen über das Selbe zu sprechen? Erleben Sie Situationen, die Sie stören, aber nicht lösen können, weil Sie die Grundursachen nicht kennen? Wollen Sie in der Zukunft Entscheidungen treffen, von denen Sie aber nicht wissen, ob die richtig sind?</em></p><p style=\"\"><strong style=\"\">Wenn Sie auch nur eine dieser Fragen mit &quot;ja&quot; beantworten können, dann sind die Denkprozesse der Engpasstheorie definitiv etwas für Sie!</strong></p><p style=\"\">Unser Leben ist voll von impliziten und unausgesprochenen Annahmen. Die sind für sich genommen erst einmal nicht schlimm. Wenn wir aber auf Basis dieser Aussagen neue Annahmen treffen, dann entstehen schnell Denkfehler und wir verrennen uns. Das passiert sowohl im beruflichen, als auch im privaten Umfeld. In diesem Kurs lernen Sie</p><ul style=\"\"><li>Was sind Entitäten, Ursache-Wirkung-Beziehungen, implizite Annahmen und legitime Vorbehalte</li><li>Wie können Sie einen Gegenwartsbaum erstellen oder mit dem Zukunftsbaum in die Zukunft schauen</li><li>Sie bekommen Beispiele und können über das beigefügte Material alles nachvollziehen</li></ul><p>Die Denkprozesse der Engpasstheorie sind einfach zu erlernen und schnell im Workshop oder alleine durchgeführt. Diese Einfachheit machen Sie zu einer sehr geschickten und guten Methoden, mit allen Parteien im Unternehmen zusammen über das Selbe zu sprechen und nicht mehr von unterschiedlichen Standpunkten auszugehen.</p><p>Wir legen den Fokus auf</p><ul style=\"\"><li>den Gegenwartsbaum und</li><li>den Zukunftsbaum</li></ul><p>Bei Bedarf kann der Kurs noch auf andere Baumarten erweitert werden. Ich zeige die Baumarten an Beispielen und mit den beigefügten Hand-Outs können Sie in Ihrem Workshop die wichtigsten Dinge sofort nutzen und umsetzen. <strong style=\"\">Nutzen Sie jetzt Ihre Chance und sichern sich Ihren Platz in meinem Kurs, um eine einfache und effektive Methode zu lernen.</strong></p><p><strong style=\"\">Ich selber nutze diese Methode seit 2012 und habe diese für mich optimiert. </strong>Ich kann so die wirklichen Ursachen in Problemen erkennen und bei Unsicherheiten über zukünftige Entscheidungen die Denkprozesse der Engpasstheorie als Hilfe nehmen.</p><p><strong style=\"\">Ich freue mich auf Sie - bis gleich! :-)</strong></p>", 
    "end_date": null, 
    "title": "Die Denkprozesse der Engpasstheorie", 
    "price": "50.00", 
    "instructors": "Sebastian Schneider", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364268_889b.jpg", 
    "course_url": "https://www.udemy.com/die-denkprozesse-der-engpasstheorie-toc/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T21:50:13Z"
}