{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\">&quot;Quality course, worth </em><em style=\"\">the money&quot;</em></p><p style=\"\"><em style=\"\"></em><em style=\"\">&quot;Anyone can benefit from this course&quot;</em><br style=\"\"></p>  <p style=\"\">\t<strong style=\"\">Do you want to get your message through the noise? <br style=\"\">\t Do you want to make a bigger impact?</strong>  </p>  <p style=\"\">\t You know you need to be on the web. You know you need a website, a blog and social media pages. But is that enough to be found and reach people? NOPE.</p>  <p style=\"\">\t<strong style=\"\">This digital pr course will teach you all you need to know to craft a strong online presence and get your message to spread powerfully.</strong>  </p>  <p style=\"\">\t Because you want your brand to be known and respected. Because you want to be heard. And let&#039;s face it, with all the content published every second from every corner of the web, getting your message through the noise is hard.</p>  <p style=\"\">\t But this course will make it easier. After completing it, you will have:</p><li>All the tools you need to find and connect with influencers and journalists</li><li>Specific checklists to make sure your message is 100% digitally optimized</li><li>A solid, authoritative and consistent presence on the web</li><li>The ability to reach a better, wider audience</li><li>Lots of ideas on how to find your target audience and see what they&#039;re talking about</li><li>The right mindset and perspective to craft great branded content</li><li>Guidance on how to use storytelling the right way</li><li>A clear understanding of what effective communication online is really about</li><li>A step-by-step blueprint to audit, plan, execute and measure your efforts<br style=\"\"><br style=\"\"></li><p style=\"\">The web offers amazing opportunities but to be successful you need hard work. This online pr course gives you the<strong style=\"\"> mindset, tools and strategies you need</strong> to get your message through the noise and <strong style=\"\">connect more deeply, with a wider audience.</strong><br style=\"\"></p>  <p style=\"\">\t<strong style=\"\">Why Digital PR?</strong>  </p>  <p style=\"\">\t Public relations have always been crucial, and today they are more than ever. But the world they live in has changed and, like everything else, they need to adapt. Communication professionals are embracing new ways of crafting and spreading their messages, and those who don&#039;t are having a hard time. <strong style=\"\">The rules have changed: are you sure you are up-to-date? Are you able to not only work, but think digitally?</strong>  </p>  <p style=\"\">\t<strong style=\"\">Course structure and content</strong>  </p>  <p style=\"\">\t &quot;Digital PR Made Easy&quot; has a direct, to-the-point approach. It&#039;s designed to give you<strong style=\"\"> a solid understanding of internet pr without feeling overwhelmed. It will guide you through different stages while keeping you focused on what matters the most.</strong> Because today, with so much information, so much content and so much data, it&#039;s easy to get lost. Here, you will know what to focus on.</p>  <p style=\"\">\t<strong style=\"\">Take your online communication to the next level. Find and reach a wider, better audience for your brand. Join the course now.</strong>  </p>  <p style=\"\">\t<em style=\"\">You have a 30-day money back guarantee - no questions asked!</em>  </p>", 
    "end_date": null, 
    "title": "Digital PR Made Easy", 
    "price": "30.00", 
    "instructors": "Marco Capra", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/228978_d6da_2.jpg", 
    "course_url": "https://www.udemy.com/digital-pr-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-25T16:32:02Z"
}