{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this 1 hour webinar program you will learn how to be entertaining and make your audience feel comfortable and relaxed using your natural style. Have you ever wondered why some techniques seem to work for others but not for you? It all depends on your “Presentation Personality&quot; and in this program you&#039;ll learn how to leverage yours.</p><p><strong style=\"\">Why Rule The Room:</strong></p><p>Through our experience working with thousands of presenters, we&#039;ve discovered that most business leaders try to imitate the presentation style of others they think are good presenters. If you&#039;ve ever tried to “be like Steve Jobs&quot; and felt uncomfortable in front of your audience, then you know how it feels when you don&#039;t know how to leverage YOUR presentation personality. We know how to help you find yours, and we&#039;ve seen how it can make public speaking comfortable, successful and even enjoyable.</p><p>But don&#039;t just take out word for it, here&#039;s what others have to say:</p><p>“Jason is a master at understanding people. What has been interesting to me is that Jason uses his own techniques to “rule the room&quot; when he is teaching you how to rule the room. It&#039;s a sight to behold! Every time I was in a room with Jason, whether he was presenting or it was just a meeting, he always was able to grab people&#039;s attention immediately and make you feel like it was the most worthwhile time you have ever spent.&quot;</p><p><strong style=\"\">Jeremy Wright - </strong><strong style=\"\">Project Manager</strong></p><p></p><p>&quot;The key to success is shared here in a way that can be personalized to match your own style...Jason does for public speaking what style guides do for effective writing.&quot;</p><p><strong style=\"\">Peggy Burns - </strong><strong style=\"\">Assistant Dean for Advancement, University of Michigan College of Literature, Science, and the Arts</strong></p><p></p><p>“I used to sit in classes where the instructor would tell all sorts of jokes and get the class laughing, having a great time, and basically teach through entertainment. It was so intimidating to me; how could I be a good teacher like that? How would I learn to &#039;perform&#039; in front of an audience? The greatest knowledge that I gained was that I could be a successful trainer by simply being myself. Jason helped me to identify my innate strengths and develop those so that I could train in a way that was very comfortable and natural for me. My training style is now so genuine and effective, and I didn&#039;t have to try to be somebody that I&#039;m not. There are a lot of people and books out there that will tell you that if you want to train well, you have to do x,y,z, and that&#039;s just not true for everybody. Jason&#039;s approach is very dynamic--you don&#039;t have to fit a specific mold to benefit from it.&quot;</p><p><strong style=\"\"><span></span>Marissa Lipinski - </strong><strong style=\"\">Corporate Trainer</strong></p><p></p><p></p>", 
    "end_date": null, 
    "title": "Discover the Power of Your Natural Presentation Style", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520556_bab3_5.jpg", 
    "course_url": "https://www.udemy.com/archetype/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T17:27:21Z"
}