{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This practical course is all about<strong style=\"\"> developing and delivering short, sharp networking introductions and elevator pitches</strong>.</p><p style=\"\">If you use networking as a marketing tool for your business then <strong style=\"\">you&#039;ll find this course incredibly valuable.</strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">How to avoid the most common networking presentation mistakes</strong></li><li style=\"\"><strong style=\"\">How to develop compelling scripts that last 60 seconds or less</strong></li><li style=\"\"><strong style=\"\">How to deliver those scripts with energy and credibility</strong></li></ul><p style=\"\">Work your way through the <strong style=\"\">short step by step video lessons</strong>, and you&#039;ll quickly learn how script and deliver compelling business pitches in one minute or less,</p><p style=\"\">You get <strong style=\"\">Thirteen short, easy to follow video lessons</strong> supported by downloadable<strong style=\"\"> lecture transcripts, script templates, examples</strong><strong style=\"\">, and quizzes</strong>.</p><p style=\"\">Gavin Meikle is an experienced networker as well as an <strong style=\"\">engaging speaker and trainer. </strong> His style is upbeat and direct and every minute of video is <strong style=\"\">packed with valuable tips </strong>and advice. Gavin is also happy to answer your questions and to give you feedback via the online discussion board.</p><p style=\"\">The course consists of approx one hour of video teaching plus a number of self-study activities. You get<strong style=\"\"> lifetime access to the teaching materials</strong> so you can come back to it again and again for<strong style=\"\"> just one low initial fee. How&#039;s that for value for money?</strong></p><p style=\"\"><strong style=\"\">Take this course today and, when you apply the lessons learned, you will start to generate more sales and more enquiries</strong></p>", 
    "end_date": null, 
    "title": "Easy Elevator Pitches for Profitable Networking Meetings", 
    "price": "50.00", 
    "instructors": "Gavin Meikle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299014_bcef_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-noticed-at-networking-meetings/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-12T13:05:47Z"
}