{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>(**All video lessons are downloadable.  eBook version of the course is available in Amazon Kindle Store.)</strong></em></p>\n\n<p>If you are spending a lot of time in conference calls to do business, your work performance is much affected by how well you spend your time in this virtual workplace. </p>\n\n<p><strong>Our course is created with the purpose of turning general call takers into value creating professionals in managing communication with virtual team.  </strong></p>\n\n<p>It is divided into 3 parts:</p>\n\n<ol><li>We will let you know the 6 drivers of a productive call. </li><li>We will revitalize your mindset towards conference calls by introducing new concepts and a toolkit that will let you realize how much of your workload is actually being invested in calls and how productive those investments are. </li><li>We will provide an exceptional guideline on how to improve each of 6 drivers.  This will equip you with skill set to become the value creator.</li></ol>\n\n<p>The course will provide <strong><u>downloadable conference call assessment toolkit</u></strong> so you can score your existing calls and identify area that needs improvement.</p>\n\n<p>Jay is a professional with 12 years experience who had worked on projects that involves various countries as a PMO and handled a lot of offline and online communications.  She will be sharing her field experience on how to handle difficult situations in a call involving multiple nations, languages and cultures.<br></p>\n\n<p>Niki is a professional who had worked at multinational company for 15 years and had to go through a lot of teleconference communication working on vendor side as well as client side.  She will be sharing how to be an effective liaison between multiple parties and derive synergy in working together.</p>", 
    "end_date": null, 
    "title": "Effectively Managing Conference Call with Virtual Team", 
    "price": "20.00", 
    "instructors": "Jay Jung, Niki Jung", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456506_9e37_2.jpg", 
    "course_url": "https://www.udemy.com/timetoimprove-concall/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T06:48:40Z"
}