{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>News on 27.2.</strong></p><p><strong><em>Two new lessons have been added:</em></strong></p><p><strong><em>* Gathering Experience and </em></strong></p><p><strong><em>* How to work best with this course</em></strong></p><p><strong><em>At the moment we are preparing three additional lessons about How to build Rapport to your target audience. We will pulish as soon as it will be ready</em></strong></p><p><strong><br></strong></p><p><strong>News on 27.12.</strong></p><p><strong><em>I have reached a first goal for the course: over 1000 students in 2015. Now I am preparing some more lessons and will publish them in January. I hope you will enjoy.</em></strong></p><p><br></p><p><strong>Intro</strong></p>  <p>Many large and small companies torment themselves with customers, they already have while never winning their dream customer.</p>  <p>The Elevator Pitch 2.0 - technology allows you to get in touch with those people and companies, you always dreamed about.</p>  <p>Rather than hoping that your dream customer (your dream employer) will eventually get back to you, you now have the possibility to get active.</p>  <p>The Elevator Pitch 2.0 – Technology shows you in easy steps, understandable for everyone, how to approach a customer, test his interest and, therefore, you will be much more successful in reaching those customers, you always wanted.</p>    <p>“With the Elevator Pitch 2.0 – can I win every customer?” – “No, the Elevator Pitch 2.0 - Technology is not magic. It gives you the means to assess quickly and efficiently which of your customers are worth your time and which are not. Its application increases your chances to get your dream customer’s attention, wake his interest and win him over as a loyal customer.”</p>    <p><strong>Content</strong> <strong></strong></p>  <p>• In an introduction to the Elevator Pitch, I teach you the theoretical foundations</p>  <p>• We deal with the target audience - what fits, what does not fit</p>  <p>• Develop a specific USP</p>  <p>• And create an Elevator Pitch from it</p>  <p>• In the evaluation of the results we are implementing the AIDA method</p>  <p>• Finally, you will learn how to position an elevator pitch as part of the sales process and how to successfully follow up.</p>    <p>This course is constantly growing. I am happy to take your feedback into account and based on your questions I will develop more course modules, which you, as an enrolled student can benefit from.</p>    <p>Since the author is not native to the English language, the course will be spoken by a professional speaker. The answers to your questions and feedback will be carried out directly by the author.</p>  <p><strong> </strong></p>  <p><strong> </strong></p>  <p><strong>Proceeding</strong></p>  <p>The course Elevator Pitch 2.0 is not just about knowledge. Our aim is to empower and encourage you to develop your own, precisely tailored Elevator Pitch and put it forward.</p>    <strong>Buy it now<br></strong><br>  <p>If you are striving to be more successful in your career, sell your potential customers your products and services or want to convince your supervisor about your ideas, then the Elevator Pitch 2.0 course is just the thing for you. Enroll now! With the growing interest, the price will rise. However, if you enroll now, you will benefit from all current and future contents at this competitive price!</p><p><strong>Money Back Guarantee</strong></p><p><strong>And there's an unrestricted 30 day, no questions asked, full money back guarantee from the great people at Udemy.</strong><strong></strong><br></p>", 
    "end_date": null, 
    "title": "Elevator Pitch 2.0: How To Sell Anything Effortlessly!", 
    "price": "25.00", 
    "instructors": "Daniel Kern", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/621172_11f2_3.jpg", 
    "course_url": "https://www.udemy.com/elevator-pitch-20/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T09:33:11Z"
}