{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>A demo is a powerful tool for creating interest, generating excitement, and getting more sales. Demoing doesn’t come easy.  Most people don’t realize how hard this is.  Just being a good speaker and knowing the software isn’t enough. Demoing is WAY more challenging than anyone imagines.  Many people, including your potential customers, don’t appreciate it’s complexity and then fail at demoing, and don’t even know it.</p><p>In this 1.5 hour program you will learn how avoid the mistakes that can sabotage your demo, and get your customers to crave your products and services.<br></p><p>Showing your audience you have the solutions to their pain points is the key to a successful demonstration.  We give you the exact steps and specific techniques to do it just the way we do, and we model if for you as you learn, so you can see precisely how it’s done.</p><p>Here's what others have to say about this course:</p><p><em>\"I must tell you that one of your UGM presenter-prep talks has stuck with me for\nyears -- and helped me win a \"Best Demo\" award earlier this year at my current\ncompany :) The part I remember most -- 'Say what you're gonna say... say it... and\nsay what you said.' Just wanted to be sure you knew your positive impact.\" -Karly\nSegal – Implementation Project Manager at Aventura </em></p>", 
    "end_date": null, 
    "title": "Entice Your Prospective Customers with Your Demo", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700094_d138_3.jpg", 
    "course_url": "https://www.udemy.com/demo-entice-your-prospective-customers-with-your-demo/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T16:42:57Z"
}