{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t      This course is designed to help anyone looking to establish their business identity online. The target audience for this course is someone trying to start a new business or someone who has a brick and mortar business that has not established themselves online. This course will also be valuable for any business that may have a single point of contact on the internet such as just a website or just a Facebook page.  </p>  <p style=\"\">  \t  The first section of the course looks at determining the type of identity the individual or business wants and then how to establish that brand. In this section we discuss presenting as a company versus a persona as well as resources for creating a logo and other images that may be needed.  </p>  <p style=\"\">  \t  In the second section of the course we walk the student step by step through the key online properties required to establish a solid foothold on the internet. We walk through the process of establishing a domain and website. Once the domain is established students are walked through setting up accounts on LinkedIn, Facebook, Twitter, and YouTube/Google. Additionally we talk about other resources that businesses need to examine to round out their presence depending on their specific niche.  </p>  <p style=\"\">  \tThe third section of the course takes a look at being present once the various social media accounts have been established. We look at methods for engaging potential customers both manually and by using some tools and tricks to reduce the workload and time spent online. Advertising is also covered in this section with a focus on Facebook and Google ad platforms.  </p>", 
    "end_date": null, 
    "title": "Establish Your Identity Online", 
    "price": "20.00", 
    "instructors": "Kip Ferguson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343844_c3c2_2.jpg", 
    "course_url": "https://www.udemy.com/establish-your-identity-online/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-14T02:59:03Z"
}