{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">OVER 3,500 STUDENTS! <em style=\"\"> Latest - Course updated March 2015</em></p><p style=\"\"><strong style=\"\">Imagine how freeing it would feel to speak - confidently, calmly, charmingly - in any situation.</strong> In this introductory course, I get you started with the basics: releasing your fear, shifting your mindset, and building skills to practice in everyday situations.  </p>  <p style=\"\">  \t  Why? Because every great relationship begins with hello. Do not wait until you have an important introduction to get comfortable speaking with new people.  The truth is you can start practicing RIGHT NOW.  The result?  More ease and confidence... and FUN.  </p>  <p style=\"\">  \t  Hi. I&#039;m Alexa Fischer.  </p>  <p style=\"\">  \t  I&#039;ve spent much of life speaking on stage and through the camera lens as a professional actress. You might have seen me on American television shows like NCIS, CSI, Numb3rs, Bones or one of about a million commercials. While I loved acting (and still do!) I wanted to connect with people as myself - not as a character I was playing. Speaking with conviction, overcoming fear, connecting with anyone, ever - these are skills that benefit all of us. So for the last five years, I&#039;ve been doing just that. I teach CEOs, private clients, online students (over 7300 Udemy students to date!), and huge companies how to connect - through video, sales-making pitches, engaging presentations, and small talk conversations people actually enjoy.  </p>  <p style=\"\">  \t  If you dread meeting new people, habitually avoid eye contact and generally tend to hold yourself back, then this course is for you. <strong style=\"\">When you can express yourself more easily, you invite more wonderful people into your life - both personally and professionally.</strong>  </p>  <p style=\"\">  \t  Here&#039;s what&#039;s inside the course:  </p>  <ul style=\"\">  \t<li>Simple exercises you can implement in every day - meetings, cocktail parties, and even client pitches</li>  \t<li>A shot of motivation to build your confidence (all your dinner party stories just got way better)</li>  \t<li>Ease of mind. Yes, you can hold a room, host a meeting, make that sale.</li>  </ul>  <p style=\"\">  \t  Enroll today!  </p>", 
    "end_date": null, 
    "title": "Everyday Conversation: Make Great Impressions + Connections", 
    "price": "20.00", 
    "instructors": "Alexa Fischer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8960_f036_13.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-101/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-08-05T07:37:26Z"
}