{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul>  \t<p><strong>EXCELLENT BUSINESS PRESENTATION SKILLS: are critical for leaders and business managers if they want to succeed. </strong></p><p>Millions of business presentations are given across the globe every day. Most are highly ineffective. They have unclear messages, fail to motivate or engage audiences, add little or no value and are frankly boring. The good news: it doesn't need to be that way.</p><p><strong>Start building your excellent business presentation skills today.</strong></p><p>Take that next career advancing professional step and decide to stand out from the crowd. Say goodbye to the fear and frustration of upcoming presentations and hello to audiences wanting to congratulate you on your clear, powerful and compelling messages.</p><p>Over 985 students know that being able to clearly and convincingly communicate their ideas is critical to their business success. Talent and skill are not enough. If you are not able to clearly and confidently present your key messages to others, you are highly likely to lose out to someone who can.</p><p><strong>YOU WILL LEARN HOW TO:</strong></p><ul><li>Prepare and deliver winning business presentations that have a laser like focus on the key messages that are most likely to influence and persuade your audience.</li><li>Grab and hold audience attention right from the start with breathtakingly simple ideas and techniques</li><li>Develop business presentation content that makes real connections with your audience enabling you to influence and persuade key decision makers</li><li>Use vocal and body language techniques to create and re-enforce compelling messages</li><li>Eliminate distractions and noise from your visuals, focusing audience attention on your key messages that matter</li><li>Reduce and control nerves to present with a calm, clear, confident manner</li><li>Unleash the power of 'less is more'</li></ul><p><strong><br></strong></p><p><strong>WHAT CURRENT STUDENTS SAY?</strong></p><p><strong><em>'This course really does nail it! It's clear, concise and to the point</em></strong>' - James Cooke </p><p><strong><em>'This is one of my Udemy staples. I keep going back to this course, watching, and each time I learn something more to help my presentation skills. Highly recommended'</em></strong><em>.</em> - Sarah Arrow Business Blogger</p><p><strong><em>I think this is the very first course I have completed so far on Udemy, all in one day. Richard is an excellent instructor, very personable and down-to-earth. The course is well-organized with very practical, helpful, action-able information; comprehensive, but not overwhelming (which is important). This is an EXCELLENT course , I highly recommend it.</em></strong><em> </em>Sherri Caldwell </p><p><strong>WHY TAKE THIS COURSE?</strong></p><p>to develop your presentation skills easily at your convenience, anytime, anyplace and on multiple devices.</p><p>lifetime access to your own highly experienced personal business presentation coach.</p><p>expert <strong>presentation secrets</strong>, tips and advice that are clear, concise and easy to implement in your presentations</p><p>high quality personal development from a highly <strong>experienced professional business trainer</strong> and presenter at <strong>low cost</strong>.</p><p>a <strong>learning community</strong> where you can ask questions and share experiences with fellow students as well as your tutor.</p><p>What have you got to lose? The course comes with a <strong>30-day money-back guarantee</strong> and <strong>lifetime access</strong> to course material, along with future updates and additions. You will receive a certificate of completion on finishing the course. The course can be accessed on computers, iOS devices and Android.</p><p>I look forward to sharing lively discussions and helping you <strong>become a confident, engaging and highly successful business presenter.</strong></p><p><strong>See you online.</strong></p><p><strong>Richard Lock</strong></p>  </ul>", 
    "end_date": null, 
    "title": "Excellent Business Presentation Skills Made Easy: Stand Out", 
    "price": "25.00", 
    "instructors": "Richard Lock", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224138_693c_13.jpg", 
    "course_url": "https://www.udemy.com/the-engaging-presenter/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T16:19:31Z"
}