{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t      You have a story inside and yet every day you stare at the keyboard, paralyzed and unsure of how to begin. You’ve tried to get your thoughts organized but you don’t have a strategy, and that leaves you feeling empty and defeated.  </p>  <p style=\"\">  \t      My name is J. Thorn and there was a time when I didn’t know where to begin either. It can be frustrating trying to organize your project. I know how hollow and helpless that feels because I&#039;ve been there. I can teach you what you need to know in a way you&#039;ll understand, so you&#039;ll be able to finish that manuscript in 60 days and feel like a champion.  </p>  <p style=\"\">  \t      The hard truth is that to write a novel, you must <em style=\"\">write</em>. No shortcuts or fancy software will do it for you. If you wanted to get in shape, you’d ask a trainer to teach you a workout. You’d want to learn the <em style=\"\">process</em> from a professional so you could do it for yourself.  </p>  <p style=\"\">  \t      A little help with organization and you can do what you thought was impossible. I’ve written more than ten novels and I’m going to share my process with you, which means you’ll feel confident and ready to finish that manuscript.  </p>  <p style=\"\">  \t      Sure. You could search Google for the best way to write a novel. You&#039;ll get thousands, if not millions, of hits and most of them will contradict each other. Some will be written by people claiming to be authors, yet they&#039;ve never written a single book. You&#039;ll waste countless hours and never get exactly what you need.  </p>  <p style=\"\">  \t      Or you can take my course and start writing that novel today. Right <em style=\"\">now</em>.  </p>", 
    "end_date": null, 
    "title": "Finishing a Manuscript in 60 Days", 
    "price": 0, 
    "instructors": "James Thorn", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321716_71e4_2.jpg", 
    "course_url": "https://www.udemy.com/manuscriptin60days/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T18:31:42Z"
}