{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>***JANUARY 2016 UPDATED. COMPLETE COURSE. GRAB NOW AT THE LOW SALE PRICE***</strong></p><p><strong>Webinars are a great tool but many people lack the confidence and skill to use them well. </strong>They struggle with them and are frustrated or avoid doing webinars at all. This course will give you the best practices and confidence you need so you can be comfortable and great on your next webinar!<br></p><p>  \t<strong>Has this every happened to you:</strong>  </p>  <ul>  \t<li>Takes forever to setup a webinar and usually forget something or screw up a setting leading to embarrassment  when the webinar is live.</li>  \t<li>Webinars doe not run smoothly and time is spent on trying to get the webinar to work right instead of focusing on the content of the meeting.</li>  \t<li>Had your boss, a client,  or someone else on the webinar complain about the setup and facilitation.</li>  \t<li>Something else that just does not make you super confident on webinars and know life would be easier if you could host flawless webinars that others rave about.</li>  </ul><p><strong>Then this course is for you.</strong> </p><p>The instructor is well versed in a variety of webinar types from traditional virtual  meetings to promoting your organization, working with prospects, and even selling educational webinars that generate $10,000 in revenue. Webinars can be high stakes endeavors and this course will help you to be at your best with 3 hours of great content.</p><p><strong>Course Overview</strong></p><p><strong><em>Section 1 </em></strong>looks at why do webinars in the first place and the key concept of understanding the goal of your webinar plus the difference between private and public webinars. You will understand the variety of ways webinars can be used and how you can take advantage of them.</p><p><strong><em>Section 2 </em></strong>goes over all the preparation work which is critical because if you do the prep well then better chance everything else goes smoothly and poor prep leads to poor execution. Great demonstrations how to setup a webinar that is not platform specific and concepts can be applied to other platforms. Plus how to work with other presenters and subject matter experts from sourcing and coaching to holding an effective dry-run in preparation for a high stakes webinar.</p><p><strong><em>Section 3</em></strong> is all about the big day and the best practices when you actually launch your webinar and what to do before others join. Also how to encourage engagement through the use of tools such as the Chat Box, Polls, and tips on holding effective question and answer sessions. Plus the benefits of recording and how it can be your best friend. What to do if disaster does strike such as the power going out or dealing with rude or unruly attendees. How to use reports to see who is paying attention on your webinar and how much as well as registration and attendance reports for your public webinars.</p><p>You will gain a tremendous amount of information you can use immediately from someone who uses webinars all the time in a variety of ways in an international environment and he will share all that expertise and best practices so you jump ahead in the use of this necessary tool and proceed with confidence, effectiveness, and productivity.</p>  <p>  \t<strong>Many of the learners in this course:</strong>  </p>  <ul>  \t<li>Have never done a webinar before or very few and a new role requires it or they want to make money with webinars as an entrepreneur.</li>  \t<li>Have done webinars but run into problems and want their webinars to be easier and more professional. Webinars can be a great professional strength if done well.</li><li>Use a wide variety of webinar platforms like Webex, Go-To-Meeting, and Google Hangouts and want to learn tips and best practices that are more than using a specific system but are universal in nature and go beyond simple setup but to a higher level of being great with virtual meetings.</li>  \t  </ul>  <p>  \t<strong>In this course you will learn how to setup and host a webinar for success. Period. </strong>  </p>  <p>  \t<strong>Don't wait. Click TAKE THIS COURSE and get started now</strong> and become recognized as a webinar pro that your peers, co-workers, bosses, and clients value highly. Thanks and look forward to seeing you in the training!</p>", 
    "end_date": null, 
    "title": "Flawless Webinar Hosting: Gain Confidence And Effectiveness!", 
    "price": "20.00", 
    "instructors": "Steve Ballinger, MBA", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414172_ce86_3.jpg", 
    "course_url": "https://www.udemy.com/flawless-webinar-hosting/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T15:00:44Z"
}