{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Most freelance writers fail--don't be one of them! I've been a successful freelance writer in New York for nearly 30 years, and in this course I'll share with you what I've learned—what works, what doesn't, and how to succeed.  </p>  <p style=\"\">  \t          Average freelance writers are almost always hustling for work and taking on bad-paying jobs to make ends meet. Increasingly, writers are being asked to work for free or for slave wages. By contrast, the top freelance writers comfortably make six-figure incomes year in and year out—I'll show you how.  </p>  <p style=\"\">  \t          You'll learn:  </p>  <p style=\"\">  \t<br style=\"\">  \t           1. If you have what it takes to make it as a top freelance writer--don't waste your time if you don't!<br style=\"\">  \t<br style=\"\">  \t           2. How to set up a simple website that marks you as a professional in your field and gives prospective clients the information they need to hire you.<br style=\"\">  \t<br style=\"\">  \t           3. How to get those all-important clips for your portfolio that let clients know you can do the job--<em style=\"\">even if you don't have any professional writing experience</em>.<br style=\"\">  \t<br style=\"\">  \t          4. How to find your niche in the market. Successful freelancers are experts in one or more niches. You must find yours. If you promote yourself as someone who can \"write anything\" you'll fail.  </p>  <p style=\"\">  \t           5. How to get your first freelance writing jobs.<br style=\"\">  \t<br style=\"\">  \t           6. How to find writing jobs online.<br style=\"\">  \t<br style=\"\">  \t          7. How to avoid the trap of content mills that want you to write for free or for slave wages--you're a professional, and you should be paid like one!<br style=\"\">  \t<br style=\"\">  \t          8. How to forge great relationships with clients so that your jobs go smoothly and you get repeat business.<br style=\"\">  \t<br style=\"\">  \t          9. How to avoid deadbeat clients who don't pay, and how to ensure you get paid fairly and quickly.<br style=\"\">  \t<br style=\"\">  \t          10. How to develop yourself throughout your career and grow into an expert whose services clients compete for.  </p>  <p style=\"\">  \t          If you're looking to get rich quick, <em style=\"\">this isn't the course for you</em>. If you have <em style=\"\">talent as a writer,</em> if you're willing to <em style=\"\">follow the advice</em> in this course, and if you <em style=\"\">take your career seriously</em>, this course will help you skip over all the beginner mistakes and start off on the right foot as a well-paid professional.  </p>  <p style=\"\">  \t          Don't waste any more time struggling! Click the “take this course\" button on the top right of your screen, and get started on a lucrative professional writing career now.  </p>", 
    "end_date": null, 
    "title": "Freelance Writing For Beginners", 
    "price": "45.00", 
    "instructors": "Laura  Brown", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363122_a2cc_2.jpg", 
    "course_url": "https://www.udemy.com/get-started-with-freelance-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T15:30:59Z"
}