{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Why should you take this course?</strong>  </p>  <p>  \t  Here&#039;s how to overcome your fear and deliver a presentation that will wow your audience every time!  This is our most popular entry level presentation training program  for good reason. If you want a quick primer on what it takes to nail  your next big presentation, look no further. In this one hour program  you&#039;ll see the master - Jason Teteak from Rule the Room - model for you in one hour exactly how to eliminate your fear and get the instant wow factor for YOUR presentation -  and you don&#039;t need any special talent to do it.  </p>  <p>  \t<strong style=\"\">        Bonus: </strong>Free 36 Page Ebook On <em style=\"\">&quot;How to Give an Effective Presentation&quot; </em>included with the video!  </p>  <p>  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p>  \t  &quot;I figured Jason Teteak might have a few new tricks—but not much that I hadn&#039;t heard before. I was wrong. Jason integrates the latest research on presenting, learning, and audience dynamics with a captivating style that plays with the ironic fact that he is doing presentations… about presentation skills. And therein lies the secret to this marvelous program.&quot;  </p>  <p>  \t<strong style=\"\">- Philip Deloria</strong>- Professor and Associate Dean, University of Michigan  </p>  <p>  \t  &quot;It&#039;s pretty simple. Jason Teteak walks the talk. In this day and age, finding a true thought leader amongst many is the key to getting to new levels. Listening to Jason and benefitting from his teachings will take you to that new level you seek. He is cutting edge, extremely practical and connects in a way that is motivating, informing and memorable. Some of the biggest benefits received from Jason are tactics, ideas and methods that are immediately implementable. Watch Jason&#039;s program before your competition does.&quot;  </p>  <p>  \t<strong style=\"\">- Al Lautenslager</strong>- Best-selling Author, Guerrilla Marketing in 30 Days  </p>  <p>  \t  “I have been to several seminars on public speaking and giving presentations, including Dale Carnegie training. I truly went into this thinking that I couldn&#039;t possibly learn anything new, but I found myself scribbling notes like a mad woman during the presentation. I quickly realized that these were tips and techniques that I had never heard before, and that I could use immediately upon my return to the office.&quot;  </p>  <p>  \t<strong style=\"\">- Joey Monson-Lillie</strong>- Human Resources Manager  </p>", 
    "end_date": null, 
    "title": "Get the Instant Wow Factor for your next Presentation", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135290_0c0a_18.jpg", 
    "course_url": "https://www.udemy.com/the-presentation-wow-factor/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-18T16:38:33Z"
}