{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                For many entrepreneurs and academics writing is not a choice. You have to do it and you have to do it by a certain deadline on top of an already full workload.  Many choke under that kind of pressure. And so they procrastinate and procrastinate… and often never get it done.  </p>  <p>  \t                Is one of your biggest stumbling blocks not taking the time to plan out your writing project? Do you struggle to meet deadlines? If so, this course is for you.  </p>  <p>  \t                By the end of this course you will have created a work plan for your specific writing project and have implemented 2 or 3 tried-and-tested techniques to ensure that you will actually follow-through and complete it.  </p>  <p>  \t<strong>This course includes 3 practical and interactive sections: </strong>  </p>  <p>  \t<strong>1) Get Inspired &amp; Getting Started </strong>- First I’ll help you clarify your main goal and identify the perfect writing project to propel you towards meeting that goal. You'll also determine your personal motivator or motivators for ultimately getting your project done.  </p>  <p>  \t<strong>2) Create Your Roadmap</strong> - Next I’ll guide you through breaking down your project into discrete steps, creating milestones, identifying potential roadblocks, and putting your work plan into a timeline. This is the part we so often skip. Don't do it!  You'll get enormous benefit from completing a work plan.  </p>  <p>  \t<strong>3) Tricks to Stick to Your Roadmap </strong>- Finally, I’ll provide you with dozens of tried-and-true techniques for getting your work plan done. This is your reward for completing section 2! You’ll choose the best techniques for you and then you’ll commit to a plan of action.  </p>  <p>  \t                I have taught this method to hundreds of people in workshops around the U.S, so you’re in good hands!  I’m an academic librarian, a trainer, and a consultant who has written and published dozens of academic and trade articles, a blog, and two books.  </p>  <p>  \t                This course has set up many authors for success.  I hope you’re next!  </p>", 
    "end_date": null, 
    "title": "Get Your Epic Article or Book DONE (Finally!)", 
    "price": "35.00", 
    "instructors": "Jerilyn Veldof", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274586_0adb_4.jpg", 
    "course_url": "https://www.udemy.com/get-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-04T15:56:29Z"
}