{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">This 2 hour program focuses on helping you effectively communicate your ideas and gain support for your goals. You&#039;ll learn how to captivate your audience, manage pace, handle small talk, stay in control, and show confidence during presentations and meetings.</strong></p><p><strong style=\"\">Why Rule The Room:</strong></p><p>Training academic leaders to be persuasive and communicate ideas effectively is one of our specialties. We understand the unique problems that academic faculty and administrators face. And, because we model every skill we teach, you won&#039;t just learn WHAT works for leaders in a position of influence, you&#039;ll learn exactly HOW to do it.</p><p><strong style=\"\">After taking this course you will be able to:</strong></p><ul style=\"\"><li>Prepare and organize your material so you feel more comfortable presenting it</li><li>Immediately captivate your audience so they can&#039;t wait to hear what you have to say next</li><li>Always come across as confident and credible</li><li>Appear totally calm even if you&#039;re feeling nervous</li><li>Use your tone to make staff, students and faculty want to listen intently</li><li>Use body language and facial expressions to showcase your leadership</li><li>Show expertise by easily handling any question… even if you don&#039;t know the answer</li><li>Keep your audience engaged so their minds don&#039;t wander</li><li>Use visuals to make your ideas clearer and more memorable</li><li>Manage the pace of meetings and presentations so you always end on time</li><li>Stay in control and handle distractions with ease</li><li>Close a meeting or presentation so your listeners feel positive, motivated, and inspired</li></ul><p><br style=\"\"></p><p><strong style=\"\">Don&#039;t take our word for it. Here&#039;s what others have to say:</strong><br style=\"\"></p><p>&quot;I figured Jason Teteak&#039;s programs might have a few new tricks—but not much that I hadn&#039;t heard before. I was wrong. Jason integrates the latest research on presenting, learning, and audience dynamics with a captivating style that plays with the ironic fact that he is doing presentations… about presentation skills. And therein lies the secret to these marvelous programs.&quot;<br style=\"\"></p><p>Philip Deloria - Professor and Associate Dean of Undergraduate Studies University of Michigan</p><p><br style=\"\"></p><p>&quot;In the past I have attended several similar presentations and even a multi-day workshop on these skills. However, I never learned as many easy take-aways as I did on Friday. The &#039;opener&#039;, wherein he gathered thoughts on the board was really excellent. I also liked the 90/10 idea and that will really stick with me. I found him to be an engaging speaker and the time went by super fast. I didn&#039;t find my mind wandering at all (which isn&#039;t always the case for me). Additionally how one squares her shoulders to the audience and how important it is not to either: wander back and forth, clutch the podium like it&#039;s life support were good tips. I will try my best 90/10 in our first book group meeting tomorrow. Thanks for arranging this session.&quot;<br style=\"\"></p><p>Key Administrator - LSA - University of Michigan</p><p><br style=\"\"></p><p>&quot;The key to success is shared here in a way that can be personalized to match your own style...Jason does for public speaking what style guides do for effective writing.&quot;<br style=\"\"></p><p>Peggy Burns - Assistant Dean for Advancement, University of Michigan College of Literature, Science, and the Arts</p>", 
    "end_date": null, 
    "title": "Give a Seamless Administrative Presentation", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470994_3b52_5.jpg", 
    "course_url": "https://www.udemy.com/administrator-give-a-seamless-administrative-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T17:17:38Z"
}