{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>¡Bienvenidos!</p><p>Ya está aquí la adaptación en formato videocurso de <strong style=\"\">uno de los cursos más exitosos de los últimos años</strong>. Impartido en varias universidades españolas y con <strong style=\"\">más de 500 alumnos</strong> que ya lo han cursado, el presente curso de &quot;Habilidades comunicativas&quot; es uno de los referentes educativos dentro del sector.</p><p>Ofrecemos aquí el curso completo, con casi <strong style=\"\">100 clases</strong> de contenido teórico, divididas en 8 módulos de aprendizaje y casi <strong style=\"\">10 horas de contenido</strong> en formato vídeo de alta definición. Además, presentamos un total de <strong style=\"\">11 actividades prácticas </strong>para poner en práctica lo aprendido durante las clases e incluímos <strong style=\"\">más de 20 enlaces externos</strong> para completar el aprendizaje a través de entretenidos vídeos de ejemplo, extraídos de películas y series actuales, anuncios de televisión, intervenciones de personajes públicos, sketchs humorísticos... y un largo etcétera. </p><p><strong style=\"\">¡En definitiva, presentamos un curso basado en el principio de que otra manera de enseñar es posible!</strong></p><p>Con este curso el alumno aprenderá a hablar en público de forma eficaz, a liderar grupos humanos de forma productiva y exitosa, a sacar el máximo beneficio de los procesos negociadores que emprenda, a extraer todo el potencial de una buena argumentación, a persuadir con el lenguaje...</p><p>Aprenderemos todos los secretos y técnicas que nos ofrece la comunicación verbal y no verbal. Y estudiaremos juntos las ventajas de convertirnos en personas asertivas, con una mejor autoestima personal, mayor confianza en nosotros mismos y más conscientes de nuestro potencial comunicador. <br style=\"\"></p><p><br style=\"\"><strong style=\"\"></strong></p><p><strong style=\"\">Un recorrido completo de aprendizaje de las habilidades comunicativas</strong><br style=\"\"></p><p>Este curso incluye toda la materia de estudio de la serie de cursos dedicados a mejorar nuestras habilidades comunicativas, tanto en el entorno profesional como en el personal. La serie completa la componen:</p><blockquote style=\"\"><ol style=\"\"><li>- Hablar en público de forma eficaz<br style=\"\"></li><li>- Técnicas de liderazgo: aprende a ser un buen líder<br style=\"\"></li><li>- Habilidades de negociación y persuasión<br style=\"\"></li><strong style=\"\"></strong><li><strong style=\"\">- Habilidades comunicativas (CURSO COMPLETO Hablar en público + Liderazgo + Negociación y persuasión + Comunicación no verbal)</strong></li></ol></blockquote>Todos los cursos están disponibles en esta plataforma. Si estás interesado en cursar uno o varios de ellos, contacta conmigo para ofrecerte una promoción.<p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Habilidades Comunicativas (Guía Completa)", 
    "price": "20.00", 
    "instructors": "Antonio Santos", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472056_fbda_2.jpg", 
    "course_url": "https://www.udemy.com/habilidades-comunicativas/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T16:53:33Z"
}