{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">¡Bienvenidos!<br style=\"\"> <br style=\"\"> Os presento el curso <strong style=\"\">“Habilidades de Negociación y Persuasión&quot;</strong>. En este curso vamos a aprender las <strong style=\"\">técnicas y estrategias más eficaces para alcanzar el éxito</strong> en nuestras negociaciones, ya sean del ámbito profesional o del laboral. Para ello, he creado un completo programa que, a diferencias de otros cursos sobre la materia, no se centra exclusivamente en enumerar las distintas técnicas, si no que realiza un recorrido más amplio por diferentes aspectos de las relaciones interpersonales, los estilos comunicativos, el buen uso de la comunicación verbal y el lenguaje, las claves de una buena argumentación, etc. <br style=\"\"> <br style=\"\"> De esta manera el alumno podrá entender mejor dónde encajan dentro de este marco las técnicas de negociación, y sobre todo, porqué son presentadas como las más efectivas. Además, por supuesto, de <strong style=\"\">dotarle de más herramientas comunicacionales para desarrollar su propio estilo en una negociación.</strong></p><p style=\"\">Y todo ello salpicado de<strong style=\"\"> actividades, vídeos explicativos</strong> <strong style=\"\">y tests de autoevaluación al final de cada módulo del curso</strong> que, en mi opinión, aportarán al alumno un conocimiento más profundo de la materia. Por ello, aconsejo a los alumnos que visionen los vídeos y hagan las actividades. Cuando lo hagan verán que los vídeos son también distintos a lo que podemos esperarnos de un curso profesional tradicional, ya que se ha pretendido buscar ejemplos que apoyen y aclaren la teoría de una forma amena e inesperada. Así, nos encontraremos con cortes de películas, de conferencias internacionales, de programas de entretenimiento, de anuncios de la tele...<br style=\"\"> <br style=\"\"> Las actividades, por su parte, no son de obligada realización ni tienen que ser enviadas al tutor para su corrección. Son actividades pensadas para hacer practicar al alumno las técnicas presentadas, o bien para hacerle pensar, para que se pare y reflexione sobre la materia de estudio, y que lo haga de una manera diferente a la habitual, mucho más entretenida en mi opinión y también mucho más efectiva. Por supuesto, aunque no sea obligatorio enviarlas, el alumno que lo desee podrá hacerlo siempre que quiera para profundizar en el tema, debatir puntos de vista o pedir mi opinión.<br style=\"\"> <br style=\"\"> <strong style=\"\">En definitiva, presentamos un curso diferente, basado en el principio de que otra manera de enseñar es posible.</strong><br style=\"\"> <br style=\"\"> Aconsejo realizar el curso de forma pausada, sin prisa. Leyendo las lecciones con calma, viendo los vídeos presentados y realizando las actividades propuestas.<br style=\"\"> <br style=\"\"> Por último, <strong style=\"\">he completado el curso con dos módulos muy útiles acerca de la comunicación y la asertividad</strong>, que servirán para aportar más claves que el alumno podrá aplicar en sus negociaciones... y también en cualquier tipo de relación interpersonal que emprenda.<br style=\"\"> <br style=\"\"> Espero que os guste el curso y que os sea de utilidad. ¡Os espero!</p><p style=\"\"><strong style=\"\">Un recorrido completo de aprendizaje de las habilidades comunicativas</strong><br style=\"\"></p><p style=\"\">Este curso se incluye dentro de la serie de cursos dedicados a mejorar nuestras habilidades comunicativas, tanto en el entorno profesional como en el personal. La serie completa la componen:</p><blockquote style=\"\"><ol style=\"\"><li style=\"\">- Hablar en público de forma eficaz</li><li style=\"\">- Técnicas de liderazgo: aprende a ser un buen líder</li><li style=\"\">- Habilidades de negociación y persuasión</li><li style=\"\">- Habilidades comunicativas (CURSO COMPLETO Hablar en público + Liderazgo + Negociación y persuasión + Comunicación no verbal)</li></ol></blockquote>Todos los cursos están disponibles en esta plataforma. Si estás interesado en cursar uno o varios de ellos, contacta conmigo para ofrecerte una promoción.", 
    "end_date": null, 
    "title": "Habilidades de negociación y persuasión", 
    "price": "20.00", 
    "instructors": "Antonio Santos", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472054_62bb.jpg", 
    "course_url": "https://www.udemy.com/habilidades-de-negociacion-y-persuasion/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T16:51:56Z"
}