{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Why should you take this course?</strong></p><p>Challenging attitudes exist in every boardroom, audience and classroom. Learn to understand what causes these attitudes and find out how to address them so you can maintain control of even the most challenging participants. In this 2 hour program you will learn how to control apathetic, negative and despondent participants so they don&#039;t control you.<br style=\"\"></p><p>We&#039;ve learned the hard way that disinterested or disgruntled attitudes can quickly derail a presentation, meeting, or classroom. That&#039;s why we&#039;ve spent a great deal of time and energy researching these attitudes and developing tactics to sidestep or diffuse the struggles they cause. You&#039;ll see Jason Teteak, presentation guru and best selling author of &quot;Rule the Room&quot;, model everything he suggests you do. Once you learn these techniques you will wonder how you ever survived without them.<br style=\"\"></p><p><strong style=\"\">Don&#039;t take my word for it, here&#039;s what others had to say...</strong><br style=\"\"></p><p>&quot;The course was really inspiring to me to get a lot of ideas for handling different situations that come up in the classroom. And, Jason Teteak did it in such a way that it was quick hits and fast and ways for us through case studies, examples, everything we see in our day-to-day classrooms, we got these great ideas and at the end of two hours I had no idea that I would come out with 57 new techniques for handling a difficult classroom.&quot;</p><p><strong style=\"\">Kathy</strong> - Instructional Design Manager </p><p><br style=\"\"></p><p>&quot;They&#039;ll get a lot of techniques, that&#039;s one of the things I loved about this, we were only here two hours, but we have things we can use immediately. Immediate takeaways that we can take back and use in a large classroom, a small classroom. It&#039;s not something your going to have to go home and study, you&#039;ve got things right away in your toolbox to use immediately.&quot;</p><p><strong style=\"\">Starla</strong> - Education Specialist</p><p><br style=\"\"></p><p>&quot;Even if you feel like you&#039;re the most experienced trainer, you need to come to this serenity session, because you are going to be able to handle your classroom in a totally different way than you were able to before.&quot;</p><p><strong style=\"\">Elisha</strong> - Manager of Blended Learning<br style=\"\"></p><p><br style=\"\"></p><p><br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Handle Challenging People: Stay In Control with No Fear!", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448610_5077_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-handle-challenging-people/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T15:14:17Z"
}