{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is all about helping consultants and coaching to harness the power of storytelling and narrative in your practice. The course provides a structure for storytelling in organisations and the tools to use it for both 121 work and for groups. It provides the secrets for how to build confidence and comfort in telling stories and using them to 'show' rather than 'tell' in your work. And lastly, it provides a wide range of simple, creative tools that you can embed in your work immediately. </p><p style=\"\">The course contains everything you need - with workbooks and key exercises to follow. I also provide you with for 'key' stories - stories that present an often-faced challenge or issue using metaphor to illustrate the idea. For every concept, I present an example from my own practice so you can understand how each tool could work in action. </p><p style=\"\">The course will take around 8 hours in total to complete - you have a collection of short lectures in each of the 4 sections, plus prep materials so you can put the tools into practice immediately. </p><p style=\"\">You should take this course if you want to bring a more colourful and personal dimension to your work and want to build your confidence in using story. You will also benefit if you recognise that humans find stories powerful, memorable and impactful - so they are a crucial tool for the art of transformation!</p>", 
    "end_date": null, 
    "title": "Happy Ever After: Storytelling for Coaches and Consultants", 
    "price": "50.00", 
    "instructors": "Erica Rachel Sosna", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472618_294d_5.jpg", 
    "course_url": "https://www.udemy.com/happy-ever-after/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T08:20:08Z"
}