{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>One of the biggest struggles writers have is with their mind. </strong>Doubts, fears, negative thoughts, dealing with reviews and opinions. These things can derail your business and take energy away from what is most important...writing and publishing your books.</p><p>Through this training, <strong>I will help you gain a better understanding of how to deal with these problems</strong>, so you can build your business more easily by focusing on what you can do and what is most important for your ultimate success.<strong></strong></p><p>Too many talented writers don't get what they deserve because they are distracted with obstacles that are beyond their control. How you react to those obstacles can make or break you. <strong></strong></p><p><strong>When you know what's holding you back, and you counter with the right methods, you will be able to free your creativity to succeed writing books.</strong></p><p>Even if you question your ability to write good books, I will put that into perspective for you too. </p><p><strong>You don't need to be a university educated author to do well publishing your own books.</strong> In fact, you could be doing yourself a disservice writing to that standard in most markets. You just need to write what your readers can enjoy reading as I will explain.</p><p>I focus on keeping everything simple so you can learn and get back to your writing.</p><p><strong></strong></p><p><strong>The videos are short, the messages are direct,</strong> and they are based on the correspondence I've had over the years dealing with thousands of authors, many who have gone on to <strong>unbelievable success once their own belief systems have been reset correctly.</strong></p><p>There are downloadable transcriptions of each video.<br></p><p>After you've completed this course <strong>you should have a whole new level of confidence that you can write, publish and profit from the skills you currently have now.</strong></p>", 
    "end_date": null, 
    "title": "Helping Writers to Write and Keep Writing", 
    "price": "20.00", 
    "instructors": "Geoff Shaw", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718870_eec3.jpg", 
    "course_url": "https://www.udemy.com/helping-writers-to-write-and-keep-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T22:49:25Z"
}