{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Description</strong></p>\n\n<p>Discover the five principles of high power presentations and step-by-step processes for using the principles so that you can get your message across to people in a way that gets them to want to make a commitment to you and take action.</p>\n\n<p><strong>Overcome the 3 major stumbling blocks to great presentations.</strong></p>\n\n<p><strong>1) </strong>We don’t know what we don’t know.  Research shows that 85% of our success in business depends on our ability to effectively present our ideas yet only 25% of people ever take a formal presentation course.</p>\n\n<p><strong>2) </strong>Most people confuse what an audience expects of us as presenters versus what they need from us in writing. This leads to presentations that people often refer to as ‘talking head’ which puts our audiences to sleep.</p>\n\n<p><strong>3) </strong>When people start out giving presentations they tend to treat them as a mental exercise, like giving a book report. In fact, powerful presentations are mostly a physical activity, more like playing golf or tennis.</p>\n\n<p><strong>Is this course for you?</strong></p>\n\n<p>High Power! Presentations is a program designed especially for leaders in technology, engineering and other experts with a high level of specialized knowledge, people who frequently speak with clients, investors or teams of people who may not have the same depth of knowledge and experience on a particular subject. This training will increase your ability to consistently connect with your audience, to gain their trust and to connect the dots in a way that is meaningful and relevant for them.</p>\n\n<p><strong>What the program covers</strong></p>\n\n<p><strong>Structure</strong> – Learn how to structure you presentation in a way that answers your audience’s biggest question, “What’s in it for me?” </p>\n\n<p><strong>Content</strong> - Deliver content that is meaningful and relevant to your audience and meets their expectations of you as a presenter and an expert.</p>\n\n<p><strong>Differentiators</strong> – Discover how to stand out from the crowd and be remembered in a way that is professional and appropriate for the situation.</p>\n\n<p><strong>Trust</strong> – Create trust with your audience and do it in a way that is natural, authentic and allows the presenter to be relaxed in front of any audience.</p>\n\n<p><strong>Commitment</strong> – Develop the ability to consistently gain commitment from your audience and get them to take action.</p>\n\n<p><strong>Program Layout</strong></p>\n\n<ul><li> 3 plus hours of training that includes step-by-step instructions for developing a presentation that can be used over and over in any situation.</li></ul><ul><li>Theory and practice relative to what we all need to do in order to connect with our audience and meet their expectations.</li></ul><ul><li>Examples from people that will show you what works and what doesn’t when it comes to persuasion.</li></ul><ul><li>Exercises and a secret weapon for staying relaxed in front of any audience.</li></ul><ul><li>Tips to fine tuning your presentation and delivering your messsage in a way that is both professional and comfortable for you.</li></ul>\n\n\n\n\n\n\n\n", 
    "end_date": null, 
    "title": "High Power! Presentations", 
    "price": "35.00", 
    "instructors": "Jane Barr", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692168_b524_3.jpg", 
    "course_url": "https://www.udemy.com/high-power-presentations/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T18:17:01Z"
}