{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "\n\n<p>This\nis Starr Hall's COMPLETE “How to Become a Professional Speaker” COURSE which\nincludes a four module self study webcast training that will teach YOU how to\ndevelop your speaking foundation and build it into a 6/7 figure speaking\nempire.  All webcasts include a\ncomplete action guide with templates and resources that you need to make this\nhappen. This is a self study course that you can access at any time and\ncomplete actions as your schedule permits.</p>\n\n<p><strong>Module One:</strong></p>\n\n\n\n<p>Your speaking foundation- Starr will teach you how to set up\nyour speaker’s kit, topics, speaking fees and speaking brand.</p>\n\n\n\n<p><strong>Module Two: </strong></p>\n\n\n\n<p>You will learn how to find speaking opportunities that will\npay you AND create your on site sales offerings and approach.</p>\n\n\n\n<p><strong>Module Three: </strong></p>\n\n\n\n<p>Get ready to create your speaking pitches and get them sent\nout to get those PAID bookings- Starr will walk you through this step-by-step.\nThis module also includes how to get sponsors. </p>\n\n\n\n<p><strong>Module Four: </strong></p>\n\n\n\n<p>Setting up your speaker's contract AND how to get publicity\nand media coverage when you speak.</p>\n\n\n\n<p>Starr has been a professional speaker since she was 19 years\nold. With 20 years of speaking experience, Starr continues to build her six\nfigure speaking empire as well as her brand exposure around the globe. She will\nteach you her tips, techniques, templates, give you her resources and yes- step\nby step training on how to build YOUR speaking brand and make money doing it.\nNow touring with Entrepreneur Magazine, sponsored by Deluxe and Sprint, Starr\nhas a full time speaking schedule already booking through Fall 2012 with new\nsponsors and she gets paid for every speaking engagement. She has also landed a\nsecond book deal due to her speaking exposure- The Social Wave book is included\nwith this “How to Become a Professional Speaker “course. </p>\n\n\n\n<p>Take\nthis course now and learn how to become a professional speaker.</p>\n\n<p>&lt;/p&gt;</p>", 
    "end_date": null, 
    "title": "How to Become a Six Figure Income Professional Speaker", 
    "price": "35.00", 
    "instructors": "Starr Hall", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/11468_4b4e_4.jpg", 
    "course_url": "https://www.udemy.com/the-speakers-course/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-11-28T12:31:20Z"
}