{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t It is often said that everyone has a book in them, but let’s face it not everyone is a natural writer.  I’m going to let you into a secret.  There’s no such thing as a natural writer.  Writing a book is a skill that can be taught, and this course does exactly that.  Unlike the hundreds of courses that teach you how to get your book published on the Kindle Store, this one takes you gently by the hand and leads you through the creative process one step at a time.  </p>  <p>  \t You’ll learn how to plan an eBook that will sell.  You’ll overcome the terror of the blank page and get on with creating the first draft.  You’ll learn how to work through your draft in order to bring it closer to the finished book you know you can write.  Then how to edit it and put it together in order to have a book that you can be really proud of.  Together we’ll tackle each stage in order, and you’ll go from nothing more than a desire to write, to having money coming in to your bank account for work you finished ages ago.  </p>  <p>  \t I’m not some wannabe writer pushing my ideas on you, this is the very process I used to create my first ebook on a subject I feel passionate about  (Martial Arts if you’re interested, but you can write about anything).  The process I followed in order to bring in hundreds of dollars for each hour I worked.  You really can write a book, and you really can make money from it.  </p>  <p>  \t What are you waiting for?  There’s a book inside you right now just itching to get out, and there are literally thousands of people who will happily pay to read it.  Take my hand, and I’ll guide you along the way.  </p>", 
    "end_date": null, 
    "title": "How To Write An eBook", 
    "price": "20.00", 
    "instructors": "Scott Paterson, Martin J Austwick", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220028_a3e0_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-an-ebook/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-15T22:15:07Z"
}