{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>LATEST: Course Last Updated 10th June 2016<br></p><p>************************************************</p>\n\n<p>Learn the secrets to acing your job interview and get the job of your dreams. You have already worked hard to get the interview - do not blow it by not being prepared. Know what to do before and during the interview to have the best chance of success possible. </p>\n\n<p>+++++++++++++++++++++++</p>\n\n<p>About this course:</p>\n\n<ul><li><em>No workbooks, CD's or anything else is required</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul>\n\n<p>+++++++++++++++++++++++</p>\n\n<p>This course teaches students the best way to prepare before and what to do during the interview. It is divided into a number of sections, which are:</p>\n\n<ul><li>Introduction - why do interviews seem so hard?</li><li>Before The Interview - follow these steps before you even leave the house!</li><li>Typical Interview Questions and Answers</li><li>Interview Questions sorted by Field - know the appropriate questions and answers by heart!</li></ul>\n\n<p>To watch the course videos, you will need roughly around two hours. However, students are encouraged to take an active role throughout the course, by taking down notes and think about how they would answer the questions if they were asked to them by an interviewer.</p>\n\n<p>If you believe that you are ready for your dream job, if you want to ace the interview and start working at the company that you worked hard to secure an interview at, then this is the course for you. The lectures in this course will guide you along how to prepare before and what to say during the interview. </p>\n\n<p>It's time to take action, enroll now to get started!</p>", 
    "end_date": null, 
    "title": "How To Get Your Dream Job? It Starts With The Interview", 
    "price": "20.00", 
    "instructors": "Kevin Farrugia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510888_0f39_2.jpg", 
    "course_url": "https://www.udemy.com/acing-the-interview/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T13:18:58Z"
}