{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong><em>LATEST: Course Updated October 2015</em></strong></p>  <p>  \t<strong>OVER 2,500 STUDENTS HAVE ALREADY ENROLLED IN THIS COURSE. </strong>  </p>  <hr>  <p>  \t<strong>Who else wants to take their love and talent for writing and turn it into multiple streams of freelance writer income?</strong>  </p>  <p>  \t<strong></strong>In this course we cover <strong>how to START actually getting paid real money for your writing online</strong>.  </p>  <p>  \t                                    You can use these techniques to understand how to <strong>structure your writing business</strong> online, <strong>find paying customers quickly</strong>, and quickly <strong>create an independent lifestyle</strong> around your paid writing!  </p>  <p>  \t                                    Heck, I <em>even</em> show you how to transition from writing for other people as a work-for-hire into “freedom writing” where you work for yourself!  </p>  <p>  \t                                    In fact, here’s just a sample of what we’ll cover on this incredible course:  </p>  <ul>  \t<li>The <strong>exact mechanics</strong> of how to get paid real money for your writing by other people…</li>  \t<li>The <strong>THREE (3) categories of paid writing</strong> and how to make money in each one of them…</li>  \t<li>Specific strategies for making money with your writing in <strong>15-minute slots</strong> EVERYONE has time for…</li>  \t<li>A simple, duplicatable strategy to get people to eagerly pay you for your writing while <em>avoiding </em>the “wage slave” trap that snags most writers…</li>  \t<li>How to <strong>leverage your writing into cash</strong> <em>even if you have no products or ebooks to sell and want to avoid customer service like the plague</em>…</li>  \t<li><strong>3 Specific things you can write in 30 minutes</strong> that people will eagerly pay you for…</li>  \t<li>How to leverage sites like \"Fiverr\" to get much <strong>more lucrative and ongoing writing jobs</strong> (that pay a LOT more than just a measly $5 per gig)…</li>  \t<li><strong>The single biggest mistake people make</strong> when they first try to get paid for their writing (and how to <em>avoid </em>it)…</li>  \t<li><strong>How to get paid for writing you don’t do! </strong>(Yep, how to get paid for writing jobs without actually doing any of the writing yourself)…</li>  \t<li><strong>FOURTEEN (14) specific strategies that will get you paid to write that take an 90 minutes or less</strong> to do…</li>  \t<li>… and much, MUCH More!</li>  </ul>  <p>  \t                                    Don’t miss this breakthrough course that will finally show you how to leverage your love of writing into a more independent and profitable lifestyle (no matter how busy you are right now).  </p>  <p>  \t<strong>Watch the 7+ FREE Preview videos right now... </strong>  </p>  <p>  \t                            And of course, put this course to the test! Understand that we insist on offering a <strong>FULL, Unconditional 30-Day Money-Back Guarantee</strong>. This course WILL show you how to get paid to write online, or we'll give you your money back... <em>no questions asked</em>.  </p>  <p>  \t<strong>Quick Disclaimer: </strong>this is obviously not an offer of employment. Some of these freelance writing job opportunities are one-off, others can repeat indefinitely, and still others involve freelance writing for yourself (which is ultimately where you want to be because that's how you typically make the most money and have the most control over your time). <strong>Some may lead to full time employment, but the VAST majority are done on an independent contractor basis (which is what freelance writing is all about).  </strong>  </p>  <p>  \t<strong>My Promise: </strong>So while I can't guarantee you'll find a full-time job, <strong>I can guarantee to show you all the ways I make and have made money as a freelance writer as well as how others are doing it too, right now, online.</strong> The rest will be up to you to take what you learn and apply it as any good freelance writer would.  </p>", 
    "end_date": null, 
    "title": "How To Start Getting Paid To Write Online: 33 Ways To Do It", 
    "price": "20.00", 
    "instructors": "Jim Edwards", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303724_97c8_5.jpg", 
    "course_url": "https://www.udemy.com/paid-to-write-33-specific-ways-online/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-19T15:58:17Z"
}