{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Writing books can be a struggle, but through this training, I will show you <strong>the benefits of building your business with Amazon Kindle Short Reads.</strong></p><p>I will show you how many super successful authors have used Kindle Short Reads <strong>to publish more books more easily.</strong></p><p>How they copy their own success and <strong>duplicate the business assets that are earning them the most money.</strong></p><p>How to reduce bad reviews.</p><p><strong>How to build big lists fast and easy.</strong></p><p>How to use Short Reads (Short Stories) to get more reach in Amazon search and <strong>have more readers finding your books through keywords and categories.</strong></p><p>You will understand why Amazon placed emphasis on Short Reads, because of the <strong>reading habits</strong> of new readers, and also long time readers, who have changed the way they choose to read.</p><p><strong>You will learn some tricky techniques to get people to join your reader list </strong>and make it easier for you to sell more books, and create a financially stable business.</p><p><strong>There are currently 19 lectures and an hour of content.</strong></p><p><strong>There are downloadable files and transcriptions of each video.</strong></p><p>I’ve structured this course in a simple methodical way based on the best results I’ve had from training thousands of people in book publishing.</p><p><strong>You will gain confidence and knowledge that will help you get better results by working smarter.</strong></p><p>I’ve kept the videos short and to the point without leaving out the crucial information you need to succeed.</p><p><strong>You can go away in the next day with a whole new understanding of how to use Kindle Short Reads </strong>to build a bigger, better author brand, with more sales and more readers on your email list.</p>", 
    "end_date": null, 
    "title": "How to Succeed with Kindle Short Reads", 
    "price": "25.00", 
    "instructors": "Geoff Shaw", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691712_4d96.jpg", 
    "course_url": "https://www.udemy.com/how-to-succeed-with-kindle-short-reads/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T03:45:00Z"
}