{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Have you ever read a totally enthralling romance novel and been so carried away with the characters and their love story that when you turned the last page you asked yourself, <em style=\"\">I wonder if I could write romance like that</em>?  </p>  <p style=\"\">  \t  The good news for writers is there has never been a better time to create your own romance stories and find readers who will enjoy them.  </p>  <p style=\"\">  \t  Romance Fiction is by far the most popular form of commercial fiction enjoyed in the US today. Romance Fiction dominates the best seller lists and estimated sales for 2012 were over 1.4 Billion dollars.  </p>  <p style=\"\">  \t  Sales of romance have never been higher and publishers are looking for romance fiction of all genres and lengths to satisfy their readers.  </p>  <p style=\"\">  \t  In addition, digital only publishers have greatly increased the number of opportunities for romance writers to share their stories with the world.<strong style=\"\"></strong>  </p>  <p style=\"\">  \t  This is your chance to be part of the booming market for romance fiction.  </p>  <p style=\"\">  \t<strong style=\"\">This course has been created for any aspiring romance writer, including:</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·Passionate readers of romance fiction who would love to share their own stories with readers around the world.  \t</p>  \t<p style=\"\">  \t\t  ·Creative writers who would like to explore whether romance fiction is a genre that they would enjoy.  \t</p>  \t<p style=\"\">  \t\t  ·Anyone who already writes romance fiction for pleasure and needs help to move to the next stage and write professionally.  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\">As a professional romance author</strong> I am going to discuss how to:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·investigate the wide range of romance fiction currently being published,  \t</p>  \t<p style=\"\">  \t\t  ·how to research the type or romance fiction you love to read and would like to write  \t</p>  \t<p style=\"\">  \t\t  ·overcome uncertainty and create and shape your own fiction  \t</p>  \t<p style=\"\">  \t\t  ·learn the fundamental elements that make romance fiction special, so that you can get started and shape your writing from the start.  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">The Course has been divided into FOUR Sections.</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">Section 1. Welcome and Introduction to the Course</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">Section 2. Introduction to Romance Fiction</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">Section 3. How to Craft your Story</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">Section 4. Your Writing Process.</strong>  \t</p>  \t<p style=\"\">  \t\t  The course consists of a combination of video lectures and quiz exercises to checks on your understanding, using examples taken from romance fiction.  \t</p>  \t<p style=\"\">  \t\t  At the end of the course you will have  \t</p>  \t<p style=\"\">  \t\t  ·a much clearer appreciation of what kind of romance fiction that you enjoy and want to write, and  \t</p>  \t<p style=\"\">  \t\t  ·how to use the specific story craft techniques to create compelling romance fiction.  \t</p>  \t<p style=\"\">  \t\t  You will also receive a fully illustrated PDF book of the full and extended lecture notes that you can keep and refer to any time you need.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "How to Become a Romance Writer", 
    "price": "40.00", 
    "instructors": "Nina Harrington", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235498_9dca_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-romance-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T09:29:51Z"
}