{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong><em>  \"A must for all those who are required to stand up &amp; deliver\".</em></strong>  </p><p><strong><em>**UPDATED OCTOBER 2015**</em></strong></p>  <p>  \tThis was a quote from one of my students who took this course and sums up how fundamental what you will learn is.  </p>  <p>  \t        When I ask people what their greatest concern is when speaking in public &amp; presenting, \"getting started\" or, \"the first few minutes\" is always top.  </p>  <p>  \t        The 8 openings we will cover will; reduce your anxiety, establish an audience connection (whether that 5 or 500 people), give the audience a reason to listen to you, establish a professional and knowledgeable tone, set the scene and environment for the rest of your delivery and ensure that you are memorable for all the right reasons!  </p>  <p>  \t        This course is split into 10 lectures, 8 assignments and 8 mini quizzes. You can expect to complete the lecture videos in 1hour 15mins, but will need an additional 1-2 hours to complete the attached 8 assignments and quizzes (recommended).  </p>  <p>  \t     There is an information pack which covers everything in the video lectures as well as a written version of my lecture descriptions.  </p>  <p>  \t        Seinfeld once said \"people's number 1 fear is public speaking, number 2 is dying\" This course will help to ensure that for you public speaking and presenting is something to be enjoyed and not endured...I promise!  </p>  <p>  \t  Enrole now to learn the essential secrets and skills that will make you a better presenter <strong>today</strong>. If you are not satisfied that this course has taught you how to 'hook' your audience and deliver a more confidence, 'polished' delivery there is a 30 day <strong>money back guarantee</strong>!  </p>  <p>  \t        Best wishes Sarah  </p>", 
    "end_date": null, 
    "title": "How to be a presenter people want to listen to again & again", 
    "price": "20.00", 
    "instructors": "Sarah Simpson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/103652_5ef6_7.jpg", 
    "course_url": "https://www.udemy.com/presentation-skills-8-awesome-openings/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-09T14:32:27Z"
}