{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Why should you take this course?</strong>  </p>  <p>  \t      Give a meaningful, seamless webcast that persuades, motivates and gets your online audience to do what you want.  People serious about making money take this course because they have to deliver a make-or-break webinar to:  </p>  <ul style=\"\">  \t<li>Do a pitch for a startup</li>  \t<li>Convince a big client</li>  \t<li>Get more sales</li>  \t<li>Gain support from their boss</li>  \t<li>Get a promotion</li>  \t<li>Get any audience to do what they want</li>  </ul>  <p>  \t      So many webinars are boring and &quot;pitchy&quot;...  </p>  <p>  \t      Do you like to listen to the boring elevator pitches of other people? Of course not. So, why would others want to hear yours?  </p>  <p>  \t      What WILL help you is to ensure that you have a true value proposition that&#039;s interesting, provocative, and shows your audience what&#039;s in it for them.  </p>  <p>  \t      This course will show you how to make what you say online valuable so you can persuade and motivate others to act on it. I will personally model the exact techniques and specific skills you need to do just that in your next webinar. You&#039;ll learn dozens of techniques you&#039;ve never seen before to get <em style=\"\">YOUR</em> audience to do what you want.  </p>  <p>  \t<strong style=\"\">  Don&#039;t take my word for it. Hear what others have to say...  </strong>  </p>  <p>  \t      &quot;“This courses on how to create and deliver effective webcasts has fundamentally improved the quality of my webcasts. They teach specific techniques and principles that are easy to put into practice. I considered myself an expert webcaster and I frequently delivered webcasts to hundreds of attendees, but by following the techniques I learned, my audiences are more engaged than ever before and often take immediate actions based on my webcasts. Furthermore, I&#039;ve seen novices with little or no webcasting experience deliver engaging, smooth, professional webcasts after being trained and following the specific techniques that are taught.&quot;  </p>  <p>  \t      - <strong style=\"\">Joe McGuire </strong>- Director of Business and Clinical Intelligence  </p>  <p>  \t      “The course taught me how to adjust my presentation style for an audience with a limited sensory experience. On a webcast, the audience needs to be captured only by the slides and the voice of the presenter; as a presenter I need to be aware of this and find ways to convey the feelings that I usually project with my body language and eye contact.&quot;  </p>  <p>  \t      - <strong style=\"\">Martin DeZell</strong>- Reporting Coordinator  </p>  <p>  \t      “Jason&#039;s advice is practical, straightforward, and incredibly helpful for anyone looking to greatly improve his or her presentation skills.&quot;&quot;  </p>  <p>  \t      - <strong style=\"\">Ryan Anderson</strong>- Director of Instructional Design and Development  </p>", 
    "end_date": null, 
    "title": "How to Give an Effective Webinar", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311048_b1ae_10.jpg", 
    "course_url": "https://www.udemy.com/webinars-that-wow-how-to-give-an-effective-webinar/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T19:52:07Z"
}