{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4 style=\"\">Learn How to Write a Bestselling Nonfiction Book Like a Pro in 30 Days or Less</h4>  <p style=\"\">  \t<em style=\"\">Who else wants to know... The Secrets to Becoming a Prolific, Successful Nonfiction Author and Writer?</em>  </p>  <p style=\"\">  \t      In this step-by-step video training course, Tom Corson-Knowles, the <strong style=\"\">#1 Bestselling Author of more than 25 nonfiction books including <em style=\"\">The Kindle Writing Bible</em> </strong>shares his secrets to success as a nonfiction author and writer.  </p>  <p style=\"\">  \t      There are countless benefits to being a productive and prolific nonfiction writer from receiving regular cash flow to your bank account, to getting paid for speaking gigs and consulting, the opportunities are endless for writers who can communicate powerfully and effectively with the written word…  </p>  <p style=\"\">  \t<em style=\"\">  This course is designed to help you come up with profitable book ideas and write your book in just 30 days.</em>  </p>  <p style=\"\">  \t      In addition to the powerful lectures, video trainings, writing templates, and additional resources available in this course, I will also answer all of your questions about writing your nonfiction content.  </p>  <p style=\"\">  \t      It took me six long years to finally finish my first nonfiction manuscript because I didn&#039;t know how. I don&#039;t want anyone else to struggle the way I did.  </p>  <p style=\"\">  \t      That&#039;s why I created this course for you.  </p>  <p style=\"\">  \t      I&#039;m looking forward to working with you!  </p>  <p style=\"\">  \t      Here&#039;s to your success,  </p>  <p style=\"\">  \t      Tom Corson-Knowles  </p>  <p style=\"\">  \t<br style=\"\">  </p>  <p style=\"\">  \t<em style=\"\">P.S. Just scroll up and click <strong style=\"\">&quot;Take This Course&quot;</strong> now to start on your journey to becoming a bestselling author.</em>  </p>", 
    "end_date": null, 
    "title": "How to Write a Nonfiction Book That Actually Sells", 
    "price": "30.00", 
    "instructors": "Tom Corson-Knowles", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/159998_c92b.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-a-nonfiction-book-that-actually-sells/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-07T21:55:09Z"
}