{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you are looking to <strong>increase your income significantly</strong> by becoming an <strong>expert</strong> in your field, did you know that you can <strong>write a book in just a few days</strong> using a <strong>simple to follow</strong> recipe?<br></p><p><strong>TAKE THIS COURSE RISK FREE</strong> WITH THE UDEMY MONEY BACK GUARANTEE!</p><ul><li>Have you ever thought that you would like to <strong>write a book?</strong></li><li>Have you ever <strong>tried to write a book,</strong> though suffered from crippling writers block?</li><li>Would you like to become a perceived <strong>expert in your field?</strong></li><li>Did you know people who have written a book can <strong>charge significantly higher fees</strong> for their products and services due to their reputation?</li><li>Would you like to <strong>share your knowledge</strong> with more people you could ever try to meet in a lifetime?</li><li>Did you know that anyone can <strong>write a book in just a few days</strong> using free resources and tactics previously only available to professional writers?</li></ul><p>If you are already thinking that this is the <strong>right</strong> place to be, then <strong>click the button to take this course now!</strong> With just one idea from this course, your small investment could <strong>save you thousands of dollars</strong> in research or trial and error to write a book that may make no sense at all!</p><p><strong>How do I know? </strong></p><p>Before I wrote my first book, <strong>I spent thousands on online courses and live training</strong> and can <strong>save you the time and money</strong> to give you just the absolute best bits I learned, adapted to the real world.</p><p><strong>In this course, you will discover:</strong></p><ul><li>Where to <strong>get ideas</strong></li><li>How to <strong>organize your ideas</strong> into a logical workflow</li><li>The secret behind writing a successful book your <strong>readers will love</strong></li><li>A free tool I use along with a step by step walk through to <strong>help you structure your book properly</strong></li><li>How to <strong>bury writers block</strong> forever</li><li>The best way to come up with a <strong>killer book title</strong></li></ul><p>And loads more <strong>unique and clever tricks</strong> and tips to ensure you write your book in record time that your readers will love.</p><p>Click to <strong>take this course NOW</strong> even if you aren't sure you are ready to get started yet. Let your search for a foolproof guide to help you write that book stop HERE! If you don't, <strong>how much time are you going to spend</strong> searching through unproven methods, trying techniques and tactics that may or may not work? </p><p>Save yourself the pain and <strong>take this course now!</strong></p><p><strong>FAQ</strong></p><p><em><strong>\"I am not a good writer. Can I still write a book?\"</strong></em></p><p><em></em>- Yes! If I can do it, you can too. I failed English in High School and still managed to have a book published!</p><p><em><strong>\"Will I make money if I write a book?\"</strong></em></p><p><em></em>- I'm sorry, but I can't answer this question. Anyone who says you are guaranteed to make money is lying in my opinion. In the end it comes down to your drive and willingness to go after your goals</p><p><em><strong>\"Will I need to spend money on tools or software to help me?\"</strong></em></p><p><em></em>- Not to write a draft on the book, no. This course takes you through the steps of writing a draft yourself, though if you need assistance from an expert, then yes, you will need to pay for their time</p><p><em><strong>\"Why is this course different to other similar courses?\"</strong></em></p><p><em></em>- When I was searching for the best method to write a book, I spent thousands of dollars studying courses myself to help me as I honestly did not think this was possible. Through my self education, I found that most teachers had lost touch with someone who was a beginner like me. I don't claim to be an expert, though I do think that I have a system that any other beginner can also follow today! Why? Because I had to learn exactly this not long ago and this course contains all the short cuts and hacks.</p><p><strong>TESTIMONIALS FROM MY LIVE VERSION OF THIS COURSE</strong> (participants paid a LOT more for this day than the cost of this course, so keep it to yourself!)</p><p><em>\"If you have ever thought of writing a book but never took that vital first step simply because you didn't know where to begin, had no idea what it involved or whether it would even be possible, then I recommend that you seek out and speak with Pete Kvist\"</em></p><p><em></em><strong>Dympna Kennedy - </strong><strong><em>Parent Mentor &amp; Coach at Creating Balance - Sydney, Australia</em></strong></p><p><em>\"Awesome Workshop Pete Kvist! You were very clear, easy to understand and are an incredibly inspiring man!!!\"</em></p><p><em></em><strong>Kathy Nicol- </strong><strong><em>Company Director at Cohen's Lifestyle Clinic - Otago, New Zealand</em></strong></p><p><em>\"Thanks Pete - your advice early on in the piece was crucial - and very much appreciated. You're the man!\"</em></p><p><em></em><strong>Gavin Sequeira - <em>Founder and Director at Breakfree From Corporate - Melbourne, Australia</em></strong></p><p><strong><em>Take this course now with Udemy's money back guarantee and if it doesn't deliver what is promised, you can get your money back no questions asked and you don't even need to talk to me to get it! This is hands down, the most simple and effective way to write a book, period.</em></strong></p>", 
    "end_date": null, 
    "title": "How To Write A Non-Fiction Book Fast Without Writers Block", 
    "price": "20.00", 
    "instructors": "Pete Kvist", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463594_4549.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-a-non-fiction-book/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T03:21:42Z"
}