{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This seven part video series was created to enable you to step&nbsp;into your authentic self on camera and in life as a whole. So many people freeze when&nbsp;the camera goes on. It&rsquo;s as if the camera has put a spell on them. The camera makes us&nbsp;act in ways we wouldn&rsquo;t normally. This may happen to you and one of the reasons to invest in this course. The reason this freezing occurs is because the camera&nbsp;represents your judgements of yourself. The minute the camera goes on we become&nbsp;scared of what we are going to say and what people may think of us. The camera rarely&nbsp;lies so it&rsquo;s a great tool for transparency to emerge.&nbsp;This course will also show you simple steps to practice so you can start&nbsp;recording and sharing your message right away and how to produce your introductory video for your website. <br style=\"\"><br style=\"\">Simon is a professional actor, social   entrepreneur, writer and you could say a communication enthusiast.   Having starred and produced in his own movies he knows the power of the   camera and its ability to express messages. In 2008 he founded <a href=\"http://simononthesofa.com/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Simon on the Sofa</a> - Transformational Conversations. He facilitates workshops and mentors people through transparent communication, which is the ability to speak   exactly what you are thinking and feeling without holding onto   debilitating beliefs and programs which hold us back from communicating   our truth.<br style=\"\"></p>    <p style=\"\"><strong style=\"\"><span style=\"\">This course is for you:</span></strong><br style=\"\">  </p><ul style=\"\"><li style=\"\">If you are new to or nervous about appearing on video</li><li style=\"\">If you are a entrepreneur of any kind, holistic, social, radical, change maker, wayseer.</li><li style=\"\">If you are a business owner of any kind.</li><li style=\"\">If you your looking to produce video content for your website or elsewhere.</li><li style=\"\">If you want to enhance your performance skills in front of camera.</li><li style=\"\">If you know you have something to say but don&#039;t know how to express it on camera.</li><li style=\"\">Want to create an authentic introduction video for your website.</li></ul>        <p style=\"\"><strong style=\"\">Topics in this How to Communicate authentically  On Camera course are:&nbsp;</strong></p><p style=\"\"></p><p style=\"\"><strong style=\"\">Part 1 - Introduction<br style=\"\"></strong>This is an overview of the course to get you settled in and ready to go. Simon will be&nbsp;sharing guidance, advice and practical tips to support you on this journey to sharing&nbsp;your message to the world<strong style=\"\">.<br style=\"\">Part 2 - Voice Awareness&quot;<br style=\"\"></strong>Presenting is a skill but you don&rsquo;t need loads of training and you don&rsquo;t have to spend&nbsp;loads of money. Once you get a few things in check, you can start having fun as you&nbsp;practice and hone your message.<strong style=\"\"><br style=\"\">Part3 - &quot;Body Language and Posture&quot;<br style=\"\"></strong>Your body communicates way before you have even opened your mouth. This episode&nbsp;is all about getting into the body and getting your posture right.<strong style=\"\"><br style=\"\">Part 4 - &quot;Daniela - our authentic example&quot;<br style=\"\"></strong>This is where we see the exercises Simon has shared come into action, let&rsquo;s put them to&nbsp;the test. <strong style=\"\"><br style=\"\">Part 5 - :Setting the scene: Sound, Props and Lighting&quot;<br style=\"\"></strong>This episode covers tips on sound, lighting and setting the scene so you can create a&nbsp;professional video right now with better awareness<strong style=\"\">.<br style=\"\">Part 6 - &quot;How to create your introductory video&quot;<br style=\"\"></strong>Simon has created numerous videos over the years. This episode gives you some&nbsp;explanations which will support you in creating your own welcoming introductory&nbsp;video for your website.<span style=\"\"><strong style=\"\"><br style=\"\">Part 7 - &quot;The Summary&quot; <br style=\"\"></strong></span>A summary of what you have seen. Simon will encapsulate what you have experienced&nbsp;together. He shares why it&rsquo;s so important we communicate our truth and not what we&nbsp;think people want.<br style=\"\"></p><p style=\"\">This course contains all you need to know to not only get started on video but how to communicate effectively and authentically. Lets journey together :-)<span style=\"\"></span><span style=\"\"></span></p><p style=\"\"></p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "How to communicate authentically on camera", 
    "price": "20.00", 
    "instructors": "Simon Paul Sutton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/39492_f584_6.jpg", 
    "course_url": "https://www.udemy.com/communicate-authentically-on-camera/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-01T19:41:55Z"
}