{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Have your first lesson on me! <br></strong>A vital key to great presentations with or without slides.</p>\n\n<hr>\n\n\n\n\n\n<p><strong>A 30 minute excerpt from Chapter Six of the <em>Power in your Point </em>course.</strong></p>\n\n\n\n\n\n<p>A great presentation with slides must begin BEFORE you open up PowerPoint! In this lesson, you'll learn how to easily structure your presentation so it is well organized, engaging, and helps you make the impact you're after!</p>\n\n\n\n\n\n<p>You'll not only walk away with the vital principles for structuring content, you'll also receive a template that truly makes things a breeze!</p>\n\n\n\n\n\n<p><strong>What you'll get:</strong></p>\n\n\n\n\n\n<ul><li>An easy analogy to make drafting your next talk or training a no-brainer</li><li>One key question (most forget) that ensures you'll get their attention and make your members glad they came</li><li>Two vital ingredients that make the difference between losing your audience and getting rave reviews</li><li>A very handy template that takes out the guesswork, saving you time and frustration</li></ul>\n\n\n\n\n\n<p><strong><u>ENROLL NOW FOR FREE!</u></strong><u></u><br></p>\n\n\n\n\n\n<p>I know you'll love this lesson so much, you'll want to register for the complete <em>Power in your Point </em>course. Enjoy!</p>\n\n\n\n\n\n<p>Cheers,</p>\n\n\n\n\n\n<p>Nick</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "How to Easily Structure your Presentation for Impact!", 
    "price": 0, 
    "instructors": "Nick Elliott", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799262_a40b.jpg", 
    "course_url": "https://www.udemy.com/how-to-easily-structure-your-presentation-for-impact/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T01:29:01Z"
}