{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\t Over 900 students enrolled so far, and all rave 5-star reviews.</p>\n\n<p>\t<em><strong>LATEST: </strong>Course updated in January 2016. </em></p>\n\n<p>Lifetime access to 19 video lectures, 6 quizzes, 3 reference PDFs and 16 worksheets with practical exercises, answers and worked examples.</p>\n\n<ul><li>How do you make your writing clear, concise and targeted?</li><li>How do you design a document structure from scratch?</li><li>How do you schedule your work assignment and save up to 70% of writing time?</li><li>How do you measure and improve your readability score?</li><li>Where do you put the possessive apostrophe?</li><li>What are the most common errors, and how do you find and fix them?</li></ul>\n\n<p>Answer these questions and many more with this comprehensive introduction to business writing. Develop your skills and confidence in the workplace. Whether you are writing reports, web content, policy documents or training materials - this hands-on course will turbo-charge your writing skills and have you publishing clear, concise documents that look good from day one.</p>\n\n<p>I am an experienced business writing consultant. I deliver workshops and coaching to organisations internationally. I am also a freelance writer. My clients include The Institution of Civil Engineers (ICE), The Royal Borough of Kensington and Chelsea, The Centre for Strategy and Communication and Plain Words Ltd. So you can be sure that what you learn on this course are proven techniques, regularly updated from someone who writes and trains for a living.</p>\n\n<p><strong>Part one</strong> - everything you need to know about approaching and planning your writing project to save up to 70% of writing time<br></p>\n\n<p>\t<strong> Part two </strong>- tune up your writing style and write clear, concise and engaging content for any audience</p>\n\n<p>\t<strong> Part three</strong> - how to polish your work to a professional standard, including how to find and use hidden tools in Microsoft Word</p>\n\n<p>\t As well as Udemy's 30-day guarantee, you have my personal promise that what you learn on this course will give you the foundations of good writing practice. These will benefit you throughout your career, as they have for hundreds of other students who have taken my courses.</p>\n\n<p>Never be daunted by a business writing project again. And don't waste another minute writing messages that don't get heard. Take this course and start writing like a pro today!</p>", 
    "end_date": null, 
    "title": "How To Write Like A Professional And Boost Your Career Today", 
    "price": "40.00", 
    "instructors": "Jakki Bendell", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/157632_61a9_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-like-a-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-04T06:54:00Z"
}