{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Updated 12/30/15</strong><strong>:</strong><em> Update included brand new video recordings, updated lessons for all sections, new interactive activity sheets for all lessons, new free resources and examples.</em></p><p><strong>Join over 5,400 students taking this course to learn powerful techniques that help you whenever you need to pitch. Freelancers, entrepreneurs, and professionals.</strong></p><p>I’ve been presenting and pitching as a sales person, trainer and coach for 30 years. Now I'm sharing the techniques I used to close millions of dollars in business and to successfully launch my online training business.<br></p><p><strong>What You'll Learn in This Course:</strong></p><ul><li><em>Discover the secret formula that can make your pitch powerful for inspiring your audience to act.</em></li><li><em>Leverage your own individual strengths to connect with an audience of one, or of many quickly.</em></li><li><em>Learn to structure for creating a pitch that will be comfortable and interesting at the same time.</em></li><li><em>Recognize the elements of a good pitch so you can incorporate them into your own presentations, making you more effective and more influential.</em></li></ul><p><strong>Who Can Benefit From this Course?</strong></p><p>Whether you’re a freelancer looking for a gig, a professional preparing for a job interview or an entrepreneur who wants to start your own business, you will benefit from knowing these helpful tricks and techniques.</p><p>This course is for anyone who wants to be more effective pitching to investors, selling to customers, or just presenting for work in a project meeting. If you are looking to improve your presentation skills, your public speaking skills, or your leadership skills then this course is for you. Inside you will gain access to simple to use, easy to learn tips that make you pitch more effectively, speak more confidently, and present more comfortably.<br></p><p><strong>Is It Going to Be Boring and Dull?</strong></p><p>Using short video lessons in conjunction with examples from speakers and leaders I will show you how to identify the keys to making your pitch memorable and engaging. Pitching is about influence and inspiring others to act. So no, not dull and dreary at all!</p><p><strong>Learn to Amp Up Your Presentations</strong></p><p>Enroll in the course and I will teach you how to use story structure to create presentations that inspire and let you lead with authority. Being a leader means mastering leadership skills, like communicating effectively and being able to rally a group to action. </p><p>This course will give you a fundamental understanding of what makes a pitch good and how to avoid some pitfalls that prevents many people from achieving their goals.</p>", 
    "end_date": null, 
    "title": "How to Pitch for Success and Improve Your Influence", 
    "price": "20.00", 
    "instructors": "Eric Byrd", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27781_7136_8.jpg", 
    "course_url": "https://www.udemy.com/pitch-for-success-free-online-webinar/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-25T17:35:58Z"
}