{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Opportunities are not in things, but in the eye of the beholder. In this course, we will dive into four key areas that are essential to see new business opportunities and improve your business:</p><ol><li><strong>Regaining your creative genius </strong>The left side of the brain is vital to bring things down to earth. Nevertheless, the right side is important because it is the seat for new ideas. Tapping into creativity brings out groundbreaking ideas, products, services, and in due course, greater customer satisfaction. We will see that everyone can be much more creative and will explore this innate capacity. </li><li><strong>Conceptual, emotional and behavioral blockbusting </strong>The idea here is to learn what may be holding us back – what kind of conceptual, emotional or behavioral paradigms we have that holds us back. </li><li><strong>Breaking paradigms </strong>What does not allow us to accept new ideas? It is our paradigms. They are like a filter. Joel Barker encourages us to ask, what is impossible to do today, but if it were possible, would change radically the way things are done? </li><li><strong>Creativity applied to business </strong>We are going to learn effective techniques to help you take the lead regarding innovation. Our aim is to have clear-cut manners to apply creativity to a business situation that brings results.</li><li><strong>Using the techniques with your team</strong></li></ol><p> After having learned the above techniques, we now apply them in teams to guarantee that innovative improvements will be the lifeblood of your organization.</p><p>But wait, there´s more! </p>  <p>You will begin to prepare your mindset for new things to come. Many products and services will be common in the near future. Just to name a few things, we are marching to a future of: </p>  <ul><li><strong>Renewable energy</strong> – turbines around the world are being designed to harness the power of the ocean.</li><li><strong>Non-invasive medical procedures</strong> – a pen-size device is being developed at the University of Texas to detect skin cancer without the need for a biopsy.</li><li><strong>3D printing that goes beyond “printing”</strong> – scientists have been experimenting using the technology to reconstruct human tissue.</li><li><strong>Smarter and smarter Apps</strong> – we already have currently mobile applications that can identify what song is playing. Imagine what is coming. </li></ul>        <p><em>Wouldn´t you like to be part of such transformation? The more creative you are, the better off you are to undertake these new possibilities</em>. </p>", 
    "end_date": null, 
    "title": "How to be Creative & Innovative in Business", 
    "price": "20.00", 
    "instructors": "Andrew Matthews, Robert Silva", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590000_6cb8_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-creative-innovative-in-business/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-22T00:27:48Z"
}