{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is designed to teach beginners how to <em>set up</em>, <em>configure</em>, and <em>manage</em> a professional looking email account. By the end of this course you will have achieved all three of those skills and will also have successfully built your professional email account. </p><p><em>This <strong>FREE</strong>, <strong>QUICK</strong>, and <strong>EASY</strong> course will take you less than <strong>30 minutes</strong> to complete. </em></p><p><em>I GUARANTEE IT! </em></p><p>Almost EVERYONE has an email address, BUT hardly any of those people know what having a professional looking email system looks like. This is a problem, and with this course, I am going to help you solve it! It is of the utmost importance that you learn how to create and manage an efficient email system. </p><p>With this course, I am targeting anyone who has ever had an email account or sent emails. This course is going to allow you to take control of the quality level of your email account. This will in turn raise your level of credibility amongst your peers. </p><p><strong><em>In this class you will need the following:</em></strong></p><ul><li>A working computer</li><li>A general knowledge of what email is and how its used</li><li>A burning determination and strive for excellence in all that you do</li><li>A desire to take your email account to the next level</li></ul><div><br></div><div>I have years of experience in office work and productivity resourcing. This is something that I am passionate about. That is why I am offering this course for free. Everything that I teach is straight from two places: <strong><em>My Heart</em></strong> &amp; <strong><em>Personal Experience</em></strong>. </div><p>Enroll today and get your emails ahead of the competition. </p><p><strong><em>All For FREE. \"Use your brain, not your wallet.\"</em></strong></p><p>Kendall Knight</p><p><em>Helpful Udemy Instructor</em></p><p><br></p>", 
    "end_date": null, 
    "title": "How To Use Gmail Well In Your Workplace! ", 
    "price": "20.00", 
    "instructors": "Kendall Knight", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616050_8fbd_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-professional-email-account-in-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T18:47:03Z"
}