{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   In  business, whoever tells the best story wins.  </p>  <p>  \t    What would it mean to you, your branding and your business, if you knew how to tell your story in a way that was persuasive, clear and confident?   Here are the storytelling secrets of marketing expert <a href=\"http://www.hayzlett.com\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">Jeffrey Hayzlett</a>  - Fortune 100 CMO, Bloomberg TV contributing editor, and international business celebrity.  Building on the success of his best-selling book, <em>Running the Gauntlet</em>, Hayzlett shows you the secrets of the 118 - the elevator pitch for the digital age.  </p>  <p>  \t     An elevator pitch (or elevator speech) is a short concise intro to a person, product or idea - delivered in 118 seconds or less.  But more than just a statement of features and benefits, the 118 is a new and modern retelling of your story - a story designed to persuade and influence.  With instruction from Hayzlett and national elevator pitch champion, <a href=\"http://westfallonline.com\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">Chris Westfall</a>, the 118 Pitch Course is your step-by-step video guide to powerful and compelling messages - whether you tweet it or tell it - for increased revenues, better branding, and enhanced business performance.  </p>", 
    "end_date": null, 
    "title": "How to Pitch Your Business in Under 2 Minutes: The 118 Pitch", 
    "price": "25.00", 
    "instructors": "Chris Westfall, Jeffrey Hayzlett", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/75478_1cf7_8.jpg", 
    "course_url": "https://www.udemy.com/118-pitch-course/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-08T01:15:35Z"
}