{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   UPDATED - March 1, 2015  </p>\n\n<p>  \t <strong>606 Students Have enrolled!</strong>  </p>\n\n<p>  \t<strong>Also added 2 new modules! Be sure to watch Module 2 called \"Update\" and the last module on how to make money with your book.</strong>  </p>\n\n<p>  \tMillions of people have started writing a book and never finished it. This can cause stress, anxiety and feelings of frustration. Not to mention lost revenue!  All of the hundreds of hours that you have put into your book are wasted if your book is never finished.  </p>\n\n<p>  \t          This course will give you the tools you need to finally finish your book once and for all. There is also a module on how to start earning revenue with your book once it's finished.  </p>\n\n<p>  \t          Taught by a professional writer and book writing expert, Suzanne Doyle-Ingram takes you through a series of modules where you examine what is stopping you from finishing your book and, more importantly, what to do about it.  </p>\n\n<p>  \t          The course consists of a series of short video lessons that range from a few minutes to a maximum of 18 minutes. Let's face it, one of the main reasons why most people struggle to finish their book is because they don't have time to write. So this course is not meant to take you a month to get through. You could finish this course in a week with a solid plan to finish your book shortly thereafter.  </p>\n\n<p>  \t          Are you satisfied with a half finished book sitting around? If not, it's time to get cracking and finish your book!  </p>\n\n<p>  \t        In this course, you will learn:  </p>\n\n<ul>  \t<li>The importance of understanding why you are writing your book</li>  \t<li>What you want your book to DO for you</li>  \t<li>How to stop sabotaging yourself</li>  \t<li>How your brain makes you feel insecure (and what to do about it)</li>  \t<li>Why you need an outline (and exactly how to write one)</li>  \t<li>How to find time to write (Hint: you have more time than you think!)</li>  \t<li>What to do about editing and proofreading</li>  \t<li>How to make goals and deadlines work for you</li>  \t<li>How to finally finish your book</li>  \t<li>And how to make your book work for you!</li>  </ul>\n\n<p>  \t        So, what are you waiting for? Let's get started!  </p>", 
    "end_date": null, 
    "title": "How to Finally Finish Writing Your Book", 
    "price": "50.00", 
    "instructors": "Suzanne Doyle-Ingram", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176306_9962_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-finally-finish-writing-your-book/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-03T22:26:23Z"
}