{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ever wanted to be fearless at sales pitches? Be more charismatic in business and/or relationships? Be a better communicator? Give a TED talk? </p><p><strong>The goals of this course are simple: </strong></p><ul><li>To learn the basics of public speaking </li><li>Learn advanced techniques to be more charismatic and more likable </li><li>How to be more powerful as a human being</li></ul><p>I (Ricky Mendoza) will be guiding you through the whole process in a fun and entertaining way. <br></p><p>If you're an entrepreneur with a great product and need to get better at your pitches, then TAKE THIS COURSE! <br>If you're job hunting and need to leave an impression at your next job interview, then TAKE THIS COURSE! <br>If you're a parent and want better tools to communicate to your loved ones, then TAKE THIS COURSE! <br>If you're in the dating world and want the skills of a ninja communicator, then TAKE THIS COURSE!</p><p>There's something for everyone and I want you to get a lot of value from learning and practicing these skills.</p><p>I (Ricky Mendoza) am a filmmaker, musician, public speaker coach, entrepreneur and I've done thousands of presentations throughout my vast career. I've done live shows, videos, commercials and I've developed a simplified set of tools to help you be a FEARLESS communicator. </p><p>PS: I'll be adding more videos and more value to this course. Feel free to message me for any questions or feedback to improve this course.<br></p>", 
    "end_date": null, 
    "title": "How to speak to anyone & be fearless - in less than 55 min", 
    "price": "20.00", 
    "instructors": "Ricardo Mendoza", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780078_e409_2.jpg", 
    "course_url": "https://www.udemy.com/fearless-public-speaker-bootcamp-by-ricky-mendoza/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T15:52:34Z"
}