{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Imagine being able to give a keynote speech to hundreds or even thousands of key players in your industry, without having to leave your home or office. You can now deliver keynote speech, live, though Skype and other online services to conventions and audiences in other cities and continents.</span>  </p>  <p style=\"\">  \tIn this How to Give a Virtual Keynote Speech course you will learn the following:  </p>  <p style=\"\">  \t*How to prepare for the technical aspects of delivering a virtual speech  </p>  <p style=\"\">  \t*How to speak to an audience you can&#039;t see  </p>  <p style=\"\">  \t*How to look comfortable, confident and relaxed when speaking virtually  </p>  <p style=\"\">  \t*How to use engage your audience and host  </p>  <p style=\"\">  \tThis course is delivered primarily through spoken lecture. Because the skill you are learning is speaking related, it only makes sense that you learn through speaking.  </p>  <p style=\"\">  \tThe skill you will learn in this class is not primarily theoretical or academic. It is a skill that requires physical habits. That is why you will be asked to take part in numerous exercises where you record yourself speaking on video, and then watching yourself. Learning presentation skills is like learning how to ride a bicycle. You simply have to do it numerous times and work past the wobbling and falling off parts until you get it right.  </p>  <p style=\"\">  \tThis course contain numerous video lectures plus several bonus books for your training library.  </p>  <p style=\"\">  \tTJ Walker has been coaching and training people on their presentation skills for 30 years. Now, through the power of Udemy&#039;s online platform, he is able to give you the same high quality training that he gives in person to CEOs, Fortune 500 executives, and Presidents of countries. Only you can now receive the training at a tiny fraction of the normal fee for in-person training.  </p>  <p style=\"\">  \tHow long this course takes is up to you. The longest part of the course involves you speaking on video, critiquing yourself, and doing it over until you like it. But if you get to the point where you love how you look and sound when you present it will be well worth the time spent. And having this skill will save you time for all future presentations in your life.  </p>  <p style=\"\">  \tYou can begin improving your virtual presentation skills right now. You may have an opportunity to speak out virtually as soon as tomorrow, so why waste another day worried that your presentation skills are not up to high standards. Please enroll today.  </p>", 
    "end_date": null, 
    "title": "How to Give a Virtual Keynote Speech", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362518_24cc_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-give-a-virtual-keynote-speech/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T20:24:43Z"
}