{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Would you like to overcome the fear of public speaking? Would you like to increase your confidence? Amazingly, overcoming the fear of public speaking is one sure way to increase your confidence in all aspects of your life including work and personal life.  </p>  <p>  \t  First, you will learn how to overcome the fear of public speaking. We will look at the steps you need to take to become confident at public speaking. This process is not going to be painful but rather you will have fun. This will include tips on how to deliver presentations. However, being confident at public speaking is not enough to master public speaking. I have seen plenty of confident speakers that make no impact. You will also need the second part of the course to learn how to prepare presentations that make an impact. In this part you will learn to create and structure the content of your presentation.</p>  <p>  \t  If you learn and apply the course material you will go from fear of public speaking to enjoying public speaking. This may sound impossible to you now, but it will happen. In addition, you will increase your confidence in all aspects of your life. You will be more confident at work, at networking events, and in your personal relationships.  </p>  <p>  \t  Join me now and start speaking with confidence. Thirty-day money back guarantee applies.</p>", 
    "end_date": null, 
    "title": "Impactful Public Speaking for Intrepid Introverts", 
    "price": "20.00", 
    "instructors": "Dr Pablo F German", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327742_79d2_3.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-for-introverts/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-26T22:26:05Z"
}