{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">There&#039;s nothing as depressing as missing an important gig because it&#039;s lost in your email, right?</p><p style=\"\"><strong style=\"\">Inbox Revolution</strong> is a course that teaches you a practical, step-by-step system for organizing your email inbox. &nbsp;While the course focuses on use of Gmail as a primary email system to centralize your incoming messages, you can apply many of these tips and resources to almost any service you choose.&nbsp;</p><p style=\"\">Imagine opening your email and seeing just the important messages you need to see. Respond more quickly to people that matter, save a ton of time by sending unwanted mail to the &quot;black hole&quot; for good, and never be anxious again about losing a prospective customer.</p><p style=\"\">From the very start use the handy&nbsp;<strong style=\"\"><em style=\"\">What&#039;s In Your Inbox?</em></strong><em style=\"\">&nbsp;</em>template to identify common buckets for your email and to help you begin to systematize how and what you read.</p><p style=\"\"><span style=\"\"><strong style=\"\">What Students Have Said About Online Training with Tanya:</strong></span></p><p style=\"\"><ul style=\"\"><li style=\"\"><span style=\"\">&quot;</span>Your helpful webinar demonstrated has shown me how to weave that same experience into my own business.&quot; - <em style=\"\">Latoya Rosario, Exclamation Publishing</em><br style=\"\"></li><li style=\"\">&quot;The resources you shared with me were/are invaluable.&quot; - <em style=\"\">Suzzette Turnbull, Social Media Expert</em><br style=\"\"></li><li style=\"\"><em style=\"\">&quot;</em>Tanya is gifted at teaching and instructing along with streamlining processes. She is able to adjust her teaching style to various learning behaviors&quot; - <em style=\"\">Melissa Olliendieck, Christian Wellness &amp; Life Coach</em></li></ul></p>  ", 
    "end_date": null, 
    "title": "Inbox Revolution: 6 Simple Steps To Get Out of Email Jail", 
    "price": "20.00", 
    "instructors": "Tanya Smith", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45660_fae9_5.jpg", 
    "course_url": "https://www.udemy.com/inbox-revolution/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-12T22:28:27Z"
}