{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Latest Updates:</strong></p><p><strong>October 2015: </strong><em>all new videos with improved audio quality!</em></p><p><strong>August 2015: </strong><em>now at three 5* reviews and counting!</em></p><p><strong>July 2015: </strong><em>more than 100 students enrolled with one 5* review already</em></p><p>Average lecture time of <strong>less than 8 minutes</strong> - easy to understand, bite-sized chunks!</p><p><em>*From more than 300 people attending this course face-to-face, 99.6% give me 5 stars and I'm sharing my knowledge with you now for a fraction of the cost*</em></p><p>Specifically aimed at busy executives in medium to large organisations, investing in this course means <strong>you will gain</strong>:</p><ul><li>Increased credibility and profile in your organisation</li><li>A reputation among key decision-makers for producing reports that matter - they will love what you can do for them!</li><li>Success through positive action taken from your recommendations</li><li>Transferable skills that will last a lifetime</li></ul><p>Knowing how to write impactful reports is a communication skill that is often underestimated - as a result, many reports just end up sitting on a shelf gathering dust!   But <strong>reports are essential for key decision-makers in any organisation</strong>.</p><p>I have this knowledge from both sides, having spent more than 20 years in corporate life learning how to write impactful reports the hard way and, as a key decision-maker, trying to make sense of poor reports. <strong> I know what works and what doesn't</strong>, and I'm giving you the benefit of this experience and knowledge in this course.</p><p>If you've ever wasted time putting together a report that hasn't had the impact you wanted, this course is for you.  It is specifically designed to help you make your reports easy for others to read and take positive action, which will increase your professional credibility and profile.</p><p>You will learn: </p><ul><li>how to understand what sort of report you're writing</li><li>how to keep on track with the perfect objective</li><li>how to structure, lay out and pitch your report for impact</li><li>how to avoid punctuation, grammar and writing mistakes</li><li>when and how to include explanatory tables and charts</li><li>how to proof and perfect your report.</li></ul><p>The course is structured in a series of video and text lectures, with downloadable resources, and a summary and quizzes at the end of every section.</p><p>Course completion time is approximately 3 hours.</p><p><strong>You can have lifetime access to the online course today!</strong></p><ul><li>If you change your mind after purchase, your refund is personally guaranteed</li><li>Udemy backs this up with a no-questions, 30-day refund policy</li></ul><p><strong>Buy today!</strong></p>", 
    "end_date": null, 
    "title": "Increase Your Credibility And Profile With Impactful Reports", 
    "price": "50.00", 
    "instructors": "Ginette Tessier", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526650_0d1b_7.jpg", 
    "course_url": "https://www.udemy.com/impactful-reports/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-12T09:03:10Z"
}