{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><br></p><p><strong>So Many People Want To Write A Book And So Few Do</strong></p><p>Many of us dream of having a book. But it can seem like such a big project, or we&#039;re not sure what to write about that we don&#039;t start. Or we start and don&#039;t finish.&nbsp;</p><p><strong>Your Time Is Now</strong></p><p>And yet there has never been a better time to write a book. Publishing is more accessible than it&#039;s ever been before and what better way to get known and to establish your credibility than with a book?</p><p><strong>How Can We Help</strong></p><p>You already have expertise and experience, a story to tell, or   some how-to knowledge. All you need to do now is to learn how to turn   it into a book. So we put this programme together to teach you a step-by-step process that helps you finally finish that book you&#039;ve been promising yourself. At the end of thirty days, if you follow all our steps, you&#039;ll have a completed book, that is ready for you to self-publish or to send to an agent or publisher.<br></p><p><strong>The Right Foundation</strong><br></p><p>We start by helping you set the right foundation - getting you grounded in your values and deciding on the right strategy for your book. We don&#039;t want you just to write - we want you to write a book with impact!</p><p><strong>Write in Flow</strong><br></p><p>And we ease you into the writing process. We give you daily targets and help you track your progress day by day with downloadable trackers. <br></p><p><strong>Gain Confidence</strong></p><p>And once you&#039;ve gained some confidence we up the pace and help you bust through any procrastination to get that all important first draft complete.</p><p><strong>Consolidate and Polish</strong><br></p><p>And then we dedicate a whole section to editing and review. Because your first draft probably isn&#039;t quite up to finished book quality! You need to refine, reflect, and make sure that you are connecting with your reader - oh as well as those teeny tiny details like proof-reading and spell-checking.</p><p><strong>Course Structure</strong><br></p><p>The <strong>Instant Author</strong> Programme comes with a video introduction for each day&#039;s activity, and downloadable worksheets or spreadsheets to guide you through exactly what you need to do.</p><p><strong>Your Commitment</strong><br></p><p>We can&#039;t write your book for you, but we can teach you how to get to finished - and it doesn&#039;t need to take as long as you might think. We recommend you spend between one and two hours a day on the programme - but if you need to go slower, that&#039;s OK - you have full access to the material for as long as you need to get that book done.</p><p><strong><em>So, do yourself a favour, and make this the month you finally get your book done!</em></strong><br></p>  ", 
    "end_date": null, 
    "title": "Instant Author. Write Your Book In Thirty Days", 
    "price": "30.00", 
    "instructors": "Cathy Presland, Jacqui Malpass", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32873_5246_2.jpg", 
    "course_url": "https://www.udemy.com/instant-author-turn-what-you-know-into-a-book/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-17T10:20:50Z"
}