{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">El <strong style=\"\">propósito</strong> de este curso de inteligencia emocional es acompañarte en tu aprendizaje y ayudarte en el desarrollo y fortalecimiento de tus habilidades personales para perfeccionar las competencias emocionales y comunicativas que te permitan conseguir tus sueños y lograr tus metas.</p><p style=\"\">El curso está estructurado en <strong style=\"\">cuatro módulos junto a una presentación</strong> general, donde encontrarás contenidos teóricos muy sencillos junto a prácticas y ejercicios basados en la <strong style=\"\">metodología del Coaching y la Programación Neurolingüística.</strong></p><p style=\"\"><strong style=\"\">Sección 1 &nbsp;Presentación del curso</strong></p><p style=\"\">En este video podrás encontrar todos los detalles del curso, es abierto a todo el público. ¡¡Anímate a verlo!!</p><p style=\"\"><strong style=\"\">Sección 2 Inteligencia Emocional y sus beneficios.</strong></p><p style=\"\">Comienza el apasionante viaje por el universo emocional y la comunicación aproximándonos a una panorámica general de los beneficios de desarrollar estas competencias. ¿Imaginas qué supondría en tu vida?</p><p style=\"\"><strong style=\"\">Sección 3 Habilidades de la Inteligencia Intrapersonal</strong></p><p style=\"\">En esta parte del curso descubriremos el pilar de la inteligencia emocional y de la sabiduría: Autoconocerse y Autogobernarse ¿Eres dueñ@ de tu vida?</p><p style=\"\"><strong style=\"\">Sección 4 Habilidades de la Inteligencia Interpersonal</strong></p><p style=\"\">Con este módulo completamos nuestro viaje adentrándonos en el maravilloso territorio de la comunicación y las relaciones personales. ¿Preparad@ para ir más allá de ti?</p><p style=\"\"><strong style=\"\">Sección 5 Inteligencia Emocional Aplicada</strong></p><p style=\"\">Finalizamos el curso creando un viaje propio, ahora que has fortalecido tus competencias emocionales y sociales.</p><p style=\"\">¿Te atreves a diseñar el proyecto de vida que realmente quieres vivir?</p><p style=\"\">Además de los vídeos tienes otros <strong style=\"\">materiales</strong> a tu disposición como el temario del curso en formato PDF, cuestionarios a final de cada módulo y algunos enlaces interesantes para complementar y afianzar el aprendizaje.&nbsp;</p><p style=\"\">Para realizar el curso se recomienda dedicar <strong style=\"\">una semana</strong>, al menos, a <strong style=\"\">cada módulo</strong> sería tiempo adecuado para integrar el conocimiento y realizar los ejercicios, aunque tú decides cuándo y cuánto, tú conoces tu ritmo. Se sugiere dar espacio para integrar toda la información que se va a generar y que puede mover y consumir energía en ti.</p><p style=\"\">Si decides <strong style=\"\">realizar este curso</strong> seguramente tienes curiosidad por descubrir los secretos de las emociones, o quieres mejorar las habilidades personales y sociales que ya posees.</p><p style=\"\"><strong style=\"\">Otros beneficios</strong> que este curso te puede aportar:&nbsp;</p><p style=\"\">- Mejorar tu bienestar general y salud.</p><p style=\"\">- Tomar conciencia de tus fortalezas y de tus mecanismos de defensa.</p><p style=\"\">- Conseguir equilibrio emocional.</p><p style=\"\">- Superar miedos y conseguir seguridad y estabilidad.</p><p style=\"\">- Mantener la calma y fortalecer el optimismo.</p><p style=\"\">- Gestionar con eficiencia el estrés y la resistencia al cambio.</p><p style=\"\">- Mejorar tu motivación y dinamismo.</p><p style=\"\">- Lograr &nbsp;estilos comunicativos más asertivos y eficaces.</p><p style=\"\">- Liderar e influenciar positivamente a los demás.</p><p style=\"\">- Desarrollar tu propio plan de vida &nbsp;congruente.</p><p style=\"\">- A enfocar tu energía para lograr tus objetivos personales y profesionales.</p><p style=\"\">- Mejorar tu desarrollo profesional.</p><p style=\"\">Gracias por tu tiempo y quedo a tu disposición, deseando ¡¡Qué consigas todo aquello que te propongas!!</p><p style=\"\">Julia</p>  ", 
    "end_date": null, 
    "title": "Inteligencia Emocional. \"El secreto del bienestar\"", 
    "price": "20.00", 
    "instructors": "Julia García Escudero", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51143_d3be_7.jpg", 
    "course_url": "https://www.udemy.com/inteligencia-emocional-el-secreto-del-bienestar/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-24T15:48:30Z"
}