{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Investor Presentations: You Can Pitch Investors for MoneyHow to Make an Investor Pitch Presentation</p><p>Imagine yourself in front of investors pitching your company and you know that you are coming across as poised, confident and believable. Even if investors don&#039;t always invest with you, they will understand your business and respect you as a business leader.</p>  <p>  \t    In this &quot;How to Make an Investor Pitch Presentation&quot; course you will earn about how to create and deliver a presentation for investors, venture capitalists and angels. In order to raise money effectively you must be able to give a clear and understandable presentation with authority and confidence. This course will teach you how to structure your pitch presentation and how to deliver it with conviction. New business ideas are rarely so good that investors simply send a check in the mail. Instead, you must ask for money in-person. This course will teach you how to do so.  </p>  <p>  \tImagine making an investor pitch presentation where angels and venture capitalists are nodding their heads in agreement with you. Wouldn&#039;t you like to be able to make investment pitches where you knew investors clearly understood your business model and your value proposition? You can become an excellent investor presenter.  </p>  <p>  \tIn this How to Make an Investor Pitch Presentation you will learn the following:  </p>  <p>  \t*How to think like an investor  </p>  <p>  \t*How to make your business understood  </p>  <p>  \t*How to make a memorable presentation  </p>  <p>  \t*How to keep the attention of investors  </p>  <p>  \tThis course is delivered primarily through spoken lecture. Because the skill you are learning is speaking related, it only makes sense that you learn through speaking.  </p>  <p>  \tThe skill you will learn in this class is not primarily theoretical or academic. I is a skill that requires physical habits. That is why you will be asked to take part in numerous exercises where you record yourself speaking on video, and then watching yourself. Learning presentation skills is like learning how to ride a bicycle. You simply have to do it numerous times and work past the wobbling and falling off parts until you get it right.  </p>  <p>  \tThis course contain numerous video lectures plus several bonus books for your training library.  </p>  <p>  \tTJ Walker has been coaching and training people on their presentation skills for 30 years. Now, through the power of Udemy&#039;s online platform, he is able to give you the same high quality training that he gives in person to CEOs, Fortune 500 executives, and Presidents of countries. Only you can now receive the training at a tiny fraction of the normal fee for in-person training.  </p>  <p>  \tHow long this course takes is up to you. The longest part of the course involves you speaking on video, critiquing yourself, and doing it over until you like it. But if you get to the point where you love how you look and sound when you present it will be well worth the time spent. And having this skill will save you time for all future presentations in your life.  </p>  <p>  \tYou can begin improving your investor pitch presentation skills right now. You may have an opportunity to speak out as soon as tomorrow, so why waste another day worried that your presentation skills are not up to high standards. Please enroll today.  </p><p>Course updated on July 28, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee. </p><p>TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe. </p>", 
    "end_date": null, 
    "title": "Investor Presentations: Pitching for Startup Capital", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342806_1d38_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-an-investor-pitch-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T22:20:34Z"
}