{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   La communication non verbale désigne dans une conversation tout échange n'ayant pas recours à la parole. Le <strong style=\"\">langage du corps</strong> ne repose pas sur les mots, mais sur les gestes , les attitudes,  les mimiques ou les odeurs La communication non verbale s'intéresse aussi à l'environnement, c'est-à-dire le lieu dans lequel les interactions ont lieu.  </p>  <p style=\"\">  \t La communication non-verbale permet d'étudier le langage du corps, qui correspond : aux expressions faciales, aux gestes, aux distances interpersonnelles...  </p>  <p style=\"\">  \t<br style=\"\">  \t La communication non verbale regroupe toutes les techniques destinées à communiquer avec autrui sans utiliser la parole, notamment les mouvements du corps, ou les manifestations physiologiques comme la transpiration, exemple: les larmes sont un moyen de communication non verbale !  </p>  <p style=\"\">  \t Dans cette présentation, nous allons répondre à 3 questions principales:  </p>  <p style=\"\">  \t    ¨Qu’est ce que la communication non verbale?  </p>  <p style=\"\">  \t    ¨Qui fait appel à la communication non verbale?  </p>  <p style=\"\">  \t    ¨Comment maîtriser notre langage corporel?  </p>  <p style=\"\">  \t BREF  </p>  <p style=\"\">  \t Comment déceler la vérité derrière les mots exprimés ? et quand est-il de <em style=\"\">la gestuelle de votre interlocuteur?</em>  </p>  <p style=\"\">  \t  TRES BON COURAGE A TOUS  </p>  <p style=\"\">  \t  JE VOUS VOIS TRES PROCHAINEMENT  </p>", 
    "end_date": null, 
    "title": "La Communication Non Verbale ", 
    "price": "20.00", 
    "instructors": "Ikrame SELKANI", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198788_abbb_3.jpg", 
    "course_url": "https://www.udemy.com/la-communication-non-verbale/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T16:13:25Z"
}