{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This two hour program dives deeply into the strategies, techniques and tools you need to be an effective facilitator. You will not only discover how to show credibility, hook your audience, build rapport, use effective non-verbals, keep them engaged, determine whether they got it, and close to applause, you will actually do it yourself. This is program will ensure you and the rest of the people in your organization will be immediately effective, engaging, exciting, and get results.</p><p style=\"\"> Rule the Room will teach you how to facilitate and lead valuable group discussions capable of actually changing people&#039;s behavior. Jason Teteak gives you double the techniques of most facilitator programs with hundreds of immediately actionable techniques that cover all the essential areas listed above.<br style=\"\"></p><div style=\"\"> <div style=\"\"> <p style=\"\"> <strong style=\"\">Don&#039;t take our word for it. Here&#039;s what others have to say:</strong><br style=\"\"></p><p style=\"\">&quot;Todays program was really about practical tips, information that you could take away and apply in any facet of your daily routine, like facilitating, teaching, training, working with groups, facilitating large groups or small groups.&quot;<br style=\"\"></p><p style=\"\">Steve - Business Manager</p><p style=\"\"><br style=\"\"></p><p style=\"\">&quot;I found this to be really worth my time, it gave me actual take aways, things I can do today and tomorrow in my teaching and in my group facilitation that will actually make a difference and make my presentations more compelling and make me more confident as a presenter.&quot;<br style=\"\"></p><p style=\"\">Karen - Language Arts Teacher</p>    </div></div>", 
    "end_date": null, 
    "title": "Lead Valuable Group Discussions", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472194_f418_7.jpg", 
    "course_url": "https://www.udemy.com/facilitate-lead-valuable-group-discussions/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T20:25:28Z"
}