{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t       This course will show how to write each letter of the English alphabet in a cursive style in the correct proportions and writing flow.  </p>  <p style=\"\">  \t       The course is a video course with unique hand sketches of each letter so you can follow along with the hand on screen. Dimension lines are used as a background with a humorous use of words using the letter at the end of each sketch. The letter and any text is spoken as you view the video.  </p>  <p style=\"\">  \t       Each letter video is approximately 25 seconds in length and can be replayed as many times as needed to follow the hand on screen,  </p>  <p style=\"\">  \t       The course is structured letter by letter so that you can easily return to any specific letter for revision as required.  </p>  <p style=\"\">  \t  Each lesson has a practice sheet available in pdf format that you can print out to perfect your writing skills.  </p>  <p style=\"\">  \t       Forming a solid understanding and style in writing the English alphabet is vital to build on as the writer progresses further. The unique hand sketching method is like having your own teacher available at all times forming the letters for you to follow in your own books and the clear audio helps in pronunciation.  </p>  <p style=\"\">  \t       This course is built upon material provided by the Queensland Department of Education as part of their Lower Primary School educational materials for the qcursive font which have been enhanced with our  Video Sketching technology and voice overs to offer a truly unique and effective learning tool.  </p>", 
    "end_date": null, 
    "title": "Learn How To Write The English Alphabet qCursive Style.", 
    "price": "20.00", 
    "instructors": "Marc Weedbrook", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/113590_9591_6.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-write-the-english-alphabet-cursive-style/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-01T00:52:57Z"
}