{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is designed for the entrepreneur, business owner or instructor who is new to creating an online video course. You will find these tips and techniques applicable for creating direct-to-camera videos for a Udemy course or for creating instructional videos for other platforms. Emphasis is placed on using a simple recording setup and creating videos using equipment that you likely already have in your home or office. </p>\n\n<p>Many of these tips and tricks will also serve those who are doing live streaming video with Facebook Live, Blab or Periscope. </p>\n\n\n\n<p>Instructor Vickie Maris, whose Periscope course was featured in the Udemy blog, is an online course designer with over a decade of experience in a Big 10 institution as well as a musical entertainer and farm girl. She begins in this course with getting you to think about whether an online video course is the right medium for connecting with your customers, and will give you some tips about video production that will help you get rolling. </p>\n\n\n\n<p>The course is particularly focused towards the person who is daunted by the use of video recording equipment and not sure where to start. Vickie demonstrates, through the way she created videos for the course, how to record quality videos in a simple way that have great potential for quick approval by the Udemy team. </p>\n\n\n\n<p>The section on tips, tools, and techniques is bursting full of helpful hints that will make this journey easier for the first-time online video course creator.</p>\n\n\n\n<p>She wraps up the course with time-saving techniques for recording and working with files that will turn you into a lean operation when it comes to course content production!</p>\n\n<p>Join the over 1000 students who have already enrolled in one of Vickie's courses in Udemy!</p>", 
    "end_date": null, 
    "title": "Learn a Simple Approach to Creating an Online Video Course", 
    "price": "30.00", 
    "instructors": "Vickie Maris", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622560_5db1.jpg", 
    "course_url": "https://www.udemy.com/talking-head-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T21:19:09Z"
}