{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>A  MASTERS COURSE IN SPEAKING!</strong></em></p>\n\n<p><em></em></p>\n\n<p><em><strong>OVER 550 STUDENTS HAVE TAKEN THIS COURSE!</strong></em><br></p>\n\n<p><em><strong>EVERYTHING  YOU EVER WANTED TO KNOW IN ORDER TO TAKE YOUR SPEAKING CAREER TO THE  NEXT LEVEL</strong></em></p>\n\n\n\n<p><em>Would  you like to learn the real secrets of the world's most successful  speakers? Whether you are a professional speaker, trainer, lecturer  at a university or school - this course will teach you the 'insider'  secrets of taking your speaking skills to the next level.</em></p>\n\n\n\n<p><em>If  you charge for your knowledge and speak in public, this course will  change the way you speak and do business. One of the most important  criteria of becoming a successful speaker is to be authentic and walk  the talk.</em></p>\n\n\n\n<p>Knowing  this... from whom would you like to learn to speak? <em>Someone  that has the theoretical knowledge, or someone that has global  hands-on experience, walks the talk and actually done it all?</em></p>\n\n\n\n<p><em>Wolfgang  Riebe is the speaker all speakers dream about becoming! He travels  the globe, speaks at high profile events and captures his audience  with his unique brand of speaking.</em></p>\n\n\n\n<p><em>By  2013 he had spoken in over 144 countries and presented live to over 1  million people! He has also been awarded the CSP by the National  Speakers Association of the USA - the highest honor any professional  speaker can receive and a title currently held by less than 800  speakers world-wide!</em></p>\n\n\n\n<p><em>Here's  your chance to learn the 'insider secrets' of what it really takes to  make money and become hugely successful in your speaking career.</em></p>\n\n\n\n<p><em>You may feel that the course fee is high... in fact I have slashed the price by 50%. I guarantee that you WILL learn the secrets to making you rich as a speaker. Myself and udemy offers a full money back guarantee! PLUS when you sign up to the course, I will add a PERSONAL one on one 60 minute Skype session so that you can ask any further questions you may have and add even more value for yourself to this investment in your future.</em></p>\n\n\n\n\n\n<p>Don't  be misled by the 'Millionaire' title! It's not only about money!  It's about you becoming a better and more effective speaker! Those  speakers that are wealthy know these secrets – now they are being  shared with you.</p>\n\n\n\n<p>  </p>\n\n\n\n<p>Yes,  this knowledge will allow you to become a millionaire speaker,  because of 'business tips and skills' shared. But more importantly,  the speaking tips and insights you learn will guide you to become an  authentic,  powerful, commanding and sought after speaking who can  make a difference!</p>", 
    "end_date": null, 
    "title": "Learn the secrets of Millionaire Speakers", 
    "price": "50.00", 
    "instructors": "Wolfgang Riebe", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59699_bc29_6.jpg", 
    "course_url": "https://www.udemy.com/millionaire-speaker-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-12T15:49:41Z"
}