{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is for people wanting to <strong>grow their blogs</strong>, people just starting blogging or that already are advanced bloggers. In just 1 hour I included the essentials of blogging with Wordpress.</p>    <p>After 1 hour you will be able to organize your blog’s content, create new articles that capture attention, overcome the writer’s block, manage comments, build a community around your blog and become visible online.</p>    <p>In the last years I build several successful blogs and helped hundreds of people starting and building their online brand. A blog is <strong>an essential part</strong> of your online identity and this class will help you learn it the easy and simple way.</p>    <p>All the lectures can be downloaded and you can watch them offline, in your own pace whenever is better for you. You will also have available audio versions of each lecture to listen them as a blogging podcast.</p>    <p>To start, here's what you need to do next... <strong>click the Take this Course button</strong> top right and you'll be taken to our secure payment page. Just <strong><em><u>Enter Your Regular Details</u></em></strong> and complete your investment to have immediate access. </p>    <p>Stop struggling with your blog and <strong>start blogging now like a pro!</strong></p><p><strong>Thank you for reading this and learning about my course</strong> ... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE</strong> to get started!<span></span></p>", 
    "end_date": null, 
    "title": "Learn how to blog: Blogging Essentials for Beginners", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629374_0b55_6.jpg", 
    "course_url": "https://www.udemy.com/blogging-start-a-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T04:21:37Z"
}