{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Public Speaking can terrify even the most knowledgeable and well-prepared expert.  </p>\n\n\n\n\n\n<p>At some point, however, we all have to speak. </p>\n\n\n\n\n\n\n\n<p>Some get the 'opportunity' to speak to large arena-sized audiences. More often, though, we speak to medium sized audiences at weddings and business presentations. However, the experience can still be terrifying when we speak to just a few individuals, as we interview for a job or present our work to bosses or important clients. </p>\n\n\n\n\n\n\n\n<p>Lots of people believe the fallacy that it is confidence that is required to be a great speaker. And it's just NOT true. Confidence is just too subjective to be useful and this short course will give you 4 more powerful attributes to improve your public speaking.</p>\n\n\n\n\n\n\n\n<p>In this course the experienced storyteller, writer and standup comedian, Lynn Ferguson, shares her checklist for public speaking. A checklist that will take you minutes to implement and yet will almost instantly improve the way you deliver your next story or presentation, changing the way you approach all public speaking opportunities.</p>\n\n\n\n\n\n\n\n<p>Lynn Ferguson is an award winning writer-performer and a recognized force in the world of comedy. As a regular storyteller for The Moth, Lynn got bitten by the live storytelling bug in a way that she didn't get from other writing and performance experiences.  She created the YouTellYours storytelling school in Burbank California and holds a storytelling event in a small theatre every month.</p>\n\n\n\n\n\n\n\n<p>This short checklist for public speaking tackles the issues Lynn has most observed in her students. These issues have virtually nothing to do with the plot of the story you are about to tell or the more technical aspects of narrative, story arc or inciting incidents. The checklist is a practical method to  help you start well, end well, commit and deliver your message.</p>\n\n\n\n\n\n\n\n<p>No matter what audience you are about to face, this checklist will help you tell your story or deliver your presentation in a more compelling and seemingly more confident manner.</p><p>Included in the course are 4 stories from the YouTellYours storytelling school class events that highlight each aspect of the checklist.</p><p>\n\n\n\n</p><p><br></p>", 
    "end_date": null, 
    "title": "LIFT Your Storytelling To Improve Your Public Speaking", 
    "price": 0, 
    "instructors": "Mark Tweddle, Lynn Ferguson", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/866284_324f_2.jpg", 
    "course_url": "https://www.udemy.com/lift-your-storytelling-to-improve-your-public-speaking/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T23:05:00Z"
}