{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Average Student Review--5 Stars</strong></p><p><strong>3000+ Students and growing.</strong></p><p>  \t<strong>What Udemy students say about the course:</strong></p><p><strong></strong></p><ul><li><strong>by Faisal Qamar, </strong><strong>1 month ago</strong><em>Indeed Well structured and Updated Course...The instructor Rachel Leroy is well prepared and aware about common mistake which novice like me can easily caught in and lose the marks. Eights step are really important to gain high score in writing. She fully engage the student and prevent you from getting bore during Lectures. The course help you achieve your goals for instance in my case the course help me to point out the major and minor mistake I've done in my Final Dissertation writing. Last but not least the video and audio quality is very good. Great contents especially Recommend for Non-Native speaker...</em></li><li><strong>by Whojr01, </strong><strong>2 months ago</strong><em>HIDDEN GEM of a COURSE!I can't believe this course is free! This is a great course to improve your writing as it gives you a firm understanding of how to write. It begins with a simple understanding of words, sentences and paragraphs and ends with purpose and habits you can build on. This ONE free condensed version of her other more expanded class gives you a firm understanding of how to write so people can understand your ideas. When you're through you WILL want to take the parent course based on your improvements. IT's well worth it!</em></li><li><strong>by Francisca Roele, </strong><strong>3 months ago</strong><em>Great start for beginners. It's the light version of Become a professional Writer, but it covers plenty to keep the beginning writer busy for a while. I liked it so much I bought the full course.</em></li></ul><p><strong>What This Course Does</strong>  </p>  <p>  \t            Want to learn the fundamentals of clean writing style, but short on time? This course will give you the basics without investing much time.  </p>  <p>  \t                Want to make money writing, beat your competition, and stand out from the crowd?  Learn to make your writing sizzle and pop. By taking this course and applying the lectures, you will get the results you want by standing out from the competition, because--let's face it--good writing is essential for success in <em>every</em> area of life:  </p>  <ul>  \t<li>sell that manuscript</li>  \t<li>get that job or promotion</li>  \t<li>win the writing competition </li>  \t<li>attract customers </li>  \t<li>increase conversions</li>  \t<li>make a sell</li>  \t<li>get the A</li>  \t<li>win over the lover or opponent</li>  \t<li>persuade anyone in a logical argument</li>  \t<li>build credibility in the profession</li>  \t<li>create personal satisfaction</li>  \t<li>make more money</li>  </ul>  <p>  \t                Whether you are writing copy, building a website, making a resume or cover letter, writing a blog or proposal, selling work to magazines and publishers, self-publishing, composing a love letter, settling a dispute, writing a school paper, or earning your stripes, clean writing skills will get you there much faster.  </p>  <p>  \t                If you apply this fundamental and professionally engineered writing system, your writing will get the attention you deserve.  </p>  <p>  \t                Benefit from 18 lectures and 1 1/2 hours of interactive instruction, examples, and exercises immediately.  </p>  <p>  \t<strong>Why This Course Was Created</strong>  </p>  <p>  \t            You asked for it--so here it is--a light version of the popular Udemy course<strong>  Becoming a Professional Writer: Build Prose From the Ground Up</strong>.  This course, Beginner's Guide: Eight Steps to Sterling Prose is the Brief Edition,  its mini-me. This course gives you the opportunity to improve your writing style at no risk to you. It gives you handy strategies to make your writing stand out right away. If you like what you see here, sign up for the full  version to go more in-depth and make your prose shine.  </p>  <p>  \t<strong>Who Created This Course  \t</strong>  </p>  <p>  \t            This course is designed and taught by a university writing professor and published author with extensive training in writing. This experience includes thirteen years coaching thousands of students like you on the fundamental and habits of effective writing style with powerful results and consistently high teaching evaluations. I will coach you through the basic version of this professionally designed workshop. If you want a brief course to help you build sterling prose, you've come to the right place!  </p>    <p>  \t<strong>What Is Unique About This Course</strong>  </p>  <p>  \t                Tips requires daily practice for them to accomplish results. That is why this course includes habits and attitudes in addition to style strategies. This course briefly covers the fundamentals of style, and it covers important habits and attitudes of effective writing.  </p>  <p>  \t                In just a few days, you can also practice habits and attitudes that will help you get the most out of these tips. Daily practices will give you lasting success at beating your competition.  </p>  <p>  \t          This course uses an academically researched and time-tested approach called \"Bloom's Taxonomy,\" a model of learning that has years of proven results. The course design is a carefully built system of scaffolding, building skill sets in an interrelated sequence.  </p>  <p>  \t                Also, unlike a book, this course is personalized and interactive, which produces lasting results as you follow the exercises and suggestions on a real piece of writing, and you can come back to the course at any time! You also have access to the instructor via Udemy email and questions are always welcome. I love to help, so please email me your questions!  </p>  <p>  \t                Who Can Benefit From This Course  </p>  <p>  \t                This course is designed for those who want to learn the craft, need a thorough review on writing style, or want to tighten their prose. As stated above, if you want a brief course on writing style that makes your writing pop, then sign up for this course. If you want to stop experiencing rejection slips, no conversions, slow or no sales, and professional mediocrity, sign up for this course today. Get started making your writing stand out and change your life!  </p>  <p>  \t          Everyone can benefit from this course, but particularly beginning and intermediate writers in the follow fields, as well advanced writers who need a concise review of the fundamentals:  </p>  <ul>  \t<li>bloggers</li>  \t<li>business writers</li>  \t<li>people who write for profit</li>  \t<li>journalists</li>  \t<li>creative writers</li>  \t<li>academic writers</li>  \t<li>students</li>  \t<li>new writers</li>  \t<li>lifetime learners</li>  \t<li>copywriters</li>  </ul>  <p>  \t                How This Course Is Designed  </p>  <p>  \t                The course is broken down into four sections, each section containing two strategies to help you improve your writing style, approach, and habits. Each section is an abbreviated version of Becoming a Professional Writer. These strategies will help you improve clarity, flow, presentation, and results in your writing. The ultimate outcome and goal is writing that stands out and sells.  </p>  <p>  \t    The version of the course includes the basics of each strategy.  </p>  <p>  \t                Each strategy contains a slideshow and a synchronized video lecture that elaborates on each slideshow. Each strategy includes the following:  </p>  <ol>  \t<li>The strategy in a nutshell.</li>  \t<li>An explanation that elaborates on and clarifies each strategy and best practices.</li>  \t<li>Examples to explain the strategy in practice.</li>  \t<li>Exercises at the end of each strategy will test your knowledge, put the strategy into practice now, and facilitate lasting changes in your writing. </li>  </ol>  <p>  \t                By the end of the course you will know how to do the following:  </p>  <p>  \t                Words and Sentences  </p>  <ul>  \t<li>Build better clarity, flow, and conciseness in sentences through better word economy.</li>  \t<li>Improve tone and structure through activated sentences.</li>  </ul>  <p>  \t                Structures and Paragraphs  </p>  <ul>  \t<li> Increase the effect of each sentence through optimized word order.</li>  \t<li>Grab your reader's attention and keep it throughout the piece.</li>  </ul>  <p>  \t                Purpose and Presentation  </p>  <ul>  \t<li>Set clear goals and build unity in a writing piece to persuade your reader.</li>  \t<li>Build credibility and achieve desired results for writing that sells.</li>  </ul>  <p>  \t                Attitudes and Habits  </p>  <ul>  \t<li>Practice effective attitudes that will maximize results and improve your efficiency. And these attitudes will make the process funner!</li>  \t<li>Create healthy writing habits that will increase productivity, improve results, and increase your chances of success.</li>  </ul>  <p>  \t                Each category includes a concise skill set to help you sharpen your style and craft. Enroll in this course now to get started on writing with quality that sells. The longer course goes more in depth and includes more extensive techniques elaborated on the ones here.  </p>  <p>  \t                If you sign up for this course today, you will write sterling prose in a few short days.  </p>", 
    "end_date": null, 
    "title": "Make Your Writing Stand Out in Eight Easy Steps", 
    "price": 0, 
    "instructors": "Rachel Leroy                                 BA, MA, MFA", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371666_ef49_3.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-eight-steps-to-sterling-prose/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T18:40:02Z"
}