{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\">  \t<li>Do you wonder why some people abhor change, miss deadlines, never listen, get distracted or bored, talk too much, are abrupt, irritatingly detailed, seldom praise?</li>  \t<li>Are you frustrated due to misundersandings, conflict, and arguments?</li>  \t<li>Do you ever wonder... why can&#039;t we all just get on? </li>  \t<li>This course will guide you through the steps to build win-win business and personal relationship, and you will learn skills to motivate and encourage others both in their career and personal lives. </li>  \t<li>Imagine....greater life skills that can lead to improved productivity, increased profits, enhanced business or career success.</li>  </ul>  <p>  \t     This course<strong style=\"\"> </strong>provides powerful insights into into your social style, both your strengths and weaknesses. It will also help you appreciate other people&#039;s social styles and how to best relate to them. You will learn the value of versatility, specific steps you can take to better relate to others, and how to apply the principles taught to great advantage both in your personal and business life.  </p>  <p>  \t<strong style=\"\">The Course</strong>  </p>  <p>  \t        The training consists of 7 sections consisting of a series of videos and written material.  </p>  <p>  \t        There are quizzes and also exercises for you to complete, each designed to help reinforce what you have learned and to help you develop your skills in this area. There are also resources for you to download. The highlight of the course is an Action Plan where you map out how you will apply in your life what you have learned.  </p>  <p>  \t<strong style=\"\">Course Duration</strong>  </p>  <p>  \t                          This course is best spread out over several weeks to allow time to consider your own behaviors  and explore the personality styles of colleagues, staff, and other people you  interact with on a regular basis.  </p>  <p>  \t<strong style=\"\">No Prior Requirements</strong>  </p>  <p>  \t                    Personality Profiling for Business and Career Success is simple to understand and requires no former training or preparation. If you haven&#039;t done any personality related studies before, or are wanting a refresher, you will find &quot;Personality Matters&quot; insightful, powerful, and loaded with strategies, tools, and techniques you can implement.  </p>  <p>  \t<strong style=\"\">Money Back Guarantee</strong>  </p>  <p>  \t      If during the month after payment for this course, you are not completely satisfied<strong style=\"\"> </strong>and wish to discontinue, you may email me letting me know what it is you are dissatisfied with and I will refund you your money. The resources you have accessed will be yours to keep.  </p>  <p>  \t<strong style=\"\">Bonuses</strong>  </p>  <p>  \t      As a way of value-adding I will be creating bonus videos that will be added<strong style=\"\"> </strong>to the course.<strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Master Personality Power For Influence And Success", 
    "price": "50.00", 
    "instructors": "Silvia Wright-Davies", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312466_286e_2.jpg", 
    "course_url": "https://www.udemy.com/personalities-matter/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T21:02:51Z"
}