{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">   Take this course before making a speech!  </strong>  </p>  <p style=\"\">  \t<em style=\"\">Over 350 happy students are with me, learning to transform their public speaking.</em>  </p>  <p style=\"\">  \t<em style=\"\">*Take this to get free access to all upcoming course by Becky!*</em>  </p>  <p style=\"\">  \t<strong style=\"\">Master Public Speaking: Presenting Like a Pro</strong> is <em style=\"\">an enjoyable and practical guide</em> to public speaking mastery, focusing less on technical terms and more on <em style=\"\">practical application and optimising mindset</em>. The course offers more than the basic tips for presenting successfully with confidence and ease, instead using<strong style=\"\"><em style=\"\"> four key principles as a hinge that connects speaking skills with genuine audience engagement</em></strong>.  </p>  <p style=\"\">  \t                 It includes lectures, opportunities to pause for activities, and meditation guides to promote the adoption of distinguished speaking practices.  </p>  <p style=\"\">  \t          There is a 30 day <strong style=\"\">100% money-back guarantee</strong> and the opportunity to get one to one advice from me as you move through this course. I am here to help!  </p>  <p style=\"\">  \t<em style=\"\">Prices increase this March, 2015</em>, so click the Take This Course button at the top of the screen to start your journey in public speaking mastery.  </p>", 
    "end_date": null, 
    "title": "Master Public Speaking: Presenting Like a Pro", 
    "price": "20.00", 
    "instructors": "Becky Shortt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151902_42ae_6.jpg", 
    "course_url": "https://www.udemy.com/master-public-speaking-presenting-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-24T06:33:54Z"
}