{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>هل تساءلت يوماً كيف يراني الآخرين وأنا\nأتحدث الإنجليزية على الهاتف؟ وما الانطباع الذي يأخذونه عني؟  </p><p>لو كشف الستار لوجدت أن أغلبية قرارات\nالتوظيف والترفيعات وتحديد الرواتب تستند على مهارات التواصل الشفوي في عالم لم\nيعد يتحدث سوى بالإنجليزية. </p><p>هل تعلم أن أغلبية دورات اللغة الإنجليزية\nلا تعلم مهارات استخدام الهاتف. رحلتك معنا ستزودك بأمرين هامين؛ </p><p>الأولى يتضمن نصائح فنية في التواصل الهاتفي،\nوفن <strong>تدريب الحبال الصوتية</strong>، وأنواع <strong>الأصوات</strong>، والطاقة الصوتية والمدى الفعال،\nدرجة الصوت أثناء إنهاء الجملة، وسرعة الكلمات، <strong>وكيفية المحافظة على صوت ممتاز</strong>\nرغم التكلم طوال النهار.</p><p>أما الثاني، وهو الأهم، قمنا بجمع أشهر\nالعبارات المستخدمة عبر الهاتف وتزويدها بملف صوتي يمكنك تحميله على الموبايل\nوالاستماع إليه مرارا وتكراراً، كما قمنا بشرح هذه العبارات (بالعربية) والطريقة\nالمثلى لتوظيفها وخصوصاً العبارات الخاصة <strong>ب</strong><strong>استلام\nالمكالمات الهاتفية</strong> Phrases\nfor Answering a Phone Call <strong>والتعبير عن تواجد الشخص\nالمطلوب</strong> Availability و<strong>تحويل المكالمات</strong> Transferring a call و<strong>طلب الانتظار</strong> بشكل محترف Asking\nsomeone to wait professionally وعبارات تستخدم <strong>لحل المشكلات</strong> الهاتفية\nProblems &amp; Solutions (phrases) و<strong>استلام وتدوين\nالمكالمة</strong> Taking a message و<strong>طلب الاستيضاح</strong> Clarification وعبارات <strong>إجراء المكالمات</strong> الهاتفية Making\na call و<strong>إعادة الاتصال</strong> Calling\nback و<strong>الانصات الفعال</strong> Active\nListening و<strong>تلخيص معلومات</strong> المكالمة الهاتفية How\nto summarize the call و<strong>إتمام المكالمة الهاتفية بلباقة</strong> How\nto end the Call?، وعبارات الهروب من المكالمات الغير مرغوب\nبها Ending unwanted calls، وأخيرا محادثة هاتفية بين الأصدقاء Unofficial\nConversation</p><p>سنعمل سوية خلال البرنامج للارتقاء\nبقدراتك الصوتية ومهاراتك التواصلية وتمكينك من ترك انطباع المتحدث المحترف الواثق\nمن نفسه والقادر على إدارة دفة الحديث.</p>", 
    "end_date": null, 
    "title": "Mastering English Telephone Calls for Arab", 
    "price": "20.00", 
    "instructors": "Sobhi Akbik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635674_2f36_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-english-telephone-calls-for-arab/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T07:44:16Z"
}