{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  The Ultimate Public Speaking Solution is a intensive hands on training course that  will transform you into a confident, powerful, and influential public speaker and take your public notoriety and social impact to the next level.  </p>  <p>  \t                            The course contains 60 video lectures and 60 written practice exercises crafted by professional public speaker, coach and trainer Cliff Suttle. There is one lesson for every week day during the three month transformation but you may choose to take the course at a pace that best suits you. The video lectures contain face to face training from Cliff Suttle as well as demonstrations from live professional speeches.  </p>  <p>  \t                            Cliff Suttle has boiled down over a decade of experience into this comprehensive course. By the end of this course you will have learned what has taken the pros years to master.  </p>  <p>  \t                        Fear of public speaking will be a thing of the past. You will developed the confident voice of a leader and have the ability to connect with your audience and inspire them to take action. You will be able to provoke an emotional response from your audience so that anyone who witnesses your speech or presentation will never forget the experience.  </p>  <p>  \t                        Cliff Suttle has worked alongside Politicians and Olympic Athletes to help develop them into a powerful public voice. His goal in creating this course is to give everyday business professionals and small business entrepreneurs that same power.  </p>  <p>  \t                        This course will allow you to use public speaking and presentation as the main tool in promoting your name, business, brand, or cause on a viral level. STOP LETTING YOUR VOICE GO UNHEARD AND SIGN UP NOW!!!  </p>", 
    "end_date": null, 
    "title": "Master Public Speaking  ", 
    "price": "50.00", 
    "instructors": "Cliff Suttle", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312356_bcae_3.jpg", 
    "course_url": "https://www.udemy.com/ultimatepublicspeakingsolution/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T18:32:21Z"
}