{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Imagine yourself as a media trainer, helping top level executives, experts and authors around the world. Media training is a fascinating career, but one without the headaches of working in a large bureaucratic media organization.</p><p>You can make an excellent living by interviewing people and then training them on how to be interviewed more effectively. </p><p>This course will teach you how to be a media trainer from both the training perspective as well as the business perspective. You will receive several books and many hours of online video teaching you all aspects of media training. If you are thinking about becoming a media trainer, this course will help you figure out if this is the right career for you, and, if so, how to go about entering the profession. If you do all of the homework for this course and the sister course on media training (provided at no extra cost) you should spend at least 8 hours. Being a media trainer can be a fascinating career, but it only works for people who have the right mix of interests, talents and disciplines.</p><p>Course updated on July 20, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p>TJ Walker has more than 100,000 course enrollments from more than 13,000 online students around the globe.</p>", 
    "end_date": null, 
    "title": "Media Training: You Can Be a Media Trainer", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/275410_b201_4.jpg", 
    "course_url": "https://www.udemy.com/media-trainer-how-to-become-a-media-trainer/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-05T18:17:56Z"
}