{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You&#039;re about to learn how to: Grow resilient teams by managing meetings of excellence to meet your goals. In this course, you&#039;ll get 36 practical tools that you can take away and use tomorrow before, during and after your team meetings to move forward towards your goals. Ask yourself:</p><p><strong style=\"\">Have you ever had any of these concerns?</strong></p><ol style=\"\"><li>“I don&#039;t see how this meeting is relevant to me.&quot;</li><li>“I have other things on my mind.&quot;</li><li>“This is not high priority for me.&quot;</li><li>“I don&#039;t think the meetings have a good structure.&quot;</li><li>“I really don&#039;t like one of my team members.&quot;</li><li>“The meetings are a waste of time.&quot;</li><li>“They never finish when they&#039;re supposed to.&quot;</li><li>“We never follow up on action items.&quot;</li><li>“There are no action items assigned.&quot;</li><li>“We didn&#039;t get anywhere.&quot;</li><li>“The same topics keep coming up over and over again.&quot;</li><li>“There&#039;s always negative people that have nothing to contribute.&quot;</li><li>“We talk about the same thing over and over again.&quot;</li></ol><p><strong style=\"\">What If You Could Do The Following?</strong></p><ol style=\"\"><li>Enjoy being with your coworkers.</li><li>Get your ideas validated and recognized.</li><li>Get more help and support when you need it.</li><li>Get genuine praise for your accomplishments.</li><li>Achieve your organizational and individual goals.</li><li>Take on additional responsibility.</li><li>Show off your individual skills and abilities.</li><li>Incorporate your personal goals into those of the team.</li><li>Consolidate communication.</li><li>Prioritize your work.</li><li>Expedite decision making.</li><li>More effectively use your time.</li><li>Make better decisions as a team.</li><li>Get validation on the work you&#039;ve used your time on.</li></ol><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">Don&#039;t take our word for it. Listen to what others have to say: </strong></p><p>“As a presenter, trainer and business professional, I have conducted more than 750 webinars over the last 8 years. During that time, I have constantly searched for programs to help me increase my presentation skills, get people involved in my meetings, and dazzle my participants. For the most part I have been extremely disappointed until I took Jason&#039;s course. This course answered so many questions I had and gave me the tools and information I was looking for to truly upgrade the quality of my meetings. Now I know how to get people to participate instead of getting dead silence when I ask a question. I now am able to keep people&#039;s attention in my meetings and most importantly, I now lead with a powerful hook. As a result of taking Jason&#039;s course, I am closing more sales, dazzling my customers and getting rave reviews. If you are looking to dramatically increase your meeting skills, this is a must course.&quot;</p><p>Jim Facente -President Creative Sales Solutions</p><p>I actually just finished watching the Meeting presentation we&#039;ve been working through at our weekly Staff Meetings. When we ask, &quot;How can we use this in our particular ministries here?&quot; the applications for school, growth groups, and sermon-writing and preaching are just about endless. Thank you for your insights. I&#039;d never considered how my personality might naturally communicate better with some learners than with others. &quot;Rule the Room&quot; stressed the importance of knowing my own style first. Now I&#039;m designing learning activities that capitalize on the strengths of my style, while still engaging each individual. </p><p>Phil Hunter – Pastor</p><p>“Jason Teteak&#039;s teaching not only provided easy-to-use techniques, but the confidence and presence to truly run the show and communicate to your audience what you intended to. He changed the way I think—about being in front of people and about feeling assured doing my own thing effectively. You need to see what this course can do for you!&quot; </p><p>Mike Dyer – Project Manager</p><p>&quot;Jason&#039;s tips and advice have been tremendously beneficial to me both professionally and personally. Not only does he have great insights into how to engage adult learners during a meeting; he also has ways for making the usually daunting task of writing meeting material more manageable and achievable in a way that benefits both the presenter and the audience. These tips are great for public speaking beyond business settings too!&quot; </p><p>Jon Maloto – User Experience Designer</p>", 
    "end_date": null, 
    "title": "Meetings that Motivate: Presentations to Manage Your Meeting", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455264_d12f_2.jpg", 
    "course_url": "https://www.udemy.com/the-art-and-science-of-meetings-that-motivate/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T23:44:18Z"
}