{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Meetings wie Kundenmeeting, Teammeeting und alle möglichen Arten von Besprechungen machen einen Großteil des Arbeitsalltags eines Consultants oder Unternehmensberaters aus. Ineffiziente Meetings sind dabei für alle Beteiligten ein Ärgernis und eine Verschwendung wertvoller Arbeitszeit. Eine perfekte Meeting-Vorbereitung kann genau das verhindern und ist eine der wichtigsten Fähigkeiten im heutigen Businessalltag und Geschäftsleben!</p><p><strong>Aber wie bereitet man ein Meeting gut vor?</strong></p><p>Das ist genau das, was Du in diesem Kurs lernen wirst! Angefangen von den Grundlagen der verschiedenen Meeting-Typen über organisatorische und technische Details bis hin zum Erstellen einer perfekten Agenda.</p><p><strong>Kannst Du eine oder mehrere der folgenden Fragen mit JA beantworten?</strong></p><ul><li>Du hast vor Kurzem angefangen als Berater zu arbeiten und das erste Meeting steht bevor?</li><li>Du bist immer wahnsinnig nervös vor Kundenmeetings und fühlst Dich nicht ausreichend vorbereitet?</li><li>Du möchtest möglichst professionell Auftreten und Deine Kunden davon überzeugen, dass Du ein guter Consultant bist?</li><li>Du kommst eher aus der technischen Ecke und Dir fehlen die praktischen Business-Fähigkeiten?</li><li>Du möchtest Karriere als Unternehmensberater machen und Deinen Chef sowie Dein Team von Deiner Professionalität und Deinen guten Leistungen als Berater überzeugen?</li><li>Du möchtest grundsätzlich einfach lernen ein Meeting gut vorzubereiten?</li></ul><p><strong>Dann ist dieser Kurs genau das Richtige für Dich!</strong></p><p>Lerne von den Erfahrungen einer Expertin, die beide Seiten des Beratergeschäfts kennt und daher ein vollumfassendes Bild vermitteln kann!</p>", 
    "end_date": null, 
    "title": "Meetings perfekt vorbereiten ", 
    "price": 0, 
    "instructors": "Dr. Jenny Meyer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685982_9502_2.jpg", 
    "course_url": "https://www.udemy.com/meetings-perfekt-vorbereiten-fur-unternehmensberater/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-01T12:15:00Z"
}