{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Probably you saw other people's <strong>slide shows </strong>on the web, or when they run it and thought how great they can look. The slides <strong>look awesome </strong>and help the speaker expressing his ideas...</p><p>And, if you are like most people, probably you found them very sofisticated.</p><p>Stunning - could define them in just a word...</p><p>Most people usually think<em> \"That presentation and those slides look awesome, but I don't know Powerpoint, no graphic design either and paying a graphic designer to create this kind of presentation for me ... I guess would cost a fortune...\"</em></p><p>This is true... well, at least a part of it...</p><p>Paying a designer to create a professional, stunning presentation can cost you a small fortune. </p><p>But it's not true you cannot do it by yourself.</p><p>Since presentations that look great became a \"standard\" for professionals, <strong>having your own great looking presentations usually help a lot in positioning you as an authority</strong> in your niche (assuming you know your topic). And to present your ideas in a way that generates trust, when you speak in front of your collegues, your managers or a group of investors.</p><p>And there are a lot of software that can help you, from Powerpoint, Keynote, Prezi, to Canva and many others.</p><p>Microsoft Powerpoint is one of the most popular slide show presentation program</p><p>This course is <strong>a beginner course on how to create professional looking presentations to use </strong>in your speachees and presentations, by using Microsoft Powerpoint. It's intended for people who want to position themselfes, their ideas and services and be seen as an authority (like ...\"<em>that guy know what he talks about, had a stunning resentation, he must be good in what he does.</em>.\")</p><p>And to also<strong> capture attention of your audience.</strong> No matter if you present something to investors, your bosses or your collegues.</p><p><strong>You don't need any graphic design experience</strong>, just<strong> start from zero</strong> and create amazing presentations that look awesome one slide at the time.</p><p>You will learn</p><ul><li>how to use the Powerpoint dashboard,</li><li>where to find the needed commands and options to develop your presentation, each menu explained with all its options,</li><li>how to add images and photos to your slides,</li><li>how to format the text areas to look awesome without spending hours,</li><li>how to find out already prepared presentation templates that look professional, are free and you can get them directly from Powerpoint interface,</li><li>how to add shapes or any other graphic element,</li><li>how to structure your information and processes in smart arts that show them in a second,</li><li>how to export your presentations from Powerpoint to other formats,</li><li>how to animate the text and any graphic objects and give live to your presentation by using transitions.</li></ul><p>By taking it, you will be able to understand and master the art of <strong>creating high quality presentations in the step by step </strong>demonstrations. </p><p>In your own pace.</p><p>My name is Florin Rosoga, I had hundreds of presentations in the last 15 years. One of the most important elements of a speach is a presentation you display, help you present your ideas and in the same time helps you look professional.</p><p>In this course you will get step by step video explanations to help you understand in a comfortable way <strong>all about creating this kind of slide shows in minutes </strong>without any previous graphic experience.<br></p><p>The entire course can be downloaded as a video training to watch or listen it in your own pace and whenever it suits you better... just like a podcast.</p><p>To start, here's what you need to do next... click the <strong><u>Take this Course button</u></strong> top right and you'll be taken to our secure payment page.</p><p>Just <em><u>Enter Your Regular Details</u></em> and complete your investment to have immediate access.<br></p><p><strong>Stop struggling with the same boring slide shows </strong>you ever used and <strong>start mastering professional presentations </strong>and slide shows in minutes, just like a pro!</p><p><strong>Thank you for reading this and learning about my course .</strong>.. I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE </strong>to get started!<br></p>", 
    "end_date": null, 
    "title": "Microsoft Powerpoint Masterclass", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646836_87ff_5.jpg", 
    "course_url": "https://www.udemy.com/professional-microsoft-powerpoint-presentations-with-powerpoint-slides/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T14:17:47Z"
}