{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>How important is the need of negotiating? Does it impact your life and your money? Well, all that I would say, “If you can’t negotiate effectively with people, you shouldn’t buy/sell anything for more than a few dollars.”</strong></p>  <p>The reason I say this is because regardless of the type of work we do, knowing how to negotiate effectively can greatly impact our success and our satisfaction. Wondering how? I will tell you how… but before that let me remind you how often you negotiate in life. From childhood, you must have practiced the art of negotiation – Bed time, a treat, a promotion, a raise, an extended deadline. Yet you are not good at negotiations. Why? Does it demand a different level of intellect and expertise? Well, I will say “No” to the former and “Yes” to the latter. There are some techniques and a process when put into practice enable you to save thousands of dollars, but unfortunately no one has told you these techniques yet and hence, you are missing out. And by this time, I am sure you must have figured out what I am doing here. I am here to help you and uncover all these techniques in this course.</p>  <p>It may be…or may not be difficult for you to digest the fact that we all negotiate on a daily basis. On a personal level, we negotiate with friends, family, landlords, car sellers and employers, among others. We come across hundreds of situations that put our negotiation skills to the test. Whether buying a house or car, reviewing your salary with your boss or deliberating contracts for your business, your success in each of<strong> </strong>these activities will be heavily dependent on your ability to negotiate. </p>  <p>But how come I am speaking so highly of negotiation skills? Well, I've spent thousands of hours reading books, articles and videos and doing real life research aiming to master negotiation conversations. And now, I want my learnings to benefit you so that you don’t need to chart the long road which I have treaded on. I want my long road to be your shortcut and hence, I have created a <strong>7-step model “N.E.U.R.O Negotiation System</strong>”. Combining the principles of Evolution and Brain Science, this program demystifies the science of negotiation like nothing else. This course will help you prepare for and conduct real-world negotiations, from personal to professional, small to large, daily to extraordinary. You won’t be able to find anything else even one-hundredth as valuable and jaw-dropping. If you get, please feel free to revert to me. Within months, hundreds of people saved 1000s of dollars and made numerous connections with some very influential people. I believe it to be the most powerful idea for business, career, and personal life. </p>  <p>But what makes it so special? Only my words? Or something else? Well, here is the answer. Drawing on the latest research and best practices across a breadth of industries, the course goes far beyond simplistic formulas such as \"win-win\" and \"win-lose.\" Instead, it provides hard-hitting, practical, intensive, and transformative techniques.This course is guaranteed to keep you engaged and amused, and teach you life-changing skills for home and work. The course discusses lots of real life examples (some of which will definitely get you laughing) and gives practical tools you can use right away to get better results. And what more and better than the fact that you can learn all this by just sitting at your home. You don’t need to get mauled by scrupulous people before you can learn the art of negotiations. Although to master it, you need to walk out and experiment.</p>  <p>After attending this program, you won’t remain the same; the impact will be severe. AND massive! Your life will change forever. This is the surefire mantra to big-ticket successes. You will learn the art of crafting such compelling messages that people will surely open their hearts and wallets for you.</p>  <p>All this can be a reality for you as well. Think big. Take the plunge. </p>  <p>- This is NOT a basic Negotiation training program.</p>  <p>- This is a Mastery Course to learn to negotiate in any situation </p>  <p>-  Only requirement to become a successful negotiator is you should be willing to break away from all your existing beliefs and keep an open mind while taking the course. Are you not game for it?</p>  <p>You can have a super-kickass, freaking-awesome, absolutely wonderful life. </p>  <p>What are you waiting for?</p>", 
    "end_date": null, 
    "title": "N.E.U.R.O. Negotiation System: Make/Save 1000s of dollars", 
    "price": "20.00", 
    "instructors": "A. K. Goel, Susmita Dutta", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/701188_a1b1_3.jpg", 
    "course_url": "https://www.udemy.com/neuro-negotiation-system-become-number-one-negotiator-and-make-or-save-money/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-19T01:59:00Z"
}