{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course offers professionals an introduction to the negotiating process in China. &nbsp; Author and consultant Andrew Hupert shows you how to build the kinds of relationships and deal structures you need to earn profits while protecting your assets. &nbsp;The China market is one of the greatest opportunities of our time -- and the most significant business risk you&#039;ll ever face. &nbsp;</p><p><strong><em>Negotiate Successfully in China</em>&nbsp;</strong>will show you how to:</p><p></p><ul><li><span>Construct a negotiation plan that leads to profitable business - not empty promises.</span></li><li><span>Develop and maintain value-adding relationships and networks.&nbsp;</span></li><li><span>Find the right partners - and keep them loyal.</span></li><li><span>Protect your technology, intellectual property and assets.</span></li><li>Identify and leverage your sources of power.</li><li><span>Understand what Chinese negotiators really want - and what they really mean.</span></li></ul><p></p><p>The material in this course can be absorbed quickly - but will serve as a useful resource throughout your career. &nbsp;A series of fast-paced video lectures is supported by downloadable slideshows, fast quizzes and readings. &nbsp;If you are involved in China business, this course will provide you with invaluable knowledge and skills.&nbsp;</p>  ", 
    "end_date": null, 
    "title": "Negotiate Successfully in China", 
    "price": "25.00", 
    "instructors": "Andrew Hupert", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35726_5952_4.jpg", 
    "course_url": "https://www.udemy.com/negotiate-successfully-in-china/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-11T14:29:17Z"
}