{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Think about a time when you got a job you really wanted. Think about a huge sale you made. Think about a big win you celebrated. What was most likely involved in those wins?</p><p>Its simple really. You probably knew somebody on the inside. </p><p>The thing that people seem to miss when it comes to sales and getting ahead, is there is an easy way and a hard way. The hard way is cold calling/emailing day after day and saying \"it's a numbers game\". Then there are the smart people that win big. These people network. However, they don't just network to network. They network in a strategic intentional way to connect with the right people until their sales explode. </p><p>By knowing how to properly network in a strategic way, some amazing things happen. </p><p>Over the past 5 years I've gone from having 70 of my closest friends literally walk out of a presentation about my business to being recognized as one of the most connected people in New York City. </p><p>But it hasn't always been this way. I was like everybody else. </p><p>At first I cold called. Then I thought I would be smart and go to a different networking event every night. </p><p>And still, I found myself banging my head against the wall, praying that I'd make my sales numbers every month just to pay rent. </p><p>And then one day, by accident, I met my first Super Connector. And that's when it all changed. </p><p>This one person opened my eyes to what's possible by teaching me how to: </p><ul><li>Find extraordinary people</li><li>Capture the benefits of extreme reciprocity</li><li>Become friends with the most amazing people on earth</li><li>Create a funnel of what seem to be magical opportunities </li></ul><p>This is course is a result of everything that I've learned. All the secret formulas and blueprints for exponentially increasing your sales, winning more business and building amazing friendships with people you never imagined could be in your life. </p><p>More specifically, you will learn: </p><ul><li>The secret formula for connecting</li><li>What a Super Connector is and how you can become one</li><li>Strategic &amp; intentional networking strategies</li><li>The fastest ways to expand your network of extraordinary people</li><li>How to automate and scale your efforts</li></ul><p>Additionally, I'm going to give you: </p><ul><li>A blueprint that you can use daily, weekly, or monthly to sky-rocket your success on demand</li><li>Programs and hacks to save you time so that you can add these skill-sets to your already busy schedule</li><li>A free report with 100 tips on connecting</li><li>Methodologies for creating events that force you to befriend other Super Connectors and influencers</li><li>Action plans to increase your sales and overall success by tomorrow</li></ul><p>AND you'll have access to all the information in this course for life in addition to the extra material that I'll be releasing to course members over the coming weeks and months. </p><p>The sooner you try this approach, the sooner I guarantee that you'll stop wasting time, effort, energy and money. And instead, you'll start achieving your goals and living your dreams. </p><p>REMINDER: This is a risk free purchase with Udemy's 30 day money back guarantee. Just imagine what your life and business would be like if within 30 days you doubled your network, doubled your sales and took your life to the next level. </p><p>Best, </p><p>Greg Pilla </p><p>P.S. Due to the recent launch of this course, the course is currently priced at a discount. I plan to increase the price in the near future so sign up at the current price while you can! </p>", 
    "end_date": null, 
    "title": "Networking Mastery 2016", 
    "price": "20.00", 
    "instructors": "Greg Pilla", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/549516_871a_4.jpg", 
    "course_url": "https://www.udemy.com/networking-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-08T22:27:20Z"
}