{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Through this course you will:</em></strong></p>\n\n<ul><li>Learn the writing basics</li><li>Learn how to eliminate writer's prompts.have a glimpse on writing process</li></ul>\n\n<ul><li>fear not the long sentences</li><li>Learn the essential tools for great non fictional or fictional writing.</li><li>Learn the advanced exercises for great fictional or non fictional writing.</li></ul><ul><li><strong><em>This course is suitable for: </em></strong>Undergraduates, Post Graduate Students,Entrepreneurs,People from any country,</li></ul>\n\n<ul><li><strong><em>This course is suitable for </em></strong>:Those who\n want to write fictional or non fictional writings such as \nEssays,Articles,Stories for publication,Editorial columns , feature film\n or short movie stories.</li></ul><p>At times, it helps to think of writing as carpentry. That way, writers and editors can work from a plan and use tools<br>stored on their workbench. You can borrow a writing tool at any time. And here's a secret: Unlike hammers, chisels,<br>and rakes, writing tools never have to be returned. They can be cleaned, sharpened, and passed on.</p><ul><p>As you study and discuss these, please remember:<br>· <em><strong>These are tools and not rules</strong></em>. They work outside the realm of right and wrong, and inside the world of<br>cause and effect. You will find many examples of good writing that seem to \"violate\" the general advice described here.<br>·<strong><em> It will not help to apply these tools at once,</em></strong> just as aspiring golfers swing and miss if they try to<br>remember the 30 or so different elements of an effective golf swing.<br>· <em><strong>You will become handy with these tools over time.</strong></em> You will begin to recognize their use in the stories<br>you read. You will see chances to apply them when you revise your own work. Eventually, they will become<br>part of your flow, natural and automatic.<br><em><strong>· You are already using many of these tools without knowing it</strong></em>. It is impossible to speak, write, or read<br>without them. But now these tools have names, so you can begin to talk about them in different ways. As your<br>critical vocabulary grows, your writing will improve.</p></ul>", 
    "end_date": null, 
    "title": "Ninja Writing :Become An Exceptional Writer With Originality", 
    "price": "20.00", 
    "instructors": "Growth Hacking Coach", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785236_d787_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-an-exceptional-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T18:08:18Z"
}