{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Learn Rapport and get access to an NLP Master, Trainer and Coach - valued at $thousands (for normal 1 on 1 coaching and training ) for the special &amp; LIMITED time investment you see here. So why would you want to learn about Rapport?</strong></p><ul style=\"\"><li style=\"\">How would it be if you could <strong style=\"\">communicate well</strong> with <strong style=\"\">anyone</strong> at any time AND be sure that your communication would be considered by the person you are speaking with ?</li><li style=\"\"><span style=\"\"></span>Imagine if you could <strong style=\"\">increase your sales</strong> closure through choosing to decide to learn this one simple technique? </li><li style=\"\"><span style=\"\"></span>Would you like to be the type of person that everyone <strong style=\"\">&#039;just kinda likes !&#039;</strong> </li><li style=\"\">Maybe you would just like to feel more confident in speaking with people you don&#039;t know that well. </li><li style=\"\">How would it be, if you could covertly influence people into seeing things from your point of view?</li></ul><strong style=\"\">What is Rapport?</strong>Rapport is the process of matching and mirroring and is the basis of all effective communication. <strong style=\"\">By learning Rapport you will:</strong><ul style=\"\"><li style=\"\"> be able to create a strong personal connection to whoever you want to</li><li style=\"\">increase your skills as a communicator</li><li style=\"\">close more deals </li><li style=\"\">be generally more popular ! </li><li style=\"\">Be able to influence others more easily </li><li style=\"\">will have your suggestions and ideas considered and taken seriously </li></ul><strong style=\"\">THIS COURSE TEACHES YOU THE PROCESS OF BUILDING RAPPORT !</strong>In this course you will be taught and have access to a Master of NLP and entrepreneur. Matt Barnett, is a certified trainer of NLP and an expert in personal development. The course includes real world examples and insights from an international Trainer of NLP The course includes video and audio and is a fast track approach to an exciting topic. <em style=\"\">&quot;My aim is to give people the information they need with rapport quickly so that they can get out there and start using it straight away &quot; Matt Barnett </em><em style=\"\"></em><em style=\"\">** Remember </em><span style=\"\"> That this course is backed with a full 30 day money back guarantee ! so there is no risk at all. </span>", 
    "end_date": null, 
    "title": "NLP: Make people Like YOU! The skill of building rapport", 
    "price": "20.00", 
    "instructors": "Matthew Barnett", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366954_1932_2.jpg", 
    "course_url": "https://www.udemy.com/nlp-rapport/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T23:07:20Z"
}