{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Over 700 happy students already enrolled and loving this brand new course!</em></p><p>For some people speaking in public is one of the most feared tasks they will ever have to go through. Sweaty palms, sleepless nights, physically sick - these are all symptoms that can be avoided through training. This course will show you how to overcome you fear of public speaking by giving you the ultimate techniques that actually work!</p><p>Imagine the feeling of stepping in front of a large auditorium full of people, all looking at you, and all you feel is confidence and excitement. If you are ready to put your fears behind you and start feeling more confident speaking in public, then this course is for you! </p><p><strong>Overcome Your Fear of Public Speaking Today! </strong></p><p>Throughout your life there are going to be many occasions where you will be required to speak in front of a crowd or large audience. Weddings, funerals, birthday party’s, meetings, committee’s, the list goes on. Regardless of whether you are addressing 5 people or 500, unless you take action to rectify this behaviour, you are always going to feel nervous or scared. This course will show you how to do beat those nerves forever!</p><p><strong>Contents and Overview</strong></p><p>This course contains 19 lectures and over 1 hour of content. It is designed for anyone who gets nervous before giving a speech. The more nervous you get, the more this course can benefit you. You may be a new teacher, you may be preparing to give a speech at your best friends wedding or you may have a big presentation you need to give for work. Whatever it is, and whatever scale it’s on, this is the course for you!</p><p>In this course I am going to show you how to harness your nervous energy, engage with your audience and use your body language to make you feel more confident in front of a crowded room. I have taken all of my failures, my successes and all the research I have done over the last 15 years as a professional instructor and distilled it down for you into this short course. When I first started I was such a nervous speaker, but by using the techniques outlined in this course I have conquered my fears and now I love public speaking. </p><p>At the end of this course you will be able to better control your fears and speak more confidently in public. You will have all the tools and techniques you need to recognise where you fear is coming from and what you need too do to make it go away. These are real concrete tools that have been proven to be successful time and time again.  </p><p>If you are fed up with feeling nervous before public speaking then this course can show you how to overcome your fears and start to feel more confident today!</p>", 
    "end_date": null, 
    "title": "Overcome Your Fear of Public Speaking Today!", 
    "price": "20.00", 
    "instructors": "Rob Hills", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667504_9c9d_4.jpg", 
    "course_url": "https://www.udemy.com/overcome-your-fear-of-public-speaking-today/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T04:22:37Z"
}