{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">People Skills - How People Tick</strong></p>\n\n<p>This course could rocket your sales, find you a soul mate, or even get you the job of your dreams. How? Every interaction in life comes down to people skills and making people tick. If you can understand instantly what a person is thinking and feeling then you can make them feel relaxed, welcome, and ultimately trust you. If you're working with people on a day to day basis, and want to portray your best side then this is the course for you.</p>\n\n<p>Andy Edwards is an international speaker and widely published author, who's been teaching business skills to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills to transform your business and personal life.</p><p>Thousands of people like you are benefitting from APA (or Applied Psychometric Awareness). This simple, easy to learn yet POWERFUL technique allows you to understand what makes others tick – almost instantaneously.</p>\n\n<p><strong>The course overview includes:</strong></p>\n\n<ul><li><em>Human behaviour over the ages</em></li><li><em>Theorists from Hippocrates to Jung</em></li><li><em>Introduction to Psychometrics</em></li><li><em>The Jungian ‘Attitudinal Functions’</em></li><li><em>Applying psychology to easily identified colours</em></li><li><em>Understanding the ‘self’, and building emotional intelligence</em></li><li><em>Identifying those ‘Not like me’</em></li><li><em>Your subconscious prejudices</em></li><li><em>Good day vs Bad day behaviour</em></li><li><em>Adapting and connecting to all kinds of people </em></li><li><em>The golden rule</em></li><li><em>And lots lots more!</em></li></ul>\n\n\n\n<p><br></p><p>-------------------------------------------------------------------------------------------------------</p><p><strong class=\"redactor-inline-converted\"><br></strong></p><p><strong class=\"redactor-inline-converted\">How does it work?</strong></p>\n\n\n\n\n\n\n\n<p>Well, imagine meeting your next customer or client.  Imagine your initial greeting of each other – polite and perhaps even a bit formal… Quickly, you mentally check three elements of their behaviour – and immediately understand their type.  You can now anticipate their decision-making process, their likely responses to your questions – their wants, their needs, their motivations and their preferences.</p>\n\n\n\n\n\n\n\n<p>You consciously (but only slightly) adapt your behaviour and your own communication style to suit that interaction.  They will walk away from that meeting with an unconscious (or perhaps even conscious) sense of connection with you. “What a nice guy”.  “She seems a trustworthy person”.  “They made me feel really comfortable”.  “It seems like I have know them for years!”</p>\n\n\n\n\n\n\n\n<p>A great practical illustration is found at my dinner table… let me explain… my two sons are both left handed.  It is a physical preference of theirs.  It’s not MY preference – I am firmly on the right handed preference spectrum.  But when they come over for a Sunday lunch, I set their places at the table with the knife and fork round the way THEY prefer.  Not MY way round… THEIR way round.  Now, this takes little or no actual work… almost no effort at all… but it DOES rely on my being aware of their preference.</p>\n\n\n\n\n\n\n\n<p>In social and workplace situations, if we ‘set the table’ psychologically, for another person according to THEIR preferences – rather than our own, then we are connecting at a broader, deeper and more influencing level than ever before.  </p>\n\n\n\n\n\n\n\n<p>I tell you now, if it’s better business results you’re after, then APA is a sure route to success; why?  Well, we all know that, people buy people first… probably even more so in your area of business.  Relationships – not money – are the true currency of business.  So doesn’t it make sense to understand how to help people get to know you, like you and trust you?  With Applied Psychometric Awareness this becomes a simple – yet incredibly powerful process.</p>\n\n\n\n\n\n\n\n<p>If you like the idea of finding out more about yourself and others… and you want to know a few answers to the question “What makes people tick…?” Then let’s get started as soon as possible. </p>", 
    "end_date": null, 
    "title": "People Skills - How People Tick", 
    "price": "20.00", 
    "instructors": "Andy Edwards, Louise Croft", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/772744_8f88_2.jpg", 
    "course_url": "https://www.udemy.com/people-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-24T09:26:10Z"
}