{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong>Course Description</strong></p><p style=\"\">Do you wonder how your favorite novelists create openings that grab you, pull you in, and make you need to read to the next page? In this course, you'll learn how to pace your first chapters with flowing, dynamic prose. Whether you're looking to self-publish or are searching for an agent, editor, or publisher, you'll discover the techniques to build a strong story opening.</p><p style=\"\"><strong>Contents and Overview</strong></p><p style=\"\">This course contains thirteen lectures and approximately fifty minutes of video content. In addition, it contains worksheets with practical exercises that you'll apply to your own work.</p><p style=\"\">For those vital opening chapters, I'll teach you what I've learned as an editor. My experiences editing for a New York Times bestselling publisher, and now for independent authors, have shown me the mistakes so many authors make in those first pages. We'll cover three major areas that trip many writers up:</p><ul><li>Introducing characters for the first time</li><li>Confusion between world building and world introduction</li><li>Presenting your story's initial conflict</li></ul><p style=\"\">Each of these areas will be broken down into the following lessons:</p><ul><li>The most common problems writers make</li><li>A case study of an author who's done it well</li><li>Worksheets with exercises to apply to your own story</li></ul><p style=\"\">Whether you have a completed draft that you need to polish, or you're writing down your story for the first time, these techniques will help you create a story with pacing that pulls the reader to the next page.</p>", 
    "end_date": null, 
    "title": "Perfect Pacing for Fiction Writers: Nailing Act One", 
    "price": "20.00", 
    "instructors": "Faith Van Horne", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589854_aa43_3.jpg", 
    "course_url": "https://www.udemy.com/perfect-pacing-for-fiction-writers-nailing-act-one/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T20:51:51Z"
}