{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                            <em></em></p>\n\n<p><em>We support the NEW udemy Price guidelines for all Students with this new</em><em> Coupon Code:</em> <strong>50%Off</strong><br></p><p>Speaking skills are a necessary \"Key to Success\" in an interconnecting Global world...and you know it's true.</p>\n\n\n\n<p>  \t                           In Business, Professionally, Academically, even Socially, Speaking at public events is an invaluable skill. Competent public speaking is a major factor in networking, attracting &amp; building cliental, establishing Trust, and positioning yourself as a Leader. 60-70% of Americans say their #1 Fear is Public Speaking, but actually...  </p>\n\n\n\n\n\n<p>  \t                                            Public Speaking skills are learnable. The phrase \"Fear of Speaking\" is both misused and  overrated. There is no such thing as a \"<em>natural born speaker</em>\", a myth that's been perpetrated for too long. My Teaching &amp; Coaching experience proves that for most people, Public Speaking fear, anxiety, and stress can be well-managed, eliminated, or better yet, effectively incorporated into your Speaking events.  </p>\n\n\n\n\n\n<p>  \t                                            This Course is designed for a person that wants to successfully participate in the  opportunities of Globalization, whether you're a Student, Business person, Academic, or Professional. Speaking skills are central to your success.  </p>\n\n\n\n\n\n<p>  \t        This course replicates the Training of my on-site Workshops in Los Angeles and Tokyo. I'll introduce Speaking skills, techniques &amp; concepts, explain what they are, demonstrate how to use them, and tell you why you should use them. By participating in this course you must be prepared to <em>physically involve</em> yourself in your own learning. Performance of Speaking and Presentation skills are learned by practice &amp; rehearsal... and they produce results.  </p>\n\n\n\n\n\n<p>  \t                    In this Course you'll Learn:  </p>\n\n\n\n\n\n<ul>  \t<li>A set of Physical &amp; Mental Fundamentals to prepare You for the skills that follow.</li>  </ul>\n\n\n\n\n\n<ul>  \t<li>How to <em>naturally</em> Move around the Front of a Room or up on a Stage.</li>  </ul>\n\n\n\n\n\n<ul>  \t<li>Techniques for using a variety of Microphones and the #1 Rule to remember.</li>  </ul>\n\n\n\n\n\n<ul>  \t<li>How to work with and without Lecterns &amp; Podiums.</li>  </ul>\n\n\n\n\n\n<ul>  \t<li>Why you should like your voice, and How to effectively use it.</li>  </ul>\n\n\n\n\n\n<ul>  \t<li>A simple, reliable Map to quickly write any type of Speech or Presentation.</li>  </ul>\n\n\n\n\n\n<ul>  \t<li>How to maintain an Audience connection when working with WhiteBoards &amp; Slide shows.(Powerpoint, Keynote)</li>  </ul>\n\n\n\n\n\n<ul>  \t<li>How to Read a Speech naturally &amp; effectively.</li>  </ul>\n\n\n\n\n\n<ul>  \t<li>How, When, &amp; Why to use Comedy &amp; Humor. </li>  </ul>\n\n\n\n\n\n<ul>  \t<li>Tips &amp; Techniques to help you develop the Confidence to use these skills. </li>  </ul>\n\n\n\n\n\n\n\n<p>  \t                 If you believe that you'll become a confident &amp; competent Speaker by reading a book or watching a couple of videos, I believe you'll be disappointed. The \"Key\" is practicing and rehearsing these skills before you need to use them.  </p>\n\n\n\n\n\n<p>  \t                                            If you make the commitment to learn and use the training I provide, profit from some of the tough lessons I've learned (which I'll share with you), and practice what you learn, you'll be prepared to engage individuals and groups as a Confident and Competent Speaker anywhere, at anytime, with anyone.  </p>\n\n\n\n\n\n<p>  \t <strong>     BONUS</strong>:  This Course includes a <strong>Free</strong> <strong>Video Evaluatio</strong><strong>n.</strong> It’s available to all Students for a full 3-months after working with this Course for 6 weeks.  </p>\n\n\n\n\n\n<p>  \t                                            If you want to design a successful future, Good Speaking skills and this Course will help you achieve it. Public Speaking is a Learnable set of skills.  </p>", 
    "end_date": null, 
    "title": "Performance of Speaking: a Learnable set of Speaking Skills.", 
    "price": "50.00", 
    "instructors": "Tom j Dolan", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/70016_fcd3_11.jpg", 
    "course_url": "https://www.udemy.com/performance-of-speaking/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-26T09:17:41Z"
}