{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em></em><strong>****Course Continuously Updated! Recently Updated on 04/23/2016****</strong><em> </em></p>\n\n<p><em>This hot new mobile app is great for entrepreneurs, online marketers, instructors, coaches, sales professionals, authors, and anyone with a desire to build a list or tribe via social media. <em>Learn how you can utilize the power of Periscope in your business, to expand your reach and get your message in front of live viewers from all across the world, while driving traffic to your own website, products and services. </em> </em><strong></strong></p>\n\n<p><strong><em><strong>Scope out your ideal client and build a devoted list of followers who are anxiously awaiting your next broadcast!</strong></em><strong></strong></strong></p>\n\n<p><em><strong>In this course you'll learn:</strong></em></p>\n\n<ul><li>How to Master Periscope Live Video Broadcasting Like a Pro</li><li>Navigate the Periscope Mobile App with Ease (Both IOS and Android)</li><li>How to Use Periscope to Build Your Brand and Drive Traffic to Your Business</li><li>How to Narrow Down Your Target Market &amp; Get Your Scopes Seen by Your Ideal Client</li><li>Build a Devoted Group of Followers Who Are Waiting for Your Next Broadcast</li><li>Learn the Top Mistakes to Avoid BEFORE You Begin</li><li>Craft a Compelling Title to Get More Viewers to Join and Watch your Scopes</li><li>How to Set an Interesting Thumbnail for Each Broadcast</li><li>Create a Compelling Elevator Pitch that You can Use for Your Introduction</li><li>Learn HOW and WHEN to Ask for Hearts, Follows, and Shares</li><li>Learn How to Engage and Interact with Your Viewers</li><li>Tips for Overcoming the Fear of Live Broadcasting</li><li>Learn Clever Ways to Leverage the Power of Periscope into Your Own Business</li><li>How to End Your Scopes with a Strong Call-to-Action</li></ul>\n\n<p><em><strong>But wait, there's more! As an added bonus I've added:</strong></em></p>\n\n<ul><li>Tips and Tricks to Put You Ahead of the Game so You Can Compete with the 'Most Loved' Broadcasters on Periscope</li></ul>\n\n<ul><li>How to Cross-promote Between Periscope and Twitter to Build a Greater Following on Both Platforms</li><li>Learn How to Save Your Scopes and Publish them Beyond Periscope via YouTube</li></ul>\n\n<p><em><strong>...and much more! </strong></em></p>\n\n<p>I've been doing Periscope market research religiously since I first discovered this hot new social media platform. I've watched and studied the best of the best, the 'Most Loved' broadcasters, as well as my most successful business mentors. This course is a compilation of what I've learned from them, and now you too can leverage the power of Periscope in your own business.</p>\n\n<p>This course will teach you everything you need to know to use Periscope like a pro.</p>\n\n<p><strong>Are you ready to get started???</strong></p>\n\n<p>I look forward to connecting with you as you work through the course. Sign up today!</p>\n\n<p>To your success,<br>Shanda Trofe<br><em>Bestselling Author of Periscope Your Biz: Live Video Broadcasting for Profits</em><br></p>\n\n<p><strong>P.S. If you're ready to join, simply scroll to the top and select “Take this Course\" to get started! </strong></p>\n\n<p><em></em></p>", 
    "end_date": null, 
    "title": "Periscope - Business ", 
    "price": "20.00", 
    "instructors": "Shanda Trofe", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550092_e2a8_3.jpg", 
    "course_url": "https://www.udemy.com/periscope-your-biz/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-09T14:00:41Z"
}