{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Persuade with Class, Negotiate with Style</strong>, is a course the will provide you with the knowledge, tools, and techniques to be  a more successful persuader and negotiator at work and beyond.  Based upon time-proven approaches to persuasion (think Aristotle), we also explore the inner workings of the brain and how to mitigate stress and stress-related actions that inhibit most successful negotiations.  Not only that, we introduce you to more progressive and inclusive forms of persuasion and negotiation that will enable you to:</p><ol style=\"\"><li>Be heard when otherwise you might be disregarded</li><li>Turn what are often roadblocks in persuasion and negotiation into conversation points</li><li>Keep the conversation moving forward with a positive tone</li></ol><p style=\"\">A video-based course, each video introduces a Negotiation or Persuasion technique, and then goes into great detail into how you can practice that technique immediately.  Clocking in just under 60 minutes, this course is well suited for anyone who wishes to really improve not only their persuasion and negotiation prowess, but also to generally improve their overall communication practice! </p><p style=\"\">You should take this course if you are interested in using positive pro-active  approaches to persuasion and negotiation.<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Persuasion with Class, Negotiation with Style", 
    "price": "50.00", 
    "instructors": "Brian Shapiro", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444136_dd52_4.jpg", 
    "course_url": "https://www.udemy.com/persuade-with-class-negotiate-with-style/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T20:19:57Z"
}