{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Description</strong></p>  <p><strong> </strong></p>  <p>Hello there, wherever you are, dear Udemy student!</p>  <p>Here is a bold statement from the instructor of this Premium course, from the very beginning about what this course is and what is not: <strong>this course enables you to create a professional identity that will help you earn more money on your current professional expertise.</strong>  It is not about strengthening your positioning among your close circle or friends and fans, but about carving a voice and a distinct reputation in your professional field. Whatever it is. </p>    <p>This course is brutally honest around several highly debated topics and with an obsessive care for well-defined steps, clear tips and actionable to do lists. At the end of this course you will be able to<strong> build your personal brand entirely from scratch, manage it consistently and start to cash in under its umbrella.</strong> I’ll make sure that you’ll successfully reach this point!</p>    <p>How can you do that? First of all, you become aware of your assets, as this course helps you understand how to transform your perceived minuses into pluses. Immediately after, you learn to ask yourself the right questions and get the appropriate answers, you become able to make a strategic choice, define it down to its essence in few possible words, wrap it in a nutshell of personal rhetoric and then go out to promote it efficiently, towards whom it matters. So let’s make sure that you own the proper tools and everything becomes clear!</p>    <p>I need you to know this, right now, before you unwrap this Premium Course I have designed just for you.</p>  <p>I am an introvert myself and I’ve been working in Advertising and Branding for 16 years already. I have a degree in Philosophy and an MA in Communication.</p>  <p>I’ve founded a Reputation Management company called … Innerout (does it ring a bell?), providing Branding Consultancy for startups and Lifestyle Entrepreneurship. I like to read and write, but that does not hinder me from delivering public speaking on a few areas of expertise. See? It’s possible! </p>    <p>Now, here I am! Ready to share with you here my expertise in full transparency as <strong>the world belongs to those who know how to make the most of who they are, in full authenticity, while having fun.</strong></p>  <p><strong> </strong></p>  <p><strong>Get ready to make the most out of who you really are. See you in the course!</strong></p>  <p><strong></strong></p><p>Your Reputation Expert, </p><p>Michaela Radulescu</p>", 
    "end_date": null, 
    "title": "Personal Branding for Introverts, Shy and Camera Shy", 
    "price": "25.00", 
    "instructors": "Mrs. Mihaela Radulescu", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/799538_4bf7_2.jpg", 
    "course_url": "https://www.udemy.com/personal-branding-for-introverts-shy-and-camera-shy/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T09:05:57Z"
}