{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t Cuando tienes una idea o un proyecto y se la expones a alguien, estás haciendo un Pitching: le estás “lanzando” tu idea. En esta exposición te lo estás jugando todo a una carta, así que cuantos más aspectos tengas controlados, más probabilidades de éxito tendrás para sacar tu idea o proyecto adelante.  </p>  <p>  \t Hoy en día tenemos que hacer Pitchings continuamente, cada vez que queremos convencer a alguien de las bondades de nuestro proyecto, o incluso cuando “nosotros mismos” somos el producto y debemos vendernos, como durante una entrevista de trabajo por ejemplo. De ahí que sea imprescindible conocer qué técnicas existen para conseguir vencer la resistencia de nuestro interlocutor y generarle interés hacia nosotros y nuestra propuesta.  </p>  <p>  \t En este curso de Pitching, el primero de los tresdedicados a esta materia, aprenderás entre otras cosas varias técnicas para conseguir una reunión con un inversor, y sabrás de qué manera debes generar un vínculo con él para ganarte su confianza. Así mismo aprenderás varias técnicas que te permitirán manejar los nervios ante la presentación oral y mejorar tu autoestima, muy importante para generar la confianza suficiente como para poder iniciar una relación profesional con el interlocutor.  </p>  <p>  \t Aprenderás también varias técnicas para conseguir contactos profesionales, a través de un networking eficaz y realista. Este curso finalizará con repasando los preparativos que conviene hacer los días anteriores al Pitching, para que todo vaya como la seda durante el momento de la verdad.  </p>  <p>  \t En los otros dos cursos que forman tratan sobre esta materia, se estudiará el comportamiento que se debe tener durante el Pitching, y se analizarán los pormenores y particularidades de los Pitching que se centren en proyectos audiovisuales, ya sea cortometrajes, largometrajes, series o webseries, tanto si se trata de “Pitchings del ascensor” como exposiciones con un amplio auditorio durante un Talent Campus.  </p>", 
    "end_date": null, 
    "title": "Pitching Eficaz (I) - Aprende a exponer tus ideas oralmente", 
    "price": "20.00", 
    "instructors": "Jorge E. Blein", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234346_9195_2.jpg", 
    "course_url": "https://www.udemy.com/pitching-eficaz-i-aprende-a-exponer-tus-ideas-oralmente/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-30T23:18:30Z"
}