{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Course Description</strong></p><p>Learning how to use PowerPoint <em>effectively </em>is a lot different than just knowing how to build slides and memorizing some keyboard shortcuts. Most presentations are bloated, boring and loathed by those forced to watch them. This course was designed to teach you a better way. How you can harness the power of a few basic principles of presenting information that will persuade your audience and inspire them to action.</p><p><strong class=\"redactor-inline-converted\">Connect with Your Audience by Using the Magic Formula</strong></p><ul><li>Learn how to properly structure the information you want the audience to know.</li><li>Build great slides without having to know anything about art or design.</li><li>Carry your audience from beginning to end to reach an inescapable conclusion.</li></ul><p><strong class=\"redactor-inline-converted\">Mastering PowerPoint for Maximum Results</strong></p><p>It doesn't matter if you are giving a sales presentation, conducting a corporate training seminar or teaching a continuing education class - the goal of every presentation is to persuade. Closing more sales or becoming a more effective educator isn't about animated slide transitions or other tips out of the technical manual - it's about the information you present and the way it's showcased. </p><p>Think of PowerPoint like a chainsaw. When used correctly it can make your job a lot easier and more fun. Used incorrectly, it can cause a lot of damage. A big part of mastering PowerPoint is remembering this - it's only a tool. You and your information are the presentation, PowerPoint is just a tool that you can use to make it better. </p><p>Skilled communicators are always in high demand. When people see a great presentation, they don't just remember the content, they also remember the presenter. By persuading the audience to your point of view, you are by default seen as intelligent, confident and authoritative. Strong presentation skills can be a tremendous career booster.</p><p><strong class=\"redactor-inline-converted\">Contents and Overview</strong></p><p>This course contains about an hour of video content broken up into fourteen lectures. The three main sections, or course modules, each contain four videos: an introductory lecture that describes some basic principles, followed by three explanatory examples taken from actual presentations. These real world examples help highlight the principles in context and the example videos give you an opportunity to test yourself and compare notes with me as we progress through the course.</p><p>At the end of the course you will be presented with an action plan that will help you retain all of the concepts you've seen. Everything is laid out, you just have to follow the plan as presented.</p><p><strong class=\"redactor-inline-converted\">Course Requirements</strong></p><ul><li>Internet connection.</li><li>Pad of paper and a pencil.</li></ul><p><strong class=\"redactor-inline-converted\">What Am I Going to Get from This Course?</strong></p><ul><li>One highly focused and effective hour of video content.</li><li>A set of valuable skills that can immediately be put to use.</li><li>An action plan that will allow you to retain these skills forever.</li><li>A way to noticeably differentiate yourself from your colleagues and competitors.</li></ul><p><strong>Who is the Target Audience?</strong></p><ul><li>Anyone who makes presentations during the course of their career.</li><li>Salespeople</li><li>Financial Advisors</li><li>Trainers</li><li>Educators</li><li>Managers<br></li></ul>", 
    "end_date": null, 
    "title": "PowerPoint In Action: How to be Persuasive", 
    "price": 0, 
    "instructors": "Patrick Crook", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801182_e87b_4.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-in-action-how-to-build-a-persuasive-presentation/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T19:42:38Z"
}