{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    If you have to sell anything as part of your job -- a product, a project, an idea, a service, and we all do in some way-- <strong style=\"\">you know how the right presentation can make a project or an idea go forward and the wrong one can kill it</strong>. These are crucial presentations. And despite what&#039;s at stake -a promotion, raising money, getting new business, peer recognition- most times we do it incredibly badly by crafting lengthy, boring PowerPoints.  </p>  <p style=\"\">  \t<strong style=\"\">The success of presentations depends on the process you use to develop them</strong>, on figuring out how to keep your audience&#039;s attention and not on how hard you try. The better you are at engaging your audience the more successful you will be.  </p>  <p style=\"\">  \t    If you are an expert in your field but you are not necessarily an expert at PowerPoint and <strong style=\"\">just need a method and tips to put together a compelling presentation</strong> that you will feel proud of presenting and your audience will absolutely love then this course is right for you. <strong style=\"\">I can help you get better starting with your very next presentation</strong>.  </p>  <p style=\"\">  \t              This course is organized in three main sections and you can jump to either of these depending on your needs:  </p>  <ol style=\"\">  \t<li style=\"\">How to create a powerful, compelling story</li>  \t<li style=\"\">How to create engaging slides that support the story</li>  \t<li style=\"\">How to deliver your presentation with confidence</li>  </ol>  <p style=\"\">  \t<strong style=\"\">You also get the following Bonuses</strong>:  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">Free subscription </strong>to &quot;Presentation Blueprint Weekly Video Series&quot;: It includes one video per week for a year. That&#039;s <strong style=\"\">52 additional videos</strong> delivered right to your inbox with detailed &quot;how-to&quot; tips and tricks.</li>  \t<li style=\"\">Video on<strong style=\"\"> How To Present to Executives</strong>: Covers five common challenges when presenting to executives such as having less time to present, how to deal with executives multi-tasking, what if the decision maker leaves the room, how to bring them back when they are having multiple conversations and how to react when they start solving a different topic.</li>  </ol>  <p style=\"\">  \t                             I know you are probably thinking of this:  </p>  <p style=\"\">  \t<strong style=\"\">1) Isn&#039;t this stuff available for free on the internet?</strong>  </p>  <p style=\"\">  \t                             Answer: Actually... no. While there are hundreds, I mean thousands of videos out there of people giving you PowerPoint tips there&#039;s no one that packages the information in a structured way that is focused on slide design. So stop wasting time browsing the internet. Here you will find all the insider tips to successful presentations.  </p>  <p style=\"\">  \t<strong style=\"\">2) I already know PowerPoint so I don&#039;t need this</strong>  </p>  <p style=\"\">  \t                             Answer: This is not a basic PowerPoint training. In fact, I assume you know your way around it and instead my focus is on taking your skills to the next level by teaching you about design principles and how to apply them to your slides.  </p>  <p style=\"\">  \t<strong style=\"\">3) This is too risky of an investment. Not sure if this is right for me</strong>  </p>  <p style=\"\">  \t                             Answer: Crucial presentations need to be flawless and this course gives you specific tips to do that. I invite you to watch the free videos in this page so you get an idea of my teaching style. Also know that if you are not satisfied with the course you can cancel within 30 days and Udemy will refund your money, no questions asked<strong style=\"\">. </strong>In other words, you have nothing to risk here!  </p>  <p style=\"\">  \t                                         All eyes are on you when addressing a group. <strong style=\"\">Presentations are part of your personal brand. What you present and how you present has an influence on how you are perceived by others</strong>. Enroll now to get started right away!  </p>", 
    "end_date": null, 
    "title": "PowerPoint Slide Design for Crucial Presentations", 
    "price": "40.00", 
    "instructors": "Guillermo Gonzalez", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/60318_b078_16.jpg", 
    "course_url": "https://www.udemy.com/presentationblueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-16T04:31:07Z"
}