{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ça se passe un vendredi matin, au retour de la pause-café. Vous croisez votre chef. Et votre chef vous dit : « Oublie pas la réunion lundi après-midi. <strong style=\"\">Tu me fais un PowerPoint ?</strong> ».</p><p>Aïe… On vous demande un PowerPoint : <strong style=\"\">vous vous jetez sur PowerPoint sans vous poser de question</strong>. Vous passez un week-end pourri et vous produisez de la diapo. Après tout, tout le monde fait comme ça !Ou bien vous êtes chef d&#039;entreprise, consultant, commercial ou formateur et le diaporama est un outil que vous utilisez quotidiennement pour convaincre votre public.</p><p>Dans tous les cas, <strong style=\"\">vous vous retrouvez avez 84 diapos avec des listes à puces, des tableaux un peu chargés, votre logo sur toutes les pages et quelques illustrations</strong>. Vous êtes plutôt fatigué et vous n&#039;avez jamais le temps de répéter. Du coup <strong style=\"\">vous livrez une prestation qui ne vous satisfait qu&#039;à moitié</strong> : vous dites tout (bon d&#039;accord, en général vous accélérez sur la fin) mais vous sentez que nombreux sont celles et ceux qui décrochent, qui pensent à autre chose et vous n&#039;êtes pas certain que ceux qui restent attentifs captent bien votre message.</p><p>Vous vivez également ce malaise quand ce sont d&#039;autres qui présentent devant vous ! Ils font le même style de diapos et du coup <strong style=\"\">vous les lisez en oubliant peu à peu l&#039;orateur</strong>. Votre esprit vagabonde et vous vous ennuyez. En général vous repartez de la réunion avec le sentiment frustrant d&#039;avoir <strong style=\"\">perdu du temps</strong>.Le plus étonnant, c&#039;est que tout le monde constate la même chose mais personne ne se demande s&#039;il est possible de faire autrement. C&#039;est le statu quo : <strong style=\"\">tout le monde s&#039;ennuie en réunion ou en séminaire</strong>.</p><p>Pourtant <strong style=\"\">vous cherchez à vous améliorer</strong> : vous essayez de mettre une animation de temps en temps pour donner du mouvement à tout ça, vous placez une image, un clipart pour illustrer un titre… mais rien n&#039;y fait, votre PowerPoint n&#039;a pas une allure professionnelle.Vous fouillez un peu sur le net et vous trouvez des règles que vous appliquez : 7 lignes par diapo, 7 mots par ligne… Malheureusement, cela ne change rien : <strong style=\"\">votre diaporama reste à la fois un prompteur, un document et un déversoir à données</strong>.</p><p>Dans mon ancien métier d&#039;ingénieur en informatique, j&#039;ai fait des dizaines et des dizaines de PowerPoints de ce style-là parce que tout le monde faisait comme ça. Comme vous, j&#039;ai senti qu&#039;il y avait un problème. <strong style=\"\">Et comme vous je ne savais pas comment faire pour que les choses changent, alors je continuais à être ennuyeux et à m&#039;ennuyer</strong>.</p><p>Et puis il y a cinq ans, je me suis lancé dans la formation à la communication orale. <strong style=\"\">J&#039;ai eu alors le temps de me pencher sur la manière de faire un PowerPoint efficace et impactant qui soit un véritable soutien au discours</strong>. La lecture des spécialistes du sujet, mon intérêt scientifique pour le fonctionnement du cerveau face à un PowerPoint, et l&#039;observation de centaines d&#039;orateurs et de participants à mes formations m&#039;ont permis d&#039;affiner ma méthode. <strong style=\"\">Elle est aujourd&#039;hui parfaitement rôdée et a fait ses preuves face à plusieurs centaines de stagiaires</strong>. C&#039;est la seule qui aborde de manière complète tous les aspects de la création d&#039;un PowerPoint impactant. Elle vous fera faire <strong style=\"\">un bond en crédibilité</strong>, vous permettra de <strong style=\"\">ne plus perdre du temps</strong> à aligner des diapos ultra-chargées les unes derrière les autres et <strong style=\"\">vous assurera de convaincre votre auditoire</strong>.</p><p>Je vous livre tout ça <strong style=\"\">en vidéo</strong>, avec <strong style=\"\">des exemples concrets</strong> et <strong style=\"\">des techniques facilement applicables</strong>.Vous y verrez par exemple :</p><ul style=\"\"><li><strong style=\"\">les mauvaises et les bonnes raisons de faire un PowerPoint</strong></li><li>comment <strong style=\"\">contrer la tentation du remplissage</strong> de diapositives</li><li>comment les neurosciences ont prouvé <strong style=\"\">la supériorité de l&#039;image pour se souvenir de concepts</strong> et les conséquences sur vos PowerPoints</li><li>comment <strong style=\"\">mettre en valeur des informations</strong> de manière sobre et moderne</li><li>comment <strong style=\"\">présenter des données</strong> de manière efficace et impactante</li><li>comment <strong style=\"\">utiliser intelligemment les animations</strong></li><li><strong style=\"\">la seule règle à retenir</strong> vraiment quand on crée un PowerPoint !</li></ul>", 
    "end_date": null, 
    "title": "PowerPoint efficace : soyez visuel pour être impactant", 
    "price": "20.00", 
    "instructors": "Pascal Haumont", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498982_84ae_2.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-efficace-soyez-visuel-pour-etre-impactant/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T14:18:41Z"
}