{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     Your success and the success of the organizations that you serve depend largely on one critical skill: Public speaking.  In any profession from architecture to teaching, business, law, accountancy and community leadership, your results are a direct consequence of how well you are able to persuade and convince the people who cross your path.  </p>  <p style=\"\">  \t     In a recent survey of more than 300 business leaders, what do you think was ranked number 1 among desired skills of new employees?: <strong style=\"\">Effective communication and public speaking.</strong>  The American Management Association requested thousands of executives to rank the skills most essential in today’s workplace. <strong style=\"\">Communication skills</strong> were ranked as most critical.  </p>  <p style=\"\">  \t     Right now, we find ourselves in a highly competitive job market and professionals are increasingly using public speaking as a way to stand out from the crowd. Companies are becoming more and more concerned that employees are losing the ability to talk in a professional way due to the prevalence of Facebook and Twitter and their affects on our communication habits.  A millennial workspace expert, Lindsey Pollak states, “It’s so rare to find somebody who has that combination of really good technical skills and really good verbal communication skills. You will be head and shoulders above your colleagues if you can combine those two.”  </p>  <p style=\"\">  \t     Broadly, public speaking skills build our confidence, give us a voice and equip us with the tools necessary to have an impact on issues that really matter.  It is the dream of some of us to change the world in some small way. Public speaking gives you the reflex to stand up and make a difference.  </p>  <p style=\"\">  \t  This course is made of 11 high-quality and engaging videos designed for you to improve on the essential skills of public-speaking. This course is meant to be a companion for you to refer back to frequently as you apply what you learn in your real-life presentations.  </p>", 
    "end_date": null, 
    "title": "Powerful Public Speaking", 
    "price": "25.00", 
    "instructors": "Aaron Perkins", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/111660_c377_9.jpg", 
    "course_url": "https://www.udemy.com/powerful-public-speaking/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-28T10:37:16Z"
}