{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Powerpoint Surgery: learn how to make world class slides! </strong>by<strong class=\"redactor-inline-converted\"> Lee Jackson</strong> (aka the 'PowerPoint Surgery' Online Masterclass) is a series of over 35 short (and often funny) videos (plus loads and loads of extras) from Lee Jackson one of the world's experts on creating presentation slides that help, not hinder, your talks. Lee takes the research and content of his Amazon best-selling book <strong>'Powerpoint Surgery' </strong>(hence the surgeons outfit!) and has turned it into an online masterclass for anyone who wants to make their slides more effective and their talks more engaging. <br><br><strong>Any presentation software is relevant here, not just Powerpoint! </strong><br><br>If you or your workplace is addicted to bullet points and talks sometime lack impact or engagement then this course is for you and your colleagues. Simple, effective advice on simplifying your slides to help you look more like an accomplished professional TED speaker not a grey business person delivering a financial proposal of 567 bullet points to an audience wanting it to end!<br><br>There are lots of great videos with some screen shares too showing you how to make your Microsoft Powerpoint, Apple Keynote ,Prezi, or Haiku Deck slides more impactful to create a much better presentation. <br><br><strong class=\"redactor-inline-converted\">PLUS the free extras include 100 free photos, over three hours of audio, articles, links and downloads including the whole course on MP3! </strong></p>\n\n<p>Lee is full-time professional speaker with over 20 years experience speaking to some of the worlds toughest audiences, he has also delivered a TEDx talk. So, learn from a Pro not a trainer who's read a manual - Lee's <strong class=\"redactor-inline-converted\">experience</strong> and <strong class=\"redactor-inline-converted\">expertise</strong> here makes <strong class=\"redactor-inline-converted\">all</strong> the difference. Practical, down-to-earth and sometimes even funny is the style of this course. <strong class=\"redactor-inline-converted\"><br><br>'Death-by-powerpoint' would become a thing of the past if every presenter took this course. Guaranteed. </strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Enjoy, learn and succeed. </strong></p>\n\n\n\n\n\n<p>Extras include over three hours of audio, articles, links and downloads including the whole course on MP3! </p><p><strong>Don't forget - any presentation software is relevant here, not just Powerpoint! </strong><br><br></p>", 
    "end_date": null, 
    "title": "Powerpoint Surgery: learn how to make world class slides!", 
    "price": "50.00", 
    "instructors": "Lee Jackson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176544_7b9d_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-great-presentation-slides-for-engaging-talks/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T09:22:24Z"
}