{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">A 100,000$ presentation</strong>  </p>  <p>  \t7 years ago I was not a presentation expert, I just wanted to have my startup funded and to realize my dream. So I studied every resource on the subject and, more importantly, I presented my story everywhere, each time I had an opportunity. In may 2008 we were invited as finalists at TechGarage, the most important italian startup pitch competition. That day we were looking for 100,000$ seed capital.  At the end of our pitch 10 people in the audience raised their hands to be the first to fund us with 10,000$ each.  We also won the first prize in every category.  </p>  <p>  \tThis story was on the first page of the most important italian economical newspaper. From that day a lot of people began asking us to teach them the secrets of killer presentations. This is how the PowerPitch method was born.  </p>  <p>  \t<strong style=\"\">How boring can a presentation possibly be?</strong>  </p>  <p>  \tI’m sure you know the answer: there is no limit.  </p>  <p>  \tOn the contrary, how much effective can it be?  </p>  <p>  \t<strong style=\"\">A</strong> <strong style=\"\">presentation can change your life</strong>. For sure it changed mine. When I first started talking about the idea for my new startup I was sooooo excited each time I told it to my friends and colleagues! I soon realized that apart from my excitement, I was not able to convey everything I was seeing beside the idea. A clear vision of my project was missing.  </p>  <p>  \tWhen I say &quot;presentation&quot; often the first thing that comes to mind are slides, templates, fonts and animations. Nahhh...  </p>  <p>  \tWhether it’s about:  </p>  <ul style=\"\">  \t<li>Doing a pitch for a startup</li>  \t<li>Convincing a big client</li>  \t<li>Getting more sales</li>  \t<li>Getting a promotion</li>  \t<li>Getting any audience to do what you want</li>  </ul>  <p>  \t<strong style=\"\">Presenting means selling</strong>  </p>  <p>  \tBut even before selling, presenting means <strong style=\"\">having a clear vision</strong> and being able to <strong style=\"\">convey this vision to your audience</strong>. Although there is nobody that can have the vision in your place, this course starts challenging and helping you to <strong style=\"\">refine the edges of your vision</strong> and then leads you step by step toward conveying it, with all of its power, to the people that can help you transform it into reality.  </p>  <p>  \tWhen you are presenting <em style=\"\">effectively</em> you are creating a sort of direct communication tunnel into your audience&#039;s mind.  Once this tunnel is open you have the trust and engagement of your listeners on your side and they are ready to do anything in their power to help you achieve your goal.  </p>  <p>  \tIt’s a kind of art, but it’s not something you are born with: there are some easy, actionable techniques you can learn.  </p>  <p>  \t<strong style=\"\">Why this course is different</strong>  </p>  <ul style=\"\">  \t<li>Sometimes online courses can be boring. We designed our course instead to be factual, relevant and presented in a way that is fun and easy to watch (You pay us not for LONG videos, but for editing out all the boring stuff). Have a look at the sample lectures!</li>  </ul>  <ul style=\"\">  \t<li>Our video lectures are 100% super-high-quality and specifically designed for this online course. There is no recycled content from past live events.</li>  \t<li>There’s a whole practical section where you can literally look right over our shoulder and see us put our method into practice creating a presentation from start to finish.</li>  \t<li>Tactics, ideas and methods that are immediately implementable for ANY KIND of presentation, at any level or for any size group</li>  \t<li>With this course, you will receive 24-hour access to us, where you can personally message us and get a direct answer to all of your questions! We are here to serve you!</li>  </ul>  <p>  \t...And there&#039;s a 30 day absolutely no questions asked <strong style=\"\">100% Money-Back Guarantee</strong> - our personal promise of your happiness and satisfaction! You really cannot lose!  </p>  <p>  \tEvery presentation that you still do the old ineffectual way is a wasted chance to reach your goals...  </p>  <p>  \tEnroll now!  </p>", 
    "end_date": null, 
    "title": "Power Pitch: use presentations to sell your ideas to anyone", 
    "price": "40.00", 
    "instructors": "Livello 7", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336400_8037.jpg", 
    "course_url": "https://www.udemy.com/power-pitch-use-presentations-to-sell-your-ideas-to-anyone/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T09:46:53Z"
}