{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p></p><p><p>WELCOME</p>\r\n\r\n<p>A presentation can\r\neducate, engage, inspire and persuade people like nothing else. &nbsp;It can be\r\na catalyst for change, drive business or build community.</p>\r\n\r\n<p>This is the way it<em>should</em>be.&nbsp; But unfortunately, that’s\r\nusually not the case – and far too many presentations lose their focus – or\r\nworse – are boring. &nbsp;If you need to deliver a presentation, or just want\r\nto improve your presentation skills to bring them to a new level of\r\nprofessionalism, this is YOUR course!</p>\r\n<p>WHY SHOULD YOU TAKE\r\nTHE COURSE?</p>\r\n\r\n<p>Being able to give a\r\ngreat presentation is one of the most underrated skills out there. &nbsp;It’s a\r\nskill that you need to learn and master to put you in the top 10%. &nbsp;Great\r\npresenters earn a higher income. &nbsp;That’s a fact. &nbsp;Learning to give a\r\npowerful presentation will help you advance your career and, will help you\r\nbecome a better communicator in every facet of your life.</p>\r\n\r\n<p>This course is not\r\ndifficult.&nbsp; It is educational, fun and even entertaining.</p>\r\n<p>HOW IS THIS COURSE\r\nDIFFERENT?</p>\r\n\r\n<p>This Presentation\r\nSkills Training course is unlike any other. &nbsp;Within the course itself, you\r\nwill have the opportunity to actually craft and deliver your own presentation.\r\n&nbsp;It will be uploaded and graded – and certificates will be awarded. &nbsp;</p>\r\n\r\n<p>Using a proven\r\nlearn-by-doing methodology, this course will teach you how to create a powerful\r\npresentation for<em>any</em>topic. &nbsp;The course is designed so\r\nthat each lecture and section builds off the next - in a step-by-step\r\nformat.&nbsp;</p>\r\n\r\n<p>Each section is\r\nbroken down into a series of short video lectures that outline key concepts and\r\nclearly sets out each objective. &nbsp;Many videos have a corresponding\r\nactivity where you will apply the knowledge you’ve learned in that video.\r\n&nbsp;</p>\r\n\r\n<p>By the end of the\r\ncourse, if you watched all videos, taken all the quizzes and completed all the\r\nactivities, you&#039;ll will have crafted and delivered a powerful and\r\nEffective Presentation Skills that is eligible for the course\r\nachievement certificate.</p>\r\n<p>WHO CAN TAKE THIS\r\nCOURSE?</p>\r\n\r\n<p>This course is\r\ndesigned to suit any audience – for business – for students and for\r\neducators.&nbsp;</p>\r\n\r\n<p>Let&#039;s get started!</p>&lt;/p&gt;<p></p>\r\n", 
    "end_date": null, 
    "title": "Powerful Presentations", 
    "price": "50.00", 
    "instructors": "Craig Gauthier", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43714_f04b_5.jpg", 
    "course_url": "https://www.udemy.com/powerful-presentations/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-26T18:40:29Z"
}