{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>COURSE IS UP TO DATE AS OF 25 September 2015</strong></p><p><strong>OVER 1,504 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE in less then 2 Days !</strong></p><p>You can have your own online business up and running today, right after going through this course - and be earning immediately!<br style=\"\"></p><p>Click the \"take this course\" button, top right, now ... every hour you delay is costing you money.</p><p><strong>Start Email Marketing To Grow Your Business </strong>and<strong> Generate MORE SALES </strong>from your customers and prospects and <em style=\"\">build profitable relationships immediately -<strong> just like my current 1504+ Students!</strong></em></p><p><strong><em style=\"\">UPDATE : 25</em> SEPTEMBER 2015 TACTICS! BRAND NEW &amp; 100% UP TO DATE CONTENT!</strong></p><p>You will not believe how easy it is to do email marketing when you use the effective email lead generation information in this course to discover strategies for reaching out to potential clients. In this course, you will learn how to write email effectively and efficiently and how to generate more sale and leads.</p><p>Regardless of whether you are already in email marketing or just thinking of getting to know the channel of email communication with the customer. <strong>To run faster, easier, cheaper AND EFFECTIVELY</strong>. You need proven knowledge.</p><p>If you answered \"yes\" to at least one of these questions then this course is for you!</p><p>Email marketing can accomplish a broad spectrum of marketing objectives from branding to lead generation. In this course we will cover the basics as well as functional components of email messages.</p><p>Sign up and <strong>experience the email marketing lead generation strategies course on the web.</strong></p><p>We've created a remarkably simple, easy-to-follow blueprint online email marketing lead generation nurturing course that reveals strategies and how anyone can quickly start using Email Marketing success strategies to massively improve their bottom line profits!</p><p>We've designed the course from the ground up so it's easy to implement everything you're learning as you go.</p><p>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk! </p><p><strong><em style=\"\">Enroll now</em></strong> and <strong>start improving your email marketing and sales results TODAY</strong> and take your business to the next level!</p>", 
    "end_date": null, 
    "title": "Powerful Email Marketing Strategies In One Short Hour!", 
    "price": "20.00", 
    "instructors": "Sachin Kumar", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551820_71b5.jpg", 
    "course_url": "https://www.udemy.com/powerful-email-marketing-lead-generation-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T14:46:22Z"
}