{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Imagine yourself working in perfect coordination with a PR firm that gets you the right amount of interviews in exactly the right media outlets you care about.</p><p>How to Hire a PR Firm</p><p>This \"How to Hire a PR Firm\" course will walk you through, step-by-step, everything you need to do to find and hire the best public relations firm for you or your organization. There are thousands of PR firms in the world. This course will help you narrow down the right ones for you to approach, and then interview and then, ultimately, select one. Nothing is worse than attempting a new PR campaign with the wrong PR firm or no PR firm. That is why it is essential to go about your selection process in a rational way.</p><p>About the trainer</p><p>TJ Walker does not own or work for a PR firm. Therefore the advice in this course is not a thinly disguised plug for any one PR firm. In his role as a media trainer and senior media strategist, Walker is frequently asked by major corporations, governments and NGOs around the world to help in the process of PR firm selection.</p><p>Sign up today for this course today. </p><p>Course updated on July 28, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee. </p><p>TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe. </p>", 
    "end_date": null, 
    "title": "PR Firm: You Can Hire the Best PR Firm for Your Organization", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342332_4af4_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-hire-a-pr-firm/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T12:31:59Z"
}