{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\nThis program dives deeply into the strategies,\ntechniques and tools you need to be an effective presenter.  It’s ultimately not about you: it’s about\nthem—the people in your audience. Ruling the room means keeping them engaged\nand amused—laughing, if possible—and feeling that what you are presenting is\nspecifically for them. It also means showing them you’re an expert presenter in\nkeeping to your timetable, responding well to every question, defusing any\ndistractions, and ending on such a high note that they applaud you.\n\n</p><p>        Captain will teach you how to take charge of your presentation and control your audience.  You will learn how to manage a presentation capable of actually changing people’s behavior. <span></span></p><p>Captain is one of the most powerful, complete, practical, and easy to learn presentation management programs anywhere.  You’ll learn everything you need to be able to become one of the world’s best presenters, and you won’t leave until you have created and shown you know exactly how to do each of the following: </p><ul><li>Engage your listeners so their minds never wander</li><li>Entertain and amuse your audience in a style that’s true to you</li><li>Make all listeners feel your message is meant just for them</li><li>Deliver a presentation that ends on time, every time</li><li>Elicit questions and provide answers even when you have none</li><li>Remain in charge no matter what’s happening</li><li>Move your audience to respond with enthusiasm</li></ul>", 
    "end_date": null, 
    "title": "Presentation Bootcamp: Hands-On Audience Engagement Skills", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737350_463f_2.jpg", 
    "course_url": "https://www.udemy.com/captain-c/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T23:32:03Z"
}