{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This program dives deeply into the strategies, techniques and tools you need to create an effective presentation. You&#039;ll learn how to attract your audience to the presentation with content they won&#039;t be able to resist, and keep them there by subtly revealing to them the underlying emotional reasons they should want it. This program will help you create core content that is exactly what your audience wants to hear, put it into a form that makes it easy for you to deliver, and present it in an attractive visual show.</p>    <p style=\"\">Presentations and public speaking are at the core of what we do. For that reason, this program has become the go-to curriculum for companies and institutions nationwide. This program offers specific tools and practical guidance, not theoretical fluff. Among the unique concepts in this program are: </p> <ul style=\"\"> <li style=\"\"> The circle of knowledge, an exercise that will guarantee you&#039;re telling your students exactly what they want to know. </li> <li style=\"\"> Agree and see if you&#039;re right, a never-fail technique to repeatedly engage and re-engage your students. </li> <li style=\"\"> The blueprint, a tool to make sure you&#039;ll deliver a flawless training without relying on the script. </li> <li style=\"\"> Presentation personality style assessment, an analysis to help you know exactly how to capture your students by being yourself. </li> <li style=\"\"> Learning style analysis, insights that you can use to get your message across to every type of learner in the room. Create is one of the most powerful, complete, practical, and easy to learn presentation content creation programs anywhere. You&#039;ll learn everything you need to be able to create one of the world&#039;s best presentations, and you won&#039;t leave until you&#039;ve created and shown you know how to do each of the following: </li> </ul> <ol style=\"\"> <li style=\"\"> Be certain you audience will crave everything you have to say </li> <li style=\"\"> Make it easy for you to deliver and for your audience to follow </li> <li style=\"\"> Coordinate what you say and what your audience sees </li> <li style=\"\"> Make your visuals clearer and more memorable </li> </ol>  <ul style=\"\"> </ul>", 
    "end_date": null, 
    "title": "Presentation Bootcamp: Hands-On Content Creation Skills", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568654_4f96_3.jpg", 
    "course_url": "https://www.udemy.com/createcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T21:57:27Z"
}