{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Imagine that you and your entire team are giving a great presentation. Individually and collectively, you are giving a fantastic team presentation. Everyone is interesting and memorable. Nobody is awkward or boring.</p><p style=\"\">  \t  How to Give Team Presentation  </p>  <p style=\"\">  \t  In this &quot;How to Give Team Presentations&quot; course, you will learn how to develop messages, make team assignments, and practice your presentations, as a team. Most team presentations are dreadful and boring because executives tell themselves &quot;I&#039;m now giving a team presentation, so of course, we all have to read boring bullet point messages off of a PowerPoint slide because that is how serious business people do things.&quot; This is a fallacy. TJ Walker is an expert presentation coach who has prepped and rehearsed executives from major corporations and institutions around the world on how to make better team presentations.  </p>  <p style=\"\">  \t  Every team presentation has the chance of making a great impression, no impression or a bad impression. Isn&#039;t it time you figured out how to make the most of every group presentation opportunity that you and your colleagues face?  </p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on July 29, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Presentation Skills: Give a Great Team Presentation", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348432_734a_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-give-a-team-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T21:13:00Z"
}