{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Why should you take this course?</strong>  </p>  <p>  \t  A good presentation can inspire, influence, persuade and motivate an audience. World renowned speaking expert Jason Teteak shows you how to make these things second nature and our participants see such a dramatic change in their level of performance that they wonder how it was even possible.  For that reason this is one of our most sought after presentation training programs for business leaders.  </p>  <p>  \t              This five hour presentation bootcamp dives deeply into the delivery of successful presentations.  You’ll learn how to influence, persuade, and motivate your audience to take the action you intend through hands-on practice and personalized training.  If you’re looking for our flagship presentation skills training program - the one that has it all - you’ve found what you’re looking for.  This program is no joke, and consequently it may not be the place to start if you aren’t ready to get your hands dirty, jump into live real world application and really get down to business.  </p>  <p>  \t<strong style=\"\">Bonus! </strong>You will get a 75+ page workbook for you to follow along with every word.  You&#039;ll also get a set of quizzes at the end of each major section of this program with &quot;Your Turns&quot; giving you specific exercises and tasks to practice on your own.  Finally, you&#039;ll get activities and suggestions and an opportunity to stop the video and practice the techniques in this program right on the spot, &quot;presentation bootcamp&quot; style.&quot;  </p>  <p>  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p>  \t  &quot;I figured Jason Teteak might have a few new tricks—but not much that I hadn’t heard before. I was wrong. Jason integrates the latest research on presenting, learning, and audience dynamics with a captivating style that plays with the ironic fact that he is doing presentations… about presentation skills. And therein lies the secret to this marvelous program.&quot;  </p>  <p>  \t<strong style=\"\">- Philip Deloria</strong> - Professor and Associate Dean, University of Michigan  </p>  <p>  \t  &quot;It&#039;s pretty simple. Jason Teteak walks the talk. In this day and age, finding a true thought leader amongst many is the key to getting to new levels. Listening to Jason and benefitting from his teachings will take you to that new level you seek. He is cutting edge, extremely practical and connects in a way that is motivating, informing and memorable. Some of the biggest benefits received from Jason are tactics, ideas and methods that are immediately implementable. Watch Jason’s program before your competition does.&quot;  </p>  <p>  \t<strong style=\"\">- Al Lautenslager</strong> - Best-selling Author, Guerrilla Marketing in 30 Days  </p>  <p>  \t  “I have been to several seminars on public speaking and giving presentations, including Dale Carnegie training. I truly went into this thinking that I couldn&#039;t possibly learn anything new, but I found myself scribbling notes like a mad woman during the presentation. I quickly realized that these were tips and techniques that I had never heard before, and that I could use immediately upon my return to the office.”  </p>  <p>  \t<strong style=\"\">- Joey Monson-Lillie</strong> - Human Resources Manager  </p>", 
    "end_date": null, 
    "title": "Presentation Bootcamp: Hands-On Presentation Delivery Skills", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276058_63f4_4.jpg", 
    "course_url": "https://www.udemy.com/presentation-bootcamp-hands-on-presentation-skills-training/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-06T15:57:54Z"
}