{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Imagine that you you could take out an insurance policy on your next presentation, knowing that it would be great. You can minimize risk in your presentations, just as you do in ever other part of business and life.</p><p style=\"\">Presentation Protection Plan  The &quot;Presentation Protection Plan&quot; course is a simple yet thorough way of preparing people for creating and delivering presentations, speeches, talks and pitches. This concise course forces students to focus on what is most important for them to communicate their messages in a presentation, and then gives them a step-by-step process for practicing and delivering the speech.  Public speaking doesn&#039;t have to be hard or wildly time-consuming. In many corporate and institutional environments, people start focusing on the wrong metrics, i.e. more and more bullet points on PowerPoint slides, versus what can truly be understood and remembered by the audience. Presentation coach TJ Walker has spent 30 years coaching executives to be more effective speakers. This course is a highly concentrated dose of his most effective techniques on how to be a better public speaker and presenter.</p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on July 29, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Presentation Skills: Insurance Your Next Speech Will be Good", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/344178_edb5_2.jpg", 
    "course_url": "https://www.udemy.com/presentation-protection-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-14T14:45:19Z"
}