{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span>Welcome to Athenasia Academy Presentation Skills Workshop.</span>  </p>  <p>  \t     Athenasia Academy has more than 20,000 students worldwide on various platform including Udemy and we always get between 4 and 5 stars rating for our courses.  </p>  <p>  \t     This course will help you to improve your presentation skills in a really short time. It&#039;s 100% video based and we are using a lot of videos from different talks to illustrate each of the principles we are explaining.  </p>  <p>  \t     The course covers all the fundamentals of public speaking. We look at:  </p>  <ul style=\"\">  \t<li><strong style=\"\">Structure:</strong> How to structure your talk with a proper Opening, Corpus (body) and Closing, how to handle Q&amp;A, How to create your visuals, story telling,...</li>  \t<li><strong style=\"\">Verbal communication: </strong>Verbal aspect of public speaking you should consider when you are presenting such as: Voice, Tone, Words, Speed, Intonation...</li>  \t<li><strong style=\"\">Non Verbal communication:</strong> Non Verbal aspect of public speaking you should consider when you are presenting such as: Posture, Gesture, Facial Expression...</li>  \t<li><strong style=\"\">Congruence and feel:</strong> How to communicate the same message on different communication channels</li>  </ul>  <p>  \t     Don&#039;t wait any longer and join us in this fast track course to develop your public speaking skills.  </p>", 
    "end_date": null, 
    "title": "Presentation Skills Workshop", 
    "price": "20.00", 
    "instructors": "Timmermans Laurent", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220374_4d46_4.jpg", 
    "course_url": "https://www.udemy.com/presentation-skills-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T07:29:11Z"
}