{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            In this course, you will learn how to make engaging and inspiring presentations, using the presentation secrets of public speaking experts and international keynote speakers.  </p>  <p>  \t<strong style=\"\">  Present Your Ideas, Projects Or Sales Pitch With Impact And Impress Your Audience.</strong>  </p>  <ul style=\"\">  \t<li>Craft a strong and clear message</li>  \t<li>Project a confident, and dynamic presence</li>  \t<li>Design crisp and good-looking slides</li>  \t<li>Use powerful body language to reinforce your message</li>  \t<li>Grasp the attention with storytelling elements</li>  \t<li>Stay clear of presentation pitfalls and clichés</li>  </ul>  <p>  \t<strong style=\"\">Powerful presentation skills at your fingertips to make a strong impression.</strong>  </p>  <p style=\"\">  \t            Whatever your career path, presentation skills are critical to your success. Sooner or later you’ll have to give a presentation to your manager, colleagues, clients or prospects in order to reach your goals. Armed with the vital presentations skills in this course you will be able to make your next presentation outstanding.  </p>  <p style=\"\">  \t            Mastering the right presentation techniques can help you get that job promotion or convince a new client.  </p>  <p style=\"\">  \t<strong style=\"\">Content and overview</strong>  </p>  <p style=\"\">  \t            In this course I will show you how you can be a successful and confident speaker. First we will look at the single most important part of making a successful presentation: the right preparation. You will learn how successful speakers like Obama prepare. A compelling presentation basically tells a story, so you will learn how to use powerful storytelling elements to craft a strong message.  </p>  <p style=\"\">  \t            You will learn how to start and end your presentation and grab the attention of the audience from the very first second.  </p>  <p style=\"\">  \t            You will get vital design tips to make your Powerpoint presentation clear, crisp and outstanding. How to use (and not use) images, clipart, bulletpoints, graphs, charts, fonts and other design elements to craft stunning slides.  With clear examples of how to improve your slides and sources for free photos, backgrounds and templates.  </p>  <p style=\"\">  \t            Finally, you will learn how to become a confident and convincing speaker, how to use body language to reinforce your message and how to make a strong impression.  </p>", 
    "end_date": null, 
    "title": "Professional Presentation Skills - Impress Your Audience", 
    "price": "45.00", 
    "instructors": "Expert Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/123404_6f3b_8.jpg", 
    "course_url": "https://www.udemy.com/deliver-powerful-presentations-to-impress-your-audience/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-21T10:35:52Z"
}