{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Would you like to tell personal stories that impact and engage any audience? </strong></p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">How would you like to use your own PERSONAL STORIES to leave a lasting impression with any kind of group? </strong></p><p style=\"\"><strong style=\"\">You don't have to be a TED Talks speaker to benefit from the practical, action-ready lessons in this course.</strong></p><p style=\"\">All you need is a willingness to develop your own personal stories. </p><p style=\"\">I have been a classroom teacher for 13 years, and I've spoken to groups of 10's and groups of 1000's, and one thing that I've learned through all of my experience is:</p><p style=\"\"><strong style=\"\"><em style=\"\">Audiences connect better to personal stories. </em></strong></p><p style=\"\"><em style=\"\">Studies of the brain show that personal storytelling engages an audience significantly more than just communicating facts and statistics. </em></p><p style=\"\">In this course, I will show you the SIMPLE ACTIONS you need to take to make your own personal stories more engaging, more intriguing, and more memorable. </p><p style=\"\">In this course you will: </p><p style=\"\">* Understand the dramatic affect that storytelling has on public speaking</p><p style=\"\">* 5 things to consider <em style=\"\">before</em> crafting your personal stories </p><p style=\"\">* 5 steps to writing an engaging personal story</p><p style=\"\">* How to use your stories in a speech</p><p style=\"\">All in all, this course will give you the tools to develop great personal stories and the understanding of how to incorporate them into any speech. </p><p style=\"\"><strong style=\"\">ENROLL TODAY, and get the benefit of Udemy's 100%, 30-day Money-back Guarantee! </strong></p>", 
    "end_date": null, 
    "title": "Public Speaking Essentials: How to Craft Your Personal Story", 
    "price": "20.00", 
    "instructors": "Josh Withrow", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450914_c8ca_4.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T04:10:39Z"
}