{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>How would you like to be able to travel around the world, share your passion on stage before enthusiastic audience - and hey... <strong>get paid to teach what you LOVE!</strong><br></p>\n\n<p>  \t            As you are reading this, countless teachers are out there getting paid to talk about their passion and teaching others their trade. That can very well be YOU.  </p>\n\n<p>  \t<strong>Think about it:</strong> If you CAN someone else's life with your knowledge, put yourself in the speaker's shoes and imagine that positive effect can be MAGNIFIED when you transform the number of people <strong>MANIFOLD</strong>.  </p>\n\n<p>  \t            The way I see it, if you have a gift - you should SHARE it!  </p>\n\n<p>  \t<strong>And while you're at it, why not get paid to speak!</strong>  </p>\n\n<p>  \t            ---------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t<strong>If Speaking On Stage Is So Awesome, Why Aren't More People Doing It?</strong>  </p>\n\n<p>  \t            Honestly, if you are in the education or information business and you're not conducting your own seminar and workshops yet, you are leaving a lot of money on the table. <strong>LOTS OF IT.</strong>  </p>\n\n<p>  \t            Maybe you've heard that before and you decide that running a seminar is too much work. Maybe you don't see yourself as someone who can move crowds because you're not an 'extrovert'.  </p>\n\n<p>  \t            I used to hold onto those limiting beliefs myself, and later a few revelations dawned on me as I saw more and more 'unusual' speakers coming out in different fields.  </p>\n\n<p>  \t            If you want to go BIG in the seminar business and take your info business enterprise to the next level, there's no better time than now.  </p>\n\n<p>  \t            ---------------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t<strong>Easy Public Speaking</strong> reveals how you can get into the seminar business, become an amazing speaker and above all - how to be a bestselling speaker marketing your own high-end programs from stage.  </p>\n\n<p>  \t            Get your instant access and follow my training videos. Sure you won't have the benefit of personal mentoring. Or a 5-star experience at the hotel. But I'd like to think this beats all the other costly alternatives just in case you have a low appetite for risks.  </p>\n\n<p>  \t            Get your online access to these training videos now and become a superstar bestselling speaker starting today.  </p>\n\n<p>  \t      -----------------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t<strong>100% Satisfaction Or Your Money Back Guarantee</strong>  </p>\n\n<p>  \t      I know you will be absolutely thrilled once you got through my course. It's not the usual stuff you know so well of. But if I am proven wrong, if you're not satisfied with this course for ANY valid reason, contact us within 30 days from your purchase and I will refund your purchase in full. No questions asked. You have absolutely nothing to lose.  </p>", 
    "end_date": null, 
    "title": "Public Speaking: Create a Career Teaching What You Love", 
    "price": "20.00", 
    "instructors": "Ricardo Soto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346922_d356_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-superstar-speaker-in-3-days/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T02:55:37Z"
}