{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Imagine that every time you speak, people can understand your message, remember your key points and have a good feeling about you. Wouldn&#039;t it be nice to know that you can present authoritatively on any subject that is important to you or has been assigned to you?  </p>  <p style=\"\">  \t  In this How to Give an Informational Speech course you will learn the following:  </p>  <p style=\"\">  \t  *How to make sure your audience is actually understanding and remembering your key messages  </p>  <p style=\"\">  \t  *How to avoid the most common blunders in other informational speeches  </p>  <p style=\"\">  \t  *How to get your audience to care about your information  </p>  <p style=\"\">  \t  *How to deliver information in an engaging an interesting manner  </p>  <p style=\"\">  \t  This course is delivered primarily through spoken lecture. Because the skill you are learning is speaking related, it only makes sense that you learn through speaking.  </p>  <p style=\"\">  \t  The skill you will learn in this class is not primarily theoretical or academic. It is a skill that requires physical habits. That is why you will be asked to take part in numerous exercises where you record yourself speaking on video, and then watching yourself. Learning presentation skills is like learning how to ride a bicycle. You simply have to do it numerous times and work past the wobbling and falling off parts until you get it right.  </p>  <p style=\"\">  \t  This course contain numerous video lectures plus several bonus books for your training library.  </p>  <p style=\"\">  \t  TJ Walker has been coaching and training people on their presentation skills for 30 years. Now, through the power of Udemy&#039;s online platform, he is able to give you the same high quality training that he gives in person to CEOs, Fortune 500 executives, and Presidents of countries. Only you can now receive the training at a tiny fraction of the normal fee for in-person training.  </p>  <p style=\"\">  \t  How long this course takes is up to you. The longest part of the course involves you speaking on video, critiquing yourself, and doing it over until you like it. But if you get to the point where you love how you look and sound when you present it will be well worth the time spent. And having this skill will save you time for all future presentations in your life.  </p>  <p style=\"\">  \t  You can begin improving your presentation skills right now. You may have an opportunity to speak out as soon as tomorrow, so why waste another day worried that your presentation skills are not up to high standards. </p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on August 3, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Public Speaking Skills:  Give a Great Informational Speech", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363092_9e78_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-give-an-informational-speech/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T14:31:07Z"
}