{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Public Speaking for the Terrified course is a complete beginners guide, and is aimed at novice speakers, and/or anyone who is terrified at the thought of speaking in public. The course is designed to take you from being terrified of giving a presentation, to feeling confident and in control when public speaking.</p><p>In the course, we have taken the Top 10 Fears in Public Speaking, and are giving you all the tools and techniques you need to allow you to overcome these fears.</p><p>The course is taught over a series of 20 talking head videos (total 4+ hours of video). There's a lecture covering the psychology of feeling nervous, a lecture introducing Brain Training, and a lecture on the 3P Model of Speaking Success. This is followed by 10 lectures, each one dealing with a different fear in Public Speaking and more importantly, giving you the practical and psychological tools you need to beat these fears. There are also 3 separate Brain Training lectures, and a bonus lecture on \"What to Do if Things Go Wrong\". This really is a complete course on \"How to\" in Public Speaking, with lots of great public speaking tips.</p><p>There is also a PDF to accompany each lecture, as well as a set of printable Brain Training cards so that students can print off the material and use it when, and as it suits them.</p><p>Why should you take this course?</p><p>Because the trick to being a good public speaker is about being able to demonstrate 2 things:  CONFIDENCE  and CONTROL... and this course will show you how to do both. By the end of the course you will be able to put together and a powerful and engaging presentation, and deliver it with confidence and style.</p>", 
    "end_date": null, 
    "title": "Public Speaking for the Terrified!", 
    "price": "20.00", 
    "instructors": "Lindy Irving", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477920_0913_10.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-for-the-terrified/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T11:20:08Z"
}