{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Learn how to enjoy giving business presentations and public speaking - and captivate your audience</strong>  </p>  <p style=\"\">  \t   Giving a presentation is one of those things you just can’t escape these days. And for most people it’s a painful experience. This course is dedicated to them. It’s also dedicated to anyone who has got past the ‘I hate doing presentations... I hate public speaking&#039; phase to the ‘How do I become a stellar performer?”  </p>  <p style=\"\">  \t   Over the years, Len Smith has given literally thousands of presentations, across Europe and North America. Everything from small boardroom sessions to theatre-style multilingual roadshows. In this course he reveals all.  </p>  <p style=\"\">  \t   Even if you are already a proficient speaker, you will almost certainly benefit from learning some of the techniques that can add power to any presentation.  </p>  <p style=\"\">  \t<strong style=\"\">You will discover:</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">how to project ideas with confidence</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">a simple, proven structure that works every time</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">controlling panic and using nerves</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">timing - how to pace a talk and stay within time</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">handling questions with ease</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">turning round an unresponsive or hostile audience</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">easy ways to maintain interest</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">brain death - how to cope with every speaker&#039;s worst fear</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">covert rehearsal - eliminating the pain</strong>  </p>  <p style=\"\">  \t   ·  <strong style=\"\">ensuring your visual aids really do add impact</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Anatomy lesson</strong>  </p>  <p style=\"\">  \t   We look at the anatomy of a successful presentation. You will learn a simple structure that will cover the requirements of almost any business presentation you will ever have to give. A structure that can enable you to prepare a presentation in minutes. And remember, a speaker working to a structure, a speaker who at all times knows where they are going, is a confident speaker.  </p>  <p style=\"\">  \t   Len has trained speakers from start-ups to family businesses and multinationals. His style is lively, entertaining and very engaging. He has presented on BBC’s Executive Business Channel, as well as producing presentations for organizations such as PricewaterhouseCoopers, IBM, Welcome and Pharma Systems.  </p>", 
    "end_date": null, 
    "title": "Public Speaking, presentations - painless and powerful", 
    "price": "20.00", 
    "instructors": "Len Smith, Sean Kaye", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20743_ca49_10.jpg", 
    "course_url": "https://www.udemy.com/who-me-give-a-presentation-become-a-powerspeaker/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-06T06:37:19Z"
}