{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">How to Create Winning Messages</p><p style=\"\">Imagine yourself going into every media interview with the perfect, winning message. Whether it is a feel-good story or a crisis, reporters will feel satisfied that you have delivered a compelling message. And you will know that you communicated exactly what was most important to you.</p><p style=\"\">This &quot;How to Create Winning Messages&quot; course will teach you how to go from 50 or 100 interesting messages down to your three most important messages. The key to mastering media interviews is not necessarily knowing the answer to every question, but having a coherent message thought out in advance of the interview. This course will teach you specifically how to come up with messages that satisfy you, the media and the audience. Specific screens will be used to eliminate bad messages.</p><p style=\"\">Why take the risk of even one more day of delivering mixed messages to the media? Sign up today for this course today. </p><p style=\"\">Course updated on July 27, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee. </p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe. The trainer has produced more than 100 online courses on spoken communication and has produced more than 10,000 talking head videos himself.</p>", 
    "end_date": null, 
    "title": "Public Relations: You Can Create Winning Media Messages", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338678_89e9_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-winning-messages/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T18:45:21Z"
}