{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Public Speaking for C-Level Executives</p><p style=\"\">Imagine yourself speaking like a supremely confident and accomplished CEO of a Fortune 500 Corporation. You can speak with great authority and confidence right away.</p><p style=\"\">Solid public speaking skills are no longer an extra or a luxury for C-level executives; communication skills are a basic requirement for such jobs. You can get ready, now, for your promotion into the C-suite.</p><p style=\"\">In this Public Speaking for C-Level executives course, you will learn how to present your ideas in front of employees, investors, the board of directors and colleagues in your industry. This course is about how to be a great public speaker, not merely an adequate one. You will learn how to reduce your time in speech preparation but generate far better results. And you will learn how to avoid the public speaking traps that label most executives as mid-level leaders who are not ready for Prime Time. This course will cover all essential aspects of public speaking, presentation skills and PowerPoint Presentations.</p><p style=\"\">Why risk even one more day having the public speaking skills of a junior executive or mid-level manager? Sign up for this course today.</p><p style=\"\">Course updated on July 27, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p>", 
    "end_date": null, 
    "title": "Public Speaking: C-Level Executive Public Speaking Skills", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338480_8d28_3.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-for-c-level-executives/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T14:11:55Z"
}