{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Imagine for just a moment the amazing feeling in your future when that special child in your life is being tucked in at night and looks up into your eyes and says, “Tell me a story…&quot; and you bring out your very own book, read the title, watch the child touch its glossy cover and ask, “Is this the story you wrote for <em style=\"\">me</em>???&quot;</p><p>In this easy-to-follow-along course, you&#039;ll learn how to not only <em style=\"\">write</em> the book of your dreams, but to <em style=\"\">revise</em>, <em style=\"\">illustrate</em>, <em style=\"\">design</em>, and <em style=\"\">publish</em> your most compelling children&#039;s picture book.</p><ol style=\"\"><li>Learn editor and publisher Demi Stevens&#039; ninja-stealth trick to writing better and faster 1st drafts.</li><li>Write your book, step by step. You&#039;ll also learn industry-insider tips to revising so your 2nd draft more closely resembles the 4th or even 5th draft of other writers.</li><li>Make your book&#039;s text and story line really shine on the page, complete with done-for-you Book Templates which make it DIY simple.</li><li>Find your book&#039;s perfect illustrator, and learn tried-and-true techniques which allow even grade school students to illustrate their own titles with success. You&#039;ll also learn how to perfectly scan those finished illustrations and insert them in your book&#039;s digital file.</li><li>Walk step-by-step through basic, intermediate, and pro techniques to polish your book&#039;s text and illustrations.</li><li>Create your online account and upload your book&#039;s interior and cover files so you can order a full-color, professionally printed and bound copy of your book.</li><li>Learn to not only acquire inexpensive copies of your book to distribute to friends and family (or resell at a significantly higher retail price!), but also launch your title for sale on Amazon and through book retailers worldwide.</li></ol><p>And… if your dream is larger than just reading your book to that special child in your life… you&#039;ll have the skills you need to move forward on a career as a PUBLISHED AUTHOR… or even to open an independent publishing company of your own.</p><p>The choice is up to you! Your journey begins today!</p>", 
    "end_date": null, 
    "title": "Publish Your Children's Picture Book", 
    "price": "25.00", 
    "instructors": "Demi Stevens", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533760_deed_4.jpg", 
    "course_url": "https://www.udemy.com/publish-your-childrens-picture-book/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-21T22:51:31Z"
}