{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><span style=\"\">Imagine yourself delivering a fantastic speech or presentation, and you only spent minutes preparing in advance. You can appear to have spent dozens of hours preparing, even though you waited until the last minute.</span></p><p style=\"\">  \t<span style=\"\">How to Drasticall</span><span style=\"\">y Reduce Time Spent on Speech Preparatio</span><span style=\"\">n and Still Deliver a Better Presentati</span><span style=\"\">on</span> </p><p style=\"\">  \tIn this &quot; How to Drastically Reduce Time Spent on Speech Preparation and Still Deliver a Better Presentation&quot; course students will learn how to eliminate wasteful and non-productive practices that many people follow when preparing speeches, talks and PowerPoint Presentations. This course will help students focus on what is really important in creating and delivering speeches and how to avoid time wasting traps. You can give a great speech without spending days and days in preparation.  &lt;</p><p style=\"\">  \tTJ Walker is a presentation coach with more than 30 years of experience. He frequently works with busy political leaders and CEOs who don&#039;t have much time to prepare for their speeches, but must give great presentations every time.  </p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on July 29, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Public Speaking-Drastically Reduce Time Spent on Speech Prep", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348510_a921_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-drastically-reduce-time-spent-on-speech-preparation/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T21:58:27Z"
}