{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Imagine standing up to give a presentation to an important audience knowing that you will look comfortable, confident and relaxed. And you know that your audience will understand you and remember all of your key points. And you did all this even though you procrastinated until the very last hour before you gave the speech.</p><p>You can give a great speech that looked like you worked on it for weeks, even though you waited until an hour before you spoke to begin preparing. And nobody will know but you.</p><p>This course is for anyone who has procrastinated and now has to give a speech within the next 1 to 24 hours. You will learn how to use the least amount of time in the most effective way. This course, plus all of your homework should take less than 1 hour, so this is an ideal way to prepare for any speech or presentation, even if it is only 90 minutes away. Students will learn how to avoid time traps and instead focus on the most important essentials needed to communicate confidently and clearly.</p><p>Why go through even one more presentation or speech knocking yourself for not having prepared in time? Why kick yourself for giving a lousy speech. You can learn a foolproof method today to make every speech fantastic, even if you wait until an hour before it is to be delivered.</p><p>Course updated on July 23, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p>TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p>", 
    "end_date": null, 
    "title": "Public Speaking Emergency! Ace the Speech With Little Prep", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303056_3210_7.jpg", 
    "course_url": "https://www.udemy.com/emergency-speech-preparation-last-minute-presentation-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T17:12:33Z"
}