{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      ATTENTION LADIES AND GENTLEMEN!  </p>  <p>  \tAsk yourself the following questions:<br style=\"\">  </p>  <p>  \t      Do you have difficulties speaking in front of an audience?  </p>  <p>  \t      Do you have trouble getting your nerves under control?  </p>  <p>  \t      Do you want to learn how to put together an effective presentation with Udemy?  </p>  <p>  \t      Would you like to become a better salesperson?  </p>  <p>  \t      Do you want to persuade others to follow you?<br style=\"\">  </p>  <p>  \t      Or would you like to get people to pay attention to you?  </p>  <p>  \tIf you answered &#039;yes&#039; to any of the questions above then this course is for you!<br style=\"\">  </p>  <p>  \t      Complete my Udemy course and you will be able to do the following:  </p>  <p>  \t      1. Use the keys to effective interpersonal communication: Believability and the Nine Behavioral Skills of Communication.  </p>  <p>  \t      2. Develop Connection with your listeners via the behavioral skill of Eye Communication.  </p>  <p>  \t      3. Develop energy in your interpersonal communications via the behavioral skills of Posture and Movement, Gestures and Facial Expressions, and Voice and Vocal Variety.  </p>  <p>  \t      4. Develop credibility in your interpersonal communication via the behavioral skills of Dress and Appearance and Language, Nonwords, and Pauses.  </p>  <p>  \t      5. Develop interaction with your audience via the behavioral skills of Listener Involvement, Humor, and the Natural Self.  </p>  <p>  \t      Supplementary exercise problems are available for download on my Udemy course website. These exercises will enhance your learning of the Udemy course lectures and help you become better at speaking in formal and informal situations.<br style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Public Speaking for Business and Education", 
    "price": "50.00", 
    "instructors": "Annie C", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374764_9f7e_2.jpg", 
    "course_url": "https://www.udemy.com/lessons-in-communication/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-21T01:16:35Z"
}