{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>How often have you attended a business event only to find that the presenter is nervous, ill-prepared or downright boring? How often have you been thrust in front of an audience and asked to present a speech, conduct a business workshop or seminar, or a sales pitch to a potential customer?</p><p>Do you fear having to stand up and speak in public? Would you like to overcome your fear of public speaking? What would you give to be a confident, imaginative, inspiring public speaker, able to capture the imagination and motivate your audience, or turn a prospect into a customer?</p><p>If the answer is 'yes' to any of these questions, or you realise that good public speaking is a key to business &amp; career success, then this course is for you. </p><p><strong>Enhance &amp; advance your career &amp; business opportunities by becoming an effective &amp; inspiring communicator.</strong></p><p>To enrol on this course you don't have to have any prior experience of speaking in public, you will simply have concerns about public speaking and will want to know how to handle the various skills and problems.<span></span></p><p><span>This course includes 19 video modules and with the assistance of my three associates we will take you through, in an entertaining &amp; engaging way, the following six steps to becoming an accomplished public speaker. </span></p><p><strong>Part 1 - My fears</strong><br>Most people will have fears when required to speak in public – we understand that. We look at these fears and we will show you how you can overcome them.<br></p><p><strong>Part 2 - My purpose</strong><br>You need to have a purpose when you speak and we will look at how you can convert this into the beginnings of a speech or presentation.<br></p><p><strong>Part 3 - My speech<br></strong>This is all about the speech itself – how you structure it, how you write it and how you target it at your audience.</p><p><strong>Part 4 - My speaking<br></strong>So you are standing up there with your speech in your hand, looking at your audience. This is all about how you actually deliver the speech and make it a success.</p><p><strong>Part 5 - My audience</strong><br>You will not be speaking to yourself so you will need to have some idea about the differences between speaking to an audience and social conversation. These are the people you will need to persuade. What are they like? How do you gain rapport?</p><p><strong>Part 6 - My practical speaking</strong><br>For business, speaking in public is a practical skill - you will need to give presentations, speak 'off the cuff', take part in meetings and try to persuade others. Here we show you the way it is done.</p><p><strong>As a bonus </strong>- along with each module is a downloadable 'Speechnotelet' which describes the key points of the lesson, <strong>and even more</strong> - at the last module you can download our 100-page E-book detailing the entire course and more.     <br></p>", 
    "end_date": null, 
    "title": "Public Speaking for Success", 
    "price": "20.00", 
    "instructors": "Peter Sinnott", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611856_368e.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-for-success/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T16:46:55Z"
}