{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span class=\"Apple-style-span\" style=\"\"><strong style=\"\">Why should you take this course?</strong></span>  </p>  <p style=\"\"><span class=\"Apple-style-span\" style=\"\">Your presentation is only valuable if you can persuade and motivate others to act on it.  Discover 39 secrets you&#039;ve never heard to get more sales, more promotions and eliminate your fear of public speaking. This 4-hour advanced, interactive program dives deeply into the specific skills and exact techniques you need to deliver your presentation and make it irresistible for your audience. You&#039;ll see Jason Teteak, presentation guru and best selling author of &quot;Rule the Room&quot;, model everything he suggests you do.   It&#039;s our most advanced presentation delivery toolkit, so it may not be the place to start if you are just beginning.  You&#039;ll learn dozens of techniques you&#039;ve never seen before to get more sales, get more buy-in, eliminate your fear of public speaking, show confidence, and motivate your audience to action.</span>  </p>  <p style=\"\">  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p style=\"\">  \t&quot;I figured Jason Teteak might have a few new tricks—but not much that I hadn&#039;t heard before. I was wrong. Jason integrates the latest research on presenting, learning, and audience dynamics with a captivating style that plays with the ironic fact that he is doing presentations… about presentation skills. And therein lies the secret to this marvelous program.&quot;  </p>  <p style=\"\">  \t<strong style=\"\">- Philip Deloria</strong>- Professor and Associate Dean, University of Michigan  </p>  <p style=\"\">  \t&quot;It&#039;s pretty simple. Jason Teteak walks the talk. In this day and age, finding a true thought leader amongst many is the key to getting to new levels. Listening to Jason and benefitting from his teachings will take you to that new level you seek. He is cutting edge, extremely practical and connects in a way that is motivating, informing and memorable. Some of the biggest benefits received from Jason are tactics, ideas and methods that are immediately implementable. Watch Jason&#039;s program before your competition does.&quot;  </p>  <p style=\"\">  \t<strong style=\"\">- Al Lautenslager</strong>- Best-selling Author, Guerrilla Marketing in 30 Days  </p>  <p style=\"\">  \t“I have been to several seminars on public speaking and giving presentations, including Dale Carnegie training. I truly went into this thinking that I couldn&#039;t possibly learn anything new, but I found myself scribbling notes like a mad woman during the presentation. I quickly realized that these were tips and techniques that I had never heard before, and that I could use immediately upon my return to the office.&quot;  </p>  <p style=\"\">  \t<strong style=\"\">- Joey Monson-Lillie</strong>- Human Resources Manager  </p>", 
    "end_date": null, 
    "title": "Public Speaking and Presentations Pro: No Beginners Allowed!", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137144_ee80_17.jpg", 
    "course_url": "https://www.udemy.com/give-a-dazzling-keynote-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-23T17:08:22Z"
}