{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Your career success greatly if not solely depends on your ability to THINK and SPEAK clearly. &nbsp;</p><p>Do people pay attention when you speak? &nbsp;Do they understand what you&#039;re saying? &nbsp;Are you able to present yourself and your ideas in&nbsp;a manner such that people are persuaded by what you say? &nbsp;</p><p>You have great potential. &nbsp;But people will not recognize it IF you&#039;re not able to organize your thoughts clearly, and then present those thoughts in a way that virtually anyone can understand them.&nbsp;</p><p>Take this course, put into practice what you learn, and you&#039;ll find that more people will...</p><p></p><ul style=\"\"><li>Maintain eye contact with you while you speak,</li><li>Nod in agreement when you&#039;re presenting,</li><li>Seek you out for advice,</li><li>More readily accept your ideas,</li><li>By from you,</li><li>Hire you, and</li><li>Promote you!</li></ul><p>Companies are requiring that you have the ability to communicate well in English, work well with teams and be able to present information in such a way that you engage the audience and not bore the heck out of them. &nbsp;</p><p>I know you have the ability to present your ideas intelligently. &nbsp;</p><p>THIS course will give you the exact tools you need start thinking and speaking with such great clarity that more and more people will instantly recognize your intelligence. &nbsp;</p><p>Take this course, equip yourself and watch the doors of opportunity fly open for you.&nbsp;</p><p>This course contains not only downloadable videos, but also the complete program in mp3 format so that you can listen on the go!</p>  ", 
    "end_date": null, 
    "title": "Public Speaking: How To Think & Speak More Clearly", 
    "price": "30.00", 
    "instructors": "Michael Williams", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63095_f9ad_10.jpg", 
    "course_url": "https://www.udemy.com/how-to-think-and-speak-more-clearly/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-30T19:34:47Z"
}