{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you struggle with knowing where to put commas and colons and exclamation points? Do you get fewer \"opens\" on your marketing emails than you'd like? Do you worry about people on Facebook thinking you're stupid because of punctuation mistakes? </p><p>If you've ever worried because your punctuation is not all that great, then this course is perfect for you. There are loads of examples to study, clear instructions (Sally struggled with this herself, so she teaches it without all the fancy jargon that only makes your head want to explode), and plenty of downloadable cheat sheets, as well as  quizzes to help you grasp what you're learning.</p><p>Sally has over 1300 satisfied students on Udemy so come on in and let her help you with your punctuation. </p><p><strong>WHAT ARE PEOPLE SAYING about this course:</strong></p><p>Sally takes a subject that at best seems daunting (at worst, insanely boring) and makes it accessible--meaningful, even.~ Abby </p><p>~~~~~</p><p>This course is a great resource for punctuation rules whether you struggle with punctuation or just need a review. ~ Cheryl </p><p>~~~~~</p><p>  . . . a great alternative to Strunk &amp; White's \"Elements of Style\". ~ Becky</p><p>~~~~~~</p><p>Ms. Apokedak . . . manages to make the learning fun ~ Debbie </p><p>~~~~~~</p><p> . . . a fantastic overview for those who are new to English or those of us who've forgotten a little over the years. ~ Hannah </p><p>~~~~~~</p><p><strong>And here's what some have said about Sally's conference classes, retreats, and online courses:</strong></p><p>. . . thank you again for a fabulous weekend. I left encouraged and energized . . . It was a wise investment and fun.</p><p>~ Jean Wilund</p><p>~~~~~~~~~</p><p>Sally,</p><p>We had so many wonderful comments about you and your class on our evaluations. We hope you'll be able to join us again next summer.</p><p>Blessings, Lindy Jacobs, OCW Summer Conference Director</p><p>~~~~~~~~</p><p>Hello Sally,</p><p>I hope you realize how much wisdom and knowledge you imparted during your time at the wik13 conference in Birmingham. . . .</p><p>~ Heather L. Montgomery Assistant Regional Advisor Southern Breeze SCBWI</p><p>~~~~~~~</p><p>Thank you for your incredible class. It was a valuable, valuable learning experience. . . .</p><p>~ Kimberly</p><p>~~~~~~</p><p>Thank you so much. I got a lot out of the class and it gave me a lot to think about. I'm grateful for all the feedback.</p><p>~ Christie</p><p>~~~~~~</p><p>Thank you so much for your feedback . . . throughout the course. I appreciated how much you know about this field and your willingness to share your expertise.</p><p>~ Sandy</p><p>~~~~~~</p><p>In Sally's video lectures, she made me think about writing like I hadn't before, especially the weeks about voice and theme.</p><p>~ Margo </p><p>~~~~~~~</p><p><strong>What this course promises:</strong></p><p>To teach you how to use punctuation so you can write blog posts, emails,  marketing copy--whatever you write--in a more interesting and compelling way.</p><p><strong>What this course does not promise:</strong></p><p>That it will be fast and easy: the course is fast and easy, but these punctuation skills will only become second nature to you as you use them. And that takes time and practice. </p><p>The great news is that you have a lifetime membership to this course, so you'll have easy access, forever, to the lessons and the examples of proper punctuation. </p><p><strong>Some questions this course answers:</strong></p><ul><li>What is a serial comma?</li><li>Do you capitalize the first word after a colon?</li><li>Do commas and semicolons go inside quotes or outside?</li><li>What are em dashes and how are they different from parentheses?</li></ul>", 
    "end_date": null, 
    "title": "Punctuation ~ American English: punctuate with confidence!", 
    "price": "20.00", 
    "instructors": "Sally Apokedak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662086_3451_2.jpg", 
    "course_url": "https://www.udemy.com/punctuation-english-american/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T15:07:34Z"
}