{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This course will introduce you to effective communication</strong>, that has since been a lost art with technology rapidly advancing. We went from a high touch world to now heavily relying on high tech. Now you are probably asking yourself, \" why do I need to learn how to effectively communicate if we live in a world of technology?\" <strong>In this course you will learn and understand why learning how to communicate and more importantly, emotionally connect with people, will help you increase your sales, increase retention with current and future clients, boost the moral of the office environment, and lastly how you can create influence to help guide large amounts of people to fulfill a higher purpose.</strong><br></p>\n\n<p>Your instructor, Toan, will guide you through comprehensive trainings that will help you to not only understand what being an effective communicator is and how it will open the doors to more opportunities for you. He will also help you clearly understand the 4 dominating personalities of 16 types in this world. He will also provide you will the materials that will help you determine what type of personality you are. Once you are aware of who you are and what motivates and discourages you, <strong>you will have an upper advantage to now know how to control and work your words towards your advantage.</strong> </p>\n\n\n\n<p>Have you ever had a thought of curiosity and wonder of how certain people that you feel is less talented than yourself but always seem to land the job promotion that you get looked passed, become the top sales rep in the department, how someone is able to lead and influence a large organization towards success, or want to learn how to guide your employees towards more production while boosting the overall moral of your people? If you are telling yourself that is you, then you should consider purchasing this course to have a clear understanding on what Toan will share in his lectures. </p>", 
    "end_date": null, 
    "title": "Read Personalities Like a Pro and Increase Your Influence!", 
    "price": "20.00", 
    "instructors": "Toan Nguyen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/714018_d5ed_3.jpg", 
    "course_url": "https://www.udemy.com/effectivecommunication/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-03T02:28:42Z"
}