{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  If you&#039;re an ambitious techie - and entrepreneur - you&#039;ll know that having technical savvy is just not <em style=\"\">enough</em>. You need to get that expertise recognized and valued by others, and to build your client relationship skills to do that. To give advice at a strategic level and to grow your business, you&#039;ll need credibility, authority and reputation.  </p>  <p style=\"\">  \t        Research shows new clients or customers cost at least 7 times as much as repeat business - but repeat business depends on great client relationships.  </p>  <p style=\"\">  \t        So here you&#039;ll learn how to attract clients, build trust, influence and negotiate with clients, as well how to become an authority and trusted adviser.  </p>  <p style=\"\">  \t          Once you&#039;ve gained these skills, repeat business follows, giving you less need to market constantly and more time to make great stuff...  </p>  <p style=\"\">  \t                In this highly practical course, we teach you these skills through short videos, questionnaires, quizzes and practical suggestions, along with articles and external links.  </p>  <p style=\"\">  \t                By the end of the course, you&#039;ll be able to clearly identify and plan what you need to do to progress from a techie operative into a consultant and trusted adviser.  </p>  <p style=\"\">  \t <em style=\"\">&#039;Great course for nerds and consultants and customer development</em>  </p>  <p style=\"\">  \t <em style=\"\">One of the better Udemy courses that are worth learning from.&#039;</em>  </p>  <p style=\"\">  \t <strong style=\"\">Background Story</strong>  </p>  <p style=\"\">  \t       We made this course after building a start-up together, and then we piloted it with technical experts, through Software Alliance Wales at Swansea University.  </p>  <p style=\"\">  \t                We&#039;re a quite specific combination of software engineer and business psychologist: the engineer being interested in psychology, and the psychologist having worked in tech businesses.  The engineer challenges the psychologist when she&#039;s being woolly - and she challenges the engineer when emotional intelligence goes awol...  </p>", 
    "end_date": null, 
    "title": "Repeat Business Skills For Techies", 
    "price": "25.00", 
    "instructors": "Philippa Davies, Software Architect Phil Murphy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/187846_7901_6.jpg", 
    "course_url": "https://www.udemy.com/repeat-business-skills-for-techies/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-24T14:58:13Z"
}