{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Lacking confidence about your business report writing skills because you've never had any formal training in writing reports?</p>\n\n<p>Panicking because you're supposed to be writing a business report and you've no idea where to start?</p>\n\n<p>Sick of wasting hours worrying about how to knock all that research into a logical shape?<br></p>\n\n<p>Or maybe you write business reports regularly but you're just not getting the results or feedback you'd like from your reports?</p>\n\n<p>If any of these sound like you, stop worrying now! Because this course will take you through the process of business report writing - step by step and with downloadable cheat sheets.</p>\n\n<p>What's more, your guide is a Cambridge graduate and teacher with years of experience helping people write business reports that have impact.</p>\n\n<p><strong>Report writing: take the pain out of planning and the sweat out of structuring!</strong></p>\n\n<p>For most people, the hardest part of report writing is getting started. In this course, you're going to learn how to shave hours, days or even weeks off the report writing process through intelligent planning. You'll learn what questions to ask so you're not reinventing the wheel when you sit down to write your report. </p>\n\n<p>But best of all, you'll discover a miraculous technique that will completely revolutionise how you go about structuring your reports. I developed this technique while working with a client who had been tearing his hair out at that early shaping stage. With my help, in under five minutes he went from having no clue about how to order his report to imposing a clear, coherent, logical structure on his ideas.</p>\n\n<p>I've since gone on to share this technique with other report writers and trust me they're always blown away by its power and simplicity. I can't wait to share this technique with you - and you'll be glad I did!</p>\n\n<p><strong>Report writing with impact to win readers over</strong></p>\n\n<p>But this course won't just save you time as a writer. It will also help you save your readers time - and they will love you for it!</p>\n\n<p>The American novelist Elmore Leonard famously advised writers to leave out the parts that readers skip. And I'm going to be showing you how to leave out the parts of a report all, yes ALL, readers skip. The pointless parts every report writer thinks are helping readers, but are really hindering them.</p>\n\n<p>And I'll be busting some myths about that all important executive summary. It's the only part of your report you can guarantee everyone will read, so you'll want to make sure it's as powerfully persuasive as it can be. I'll show you how.</p>\n\n<p><strong>Stand out from the crowd with a report that looks as good as it reads</strong></p>\n\n<p>Finally, I'll be showing you how to take your almost-finished report up a notch with simple design and layout tips from a seasoned design professional. You'll even discover one little design trick that's been scientifically - yes, scientifically - proven to boost your credibility and persuasiveness with readers.</p>\n\n<p>So what are you waiting for? Let's get that report written today!</p>", 
    "end_date": null, 
    "title": "Report Writing Made Simple", 
    "price": "20.00", 
    "instructors": "Dr Clare Lynch", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470846_7c0e_2.jpg", 
    "course_url": "https://www.udemy.com/report-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T13:51:33Z"
}