{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>When writing a book, one of the most important requirements is the ability to present an exciting story that your readers will invest in. A story where they will want to know what comes next right through to the end.</p><p><strong>In this training I show by example</strong>, how to break down popular fiction into the basics of the story. The skeleton of the story, and from that simple outline, <strong>I give 2 examples of how to create a new story in two different genres, to show how simple my outlining method works.</strong></p><p>I demonstrate with the same outline sheets I use when I am writing a book, and also for the books I get my ghostwriters to write for me. Those outline sheets are available for download in the course.</p><p>It is so simple that I know by the end of the training you will be able to write your own book with exciting storylines too.</p><p>I also show <strong>how to build out the sections of the stories</strong> using simple techniques and the use of questions to bring out your creativity.</p><p>You will easily decide how many words you need in each section of your book, and once it is broken down into the smaller pieces of the story, <strong>you will find it a lot easier to write the book.</strong> </p><p>The benefit of doing this is you will also be <strong>able to write your books a lot faster.</strong> </p><p><strong>You won’t get stuck for words.</strong> You won’t be looking at a blank screen or piece of paper wondering why you’ve got writers block. </p><p><strong>There are 18 lectures and an hour of content.</strong></p><p><strong>There are downloadable files that you can use for all your books.</strong></p><p>I’ve structured this course in a simple methodical way based on the best results I’ve had from training thousands of people in book publishing.</p><p><strong>You will gain confidence and skills that will benefit you for a lifetime of easy writing.</strong></p><p>I’ve kept the videos short and to the point without leaving out the crucial information you need to succeed.</p><p><strong>You can go away in the next day with a whole new understanding of what Riveting Fiction is all about.</strong></p>", 
    "end_date": null, 
    "title": "Reverse Engineer Riveting Fiction & Write Best Selling Books", 
    "price": "25.00", 
    "instructors": "Geoff Shaw", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672842_41e2.jpg", 
    "course_url": "https://www.udemy.com/reverse-engineer-riveting-fiction-write-best-selling-books/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T02:02:56Z"
}