{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>In diesem Rhetorik Crashkurs lernst Du, wie Du mit guten Argumenten andere überzeugst und dabei selbstbewusst auftrittst. </strong></p><p>Der Rhetorik Crashkurs ist ideal für diejenigen, die in ca. 3 Stunden das Wichtigste über Rhetorik, Argumentation und selbstbewusstes Auftreten lernen wollen. Es gibt 9 tolle praktische Übungen, mit denen Du das Gelernte gleich einüben kannst. Damit ist der Kurs nicht nur Wissensvermittlung, sondern gleich eine Anleitung zur besseren Redepraxis. </p><p>Der Trainer ist absoluter Rhetorik-Profi, gehört zu den erfolgreichsten Turnier-Rednern Europas (TOP10-Speaker bei der Debattier-Europameisterschaft 2015) - und gibt ausschließlich Tipps, die auch wirklich funktionieren! </p><p><strong><br></strong></p><p><strong>Die 6 Kerninhalte des Kurses sind:</strong></p><p>1. Zehn Gebote der Rhetorik für eine erfolgreiche Rede</p><p>2. Selbstbewusste Körpersprache</p><p>3. Selbstbewusste Stimme</p><p>4. Fünf Tipps gegen Lampenfieber</p><p>5. Mit guten Argumenten überzeugen</p><p>6. Häufige Rhetorik-Fragen</p><p><br></p><p>Warum sollte man diesen Crashkurs Rhetorik unbedingt machen? Ganz einfach: Man lernt von einem absoluten Rhetorik-Profi, der vielmals Publikumsliebling in Finals großer Rhetorik-Wettbewerbe stand - und daher genau weiß, wie man sein Publikum in den Bann zieht.</p><p><br></p><p>Vor allem: Egal ob Du Anfänger bist - oder schon etwas fortgeschritten: Das hier vermittelte Grundlagenwissen ist ein absolutes Muss für jeden, der effektiv vor Publikum reden will! </p><p><br></p><p>Also: Gleich anmelden und ein paar Lektionen machen! Es lohnt sich!!</p>", 
    "end_date": null, 
    "title": "Rhetorik: Selbstbewusst kommunizieren und überzeugen", 
    "price": "25.00", 
    "instructors": "Rhetorik-Trainer & Speaker Wladislaw Jachtchenko", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722080_8013_4.jpg", 
    "course_url": "https://www.udemy.com/rhetorik-crashkurs/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T18:58:26Z"
}