{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Do you hate cameras? Do get all twitchy as soon as a camera or smartphone is pointed in your direction? Well, <strong style=\"\">I feel your pain</strong>. I was like you. Recently. In fact, just a few weeks ago.  </p>  <p style=\"\">  \t  I used to take some footage of myself, then play it back and be disappointed. Take two and I stumbled over some words. By take 36 I thought the return on investment of my time was not worth it. I wanted to give up. Then I realised something. It&#039;s true for me and it&#039;s true for you.  </p>  <p style=\"\">  \t  You have something important to say to the world. Don&#039;t let your fear of turning up on video get in the way of that message.  </p>  <p style=\"\">  \t  So, how do you overcome your fear of being filmed?  </p>  <p style=\"\">  \t  Actually, it&#039;s remarkably easy. Many actors suggest practicing in front of a mirror or a friend, but that&#039;s not what worked for me. (It only stressed me even more).  </p>  <p style=\"\">  \t  Instead, I focused on my attitude:  </p>  <ul style=\"\">  \t<li style=\"\">think of the message you want to share</li>  \t<li style=\"\">stop practicing until it&#039;s perfect</li>  \t<li style=\"\">take much shorter clips of yourself</li>  \t<li style=\"\">focus on something other than you</li>  </ul>  <p style=\"\">  \t  Even a few simple changes helped.  Like changing the time of the day when I was recording myself or changing my posture.  </p>  <p style=\"\">  \t  This course is not written by a professional actor. It&#039;s written by someone like you. I had no video or camera experience before, and I&#039;ve had no professional training. But <strong style=\"\">these tips have worked for me</strong>.  </p>  <p style=\"\">  \t  The tips are:  </p>  <ul style=\"\">  \t<li style=\"\">practical</li>  \t<li style=\"\">easy to follow</li>  \t<li style=\"\">free to implement (apart from the cost of this course), and -- best of all --</li>  \t<li style=\"\">they work</li>  </ul>  <p style=\"\">  \t  So whether you&#039;re too nervous to look at a lens or just want to get a little bit more comfortable when you&#039;re being recorded, follow this course and Rid Yourself, once and for all, of your fear of the camera.  </p>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "Rid Yourself of Fear of the Camera", 
    "price": "20.00", 
    "instructors": "Anthony English", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185108_8b46_5.jpg", 
    "course_url": "https://www.udemy.com/rid-yourself-of-fear-of-the-camera/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-19T10:05:14Z"
}