{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Enough is enough!</p>\n\n<p>Have you had enough of technical jargon and conflicting advice about how to generate sales through social media and content marketing? Are you a small to medium business looking for a step-by-step action plan to guide you right through the content marketing process - from idea to execution, measurement and delivery?</p><p>If so, you are not alone! De-mystifying content marketing in order to achieve a measurable return on investment is a huge pain point for many businesses. If this sounds familiar, then Rules of Social Engagement is for you. This step-by-step approach provides you with a no-fuss strategy for driving sales by creating, executing and tracking an easy to manage social content marketing plan.</p>\n\n\n\n<p>Rules of Social Engagement is split into 9 sections. Each section is:</p><p>1. A chapter in the book</p><p>2. A video template explaining the chapter</p><p>3. A template to fill out for your own business</p><p>4. A Demo lecture showing you how to fill it out and what to look out for.</p><p>ROSE allows you to tailor the rules to your own businesses in REAL TIME through a series of online templates and tools. Most importantly, it will teach you how to connect with your audience by creating truly engaging content! By the time you put this book down, you will have all you need to know to develop a customized engagement plan to drive sales for your business.</p>", 
    "end_date": null, 
    "title": "Rules of Social Engagement - Social 101", 
    "price": "20.00", 
    "instructors": "Philippa Spork", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815146_e2cb_3.jpg", 
    "course_url": "https://www.udemy.com/rules-of-social-engagement-social-101/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T04:45:28Z"
}