{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Did you know that HALF of all workers did not negotiate their first salary?<br>  \t<br>  \t  Here&#039;s why: They think they should be lucky to just have a job, they don&#039;t know how to find their worth, they&#039;re afraid of losing the offer, or they simply didn&#039;t know that they <em>could</em> negotiate. Unfortunately, they&#039;re leaving thousands, even millions on the table.<br>  \t<br>  \t<strong>How would <em>you</em> like to have an extra $5,000?</strong><br>  \t<br>  \t  I surveyed former students and the average raise was more than $5,000, and 1 in 5 increased their salary by $10,000 or more! That&#039;s money that could be used to pay down student loans, decrease credit card debt, or be used toward a first apartment.  </p>  <p>  \t<strong>By the end of this course, you will be able to:</strong>  </p>  <ul>  \t<li>Accurately research your worth when entering the workforce</li>  \t<li>Navigate the early stages of an interview, avoiding online forms and low-ball screening questions from HR</li>  \t<li>Use a 5-minute body language trick to increase your rate of success</li>  \t<li>Implement the same negotiation techniques used by the FBI</li>  \t<li>Confidently say exactly the right phrases to secure the highest salary and get paid what you deserve -- without the fear of losing the job</li>  </ul>  <p>  \t<strong>What truly sets apart this course are the added modules you won&#039;t find anywhere else.</strong>  </p>  <ul>  \t<li>An interactive, role-playing &#039;hot seat&#039; to practice your negotiation</li>  \t<li>Interviews with college counselors and detailed case studies, including an $11,000 increase from a single email</li>  \t<li>Advice on negotiating benefits, such as bonuses, flextime, relocation, and 8 more, as well as resources for women, non-profits, and startups</li>  </ul>  <p>  \t  If you&#039;re a student interviewing for your first job and want to be part of the group that DOES negotiate, earn more money, and learn the salary negotiation secrets that they didn&#039;t teach you in college, sign up today.<br>  \t<br>  \t<strong>Also see:</strong><br>  \t<br>  \t  How To Negotiate a New Job Offer (Pro Edition)<br>  \t  How to Negotiate a Raise or Promotion  </p>", 
    "end_date": null, 
    "title": "Salary Negotiation: How to Negotiate a Job Offer (Student)", 
    "price": "25.00", 
    "instructors": "Jim Hopkinson", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/335264_cf18_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-negotiate-salary-for-a-new-job-offer-student-edition/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-04T00:09:53Z"
}