{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Learn the importance of salary negotiation in this entertaining and informative intro course. </strong><br>  \t<br>  \t  Negotiating your salary when going for a new job or a raise is a critical skill to make sure you get paid what you deserve, yet it is a topic that makes most everyone anxious.  </p>\n\n<p>  \t  Before you can master salary negotiation tips and tricks, you first have to be in the right mindset.  </p>\n\n<p>  \t  Using an easy-to-follow storytelling approach -- along with case studies, statistics, and the right amount of humor from Improv-trained actors -- this course will change the way you look at negotiation.<br>  \t<br>  \t<strong>In just 20 minutes you will see:</strong>  </p>\n\n<ul>  \t<li>  Two crucial goals for any negotiation</li>  \t<li>  Case studies of negotiations gone wrong</li>  \t<li>  The new reality for a post-recession economy</li>  \t<li>  What family, friends, and your boss WON'T tell you about negotiation</li>  \t<li>  Negotiation statistics and facts</li>  \t<li>  The HR perspective</li>  \t<li>  The light switch moment of negotiation success</li>  </ul>\n\n<ul>  \t<li>Bonus content: 5 Negotiation Mindset Tips for Your Job Search</li>  </ul>\n\n<p>  \t<strong>Who this course is for:</strong>  </p>\n\n<p>  \t  This course is a crucial introduction for professionals interviewing for a new job, underpaid workers seeking a raise, new college grads -- anyone that is new to negotiation and is ready to learn more and earn what they deserve.<br>  \t<br>  \t<strong>What are recommended next steps?<br>  \t</strong><br>  \t  After getting in the proper mindset, see the following advanced courses for specific tips, tactics, and case studies:  </p>\n\n<ul>  \t<li>Salary Negotiation: How to Negotiate a Raise or Promotion </li>  \t<li>Salary Negotiation: How To Negotiate a Job Offer (Student Edition)</li>  \t<li>Salary Negotiation: How To Negotiate a Job Offer (Pro Edition)</li>  </ul>", 
    "end_date": null, 
    "title": "Salary Negotiation: Learn the Negotiation Mindset", 
    "price": 0, 
    "instructors": "Jim Hopkinson", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44058_9556_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-negotiate-salary-the-negotiation-mindset/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-28T14:37:30Z"
}