{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tA few years back Google did something pretty stunning, surprising every one of their 25,000 employees worldwide by automatically giving them a 10% raise and a $1,000 bonus.  </p>  <p>  \tFor the rest of us, it&#039;s not that easy.  </p>  <p>  \tMost of us feel underpaid and undervalued at work and want to ask for a raise, but are anxious and don&#039;t know how to do it. Or maybe you&#039;ve got a big performance review coming up, and you want a little help to make your case and get paid what you deserve.  </p>  <p>  \tFortunately, there are tips and tricks that you can use to negotiate more money.  </p>  <p>  \tUsing   an easy-to-follow storytelling approach -- along with case studies,   statistics, templates, and the right amount of humor -- this course will change the   way you look at negotiation.<strong style=\"\"><br style=\"\">  \t<br style=\"\">  \tIn this course you will:</strong>  </p>  <ul style=\"\">  \t<li>Gain the specific skills needed to ask for a raise - in one hour</li>  \t<li>Formulate a winning negotiation game plan</li>  \t<li>Find out the best time to ask for a raise</li>  \t<li>Hear tips you can use starting today</li>  \t<li>Understand negotiation statistics and facts</li>  \t<li>Produce a secret weapon to be persuasive and memorable </li>  \t<li>Create a one-of-a-kind document to secure the highest salary range</li>  </ul>  <p>  \t<strong style=\"\">You will also receive 9 digital downloads to:</strong>  </p>  <ul style=\"\">  \t<li>Keep track of your accomplishments</li>  \t<li>Create a digital portfolio to prove your worth</li>  \t<li>Email key contacts to find your true value</li>  \t<li>Present a salary research document to achieve the highest salary </li>  </ul>", 
    "end_date": null, 
    "title": "Salary Negotiation: How to Negotiate a Raise or Promotion", 
    "price": "50.00", 
    "instructors": "Jim Hopkinson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44267_e69e_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-negotiate-salary-negotiating-a-raise-or-promotion/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-01T16:03:28Z"
}