{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This nearly 6-hour program dives deeply into the strategies, techniques and tools you need to create and deliver an effective presentation. You&#039;ll learn how to attract your audience to the presentation with content they won&#039;t be able to resist, and keep them there by subtly revealing to them the underlying emotional reasons they should want it. This program will help you create and deliver core content that is exactly what your audience wants to hear, not an inventory list of what you want to tell them. You&#039;ll learn how to put it into a form that makes it easy for you to deliver, and present it in a way that captures your audience from the moment they sit down.</p>  <p><strong style=\"\">Why Rule the Room?</strong></p><p>Rule the Room is a leading provider of communication solutions to people and organizations everywhere. In every enterprise and all walks of life, communication skills are critical. Your success depends on your ability to persuade, inspire, teach, and motivate others.</p>  <p>Our belief is that good communicators are not born; they&#039;re made. Everyone has the capacity to be a great public speaker when taught the necessary skills. Rule the Room can teach you those skills, which can be applied in every situation, from giving presentations to running a meeting, handling confrontation, and networking with clients. </p><p>But don&#039;t just take our word for it, here&#039;s what other&#039;s had to say:</p><p>&quot;I took away a few things from this presentation. First I took away the hooks, cause I&#039;ve never used hooks before, and second is the intro, and how I&#039;m going to start transitioning from introducing my name to introducing what I do and how I can help the executives or whoever I might be presenting to.&quot;</p><p><strong style=\"\">Jed Ingles - Product Manager, IGT</strong></p><p>&quot;Presentations are critical, whether its at work, or your out of work or with friends or colleagues. And this class whether someone believes they are the greatest presenter or not, finding ways to fine tune that learning process is critical. We never actually achieve becoming the best presenter, we&#039;re always constantly improving and this class has been fantastic in regards to that.&quot;</p><p><strong style=\"\">Ryan Griffin - Director of Product Management, IGT</strong></p><p>&quot;Today&#039;s presentation gave us a recipe and a roadmap. I found that through this class we actually got a recipe book on how to fill in your slides, and help you really be critical about the content you&#039;re actually going to put into the presentation, as well as the blueprint that helps you talk about the specifics on each slide, while being very respectful of your audience&#039;s time.&quot;</p><p><strong style=\"\">IGT Product Manager</strong></p>", 
    "end_date": null, 
    "title": "Sales Bootcamp: Hands-on Sales Presentation Skills", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535540_fff2_4.jpg", 
    "course_url": "https://www.udemy.com/sales-presentation-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T21:25:05Z"
}