{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Join over 1200 students learning techniques for influencing others by listening! </p><p>See why this course is 5-Star rated.</p><p>\"One of the best courses in Udemy. Not like many courses here which contents are easily found freely online by just googling, this one is rare and teaches fundamental lessons. very useful even to experienced marketers.\"Sigit Pratomo</p><p>\"The course walks through concepts that take years to learn, and provides examples and data-driven reasoning to cement the concepts.\" Ed Torquemada</p><p>\"I consider this more than worth the time and money. This class is an investment in my future!\"Caron MacLane</p><p>Hit the Green Button and enroll now.<strong></strong></p><p><strong>You want more influence.</strong> </p><p>You want to sway people. Here's what the world's best sales people, top negotiators, and best closers know that most people don't: listening skills are your secret weapon.</p><p>That's right.<em> </em>And that means two things for you. <em>First, you don't have to develop charisma. </em>You don't have to be slick, or eloquent, or smooth. In fact, today's buyer's are more skeptical of that veneer than ever. <em>And second, if you're talking to sell, you're leaving money on the table.</em></p><p>Here's why: People don't buy for your reasons no matter how prettily you dress them up. They buy for their reasons. And they will gladly tell you what those reasons are. </p><p>But only... If you know how to ask, and you know how to watch and listen for the answers. Sadly, most people don't.</p><p><strong>This course gives you a small, very specialized, set of techniques that few people have</strong> – a questioning strategy that is simple, laser targeted, and disarming; and a powerful model of human behavior that will reveal people's deepest motivations almost instantly.</p><p><strong>This course is for you if you are:</strong></p><ul><li>Looking for a better job or more ore better gigs.</li><li>Trying to close more sales, more quickly and easily, with less stress.</li><li>Trying to land investors for your start up and really want to make a connection.</li><li>Buying a house or car or other big assets and want to land a better deal.</li><li>Negotiating a deal and want to have more power at the negotiating table.</li></ul><p><strong>What sets this course apart?</strong></p><p>This is not just a course of ideas. You will know how to use the techniques. And you'll have practice. We'll not only learn new structures and new techniques, we'll apply them together in real life situations - a high stakes negotiation, a high value sale, trading up from a position of weakness, and leading a set of people who are reluctant and skeptical.  </p><p>What people are saying about Tim Dawes</p><p><strong>What people are saying about Tim Dawes</strong></p><p><em>I used Tim as a career and personal coach a number times over my years at Microsoft. Tim's genuine interest in my work and life and his perceptive second opinion about my behaviors enabled me to tune my management style to realize successes where I had been challenged, and helped make me a more compassionate leader. </em></p><p>- Bill Gallagher, Engineering Director at Attenex</p><p><em>I consider Tim one of a handful of very special people whose training or workshops are a privilege to experience.</em> </p><p>- Alex Wright, US Director, Merriweather Training &amp; Development</p><p><em>Thanks again for a magnificent job at the conference today, it added much energy, life, and room for reflection to the conference. </em></p><p>- Dr. Thomas R. McCormick, Conference Organizer</p>", 
    "end_date": null, 
    "title": "Sales: How to Listen So People Tell You How to Sell Them", 
    "price": "20.00", 
    "instructors": "Tim Dawes", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552770_f69e_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-influence-people-with-listening-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T21:11:54Z"
}