{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>From the creator of the best-selling <strong>Writing With Flair: How To Become An Exceptional Writer</strong>...</em></p>\n\n<p><em><strong>SECRET SAUCE OF GREAT WRITING</strong> IS ONE OF UDEMY'S <strong>MOST POPULAR FREE COURSES with m</strong></em><em><strong>ore than 40,000 students and hundreds of 5-star reviews.</strong></em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"I watched your whole course and was in AWE the whole time... your words are profound...\"</em><strong><em>-- GOLDIE LOPEZ, </em></strong><em><strong>UDEMY STUDENT</strong></em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>\"A little gem of a course...\" <strong>-- FRANS DU PLESSIS</strong></em>, <em><strong>UDEMY STUDENT</strong></em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"The best 30 minutes you will ever spend</em><em>...\" </em><strong><em>-- SHARAN HIREMATH, UDEMY STUDENT</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>\"Packed with the essentials...\"<strong> SONIE SANDHU, UDEMY STUDENT</strong></em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>\"Maximum learning in minimum time...\"</em> <em><strong>-- RAMIN ASSEMI, UDEMY STUDENT</strong></em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Taught me three power insights I will never forget...\" <strong>-- REV. STEVE WRIGHT, UDEMY STUDENT</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"A masterclass... signed up to \"Writing With Flair\" immediately...\" <strong>-- RICHARD GIBBS, UDEMY STUDENT</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>\"Made me realize I need to relearn how to write...\"</em> <strong><em>-- CECYLIA ANDERSON</em></strong><strong><em>, UDEMY STUDENT</em></strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>\"Zeroed in on the first three elements that can take your writing from good (or bad) to awesome...\"</em> <em><strong>-- INDIA STRONGHEART, UDEMY STUDENT</strong></em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>\"Informative, interesting and inspiring...\"</em> <em><strong>-- BILL BEXLEY, UDEMY STUDENT</strong></em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Do you dream of breaking out of a 9-5 job and making your mark on the world by writing an outstanding book or creating a magnificent blog read by thousands—if not millions—of people?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Well then how would you like to write with the style and flair of top journalists on newspapers like The Wall Street Journal and The Economist?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>How would you like to learn to craft sentences with impeccable style and flair from an editor who teaches some of the world's best journalists how to write better?</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                        Here's your chance to quickly learn how to superpower your business writing--cover letters, press releases, marketing copy and sales emails, and to make your blogs appear a thousand times more professional. In about 30 minutes, you'll have learned a new way of thinking about your writing that puts you way ahead of the competition.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>Join the many thousands of students who are already discovering my basic framework for writing well that many say has been a game-changer.</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                   If you think you're ready to dive into the full suite of principles just go straight to my course <strong>WRITING WITH FLAIR: How To Become An Exceptional Writer</strong>. Otherwise, this is a great starting point for your journey into elite writing.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                      Maybe you've always felt your writing was too mediocre to get noticed or make an impact.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                              Well, here's the antidote. This course reveals the basic tactics of editors and writers on world-class newspapers and magazines.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                      You'll find a magic formula for supercharging your writing very quickly.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                \"Most great teachers can't write, and most great writers can't teach. Shani Raja is one of the few who excels at both. I managed dozens of reporters and editors during my 12-year career at Bloomberg News. Now he's the person I go to when I want help with my writing.\" <strong>NICOLAS JOHNSON, FORMER BLOOMBERG AND GLOBE AND MAIL EDITOR, AND POLITICAL CANDIDATE FOR PARLIAMENT OF ONTARIO, CANADA.  </strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                \"As a young reporter my prose might have been robotic and jargon-laden if not for Shani's watchful eye and attention to the elusive human interest behind ostensibly technical stories. Beyond the standard (yet crucial) reporting skills--like accuracy, clarity and integrity--I also learned refinement, how to withstand impulses toward glibness and cynicism that can naturally set in when oft revisiting the same beat. Shani will teach you how to write well, and with grace.\" <strong>HAWA ALLAN, JOURNALIST AND FICTION WRITER.  </strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                               It's undeniable: great writing gives you a massive competitive edge in today's marketplace--whatever your profession.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                This is an introductory course that will give you a powerful new framework for viewing your writing. It is the basis of a unique writing system designed to massively enhance your skills in as little as a few weeks.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                 If you take this course you'll get a set of concise videos introducing the system... <strong>PLUS NOW</strong>, a professionally designed ebook to reinforce the lessons.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                  The course reveals information that will have an immediate impact on the quality of your prose. In just a few moments you'll discover the secret sauce of great writing:  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol>  \t<li>Simplicity</li>  \t<li>Clarity</li>  \t<li>Elegance </li>  </ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                         You'll find that when you incorporate these principles into your writing there'll be a seismic shift in the power of your words--whether your intention is to inform, persuade or simply entertain.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                         Unlike other courses this one doesn't focus on the technicals but on the powerful principles that will quickly empower your writing.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                         It offers a fascinating insight into how to incorporate these three game-changing concepts into your reports, essays, cover letters and other types of writing to make your words dance and sentences sing, so that your work shines out from the crowd.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                         How many promotions have you missed because your report-writing skills or sales emails are simply too lackluster?  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                         How many job interviews have you lost because your cover letter and CV don't hit home?  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                         How many customers have you turned off because the words on your website are dull and uninspiring?  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                                                                         You can't afford not to take this course--your first step into the wondrous world of elite writing.  </p>", 
    "end_date": null, 
    "title": "Secret Sauce of Great Writing", 
    "price": 0, 
    "instructors": "Shani Raja", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/171838_ae1b_4.jpg", 
    "course_url": "https://www.udemy.com/secret-sauce-of-great-writing/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-24T09:56:16Z"
}