{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>So, you want to self-publish your eBook?</strong></p><p>Well, you are certainly not alone.</p><p>A YouGov poll published last year showed that <em>the most desirable job in the United Kingdom</em> was that of an author. In fact, 60% of the people polled stated that they’d like to write for a living. And thanks to the developments within the self publishing industry in recent years, there has probably never been a better time to turn this dream into a reality.</p><p><strong>But is self-publishing the right choice for you?</strong></p><p>In this course, I shall attempt to help you answer this extremely important question, by first asking a series of other questions, such as:</p><ul><li>Why do you want to self-publish a book?</li><li>What type of books are you going to write?</li><li>And are you able to write an interconnected series of books?</li></ul><p><br><strong><em>Self-publish Your eBook</em></strong><em></em> then considers such concepts as perma free books, lead magnets and the willingness to give away high value content to your readers totally FREE of charge.</p><p><strong>How much is it going to cost?</strong></p><p>Finally, the course looks at the financial costs involved in self-publishing and identifies the <strong><em>4 Key Financial Investments</em></strong> that every self-published author should make, in order to give yourself the best possible chance of success.</p><p><strong>The must-have course for all aspiring self-published authors</strong></p><p>If you are thinking about self-publishing a book, or are even considering a part-time career as a self-published author, then the <strong><em>Self-publish Your eBook</em></strong><em></em> course is most definitely for you!</p><p>Be sure to check out the <strong><em>FREE preview videos</em></strong> within the course curriculum below and I look forward to seeing you on the inside.</p>", 
    "end_date": null, 
    "title": "Self-Publish Your eBook?", 
    "price": "25.00", 
    "instructors": "David James Ault", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/723280_82de_3.jpg", 
    "course_url": "https://www.udemy.com/self-publish-an-ebook/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T22:57:15Z"
}