{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>As you analyze each word of this document you will shortly feel a sense of excitement at the possibility of actually accomplishing your goal of becoming a writer. Until this very moment, you've likely dreamed of that magic pill, that if taken would turn you into a romance writer overnight.</p>\n\n<p><strong>THIS can be your magic pill.</strong></p>\n\n\n\n<p>Now, I would like to help you experience the satisfaction of having your very own romance story.</p>\n\n\n\n<p><strong>Introducing Short Story Outlines - Romance Book 1...</strong></p>\n\n\n\n<p>A seven scene romance guide designed to aid you in the creation of a perfectly formulated romance plot.</p>\n\n\n\n<p><strong>Short Story Outlines - Romance is a one of a kind program</strong> that removes the years of study required to fully understand story plot and character creation by completing the work for you, leaving you to input your own plot idea, characters, and setting to make a truly unique story.</p>\n\n\n\n<p><strong>Did you know that most storylines on the market today are old plots rehashed by new authors?</strong></p>\n\n\n\n<p>It's true. There are few original ideas these days, because there doesn't have to be.</p>\n\n\n\n<p>Why struggle having to create a romance plot from scratch, when all you have to do is follow a proven romance outline, and drop in your own plot, characters, and setting?</p>\n\n\n\n<p>Short Story Outlines - Romance is a shell to the perfect romance story. All it needs to become a best seller, is your idea, your unique characters, and your ideal setting.</p>\n\n\n\n<p>No two stories are a like, just as no two writer's are alike.</p>\n\n\n\n<p><strong>And to prove this is possible, we'll supply you with the following tools:</strong></p>\n\n\n\n<p><strong>A complete 6 scene short story.</strong></p>\n\n\n\n<ul><li>No longer do you have to try and come up with an actual plot that works! This plot will work for anyone, just drop in your characters, setting, and your own creativity and you're all set!</li></ul>\n\n\n\n<p><strong>Plot Checklist Worksheet</strong></p>\n\n\n\n<ul><li>Want to get an overall picture of the entire plot? No problem, you'll receive the plot checklist worksheet that provides you a big picture of how the story progresses.</li></ul>\n\n\n\n<p><strong>Scene Development Worksheet</strong></p>\n\n\n\n<ul><li>Concerned you don't have the knowledge to properly understand how to construct a scene? Don't be. With this scene development worksheet, all you have to do is read the story prompts and fill in the blanks with your own story idea. It's easy!</li></ul>\n\n\n\n<p><strong>Character Trait Worksheet</strong></p>\n\n\n\n<ul><li>Wondering how to create believable characters? It's really not that tough, and this characters trait worksheet explains how each of your characters play a certain role in your story. Just read the role and keep your character true to the trait, and you're off and running!</li></ul>\n\n\n\n<p><strong>6 Share Your Work Sections</strong></p>\n\n\n\n<ul><li>Never run short of inspiration or motivation with a powerful group of writers just like yourself behind you. In this class, we encourage you to introduce yourself to the group and to share your experiences, struggles, and successes as you progress through each scene. You'll get your best idea's from other students!</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p>Still wondering if it's possible?</p>\n\n\n\n<p><strong>Below is a short list of what my students have said about my plot outlines:</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>Thank you</strong> (5 stars) 1 year ago.</p>\n\n\n\n<ul><li>A detailed course, that is easy to follow. The outline detailed is comprehensive and adaptable.</li></ul>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>Good Outline Help</strong> (5 stars) 2 years ago.</p>\n\n\n\n<ul><li>I like the way all the information as kept generic. he called characters by their functions (like protagonist, Emotion, Reason). This allowed me to think in terms of my characters without any biasing or cooling of characters he may have used. With a few tweaks, I actually think this plot will help me with an adventure novel I’m writing.If Michael comes up with another outline for another genre, I will sign up.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Takes the Mystery Out, to Put the Mystery In</strong> (5 stars) 4 months ago</p>\n\n\n\n<ul><li>Michael hands us a template where much of the complexity is reduced so that I can focus on the more personal stuff of my story. I can plug in my characters and have a good idea where they need to go…</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Excellent, practical course. </strong>(5 stars) 4 months ago</p>\n\n\n\n<ul><li>I have written and published several non-fiction and children’s books. Now I am writing scripts and fiction. This course is a deep dive into how to outline your fiction story from beginning to end. I heartily recommend it!</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Low Introductory Price! Only $19!</strong></p>\n\n\n\n<p>This price won't last long! Soon this course will climb to it's regular price of $297.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Bonuses:</strong></p>\n\n\n\n<p>Order this month and I’ll also include a free review of your ENTIRE Romance idea PRIOR to beginning the course to help you get the most of the outline. Just jot down your basic ideas with some questions you may have as you begin the course, and I'll respond with my own thoughts on how I would proceed if I were you.</p>\n\n\n\n<p>I'll also include a free review of your ENTIRE Romance outline upon completion of the course. I'll read your outline and give you my own personal thoughts on where you might need some additional detail, or information to make the actually writing of your story easier.</p>\n\n\n\n<p><strong>With a 30 day money back guarantee, you know you must be satisfied or you'll get all your money back.</strong></p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p>Mike Dickson</p>\n\n\n\n<p>P.S. As this page nears the bottom, there's never been a better and least expensive time to become a romance writer. Order this course now.</p>", 
    "end_date": null, 
    "title": "Short Story Outlines - Romance Book 1", 
    "price": "50.00", 
    "instructors": "Mike Dickson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636084_421a_3.jpg", 
    "course_url": "https://www.udemy.com/short-story-romance-1/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T18:34:29Z"
}