{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to short story outlines-romance book III. </p><p>If you're previewing this course and anticipating or deciding whether or not this course is for you, I’m glad you've taken the time to read this summary.</p>\n\n<p>\n</p>\n\n\n\n<p>Short story outlines-romance book III is the third course in a three-part series where new and existing authors learn to comprehensively outline a short story romance series.</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>Although this course can stand on its own, if you have not taken the first course in this series titled short story formula-romance book I, and you intend on writing a short story romance then I highly recommend you DO NOT take this course, but take the first course in the series.</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>The purpose of this course is for existing students of the short story formula-romance book I and book II course to continue their series. Students of the first two courses have received a significant discount to enroll in this course and if they choose to continue will receive a significant discount for the final course and book 3 in the short story formula-romance series. So, if you're interested in writing a short story romance, please enroll in the first course of this series.</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>Writing a short story romance is not the most difficult writing there is. But, creating a comprehensive outline including the perfect story arc, characters, plot, and setting can be for new and inexperienced authors.</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>If you're serious about becoming a published author and if you're serious about being a writer then you need to take the creation phase of your story seriously. It involves study and research into the elements of a properly constructed story. </p>\n\n\n\n<p>\n</p>\n\n\n\n<p>This course enables new ending inexperienced writers to accelerate through that study and research phase to the point where very little of it is necessary. </p>\n\n\n\n<p>\n</p>\n\n\n\n<p>In this course you'll take your existing romance story idea along with your characters and your setting and drop it into a properly constructed story arc that includes all the proper elements of character introduction, character growth, setting, and a complete story arch used by best-selling romance authors today.</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>Because you're using your own characters, setting and your own creative mind, no two stories will be alike upon completion of this course. The only similarities between your completed story and another students completed story will be they both have all the elements required to make their stories complete for your readership. That's it. Beyond that, every story is completely different and unrecognizable from another.</p>\n\n\n\n<p>\n</p>\n\n\n\n<p>So if you're ready to take that step. If you're ready to become a serious author who is looking to make a name for themselves but you don't have the time to study every element of story structure, character development, setting, and plot, then this course is for you. You have nothing to lose with a 100% satisfaction guarantee. </p><p>Take this course in its entirety and finish with a completed comprehensive short story romance outline, or ask for a refund no questions asked.</p><p> </p>", 
    "end_date": null, 
    "title": "Short Story Outlines - Romance Book 3", 
    "price": "25.00", 
    "instructors": "Mike Dickson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658452_4a2b_2.jpg", 
    "course_url": "https://www.udemy.com/short-story-outlines-romance-3/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T02:31:41Z"
}