{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Important - This is the second course in a three part series. If you have not taken Short Story Outlines - Romance Book I, do not start here. Go to Short Story Outlines - Romance Book I.</strong></p><p>Discover The Bizarre Method To Outline A Romance Short Story In Only 1 Week Without Years of Study Or Previous Experience Or Even Any Experience As A Writer! </p><p>This Course Reveals The Closely Guarded Hollywood Secret To Writing Already Proven Storylines In Just Days! </p><p>Is It An Unfair Advantage? One Trick Let’s You Skip Years of Study and Hard Word Developing Your Own Storyline In Just Days - Experts Say This Shouldn’t Work, But It Does! </p><p>In The Next 5 Minutes I’ll Shatter The Biggest Lies In Fiction Writing, And Show You How To Use The Same Kind of Outlines Authors Use To Get A Jump Start On Their Stories, And Use Them Over and Over Again!</p><p>Since I discovered this secret in August 2013, I’ve shown over 1200 writers how to do the same thing. As this gets out, I’ve shown 400 more writers in the last 4 months. That’s 1600+ writers in only three years!</p><p>I know you’re skeptical, and you should be. But these results speak for themselves - I really did teach 1600 students this trick in the last three years. </p><p>Not only have I taught 1600 students in three years - I’ve helped hundred more people in person. </p><p>Back in 2007 I was in your exact position. More than anything in the world I wanted become a writer. But I struggled to develop the proper story structure and characters. </p><p>I felt stuck and overwhelmed. I doubted I’d ever understand how writers and Hollywood screen writers turned out so many scripts each year. I was on the verge of giving up, and giving in. </p><p>I only started seeing results once I realized I’d been tricked by the biggest lie in Hollywood. A lie that kept me from writing a dozen stories each year since then. Once you’ve fallen into it’s trap, it becomes difficult if not impossible to ever understand how it’s done! </p><p>After my breakthrough writing short stories was suddenly easy. I stopped struggling with story structure, and I began writing complete stories in weeks not years. I’ve never been happier. </p><p><br>\n<strong>Now I want to help you experience the breakthrough like I did. </strong></p><p><br>\nIf you don’t figure out this well hidden secret, you’ll struggle to become a published author. Even worse, you’ll be in danger of quitting before you even finish one draft!</p><p>I’ve seen what happens when people keep struggle and fail to complete a simple draft. It’s ugly, and I don’t want you to suffer that fate. </p><p>What happens if you do nothing? You’ll continue on the same learning path as you are today. Not just today, but tomorrow and next month and next year. You may never accomplish your goal of becoming a writer. </p><p>Everyone KNOWS it’s just hard work and luck to become a great writer. The problem? Everyone is dead wrong. The hidden truth is that the successful authors and writers KNOW it’s much easier than hard work and luck! Once I’d discovered that secret, I was able to turn out outlines in weeks over ad over and I’ve never looked back. </p><p>The biggest names in writing and in particular, Hollywood don’t want you to know how to turn out stories in days. When I finally figured it out I finished a story in 6 days that I had been working on for three months. Now my life is completely different - before I would sit and write all day with very little to show for it, now I use this secret and work for less than an hour each day and accomplish 10x more than before.</p><p>You won’t believe this. It’ll make you angry. It’ll piss you off. But the truth is that you don’t have to know much about story structure to do this. The sooner you get comfortable with it the better, because learning this secret is the key to publishing several short stories this year. </p><p><em><strong>Testimonials from ACTUAL students:</strong></em></p><p><em>“</em><em>I have written and published several non-fiction and children's books. Now I am writing scripts and fiction. This course is a deep dive into how to outline your fiction story from beginning to end. I heartily recommend it!”</em></p><p><em></em><br></p><p><em>“Mike Dickson hands us a template where much of the complexity is reduced so that I can focus on the more personal stuff of my story. I can plug in my characters and have a good idea where they need to go, thus helping me to keep from going off the rails, as it were. Whether for the A Story or B Story within the novel, this can be woven into any number of genres. Now it's time for me to start writing! Thanks for the welcome push in the right direction!”</em><br><em></em></p><p><em></em></p><p><em><br></em></p><p><em>“Exactly what I am looking for. This is a goldmine for new writers. Thank You!”</em><br><em></em></p><p><em></em></p><p><em></em></p><p><br></p><p>Introducing, the closely guarded secret that Hollywood screen writers and fiction authors used to turn out outline after outline in weeks, not years. No one outside the inner circle believe this was possible. </p><p><strong>Short Story Outlines - Romance Book II</strong></p><p>If you don’t outline a complete and flawless Romance short story by the end of this two hour course, I’ll refund 100% of your money no questions asked. </p><p>Stop wasting your time studying story structure for now. Click the button to buy this course now and have a finished short story romance outline in one week!</p>", 
    "end_date": null, 
    "title": "Short Story Outlines - Romance Book 2", 
    "price": "30.00", 
    "instructors": "Mike Dickson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658450_e85d_2.jpg", 
    "course_url": "https://www.udemy.com/short-story-romance-2/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T02:29:44Z"
}