{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you ready to take your start-up idea or small business to the next level?</strong><strong></strong></p><ul><li>Do you sometimes feel lost in a maze with your business?</li><li>Are you just not sure how to grow your traffic to get more clients and customers?</li><li>Do you often feel demotivated and not clear on your objectives?</li><li>Do you struggle with organization and sometimes end the day feeling like you haven't achieved enough?</li></ul><p>If you said yes to any of the above then you are in the right place. It's time to take control and map out a clear path for your business.</p><p><strong>Who Is This Course For?</strong></p><p>Anyone who runs a small business whether online or brick and mortar. It doesn't matter whether you run a handmade or creative business, are a pet sitter, restaurant owner, accountant, florist or anything in between. The key is you want to develop the marketing for your business and in the process grow your potential audience.</p><p><strong>Why Am I Teaching This Course?</strong></p><p>Because 5 years ago I was in the same place you are now. I was at the start of building my business and I had to design my blogs and grow traffic to them from scratch. I was also disorganized and inconsistent when it came to blogging, marketing and building a newsletter.</p><p>Unfortunately I didn't have a network around me and I would have loved someone to show me all the steps I needed to take whilst surrounded by people who were also growing their businesses.</p><p>However through a great deal of trial and error I learned all the steps necessary to bring me to the place I am now. A place where 3 years ago I was able to walk away from a corporate HR position to take my business full time. If you join me in the 'Small Business Incubator' that trial and error will be removed for you and that's why I want to share what I've learned.</p><p>I trained as a teacher, worked for 16 years as an HR Manager and I have grown my own business from scratch. I feel very fortunate because the skills and experience I learned from all three of those things now allow me to do what I love - work with individuals and small groups of people to help them make their businesses thrive.  </p><strong></strong>", 
    "end_date": null, 
    "title": "Small Business Incubator", 
    "price": "20.00", 
    "instructors": "Alison Wood", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677594_4c2a.jpg", 
    "course_url": "https://www.udemy.com/small-business-incubator/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-22T22:07:25Z"
}