{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>How are American companies getting the most out of social media? Learn the three main categories to get the most out of social networks, without investing extra money into advertising. The categories covered include: Marketing and advertising, relationships, and recruitment.</p><p>Businesses who use social media to its fullest potential have shifted their marketing and advertising strategies to include communicating with customers and the nurturing of relationships built online. Smart companies have moved to a two-way dialog communication model to gain trust and top-of-mind status with the people they do business with. You will learn how unpaid techniques should revolve around building relationships and how to leverage social media's inherent \"always on\" benefits to communicate timely information; to both your current and potential customers. Furthermore, your presence on social media speaks volumes to those who would like to work for your company, so you will also take away learnings on using social media as a recruitment and Human Resource (HR) tool.</p> This course contains almost 40 total minutes of presentation-styled video, with five lectures containing examples and top tips. Easy to follow, and spit into logical segments, anyone who would like to learn how businesses successfully use the free aspects of social media should take this course.", 
    "end_date": null, 
    "title": "Social Media for Business: Top 3 Categories of Use", 
    "price": "20.00", 
    "instructors": "Michael DeBoer", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572938_8b00.jpg", 
    "course_url": "https://www.udemy.com/social-media-for-business-top-3-categories-of-use/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T23:39:38Z"
}