{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Most American businesses are using at least one social media network to promote their company; sometimes as many as four or five. But before you expand your social media usage, or begin to start promoting a company on social media, there are some important things to consider. </p><p>This course will present you with the honest pros and cons of using social media in the business setting. While there are many good reasons to use networks such as Facebook, Twitter, Instagram, Linkedin, Pinterest and more, there are also negative side effects to be aware of; and only with a true understanding of all things good and bad about social media usage can you be ready for what is ahead. </p><p>You’ll learn why using social media networks are a great idea and how far we’ve come in using digital communications to advertise companies, as well as how to deal with negative comments and new time management techniques.</p>    <p>It is also vital to evaluate your situation and plan how your company can get the most out of social media. This course will guide you through four key areas of planning: </p>  <ol><li>Placement</li><li>Evaluation</li><li>Competition</li><li>Content</li></ol>        <p>In these four areas you’ll learn how to plan for the best free use of social media and how companies in the United States benchmark where they stand in the social marketplace. </p>    <p>Furthermore, the most important aspect of successful use of social media is covered: Content. Because social media channels must be fed constantly to appear active and credible, companies must always be planning interesting content to share. You’ll be provided with sample content types to keep your channels fresh and shareworthy enough so followers help you by re-posting, re-tweeting and spreading your content for you.</p>    The popularization of “smart” devices has allowed social media to rapidly become part of our worldwide culture. Today, a company’s involvement in social media places them directly in front of target markets on any connected device – anywhere, at any time. By using the practical knowledge this course presents, you can be sure your efforts on social media will be worth the time you invest, and the company you represent will be presented in the best light possible.", 
    "end_date": null, 
    "title": "Social Media for Business: Pros, Cons, and Your Potential", 
    "price": "35.00", 
    "instructors": "Michael DeBoer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559620_4fc3_2.jpg", 
    "course_url": "https://www.udemy.com/social-media-for-business-pros-cons-and-your-potential/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T17:42:11Z"
}