{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Imagine this:  </p>  <ul style=\"\">  \t<li style=\"\">Charming everyone at that networking event</li>  \t<li style=\"\">Speaking up at the staff meeting to share your Big Idea (which everyone loves, by the way)</li>  \t<li style=\"\">Chatting (effortlessly!) with your boss at the water cooler</li>  \t<li style=\"\">Actually enjoying the prospect of a blind date - you know he&#039;ll think you&#039;re hilarious</li>  \t<li style=\"\">Meeting your girlfriend&#039;s family and (obviously) befriending all of them</li>  \t<li style=\"\">Returning happy from big events - not exhausted or worrying about the impression you made</li>  </ul>  <p>  \t<strong style=\"\">I</strong><strong style=\"\">t&#039;s totally, 100% possible.</strong></p>  <p>  \t  Feeling confident + comfortable in big groups, speaking up + being heard, hitting it off with people you just met - these aren&#039;t experiences that are reserved for special people. Anybody (yes, really - anybody) can learn to do these things. <strong style=\"\">Being able to speak with confidence is a skill that translates to absolutely every aspect of your life </strong>- making presentations to your team, networking at professional conferences, big family holidays, dating, interviewing for new jobs. How you feel and speak about yourself directly affects your career, your personal life, and your self-esteem.  </p>  <p>  \t  This course teaches you simple techniques and easy adjustments that (slowly, gradually) lead to big results.  If you&#039;ve tried Toastmasters (too public) or books (too boring) this course is for you. With fun, engaging videos, you can learn at your own pace, on your own time, in your own home - and review whenever you need a refresher or a pep talk.  </p>  <p>  \t  <strong style=\"\">You&#039;re fantastic. I know it and I&#039;m pretty sure you know it. I invite you to step up and claim the things you deserve</strong> - the promotions, the new clients, the fun friends. You can start here.  Enroll now!  I can&#039;t wait to meet you.  </p>", 
    "end_date": null, 
    "title": "Speak Up! Stand Out and be HAPPY", 
    "price": "20.00", 
    "instructors": "Alexa Fischer", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8849_cc40_15.jpg", 
    "course_url": "https://www.udemy.com/speak-up/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-07-29T23:51:41Z"
}