{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>***Updated For <em>June </em>2016***</strong></em><br><strong></strong></p>\n\n<p><strong>If you are looking to take your public speaking delivery to the next level, then you must take this course. If you want to \"wow\" an audience with your speaking, then you must take this course. If you are looking to get a standing ovation for your incredibly speaking skills, then you must take this course! <br></strong></p>\n\n\n\n\n\n<p><strong> </strong></p>\n\n\n\n\n\n<p>This is not a course on how you can structure your speech or how you can write the best speech. I believe you already know how to write a speech. This course is about delivery! It is about how you can say your message in the most effective way possible. <br></p>\n\n\n\n\n\n<p><strong>Guarantee: By the end of this course you will have the ability to become a captivating speaker and get regular standing ovations. </strong></p>\n\n\n\n\n\n<p><strong>Why Learn From Me</strong><br>Public speaking is the one topic where I have spent most of my life trying to achieve the closest thing to perfect mastery. I have spoken at events such as Fail Forward, Tedx and numerous televised sporting events. I almost put my entirely life into mastering the secrets of what makes an effective speaker. This course contains only the techniques and guidelines that I have used and still use to this very day. I am not giving you some theory from a book. I will only teach you the things that are working right now! <br></p>\n\n\n\n\n\n<p><strong>FREE BONUS: Warm-Up Exercises Before Speaking</strong><br>As an additional\nbonus for taking this course you will also receive my warm up routine that I do whenever I have any speaking engagement. The most important tool for a speaker is their voice and in this bonus section I will teach you exactly how you can make the most out of it.</p>\n\n\n\n\n\n<p><strong>Zero Risk</strong><br>There is a 30 day\nmoney back guarantee so you literally have no risk in taking this course.\nSeriously, the 30 refund is even automatic so there is no hassle on your end.\nIf this course sounds like it is for you then give it a go. </p>\n\n\n\n\n\n<p><em>\"We can not solve our problems with the same\nlevel of thinking that created them” </em>- Albert Einstein</p>\n\n\n\n\n\n<p>I will see you\ninside once you are ready to truly captivate your audience!<br></p>\n\n\n\n\n\n<p><strong>Ben</strong></p>", 
    "end_date": null, 
    "title": "Speaking Mastery: Become A Captivating Speaker Immediately!", 
    "price": "25.00", 
    "instructors": "Benjamin Hero", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646540_0040.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-courses/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T07:36:44Z"
}