{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><span>Imagine yourself in front of a crowd and the audience is sitting on the edge of their seats, listening to ever detail of your story. You can become a master storyteller.</span></p><p>  \t<span>How to Tell Stories</span>  </p>  <p>  \tIn this \"How to Tell Stories\" course you will learn all the necessary elements of selecting, developing and telling stories when delivering speeches, presentations and other business-related talks. All human beings tell stories, but many people find it difficult to tell stories in business settings or in so-called formal speaking situations. This course will help de-mystify the process so that you can incorporate relevant stories into all of your presentations. Great speakers understand that stories are not extras when it comes to a public speech. Stories are what audiences are most likely to remember after the speaker is finished, therefore creating, crafting and delivering great stories that communicate a message are the most important things a good speaker can do.  </p>  <p>  \tFor the last thirty years, TJ Walker has been  a master presentation coach who has taught top executives all over the world how to create and deliver stories  </p><p>Enroll in this course today.</p><p>Course updated on July 29, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p>TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p>What others say:</p><p>“TJ Walker's single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.\" <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p>“TJ Walker is the leading media trainer in the world.\" <em style=\"\">Stu Miller, Viacom News Producer</em></p><p>(TJ Walker's Media Training Worldwide) “The world's leading presentation and media training firm.\"<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Storytelling: You Can learn to Tell Stories Effectively", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348342_a6b9_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-tell-stories/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T20:24:20Z"
}