{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong>Have you received a call for a job interview? That is awesome! Do you have a performance or salary review coming up soon? You need this course to learn advanced strategic salary negotiation techniques.<br></p><p>This course has been created based on discussions with employers (including multi-million dollar firms and even billion dollar companies) </p><p>The feedback received has been mostly the same - employees and prospective employees flake out when it comes to salary negotiation. Hiring managers see this as a sign of being somewhat of a pushover.</p><p>Now is the time to learn salary negotiation so you can get a better salary in a new job or even confidently ask for a salary raise in your current role.</p><p>You are about to learn:</p><ul><li>Why you need to interview the prospective employer and how to master your emotions</li><li>Salary Negotiation techniques to make you thousands of extra dollars</li></ul><ul><li>Why it's not your fault you have not learnt Salary Negotiation</li><li>That the changing world we live in creates amazing opportunities for salary negotiation</li><li>Why Salary Negotiation is a game designed for you to fail if you are not prepared</li></ul><p>Take this course now and finally master the art of Salary Negotiation. Included is a 15 minute case study of how I increased my salary by 34.5% in my very first job and in my first year!</p>", 
    "end_date": null, 
    "title": "Strategic Salary Negotiation - Salary Bargaining Power", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638836_d00f_2.jpg", 
    "course_url": "https://www.udemy.com/strategic-salary-negotiation/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T02:53:10Z"
}