{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<strong></strong><strong></strong><strong></strong><strong></strong><p>  \t   &lt;?xml:namespace prefix = o ns = \"urn:schemas-microsoft-com:office:office\" /&gt;</p><p><strong>A Step By Step Guidance For Shy People!! : The Tips, Tactics And Tools A Shy Public Speaker Should Apply To Avoid A Disaster At The Moment Of His Speech </strong></p>  <p>Over 600+ students enrolled!!</p>  <p>What my students are saying about the course:</p>  <ul><ul><li>The course is very informative and has       useful techniques Jose Acosta</li><li>Great techniques .This course has       interesting lectures that take you step by step through a process to actually       eliminate fear of public speaking. If you have this problem, I highly       recommend it Sjh0467@gmail.com</li><li>It was excellent! The lectures were       delivered in very comfortable speed. It was very practical and one can       practice them Thank you Sir! Saroj Kumar Datta</li><li>This course is excellent! I am only on       the third lecture and I am finding immense benefit from the lessons and       exercises taught! Donald Nunez</li></ul></ul>    <p><br></p><p>Have you got <strong>butterflies</strong> in the stomach when approaching an attractive person you want to get to know?</p>  <p>Are you having <strong>nerves</strong> when applying for an important job interview? Or the final oral exam in front of a jury?</p>  <p>Do you feel <strong>uneasy</strong> when delivering a speech to an audience?</p>  <p>If you’ve answered “<strong>Yes</strong>” to at least one of these questions, <strong>don’t worry anymore!</strong> <strong>You’re not alone but most probably a shy person. A person lacking only of self confidence…</strong></p>  <p>But you must realize that not fixing this problem could lead you to a potential disaster both in your professional or your personal life.<strong> </strong><br> <br> </p>  <p>In fact almost everyone experiences or has experienced shyness or fear to speak in public. I did it too.</p>  <p>I have been where you are today and I had to train myself for a long time. Before I trained French people in my turn. To help them to remove their shyness, their fear of public speaking. </p>  <p>Today I want to help you to do the same. <strong>Step by step…</strong> And of course, you can do it too! </p>  <p><strong>With fast results:</strong></p>  <ul><li>Within a short few days, you'll remove      the greatest part of your fear when public speaking</li><li>Within a week, you'll boost your self      confidence</li><li>Within just 2 weeks, you'll skyrocket      your public speaking skills!</li></ul>  <p>Upon successful completion of this course, you'll be able to:</p>  <ul><ol><li>Overcome your fear of public speaking</li><li>Have less shyness , less anxiety to speak       up</li><li>Improve your self       confidence</li><li>Get to talk to every person you want to       know</li><li>Have better       communication skills</li><li>Improve your empathy       with people</li><li>Have a better connection with them</li></ol></ul>  <p><strong>I’ll</strong> <strong>share with you all the best tips and tactics</strong> I have implemented for my French trainees for years. I'll give you public speaking <strong>tools</strong> and <strong>methods</strong>, some unheard-of, and help you become a more successful public speaker. Help you to do the same as my French attendees do. <strong>And achieve fast results</strong>. <strong>Many others have done it</strong> <strong>.You can do it too!</strong> </p>  <p>Of course, you'll never struggle alone, because <strong>I’m here to help!</strong> You can contact me direct or open a discussion in the dashboard on the right-hand side of the course. I’ll reply ASAP.</p>  <p>On top of that, Udemy offers <strong>A</strong> <strong>30 Day Money Back Guarantee</strong>. A totally unconditional guarantee. So you can try this course with no risk at all !</p>  <p>You can try this course, learn amazing public speaking tips and techniques and if you don’t like it, get a refund within 30 days. Absolutely no questions asked. You have nothing to loose. You can only <strong>gain public speaking skills</strong>.</p>  <p>So are you ready to get these results right away?</p>  <p>Well, don’t wait anymore and <strong>act now</strong> by <strong>clicking on the enroll button</strong> so we can start working together.</p>  See you <strong>today </strong>on the other side!!<strong></strong>  <p>Pierre </p><strong></strong><strong></strong><p>  \t  &lt;/span&gt;  &lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "Successful And Effective Public Speaking For Shy People ", 
    "price": "20.00", 
    "instructors": "Pierre Barbier", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/78470_f85b_8.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-get-rid-of-your-fear-a-how-to-course/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-14T08:45:58Z"
}