{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Does presenting at work freak you out?</strong></p><p><strong>Do you want to hide under your desk when you have to speak publicly? </strong><strong>Are you breaking out in hives right now just thinking about it?</strong></p><p>Most people are anxious about speaking because they are trying to do something that doesn't feel normally or natural... they think it's outside their comfort zone. </p><p><strong>You already have the innate ability to be a powerful presenter!</strong></p><p>You are already 80% there without even knowing it... and that the extra 20% you need to learn so you're comfortable, relaxed and calm in front of the room can be learned in about 2 hours.</p><p>Many people get hung up on the idea of presenting... and it hold them back. Studies show 75% of people are more afraid of public speaking than of dying... that's right <em>OF DYING</em>! But that doesn't have to be you once you understand how to use your own story telling skills to make presenting easy.</p><p><strong>What kind of difference would THAT make in your career? Would that help you get promoted? Could you be more effective, get more done and feel better about doing it? Not to mention you can stop losing sleep when you have to get up to present?</strong><br></p><p>In order to get you that last 20% I created the <strong>\"Comfortable Presenting Made Easy\"</strong> course. I just updated the course with all new video lessons, and new interactive pdf form worksheets. So you can fill them out from within the course itself.</p><p>I want to make it easy for you to learn to present comfortably, naturally and powerfully. <br></p><p><strong>Just click the button above to Enroll Today!<br></strong></p><p>In this course you will learn a step-by-step method to create and deliver a course that is comfortable... because it is based on story telling skills we all possess. Don't think so? <strong>You already tell people stories every day... in this course I teach you how to take that and use it when you're presenting to a group.</strong> </p><p>It's not hard once you know how. No mystery. No gimmicks. No NLP, Jedi mind tricks or \"affirmations\" to fool yourself. Just time tested, proven techniques on how to use the power of story to create and deliver a presentation easily and comfortably. You will learn to use your own style to your advantage... so you can be yourself and give a dynamic, interesting talk... that's fun for you and interesting to your audience.</p><p><strong>Stop worrying about what to say. You'll KNOW what you're going to say will be interesting, and engaging to your audience... no matter who they are.</strong></p><p>If you have any questions at all please feel free to message me here on Udemy.<br></p><p><strong>Thank you for the opportunity to help you be more successful!<br></strong></p><p>Eric</p><p><strong>P.S. Imagine the next time you have to present at work... and you NAIL IT while you're cool as a cucumber... and everyone asks you \"where did you learn how to do that?\" Enroll today! </strong></p>", 
    "end_date": null, 
    "title": "Take Panic Out of Presenting with Simple Story Skills", 
    "price": "35.00", 
    "instructors": "Eric Byrd", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23926_cceb_7.jpg", 
    "course_url": "https://www.udemy.com/pitch-for-success-using-story-in-presentations/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-30T23:27:39Z"
}