{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t        Welcome to the business course “Bull’s Eye: Target Your Audience With Confidence.”  </p>  <p style=\"\">  \t        Do you want to break through communication barriers within your organization? Then this is the course for you. It will help you build your communications skills, stand out at work, and transform the way you look at the audiences inside your company.  </p>  <p style=\"\">  \t<strong style=\"\">Topics</strong>  </p>  <p style=\"\">  \t        This course is about the kinds of information you can use to identify and define the people and groups inside your organization. Once you identify those audiences, you will be able to target them as part of your next business or communications strategy.  </p>  <p style=\"\">  \t        In this course you will learn about three main categories of information: firmographics, demographics, and psychographics. After learning the basics about each category, you will discover more about them in detail.  </p>  <p style=\"\">  \t        The course will review  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t        ·five ways to look at your workforce using firmographic criteria,  \t</p>  \t<p style=\"\">  \t\t        ·11 different types of demographic criteria,  \t</p>  \t<p style=\"\">  \t\t        ·six ways to get to know your internal audiences using psychographics, and  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\">Delivery</strong>  </p>  <p style=\"\">  \t        This is an introductory course intended for  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t        ·business professionals,  \t</p>  \t<p style=\"\">  \t\t        ·communicators,  \t</p>  \t<p style=\"\">  \t\t        ·recent graduates, and  \t</p>  \t<p style=\"\">  \t\t        ·students.  \t</p>  </ul>  <p style=\"\">  \t        The course is delivered as a combination of animated video and presentation slides. It includes five sections and will take approximately 1 hour to complete.  </p>  <p style=\"\">  \t<strong style=\"\">Outcomes</strong>  </p>  <p style=\"\">  \t        By the end of this course, you will be able to:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t        ·improve your organizational communications efforts,  \t</p>  \t<p style=\"\">  \t\t        ·figure out who you need to communicate with and how best to reach those target audiences,  \t</p>  \t<p style=\"\">  \t\t        ·help leaders make strategic decisions based on their intended audience, and  \t</p>  \t<p style=\"\">  \t\t        ·find and focus on the target audiences most important to your organization.  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\">Practical Application</strong>  </p>  <p style=\"\">  \t        If you want to take immediate action following the course, you will be able to download an audience checklist that will help you get started.  </p>  <p style=\"\">  \t        This checklist will guide you through the process of creating a profile for each of your target audiences.  </p>", 
    "end_date": null, 
    "title": "Target Internal Audiences & Stakeholders With Confidence ", 
    "price": "50.00", 
    "instructors": "Amber Marechal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174868_0e08_7.jpg", 
    "course_url": "https://www.udemy.com/targetaudience/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-01T15:06:57Z"
}