{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you a technical writer? Are you a profitable, reliable, and successful technical writer? Would you like to earn more, get more writing assignments, and grow your business?</p><p>I can help. I’m Joseph Phillips, and I’ve written hundreds of technical magazine articles and I’ve published 33 books for companies like McGraw-Hill, Pearson Education, and the American Management Association.</p><p>In this course I’ll guide you through the technical writing process – not how to write, but how to write effectively, quickly, and accurately. I will show you my exact approach to technical writing that I’ve developed over the past twenty years. You can adapt my technical writing system to your career to grow your technical writing demand.</p><p>This isn’t a gimmick, but an honest method that I’ve used in my writing career. There are no shortcuts to good, effective technical writing, but this approach will help you to streamline your writing and editing time, every time. </p><p>In this course we’ll also examine the revision processes, working with editors, and the importance of writing well. We will also discuss how to promote the book through web sites, blogs, webinars, and press releases. </p><p>Technical writing is more than just a nonfiction book. Technical writing is education through the written word. Readers look to technical books to help them achieve specific goals in their lives - and it's up to you, the technical writer - to write clear, concise directions for your readers.</p><p>Let’s get started today to begin growing your profitable technical writing career.</p>", 
    "end_date": null, 
    "title": "Technical Writing: Master Your Writing Career", 
    "price": "25.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678676_4929.jpg", 
    "course_url": "https://www.udemy.com/technical-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T21:17:55Z"
}