{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Jerry Seinfeld once said, “According to most studies, people's number one fear is public speaking. Number two is death. Death is number two…This means to the average person, if you go to a funeral, you're better off in the casket than doing the eulogy.\"   But the fact is, many of us are called at one time or another to step courageously in front of a group of people and communicate a message that captivates.  </p>  <p>  \t  What if you could harness the fear of public speaking and use it as a friend and not a foe?  What if you could design a speech that challenges and inspires listeners?  What if you could ignite your creativity in such a way that stories and illustrations flow out of you naturally?  What if you could put aside your manuscript and notes and speak directly to the audience from your heart?  </p>  <p>  \t  The Speaker's Blueprint is a five session course that will give you a foundation upon which you can build any speech.  You will learn how to prepare your mind and body, how to grab people's attention, how to harness fear and anxiety, how to design a sermon, and how to tell stories that engage listeners.  </p>  <p>In order for you to get the most out of this course you need:</p><ul><li>An open mind and willingness to learn.  Some of the exercises I teach are from my years in improv theater.  These exercises will deepen your learning and stimulate your creativity</li><li>Engagement with the action guide.  Download the action guide attached to the first lecture for notes and inspiration.</li></ul><p>Bottom line: The Speaker's Blueprint will teach you how to captivate your audience.  I look forward to connecting with you through the course.  </p>", 
    "end_date": null, 
    "title": "The Speaker's Blueprint:  How to Captivate Your Audience", 
    "price": "35.00", 
    "instructors": "Mike Weaver", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408294_6ff4_2.jpg", 
    "course_url": "https://www.udemy.com/thespeakersblueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-30T18:13:14Z"
}