{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is the basic guide to becoming a feature film or short film or content writer.</p><p>Script writing is a creative art.</p><p>The person who posseses this art and writes scripts is called as <em><strong>script writer.</strong></em></p><p>To educate you on the art of script writing we have brought you this theoretical  course.</p><p>This <em><strong>Theoretical Course</strong></em> will enable you to understand the concept of script writing by teaching you various things associated with it such as</p><p>1) What is a script?</p><p>2) Various typess of scripts.</p><p>3) Greatness of a writer ?</p><p>4) Purpose of writing and so on</p><p><strong>Scriptwriter</strong> or <strong>Scenarist</strong> is a writer who practices the craft of screenwriting, writing screenplays on which mass media such as films, television programs, comics or video games are based.</p><p><span></span>Most professional screenwriters in the U.S. are unionized and are represented by the Writers Guild of America. Although membership in the WGA is recommended, it is not required of a screenwriter to join. The WGA is the final arbiter on awarding writing credit for projects under its jurisdiction. The WGA also looks upon and verifies film copyright materials.</p><p>A <strong>script</strong> is a document describing the narrative and dialogue of a book in detail. It is the book equivalent of a television program teleplay or a film screenplay<br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "The Essential Guide To Become A Script Writer ( Theoretical)", 
    "price": 0, 
    "instructors": "Harris Crystal's Smart Academy", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/621042_a4d2.jpg", 
    "course_url": "https://www.udemy.com/top-secrets-to-become-a-script-writer-theoretical/", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T05:46:37Z"
}