{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This freelance writing course covers everything you need to know to set yourself up as a professional freelance writer. You'll investigate good writing, versatile writing and profitable writing and create a multimedia writing portfolio to show clients. You'll also get monthly updates to help keep your scribbling on track.  </p><p><strong>Master multimedia writing skills to stand out as a freelance professional writer</strong><br></p><p>You'll learn to: </p><ul><li>Research wide and hidden writing opportunities</li><li>Judge realistically how profitable writing is likely to be for you</li></ul><ul><li>Analyse role models, to improve writing technique</li><li>Demonstrate and develop writing skills in a variety of media</li><li>Create a portfolio to showcase your work, which reaches the right targets</li><li>Relationship build and network to position yourself for collaborative opportunities </li><li>Produce work quickly, build on feedback and grow a sustainable practice</li></ul><p><strong></strong> </p><p>Packed with practical exercises which you are welcome to submit for feedback, you'll get formats, filters and technology tips to help you write prolifically and fast. </p><p>Whether you:</p><ul><li>Love writing and would like to turn it into a career</li><li>Are unsure what sort of writing to pursue</li><li>Freelance in another discipline and want to write as a bolt-on</li></ul><p>this course will help.</p> <p>Created by a writer of 30 years experience and with a background in psychology, this most  comprehensive course will help you succeed as a freelance writer in today's digital global marketplace, and make the most of its tremendous new opportunities. </p>", 
    "end_date": null, 
    "title": "The Complete Freelance Writing Course", 
    "price": "30.00", 
    "instructors": "Philippa Davies", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673180_1cce_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-freelance-writing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T10:29:42Z"
}