{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>What’s up good people? Thanks so much for giving my course an extended look. I am appreciative of your time and extremely humbled to be considered. \n\n  </p>\n\n<p>A little background on me, my father was a professional boxer in the 1960s so the presence of sports were a significant part of my upbringing. Whether I was playing organized sports, watching sporting events on television or having spirited debates with friends and family about the game, sports has always loomed large – continually serving as the soundtrack of my life.   \n\n  </p>\n\n\n\n<p>I began my sports writing career in the early 2000s and have had the opportunity to write for mainstream outlets such as USA Today Sports, Lindy’s Sports Annual and Examiner. I have also written for major outlets such as HOOPSWORLD, Fight Hype, Boxing Scene, Basketball Insiders and a host of other publications. \n\n  </p>\n\n\n\n<p>I have also been featured as an expert guest on ESPN Radio, Yahoo Sports Radio, CBS Radio, NBC Radio and a plethora of other podcasts throughout the country. \n\n  </p>\n\n\n\n<p>The biggest takeaway from my background that I want to stick with you is the fact I have been able to take a childhood passion and turn it into an enjoyable career. I would be honored to have the opportunity to assist you in doing the same. </p>\n\n\n\n<p>My goals for this course is to help you understand how to thrive in today’s modern sports writing climate, the importance of establishing your personal brand, how to treat your fans and followers and the necessity of being active on social media. \n\n  </p>\n\n\n\n<p>This course will also dive into the advantages and disadvantages of creating your own blog or opting to join an established outlet. We will also cover why you should trust your uniqueness as a writer and the importance of checking your ego at the front door. \n\n  </p>\n\n\n\n<p>The journalistic landscape has changed dramatically over the past 20 years. For starters, in today’s competitive environment just having strong writing skills won’t do the trick. We’ll thoroughly cover why today’s writer needs to have more in their repertoire than just a strong pen game. \n\n  </p>\n\n\n\n<p>Once again, thanks for giving this course a strong look and hopefully you will decide to enroll today. I look forward to building a long lasting professional relationship with you. \n\n  </p>\n\n\n\n<p><strong>- Lang</strong></p>", 
    "end_date": null, 
    "title": "The Essential Guide to Modern Sports Writing", 
    "price": "30.00", 
    "instructors": "Lang Greene", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/849064_fe3c_10.jpg", 
    "course_url": "https://www.udemy.com/the-essential-guide-to-modern-sports-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T14:32:39Z"
}