{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong>ABOUT THIS TRAINING</strong>  </p>  <p>  \t   The exact formula that my students have used to attract and impact buyers and persuade  in sales, management, professional services, coaches, teachers and in every market branch. Anyone - who wish to be more relevant and boost his/her success, career needs to know how to: communicate, addressing your message across and influence people to act. And in the training you will learn all that and MORE.  </p>  <p>  \t   The 6 weapons of mass influence that cause people to LISTEN, INSPIRE and BUY. These triggers will form the solid stone of your successful business and career.  </p>  <p>  \t   You&#039;ll get Now three training videos that walk you through my Result oriented training process.  </p>  <p>  \t   You&#039;ll also get the booklet that contains step-by-step exercises to build Your New Powerful knowledge into skills.  </p>  <p>  \t <strong>What kind of materials are included?</strong>  </p>  <p>  \t   7 training parts, each is a video clip in a structural step-by-step training, so, you build your knowledge and skills as a building blocks and in the right order.In addition, there is a short PDF file that share with you an efficient exercises that you can practice yourself in private and be ready to perform.ַ  </p>  <p>  \t  The training contains:  </p>  <p>  \t   Module 1: Basic and contains 4 parts A,B,C ַ D (see details below)  </p>  <p>  \t  Module 2: Advanced and contains 3 parts A,B,C (see details below)  </p>  <p>  \t <strong>How long will take to complete the training?</strong>  </p>  <p>  \t   The whole training is about 2 hours and contains 7 parts, each part is a video clip lesson.  </p>  <p>  \t<strong>How is the training structured?</strong>  </p>  <p>  \t  The training contains 7 parts which are described below:  </p>  <p>  \t<strong>Module 1: Basic</strong>  </p>  <p>  \t<strong>Part A:</strong> The very 1<sup>st</sup> things you need to do …First impression…  </p>  <p>  \t<strong>Part B</strong>: Prepare your presentation for maximum impact  </p>  <p>  \t<strong>Part C</strong>: Prepare yourself to become a great presenter  </p>  <p>  \t<strong>Part D</strong>: Getting your message across  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong>Module 2: Advanced</strong>  </p>  <p>  \t<strong>Part A</strong>: Addressing Questions  </p>  <p>  \t<strong>Part B</strong>: Handling hostile audience  </p>  <p>  \t<strong>Part C:</strong> Master the special techniques of the 21th century  </p>  <p>  \t<strong>Why take this training?</strong>  </p>  <p>  \t  To be a great communicator it can takes you many years and still lack of know what works..  </p>  <p>  \t  Don’t guess at what works or how to perform or which strategy to plan – I’ve  </p>  <p>  \t  Tested what works and I’ll show you and share with you all the secrets. It will saves you years of frastration and money spent on trainings.  </p>  <p>  \t  All people today need to communicate, need to share, teach knowledge and experince and it is the CRUCIAL aspect to success or fail in any role, bussiness and specially now, in the beginning of the 21th cent.  </p>", 
    "end_date": null, 
    "title": "THE COMPLETE PUBLIC SPEAKING SECRET FORMULA", 
    "price": "40.00", 
    "instructors": "Gil Fainer", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/221320_4eaa_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-public-speaking-secret-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-17T12:33:08Z"
}