{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is designed for children 8-12 years of age who are interested in writing their own mysteries. National Board Certified elementary school teacher and award-winning author Steve Reifman will take young writers step-by-step from the beginning of the writing process to the end and help them craft stories that keep readers guessing and on the edge of their seats! It doesn’t matter whether students are already seasoned mystery writers   or brand new to the genre. This course promises to take young writers to   the next level.<br style=\"\"></p><p style=\"\">In the easy-to-follow videos and detailed handouts that comprise this course, Steve skillfully combines the wisdom accumulated throughout his 19 years as an educator with numerous examples from his book <em style=\"\">Chase Against Time</em> to teach students about crimes, crime solvers, suspects, motives, clues, witnesses, alibis, red   herrings, and all the other elements that make mysteries so much fun to   read and write.</p>What’s even better, students can learn at their own pace. While the course&#039;s twenty-nine videos focus on the same knowledge and skills that one might find in a more traditional 4-6 week writing class, the structure of this course enables students to work on their mysteries anytime, anywhere. Students can watch and   pause the videos whenever they wish, re-watch videos as necessary, and complete the course as their schedule permits.<br style=\"\"><br style=\"\">In addition to teaching the knowledge and skills required to help children write their own mysteries, Steve focuses on higher purposes. He wants children to experience the same thrill of writing a mystery adventure that he had when he wrote <em style=\"\">Chase Against Time</em> and its sequels. He also promotes valuable writing habits such as perseverance, pride, and paying attention to detail. Furthermore, he wants children to develop a passion for reading and writing, and he leads the course with these larger objectives in mind.<br style=\"\"><br style=\"\"><p style=\"\"><br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "The Ultimate Mystery Writing Course for Kids", 
    "price": "20.00", 
    "instructors": "Steve Reifman", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54302_8505_7.jpg", 
    "course_url": "https://www.udemy.com/theultimatemysterywritingcourseforkids/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-15T19:18:23Z"
}