{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Welcome to the day in which you'll start your path to become a Master Presenter, in our +2,000 students community!</strong></p>\n\n<p>This course is a <strong>One-Stop-Shop for everything you’ll ever need to become a master presenter</strong> and obtain <strong>concrete results</strong> after each encounter, <strong>consistently</strong>.</p>\n\n<p>The <strong>main difference</strong> that you'll encounter with the other courses in this segment is that <strong>we take all the production <em>nitty-gritty details</em> into account.</strong></p>\n\n<p>After all, <strong>presentations and meetings are curated experiences</strong>—just like a movie or a theatrical play… just with different outcomes.</p>\n\n<p>We cover with a <strong>holistic approach</strong> what you should take into account when crafting the presentation: the <strong>before</strong>, the <strong>meanwhile</strong> and the <strong>after</strong>.</p>\n\n<p>We go<strong> from «soft» to «hard» skills</strong>: from the mindset &amp; attitude, the body language to how to create the best slides and prepare the logistics for the food catering.</p>\n\n<p>We will give you tools that create a <strong>compelling experience</strong>, allowing <strong>deep emotional connections</strong> not only with <strong>clients</strong> and <strong>teammates</strong> but also with all the <strong>stakeholders</strong>.</p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>By now, you may be thinking who are we… about our background and what qualifies us to teach this.</strong></p>\n\n<p>Let’s start by saying hi and introducing ourselves!</p>\n\n<p>We are <strong>Fernando</strong> and <strong>Mariano</strong>.</p>\n\n<p>We have <strong>more than 15 years of combined experience</strong> working with a wide variety all types of people, in many different conditions...<strong> Having to constantly present to sell, create understanding</strong> between stakeholders and <strong>getting a team ready</strong> for success… Obviously having no time at all to do so ;)</p>\n\n<p>Our path has taken us to <strong>present to Fortune 100 companies</strong> CEO’s, CMO’s, CTO’s—but also to <strong>Small and Medium Enterprises</strong> owners.</p>\n\n<p>We have <strong>worked with people from all over the world</strong>, including <strong>California’s Silicon Valley, New York’s Wall Street, United Kingdom, Brazil, Netherlands, Chile, Mexico, Czech Republic</strong> and obviously, from our hometown of <strong>Argentina</strong>!</p>\n\n<p>We bring to the table two very complementary visions and backgrounds:</p>\n\n<p>- <strong>The Project Manager Side</strong>: Fernando is currently one of the PMs in Globant, one of the most innovative software companies, listed under the ticker GLOB in NASDAQ. <strong>His experience as a presenter and organizer in Corporate environments is second to none</strong>. Had worked on a wide variety of projects and technologies, in different industries across America, Latin America and Europe. He blends the theoretical knowledge of Project Management (PMP, Scrum Master) with his <strong>8+ years of experience in the trenches.</strong></p>\n\n<p>- <strong>The User Experience (UX) Designer Side:</strong> Mariano is an<strong> hypermedia producer</strong> with expertise in <strong>psychology, business and technology</strong>. He is also a <strong>public speaker</strong>, having served as <strong>Academic Coordinator</strong> for two international-grade universities and even shared scenario with <strong>Steve Wozniak</strong> (Apple co-founder). <strong>He has +8 years of experience <em>i</em></strong>n creating experiences that make the world a better place to live.</p>\n\n<p>We worked in projects together, and when we were in different missions, served as counselors for each other. We love to share our vision since we are passionate for <strong>creating top notch products and services to make people’s lives better.</strong></p>\n\n<p>Both of us have experience as entrepreneurs and independent consultants, so we bring a full array of specific techniques for each situation that you’ll encounter.</p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>We know that in every profession, in every type of work, our skills to present are critical to obtain concrete results when working with other people.</strong><br></p>\n\n<p>Unfortunately, almost no university or high school teaches to tackle this in its complexity...</p>\n\n<p>And developing these skills takes time—the time that we should be using to do our \"craft” --\"real\" work so to speak ;)</p>\n\n<p>Even worse, the available courses only centered themselves in one to three of the total vectors that a presentation has.</p>\n\n<p>Most of them cover graphic design, oratory, body language… but none covers the underlying strategy, the methods of organization and the needed tactics to deploy.</p>\n\n<p><strong>Presenting is a fine piece of machinery: you need not only all the moving parts, but also to have them working cooperatively as a whole.</strong></p>\n\n<p>The fundamental error is to be a good presenter is not enough to \"have a nice slide deck and be eloquent\"... <strong>We need to be aware of the entire cycle that surrounds a presentation.</strong></p>\n\n<p>With this course <strong>we go one step further</strong>. Some examples of what you’ll find:</p>\n\n<p><strong>How we:</strong></p>\n\n<ul><li>Get all the logistics in place.</li></ul>\n\n<ul><li>Remind a colleague that take the Mac VGA adapter to fit the projector.</li></ul>\n\n<ul><li>Use a free software tool to automate the process of choosing the best time to have the presentation.</li></ul>\n\n<ul><li>Say NO to clients without getting fired.</li></ul>\n\n<ul><li>Persuade stakeholders to become your allies.</li></ul>\n\n<ul><li>Think about food catering and air conditioning.</li></ul>\n\n<ul><li>Have all people that matters invited with little effort.</li></ul>\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>We have tried a lot of different systems, software tools, read dozens of books on the subject and watched countless videos, trying to achieve the perfect presentation skills.</strong><br></p>\n\n<p>The reality is that none of those provided the REAL solution to the REAL problem: <strong>having to produce in addition to deliver the presentation.</strong></p>\n\n<p>Several courses and books center themselves in how to create a Powerpoint or Keynote slide deck... but, let’s be honest—<em>that is one of the simplest parts of the whole.</em></p>\n\n<p>We understand that you need results right now, and that you cannot spend weeks searching for all this scattered information across the net... and connect the dots to understand it\".</p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>This course has been thought as the most comprehensive way of understanding what to do before, during and after each meeting or presentation that you’ll ever have.</strong><br></p>\n\n<p>It includes <strong>simple templates, checklists</strong> and <strong>how-to’s</strong> to allow you to <strong>go from newbie to pro.</strong></p>\n\n<p>This course will give you the mindset to deliver not only presentations, but <strong>a compelling experience that will help you to make better and more profitable business.</strong></p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>What this course is NOT</strong><br></p>\n\n<p>- A one-on-one coaching or consultancy. We understand that for that, a written response is not enough.</p>\n\n<p>- An english class: our english is kinda imperfect. We are from Argentina, and you'll notice some errors. But please, don't let this be a blocker in trying the value of the contents that we share. Remember that <strong>you can always ask for a 30-day refund from Udemy, no questions asked.</strong></p>\n\n<p>- We don’t appear on camera: We like to get “to the meat\" when teaching, to get each minute of each video full of value.</p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>As a closing thought, our utmost desire of the course, is <strong>to inspire ACTION</strong>. You won’t get better if you don’t practice. You need to act. That’s a fact. You can do 100 course and still, be average.<br></p>\n\n<p><strong>The key is to act</strong>. With that in mind, we are not only going to be providing you all the knowledge we accrued through the years, but also giving you exercises to do and complement what we teach. </p>\n\n<p>Don’t fall in the trap. <strong>Learn and act.</strong> Just learning, is meaningless. Put it into practice and you will see how sensible the experiences are, meaning that small incremental <strong>changes you do, will payout tremendously.</strong></p>\n\n<p><strong>Are you ready?</strong></p>\n\n<p><strong>Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "The 3 Stages for Dazzling Pitches - Become a Master Pitcher", 
    "price": "20.00", 
    "instructors": "Mariano Goren, Fernando Rodriguez", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705328_7823_4.jpg", 
    "course_url": "https://www.udemy.com/presentation-skills-effective-training-for-business-presentations-ppt/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-23T23:36:50Z"
}