{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  The diversity that we see everywhere around us in today&#039;s world can be both good and bad. It is hard to imagine a world without this diversity, but living with differences can be challenging. We all live multiculturalism today, whatever we may call it. Differences of cultures, religions, lifestyles, and many other aspects of life enrich our world but also seem to generate fears and concerns.  </p>  <p style=\"\">  \t  To live with such diversity we need to understand what it is about, and how we can face the challenges and problems that our societies face. In this course I will discuss with you a number of issues that I have been researching, teaching, and writing about for the last twenty years.  </p>  <p style=\"\">  \t  We will explore the questions raised about the death of multiculturalism, and ask if diversity is a good or bad thing. I will highlight six key challenges of multiculturalism, including understanding the process of living with differences, the threat of conflict, differences based on economics and identity, the importance of education, and the role of religion within the challenges of multiculturalism. As illustration of this last point, I will highlight the problems of fear of Islam and Islamophobia as a form of racism.  </p>  <p style=\"\">  \t  In conclusion I will give a brief overview of some questions about diversity and change in the UK, and highlight how - whether we want it to be or not - the twenty-first century is one that is dominated by diversity and multiculturalism. It is something that we need to learn about and understand.  </p>  <p style=\"\">  \t  This course is a short introduction to my interests in multiculturalism, and is aimed at anyone who has an interest in these questions. It does not expect any knowledge of the subject, and will hopefully make you think about the world that we live in.  </p>", 
    "end_date": null, 
    "title": "The Challenges of Multiculturalism", 
    "price": "20.00", 
    "instructors": "Malory Nye", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/219978_1658_6.jpg", 
    "course_url": "https://www.udemy.com/the-challenges-of-multiculturalism/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-15T20:50:05Z"
}