{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li>The reason for this lecture is my experience everyday. People turn their backs to the listeners when talking or just read a large text in their presentation slides instead of writing bullet points and printing a handout material.</li><li>This  is a lecture format course on the basics of the presentations in front of audiences. </li><li>Students will be able to hear a summary of the material that is gathered for many years from reading and experience, it will save you time. This is short course with many ideas for you.</li><li>The language is simple.</li><li>I will NOT make the presentations instead of you. This is your task. </li><li>The course will give you the basic knowledge, the bonus material - the check lists which you can use in every presentation you prepare. </li><li>People who practice what they have learnt are the most successful. I encourage you to make notes or to replay the videos again and again; after that, please practice the tips and hints that I shows you. </li><li>If you do not have enough opportunities to practice, I could upload some exercises for you. Please tell me. The exercises are an excellent way to practice your new knowledge, not to scare you nor to tire you unnecessary.</li><li>Less than 5% of all people apply the learnt knowledge, and that is why they are successful. Become one of them!</li><li>Think about time management, too. What about a training in spinning or in fast running in time slots of 45 seconds? Have you ever tried this? This is a very long time. A gym training disciplines you and gives you a sense of time which you could use in your work. After 45 seconds, most of the people are out of breath. This is enough time to share many ideas. Use it wisely, and learn to appreciate your time. </li><li>Dedicate please some of it to this course and benefit from it!</li></ul>", 
    "end_date": null, 
    "title": "The Successful Presentations", 
    "price": "30.00", 
    "instructors": "Galina Jovtschewa", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830110_4703_3.jpg", 
    "course_url": "https://www.udemy.com/the-successful-presentations/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-23T16:30:11Z"
}