{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  At this point you may be asking yourself: What does philosophy have to do with me?  This is a common question for students to ask especially after a brief exposure to some of the concepts in philosophy.  However, philosophy has a direct bearing on much of everyday life.  Let&#039;s look at it in terms of the major questions we&#039;ll address in this course.  </p>  <p style=\"\">  \t<br style=\"\">  \t<em style=\"\">Is knowledge innate or learned from sense experience?</em>  If you have children this question and the search for an answer has direct bearing on your life since the question has major implications for education.  Nearly every educator has been a philosopher or influenced by a philosopher for whom this was an important question.  The origin of knowledge and how it is acquired is important to know or have some idea about if you are at all concerned about effective education.  For adults the question has bearing as well in terms of being able to learn new things.  In an economy drive by information and information technology how we process this information is directly relevant to our everyday lives.  So, philosophers like John Locke, Immanuel Kant, and John Dewey who investigate this question are also relevant. <br style=\"\">  \t<br style=\"\">  \t<em style=\"\">Is the mind independent of the brain?</em>  Philosophers and scientists have been investigating the mind, the brain, and their interaction for centuries.  We&#039;ll see many competing theories on this question but how is any of this relevant to you?  One very big word can answer that: psychopharmacology.  Do you or anyone you know take some medication for ADHD, ADD, depression, bipolar disorder?  If so, then questions about how the mind and brain work and interact are directly relevant to your everyday life not to mention your overall mood, happiness, and general mental state.  These drugs could not have been discovered and developed without some idea about how the mind and brain worked.  While these may seem like exclusively scientific questions, much of the work in the area of neurology has been done and continues to be done by philosophers.  Some of the philosophers we&#039;ll look at in this area include Rene Descartes, Thomas Hobbes, John Searle, and J.J.C. Smart.<br style=\"\">  \t<br style=\"\">  \t<em style=\"\">Is there an objective reality independent of appearance and perception?</em> This question sounds very esoteric and perhaps far removed from and irrelevant to everyday life.  But, like most philosophical concepts, relevance lurks just below the surface if you know where to look.  Many of you may be familiar with the prayer of serenity:<br style=\"\">  \t<br style=\"\">  \t  God grant me the serenity<br style=\"\">  \t  to accept the things I cannot change;<br style=\"\">  \t  courage to change the things I can;<br style=\"\">  \t  and wisdom to know the difference.  <br style=\"\">  \t<br style=\"\">  \t  Embedded in this prayer is the notion that there is a difference between what you can change and what you cannot.  This is simply the distinction between objective reality and perception.  Though not all philosophers we&#039;ll study agree that there is a difference between the two, the notion that there is a difference is the basis of at least one major school of philosophy called Stoicism.  The notion that there is a difference between what you can change or control and what you cannot is a central idea in Stoicism and as such has formed the philosophical basis for much of self-help psychology.  One consistent piece of advice contained in almost every volume of self-help literature is the importance of recognizing this distinction. <br style=\"\">  \t<br style=\"\">  \t<em style=\"\">Is there a God?</em>  For many of you this will be one of the easiest questions to relate to everyday life especially if you practice some form of religion.  But, it may also seem irrelevant since you may be thinking that it can only be answered by faith and therefore is not worth asking.  But, these sentiments themselves are philosophical in nature and bear examining (which we will do!).  One philosopher we&#039;ll be studying named Thomas Aquinas pointed out that the question of God&#039;s existence is fundamental to every other religious question one can ask.  If God&#039;s existence cannot be established the remaining religious questions are moot.  At the very least an examination of the historical ideas related to these questions might be enlightening and lead to a deepening of one&#039;s religious sentiments.      <br style=\"\">  \t<br style=\"\">  \t  My purpose in this class is not to tell you what to think.  I want to show you <em style=\"\">how</em> to think philosophically but I do not want to change your beliefs.  Philosophy may challenge them but it need not destroy them.  In fact, you may find that it will strengthen them.  </p>  <p style=\"\">  \t<br style=\"\">  \t  So I invite you to enter the world of philosophy!  </p>", 
    "end_date": null, 
    "title": "Think Like a Philosopher", 
    "price": "20.00", 
    "instructors": "Kevin Browne", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/31530_fe7f_4.jpg", 
    "course_url": "https://www.udemy.com/think-like-a-philosopher/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-06T23:44:07Z"
}