{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is a quick guide to the first 10 speeches in the Toastmaster program, otherwise known as the Competent Communication manual. The course will provide a quick overview of the objectives and timing for each project as well as the tips that I have used to successfully complete the project. </p><p>Inside the course, you'll find videos, quizzes and sample speeches which will provide you with all the knowledge and tools you need to complete the 10 speeches in an efficient and stress-free manner. </p><p>If you're a brand new Toastmaster trying to complete your first 10 speeches or a seasoned Toastmaster who has completed their Competent Communication manual multiple times, anyone can learn something new from practicing and delivering these speeches. </p><p>You will learn how to:</p><ol><li>Begin speaking before an audience</li><li>Organize your speech in a way that helps the audience understand what you are talking about</li><li>Make sure that your speech has a focus for the audience</li><li>Use language that engages the audience</li><li>Use body language to enhance the delivery of your speech</li><li>Use your voice in different ways to add meaning and entertainment to your speech</li><li>Research your speech and understand the different support material you can use</li><li>Become comfortable with visual aids and how they can improve or enhance your speech</li><li>Persuade your audience and the steps to convince them of an idea or viewpoint</li><li>Inspire your audience with stories</li></ol><p>This course comes with a 30-day money-back guarantee - if you take this course and do not like it for whatever reason, you can get all of your money back, no questions asked. In addition to this, if you PM me and let me know how I can improve my course for you, I will gift you an electronic copy of my book \"Make your speech more impactful\" as a show of my gratitude. </p><p>Hope to see you soon! </p>", 
    "end_date": null, 
    "title": "Tips on the first 10 basic speaking skills everyone needs", 
    "price": "20.00", 
    "instructors": "Wang Yip", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522846_06ce_4.jpg", 
    "course_url": "https://www.udemy.com/toastmasters-a-guide-to-the-competent-communicator-manual/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-07T23:44:14Z"
}