{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Do you love to write? Do you think you're a good writer? </strong></p><p>Believe it or not, effective writing is more than just tapping away \nat your keyboard.  Without a proven strategy, you’ll probably end up \nrunning out of steam halfway through, throwing the story onto an \never-expanding pile of unfinished work.  Time to take your writing to \nthe next level. </p><p>Top 10 Habits To Become A Successful Author gives you invaluable \ninsight into the strategies used by some of today’s most successful \nwriters.  With This course, you’ll be \nable to leverage your creativity and talent with practical writing \ntechniques that will ensure that you will finish what you start. </p><p>Developed over the course of 16 years spent combing through mountains\n of source material on writing techniques, Top 10 Habits To Become A \nSuccessful Author offers you an express pass to learning all of the top \ntested and proven techniques from a single source. </p><p><em><strong></strong><strong>So what's inside? </strong><strong></strong></em></p><ol><li>How to Create Your <strong>Personal Brand Story</strong></li><li>How do you <strong>differentiate </strong>yourself and create a <strong>unique </strong>image amongst a sea of competitors?</li><li>Focus on Your Strengths</li><li>Essentials to <strong>Making Your Article Worth It</strong></li><li>Discover the <strong>Golden Circle</strong></li><li>Start Acting <strong>Like Professionals</strong></li><li>Find Your Voice and Shout</li><li>Reach Your Audience When <strong>They Want to Read Your Articles</strong></li><li>Embrace Change with Confidence</li><li>How to Praise your competitors</li><li>How to Give Thanks as an <strong>Article Writer</strong></li></ol><strong></strong><p>What I am offering you is the quality of an in-depth Creative Writing course, at the quick-get-to-the-point pace of the world we live in today. To master the finer skills of writing- you deserve quality combined with the speed of being able to order it instantly in the comfort of your own home or office. </p><p>Don't procrastinate. <strong>Click the “Take this course” Button and get started now. Turn you into Successful writer</strong> </p><p>Looking forward to hearing from you.</p><p><strong>Enrol now!</strong></p>", 
    "end_date": null, 
    "title": "Top 10 Habits To Become A Successful Author [Subtitle added]", 
    "price": "20.00", 
    "instructors": "Fettah Ben", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433048_9a54_3.jpg", 
    "course_url": "https://www.udemy.com/top-10-ways-to-become-a-successful-author/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T14:48:53Z"
}