{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">This 3 day<strong style=\"\"> bootcamp</strong> dives deeply into the strategies, techniques and tools you need to be an effective trainer. In this program you&#039;ll learn EVERYTHING we know about adult learning. You will not only discover HOW to motivate adult learners, keep them interested, deal with challenging or disgruntled participants, and maximize learning, you will actually DO it yourself. If your organization needs to quickly roll out a complete train-the-trainer program and ensure your trainers will be immediately effective, then this is the program for you.</strong></p><p style=\"\"><strong style=\"\">This program is no joke, and consequently it may not be the place to start if you aren&#039;t ready to get your hands dirty and jump into live real world applications.</strong></p><p style=\"\"><strong style=\"\">Why Rule The Room:</strong></p><p style=\"\">Our trainers are experienced adult learning specialists that can deliver a fast paced results-oriented training program. They approach everything from the perspective of both a trainer AND a trainee allowing participants to learn from a trainer that is also modeling everything they suggest trainers do. Adult learning is at the core of what we do so we spend a lot of time on it. For that reason, our adult learning programs have become the go-to curriculum for companies and universities nationwide.</p><p style=\"\"><strong style=\"\">But don&#039;t just take our word for it, here&#039;s what others had to say:</strong><br style=\"\"></p><p style=\"\">&quot;These techniques have been extremely valuable to me as a trainer. The training tools are taught in such a way that you can walk away from the program and start implementing change in your classroom immediately. I&#039;ve become better at answering questions and more confident in my teaching style.&quot;<br style=\"\"></p><p style=\"\"><strong style=\"\">Kara McCaffrey - </strong><strong style=\"\">Software Trainer</strong></p><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\">“Jason is an engaging teacher who is not only knowledgeable about this field, but is intensely passionate about it. This course not only gave me the knowledge, insight, and skills to excel in this new role, but the confidence to implement these new skills and to share this knowledge with others.”</p><p style=\"\"><strong style=\"\">Lorielle Ouimette - </strong><strong style=\"\">Physician Software Trainer</strong></p><p style=\"\"><strong style=\"\"><br style=\"\"></strong></p><p style=\"\">“This is Kelly Markowski from your Trinity Health bootcamp that ended yesterday (11/19). I just wanted to send a quick note of thanks for the great tools. I am constantly seeking to improve my training skills, both to have something better to offer trainees, as well as to increase my own comfort level with it, and I know that I will be using a lot of your material to do both! I think it&#039;s important to express genuine gratitude, so I just wanted to let you know that the bootcamp was very beneficial for me.”<br style=\"\"></p><div style=\"\"><strong style=\"\">Kelly Markowski, MHSA, RHIT - </strong><strong style=\"\">Consultant, Program Excellence - Trinity Health</strong></div><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Trainer Bootcamp: Hands-On Train-the-Trainer Skills", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483670_710d_4.jpg", 
    "course_url": "https://www.udemy.com/train-the-trainer-bootcamp-hands-on-training-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T20:36:45Z"
}