{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span class=\"Apple-style-span\"><strong style=\"\">Why should you take this course?</strong></span>  </p>  <p>  \t<span class=\"Apple-style-span\">Maverick is a truly unparalleled world-class “train-the-trainer” program. Learn new techniques to get adult learners interested, motivated, engaged, enjoying themselves, getting it, and loving you for it. You’ll also learn how to answer questions using our famous Q &amp; A Maverick style approach so you always look like you know the answer, even when you don’t. This 8 hour program has everything you need to raise your game and take your training skills to the elite level. </span>  </p>  <p>  \t<span class=\"Apple-style-span\"><strong style=\"\"> Bonus: </strong>Includes a 150+ page workbook, seating chart templates, evaluation tool, pre-flight training checklists and a learning style assessment.</span>  </p>  <p>  \t<strong style=\"\">Don&#039;t take my word for it. Hear what others have to say...</strong>  </p>  <p>  \t&quot;I learned more about education here than I learned in 3 years at the School of Education at the University I attended.  Your techniques and your instruction have been paradigm shifting (if you’ll excuse the buzz words) and totally mind blowing. I feel like I am absorbing knowledge just by being in the room.&quot;  </p>  <p>  \t<strong style=\"\">- Dave Palay</strong>- Corporate Trainer  </p>  <p>  \t&quot;I just wanted to tell you that I used a lot of the stuff we talked about in Maverick last Friday—and my class this week LOVED me!  And triaging the questions the way we practiced (I had a “4:30 Club”) worked like a charm!  Thank you!&quot;  </p>  <p>  \t<strong style=\"\">- Steph Jenkins </strong>- Software Trainer  </p>  <p>  \t“Aside from the concepts, one of the biggest things that I value from the class was the time and effort we put into body and voice control.  Being more aware of my posture and tone of voice makes me a much more comfortable and confident trainer.  I get to be less tense and enjoy delivering the material, and at the same time I become more credible of a source in the eyes of the trainees.”  </p>  <p>  \t<strong style=\"\">- Mark Phelan</strong>- Corporate Software Trainer  </p>", 
    "end_date": null, 
    "title": "Train the Trainer Pro: No Beginners Allowed!", 
    "price": "50.00", 
    "instructors": "Jason Teteak", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137250_91b9_9.jpg", 
    "course_url": "https://www.udemy.com/world-class-train-the-trainer-program/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-23T20:50:54Z"
}