{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will teach you some of the many ways comedians make people laugh with their thoughts and stories.<br></p><p>In turn, you will learn how to make <strong>your own</strong> thoughts and stories hilarious!<br></p><p>This course is a <strong>beginner&#039;s guide to learning stand up comedy</strong> and will explain and instruct you how to write and deliver jokes.&nbsp; The advice and tips in this course can be also be applied to many everyday situations and helpful to many different people: <br></p><p>1. Learn amazing public speaking skills (<strong>stand up comedy is the easiest way to get speaking time</strong> in front of people).&nbsp; I will tell you how to get stage time and how different shows are structured.<br></p><p class=\"PIN_1373073445420_hazClick\">2.&nbsp; Learn how to make your <strong>stories funnier in everyday conversation</strong>.&nbsp; This course will go into detail about <strong>what you should write about</strong> and <strong class=\"PIN_1373073445420_hazClick\">the different writing devices used to make your ideas funny</strong>.</p><p>3.&nbsp; Spice up your current public speaking skills with joke writing and comedy writing devices.&nbsp;&nbsp;<strong>This course will explain all the components needed to make an audience laugh. </strong></p><p>4.&nbsp; Conquer a fear of public speaking.</p><p>5.&nbsp; Learn the beginning process involved in stand up comedy and the what it takes to perform stand up on a regular basis.&nbsp; <strong>Most people are huge fans of stand up comedy but they have no clue what the process is like. </strong></p><p>6.&nbsp; You will also learn timing and delivery techniques that will allow you to <strong>speak with conviction</strong> and maximize the amount audience members pay attention to you!<br></p><p>7.&nbsp; Also, there are some specific ways that you should <strong>network and market your abilities</strong> in the comedy world.&nbsp; This course will explain some of the most effective methods.<br></p>  ", 
    "end_date": null, 
    "title": "Ultimate Beginner's Class to Learn Stand Up Comedy", 
    "price": "25.00", 
    "instructors": "Philippe Schafer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50139_a6fd_7.jpg", 
    "course_url": "https://www.udemy.com/ultimate-beginners-guide-to-stand-up-comedy/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-17T00:36:18Z"
}