{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>How to Make Simple Talking Head Video</p><p>Imagine yourself as the spokesperson/star of your own website and social media forums. You can become your own best spokesperson. You can now stand out from all of your competitors who are still stuck in the text-only, pre-video era.</p><p>This &quot;How to Make Simple Talking Head Video&quot; course will teach you exactly how to make talking head videos that you can be proud of. The biggest problem most people have in making simple talking head videos is not the technology. The greatest challenge is looking comfortable, confident and relaxed. This course will teach you exactly how to look your best and come across as confident. </p><p>Why risk even one more day of relying on boring, mundane text to sell your products, services or organization? Your website and social media platforms can come alive today with simple talking head videos starring you. Sign up today for this course today. Course updated on July 27, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee. </p><p>TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe. The trainer has produced more than 100 online courses on spoken communication and has produced more than 10,000 talking head videos himself.</p>", 
    "end_date": null, 
    "title": "Video Star: You Can Make Simple Talking Head Video", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338646_7583_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-simple-talking-head-video/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T18:04:29Z"
}