{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In diesem Kurs erfahren Sie,</p><ul><li>was Wertschätzung wirklich ist.</li><li>wie Sie Wertschätzung authentisch und wirkungsvoll einsetzen.</li><li>wie Sie durch Wertschätzung erfolgreicher werden.</li></ul><p><br></p><p>Die Situation: </p><p>Jeder Mensch will und braucht Wertschätzung. Richtige Wertschätzung spricht uns an, gibt uns vertrauen, motiviert und inspiriert uns.</p><p>Die meisten Menschen sind überzeugt Wertschätzung zu kennen und einzusetzen. Aber noch nie war der Bedarf größer an Wertschätzung als heute.<br>Sprechen Sie mit den Mitarbeiterinnen und Mitarbeiter, werden diese es Ihnen bestätigen.<br>Sogar Studien belegen diesen Mangel an wirkungsvoller Anerkennung:<br>67% der Mitarbeiter berichten, dass sie keine oder sehr wenig Anerkennung erfahren. (Während 81% der Führungskräfte behaupten, Anerkennung regelmäßig zu geben.)</p><p>Die Ursache:</p><p>Die Welt dreht sich schneller und vieles wird unpersönlicher. Besonders in der Arbeitswelt reduzieren sich die Kontakte auf fachlichen und schnellen Informationsaustausch. Der Faktor Mensch wir immer weniger berücksichtigt. Stress und Zeitmangel lassen es für jeden - für den Kollegen oder die Führungskraft - eine Herausforderung werden, persönliche Verbindungen aufzubauen. Verbindungen, über die man sein Umfeld und sich selbst motivieren und inspirierend kann und somit ein erfolgreiches und erfülltes (Arbeits-)Leben zu führen.</p><p>Die Lösung:</p><p>Erkennen Sie durch diesen Kurs, wie Sie Wertschätzung vorleben und geben können. Auch oder gerade dann, wenn es schwierig wird und/oder die Beziehung unter einem schlechten Stern steht. Sie lernen, Wertschätzung zu zeigen UND wertschätzend zu sein - ohne sich zu verstellen und somit seine volle Authentizität zu bewahren.<br></p><p>Wertschätzung überträgt sich. Wertschätzung ist ansteckend.<br> Fangen Sie JETZT an!</p><p>Der Weg:</p><p>Der Kurs enthält 14 kurze Videos (max. 3 Minuten Länge) und 14 Aufgaben, welche jeweils einem Video zugeordnet sind. Bei jeder Aufgaben können Sie zwischen 3 Level wählen und so Ihren persönlichen Schwierigkeitsgrad auswählen, abhängig von Ihrer Zeit oder Ihrer Möglichkeit, die Aufgabe kurz oder intensiver zu bearbeiten.<br>Wenn Sie jeden Tag eine kurze Aufgabe bearbeiten, dauert der Kurs genau zwei Wochen.<br></p><p>Warum?</p><p>Weil Sie mit diesem Kurs in Zukunft wertschätzender sein werden! Sie werden Wertschätzung bewusster und wirkungsvoller einsetzen. <br>Ihre beruflichen aber auch privaten Beziehungen werden gestärkt und vertrauensvoller. <br>Sie erlernen somit die Basis für die Gestaltung erfolgreicher Beziehungen. Erfolgreich für Sie und für Ihr Team und Umfeld!<br> </p>", 
    "end_date": null, 
    "title": "Was Wertschätzung wirklich ist", 
    "price": "20.00", 
    "instructors": "Gangolf Neubach", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660222_e6c2.jpg", 
    "course_url": "https://www.udemy.com/was-wertschatzung-wirklich-ist/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T17:57:48Z"
}