{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    This course is intended for all English language learners who are interested in the subject of small talk.  </p>  <p style=\"\">  \t    It consists of ten mini lectures in the form of entertaining videos which present strategies for coping with those uncomfortable moments when you don&#039;t know what to say at a party (or any other social occasion!).  </p>  <p style=\"\">  \t    In addition, each lecture is accompanied by a worksheet which contains a bunch of language/communication focused exercises, tips and hyperlinks, all related to small talk and the subject area of a given mini lecture in particular.  </p>  <p style=\"\">  \t    The course has about 30 minutes worth of video content. Each worksheet will take you anything from 10 minutes up to 1 hour to complete.  </p>  <p style=\"\">  \t    In fact, we hope that the videos and worksheets will inspire you enough to do your own online research into each subject area :)  </p>  <p style=\"\">  \t    Why take this course?  </p>  <p style=\"\">  \t    Because after completing it:  </p>  <ul style=\"\">  \t<li style=\"\">you will expand and/or revise vocabulary relating to and useful for small talk</li>  \t<li style=\"\">you might come to love small talk, or at least you will see that it&#039;s not as scary as it sometimes seems :)</li>  \t<li style=\"\">you&#039;ll have fun!</li>  </ul>  <p style=\"\">  \t    Enjoy!  </p>", 
    "end_date": null, 
    "title": "What to Say When You Don't Know What to Say", 
    "price": "20.00", 
    "instructors": "Worldwide School", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145682_3004_5.jpg", 
    "course_url": "https://www.udemy.com/what-to-say-when-you-dont-know-what-to-say/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-11T22:34:09Z"
}