{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Based on experience, in many cases, there may be a perception that the safety professional is fully responsible for all safety efforts in the organization. Sometimes the safety professional will tend to go day-by-day trying to change the culture of the organization without attempting to gain any support from the Leadership team.</p>\n\n<p> \tUnfortunately, in many organizations, the image of the safety \nposition is a person who goes through the workplace looking for things \nthat are wrong, can only quote regulations, and usually offers only one \nmajor solution, the use of personal protective equipment (PPE). Usually \nPPE is linked to promoting safety awareness, as the thinking is that PPE\n will solve everything. Many times, PPE becomes the default solution for \nmany situations. While PPE has its place, it is not the solution to all \nsafety-related issues, as some may think.  PPE is only one aspect of a \ngood safety management system.\n</p>\n\n<p> \tTherefore, the image is that PPE is typically the main focus, \nand the role of safety is playing “gotcha” with the supervision and \nemployees instead of focusing on the potential for serious important \nhidden hazards.\n</p>\n\n<p> \tAlso, when someone is injuries, the typical root cause/solution\n is to just train or re-train the employee to fix the problem. Again, \ntraining or re-training becomes the default solution.\n</p>\n\n<p> \tIn many cases, hazards that need to be addressed and resolved \nare sometimes overlook, as it is clouded by the PPE and Training Issue.\n</p>\n\n<p> \tThis may be based on the formal job description and/or direct \nmandates from the leadership team as just “Do it” with an implied stay \nout of our way!\n</p>\n\n<p><strong>Lesson Learned</strong>\n</p>\n\n<p> \tA colleague has asked supervisors and managers over a number of\n years to define safety in supervisor training classes and \npresentations.\n</p>\n\n<p> \tThe definitions he received include:\n</p>\n\n<ul><li>Preventing accidents or injuries;</li><li>Freedom from harm or injury;</li><li>Being safe;</li><li>Being aware of your surroundings;</li><li>Not getting hurt;</li><li>It's number one;</li><li>Following procedures and rules;</li><li>It is a state of being;</li><li>Looking out for each other;</li><li>Complying with OSHA;</li><li>Going home the same way you came to work.</li></ul>\n\n<p> \tThe issue of defining safety is still a major area of confusion.\n</p>", 
    "end_date": null, 
    "title": "Why is it Important to Understand the Perception of Safety?", 
    "price": "30.00", 
    "instructors": "James Roughton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482110_6469_2.jpg", 
    "course_url": "https://www.udemy.com/why-is-it-important-to-understand-the-perception-of-safety/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T13:20:06Z"
}