{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t     For the last two decades, book series authors have dominated Amazon&#039;s and New York Times&#039; best seller lists.  Most of the top sellers each year have been authors who decided to write a book series.  </p>  <p>  \t     In April 2014, Amazon.com and Kindle created new links on the home book pages of their websites with direct links to book series titles.  Kindle has also changed the internal page structure on their site to make it even easier to discover and purchase titles by book series authors.  </p>  <p>  \t     The caveat is that you have to write a book series to take advantage of the benefits and visibility that Amazon has recently built into their website.  </p>  <p>  \t     This course helps you understand how to benefit when you write a series instead of a stand-alone book title.  You&#039;ll discover:  </p>  <p>  \t     o  how competitive Amazon and Kindle have become, and why having a book series will give you more areas on their sites to list your books;  </p>  <p>  \t     o  how to write and leverage your series -- with your readers, the media, and with other online booksellers;  </p>  <p>  \t     You&#039;ll also learn what bestselling authors in a number of genres have done to brand themselves and their titles.  Between them the authors covered have sold well over 200 million books.  Find out what they did beyond selling books to exponentially increase their businesses, get more media coverage and appeal to readers from one book to the next.  </p>  <p>  \t     Also find out:  </p>  <p>  \t     o  what you can do to write your book series;  </p>  <p>  \t     o  what to consider and do as you do create, write and market your series; and  </p>  <p>  \t     o  how and why writing a book series has the potential to provide you with more opportunities to have readers and the media find your titles online.  </p>  <p>  \t     You will receive writing tips specific to book series.  The topics covered in the lectures will also be useful if you decide to write a standalone book instead.  </p>  <p>  \t     What you should know:  There are many other fine courses you can take to learn to outline, structure and write your book.  This course gives you ideas and tips to:  </p>  <p>  \t     o  more easily develop your series;  </p>  <p>  \t     o  brand yourself as an author;  </p>  <p>  \t     o  create a website SEO structure to help you position yourself as an expert; and  </p>  <p>  \t     o  consider business ideas that can take you beyond writing a book into other complementary business areas.  </p>  <p>  \t    This course has been given as a workshop to top authors at online and physical writers&#039; conferences.  The content has been updated and the latest trends and research are included.  </p>  <p>  \t    Take this course if you love to read book series, and want to write books.  You can also take this course if you have a longer title, and want to break it up and re-release it as a series to take advantage of Amazon and Kindle&#039;s new program and listings for book series authors.  </p>", 
    "end_date": null, 
    "title": "Writing a Book Series to Profit, Brand, Get Media & Have Fun", 
    "price": "30.00", 
    "instructors": "Julia Hidy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/196970_b982_4.jpg", 
    "course_url": "https://www.udemy.com/writing-a-book-series-to-brand-get-media-have-fun/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-10T17:09:38Z"
}