{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn the 10 key ingredients that must go into every bestselling book proposal. Then pave the way for that proposal by finding an agent and learning how to pitch your proposal succinctly so that it gets past the gatekeepers and lands a contract with a major publishing house.</p><p><strong>Master the Proposal Process and Stop Wasting Time</strong></p><p>Brainstorm 10 ways to craft titles that tease editors to take a look</p><p>Learn how to do a competitive analysis to include in your proposal</p><p>Create the all-important marketing plan and learn when to do what</p><p>Differentiate between your author bio and your resume</p><p>Identify the 10 things every bestseller has in common</p><p><strong>A Powerful Knowledge Base and Writing Skill at Your Command!</strong></p><p>Have you ever heard would-be authors tell you that selling to the major publishers is too difficult? That your chances are \"slim to none\"? Don't be fooled. Editors need new books every season. Agents love to find new writers. But according to my editor and agent friends, many would-be writers do get rejected because they do NOT take the time to learn how to write a proposal or a query!  </p><p>They simply write a complete manuscript and send it off. That's like building a product without any research in to what customers want or need, and then hoping someone will buy it! This course will show you the appropriate publishing protocol.</p><p>After completing this course, you'll know exactly what editors and agents expect to see in your nonfiction proposal. Not only will you know the 10 elements they will be looking for, but also you will know exactly WHAT goes in each section and HOW editors will evaluate each section.</p><p>The comprehensive marketing lectures suggest far more ideas than you can possibly use to promote any one book--no-cost, low-cost, and more expensive ideas. Some easy. Some time-intensive. Select according to your topic, time, and budget.</p><p>You'll also receive a proposal template to download.</p><p>In the section on queries, you'll learn the 6 items to include in your letter, email, or face-to-face pitch. And you can download two sample query letters as go-bys.</p><p>In total, you'll have 37 video-recorded lectures available to listen at your leisure and for replay as necessary, plus downloadable worksheets, while you finish your proposal and interview an agent to represent you and close your first--and your next--book deal.</p><p><br></p>", 
    "end_date": null, 
    "title": "Write Your Book Proposal & Pitch", 
    "price": "35.00", 
    "instructors": "Dianna Booher", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700190_9c07_4.jpg", 
    "course_url": "https://www.udemy.com/write-your-book-proposal-pitch/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T18:54:13Z"
}