{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Over my decades as a Writing Coach, I’ve realised that many writers need more than just being shown new writing skills to improve. To really improve they also need ongoing support as they learn how to successfully incorporate those new skills into their writing.</p>  <p>As the title implies, this course includes plenty of clearly-explained tutorials on practical, important (and often over-looked) writing skills, but equally as crucial, it also comes with the vital ongoing support. There are quizzes, examples, homework (if you want it), the opportunity to have your questions answered, to join a growing community, and even, on occasion, to get feedback on your work. Or, if you prefer, you can just study the course then go off and do your own thing. The choice is yours.</p>  <p>As a Freelance Writer and Writing Coach, I’m here basically to help you achieve your writing goals, and in many cases this course is the first step. So please click on the ‘Take this Course’, and I’ll be happy to teach you what you need to learn and help you while you become comfortable using the techniques.</p>  <p>On the other hand, if you’re still a little unsure, don’t forget this course comes with a FULL, 30-day money-back guarantee, which means that if you change your mind within the first 30-days and let us know, you’ll get a complete refund.</p>  <p>Also, if you scroll a little further down the page, you’ll find some of my video tutorials are marked as ‘Previews’; this means you can watch them before enrolling to be sure my teaching style suits you.</p>  <p>Well, there you go. Hope this course sounds like what you need and I look forward to helping you soon.</p>", 
    "end_date": null, 
    "title": "Writing Skills: Go from average to great writer overnight!", 
    "price": "20.00", 
    "instructors": "Elizabeth Bezant", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/261566_6725_11.jpg", 
    "course_url": "https://www.udemy.com/writing-tips-to-instantly-improve-your-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-15T04:38:59Z"
}