{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                        Taught by author/writing coach Doug Kurtz, this course is for novelists and short fiction writers who are ready to walk the talk and start crafting dialogue that drives plot, develops characters and keeps the pages turning.  </p>  <p>  \t            Fast-paced video instruction (approximately 45 minutes), on-screen examples, self-guided exercises and quizzes will help you master dialogue mechanics, attribution and beats, and leverage these core elements into more dynamic, revelatory conversations.  </p>  <p>  \t                  When the course is over, you&#039;ll know:  </p>  <ul>  \t<li>Why agents and publishers look at dialogue to judge the quality of a manuscript</li>  \t<li>Why dialogue must give readers the experience of eavesdropping on characters</li>  \t<li>How to write dialogue that serves the needs of the story, not the writer</li>  \t<li>How to avoid writing expository dialogue that patronizes the reader</li>  \t<li>How to properly format and punctuate dialogue</li>  \t<li>How to use punctuation to create conversational effects that mimic real speech</li>  \t<li>How to write transparent attributions (tags) that strengthen your dialogue</li>  \t<li>How to avoid self-conscious attributions (tags) that pull readers out of the story</li>  \t<li>How to write dialogue beats that vivify, texture and pace your story conversations</li>  \t<li>How to write beats that &#039;show&#039; their meaning rather than foisting it upon the reader</li>  \t<li>How to detect and revise common dialogue beat &#039;offenses&#039;</li>  \t<li>How to bring the course material into your writing without feeling overwhelmed</li>  \t<li>Lots more...</li>  </ul>  <p>  \t            The course is broken into two sections--&quot;Small Talk&quot; and &quot;Conversation&quot;--each of which consists of three compact, text-enhanced lectures. In addition to short-answer quizzes, sections include writing, reading and observation exercises that MUST be completed before students can expect to bring the course material successfully into their writing.  </p>  <p>  \t      This course is the first in a two-part series designed give serious writers the knowledge and skills they need to craft publishable, professional-level dialogue. <span>You&#039;ll leave more intelligent, intentional and informed about how you approach this key aspect of storytelling.</span>  </p>", 
    "end_date": null, 
    "title": "Writing Dynamic Dialogue 1 - Basics", 
    "price": "30.00", 
    "instructors": "Doug Kurtz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280384_4386_9.jpg", 
    "course_url": "https://www.udemy.com/writing-dynamic-dialogue-1-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T19:20:31Z"
}