{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5>How to turn your life into a book, your memoir</h5>  <p>  \t  Turning your life into memoir is simpler than you think.  In this 90 day programme, I take you on a journey through your life, helping you to decide what slice of life you will share and then editing it so that it engages with your readers.  </p>  <p>  \t  You don&#039;t have to have had a tough life to write a memoir, you can write yours to provide a legacy for future generations or you can just write it because you can.<br style=\"\">  \t <br style=\"\">  \t   You don&#039;t even have to publish it, but just imagine if you did, imagine giving your book to friends and family....  </p>  <h5>Writing your memoir gives you truth and clarity.  </h5>  <p>  \t  It can be happy, sad, funny, scary, cutting or kind, but most of all, its about you, your life and your truth - the way you see and have experienced it.  </p>  <p>  \t  Even if you think that all you have done is gone from birth to where you are now with nothing exciting to share, I would beg to differ.  I bet there is much more to your life, than you give yourself credit for.<br style=\"\">  \t <br style=\"\">  \t   Memoir lets you share your stories, in a way that lets others see what you went through (good or not so good), shows who you are and says &#039;maybe I can help you, maybe you can learn from me.&quot;  </p>  <p>  \t Your memoir could be your story, you could write it because you need to heal, or you can turn it into a self help book, where you provide advice to others. Whichever you choose, this course will help you to plan it, write it, edit and get it self published.  </p>  <p>  \t  The challenge is to get started.  Let me take you on a journey that will make writing your memoir as stress free and easy as possible.  </p>  <p>  \t  Join me for the next part of your life and writing adventure  </p>", 
    "end_date": null, 
    "title": "Writing your life story.  Turning memories into memoir", 
    "price": "20.00", 
    "instructors": "Jacqui Malpass", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/39718_5e15_7.jpg", 
    "course_url": "https://www.udemy.com/writing-your-life-story-turning-memories-into-memoir/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-03T05:57:33Z"
}