{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p></p><p><strong>Overview</strong></p><p>Writing to heal takes you on a journey that asks you  to first pick up your pen and write in a journal.&nbsp; To then reflect on what you have written and  rewrite it with positive intention, so that you change your story.</p><p>As you change the way in which you view life and  your story, your life will change.&nbsp; Add  in the dimension of creative  writing exercises, through short stories, prose or poems, suddenly  you are on an adventure where you are in control of your destiny.&nbsp; You can now decide what happens to the  characters and what the outcome of the tale might be.</p><p>Let me hold your hand and guide you the process I  use with my coaching clients.</p><p><strong>Course structure</strong></p><p>We start by looking at what journaling is and in the  first few modules get you started on your journaling journey and writing each  day.</p><p>There are a number of different creative writing exercises  for you to use as inspiration and kick-starts.</p><p>After you have got used to your daily journaling, it  is then time to start reflecting and included are a number of reflection  exercises, which are designed to help you see where your unhelpful patterns of  behaviour are and to encourage you to change thought patterns, habits, beliefs  and perceptions.</p><p>Both journaling and reflecting are immensely healing  activities in themselves. I have added in creative life writing as I have  witnessed both my clients and myself getting huge benefits from melding fact  with fiction to come up with some factional stories, which put us back in the  driving seat of our lives.</p><p><strong>How long will it take?</strong></p><p>The workshop has been structured over 45 days.&nbsp; Though how you work through the material  should be in a way that suits you. You are encouraged to journal for 30 days to  create a good habit.&nbsp; The exercises are  designed to get you thinking and for you to a) follow in a linear fashion or b)  randomly try things.</p><p><strong>Why take this course?</strong></p><p>This course is for anyone who feels &#039;stuck&#039; and  would like to try a novel approach to changing their life and starting to  heal.&nbsp; Writing is cathartic and when you  add in reflection and creative life writing the opportunities for change and  healing open up.</p><p><strong>What else?</strong></p><p>Many people who use journalling have discovered that  they also have a book inside of them.&nbsp;  You may not want to publish your book, however, this course will lead  you from journaling into creative life writing and give you the confidence to  write a book if you so choose.</p><p>If you can journal you can write, if you can write  short stories you can write a book.</p><p>                                                                </p><p>So start learning these highly creative writing exercises  to reveal your full potential.&nbsp;</p><div><p></p><p></p>  </div>  ", 
    "end_date": null, 
    "title": "Writing to Heal.  Journaling and writing to happiness", 
    "price": "20.00", 
    "instructors": "Jacqui Malpass", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22643_564d_5.jpg", 
    "course_url": "https://www.udemy.com/writing-to-heal/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-11T09:04:15Z"
}