{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                      Can you imagine <strong style=\"\">what life will be like after you&#039;ve written your first ebook?</strong>  </p>  <p>  \t                      Writing my first ebook opened doors beyond anything I could imagine.  </p>  <p>  \t                      In just the span of <strong style=\"\">two</strong> months:  </p>  <p>  \t<em style=\"\">-I’ve made almost <strong style=\"\">$2000</strong><br style=\"\">  \t                      -got invited to speak at a prestigious conference (UPDATE:and one more to come in Jan 2015)<br style=\"\">  \t                      -and received <strong style=\"\">5 </strong>job offers.</em>  </p>  <p>  \t                      All these from my first and very own self-published ebook on crowdfunding, <strong style=\"\"><em style=\"\">The Crowdfunded Kit.</em></strong>  </p>  <p>  \t                      If there&#039;s one thing I could reassure you, it is that I started out as a complete <strong style=\"\">unknown </strong>- no email list, no reputation, no connections. But yet, I still managed to experience some success.  </p>  <p>  \t                      There are many others like me who have achieved way more, simply writing on topics so small and targeted that no book publishers would consider them.  </p>  <p>  \t                      So, I know that this ebook writing thing <strong style=\"\">really works. </strong>  </p>  <p>  \t                      With a great topic and the right marketing tactics you can make a living from teaching as well. And you can start- just like me- without an audience.  </p>  <p>  \t                      Nothing is kept secret - I reveal all I know ... and as I continue learning how to write and market my books better, those techniques that are successful are added to the course - at no extra cost to you! This is a course that will continue to grow and grow.  </p>  <p>  \t                      As well as the Udemy 30 day guarantee, you have my personal promise that you will be delighted by what you&#039;ll learn in the next 4 hours ... and you&#039;ll be kicking yourself if you already had a book idea but are missing out on fabulous potential opportunities to earn a nice side income.  </p>  <p>  \t                      So if you want someone who’s been there, done that to walk you through self-publishing <strong style=\"\">your own ebook for profit</strong>, you need to get this course now ... right this minute.  </p>  <p>  \t<strong style=\"\">Every minute you delay is actually COSTING you money.</strong>  </p>  <p>  \t<strong style=\"\">Enroll by clicking the &quot;take this course&quot; button, top right, now.</strong>  </p>", 
    "end_date": null, 
    "title": "Writing Your Book", 
    "price": "20.00", 
    "instructors": "Johnathan Leow", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328010_2ade_3.jpg", 
    "course_url": "https://www.udemy.com/writingforprofits/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T09:52:52Z"
}