{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Dialogue is one of the hardest aspects of writing for most authors, but through this training, I will show you <strong class=\"redactor-inline-converted\">how to easily create dialogue that your readers will love.</strong></p>\n\n<p>I will show you areas where inexperienced authors <strong class=\"redactor-inline-converted\">make a mess of writing dialogue so you don't do the same.</strong></p>\n\n<p>I will show you how to easily have correctly formatted dialogue, with the essentials needed to get your editing right.</p><p><strong class=\"redactor-inline-converted\">Writing good dialogue can help you get higher reader reviews and sell more books</strong> and you will have the confidence to write dialogue, even if you have never done so in the past.</p>\n\n<p>You will understand why dialogue is <strong>so important to your success as an author.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">You will learn techniques to make writing dialogue easier </strong>and boost your ability to write a lot more words more easily.</p>\n\n<p><strong class=\"redactor-inline-converted\">There are currently 33 lectures and over an hour of content.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">There are downloadable files and transcriptions of each video.</strong></p>\n\n<p>I’ve structured this course in a simple methodical way based on the best results I’ve had from training thousands of people in book publishing.</p>\n\n<p><strong class=\"redactor-inline-converted\">You will gain confidence and knowledge that will help you write better stories more easily.</strong></p>\n\n<p>I’ve kept the lectures short and to the point while covering everything you need to succeed.</p>\n\n<p><strong class=\"redactor-inline-converted\">You can go away in the next day with a whole new understanding of how to write dialogue </strong>that your readers will love, that you will enjoy writing, and will make you a more accomplished writer with well edited books that are great to read.</p>", 
    "end_date": null, 
    "title": "Write Blockbuster Books Readers Love with Dead Easy Dialogue", 
    "price": "20.00", 
    "instructors": "Geoff Shaw", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856314_5aef_2.jpg", 
    "course_url": "https://www.udemy.com/dead-easy-dialogue/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-22T03:59:29Z"
}