{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Writing a novel or a creative nonfiction book? <strong>Join over a thousand satisfied students who have given dozens of five-star reviews </strong>in this course where you'll learn how to draw in agents, editors, and readers with your voice. </em></p>\n\n<p>  \t<strong>Narrative Voice for Novelists: How to Suck in Readers From Page One </strong></p>\n\n\n\n<p>  \t          This is part of a series of writing courses, taught by literary agent Sally Apokedak, that will help you if you are trying to get an agent, sell to a publisher, or sell your self-published books directly to the reader. After reading thousands of queries, Sally has come to believe that four things are essential if you want to write novels that will sell.  </p>\n\n\n\n<p>  \t<strong>VOICE is one of those essentials. It's the first thing agents notice when they open your manuscript or book. </strong></p>\n\n\n\n<p>Whether you're writing novels or creative nonfiction books, this writing course can help you. If you're unpublished and having a hard time breaking in or if you're published but having a hard time breaking out, this course will help you. <strong>You get the voice lectures that Sally gives at writers' conferences around the United States, but you get them at a fraction of what they normally cost. </strong>Plus, you can take them in your own home, at your own pace, you don't have to pay for a hotel, and you have lifetime access to these lectures.</p>\n\n\n\n<p><strong>WHAT PEOPLE ARE SAYING </strong>about this course:</p>\n\n\n\n<p>~~~~~</p>\n\n\n\n<p>THIS is the course that will shower you with confidence and give your voice the punch it needs.</p>\n\n\n\n<p>~ Robyn</p>\n\n\n\n<p>~~~~~</p>\n\n\n\n<p>Sally is a wealth of knowledge . . . I'm looking forward to taking more of Sally's classes on Udemy.</p>\n\n\n\n<p>~ Cheryl</p>\n\n\n\n<p>~~~~~</p>\n\n\n\n<p>Sally is a great teacher and is obviously extremely knowledgable . . . The topics move quickly, and you won't be bored.</p>\n\n\n\n<p>~ Hannah</p>\n\n\n\n<p>~~~~~~</p>\n\n\n\n<p>Sally is a very enthusiastic and involved instructor and makes the course valuable and enjoyable for everyone.</p>\n\n\n\n<p>~ Rachel</p>\n\n\n\n<p>~~~~~~</p>\n\n\n\n<p>I can understand why Sally Apokedak is a sought-after teacher at writer's conferences. First, Sally (if I may) knows her stuff. . . .</p>\n\n\n\n<p> ~ Deborah</p>\n\n\n\n<p>~~~~~~</p>\n\n\n\n<p>This class shows you both the science and art of writing. . . . If she produces another course, I will be sure to return!</p>\n\n\n\n<p>~ Rebecca R.</p>\n\n\n\n<p>~~~~~~</p>\n\n\n\n<p>The material is fun and easy to learn . . . I highly recommend any writer or aspiring writer take it to improve their writing.</p>\n\n\n\n<p>~ Teresa</p>\n\n\n\n<p><strong>WHAT PEOPLE ARE SAYING</strong> about Sally's conference classes, retreats, and online courses:  </p>\n\n\n\n<p>. . .  thank you again for a fabulous weekend. I left encouraged and energized . . . It was a wise investment and fun.</p>\n\n\n\n<p>  \t            ~ Jean Wilund  </p>\n\n\n\n<p>  \t            ~~~~~~~~~  </p>\n\n\n\n<p>  \t            Sally,  </p>\n\n\n\n<p>  \t            We had so many wonderful comments about you and your class on our evaluations. We hope you'll be able to join us again next summer.  </p>\n\n\n\n<p>  \t            Blessings, Lindy Jacobs, OCW Summer Conference Director  </p>\n\n\n\n<p>  \t            ~~~~~~~~  </p>\n\n\n\n<p>  \t            Hello Sally,  </p>\n\n\n\n<p>  \t            I hope you realize how much wisdom and knowledge you imparted during your time at the wik13 conference in Birmingham.  . . .</p>\n\n\n\n<p>  \t            ~ Heather L. Montgomery  \t            Assistant Regional Advisor  \t            Southern Breeze SCBWI  </p>\n\n\n\n<p>  \t            ~~~~~~~  </p>\n\n\n\n<p>  \t            Thank you for your incredible class. It was a valuable, valuable learning experience. . . . </p>\n\n\n\n<p>~ Kimberly</p>\n\n\n\n<p>  \t            ~~~~~~  </p>\n\n\n\n<p>  \t            Thank you so much. I got a lot out of the class and it gave me a lot to think about. I'm grateful for all the feedback.  </p>\n\n\n\n<p>  \t            ~ Christie  </p>\n\n\n\n<p>  \t            ~~~~~~  </p>\n\n\n\n<p>  \t            Thank you so much for your feedback . . . throughout the course. I appreciated how much you know about this field and your willingness to share your expertise.  </p>\n\n\n\n<p>  \t            ~ Sandy  </p>\n\n\n\n<p>  \t            ~~~~~~  </p>\n\n\n\n<p>  \t            In Sally's video lectures, she made me think about writing like I hadn't before, especially the weeks about voice and theme.</p>\n\n\n\n<p>  \t            ~ Margo L. Dill  </p>\n\n\n\n<p>  \t        ~~~~~~~  </p>\n\n\n\n<p>  \t<strong>What this course promises: </strong>  </p>\n\n\n\n<p>  \t        To teach you how to make your voice more interesting and compelling in the fiction and creative nonfiction you write.  </p>\n\n\n\n<p>  \t<strong>What this course does not promise:</strong>  </p>\n\n\n\n<p>  \t        That you'll get a book contract.  </p>\n\n\n\n<p>  \t<strong>  Some questions this course answers:</strong>  </p>\n\n\n\n<ul>  \t<li>How do I write in the  close-third-person point of view?</li>  \t<li>Should I be writing in past tense or present tense?</li>  \t<li>How can I improve my narrative voice when I write fiction or creative nonfiction?</li>  \t<li>How can I make up fresh metaphors in a novel I'm writing?</li>  </ul>", 
    "end_date": null, 
    "title": "Writing Fiction That Sings:  Write Novels With Great Voice", 
    "price": "20.00", 
    "instructors": "Sally Apokedak", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376096_a692_6.jpg", 
    "course_url": "https://www.udemy.com/narrative-voice-for-novelists/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-23T06:20:29Z"
}