{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            In <strong>Writing So Hot It Burns</strong> you will learn to ignite the artistry of your writing by using the tricks of the writing trade for choosing the perfect words and sentence cadences to make your writing come alive on the page. Break out of the pack of ho-hum writers by mastering \"wordsmithing.\"  </p>  <ul>  \t<li>The <em>right</em> word, instead of the good-enough or almost-right word, makes all the difference in producing high-impact writing, whether you are writing fiction, non-fiction, or poetry. </li>  \t<li>The <em>perfect</em> sentence cadence and rhythm adds atmospherics to your writing that can be worthy of a movie set-decorator Oscar.</li>  </ul>  <p>  \t        This course is chock full of creative writing exercises, so get your laptop, tablet or pen and pad of paper ready.  </p>  <ul>  \t<li>You will practice, practice, practice, after learning from examples from great writers.</li>  \t<li>You will learn to read like a writer, so you can benefit from the mastery of other writers and put that artistry to work in your own writing. </li>  \t<li>Breakout slides provide definitions and deeper insights into specific writing techniques. </li>  \t<li>Bonus creative writing exercises will help you master the lessons long after the course is done.</li>  </ul>  <p>  \t        The best writers are such masters of wordsmithing that they disappear, leaving readers deeply immersed in the world they have created on the page. No writer can excel at their craft unless they are masters of their tools: words and sentences.  </p>  <p>  \t            Are your ready to take your writing from sizzling to red hot? Then let's get started!  </p><p><strong>NOTE: Please use Chrome as your browser for this course. You may experience difficulties with other browsers. </strong></p>  <p><br></p>", 
    "end_date": null, 
    "title": "Writing So Hot It Burns", 
    "price": "20.00", 
    "instructors": "Joan Parisi Wilcox", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430248_7e7e.jpg", 
    "course_url": "https://www.udemy.com/writing-so-hot-it-burns/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T19:54:22Z"
}