{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Writers Tips</strong>  </p>  <p>  \tWriters tips is a course that answers questions that you may not even know that you had about writing and editing your book. It is designed to make writing your book easier and stress free.  My objective is to provide you with practical help which you would expect from a book coach. I want to help you to be more productive, using tools you already own. To start and keep writing, learn to love editing, how to engage better with your reader and get that book finished.  </p>  <p>  \t How does it work?  </p>  <p>  \tI have collated questions from my writing students and put together a series of answers to those questions. These are in the course, grouped together by subject area.  </p>  <p>  \t You will learn how to:  </p>  <ul style=\"\">  \t<li>Set up WORD so that it becomes your friend and you create better books with a tool that you know.</li>  \t<li>Be more productive</li>  \t<li>How to be a better editor and learn to love editing</li>  \t<li>How to connect and engage with your reader</li>  </ul>  <p>  \tOver to you  </p>  <p>  \tEvery time you ask a question, I will create a new module for you and in that way, this community will grow and everyone will learn.<br style=\"\">  \t <br style=\"\">  \t  What would you like to know?  </p>", 
    "end_date": null, 
    "title": "Writers Tips – practical advice for creating better books", 
    "price": "20.00", 
    "instructors": "Jacqui Malpass", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48481_d536_7.jpg", 
    "course_url": "https://www.udemy.com/writers-tips-practical-advice-for-creating-better-books/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-04T05:16:56Z"
}