{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>\"Give me one hour and I will have you writing your own, HIGH QUALITY \"How To\" book AND it will also be a book that SELLS!\"</em></strong></p><p><strong>Have you ever wanted to write your own \"How To\" book, but just weren't sure how to get started?</strong></p><p><strong>Do you want to help thousands of people with your book, but are nervous about the process?</strong></p><p><strong>Want to earn a new, passive income with your \"How To\" book, but you seem to get \"stuck\" all along the way?</strong></p><p>If you want the benefits of writing your own book:</p><ul><li>\"Expert\" status among your prospective customers, audience and peers</li><li>Credibility &amp; authority positioning</li><li>An additional stream of passive income</li><li>Helping thousands of people with your message</li></ul><p><br></p><p>Then, be sure to check out the free preview lectures below, because I am going to show you a super-simple system for writing your book that is quick, easy and painless!</p><p>Not only that, but I'm also going to show you how to write a book that SELLS.</p><p><em>You see, it's one thing to write a book, but it's an entirely different thing to create a book that SELLS!</em></p><p><em><strong>I've written over a dozen books and have sold 300,000 copies of my books to people all over the world, so I know what I'm talking about when it comes to writing books that sell!</strong></em></p><p>The feeling you get when you know you've helped hundreds of thousands of people with your message is PRICELESS!</p><p>I want that for you.</p><p>So, I've come up with a course that is more like a powerful \"workshop\" in that, throughout the course, I give you step-by-step activities and actions to take in order to bring you to your goal of having your own book written and published!</p><p>This is a short course (less than one hour) but it is POWER PACKED with ONLY the information you need to get up and running with your own book, instantly!</p><ul><li>No more struggling with \"what do I do now\"?</li><li>No more \"getting stuck\" with writer's block...</li><li>No more wondering if you're doing it right, or failing miserably.</li></ul><p>Believe me, with this course, (and my help inside this course) you can do this!</p><p>Very soon, you will have your own \"library\" of books that you can point to - a book catalog that will have people thanking you for helping them through your books!</p><p>You can do it, let me show you the quick and easy way to write your books.</p><p>Enroll today and benefit from Udemy's 30-day, no-questions-asked, money back guarantee!</p><p><br></p>", 
    "end_date": null, 
    "title": "Write A Great How To Book Fast How To Write Books That Sell", 
    "price": "20.00", 
    "instructors": "Dave Espino", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579468_09e2_2.jpg", 
    "course_url": "https://www.udemy.com/writing-easily-write-a-how-to-book-that-sells/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T21:00:25Z"
}