{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ever want to publish your own Kindle book? Self-publishing has changed the entire landscape. You no longer have to pursue a publisher and win their approval. Now all you have to do is win your own approval and start typing your Kindle book.</p><p>But a big problem quickly emerges: <strong>a lack of time combined with a lack of direction</strong>. What do I write about? How do I find the time to write a complete Kindle book?</p><p>You still hold onto the dream of self-publishing your first book, but the time combined with no experience holds you back. Maybe you try to learn on your own, but when you pursue the path on your own, you must endure years of frustration before you know what works.</p><p>That's just the nature of the game. If you go all in with blindfolds, then it takes you much longer to end up on the right path.</p><p>Most people only give themselves two options:</p><ul><li>Give up on your dream of self-publishing your own book</li><li>Go through years of frustration to discover what works</li></ul><p>But I am going to give you a third option. I am going to reveal everything that works for me as an author so I can write Kindle books rapidly. I am going to reveal exactly how I was able to <strong>write over a dozen Kindle books. </strong></p><p>I currently use these tactics to self-publish one Kindle book every month. And the best part is that it's not a huge time burden. I still have time to create one Udemy course every month and spend my time with the people who matter to me the most.</p><p>Most people either quit or do a lot of stumbling before they write content rapidly. You can go on the road less traveled and discover exactly how you can write one Kindle book every month.</p><p><strong>But only if you are ready to take action. </strong></p><p>If you are ready to pursue your dream of building a Kindle Empire, then click \"Take This Course\" now.</p>", 
    "end_date": null, 
    "title": "Write Kindle Books Ridiculously Fast: 1 Book Every Month!", 
    "price": "50.00", 
    "instructors": "Marc Guberti", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782792_4ff5_2.jpg", 
    "course_url": "https://www.udemy.com/write-kindle-books-ridiculously-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T03:27:45Z"
}