{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Writing With Impact: Writing That Persuades</strong> will change the way you write for ever. It's jam-packed with no-nonsense advice on how to win people over with the written word. \n\n  </p>\n\n<p>In <strong class=\"redactor-inline-converted\">Writing With Impact: Writing That Persuades</strong>, you'll learn principles that can be applied to any type of writing - including emails, reports, presentations, sales pages, advertising, blogs and more. \n\n  </p>\n\n\n\n<p>Want to nail that promotion? Inspire your team? Sell a product, service or big idea? If you're serious about your career, you need this course.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What makes this course different from all the other writing courses out there?</strong>\n\n  </p>\n\n\n\n<ul><li>Dozens of practical, real-life examples to illustrate the theory</li><li>Countless free resources for powering up your prose</li><li>A host of writing challenges to practice what you've learned - and get one-to-one feedback from Dr Clare Lynch</li><li>Presented in a witty, engaging style - as entertaining as it is illuminating</li><li>Fun and easy to follow - but never lightweight</li><li>Clear, concise and never repetitive - this is one instructor who practices what she preaches</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>But don't take my word for it. Here's what other students have to say about </strong><strong class=\"redactor-inline-converted\">Writing With Impact: Writing That Persuades</strong>.\n\n  </p>\n\n\n\n\n\n\n\n<p>\"<strong class=\"redactor-inline-converted\">Wow. Within a couple of lectures I was hooked!</strong> Clare is obviously an experienced and knowledgeable writer. Importantly, she has the ability to share that experience and knowledge with her students in a way that is <strong class=\"redactor-inline-converted\">fun and memorable</strong>. I look forward to applying what I've learned in this course within my own corporate environment.\" - Darryl Shields\n\n  </p>\n\n\n\n\n\n<p>\"You won't find a better Instructor on Udemy. Dr. Clare Lynch, is an professional Graduate Level University Instructor who really practices the art and science of teaching and learning. She is also a highly sought after professional writer who provides thorough, on-gong interaction and discussion with the students enrolled in her courses. She also provides<strong class=\"redactor-inline-converted\"> many physical resources such as ebooks and learning guides</strong> in this course and her writers website and blog is <strong class=\"redactor-inline-converted\">a wealth of information and resources for writers and content creators</strong>.\" - Dallas Bowman\n\n  </p>\n\n\n\n\n\n<p>\"I really enjoyed this course. It is packed with valuable tips and insights into the art and science of persuasive writing. <strong class=\"redactor-inline-converted\">Even seasoned copywriters will learn a thing or two from Clare</strong>. From my point-of-view it re-introduced me to the art and power of the metaphor and the idea of creating strong mental images in the mind of your reader. An excellent course. Incredible value for the price.\" - Stephen\n\n  </p>\n\n\n\n\n\n<p>\"From the very first video, I learned how to improve my writing. The lessons are informative and full of helpful information to transform your writing and the writing process. The <strong class=\"redactor-inline-converted\">lessons are short enough to get each point across, and not full of fluff</strong>. I'm so impressed with this course and with the teachings of Dr. Lynch. And, by the way, she's right there with you every step of the way.\" - Patty Johnson\n\n  </p>\n\n\n\n\n\n<p>\"WOW! WOW! WOW! That's all I can say! Clare has the most hypnotizing voice and best British accent EVER!!! She presents this course with poise, expertise and passion, <strong class=\"redactor-inline-converted\">unlike any other course I have reviewed on Udemy so far... PHENOMENAL! </strong>This course is a MUST for ANYONE who is writing anything ever in their lives. You'll ABSOLUTELY LOVE this course (and Clare)! Well worth it!\" - Jurgen Homola\n\n  </p>\n\n\n\n\n\n<p>\"Are you a writer looking for guidance or to hone your writing skill? Take this course. <strong class=\"redactor-inline-converted\">Dr. Clare kept lessons engaging through her wit, direct approach, and her beautiful voice. </strong>The 3 Tweets method eats mind-mapping for lunch.\" - Paul Campillo\n\n  </p>\n\n\n\n\n\n<p>\"I found this course interesting and informative from start to finish. It covers a wide range of aspects, with lots of examples, useful resources and some practical exercises. Claire is a great presenter who explains and illustrates concepts clearly and concisely. A <strong class=\"redactor-inline-converted\">must for anyone wanting to improve their business writing</strong>.\" - Kari Koonin\n\n  </p>\n\n\n\n\n\n<p>\"I cannot recommend this course enough. It will change your writing forever. Once you’ve taken Clare's class, you’ll feel comfortable sitting down to write and you won’t feel overwhelmed. You’ll have a specific structure for how to write and how to edit. <strong class=\"redactor-inline-converted\">This course is priceless. </strong>You’ll be glad you signed up.\" Liat Miriam Gat</p>\n\n<p>\t<strong class=\"redactor-inline-converted\"> You should take this course if you want to: </strong>  </p>\n\n\n\n\n\n<ul>\t<li>Build your confidence and find your voice as a writer</li>\t<li>Learn the skills that allow the top copywriters to earn between £250 and £800 a day</li>\t<li>Use words to persuade your employees, your bosses, your customers or investors</li>\t<li>Communicate complex ideas in a way that inspires your readers</li>\t<li>Hook your readers in from the outset</li>\t<li>Save time by writing less but saying more</li>\t<li>Hone your message down to the stuff that matters</li>\t<li>Structure your work for maximum persuasive power</li>\t<li>Understand the difference between elegant simplicity and dumbing down</li>\t<li>Edit your work so you say what you mean (and mean what you say)</li>\t<li>Craft sentences that are clear, succinct and persuasive</li>\t<li>Use online tools for assessing and boosting your readability</li>\t<li>Distinguish between words that build bridges and words that build barriers</li>\t<li>Find and tell compelling stories that make people see the world your way</li>\t<li>Use the latest findings from neuroscience to craft messages that stick</li></ul>\n\n<p>Enrol now - and change the way you write forever!</p>", 
    "end_date": null, 
    "title": "Writing With Impact: Writing That Persuades", 
    "price": "25.00", 
    "instructors": "Dr Clare Lynch", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/335610_c058_4.jpg", 
    "course_url": "https://www.udemy.com/writing-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-04T11:52:30Z"
}