{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You at Work - Look After Yourself will provide you with knowledge about successfully navigating your workplace.  This course talks about topics that are often not discussed and often not understood until it's too late.  Better armed than not.  If you know and understand where you might harm yourself at work, then you have the knowledge that may avert a disastrous consequence.</p><p>You'll find exercises in the lectures to get you to:</p><ul><li>think about yourself</li><li>think about situations you might encounter</li><li>watch for the others' behaviors to identify their \"hidden agendas\"</li><li>understand why people, you least suspected, will stab you in the back</li><li>become very conscious of your words and action</li></ul><p>I've created this course and the subsequent courses in this topic to help anyone who must work with other people in a job.  Whether that person is a receptionist, a manager or hold any other position in a company or non-profit, everyone should be aware and alert to how they themselves might jeopardize their job without knowing it.</p><p>I've worked in large multi-national companies, small non-profits and big government.  Each workplace has its own \"customs and culture\".  However, there are basics which employees in any of these workplaces can master to successfully navigate the sometimes turbulent waters as well as the calm seas with as little wear and tear as possible.  </p><p>The learning in this course begins your awareness - what should you be looking for?  How should you behave at work?  What forms the foundation and gives you the inner fortitude to handle situations at work?  What do you need to do daily?<br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "You At Work - Are You Absolutely Sure your Career is Helped?", 
    "price": "20.00", 
    "instructors": "Lorraine Arams", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629688_c0d9_3.jpg", 
    "course_url": "https://www.udemy.com/you-at-work-look-after-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T16:09:39Z"
}