{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">I am sorry to tell you this but most online courses are too long, and too detailed, and too boring.</strong> The facts are that only 25% of people who start an online class finish it.  I know that because i have taken boring courses online and when i first began I made many of the same \"boring\" mistakes that you are most likely making.  Then i remembered that before i was an online teacher I was and still am a radio and TV broadcaster  You might be able to be a boring instructor or teacher but if you are a boring broadcaster you are soon out of work and our of business.</p>\n\n<p><strong>So in this class i begin to teach you how to be on the radio and TV and to turn your course into a broadcasting show that hopefully will attract hundreds of thousands of viewers and students.  That can happen you know.</strong></p>\n\n<p>You will learn the power off the \"click and switch\" machine.</p>\n\n<p>You will learn that you are even more important than your content and that you must build a personal brand.</p>\n\n<p>You must know the open secret of the AIDDA formula to make a better class and show.experience.</p>\n\n<p>If you can't tell stories, you better learn or you are out of business both as a teacher and as a broadcaster.</p>\n\n<p>You will be challenged to change your life and the lives of others for the better.</p>\n\n<p>I look forward to you joining me and becoming part of the show!</p>\n\n<p>Stan Hustad</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "You Must Be a Broadcaster To Be a Great Udemy Teacher-unoffi", 
    "price": "20.00", 
    "instructors": "Stan Hustad", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786442_7e74_5.jpg", 
    "course_url": "https://www.udemy.com/be-a-million-dollar-online-teacher-as-a-radio-tv-broadcaster/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T19:13:30Z"
}