{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Communication skills are the prerequisite to advancing your career, and that's where we will help you.  </strong>  </p>  <ul>  \t<li>We will teach you how to use a simple and extremely effective business communication tool.</li>  \t<li>You will be able to use this tool immediately after taking this class.</li>  \t<li>We don't used cartoons, there are no fancy graphics....just a real world example and a step by step demo of how to create and use a multifunctional process map.</li>  </ul>    <p>  \t  Effective communication in the workplace is the key to advancing, but how exactly do you do that? How can you actually improve workplace communication? Engineers, programmers, project managers and consultants all need some tools to help them \"sell\" ideas. One of the most useful - but underappreciated - is a multifunctional process map. The process map is mentioned and required in ISO 9000, Six Sigma and lean manufacturing, but you don't need those complex methodologies to take advantage of this useful tool.  </p>  <p>  \t  We will demonstrate the swimlane processs map with a case study based on the instructor's work in management consulting. The case is an example of how you can use a process map to \"sell your ideas.\" If you use this communication tool correctly, your \"sale\" should be much easier….and that's a great way to build a career.  </p>", 
    "end_date": null, 
    "title": "You Can Communicate ANYTHING to ANYBODY!  ", 
    "price": "25.00", 
    "instructors": "Communication for Geeks®", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406784_e588_12.jpg", 
    "course_url": "https://www.udemy.com/communication-for-geeks-tools-process-map/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T15:55:01Z"
}