{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">◆◆日本のみなさまへ◆◆</strong></p><p>英語の文法や発音は得意なほうではないけれど、海外の取引先と堂々と渡り合える人。英語のテストの成績は悪くなかったけれど、実際のコミュニケーションの場では控えめになってしまう人。その差は一体なんでしょう？</p><p>英語圏のビジネスパーソン向けに制作されたこのコースでは、英語でのビジネスコミュニケーションのどんな場面でも自信を持ってふるまえるコツをお伝えします。講師は、アメリカのTV番組を中心に活躍した元女優であり、SONYなどグローバル企業のコミュニケーションコーチでもあるAlexa Fisher。丁寧に、時に豪快に、「1000ワットの光を放つ」ためのコミュニケーション術を伝授します。</p><p><strong style=\"\">◆◆講師より◆◆</strong></p><p>  \t<strong style=\"\">Have you been secretly longing to achieve more in life?</strong> To many, you seem content and successful, but inwardly you know you have not yet stepped into your full potential. And the realization hurts.<br style=\"\">  \t<br style=\"\">  \t         Maybe you never asked for that well-deserved raise. Or you avoided presenting to a room full of influencers. You stayed “behind-the-scenes\". Totally competent, but utterly invisible.  </p>  <p>  \t        But there is this whisper in your ear, begging you to speak up. <strong style=\"\">You long to jump out of your comfort zone.</strong> And your message? You know you have one – yet something holds you back from going big, from shining as brightly as you could. What. Is. It.?!?!?  </p>  <p>  \t        The answer is - it's different for everyone. And the good news is, it's not that hard to find that box, open it up, and let the butterflies out. <br style=\"\">  \t<br style=\"\">  \t         Because what do you have to gain? Is it fame? Fortune? More professional recognition? Yes, all of that is true…but what you really get, and this is what's priceless, is the gift that comes with expressing your truest self, in the most effective, contagious way possible. To as many people as possible. It is the gift to you, but it's also the gift to us. Yes, us. You playing small, as the great Marianne Williamson has said, doesn't do us any favors.  </p>      <p>  \t<strong style=\"\">Hi, I'm Alexa.</strong>  </p>  <p>  \t        I spent most of my career as a television actress until the moment came when I knew that life on a TV show set was never going to fulfill my desire to help others. The craft of acting is about interpreting human behavior. Studying what makes a person tick. Understanding the obstacles they face to get what they want. I loved acting, but it pained me to see the impact the entertainment industry was having on the average person. I watched countless people tear themselves down while comparing themselves to air-brushed celebrities. I knew it was time for me to step into the unknown and teach.  </p>  <p>  \t<strong style=\"\">Here's the truth:</strong>  </p>  <p>  \t      Actors are just like you and me. In fact, each person on this planet was born to shine. You came into this world with a passion and a purpose. You may not know what that is yet, but you know in your gut it's time for a change. Imagine what your bravest self can achieve:  </p>  <ul style=\"\">  \t<li>You have the courage to ask for      what you want.</li>  \t<li>You have the tenacity to not      give up.</li>  \t<li>You walk into a room with confidence and calm.</li>  \t<li>You express yourself      effortlessly.</li>  \t<li>You command the attention of an      audience.</li>  \t<li>You achieve deeper authenticity      and honesty.</li>  \t<li>You use ALL your existing      skills, but better.</li>  \t<li>You create new and inventive      ways to share your business.</li>  \t<li>You start making your own      opportunities happen.</li>  \t<li>You step in front of the camera with ease.</li>  \t<li>You stop the negative chatter      in your head once and for all.</li>  </ul>  <p>  \t<br style=\"\">  \t         When you overcome your fears and doubts, you harness your personal power. When you connect to your purpose, you ignite your passion. When you build your confidence, you move in the direction of your destiny.  </p>      <p>  \t<strong style=\"\">Quite simply, when you light up, the world takes notice and opportunities come to you… effortlessly.</strong>  </p>  <p>  \t        But first – the most important aspect to this process – is your willingness to start.  Are you ready? Are you ready to step out of the shade and into the warm sun – and feel the difference in every single aspect of your life?  </p>  <p>  \t        I'm ready. I'm ready for you to do it. And I believe you can do it. You do not need to go at it alone. Let's start now. Together.  </p>", 
    "end_date": null, 
    "title": "ビジネスに効く！ 相手を惹きつけるコミュニケーション術（日本語字幕）", 
    "price": "40.00", 
    "instructors": "Alexa Fischer", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425352_2263.jpg", 
    "course_url": "https://www.udemy.com/1000-watt-presence_jp/", 
    "currency": "USD", 
    "subject_name": [
        "Communications"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T21:57:55Z"
}