{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Digital Branding is still an underrepresented and unexplored field in research and practice. The multiplicity of cultural differences within international brand management is vast.Following a primer on brand management and the particulars of digital media and technologies, participants experience how to present a brand using digital brand storytelling. In the latter portion of the course, you will learn advanced methods and techniques used to generate strong, ownable emotions around a brand.The course addresses the following questions:• How can I use the unique attributes of digital media and digital technologies for my own digital brand management work?• How do I stage – like a theater production – my brand effectively in digital media?• How can I tell exciting, successful stories?• How can I place my digital brand management (concept) in the minds of my consumers and other important stakeholder groups?\n\n                                            Syllabus\n                        Chapter 1:In the first chapter, we will define the most important terms of branding. You will be formulating your own Brand Reward Promise and you'll be dealing with the Limbic Map, which will guide you toward the possibilities for positioning your brand/product in an emotionally and rewarding manner.Chapter 2:We will learn about the unique attributes of digital media and digital technologies.Chapter 3:We will experience how to present a brand using digital brand storytelling.Chapter 4:We will deal with Emotional Brand Codes and learn advanced methods and techniques used to generate strong, ownable emotions around a brand.\n                                    ", "end_date": "2015-11-16T00:00:00Z", "title": "Building Strong Digital Brands", "price": 0, "instructors": "Dieter Georg Herbst", "institution_name": ["Berlin Career College"], "commitment": "4-5 hours", "subject_name": ["Business & Management"], "course_url": "https://iversity.org/en/courses/building-strong-digital-brands", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2015-10-19T00:00:00Z"}