{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    With budgets for digital marketing constantly growing, organisations are facing a major skills shortage. The need for individuals who understand business combined with technical knowledge in Digital Marketing has never been greater. This course is based on European case studies showing current digital and social media marketing practices across Europe. Europe is one of the largest regions for digital and social marketing used but there are many local preferences and this course will help you to navigate these complexities. This course combines practical skills and theoretical knowledge with the goal of teaching you the skills to improve digital and social media marketing in organisations.\n\n                                            Syllabus\n                        1. Why is Digital and Social Media Marketing important today and in the future?1.1. Introduction to strategic planning1.2 SWOT analysis1.3. Developing SMART objectives for strategy and campaigns1.4. Digital Business Maturity Model1.5. The consumer journey to online purchase1.6. Introduction to core concepts and technologies of digital and social media marketing1.7. Introduction to online branding\r\n2. Understanding the different nature of digital channels based on geographic, demographic and digital fit for a campaign2.1 Search Engines - differences in countries - based on the case study examples2.2 Social Media platforms differences in countries and how to they can be used2.3 Email marketing and how it can be used2.4 Affiliate marketing and how it can be used2.5 Mobile marketing and how it could be used2.6 Paid channels overview - search and social2.7 Communities focused engagement\r\n3. Buyer persona development3.1 The importance of understanding who the target audience is and how search and social help to develop this understanding3.2 Planning integration of search and social media3.3 Keyword research for buyer persona3.4 Social media channels for buyer persona3.5 Develop keyword plan for a campaign3.6 PPC keyword vs organic keyword plan3.7 Develop social media editorial calendar\r\n4. How campaigns fit into a wider implementation of the overall organisation strategy4.1 Example company campaign plan4.2 Key elements of campaign management - Gantt chart4.3 Risk management4.4 Digital project management tools and techniques4.5 Project plan monitoring and review4.6 Marketing automation4.7 PPC campaign planning\r\n5. Choosing the right digital profiles for the right audience5.1 Facebook5.2 YouTube5.3 Twitter5.4 LinkedIn5.5 PPC optimisation5.6 What makes content to go Viral?5.7 How to create content viral?\r\n6. The importance of ongoing monitoring and learning from your engagement6.1 Understanding of Social Capital and its importance case study6.2 Accessing data in Google Analytics6.3 Accessing data from Facebook6.4 Accessing data from Twitter6.5 Using spreadsheets to analyse and populate reports6.6 Learning from digital results6.7 PPC report\n                                    ", "end_date": "2015-11-09T00:00:00Z", "title": "Digital and Social Media Marketing", "price": 0, "instructors": "Dr Aleksej Heinze", "institution_name": ["Salford Business School, University of Salford"], "commitment": "4-6 hours", "subject_name": ["Business & Management"], "course_url": "https://iversity.org/en/courses/digital-and-social-media-marketing", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2015-09-28T00:00:00Z"}