{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    About this Course\n\nThis course brings together two key subjects, International Marketing and Cross Industry Innovation. It will provide the basic foundations of international marketing and then explain how companies can grow by going abroad or sourcing ideas/expanding into other countries or industries. This is summarized as CCCI: Cross-Country and Cross-Industry Innovation, a term and analytical platform used throughout not only this course but others in the specialization. As an introductory course, we keep the concepts short and simple in order to ease learners into the wonderful world of international marketing. More specific operational aspects such as managing the product, price, place and promotion as well as targeting and positioning will be provided in the second course of the specialization. \n\nAfter you successfully complete this course learners will obtain the following outcomes:\n\n(1) an understanding of the core meaning of marketing and international marketing. \n(2) learn that international marketing is about striking the right balance between maximizing the similarities across cultures (Etic approach) and customizing marketing (Emic approach) to important local differences.\n(3) learn about how to source or expand into other industries at home or abroad via cross industry innovation.\n(4) obtain a solid foundation for subsequent courses such as course 2 (International Marketing Entry and Execution) and the industry-specific courses in the specialization.\n\n                                            Syllabus\n                        What is Marketing?What is “Marketing”? In this first lesson you will learn the concept of Marketing and of the components involved in its effective execution. The most important concept and word that is introduced in Video 1.3 is \"Noon Nopi\" which originates from Korean and means \"Eye Level.\" Marketing will be defined as companies' attempt to match their eye level to those of consumers. In Video 1.4, the 4 main executional tools of marketing, product, price, place and promotion are explained. In Video 1.5, we learn what culture means and how to compare cultures across countries along dimensions that are similar (Etic) and those that are fundamentally different (Emic). The lesson ends with an interview with the Vice President of Brand Management FD, Global Sales and Marketing Company at LG Electronics, Mr. Jeongseok Lee. He explains LG's international marketing strategy and challenges faced such as with innovations created in Nigeria, India and Indonesia.What is Marketing Strategy?After completing Video 2.1 successfully, you will be able to explain marketing strategy basics and avoid marketing myopia. You will also be able to use the VSA framework tool in order to find weak signals and help your company survive market tsunamis. Next, in Video 2.3 you will learn a key concept called \"Transing\" which is a strategy for coping with change in the corporate environment. We apply \"Transing\" not only to brands, such as Starbucks, but also to individuals, such as Professor Dae Ryun Chang to illustrate how we can transition when aspiring for loftier long term goals. Transing then sets you up for Video 2.4 and the core concept of Cross Industry Innovation -how companies can source ideas or expand into different industries. In the last two videos, you are given the opportunity to hear from two experts in the field: (1) Mr. Siwan Ryu discusses how Mosquito Away, a major new product was developed at LG Electronics with cross-disciplinary collaboration and (2) Ms. Hye-Won Lee talks about how Swarovski's new product ideas such as wearable jewelry was sourced from other industries.What is Branding?This lesson will introduce learners to the important concept of brand management at its various levels. It starts by examining the fundamental functions of brands (Video 3.1). Then, we derive the implications for branding for companies going abroad (Video 3.2) in a \"Cross Country\" growth path. Finally, we discuss how companies entering into new industries should think about brands especially about whether or not to extend brands in a \"Cross Industry\" growth path (Video 3.3). Learners are also introduced to the ASIANA COBRA paradigm that allows brands to be analyzed in a broader than usual perspective that includes, the brand, the company, the country of origin and the region. Although it originates from an Asian perspective, it can be easily applied to other regions such as North America, South America, Africa or Europe.  \n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "Intro to International Marketing", "price": 0, "instructors": "Dae Ryun Chang", "institution_name": ["Yonsei University"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/intro-international-marketing", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}