{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Público-Alvo\nProfissionais, estudantes e interessados da área de Marketing que desejam conhecer os fundamentos básicos de Marketing Analítico e sua aplicação prática.\n \nObjetivo do Curso\nO curso tem como objetivo central introduzir o conceito de Marketing Analítico e apresentar de forma simplificada e prática algumas técnicas, de modo que o participante possa avaliar e recomendar decisões e ações em Marketing baseadas em análise de dados.\n\nObjetivos de Aprendizagem\nAo final do curso o aluno será capaz de:\n•\tExplicar a importância de definir e utilizar métricas em Marketing.\n•\tDesenvolver métodos de levantamento de dados primários e secundários.\n•\tDesenvolver hipóteses testáveis inferindo causalidades. \n•\tSegmentar o mercado com base no comportamento do consumidor. \n•\tGerar insights para o posicionamento de marca. \n•\tSuportar a tomada de decisões em Marketing com base em fatos e dados.\n\nDedicação e Carga-Horária\nCinco módulos temáticos de aproximadamente 3h cada, totalizando 15h. Cada módulo tem duração estimada de uma semana.\n\nAssista ao vídeo de divulgação do curso: https://youtu.be/FvtgLAW_s8Y\n\n                                            Syllabus\n                        Boas-VindasNeste primeiro momento, apresentamos quais são os objetivos do curso, os recursos disponíveis e as dinâmicas propostas para estudo e avaliação do seu aprendizado. Após esse primeiro contato, espera-se que você esteja preparado para iniciar o curso!O que eu Meço, eu GerencioAo final desse módulo, espera-se que você esteja apto a entender o que é Marketing Analítico, como é aplicado e diferenciar suas principais técnicas.A Arte de Perguntar, Medir e Entender o MercadoAo final desse módulo, espera-se que você esteja apto a construir questionários para coletar dados sobre comportamento dos consumidores. Inferindo Propriedades e Características de uma PopulaçãoAo final desse módulo, espera-se que você esteja apto a formular hipóteses testáveis quantitativamente e analisar testes e modelos lineares.Segmentação Baseada em Comportamento do ConsumidorAo final desse módulo, espera-se que você esteja apto a aplicar a técnica de segmentação com base em dados, analisar resultados e recomendar a formação de grupos homogêneos. Analisando o seu Posicionamento (Marca e Concorrência)Ao final desse módulo, espera-se que você esteja apto a desenvolver e analisar um instrumento para avaliação de posicionamento de marca.FechamentoAgora, solicitamos que realize a Avaliação Final do Curso e verifique se alcançou os objetivos almejados.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Introdução ao Marketing Analítico", "price": 0, "instructors": "Danny Claro, Silvio Laban and Carlos R. F. Bara", "institution_name": ["Insper"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/marketing-analitico", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}