{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    The first course in this specialization is separated into two main sections and provides you with the perfect start for your marketing journey. \n\nGain the tools and techniques to translate a decision problem into a research question in the Market Research module. Learn how to design a research plan, analyze the data gathered and accurately interpret and communicate survey reports, translating the results into practical recommendations.\n\nThe second module focuses in on the consumer decision-making process, highlighting the key moments from identifying a need to buying and consuming a product. Adopt a true “consumer focus” in your managerial decisions by analyzing how consumers make decisions, what happens (in their hearts and minds) at different stages of the decision making process, and the variables that influence those decisions.\n\n                                            Syllabus\n                        Consumer Behavioral FundamentalsThis Course consists of two blocks: Marketing Research and Consumer Behavior. First, learners will see the tools and methods to be able to effectively conduct (or hire) and interpret marketing research. Second, they will learn the foundations of consumer behavior and the consumer decision-making process and how to use this knowledge in the formulation of effective marketing strategies and tactic. \n\nIn this first module, you will head-dive into your consumer's thought-processes to really get to know what makes them tick, and, more specifically, what makes them make their purchase decisions. Getting into the mind of your customer is the first step in developing a marketing strategy that is effective.The Consumer Decision ProcessModule 2 will guide you through the consumer decision-making process. Here you will explore how a potential-buyer researches a product, how they make their purchase decision, and their post-purchase evaluation.  You will also understand the difference between consumer markets and business markets. Marketing Research FundamentalsIn the second half of this course, you will explore the world of marketing research.  In Module 3, Professor Sinha will share with you the importance of market research and how to acquire data. Later, you will delve into the different types of experimental research and design.Marketing Research Data Collection &amp; AnalysisIn the last Module of this course, you will learn with more detail the various types of data acquired during the marketing research process and how to evaluate and assess it. Discovering the importance of, and how to create an effective survey, will also be covered.In the second half of this course, you will explore the world of marketing research. \n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Market Research and Consumer Behavior", "price": 0, "instructors": "Ramon Diaz-Bernardo and Shameek Sinha", "institution_name": ["IE Business School"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/market-research", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}