{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Have you ever wondered how the retail environment influences your shopping behavior? In this course you will learn the secrets of how marketers can use factors like colors, scents, store layouts and merchandise presentations to influence consumers.\r\nIn an age of self-service stores, saturated markets, and ever more demanding customers, the creative and science-driven design of the point of sale has become a crucial success factor for both retailers and service businesses. In this MOOC, you will be introduced to shopper marketing. You will learn to understand shopping behavior and how to optimize the design of retail stores and service environments to increase customer satisfaction and sales. While the focus is on the practical applicability of the concepts discussed, the MOOC is also firmly grounded in consumer and psychological research. In the lessons, I will draw on both the recent research literature and my own experience in marketing consulting and consumer research.\r\nThe topics covered in the MOOC are:\r\n• Store layout: Influencing how shoppers navigate the store• Helping shopper orientation in the store• Store design factors• Visual merchandising techniques• Influencing the store atmosphere• Experiential store design: Making shopping fun• Specific applications of store design principles\r\nWhat will I learn?\r\nBy the end this MOOC, you will have developed an understanding of consumer behavior at the point of sale and be able to apply this knowledge to the (re)design of retail spaces and service environments.\r\nSpecifically, you will:• appreciate the relevance of shopper marketing and store design• understand the goals of store and servicescape design• be able to apply environmental psychology principles to the design of retail and service spaces• understand the effect of sensory clues such as music, scents and colors on shopping behavior• understand how emotions influence shopping decisions and be able to trigger emotions in shoppers• understand the importance of experiential marketing and store design• be able to influence consumer behavior with specific store design and visual merchandising techniques• be able to apply the knowledge gained in this MOOC to evaluate retail spaces and servicescapes\r\nAlso, you should have fun in this MOOC :-)\r\nWhat do I need to know?\r\nNo prior marketing, business or psychology knowledge is required.\n\n                                            Syllabus\n                        Week 1: Shopper movement and behavior in the storeFind out how shoppers navigate the store, how they search for products, and how you can make them find the products you want them to see and buy. \u2028\r\n1.0 Welcome to the course1.1 Overview of the module1.2 Shopper shadowing: Tracking shoppers in the store1.3 Four principles of how shoppers move in the store1.4 Grid and free form: Creating a store layout that suits the store1.5 Follow the yellow brick road: Influencing shopper movement through a loop1.6 How I ended up buying potato chips: Where to place products so that shoppers buy them1.7 Eye level is buy level: The principles of shelf placement1.8 Horizontal, not vertical: Shoppers’ search patterns1.9 Follow the eye: Eyetracking at the Point of SaleFrom my bookshelf\r\nWeek 2: Shopper orientation and disorientationLearn why shopper confusion kills every sale and how you can help shoppers find their way—all the way to the cash register.\u2028\r\n2.1 Overview of the module2.2 I’m so lost… and I hate this place: The effects of shopper disorientation2.3 It’s all stored in the head: Improving shopper orientation through cognitive maps2.4 Beware of the magic number 7: Improving shopper orientation through signs2.5 Words and pictures: Applying dual coding theory2.6 You are here: Improving orientation through store maps2.7 The store as a forbidden place: Consumer disinformationFrom my bookshelf\r\nWeek 3: Influencing shoppers through the store atmosphereLearn how to appeal to shopper emotions through use of colors, scents, light, and music.\r\n3.1 Overview of the module3.2 Communicating through the senses: How the store atmosphere influences emotions3.3 How the environment influences shoppers: The Mehrabian-Russell-Model3.4 Arousal and pleasure: The key drivers of in-store behavior3.5 Better slow than fast: Using background music in the store3.6 The smell of happy memories: Using ambient scents3.7 Let the sunshine in: Store lighting3.8 Red or blue? Colors in the store3.9 Everything must fit: The importance of congruenceFrom my bookshelf\r\nWeek 4: Visual merchandising – the art and science of product presentationLet me show you what the most attention-grabbing and profitable ways to present your merchandise are.\r\n4.1 Overview of the module4.2 The art and science of seducing shoppers with the merchandise: What is visual merchandising?4.3 Shoppers buy only what they see: The 3 key principles of visual merchandising4.4 Less is more: Avoiding the choice overload effect4.5 Choosing the right company for your products: The bundled presentation merchandising technique4.6 Creating visual magnets: Directing the shoppers’ attention4.7 A picture says more than a thousand words: Using in-store graphics to trigger cognitive schemasFrom my bookshelf\r\nWeek 5: Making shopping fun through experiential store designI'll teach you to make shopping memorable and fun by creating unique experiences.\r\n5.1 Overview of the module5.2 Competing with cyberspace: Reasons for experiential store design5.3 Necessity or fun: Utilitarian and hedonic shopping5.4 Appealing to the pleasure seekers: 4 steps for creating shopping experiences for hedonic shoppers5.5 Exciting places and live entertainment: Designing experiences for adventure shoppers5.6 Creating a third place: Designing experiences for social shoppers5.7 Gifts, indulgence and curiosity: Experiences for role, gratification, and idea shoppers5.8 Appealing to the bargain hunters: Designing experiences for deal-prone consumers5.9 Jungles, castles and Harry Potter: Creating effective themed experiencesFrom my bookshelf\r\nWeek 6: Recipes for influencing shoppersFind out how you can apply the concepts learned in this course to influence specific shopping behaviors and achieve positive effects for the store.\r\n6.1 Overview of the module6.2 How much longer? Shorten consumers’ wait-time perceptions6.3 Expensive or cheap? Influence shoppers’ price perceptions6.4 Accessibility for all: Design the store for senior citizens6.5 Wait, wait, don’t go! Keep shoppers in the store longer6.6 I must have that! Encourage impulse purchases6.7 Make shopping simple and fun: The importance of processing fluency6.8 Course conclusion\n                                    ", "end_date": "2015-06-15T00:00:00Z", "title": "Store Design, Visual Merchandising and Shopper Marketing", "price": 0, "instructors": "Claus Ebster", "institution_name": [], "commitment": "2-3 hours", "subject_name": ["Business & Management"], "course_url": "https://iversity.org/en/courses/store-design-visual-merchandising-and-shopper-marketing", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2015-05-04T00:00:00Z"}