{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    In a 2014 study of CEOs and CMOs, IBM found 63% wanted social strategies which generate business metrics while only 20% of businesses worldwide actually have them. This means strategies which not only grow your company’s social footprint but link to your sales and marketing systems. With this critical linkage, your social and mobile strategies will provide you with the ability to engage consumers at a 1-to-1 level and measure your social investments in terms of costs, revenues, profits and ROI. In this fifth MOOC of the Social Marketing Specialization - \"The Business of Social\" - you will learn how to transform your organization's social marketing from an untracked investment to an integral part of your company’s marketing strategy. You will learn the legal considerations involved as well as proven performance metrics and management tactics for success.\n\nAdditional MOOC 5 faculty include:\n* Rich Gordon (Professor &amp; Director of Digital Innovation, Medill, Northwestern)\n* Tom Collinger (Executive Director Spiegel Research Center and Senior Director Distance Learning, Medill Integrated Marketing Communications, Northwestern)\n* Seth Redmore (CMO, Lexalytics, Inc.)\n* Jeff Davidoff (CMO, Donuts.Domains) \n* Matt Krull (Business Unit Executive, IBM Security) \n* Frank Mulhern (Associate Dean, Department Chair, and Professor, Integrated Marketing Communications, Northwestern)\n\n                                            Syllabus\n                        Legal ConsiderationsIn this module, you will learn the appropriate security, privacy, and governance considerations to apply to your social marketing strategy. MetricsIn this module, you will gain a deeper understand of how metrics can be used to drive real business results. PerformanceIn this module, you will learn how to create a performance funnel and the key performance indicators necessary to create a sustainable, budgeted program. ManagementIn this module, you will learn how to create a pilot program, test it for sustainability, and justify its existence using proven metrics.  \n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "The Business of Social", "price": 0, "instructors": "Randy Hlavac", "institution_name": ["Northwestern University"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/business-of-social", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}