{"selfpaced": false, "topic_name": ["Marketing"], "description": "\n\n                    \n                    \n                    Brands are the most potent commercial and cultural force on the planet. Think about McDonald’s, Apple, Manchester United, Tate, Google or even Harry Potter. This free online course will help you get under the skin of such brands, and ask how and why they become so powerful.\n\nThe University of East Anglia has teamed up with one the world’s most influential brand consultancies, Wolff Olins, to bring you this course. It’s built on their hugely successful joint MSc in Brand Leadership and shares the same course leader -­ renowned branding consultant,\nRobert Jones.\n\nWhere could this course take me?\nIf you’re developing a career in branding -­ or if you work in a related area, like strategy, marketing or innovation -­ this course is for you. It will support your professional development, and also provide you with a taste of what taking a Masters in branding or brand management would be like.\n\nWhat and how will I learn?\nYou’ll learn directly from practitioners at companies like Virgin and Google, and watch brand experts in action. You’ll get a rich mixture of powerful theory and practical tools. With branding changing so rapidly, you’ll get the very latest insights and methods from the converging worlds of technology, design and brand.\n\nThe course ends by setting up the next stage of your journey. We’ll be opening up the many topics in branding that still need research. And you’ll learn how to define your own personal brand, and plan the next steps in your life in branding.\n\nThis course will also give you the opportunity to purchase a Statement of Participation.\n\nIn addition, an optional formal exam has been set by the team at the University of East Anglia and it is based on the contents of the course. If you pass, you will receive a Statement of Attainment which you can use as evidence of your understanding of the subject for Continuing Professional Development or other purposes.\n\nYou will be able to sit the exam at various test centres across the world after the end of the course. The exams will take place between 28 March and 17 April 2016.\n\nThe exam duration will be 1 hour 40 minutes and the question types will be similar to those in the end of course test.\n\nFurther information about Statements of Attainment can be found in the FAQs on Statements of Attainment.\n\n\n                                    ", "end_date": "2016-04-04T00:00:00Z", "title": "The Secret Power of Brands", "price": 0, "instructors": "Robert Jones", "institution_name": ["University of East Anglia"], "commitment": "3 hours", "subject_name": ["Business & Management"], "course_url": "http://www.futurelearn.com/courses/the-secret-power-of-brands?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-01-25T00:00:00Z"}