{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>In the fast changing world of data management and data processing, more and more organizations are adopting Cloud computing as their preferred option. The sole aim of this training is to prepare you for your future in the Cloud computing world! <br></p><p>This online course will teach you how to take Oracle deployments to a new height using Amazon Web Services.</p><p>This course is designed to teach you the ins and outs of Oracle database deployment in AWS Cloud, even if you have little to no experience with it, to help support your own Oracle environment in AWS cloud.</p><p>While there are plenty of Oracle database courses that focus on Oracle deployment, it's hard to find a comprehensive course like this one, which is for beginner to advanced Oracle enthusiatics.</p><p>This course is designed for all levels of Oracle DBAs or Linux System Administrator who want to improve their skills, support Oracle deployment in AWS, migrate Oracle on AWS and remain competent in the Oracle database world.</p><p>This course covers best practises used by the pros around the world so that you can follow their lead and improve it even further.</p><p>The goal of this course is to get you up to speed as quickly as possible, it cover the different kinds of Oracle deployment options, oracle licesing, backup and restore of oracle using AWS S3, Performance Management, Monitoring, and some of the best practises. </p><p>At the end of the course you'll be a equipped with skills of Oracle deployment on AWS, with enough confidence to start deploying or supporting your Oracle environment in AWS Cloud. </p>", 
    "end_date": null, 
    "title": "Get Oracle Flying in AWS Cloud", 
    "price": "20.00", 
    "instructors": "Devang Shah", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580484_6455_4.jpg", 
    "course_url": "https://www.udemy.com/get-oracle-flying-in-aws-cloud/", 
    "currency": "USD", 
    "subject_name": [
        "Oracle"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T19:42:03Z"
}