{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t <strong>Course Introduction:</strong>  </p>  <p>  \t The Oracle EBS basic course will introduce you to the world of oracle applications e-Business suite. It will explain you with the fundamentals of an Enterprise Resource Planning (ERP) system, with concepts, product background and processes.  </p>  <p>  \t It will also explain the concepts of procure to Pay (P2P) and Order to Cash (O2C) business processes, within the scope of an ERP system.  </p>  <p>  \tThis course intends to give you a flavor of Oracle EBS from three angles:  </p>  <p>  \t<strong>End User: </strong>How to create a sales order?  </p>  <p>  \t<strong>Functional Consultant: </strong>How to setup and implement Oracle Financials  </p>  <p>  \t<span><strong>Technical Consultant</strong>: How to configure concurrent programs</span>  </p>  <p>  \t<span>By going through these steps you&#039;ll understand what entails learning and managing an ERP system. Depending on your interest, you can choose a career path for yourself.</span>  </p>  <p>  \t <strong>Why Learn Oracle EBS?<br>  \t </strong>  </p>  <p>  \t Today, most of the businesses use an ERP system, small or large to cater to their business systems needs. Organizations may use SAP, Oracle eBS, Workday, Peoplesoft or other ERP systems. A basic understanding of ERP system can help you land a job as a user or analyst in this space. Knowledge or Oracle eBS will help you become an Oracle ebs user, consultant, analyst, developer or functional/technical expert.  </p>  <p>  \t The course will introduce you to the basics of ERP, and then you can choose if you want to learn more and take advance courses in one or other functional stream.  </p>  <p>  \t Join me on this exciting journey as we learn about Oracle ebusiness Suite and how to user it in organisations. In the next few paragraphs, I will tell you more about the curriculum, duration, and career options available to you after the completion of this course.  </p>  <p>  \t <strong>Learning Plan</strong>  </p>  <p>  \t You are expected to go through the following effort in completing this course:  </p>  <ul>  \t<li><strong>History </strong><span>of Oracle EBS</span></li>  \t<li><span></span><strong>Introduction </strong><span>to ERP systems and how Oracle EBS fits there</span></li>  \t<li><span><strong>Navigation </strong>within Oracle eBusiness suite</span></li>  \t<li><span></span><span>Basics of two critical </span><strong>business processes - P2P and O2C</strong></li>  \t<li><strong></strong><strong>Implementation steps </strong><span>for Oracle Financials - General Ledger</span></li>  \t<li><span>How to enter a <strong>Sales Order</strong></span></li>  \t<li><span>How to configure and use <strong>Concurrent Programs</strong></span></li>  </ul>  <p>  \t Watch videos for all modules  </p>  <p>  \t Self-Assessment Exercises 1  </p>  <p>  \t <strong>What Next?</strong>  </p>  <p>  \t This course provided you an overview of the field of Oracle applications. To gain further competency as a EBS professional you would need to gain an understanding of one or more of the following areas:  </p>  <p>  \t Select a functional module or subject area and learn that module. e.g. HR, Payroll, Finance  </p>  <p>  \t If you are in Technical stream, learn Oracle technical knowledge  </p>  <p>  \t ERP is a powerful and important field for all organisations. To remain employable and competitive, you need to be frequently taking courses and learning about all the different aspects of ERP and how they are used across companies.  </p>  <p>  \t Oracle eBusiness Suites is an enterprise resource Planning (ERP) system built by Oracle. This course provides some basic information and examples of few business processes within Oracle EBS.  </p>  <p>  \t   There is no direct relation of this course to any oracle certifications or career track. This course is just to walk you through some basic oracle applications concepts and show EBS in action.  </p>", 
    "end_date": null, 
    "title": "Oracle eBusiness Suite - An Introduction", 
    "price": "20.00", 
    "instructors": "Ashish Jain", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265794_b88a_5.jpg", 
    "course_url": "https://www.udemy.com/oracle-ebs-tips-and-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Oracle"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T16:37:53Z"
}