{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>(<em>Update on 18-Nov-2015 : Added additional lectures to keep this course updated with Oracle 12c Release 2. Also, if you just want to start with some basic theory before doing any hands-on lessons in here, please checkout the Section 'Concepts Illustrated' first.</em>)</p><p>  \t'Oracle Database Administration for Absolute Beginners' course explains about the basic concepts of Relational Database Management Systems (RDBMS). It will help you to become an Oracle Database Administrator(Oracle DBA).  </p>  <p>  \tDatabase Administrator is one of the highly sought after jobs in the IT industry. It is also one of the highly stable jobs as DATA is a vital part of every organization and they need that to be in the capable hands of a good DBA team.  </p>  <p>  \tThis course is absolutely for beginners. This is applicable for those who would want to learn Oracle Database 12c as well as Oracle Database 11g.  </p>  <p>  \tThis would be ideal for..  </p>  <ul>  \t<li>those who are already in IT and would like to jump into the world of Database Administration.<br>  \t</li>  \t<li>college students who would like to learn about Database concepts so that they can achieve high grades in their RDBMS related curriculum.</li>  \t<li>college students who would like to get into Oracle Database Administration as soon as they finish their college.<br>  \t</li>  \t<li>fresh graduates who are looking for a job in the IT industry.<br>  \t</li>  \t<li>anyone with the determination of getting into IT in order to have a better career.<br>  \t</li>  </ul>  <p>  \tThis course is mainly based on video lectures. However it also has theoretical sections for reference and LAB exercises for hands-on practice.  </p>  <p>  \tThe course has been structured to start with videos explaining basic database concepts. They provide simplified real world examples.  </p>  <p>  \tThen it introduces Oracle Database Architecture. After that, it provides 'hands-on' video lectures about 'How to install Oracle Database 11g in your desktop or Laptop'. (In the bottom, there is also a section about 'How to install Oracle Database 12c' which is the newest version from Oracle as of now, which is Aug 2013).  </p>  <p>  \tIt then explains about various Oracle Internals such as Storage Structures, Memory Structures, Database Objects etc.  </p>  <p>  \tThen it goes into operational aspects such as creating USERS, granting access, creating objects such as tables etc.  </p>  <p>  \tAfter that it explains about Backup/Recovery concepts and Dianostic Data.  </p>  <p>  \tFinally, there is a section of extensive video lectures about LAB sessions with examples. You can use those for hands-on practice, using the Database software that you would have installed (as explained in this course) in your PC/Laptop.  </p>  <p>  \tI would like to thank you sincerely for reading this and wishing you all the best..!  </p>  <p>  \tSam Dhanasekaran<br>  \tp.s: This started as YouTube video series. I experimented having my own background music initially. Later I removed the music, based on user feedback. So pardon the background music please :-(  </p>", 
    "end_date": null, 
    "title": "Oracle Database Administration for Absolute Beginners ", 
    "price": "25.00", 
    "instructors": "Sam Dhanasekaran", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46418_26ea_9.jpg", 
    "course_url": "https://www.udemy.com/oracledba/", 
    "currency": "USD", 
    "subject_name": [
        "Oracle"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-19T02:57:18Z"
}