{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p style=\"\">  \t   Oracle Database is the leading database in the world now. If you are planning to learn about Oracle Database through hands-on, self-exploration method, then this course will explain you about how to download Oracle Database Software from Oracle.com, which is free for learning, and install it in your Windows desktop or laptop.  </p>  <p style=\"\">  \t   This course will also explain about how to connect to the Oracle Database after installing it. Then you would be able to explore it and learn.  </p>  <p style=\"\">  \t   This course would be helpful for those who would like to learn Oracle Database Administration (Oracle DBA) or Oracle Database Development, but needs an Oracle Database to work with.  </p>  <p style=\"\">  \t   Please note that this course explores about how to install Oracle Database 12c in Windows 7 PC only.  </p>  <p style=\"\">  \t  Also, if you are new to Oracle Database, you might want to explore the course &quot;Oracle Database Administration for Absolute Beginners&quot; at http://www.udemy.com/oracledba  </p>  <p style=\"\">  \t  This course would serve as a base for my future Oracle 12c courses that are currently under plan. The main goal of this course is to help you to install Oracle 12c Database in your PC so that you may start learning it.  </p>  <p style=\"\">  \t <strong style=\"\"> If you follow the installation instructions provided in this course and yet experience any issues, you may use the &#039;Question and Answer&#039; section of this course for my support. I will try my best to help you through that &#039;Question and Answer&#039; section, so that you can successfully install Oracle 12c in your Windows 7 PC.</strong>  </p>", 
    "end_date": null, 
    "title": "Oracle 12c Database in a Windows PC", 
    "price": "20.00", 
    "instructors": "Sam Dhanasekaran", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/105862_05b7_17.jpg", 
    "course_url": "https://www.udemy.com/oracle12c/", 
    "currency": "USD", 
    "subject_name": [
        "Oracle"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-14T22:01:37Z"
}