{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><p>Oracle  Procurement Contracts are a part of Oracle Advanced Procurement, which enables  Standardizing Contract Processes with enterprise standards, policies that  govern their use and tools to allow flexible contract administration. It allows  you to take control of your contract Lifecycle, from authoring and negotiation  through implementation, enforcement, evaluation and closeout.</p>    <p>Participants  will learn how to create and maintain online Contract standard term library,  Authoring Contracts, Creating and using Contract Templates, how to leverage  workflow driven process to maintain standards, Contract online review and  approval, ensure proper approval and keep full history, Contract negotiation  with Suppliers, integrate online changes and approvals. The “Oracle for Beginners: Oracle Tutorial  for Procurement Contracts” course will also include Contract Signatures and  Printing, and integration with Oracle Sourcing and Oracle Purchasing. Finally  participants will learn how to set up and implement Oracle Procurement  Contracts in this Oracle for beginner’s course.</p>    <p>With Oracle  E Business Suite procurement solutions, buyers, requests, and suppliers gain  secure access to a single, centralized contract so they can view and use the  most up-to-date pricing, terms, and conditions.</p>    <p>“Oracle for Beginners: Oracle Tutorial for  Procurement Contracts” Course Completion Certificate</p>    <p>Now get a  verifiable course completion Certificate from aclnz.com</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Oracle Procurement Contracts Fundamentals (Oracle EBS R12i)", 
    "price": "50.00", 
    "instructors": "Kabeer Khan", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/24887_bc10_3.jpg", 
    "course_url": "https://www.udemy.com/oracle-procurement-contracts/", 
    "currency": "USD", 
    "subject_name": [
        "Oracle"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-17T03:12:58Z"
}