{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p>  \t  The following course is about OBIEE:  </p>  <p>  \t              Oracle Business Intelligence Foundation Suite (OBIEE+ and ESSBASE) is a complete, open, and architecturally unified Business Intellegence system for the enterprise that delivers abilities for reporting, adhoc query and analysis,<u style=\"\"> O</u>nline Analytical Processing(OLAP), dashboards, and scorecards. All enterprise data sources, as well as metrics, calculations, definitions, and hierarchies are managed in a Common Enterprise Information Model, providing users with accurate and consistent insight, regardless of where the information is consumed. Users can access and interact with information in multiple ways, including web-based interactive dashboards, collaboration workspaces, search bars, ERP and CRM applications, mobile devices, and Microsoft Office applications.  </p>  <p>  \t              The course covers topics from how to create a basic repository in Oracle to how to create entire Dashboard for reporting services.  </p>  <p>  \t              I personally recommend to go over each video atleat 2 times and practice each step to get mastery in OBIEE. The entire course can be covered in 4 hours.  </p>  <p>  \t              Note: Entire Course is structured in a way to cover the basic to advanced functions performed by a reporting analyst using Oracle business intellegence tool. The course also covers topics related to Admin functions in brief.  </p>  <p>  \t              we will cover the Admin function in a seperate video series.  </p>  <p>  \t              I recommend this course to anyone who is looking to get advanced knowledge in the field of data analytics or reporting analysis. OBIEE is a comprehensive tool appreciated by industry experts for reporting adhoc queries and presenting the facts in a presentable way to the management.  </p>  <p>  \t              Details About the Instructor:  </p>  <p>  \t              Swathi: has 8 plus years of classroom and online training Experience in Informatica, SQL and UNIX. She has excellent knowledge in Data ware Housing Concepts and RDBMS. Currently working as a freelance consultant for Informatica development since last 4 years.<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Oracle Business Intelligence Enterprise Edition:  OBIEE", 
    "price": "25.00", 
    "instructors": "Jigar Vora", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/66158_8b64_8.jpg", 
    "course_url": "https://www.udemy.com/oracle-business-intelligence-enterprise-edition-obiee/", 
    "currency": "USD", 
    "subject_name": [
        "Oracle"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-17T02:01:16Z"
}