{
    "selfpaced": true, 
    "topic_name": [
        "Office Productivity"
    ], 
    "description": "<p><p>Oracle E Business Suite is the most comprehensive suite of integrated global business applications that provides the most adaptable global business plantform. It helps to provides the most customer-focused applications strategy, which is further complemented by the integrated business intelligence portfolio.</p><p>In this class you will learn the Oracle E Business Suite Release 12i Fundamental Concepts. The class goes with a basic assumption that the participants have no working knowledge of Enterprise Software, and hence starts with the fundamental concept of an Enterprise. It then introduces the concept of enterprise software and Oracle E Business Suite. The participants will then be introduced to various concepts right from logging-in to Oracle Applications, to Navigating through Responsibilities, Menus, Forms and running standard Reports.</p><p>The trainer will then take you to deeper concepts of understanding Flexfields, Oracle Applications architecture, integrated business applications, concepts of Oracle Worklow and Alerts, and finally detailed sessions on Oracle Systems Administrator and Application Developer roles and underlying concepts.</p><p><p><strong style=\"\">Targeted Certification</strong></p><ul style=\"\"><li>Exam Number = IZ0-204</li><li>Exam Name = Oracle E Business Suite R12: E Business Essentials</li></ul>&lt;/p&gt;&lt;/p&gt;", 
    "end_date": null, 
    "title": "R12i Oracle E Business Suite Fundamentals - Advanced", 
    "price": "50.00", 
    "instructors": "Kabeer Khan", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33815_f66e_5.jpg", 
    "course_url": "https://www.udemy.com/r12i-ebs/", 
    "currency": "USD", 
    "subject_name": [
        "Oracle"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-29T03:51:59Z"
}