{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>iOS SWIFT DEVELOPMENT TIPS AND TRICKS</strong></p><p><strong>=======================================</strong></p><p><strong>***** Created with Xcode 7.2 and Swift 2 *****</strong></p><p><strong>=======================================</strong></p><p><strong><em>Why take this course?</em></strong></p><p>Do you want to learn some cool tips and tricks in iOS development with Swift? Or maybe try to find a solution to your development challenges?</p><p>iOS Development Tips and Tricks course could be the answer you are looking for.  This course is intended to be a cookbook style where you can easily find certain topic or problem along with its solution, <em>straight forward problem-solution approach</em>.  </p><p>Depending on the complexities of the problem, the lecture may be in the video type lecture or can be a simple documentation.  <br></p><p><strong>Not finding the solution to your development challenge?</strong>  <em>Post into discussion and I will do my best to address them or better yet, I will add the solution as the new tips and tricks lecture so everyone can benefit from it.  Sharing is caring .. :)</em><br></p><p><strong><em>Paid Once .. Get \"Lifelong\" Course</em></strong><br></p><p>This course is a \"lifelong course\", which means I will keep adding new tips and tricks video as I encounter new ones or <em>students</em> suggested ones. </p><p>\"<em>The best part is students only purchase this course once and they will get a lifelong benefits as the tips and tricks will grow overtime.\"</em><br></p><p><em><strong>How is the course structured?</strong></em><br></p><p>No need to follow the lecture in order, jump to the topic that catch your interest or that can help you solving your development problem.  Check the lecture description for detail on what you will learn on each lecture.</p><p><strong><em>What is the best resolution to run the video tutorials?</em></strong><br></p><p>By default, Udemy currently sets the video to play in 720p mode, however to get the best result for this course, set your video setting to 1080p.  If you are having problem running the video, try close and reopen your browser. </p><p><strong><em>Target Audience:</em><span></span></strong> All iOS developers</p>", 
    "end_date": null, 
    "title": "(NEW) iOS Swift Development Tips and Tricks", 
    "price": "25.00", 
    "instructors": "Andi Setiyadi", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/760380_8543_8.jpg", 
    "course_url": "https://www.udemy.com/ios-swift-development-tips-and-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-12T05:33:22Z"
}