{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  So you want to be a Mobile App Developer?  </p>  <p>  \t  With <strong>Ten Apps in Ten Weeks </strong>you will learn how to build Ten Different Apps in Ten weeks. Each app is unique and while building it you'll learn a unique and important skill set used by <strong>professional app developers</strong> every day.  Each app includes full source code, step-by-step building tutorial, and any needed video, music and graphic assets.  </p>  <p>  \t  You'll build all of these apps:  </p>  <p>  \t<strong>The Sound of Muzik</strong>: A fully-featured MP3 Player<br>  \t<strong>Chuck Norris Joke Generator</strong>: Chuck Norris jokes at the click of a button<br>  \t<strong>Philly Trains:</strong>When are the next trains coming? (Philly Transit System)<br>  \t<strong>Current Weather:</strong>What's the weather like where you are?<br>  \t<strong>Weather Forecaster:</strong>What's the Weather Forecast?<br>  \t<strong>Where Am I</strong>: Show me a map of where I am standing right now!<br>  \t<strong>I'm Hungry!I'm Hungry</strong>: What restaurants are Close to me?<br>  \t<strong>Scout Compass:</strong> Scouts Never leaves Home without their trusty compass!<br>  \t<strong>Whack-a-Mole</strong> <strong>Game: </strong>Whack the mole. Hilarity ensues.<br>  \t<strong>Bat Hunt:</strong> Kill the Bats before you run out of time.  </p>  <p>  \t  While creating these apps you'll learn skills like media control, web service consumption, XML and JSON parson, jQuery Mobile, Google Maps™, Google Places API™, geolocation, gaming techniques and much, much more.  </p>  <p>  \t  Forget choosing Android, iOS or Kindle... These apps can easily be deployed to all three of the largest app stores and we'll show you how.  </p>  <p>  \t  Upon course release you'll have access to all 10 Weeks of the course and all the apps, tutorials, videos and other content.  </p>  <p>  \t  There is simply no better way to learn mobile app development.  </p>  <p>  \t<strong>Bonus!</strong><br>  \t  Included with this bundle is our full course <strong>HTML5 Mobile App Development</strong>.  This course will comprehensively cover HTML5 mobile app development from top to bottom.  You'll be able to do the following after this course:  </p>  <li> Set up your app development studio with tools of the trade.<br>    • Test Your app on virtual and actual mobile devices<br>    • Write appropriate HTML5 for mobile<br>    • Use CSS3 to create stunning mobile user interfaces<br>    • Understand the \"10 Foot Experience\" (Mobile apps on your TV)<br>    • Use web services (like Google APIs™)<br>    • Parse XML and JSON content<br>    • Store data on the device<br>    • Create apps that work offline<br>    • Integrate audio and video and control media playback<br>    • Use geolocation services and Google Maps™<br>    • Work with the device accelerometer hardware<br>    • Use jQuery Mobile controls and styling<br>    • Use a devices internal storage system<br>    • Work with device contacts<br>    • Work with device notifications<br>    • Understand in-app purchasing<br>    • Place your finished app in the app store</li>  <p>  \t  You'll start by immediately become a developer in one (or more) of the three largest app stores so you can have a place to distribute (or <strong>sell</strong>) apps that you develop.  </p>  <p>  \t  This course is a great complement to 10 Apps in 10 Weeks and will help you fully understand the mobile app development process.</p>", 
    "end_date": null, 
    "title": "10 Apps in 10 Weeks", 
    "price": "25.00", 
    "instructors": "LearnToProgram, Inc., Mark Lassoff", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414440_728c_2.jpg", 
    "course_url": "https://www.udemy.com/10-apps-in-10-weeks/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T19:49:14Z"
}