{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Mit wenig Budget (jedoch mindestens ca. $150), wenig Zeit (ca. 2 Stunden pro Tag während 20 Tage) und minimale Englischkenntnisse könnten Sie in weniger als einen Monat anhand dieses Kurses Ihre erste einfache App ganz nach Ihren Wünschen erstellen lassen! Zudem haben Sie dann schon ein Team vorhanden, dass Sie für all Ihre App Ideen in Zukunft einsetzen können!</p><p>Sie glauben nicht, dass Sie es schaffen können? Ich hatte überhaupt keine Erfahrung, keine Programmierkenntnisse, und doch habe ich es in nur 20 Tagen geschafft, meine erste App ins App Store für nur $160 zu bekommen: Tic Tac Beer. Nun möchte ich Ihnen zeigen, wie das geht!</p><p>Mein Kurs ist Projekt-basiert: ich führe Sie jeden Tag, Schritt für Schritt ans Ziel. Dazu kommen noch Tipps um Ihre Kosten niedrig zu halten und das richtige Team zu rekrutieren. Wenn dies alles schon einmal steht, können Sie auch viel mehr und viel kompliziertere Apps entwickeln lassen! Das wichtigste ist, schon einmal das ganze Prozess durchgeführt zu haben, damit Sie danach mit nur wenig Aufwand an Ihre Ziele kommen.</p><p>Da es meine Leidenschaft ist, Andere bei Ihren Projekten zu unterstützen, sollten Sie auch nicht davor scheuen, Ihre Probleme oder fehlende Motivation mitzuteilen. Ich helfe Ihnen sehr gerne! </p><p>Folgen Sie mein Kurs und bekommen Sie Ihre erste App sehr bald im Store!</p><p><br></p>", 
    "end_date": null, 
    "title": "1ste App ohne Erfahrung/Kenntnisse in 20 Tagen machen lassen", 
    "price": "20.00", 
    "instructors": "Anja Altberger", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/713230_3d8d_3.jpg", 
    "course_url": "https://www.udemy.com/die-erste-app-ohne-erfahrung-in-20-tagen-produzieren-lassen/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-02T12:38:51Z"
}