{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>Work Alongside Me &amp; Learn Exactly How to Code in Swift and build an iOS App. </strong>(Last Updated: Dec-20<em>-</em><em>2014</em>)  </p>  <h5><br>            Never coded before? No problem. We&#039;ve worked with over <em>150,000 students</em> just like you!</h5>  <p>  \t          The need to learn to code today is much like the need to learn to read when the printing press was introduced the year 1377.  </p>  <p>  \t          The printing press? Yes. It was an innovation that made books widely available and 100x easier to pick up a book and read... that is, if you knew how.  </p>  <p>  \t        Now, we have computers. And lots of them. Many of us have computers in our pockets, multiple ones in our homes, at our jobs, and even in our TVs. We have more power in our mobile devices today than top of the line computers did 10 years ago all for a fraction of the cost.  </p>  <p>  \t        Furthermore, is the power these mobile devices give us. We now have amazing ability to do things that was previously thought unimaginable. Get this, a person in Kenya today has more access to information than the United States President, Bill Clinton, did in 1995. That&#039;s thanks to two things: (1) <strong>The Internet</strong> and (2) <strong>Mobile Devices</strong>.  </p>  <p>  \t        The Internet is a collection of powerful computers that talk to each other. How do they talk? Through CODE.  The power of the computers is increasing exponentially while the cost is decreasing exponentially everyday thanks to Moore&#039;s Law.  </p>  <p>  \t          Since building computers, even basic ones, can be very expensive, learning to Code and Coding apps have become king.  </p>  <p>  \t  In this course, we&#039;re going to take you through the fundamentals of Coding, also known as Programming, through a programing language called Swift. This is a new language created by Apple in an effort to get more people coding, more quickly, and more powerfully than ever before.  </p>  <p>  \t  Where&#039;s the next <strong>Instagram</strong> coming from? The next <strong>SnapChat</strong>? The next <strong>What&#039;s App</strong>? Start learning to code today and it may come from you.  </p>  <p>  \t<strong>Apps are the result of Ideas in Action written in Code. </strong>  </p>  <p>  \t  After completing this course you will have a strong foundation in:  </p>  <ul>  \t<li><strong>Swift</strong></li>  \t<li><strong>iOS Development</strong> (the Cocoa Touch UI Framework)</li>  \t<li><strong>Programming Fundamentals</strong></li>  \t<li><strong>The Xcode Application </strong>(the code-editor for writing our application on Apple)</li>  </ul>  <p>  \t  There are <em>many reasons to learn</em> to code, here are a few:  </p>  <ul>  \t<li>Build new, 21st century, skills</li>  \t<li>A new way of thinking due to the logical nature of coding</li>  \t<li>Coders are in high demand, especially iOS developers. </li>  \t<li>Everything in every industry is up for grabs. <strong>Uber</strong> and <strong>AirBNB</strong> are examples of this. </li>  \t<li>Whatever can be automated will be and automation requires code and coders. </li>  \t<li>Create an app business</li>  \t<li>Become an Technology consultant for untapped industries.</li>  \t<li>Employment for Coders is <em>BOOMING</em>, <em>everywhere</em>, in <strong><em>every</em></strong> industry.</li>  \t<li>Once you know 1 language well, the world of programming is your oyster. That means learning Python, Ruby, Objective-C, Java, Javascript, and many more is a crazy amount easier.</li>  \t<li>Many, many more.</li>  </ul>  <p>  \t<strong>Course includes:</strong>  </p>  <ul>  \t<li>Related source code (what you learn to write to made programs)</li>  \t<li>HD video screencasts showing you step-by-step how to code on a real computer</li>  \t<li>Live Support from Instructor and Community</li>  \t<li>24/7 Streaming</li>  \t<li>30 Day Money-back Guarantee </li>  \t<li>Hours of Content with Free Video Updates</li>  \t<li>Email Support from Instructor </li>  </ul>", 
    "end_date": null, 
    "title": "30 Days of Swift: Learn the Basics & Build an iOS App.", 
    "price": "25.00", 
    "instructors": "Justin Mitchel", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373500_cb62_2.jpg", 
    "course_url": "https://www.udemy.com/30-days-of-swift/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-18T21:45:01Z"
}