{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t This tutorial on building iOS Apps for non-programmers from Infinite Skills teaches the absolute beginner how to build fully functional iOS apps for the iPhone and iPad. This course assumes no prior programming or iOS development experience.  </p>  <p style=\"\">  \t <br style=\"\">  \t You start the course with an introduction to Xcode, including learning to use the Xcode text editor, running your app in the simulator, and accessing documentation. You will then get familiar with Objective-C, covering topics such as objects, classes, and using frameworks and design patterns. This iOS tutorial will also show you how to use interface controls, animate the main view, and add user preferences and interface methods. Tony will teach you about adding iPhone interface objects, design an iPad experience, and testing the iPhone and iPad interface. Finally, you will learn to prepare your app for distribution, including adding icons and launch images and managing your apps in the App Store.<br style=\"\">  \t <br style=\"\">  \t By the completion of this computer based training course, you will be fully capable of creating iPhone and iPad apps from start to finish, including managing them in the App Store. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "A Non-Programmers iOS Training Course To Building iOS Apps", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/163612_c4b9_6.jpg", 
    "course_url": "https://www.udemy.com/non-programmers-ios-training-course-to-building-ios-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-13T14:38:29Z"
}