{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course, prepared by INVEDION™ -  a<strong> double mobile app prizewinner</strong>, was created for people who are interested in <em></em><strong>app development and design</strong><em></em> on the practical level to be able to make money on mobile apps in the future. </p><p><em><strong>We</strong></em><em><strong> are trustworthy tutors because:</strong></em></p><ul><li>We've won <strong>third </strong>and<strong> second places </strong>in<strong> Samsung App Challenge</strong> <strong>(over $30,000 in prize money)</strong> </li></ul><ul><li>We have over <strong>4 years of experience in mobile app development</strong> for all major platforms (Android, iOS, Amazon Fire, Tizen, Windows Phone, and Windows 10 Mobile)</li></ul><ul><li><strong></strong>We have<strong> 10 years of experience in the IT industry</strong> (creation of interactive websites, banners, software, promotional materials, e. g. movies, placards, business cards)</li></ul><ul><li>We have excessive expertise when it comes to developing well\nthought-out apps\nwith eye-catching and modern design for\ncustomers from around\nthe world\nand various\nindustries <strong>(about $50,000 of annual income from mobile app sales)</strong></li></ul><p><br></p><p>After completing this over <strong>11-hr long course (6 chapters, 44 videos)</strong> students will obtain a comprehensive knowledge to build stunning mobile apps with beautiful animations and integrated <strong>social media</strong> <strong>(Facebook and Twitter)</strong>  for both <strong>Android</strong> and <strong>iOS</strong>. </p><p>This course is best suited for absolute\nbeginners and intermidiate students <strong>(no prior knowledge of app development required)</strong>. We take our time to\nthorougly explain used tools, techniques, code, certain app concepts to make sure students can understand the meterial as best as possible. App development process is taught in an ascending manner -  from the easiest to hardest material. </p><p>The course comes along with assets that will be used in our mobile app. Furthermore, after each chapter there will be a finished project file (.fla).<strong> Adobe Flash CC</strong>, <strong>CS6</strong>, or <strong>Animate CC</strong> will serve as the IDE for app development. We'll be leveraging <strong>AIR</strong>, a cross-platform runtime system developed by Adobe Systems, for building desktop applications and mobile applications, voted as the <em>Best Mobile Application Development</em> product at <em>CES</em> in 2014 and 2015, and programmed using ActionScript.</p><p>If you want to see the app we'll be developing throughout this course, head to <strong>Google Play</strong> and search for <strong>Memorable Quotes</strong> by INVEDION™<em></em>.<br></p><p>If you're interested in the material and conept of this course on mobile development, please feel free to enroll and become our student today.</p>", 
    "end_date": null, 
    "title": "Advanced App Development & Design Course for iOS & Android", 
    "price": "30.00", 
    "instructors": "Invedion ™", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776358_afb0.jpg", 
    "course_url": "https://www.udemy.com/advanced-app-development-and-design-course-for-ios-and-android/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T21:44:10Z"
}