{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                                          The Course is about Advance Topics in Android Development covering Saving User Preferences in Android using Preferences ,Reading and Writing Data to Files in Android ( Internal and SdCard ), Services , Social Sharing.</p><p>More Sections added on how to share on  Facebook , Twitter &amp; Whatsapp. The Tutorial is break off from the parent Tutorial - The Ultimate Android Tutorial which deals with all these topics in utmost detail.</p>    <p>  \t<strong>PLANNING TO LEARN ANDROID IN DEPTH</strong>  </p>  <p>  \t<strong>Follow our Ultimate Android Tutorial - the biggest Android Tutorial on Udemy.</strong>  </p>  <p>  \t<strong>More than 300 lectures currently and still updating.</strong>  </p><p><strong>The Tutorial covers the new Facebook API 4.6 to login and share on Facebook. Get the Course Now .</strong></p>      <p>  \t<strong>The </strong><span style=\"color: inherit;\">Tutorial assumes the User has basic knowledge of Programming in Android and Java I/O .</span>  </p>    <p>  \t                                          For more on learning Java for Android Development Check out our Java Course .  </p><p>Java - Make it your cup of coffee</p><p>It covers Java in the most simple way and covers Java 8 Lambda Expressions and more.. So get started with Java &amp; Android.</p>  <p>  \t                        IF YOU LIKE THE TUTORIAL LIKE US ON FACEBOOK AND WE CAN SEND YOU UPDATES REGARDING UPDATES IN THE TUTORIAL / NEXT TUTORIALS.  </p>  <p>  \t                                     KINDLY PROVIDE YOUR VALUABLE REVIEWS TO ENABLE US TO INCORPORATE YOUR SUGGESTIONS IN THE UPCOMING LECTURES.  </p>", 
    "end_date": null, 
    "title": "Advance Android Programming - learning beyond basics", 
    "price": "20.00", 
    "instructors": "Learning Kart", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/78938_39b3_8.jpg", 
    "course_url": "https://www.udemy.com/advance-android-programming-by-9i-technologies/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-15T07:05:56Z"
}