{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Material Design in Android is the new and future way of designing and developing apps. It involves new APIs that not only enhance the visual perception of your apps but also the functionality in terms of how you create them and how the user perceives them.</p><ol style=\"\"><li style=\"\">This course walks through the process of building a simple app that displays list of movies but dives into absolute detail while building the app.</li><li style=\"\">The concepts learnt through this course can be applied to any other app you plan to design using material design terminology.</li><li style=\"\">You will be able to <strong style=\"\">make apps</strong> that use <strong style=\"\">Navigation Drawer, Toolbar, Transitions, RecyclerView, Animations, Ripple Effects, Material Tabs, Vector Drawables, JSON Parsing, Volley library, JobScheduler API</strong> and several other fixes after completing this course.</li><li style=\"\">Learn how to validate your design with your code with thirdy party APIs and libraries discussed in the course</li></ol><div style=\"\"><strong style=\"\">What are the requirements?</strong></div><ol style=\"\"><li style=\"\">You need to be familiar with Object Oriented Java and Basic Android programming concepts like Intents, Activities, Fragments, ListView</li><li style=\"\">Have Android Studio IDE installed </li></ol><div style=\"\"><strong style=\"\">What will I get from this course?</strong></div><ol style=\"\"><li style=\"\">Over 50 lectures in Material Design , worth over 20 hours of content</li><li style=\"\">Become proficient in Material Design APIs</li><li style=\"\">Learn to build apps that use RecyclerView instead of ListView</li><li style=\"\">Learn to integrate database with background data processing</li><li style=\"\">Understand libraries like Volley for background data processing</li></ol><div style=\"\"><strong style=\"\">Who is the target audience?</strong></div><ol style=\"\"><li style=\"\">Anyone who wants to build apps with material design and has some basic knowledge in Java and Android</li></ol>", 
    "end_date": null, 
    "title": "Android Material Design Slidenerd Style", 
    "price": 0, 
    "instructors": "Vivek Ramesh", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460570_52ea_3.jpg", 
    "course_url": "https://www.udemy.com/android-material-design-zero-to-hero/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T12:37:21Z"
}