{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t        The <strong style=\"\">Ultimate Android App Development Course</strong> is here. With the latest edition of our Android course we bring together a curriculum and pedagogy which will be help a beginners and an intermediate developer alike. In our course we have tried to present the concepts in such a way that you will be able to understand and use them quickly first using our lab exercises and then in your own practical projects. It is aimed to hold your hand all the way to make sure all the APIs and their usage is clear to everyone.  </p>  <p style=\"\">  \t        You will start from the basic Android architecture and ecosystem and follow it up with simple APIs and then graduating to complex and latest APIs such as Sensors, Material Design and Data Storage.  </p>  <p style=\"\">  \t<strong style=\"\">Why this course is for you?</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">Focus on Practical App Development Concepts<br style=\"\">  \t</strong></li>  \t<li><strong style=\"\">Tips to make your App more professional<br style=\"\">  \t</strong></li>  \t<li><strong style=\"\">Learn to monetize your apps<br style=\"\">  \t</strong></li>  \t<li><strong style=\"\">Prepare yourself for an Android Job Interview<br style=\"\">  \t</strong></li>  \t<li><strong style=\"\">Through discussion on important Android APIs </strong></li>  </ul>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Some of the Concepts Covered in the Course:</strong></em>  </p>  <p style=\"\">  \t<strong style=\"\">Android tools and Ecosystem</strong> - Get to know the Android Ecosystem and tools and SDKs you will need to get started on Android Development.  </p>  <p style=\"\">  \t<strong style=\"\">    Android UI</strong> - Learn about Views, view groups, layouts, listeners,Margin and Gravity. Learn to create cool and immersive UI for your apps.  </p>  <p style=\"\">  \t<strong style=\"\">    Activities and Intents</strong> - Learn about Android control flow and user interaction using Activities and Intents.  </p>  <p style=\"\">  \t<strong style=\"\">    Adapters and Dynamic Views</strong> - Master the concepts behind creating dynamic views consuming web services. learn to create custom Adapters for your apps  </p>  <p style=\"\">  \t<strong style=\"\">Fragments and User Navigation</strong> - Learn about the use of fragments and how to use standard navigational APIs with them.  </p>  <p style=\"\">  \t<strong style=\"\">    Data Storage and Web Services</strong> - Learn to implement persistence and make your app talk to web services. Create mobile apps which connect seamlessly to enterprise backend systems.  </p>  <p style=\"\">  \t<strong style=\"\">    Lollipop APIs</strong> - Get to work on new Android Apis and learn new concepts such as Material Design on Android. Master the Apis that are new and powerful.  </p>  <p style=\"\">  \t<strong style=\"\">Google Play and Best App Development Practices</strong> - learn to make killer apps and make money by integrating ads. Prepare yourself for an Android job Interview  </p>  <p style=\"\">  \t      Learn all this and much more in the transformative course which will turn a rookie into a professional developer. So get started and see you on the other side.  </p>", 
    "end_date": null, 
    "title": "Android Lollipop 5.0 : Ultimate Tutorial for App Development", 
    "price": 0, 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382968_76f7_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-android-lollipop-app-development-course/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T11:46:27Z"
}