{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t      This course is designed which will show you many tips and tricks that you will require during Android Application Development.  </p>  <p>  \t      It shows you how you can Install <strong>200% Faster Emulator</strong> <strong>Genymotion</strong>. Genymotion is completely free for personal usage. It gets started within 10 seconds and helps you to run the android apps at very faster rate. So, you get rid off default emulator which is too Lazy.  </p>  <p>  \t      Install a Jar <strong>Droid At Screen </strong>which enables you to display your smartphone on your Laptop screen.  </p>  <p>  \t      You will also Learn how to install USB Drivers on your laptop and <strong>Run Android Apps</strong> on your <strong>Smartphones</strong>.  </p>  <p>  \t      If you are using 4.2 or above versions then how you can enable developer option that is also well Explained.  </p>  <p>  \t      In order to <strong>Publish</strong> your Apps in <strong>Google Playstore</strong> then how you can get a <strong>Developer Account </strong>at google Playstore, how you can Export Signed APK File and resolve all the bugs that may occur when you export the signed Apk File.  </p>  <p>  \t      Prepare your <strong>Google PlayStore Listing</strong> to Attract people to your Apps on the playstore. <strong>Increase your Traffic</strong> to your App as that all matters to make your <strong>App popular and Rank at the top</strong> on the Play Store.  </p>", 
    "end_date": null, 
    "title": "Android Developer Tips", 
    "price": "20.00", 
    "instructors": "Smartherd Developers", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334488_94a5_2.jpg", 
    "course_url": "https://www.udemy.com/android-tips-smartherd/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T02:22:34Z"
}