{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>I will take you from beginner to <strong>COMPLETELY</strong> published on the Google Play Store. <strong>NO OTHER COURSE</strong> takes you all the way through the process and in so much detail !!</p><p>-----------<strong>Review of this course</strong>--------------</p><p><em>Really engaging, like the way you explain all the little things, good for us beginners!<span></span><br></em></p><p>--------------------------------------------------------</p><p>-----------<strong>You will be published</strong>--------------</p><p><em>By the time you're done with this course you will have an app on the Play Store. One that earns passive income from advertising!<br></em></p><p><em>That's money <strong>STRAIGHT</strong> into your pocket!</em></p><p>--------------------------------------------------------</p><p>Please stop buying '<em>How to code 10 Android apps in 10 days</em>' courses...</p><p>There is <strong>so</strong> much more to Android app development than just plain coding tutorials!</p><p>That's why I created this Android development course! No other Android development course takes you from beginner (with no experience) to published. They only show you 'How to make an Android app', wth no reference to all the other parts such as:<br></p><ul><li>Signing your Android app</li><li>Becoming a Google Android developer</li><li>Creating signing keystrokes for Android</li><li>Submitting an Android app to the Play Store</li><li>Marketing through your Android app listing</li></ul><p><br><strong>This course is for you if you want to: </strong></p><ul><li>Learn the Android development process - from complete beginner to Play Store publishing (no-one else does this, they only show 'how to code' app tutorials)</li><li>Get paid $100 - $150 per hour to make apps for paying clients</li><li>Create your own wildly popular apps</li><li>See the whole development process <em>as it really is</em>.</li><li>Have a real app you can publish under your own account</li></ul><p><strong>This course is not for you if:</strong></p><ul><li>You are an expert or intermediate programmer</li></ul><p><strong>What software do you need?</strong></p><ul><li>Android studio (free) which needs to be run on a Pc or Mac or Linux</li></ul><p><strong>Do you need experience?</strong></p><ul><li>No. I assume you are a complete beginner to Android development </li></ul><p><strong>What makes this course different?</strong></p><p>It reveals the true nature of app development - an involved process with many design and usability iterations. Top clients (those with money) will expect a certain level of professionalism and do not mind large bills to match if you bring them value.</p><p>My last invoice amounted to £18,000 for a simple, unpublished version 1 app. It was paid off immediately with the project manager commenting 'great value and cheaper than large studios'. He loved it because we had gone through several design stages beforehand, allowing him to get exactly what he envisioned.</p><p>If I had simply presented my 'app coding abilities' I would have only been able to charge one third of that amount.</p><p>The reality is that making beautiful apps allows you to charge far more <strong>and </strong>produce fantastic looking work.</p><p>That work becomes your calling card, with clients seeking you out instead of the other way around.<br><br></p><p><strong>The extras you get when taking this course:</strong><br></p><ul><li>I break down some app industry guidelines you should follow when creating an Android app (hint: we borrow from other creative industries).</li><li>You learn to think outside the box, giving you an advantage over all your competitors</li><li>A good basic grounding in Android Studio app development (and the Java language)</li><li>An app you can actually publish yourself!</li></ul>", 
    "end_date": null, 
    "title": "Android Mobile App - A Published RSS Reader App", 
    "price": "20.00", 
    "instructors": "Mr Grant Klimaytys", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676748_8ccf_4.jpg", 
    "course_url": "https://www.udemy.com/creating-beautiful-android-apps-design-code-and-publish/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T19:56:09Z"
}