{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tWith <strong style=\"\">&quot;Android App Development Essential Training&quot;</strong>, you will learn everything about Android App Development, even if you&#039;ve never build one before!  </p>  <p>  \t         The full course has <strong style=\"\">several video lectures</strong>, divided into several chapters. Each chapter will give you a new level of knowledge in Android development. We&#039;ll start from the basics of android App development to more advanced and the most popular techniques and features used now a days.  </p>  <p>  \t <strong style=\"\">&quot;Android App Development Essential Training&quot;</strong> will give you a new perspective on how the Android SDK works and after you completed the course you will be able to create your own Android Apps with the latest API. Hope you enjoy!  </p>  <p>  \t <strong style=\"\">NOTE: </strong>In order to keep you up to date in the world of Android Development all the chapters will be updated regularly with new lectures, projects, quizzes and any changes in future versions of all the programming languages covered on the course.  </p>  <p>  \t <em style=\"\"><strong style=\"\">&quot;The average annual salary for employed app developers in 2011 was nearly $90,000. By 2016, the total revenue from consumer mobile apps is expected to top $50 billion.&quot; By learning android development from this course you can also earn the same amount of salary or even more than that. Best of Luck</strong></em>  </p>", 
    "end_date": null, 
    "title": "Android App Development Essential Training", 
    "price": "20.00", 
    "instructors": "QScutter Tutorials", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131500_1dd4_6.jpg", 
    "course_url": "https://www.udemy.com/android-app-development-essential-training/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-09T20:17:01Z"
}