{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  The course also includes doubt solving webinars (bi-weekly) for this course takers to improve learning effectiveness of the course. The bi-weekly session will help you in two ways: a) Doubt solving from the course and b) Latest trends in the technology.  </p>  <p>  \t  The sessions will be conducted on 15th and 30th of each month at 1230 hours GMT (or 0830 hours EDT and 1800 hours IST). To register for the same, <u style=\"\">Please check the announcement section</u>. <span>(after enrolling for the course)</span>  </p>  <p>  \t  ------------------------------------------------------------------------------------------------------------------  </p>  <p>  \t<strong style=\"\">Mobile Apps</strong> are becoming popular across all demographics – Academics, Businesses, Entertainment, Communication, Travel, Maps etc.  </p>  <p>  \t<strong style=\"\"> Android </strong>has become the most popular platform since no other platform offers applications for free. As <strong style=\"\">smartphone adoption</strong> continues to grow at an amazing pace, and Android’s affordability and hardware independence have catapulted it to the lead in this rapidly growing space.  </p>  <p>  \t<strong style=\"\">  This course teaches Android programming from scratch. </strong>You’re right! You just need to have basic knowledge of computer. Right from installation to understanding syntax and basic concepts of programming. This course teaches you all so that you’re ready to build apps on your own. What’s more? You will learn to use native features such as creating menu, using camera and pop-up menu.  </p>  <p>  \t            If we want to summarize this course in one sentence - This course will help you to start your way into Android Development <strong style=\"\">without any programming knowledge</strong>.  </p>  <p>  \t           So Get Ahead and learn Android Programming now to stay relevant in the industry  </p>  <p>  \t    Course includes:  </p>  <p>  \t    - 2+ hours of video tutorials  </p>  <p>  \t    - Project files  </p>  <p>  \t    - 6 Short Quizzes to test your understanding  </p>  <p>  \t  - Bi-weekly Webinars (15th and 30th of each month)  </p>  <p>  \t    - Yoda&#039;s Cheat Sheet  </p>  <p>  \t    You can visit our other courses on <a href=\"https://www.udemy.com/u/yodalearning/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Udemy</a>  </p>", 
    "end_date": null, 
    "title": "Android Programming for Newbies", 
    "price": "20.00", 
    "instructors": "Yoda Learning", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/261702_7c44_2.jpg", 
    "course_url": "https://www.udemy.com/android-app-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-15T11:50:34Z"
}