{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the basic concepts, tools, and functions that you will need to build fully functional Android Apps without Coding with the popular MIT App Inventor.<br></p><p><strong>Build a strong foundation in Android App Development with this tutorial for beginners.</strong></p><ul><li>Getting Started With MIT App Inventor2</li><li>Understanding User Interface and Components</li><li>Adding Functionality With Blocks</li><li>Running Apps on Real Device</li></ul><p><strong>A Powerful Skill at Your Fingertips </strong><br>Learning the fundamentals of Android App Development puts a powerful and very useful tool at your fingertips. MIT App Inventor is free, easy to learn, has excellent documentation, and is the base for creating professional Android apps without coding.</p><p>Jobs in Android App development are plentiful, and being able to learn Android App Development will give you a strong background to more easily pick up other Android app development tools.</p><p><strong>Content and Overview </strong><br><br>Suitable for Everyone, through this course of 20 lectures and 1 hour of content, you’ll learn all of the MIT App Inventor Fundamentals and establish a strong understanding of the concept behind Android App Development. Each chapter closes with Quizes, putting your new learned skills into test immediately.</p><p>Starting with setting up MIT App Inventor, this course will take you through App Inventor User Interface, visible and Non visible Components, Blocks and how to use them. By creating Apps, you’ll a establish a strong understanding of Android App Development process.</p><p>With these basics mastered, the course will take you through how to use Blocks to add complexity and functionality to your programs.</p><p>Students completing the course will have the knowledge to create functional and useful Android Apps in minutes without coding.</p><p>You’ll be able to work alongside the author as you work through each concept, and will receive a verifiable certificate of completion upon finishing the course.</p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Android App Development : Build 6 Android Apps and Games", 
    "price": "20.00", 
    "instructors": "Raja Biswas", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708480_3c15_2.jpg", 
    "course_url": "https://www.udemy.com/create-android-apps-in-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T11:29:22Z"
}