{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>** ONLY FREE ANDROID COURSE WITH 8+ HOURS OF CONTENT **</strong><br></p>  <p>  \t              There goes a chinese proverb - <em><strong>\"Tell me, I'll forget. Show me, I'll remember. Involve me, I'll understand.\"</strong></em>  </p>  <p>  \t              The highest degree of learning takes place with your involvement. And this course is designed to do exactly that. This course introduces you to the basics of Android development. You will need some Java fundamentals to get started. If you are not sure about the difference between an <em>abstract class</em> and an <em>interface</em> you might have to refresh your Java concepts before proceeding.  </p>  <p>  \t              Also, if you are new to Java I recommend John Purcell's Java Course, in order to acquire the minimal Java programming skills required to step into Android development.  </p>  <p>  \t              I've also got you some companion code which you can download from the appropriate lectures. You'll be working on the source code along with me, so that you could get a good grasp on the concepts you will eventually be introduced to. At the end of this course you'll be able to <em>write</em> and <em>deploy</em> AWESOME!! apps to Google Play.  </p>  <p>  \t<strong>How is this course designed?</strong>  </p>  <ul>  \t<li><em><strong>Comprehensive</strong></em> - Contains lessons and exercises that enable you to develop real-world Android applications.</li>  \t<li><em><strong>Simple &amp; Sequential</strong></em> - To keep complexity at bay, the course introduces you to independent concepts initially and then reveals more of the complex stuff.</li>  \t<li><em><strong>Focused towards Results</strong></em> - This is the same course that we use internally at our mobile app startup, to train new talents.</li>  \t<li><em><strong>Hands-on Sessions</strong></em><em> -</em> I guide you through sessions building apps and writing code snippets clearly explaining every line of code.</li>  \t<li><em><strong>Drills</strong> -</em> Easy-to-moderate beginner level exercises in which you get the opportunity to practice what you've learnt and verify the same.</li>  \t<li><em><strong>Elaborate Videos</strong> -</em> Learn Android concepts in a thorough manner, I've made sure that all WHYs and HOWs you need to know are covered.</li>  </ul>  <p>  \t              Since this course is for beginners, I highly recommend you to take this course sequentially. You can pick on random videos, but remember - the complexity increases down the road so it is imperative that you take them one by one.<strong><br>  \t</strong>  </p>  <p>  \t<strong>What makes me qualified?</strong>  </p>  <ul>  \t<li>Started out as an indie Android developer in 2009 and have programmed for Android since the Cupcake days (Android 1.5).</li>  \t<li>Developed more than 100 Android apps till date, including games and other apps that use the Android NDK.</li>  \t<li>Contributed open-source libraries for Android that improve developer productivity, notable ones are Android Saripaar, Simple Section Adapter, and Instant Adapter.<br>  \t</li>  \t<li>Bootstrapped a startup and currently have 9 developers working on Android and iOS.</li>  \t<li>Training people since 2005 ;)</li>  </ul>  <p>  \t              What are you waiting for? Gear up and lets have some fun!!  </p>", 
    "end_date": null, 
    "title": "Android Development for Newbies (8+ Hours of Content)", 
    "price": 0, 
    "instructors": "Ragunath Jawahar", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49361_db23_11.jpg", 
    "course_url": "https://www.udemy.com/learn-by-doing-android-for-beginners/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-11T11:38:54Z"
}