{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tAndroid Ecosystem is LARGE and growing exponentially. <strong style=\"\">Active community of developers, open source, pre-defined libraries</strong> are some the key reasons for its popularity. Additionally, Google’s efforts to keep the <strong style=\"\">codes simple</strong> allows easier development.  </p>  <p>  \tAndroid apps has not only <strong style=\"\">penetrated phones &amp; tablets</strong>, but it’s all set to power a plethora of other devices such as <strong style=\"\">home appliances</strong>. Mo<span>st Android applications are written in <strong style=\"\">Java</strong>. </span><strong style=\"\">You may have missed the first wave. However, grab the opportunity to be prepared for the next.</strong>  </p>  <p>  \tIf you have a <strong style=\"\">basic knowledge about any programming language</strong>, this engaging and all-practical program is for you. This course will give you the proper kick start that you need to get into android development.  </p>  <p>  \t<strong style=\"\">What will you learn in this course?</strong>  </p>  <p>  \tLearn to <strong style=\"\">start building your own apps</strong>. Experience first-hand all of the learning outcomes by making a <strong style=\"\">live project</strong>.  </p>  <p>  \tThis <strong style=\"\">project </strong>is a<strong style=\"\"> Get Together Application</strong> which will teach you about the different <strong style=\"\">UI elements</strong> and<strong style=\"\">how to structure them</strong>. You will also learn how to <strong style=\"\">implement SQLite and create a database to manage multiple friends</strong>.  </p>  <p>  \tWe have also included an outline for a Do it yourself (DIY) Project. This project will your <strong style=\"\">gateway to android app development world</strong>. We want you to complete a <strong style=\"\">student timetable app</strong> (Outline provided) and <strong style=\"\">then submit it to us. Our instructor will then rate your project and provide certificates with Grades. These certificates can be showcased to highlight your skills.</strong>  </p>  <p>  \tCourse Includes –  </p>  <ol style=\"\">  \t<li><span>4+ Hours of High Quality Videos</span></li>  \t<li><span>Lifetime support through email</span></li>  \t<li><span>Source Files for all the individual topics</span></li>  \t<li><span>Yoda Cheat Sheet</span></li>  </ol>", 
    "end_date": null, 
    "title": "Android Development Essentials with DIY Project", 
    "price": "20.00", 
    "instructors": "Yoda Learning", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302790_ec1e_4.jpg", 
    "course_url": "https://www.udemy.com/android-development-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T08:10:30Z"
}