{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t      Coupons and updates on twitter, follow us @AntPachon.</p><p style=\"\">This course will be updated with Android M as soon as there is an available version! </p><p style=\"\">This is the only Android course on Udemy taught by an Android expert who makes apps full time for 5+ years for companies such as MasterCard and British Telecom.   \tWhat is the benefit of this?  \t  \t You will not only learn Android but you will learn how to use the most popular third party libraries, what are the best coding practices, how to structure your app efficiently, tips and libraries that will save you a lot of headaches and a lot of time during the development.  \t  \tDuring +5 years of development I have learned many ways of doing the same thing, for instance there are three ways of coding a button click or there are hundred of ways and libraries to download an image and display it in your app. In this course I will teach always the easier way and I will show the alternatives, sometimes I even show you the difficult way first and then the easiest way so you know what are you doing and why are you doing it.  </p><p style=\"\">  \t                                    The instructor will replicate his process to learn from beginner to professional in a way that everybody can understand, simple and efficient, working in the basics and important concepts and teaching how to solve your own problems.  \t  \t                                    After completing four applications, each one a bit more complex, you will be a real Android developer!Captions has been added to all the lessons  \t  \t                                      Note: All the apps developed in this course are compatible with Android L 5.0 (Lollipop) and a video explaining the key features of Android L is added.  \t  \t                                            This course is for anybody who is interested in Android Development; either to create your own application, start a career or increase your current skills. We will take you from zero knowledge to the ability of creating your own apps. Knowledge of Java is not needed.   \t  \t                                                              The method of teaching used is &#039;Learn by Doing&#039;; we&#039;re keen to get you using and becoming comfortable with Android Studio in the very first lesson. The lessons are practical and include student exercises with solutions, as well as inside knowledge and tips from your professional tutor.  </p>  <p style=\"\">  \t                                                  On every lesson there will be some part of an App to develop, if there is any new concept not seen before we will explain it and after that we will practice with it developing that bit.  \t                                                  Also we will realize exercises to test that knowledge, explaining it with different solutions after leaving some time for the student to try it on his own.  \t  \t                                                              This course has 9.5 hours of videos with four application tutorials. We promote student-tutor interaction. Have any problems? Let us know and we&#039;ll answer you as quickly and coherently as possible; either in the form of a new video or a written explanation.  </p>  <p style=\"\">  \t  \t                                                  - For the first application you will learn how to use the tools correctly, how to create a project and you will understand how android works internally and how the project is structured and to finish we will launch our first Application on a real device or a emulator.  \t  \t                                                  - We will continue with a section which will tell you how to find problems, how to understand errors and how to be self sufficient, finding and adding resources to your code so that way you can keep improving applications in your own.  \t  \t                                                  - The second application will be a game, called HangDroid a version of the classic hangman, here we will see Android in more depth, learning the basics about screen navigation, view creation, data persistence and much more, finishing with a game where you can play on single player mode or even multi player with another person!  \t  \t                                            - The third application and more important will introduce Fragments, Tabs, Action Bar, Google Maps, Google Admob to monetize your app and will teach how to upload your App to Google Play Store  </p>  <p style=\"\">  \t                                        - The fourth application currently under construction is an App that displays posts from Reddit. This allow us to explain how to consume a Rest API, how to make HttpConnection, parse a JSON response and use SQLite to store the posts, being able to see them in offline mode.   \t  \t                                                              This course has been created from a developer who learned how to do apps during four years with more than 15 apps, and his idea is to sum up the process of learning, giving it to you with basics examples and teaching you the methodology used to keep learning on your own so at the end of the course you will not only have learned the basics but also be self sufficient on the Android Apps development.    \t  \t  \t                                            This is what our students said :  </p>  <p style=\"\">  \t                                            - <em style=\"\">I have recently enrolled into your course on Udemy for Android, I have  to say I am loving the course and must give yourself top marks for the  teaching style and presentation of the tutorials  \t  \t</em>  </p>  <p style=\"\">  \t                                            -<em style=\"\"> I tried develop in Eclipse IDE with plugin ADT. But i had much  errors, not with develop application, but with Eclipse. Solve all errors  take me time. And i used AVD from Eclipse, omg it take even more than  10 - 15 minutes to run project. Again waste of time. </em>  </p>  <p style=\"\">  \t<em style=\"\">But than i  find your course. It is about 3 day ago. I switched to Android Studio, i  start learning lot of about develop java android app.</em>  </p>  <p style=\"\">  \t<em style=\"\">You help me make &quot;move&quot; things. I see progress with my android develop skills.</em>  </p>", 
    "end_date": null, 
    "title": "Android Studio Course. Build Apps. Android 6.0 Marshmallow", 
    "price": "50.00", 
    "instructors": "Antonio Pachón", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298212_5847_3.jpg", 
    "course_url": "https://www.udemy.com/android-tutorial-from-beginner-to-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-11T07:58:56Z"
}