{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Android: From Beginner to Paid Professional</strong></p>\n\n<p>Learn to code the Devslopes way. At Devslopes we teach you the platform and the underlying coding principles. We believe in building engineers and not copy-and-paste students. You can get started with no experience or with lots of coding experience.</p>\n\n<p>Learn everything you need to know to have professional Android development skills.</p>\n\n<p><strong>Why This Course?</strong></p>\n\n<p>Devslopes first flagship course iOS 9 &amp; Swift:  From Beginner to Paid Professional took the world by storm and is the most effective course on iOS development on the Internet with thousands of 5 star reviews and tons of success stories.</p>\n\n<p>Using that same formula for success we have brought you the even better Android course.</p>\n\n<ul><li>Learn to code how the PROs code - not just copy and paste</li><li>Learn the latest Android APIs and services - we don't teach old junk</li><li>SUPER FUN - You will laugh and have fun while learning</li><li>Beautiful Apps - We don't build trash - you'll create amazing real-world apps</li><li>Zero Experience needed to start</li><li>Build Real Projects - You'll get to build projects that help you retain what you've learned</li><li>Live Help - I've brought on a bunch of Teacher's Aides who are always available to help in our online chatroom </li></ul>\n\n<p><strong>How Long Will This Take?</strong></p>\n\n<p>This course with all of its exercises should take you a good 6 weeks if you spend 1-2 hours on it every day.</p>\n\n<p><strong>How Is The Course Structured?</strong></p>\n\n<p>You start by learning how to code with Java. Then you start building some simpler apps and move on to more complex fully-functional apps. You build projects in-between that allow you to stretch and grow using the principles you just learned, but without copying and pasting code.<br></p><p><strong>What Do I Get?</strong></p><ul><li>Tons of amazing Android learning content</li><li>10 FREE App Asset Packs (Worth thousands of dollars)</li><li>Live support in our online chatroom</li><li>Certificate of completion (when completed)</li><li>Potential for a whole new career / lifestyle</li></ul>", 
    "end_date": null, 
    "title": "Android: From Beginner to Paid Professional", 
    "price": "50.00", 
    "instructors": "Mark Price", 
    "commitment": "21 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705934_83b6.jpg", 
    "course_url": "https://www.udemy.com/learn-android/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T20:03:23Z"
}