{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>If you've ever wanted to actually build the mobile app ideas floating around in your head but didn't know where to start, this is the course for you. This course is meant to get you started developing mobile apps even if you've never written a line of code. </p><p>You'll start by building fully functional apps without writing code. You'll then move to fully learn both Android and iOS development along with the Java and Swift programming languages. </p><p>Going beyond just app development, you'll also learn mobile UI/UX design and how to mock up your app ideas using Sketch 3. </p><p>Finally you'll learn how to leverage the power of PhoneGap, which lets you write your app once and convert it to other platforms for publishing. </p><p><strong>Getting Started with App Development</strong></p><p>You'll start by learning app development without writing code at all using Android App Inventor. Here you'll learn basic programming terminology and concepts by building functioning mobile apps that you can actually publish to the market. <br></p><p>By removing the coding aspect from app development, you'll be able to truly understand what you're doing before diving into the more complex world of writing code. </p><p>This is what sets our course apart from all the others you'll see on Udemy. </p><p><strong>Android App Development</strong></p><p>First you'll learn the basics of Java, which is essential for Android Development. Then you'll be ready to learn Android app development,</p><p><strong>Apple (iOS) App Development</strong></p><p>Start by learning the new Swift programming language. Swift is the language iOS developers will be using to develop apps moving forward. Next you'll learn basic iOS app development using Xcode before moving on to intermediate and advanced topics that will allow you to publish apps to the app store, add in-app purchasing and much more. </p><p><strong>App Design and UI/UX Design</strong></p><p>Apps that don't look great or don't function well for the user will be deleted faster than they were downloaded. In the following sections you'll learn everything you need to know about user interface design and user experience design so you can develop apps that people will actually want to use. </p><p>You'll also learn how to mock up your app designs using the popular Sketch 3 mobile mockup software. </p><p><strong>PhoneGap</strong></p><p>PhoneGap is a technology that allows you to write your app using one programming language and SDK, then convert it to other platforms for publishing. So if you prefer to make your app using Java and the Android SDK, you'll be able to publish your apps to the Apple App Store and the Windows App Store without having to write new apps for each platform. Neat!</p>", 
    "end_date": null, 
    "title": "Android and Apple App Development: Beginner to Pro", 
    "price": "40.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "42 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/751664_9ba1_2.jpg", 
    "course_url": "https://www.udemy.com/android-and-apple-app-development-beginner-to-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T21:05:51Z"
}