{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Presenting <strong>ANDROID LOLLIPOP and ANDROID MARSHMALLOW</strong> App Development tutorials.  </p>  <p>  \t                                The course is intended for those who are looking to <strong>pursue</strong> their <strong>career in Android</strong> based development. There is no such qualification to join the course as it is designed in a way to <strong>facilitate a newbie</strong> to understand the myriad of opportunities that Android can deliver. With easy-to-understand course materials backed by practical classes one can quickly grasp the aesthetics deploying Android as a platform.  </p>  <p>  \t<strong>Course with All Source Codes of Projects.</strong>  </p>  <p>  \t<strong>Make complete professional apps and tips to MAKE MONEY through Android Apps.</strong>  </p>  <p>  \t          Upon completion of the course it will be easy to <strong>develop Android based applications</strong> with all new features of android <strong>MARSHMALLOW</strong> and <strong>LOLLIPOP</strong> ( 5.0 ) and above versions. The training not only imparts the programming side of the development but also delivers valuable suggestions behind developing a pleasing and <strong>effective UI</strong> (User Interface) design. The professionals involved in the training all hail from organizations of repute having vast experience in Android domain.  </p>  <p>  \t                            This <strong>course covers Latest ANDROID STUDIO</strong> launched by Google and is based on <strong>MARSHMALLOW and above Versions</strong>. A complete professional App is made in this course covering all android widgets, components and covering all fundamental concept. Starting from installing software to <strong>publish app in Google PlayStore</strong> all Topics are covered well.  </p>", 
    "end_date": null, 
    "title": "Android Lollipop and Marshmallow App Tutorials: Make 20 Apps", 
    "price": "20.00", 
    "instructors": "Smartherd Developers", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259050_2ebe_12.jpg", 
    "course_url": "https://www.udemy.com/android-smartherd/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T15:05:28Z"
}