{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  If you want to get in on the rapidly expanding market for Android apps,  you’ll need to understand the important concepts behind Android  development, which may not be intuitive for those familiar with other  platforms. In this course from expert programmer and developer Jack William, you’ll begin by stepping through the process of  setting up your Android development environment, defining device  emulators, and connecting to actual Android devices. Next, you’ll learn  about the fundamentals of Android layouts and UIs and how to program  your app’s interaction with activities and services. With your basic  Android app fleshed out, you’ll learn how to broaden your app’s target  audience by making it run on as many devices, screen sizes, and form  factors as possible. And finally, you’ll learn how to package your app  and publish it to the Android Market.  </p>  <p>  \tThis course covers every step in the process of Android app development  and design, from setting up your development environment, to creating  the app itself, to packaging and publishing it. The contents of this  course include:<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Setting Up Your Environment for Android Development</strong><br style=\"\">  \tIn this chapter, you’ll see how you set up and extend your development environment (IDE) for native Android development.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Building Your App&#039;s UI</strong><br style=\"\">  \tIn  this chapter, you&#039;ll learn the most important concepts for building  your app’s UI. We’ll take a look at general Android principles, the  typical project structure of an Android application, and everything  you’ll need to know to compose the layouts for your app.<br style=\"\">  \t<strong style=\"\"><br style=\"\">  \tProgramming Interaction</strong><br style=\"\">  \tAs  a truly component-based operating system, Android provides a simple way  to control interactions between the components of your app and other  applications installed on the same system. This video will tell you all  about it.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Persisting Application Data</strong><br style=\"\">  \tApps  need to persist data they accumulate while being used, and the most  convenient way is through a database. This chapter gets you up and  running with leveraging SQLite databases in Android.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Publishing Your App</strong><br style=\"\">  \tIn this chapter, you’ll learn the final steps needed to bring your application into the Android Market.<br style=\"\">  \t<br style=\"\">  \tThe  lessons are wrapped in a feature-rich interface that lets you jump to  any topic and bookmark individual sections for later review. Full-Screen  mode provides a hi-def, immersive experience, and Watch-and-Work mode  shrinks the video into a small window so you can play the videos  alongside your application. Also included are exercise files that give  you an easy way to try out  the techniques you learn and a 48-page guide  containing supplemental  material.  </p>", 
    "end_date": null, 
    "title": "Android App Development and Design", 
    "price": "20.00", 
    "instructors": "Skill Pass", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/268554_6c13_4.jpg", 
    "course_url": "https://www.udemy.com/android-app-development-and-design/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-25T10:46:48Z"
}