{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"Great tutorial that is step by step on rooting your android phone. The instructor goes into depth on deploying various software that will root your phone. Warning rooting can void your warranty so make sure you use a phone that you don't mind experimenting with. \"</em> </strong><em class=\"redactor-inline-converted\">- </em><em class=\"redactor-inline-converted\">Gerard DeSousa </em></p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"Thank you so much for teaching this course. Now I can really own my Android!!! \"</em></strong> -  <em class=\"redactor-inline-converted\"> Jesse Rubiopadua </em><br></p>\n\n<p><em><strong>\"awesome course ... i Recommend to take it.\" </strong>- Mahmoud Mohamed Bakr</em><br></p>\n\n<p>The ultimate course on Android Hacks, the first thing would have assumed by hacks would be something illegal but believe me it is not anything wrong. This course simply helps you in learning hacking android to keep yourself Safe for ethical purposes and to make your device a super fast machine without doing anything wrong and without doing anything illegal. You would learn all possible ways to make your device a much better, efficient and much more powerful. This course will cover all possible and common but major problems that almost everyone is facing these days and no one has got any solution after even searching for hours on search engines but this course will completely clear your concepts and clearly show you the thing and solutions for what you're looking for. If we say that this course is a \"Live saver\" for Android user, we aren't saying anything wrong. </p>\n\n<p>First of all we'll cover a little bit theory of some concepts used in this course. After that we'll show you how you can implement the actual rooting process of an Android device very effectively and without doing anything wrong to your device. Also, if you have done anything wrong and all things are messed up. There is no need to worry we'll show you solution to every problem and guide you through every step in detail. We'll show you how you can get your stuff back even when the rooting process goes wrong. After that we'll show you some magnificent benefits of taking this course. We'll help you in making your device much more faster, efficient and more powerful, as I said previously. And this is not the end. We'll show you some extra magic lectures that you're going to love. So, what are you waiting for? Come on, enroll now and get this amazing course in your hands. <br></p>", 
    "end_date": null, 
    "title": "Android Hacks : Truly own your device", 
    "price": "20.00", 
    "instructors": "Amit Huddar", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/391904_5129.jpg", 
    "course_url": "https://www.udemy.com/android-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T10:47:00Z"
}