{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Building stand alone applications that only function and save their data on the device that they are installed on is becoming obsolete and not feasible. With the increased use of mobile devices, it is common for applications to offer ways to backup, sync and share data in the cloud. </p><p style=\"\">A type of backend is usually needed where data can be saved and manipulated but this requires time, resources and skills to make it work. Fortunately, there are several platforms like Parse that provide a backend that we as developers can integrate with our applications.</p><p style=\"\">This course will introduce the popular Parse SDK and show you how to integrate it with your Android applications in order to save application data in the cloud.</p><p style=\"\"><strong style=\"\">Content and Overview of the course</strong></p><p style=\"\">This course will mainly focus on the Parse SDK, but in order to build our final application we will also do some basic Android coding. This course includes:</p><ul style=\"\"><li style=\"\">Creating activities and moving between activities using Intents</li><li style=\"\">Creating aesthetically appealing buttons using only XML</li><li style=\"\">Creating a fully fledged login screen using the Parse SDK to do email verification and password reset.</li><li style=\"\">Using the Parse SDK to create data in your online database, edit and delete existing data.</li><li style=\"\">Showing information in a custom ListView</li><li style=\"\">Using the action bar</li><li style=\"\">Working with different icons and pictures</li><li style=\"\">Sending push notifications directly from your Android application or the Parse website to all users using the application</li><li style=\"\">Adding Parse Analytics to your application for tracking event data</li></ul><p style=\"\">The Parse SDK makes saving data in the cloud a walk in the park. In less than 4 hours, you will be building an application that will be able to save data in the cloud in an exciting and fun way!</p><p style=\"\">I am excited to start working with you!</p>", 
    "end_date": null, 
    "title": "Android: Using the Parse SDK to save data in the cloud", 
    "price": "25.00", 
    "instructors": "Mr Johan Jurrius", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/574536_2ad4_6.jpg", 
    "course_url": "https://www.udemy.com/parsesdk-android/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T12:39:05Z"
}