{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Günümüzde mobil teknolojilerin önemi tartışılmaz bir konuma gelmiştir. Bu konuda da iki tane mobil işletim sistemi öne çıkmaktadır. Android ve İos. Androidin açık kaynak kodlu olması, farklı üreticilerin androidli cihazlar üretebilmesi ve tabiki de fiyat avantajı Androidi lider konuma getirmiştir. Mesela ülkemizde çevrenize baksanız on kişiden dokuzu androidli cep telefonu veya tablet kullanıyordur. Dolayısıyla androidin büyük bir kullanıcı kitlesine sahip olduğu söylenebilir. Bu da Android Eğitim Setimizin önemini ortaya koyuyor. Eğitim setimize sürekli yeni eğitim videoları ekleyerek içeriği zenginleştiriyoruz ve yeni şeyler öğreniyoruz. Bu heyecan verici yolculukta sizlerinde bize eşlik etmenizden memnuniyet duyarız.</p><p>Eğitim setimizin bu ikinci kuru gayet makul bir fiyat ile istifadenize sunulmuştur. Abartılı fiyatlardan kaçınılmıştır. </p><p>Android eğitim setimizin bu ikinci kurunda artık profesyonel düzeye doğru adım atıyoruz. Kursumuzda şu anda:</p>\n\n<p>SQLite ile veritabanı işlemleri iki örnek proje üzerinden detaylı bir şekilde anlatılıyor.</p>\n\n<p>Web servislerinden Xml ve Json verilerini okuyarak parse etme işlemleri anlatılıyor.</p>\n\n<p>Kapsamlı Fragment eğitimi veriliyor.</p>\n\n<p>Ayrıca profesyonel uygulamaların vazgeçilmez yöntemleri olan Nesne Yönelimli Programlama (Object Oriented Programming) ve MVC (Model View Controller) örnek projeler üzerinde uygulanarak anlatılmıştır.</p>\n\n<p>Projelerinizde kullanabileceğiniz çeşitli animasyon türleri anlatılmıştır.</p>\n\n<p>Örnek projelerle, uygulama geliştirme süreçleri öğreniliyor ve daha pek çok konular uygulama üzerinden pratiği yapılarak anlatılıyor.  </p>", 
    "end_date": null, 
    "title": "Android Studio ile Uygulama Geliştirme Eğitimi-2", 
    "price": "20.00", 
    "instructors": "Levent YADIRGA", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539624_9be2_4.jpg", 
    "course_url": "https://www.udemy.com/android-studio-ile-uygulama-gelistirme-egitimi-2/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T23:48:19Z"
}