{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Over 7 hours of content</strong>. <strong>Step by step tutorial </strong>for complete beginners. More advanced topics also covered like ASO, graphics editing, sound editing, etc.<br></p>\n\n<p>Ever wanted to create mobile games but didn't know where to start or thought that you will never succeed?</p>\n\n\n\n<p>  \t                                                     With <strong>Android Apps Reskinning for Fun and Profit</strong> you will have both of fun, and hopefully profit while reskinning Android apps. Why fail when trying to create an app from scratch, investing hundreds of dollars, when you can legally modify an existing one? And the best part...you get to publish the app and attract millions of potential users on Google Play Store and other Android Marketplaces.  \t                                                     Start you Mobile App Empire today with <strong>Android Apps Reskinning for Fun and Profit</strong> !  </p>\n\n\n\n<p>No programming experience is required, I will show you STEP BY STEP what you need to edit in your code in order to re-skin your App and be able to submit it to any Android Marketplace including Google Play Store and Amazon Apps.</p>\n\n\n\n<p>The course is <strong>suitable for beginners and more advanced users</strong> <strong>also </strong>(please read through the reviews left from beginners students that were able to upload their Android Apps on the Play Store without any prior Android programming knowledge.</p>\n\n\n\n<p>  \t<strong>Who is this course for?</strong>  </p>\n\n\n\n<ul>  \t<li>anyone willing to start creating mobile applications but doesn't have the necessary programming skills or funds to start from zero</li>  \t<li>entrepreneurs looking to develop a passive income</li>  \t<li>students that want to dive into mobile application programming following real world examples and not just theory</li>  \t<li>developers searching to increase their skills in Java or mobile applications development</li>  </ul>\n\n\n\n<p>  \t                                                  Please watch the free lessons for more information on what to expect from this course.  </p>", 
    "end_date": null, 
    "title": "Android Apps Reskinning for Fun and Profit", 
    "price": "20.00", 
    "instructors": "Cristian Gradisteanu", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/257394_9a4d_4.jpg", 
    "course_url": "https://www.udemy.com/android-apps-reskinning-for-fun-and-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-08T00:36:42Z"
}