{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>La première application mobile en moins de 20 jours et pour un budget aussi bas que $140, c'est possible? Oui, et tout cela sans aucun connaissance préalable. Ce cours est là pour vous permettre de faire produire votre première app simple rapidement, mais selon vos goûts. </p><p>Pourquoi ce cours? En novembre 2015, dans le cadre de mes projets, j'avais un objectif simple: faire produire ma première application le plus vite possible. Après avoir réussi en moins de 20 jours, et pour $140, je fus surprise de la simplicité du processus. Mais en même temps, un certains nombres d'erreurs et d'obstacles ont causé des frustrations que j'aimerais vous éviter à l'aide de ce cours. Car au final, ces frustrations peuvent repousser à jamais la réalisation de votre projet!</p><p>Le cours est par conséquent construit de façon à vous accompagner pas à pas pendant environ 15 jours, en détaillant quelles étapes réaliser chaque jour pour atteindre votre objectif. Depuis la conception de l'idée jusqu'à la mise en ligne dans un store par votre développeur, en passant par le recrutement de l'équipe et la préparation de tous les éléments nécessaires, je vous montre tout le processus en espérant vous éviter tous les obstacles et toutes les frustrations que j'ai moi-même rencontrées.</p><p>Bien sûr, si vous avez besoin d'aide au fil du cours (idées, motivation, explications), je serai là pour répondre à vos questions et vous faciliter la tâche autant que possible!</p>", 
    "end_date": null, 
    "title": "App: faites produire une App sans programmation en 20 jours", 
    "price": "20.00", 
    "instructors": "Anja Altberger", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761378_b0d9.jpg", 
    "course_url": "https://www.udemy.com/app-faites-produire-une-app-sans-programmation-en-20-jours/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T10:54:06Z"
}