{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          There are plenty of courses about App Store Optimization but no other course is so updated, fresh and easy to follow.  </p>  <p>  \t        This is an ideal course for entry level students to App Store Optimization.  </p>  <p>  \t  If you ever wondered how Apps rank, how to make your apps succeed in the App Store, how to gain more exposure and more downloads... this is a great course to start with.  </p>  <p>  \t  You will get access to: Videos, tutorials, Q&amp;A, easy to understand content that flows in a very easy way... taking you step by step on a smart ASO learning curve.<br style=\"\">  \t<br style=\"\">  </p>  <p>  \t          Welcome to the only course that keeps updating itself each month with fresh new videos about ASO, App store optimization trends and how to tackle ASO.  </p>  <p>  \t<br style=\"\">  \t  If you are lost about ASO and want a free introduction guide and training , I can take you step by step.  </p>  <p>  \t        This course is created with power videos: Short, full of energy, ASO wisdom and practical strategies you can implement in your app marketing strategy.  </p>  <p>  \t      You will learn important points like  </p>  <ul style=\"\">  \t<li>Basic variables in ASO</li>  \t<li>The Right approach when doing keyword research</li>  \t<li>How graphics, icons and screenshots affect ASO and conversion.</li>  \t<li>What to keep in mind when using ASO tools</li>  \t<li>The 5 crucial mistakes 90% of developers make during the ASO process</li>  \t<li>How to launch and run an ASO campaign</li>  \t<li>How to face ASO for Google Play and iOS</li>  \t<li>How to react and change when your apps loose ranking</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t  Warning:</strong> If you are experience in ASO - App store optimization , this may not be the ideal course for you. This course is only for entry level students and it&#039;s a theory based course.  </p>  <p>  \t      For full advanced course please check my Udemy profile for my other ASO course.  </p>  <p>  \t<br style=\"\">  \t<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "App Store Optimization for Beginners - SEO for Apps. ", 
    "price": "20.00", 
    "instructors": "Gabriel Machuret", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/168828_0b5c_2.jpg", 
    "course_url": "https://www.udemy.com/appstoreoptimization/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-20T10:46:35Z"
}