{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>*** <strong>BONUS</strong> ***</p><p>This course is the first of its own that shows you how to integrate videos advertising  within your Apple TV apps so that you can get a smart passive income while players use your game.</p><p>***************</p><p>Hello, My name is Yohann I will be your instructor</p><p>In this course you will learn how to convert an iPhone app into an Apple TV app.</p><p>We will start working from the source code of an iPhone classic game called Tic Tac Toe and then I will drive you through every single step to convert this app so that it works on the Apple TV.</p><p>All the steps are shown with video lectures so you can't possibly miss a step. You can always pause the videos, rewind and play again at your own pace.</p><p>Now contrary to any other course from other instructors, the Tic tac toe app is already published in the Apple TV app store. Go look for it, the name of the app is \"tic tac toe for TV\".</p><p>You will be given the source code of the game so that you can follow along and you will also be given the final project so that you can publish your own version in the TV app store yourself!</p><p>This course gives you all the tools to get your app into the Apple TV app store. So don't wait any longer and come have your own app published in the TV app store and show it to your friends and family members.</p><p>Invest in yourself, learn how to make apple TV apps today.</p><p><br></p><p><strong>WHAT YOU WILL GET AFTER COMPLETING THE COURSE ?</strong></p><p>You will have your very own Apple TV game in the Apple TV iTunes app store ), ready to bring in revenues from each sale. </p><p>You will be able to get all free resources, including the source code with an unlimited license.<br></p><p>You can publish games every weekend, using the same source code, included within this course as a bonus, for free.</p><p>You will have the potential to make a lot of passive income, it's time to awaken the entrepreneur in you.</p><p><br></p><p><strong>************ READ ON ! **************<br></strong></p><p>Looking to boost your income as a App developer? Or maybe you're seeking a career change that gives you more free time and flexibility?</p><p>Then this is the right course for you.</p><p>YOU CAN BECOME AN APPLE TV APP DEVELOPER</p><p>TV-OS has a huge platform where you can sell your games and apps and potentially make a lot of money . This course will take you from the very basic concepts of game development using the free software given by Apple.</p><p><strong>HOW MUCH DO YOU HAVE TO SPEND?</strong></p><p>There is actually no more expenses except signing up besides getting the iOS developer license ($99/year). And we will show you the places from where you can get the resources we want without spending a single dollar.</p><p><strong>*********** HOW MUCH YOU CAN EARN *******</strong></p><p>You can earn more than you think. I am the one example of that after studying this method i could create and publish game app every week . So i could make a lot of money without putting more effort . Join this course and follow me and you will make a lot money than you think.</p><p>ENROLL THE COURSE NOW AND PUBLISH YOUR VERY FIRST APPLE TV GAME, all it takes is one free afternoon.</p>", 
    "end_date": null, 
    "title": "Apple TV apps. Convert an iPhone app to Apple TV using TVOS ", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670644_4a3b.jpg", 
    "course_url": "https://www.udemy.com/apple-tv-apps-convert-an-iphone-app-to-apple-tv-using-tvos/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T21:42:00Z"
}