{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The Apple Watch is out, and it&#039;s selling off the charts. It&#039;s on track to be in the hands of <strong style=\"\">more than 25 million people</strong> year end. Take this course now and be one of the first to <strong style=\"\">have your own apps available in this historic introductory year.</strong></p>  <p>  \t    I firmly believe that the best way to learn is by doing. So we go through <strong style=\"\">everything</strong> step by step in the making of 15 different apps from scratch. From these 15 apps you will learn all the skills needed to make your own apps for the Apple Watch.  </p>  <p>  \t    The best part is that <strong style=\"\">no prior programming experience is required.</strong> I&#039;ve been the beginner that had trouble with complex tutorials, and will never speak over your head. If you&#039;ve got some programming experience already however, you&#039;ll have everything you need to dive headfirst into Apple Watch&#039;s WatchKit and Swift so that you can work to an impressive skill level.  </p>  <p>  \t    We&#039;ll dive into a <strong style=\"\">thorough explanation of all WatchKit SDK elements</strong> including actionable notifications, glances, general interface principles, interacting with the iPhone, and working with API&#039;s.  </p>  What makes me the right teacher?  <ul style=\"\">  \t<li>I have <strong style=\"\">9 iOS apps in the App Store</strong> which total over <strong style=\"\">300,000+ downloads</strong></li>  \t<li>I teach more than 17,000 other students in my conglomerate of highly rated Udemy courses</li>  \t<li>I use an energetic and engaging course style that involves students. I guess you could say, <strong style=\"\">I&#039;m far from a robot</strong>… and it should be entertaining :)</li>  \t<li>I have been doing iOS development for 4+ years</li>  \t<li>When I was first learning iOS development, I was often confused by wordy blog posts and tutorials. <strong style=\"\">I will </strong><strong style=\"\"><em style=\"\">never</em> talk over your head.</strong></li>  \t<li>I created the first Udemy Swift course and also teach the highly rated “How to Make a FREAKING iPhone App with Swift&quot; course.</li>  </ul>  Who is this class for?  <ul style=\"\">  \t<li><strong style=\"\">People who want to make apps</strong>. I will not be teaching wordy or complicated computer science philosophies. I will be teaching you <strong style=\"\">how to make apps </strong>that you can play with, share with friends &amp; family, and offer to the world!</li>  \t<li><strong style=\"\">Beginners</strong>. You don&#039;t need any programming experience to take this class. I have been the absolute beginner before and I want to help you.</li>  \t<li>Those <strong style=\"\">programmers who are new to Apple Watch</strong>. Dive in with your prior experience and move more quickly, on to become an impressive Apple Watch developer.</li>  \t<li><strong style=\"\">Entrepreneurs</strong> who have an idea for an app. Don&#039;t pay somebody thousands to build your app. Do it yourself. Having the ability to create something you can think of is extremely powerful.</li>  \t<li><strong style=\"\">Career development</strong> professionals who want to earn money professionally via contract work, consulting, full-time employment, and so forth</li>  </ul>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "Apple Watch - Go From Newbie to Pro by Building 15 Apps", 
    "price": "20.00", 
    "instructors": "Rick Walter", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362520_2280_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-freaking-apple-watch-app-with-swift-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T20:26:16Z"
}