{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>$37 for a limited time only (instead of $199)</strong></p><p> <strong>Breaking News:  lectures and codes upgraded for iOS 9, Apple Watch OS 2 (watchOS), XCode 7 and Swift 2, ObjC</strong></p><p>  \t  Welcome to this Apple Watch class, this is the <strong>GO TO course</strong><strong> to build Apple Watch apps</strong><strong> with theory and hands-on training</strong>, using both <strong>Swift</strong> and <strong>Objective-C ( ObjC )</strong>. All in one huge course with unbeatable value.  </p>  <p>  \t                    Whether you are a beginner or advanced developer, this course is for you.  </p>  <p>  \t                    The course covers the apple watch specifications (hardware and software), fundamentals of object oriented programming using Swift, tons of exercises with solutions to make sure you strengthen your degree of understanding, swift playgrounds, and a dozen real useful Apple Watch apps built from scratch, with the final completed source code for you to enjoy!  </p>  <p>  \t                    Some of these Apple watch apps you will build are:  </p>  <p>  \t                    - Hello World ( Watch OS / Swift )</p>  <p>  \t                    - Finger Tap Count ( Watch OS / Swift )</p>  <p>  \t                    - Random Number Generator ( Watch OS / Swift )</p>  <p>  \t                    - Egg Timer ( Watch OS / ObjC )</p>  <p>  \t                    - Head or Tail ( Watch OS / Swift )</p>  <p>  \t                    - Roll the Dice  ( Watch OS / Swift )</p>  <p>  \t        - Top 10 Actresses (with modal details) ( ObjC )</p>  <p>  \t                    - Temperature Converter  ( Watch OS / Swift )</p>  <p>  \t                    - Tip Calculator ( Watch OS / Swift )</p>  <p>  \t                    - Bitcoin Live Price Quote (that's right!) ( Watch OS / Swift )</p>  <p>  \t        - Top Speed Cars Catalog ( Watch OS / Swift )</p>  <p>  \t                    - and much more to come… ( in Objective C and Swift )</p>  <p>  \t                    Each of these apps will teach you a brand new set of skills and will be the stepping stones for you to make that app that you've been dreaming of.  </p>  <p>  \t                    With the Apple Watch, the possibilities are endless but you have an opportunity to make these apps become real. Some of you may have missed the iPhone gold rush in 2007, so don't miss the boat on this one, and come make history with us. Let's own the Apple Watch world!</p>  <p>  \t                    What makes me qualified to teach you the Apple Watch OS development? And why I'm the best at what I do?  </p>  <p>  \t                    My name is Yohann, I've been an iOS programming college instructor for the past 7 years, I know about teaching. Now I'm not just about theory, if you want just boring theory, enroll yourself in a plain University class. This course is <strong>NO FLUFF, get it done</strong>!.  </p>  <p>  \t                    Also, I'm not just the average teacher that tells you “do this, do that\" but these teachers have no real life experience. As a matter of fact I am the most qualified in the App store out off all instructors here. That's right. Let me brag now: I do what I preach. <strong>I myself have more than a hundred apps on the iTunes app store, dozens of Android apps, dozens of Apple Watch apps, which many of them reached top 10 worldwide</strong>, and<strong> I've helped thousands of students become professional iPhone developers, who themselves made it to the top 10 worldwide too</strong>! I've gotten great feedback from all of these classes and I've been featured in the press in prestigious media like <strong>Forbes online, WIRED, and Yahoo news</strong>. You definitely should follow my foot steps.  </p>  <p>  \t                    Go check out the Colorblind eye exam on iTunes, and La Bible Integrale in French. I've got millions of downloads and I want you to get to this level by taking this course.  </p>  <p>  \t                    I'm really excited about this course cause it's like the bible of the Apple Watch. Any other course will feel “unfinished\" to you once you've taken this one.  </p>  <p>  \t                    It's 2015, it's time to make awesome apple watch apps! Apple said their watch is coming out early 2015. There's no reason you shouldn't have an app ready for the launch.  </p>  <p>  \t                    So take this course already, it's a no brainer. Your future self will thank you for it.  </p>  <p>  \t                    By the way, don't forget to watch the intro video for a sample of the course.  </p>  <p>  \t                    Cheers!  </p>  <p>  \t  Update (February 2015): New advanced app added: Create a Knight Rider's KITT voicebox apple watch app that communicates with the iPhone and plays sounds on the phone. It will teach you the necessary skills to control any iPhone apps from the apple watch interface! (section 19) Also please watch video lecture 2 for details.  </p><p>This is the Apple Watch course you've been looking for. Somebody said Apple Watch ?! Why haven't you joined this Apple Watch course yet?</p><p><br></p>", 
    "end_date": null, 
    "title": "Apple Watch Development", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392396_9358_3.jpg", 
    "course_url": "https://www.udemy.com/complete-apple-watch-dev-course-learn-by-building-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T20:24:51Z"
}