{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>If the new Apple TV and the Apple TV App Store Excite you then this is the place to be to learn everything you need to know about Apple TV development.</p><p>Apple TV is no small addition to the world of App Development. There is so much to learn and the Apple TV expects a different user experience and has different design and coding requirements. </p><p><strong>What you will learn</strong></p><ul><li>You will be learning native tvOS development which uses iOS frameworks with Swift 2</li><li>You will also be learning how to build Client-Server apps which use Apple's new markup language TVML. TVML apps use Javascript.</li><li>You will learn how to build Apple TV games with SpriteKit</li></ul><p>This course is brought to you by the creator of <em>iOS 9 &amp; Swift 2: From Beginner to Paid Professional</em>, THE best iOS 9 course on the Internet.</p><p>The goal of this course is to be the absolute <em>BEST </em>and <em>most-effective</em><em> </em>Apple TV course on the Internet.</p><p><strong>How the course works</strong></p><ol><li>You'll be provided with a series of videos. Watch those videos over and over again until you understand the concepts completely. Then try building that same app from memory on your own</li><li>You are also provided with exercises that help you work and learn on your own so you can retain the knowledge</li></ol><p><strong>Why take this course?</strong><br></p><p>Here are a few reason to take this course:</p><ol><li>I teach you what you are really going to use in the real world, not some obscure concepts</li><li>I don't read from scripts in any of our courses. I teach you real world development so you can see how to actually solve problems (other courses just teach x,y,z and don't give you the <em>why</em> behind what you are doing.</li><li>You won't find a better course on the Internet!!!</li><li>You get lifetime access to Live help through our chatrooms and Forums.</li></ol><p><br><strong>Testimonials from my courses</strong></p><p><em>\"The best course i have seen about ios programming. The guy is the best instructor i have ever seen. It has a nice way of saying them. And its the first i see to give the same importance not only in the code but also in the design. Continue your good job. 100% percent recommend it.\"</em><em> - Lefteris Altouvas</em><span><em></em></span></p><p><span><em></em></span></p><p><em></em></p><hr><p><em>\"I have taken other courses by some other instructors that were ok, but I have not been as fired up about any of them as I am about this one. Mark's teaching style is great and this course truly has a \"bootcamp\" feel for much less money than an actual bootcamp. Access to Mark to ask questions is great both through the forums as well as github/gitter. Highly recommend this course if you are looking for something in the iOS/Swift Development category.</em><em>\" - Jack Davis</em><br></p><p><em></em></p><hr><p><em>\"He has this way of teaching that captivates your attention and makes all the ones and zeros come to life. Mark taught me that learning computer science doesn't have to be the way it was in college, simply put: boring, time-consuming, and overwhelming. He mentored me in the course materials and I am an even better developer today and I make a lot more money too, all because of the example Mark set and the individual time he spent with me.</em><br></p><p><em>Seriously, an hour spent with this man teaching you technical subjects will be worth 100 hours spent in another course or bootcamp taught by someone else\" - </em><em>Erik Slack</em></p><hr><p><em>\"It is obvious that he is passionate about teaching coding. He makes sometimes dry subjects very entertaining with his humor and overall teaching style. He never loses patience with students and takes the time to make sure you understand. <br>Mark also goes the extra mile with students. Whenever I would be stuck or in need of help on a project he would take time to help me. I was lucky he took the time to get to know me and assist in the understand subjects I had difficulty with.\" - Jacob Evans</em></p><hr><p><em>\"...More impressive is his ability to teach. He's patient, optimistic, and able to take complex ideas and teach them with examples and in ways that are digestible, energetic, and fun. He's taught bootcamps and mentored many developers that I know. As a teacher and mentor, I couldn't give anyone a higher recommendation. If you can enlist his tutelage, you're in good hands.\" - </em><em>Jonathan Wood</em></p><p><em>\"Mark is a smart, experienced, patient mentor, teacher and iOS Engineer. As I have gone from knowing nothing about iOS to full fledge iOS engineer Mark has been there every step of the way to both guide and encourage.\" - </em><em>Pearson Basham creator of NoThyme iOS App</em></p><p><br></p>", 
    "end_date": null, 
    "title": "Apple TV App & Game Development for tvOS", 
    "price": "20.00", 
    "instructors": "Mark Price", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611936_893e_3.jpg", 
    "course_url": "https://www.udemy.com/apple-tv/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T17:56:07Z"
}