{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Du lernst die wichtigen Eigenschaften und Features von Apples neuer tvOS-Plattform kennen. Du verwendest Swift für native Apps und lernst mit TVML und TVJS eine noch ganz neue Technologie bei der Apple-Entwicklung kennen, die sogenannten Client/Server Apps.</p><p><strong>Einstieg</strong></p><p>Zu Beginn lernst Du die angebotenen Interface-Elemente von tvOS kennen. Gemeinsam begeben wir uns auf eine Tour durch die verschiedenen Demos von Apple und setzen eine erste App um. Auch Features wie Storyboard-Referenzen dürfen gerade bei AppleTV-Apps nicht fehlen. Auch wichtige Themen wie die Stack Views und die neue Focus Engine werden genauer unter die Lupe genommen.</p><p><strong>Mehr als nur Programmierung</strong></p><p>Inhaltlich geht der Kurs über die reine Entwicklung hinaus. Du lernst alles, was Du vom Einstieg bis zu einer fertigen App benötigst. Dazu gehört natürlich auch die Übermittlung fertiger Apps an der AppStore, die Einrichtung der notwendigen Zertifikate und der Eintrag auf iTunes Connect. Auf dem Weg dahin lernst Du auch datenintensive Inhalte wie Videos über Amazon S3 anzubieten, lernst Parallax Grafiken kennen und erstellst die notwendigen Grafiken wie App Icons und das Top-Shelf Image.</p><p><strong>Eine echte App entsteht</strong></p><p>Außerdem blickst Du mir bei der Entstehung der Swift Akademie tvOS-App über die Schulter. Ich erkläre Dir an einem echten Beispiel native App-Entwicklung mit dem UIKit. Anschließend zeige ich Dir, wie Du über das CloudKit Inhalte in der iCloud anbieten kannst und sie von dort wieder abrufst.</p><p><strong>Warum tvOS?</strong></p><p>Die Plattform ist wirklich aufregend und hat viel mehr Potential, als derzeit diskutiert wird. Sie hat mit Leichtigkeit die Möglichkeit Dreh- und Angelpunkt für digitale Haushalte und Büros zu werden. Online Meetings, Überwachungskameras, Schulungsinhalte, TV-Sendungen, Filme, Haussteuerung, Spiele? Wirklich alles denkbar!</p><p><strong>Noch wenig Konkurrenz</strong></p><p>Die beste Nachricht ist, dass es im Vergleich zu iOS im AppStore noch viel weniger Konkurrenz gibt. Es gibt viele Nischen, die mit vernünftiger Qualität und Funktion besetzt werden können. </p><p>Der Zeitpunkt um einzusteigen war wirklich nie besser als jetzt gerade. Also worauf warten? Meld Dich an, dann sehen wir uns gleich im Kurs wieder!</p><p><br></p><p><strong>Hinweis</strong>: Die Beispiele funktionieren nahezu vollständig OHNE eine AppleTV-Device.</p>", 
    "end_date": null, 
    "title": "AppleTV Apps entwickeln, der umfassende tvOS Kurs", 
    "price": "40.00", 
    "instructors": "Jan Brinkmann", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715992_6146_2.jpg", 
    "course_url": "https://www.udemy.com/appletv-tvos/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T19:48:16Z"
}