{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Looking for a course on Apple development for IPhone?</strong></p>  <p>Your search ends here. Learn Apple’s IPhone development as well as iPad, Desktop and watch development in one course. The course is evolving and more videos are added at rapid rate. The course not only design Apps but will also talk about the background basics and covers the latest Swift in very detailed manner. By learning iPhone development, you are already very much into the battle, take a few more steps and dive into the desktop and Apple watch development too. </p>    <p><strong>Am I ready to take the course?</strong></p>  <p>If you have Any Apple computer or laptop, then you are ready to take this course. IPhone is not required for this course. All the time, you will be using simulated version of iPhone, ipad and watch to run your apps. This simulator is already built in Xcode, which is a piece of software taken care of in the course.</p>    <p><strong>About the content.</strong></p>  <p>This course will be updated frequently as the course is on full-scale production. Already the course is massive and we are not yet finished with iPhone. Giving student the access to what is going right now makes them updated in the market.</p>    <p><strong>What’s the end Goal of the course?</strong></p>  <p>The course is designed for the beginners as well as for those who bits about development but wants to explore behind the scene basics. On regular intervals, we will be designing fully functional Apps and the material as Exercise files are also provided. Feel free to use all the material in your project also. At the end of the course, you will have many apps on different apps in your pocket for multiple platform as well as you will learn to read documentation and solve problems by looking online help.</p>    <p><strong>Swift is fairly new in the world, language will for sure mature more. No one is expert at this time and thus, This is the perfect time to get into IPhone development. Otherwise there will be versions after version and you will always be thinking to start it in next vacations. </strong></p>  <p><strong>Take some time out of your busy life and let’s get rolling!</strong></p>", 
    "end_date": null, 
    "title": "Apple's iPhone, Desktop and watch development with Swift 2", 
    "price": "40.00", 
    "instructors": "Igneus Technologies", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629146_67b1_3.jpg", 
    "course_url": "https://www.udemy.com/complete-ios-development-course/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T20:33:14Z"
}