{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Apprenez à développer une application iOS complète avec galerie photo, affichage de données, géolocalisation et interface personnalisée !  </p>  <p style=\"\">  \t  Le développement d&#039;applications iOS est possible grâce au langage Objective-C. Dans ce cours, nous allons vous guider pas à pas pour vous aider à comprendre les concepts de programmation spécifiques à Objective-C et à la programmation orientée-objet.  </p>  <p style=\"\">  \t  Ensemble, nous allons couvrir la structure, le fonctionnement et le développement d&#039;une application iOS autour des thèmes suivants :  </p>  <ul style=\"\">  \t<li style=\"\">Afficher du texte, des images et des données à l&#039;écran</li>  \t<li style=\"\">Gérer les interactions tactitles</li>  \t<li style=\"\">Créer une navigation et des transitions entre les différents écrans de votre application</li>  \t<li style=\"\">Intégrer la géolocalisation et l&#039;affichage d&#039;une carte</li>  \t<li style=\"\">Personnaliser et customiser le design de l&#039;application</li>  </ul>  <p style=\"\">  \t  Les concepts sont expliqués avec de nombreuses animations et exemples que vous pourrez suivre et mettre en pratique immédiatement en utilisant Xcode, le logiciel de développement d&#039;Apple.  </p>  <p style=\"\">  \t  A la fin de ce cours, vous saurez maitriser le développement d&#039;une application iOS multi-écrans et vous saurez intégrer et gérer les fonctionnalités essentielles pour créer des applications riches en contenus et en interactions.  </p>  <p style=\"\">  \t  A travers 25 leçons vidéos, je vais vous guider pas à pas et vous permettre de faire vivre vos idées sur iPhone et iPad !  </p>", 
    "end_date": null, 
    "title": "Apprenez à développer des applications iOS professionnelles", 
    "price": "30.00", 
    "instructors": "Sebastien Thomas", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392812_96f7_2.jpg", 
    "course_url": "https://www.udemy.com/developper-une-application-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T07:51:35Z"
}