{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>A todos nos se nos ocurren ideas de apps y luego al poco tiempo vemos que otra persona las desarrolla. <br></em></p><p><em>Que no te pase de nuevo! Aprende a convertir tus ideas en realidad. Empieza HOY<br></em></p><p>En este curso aprenderás a desarrollar apps para iOS, Android y para la web utilizando HTML5. El curso es apto para personas nuevas en la materia así como para gente con más experiencia. Algunas de las cosas que aprenderás:</p><ul><li>Curso desde cero de HTML, CSS y JavaScript.</li><li>Elementos semánticos y multimedia de HTML5.</li><li>Diseño de contenedores con CSS3.</li><li>JQuery desde cero.</li><li>JQuery Mobile para interfaces de usuario profesionales.</li><li>Conecta tu app a la nube: registro de usuarios, login, compatir fotos.</li><li>Geolocalización</li><li>Cámara del teléfono</li><li>Offline storage</li><li>Empaquetamiento para Android con Phonegap, desde cero.</li><li>Empaquetamiento para iOS con Phonegap, desde cero.</li><li>Publicar tus apps en la App Store y en la Google Playstore.</li></ul><p>Además el curso incluye la creación de dos apps de ejemplo con HTML5:</p><ul><li>App de recetas de cocina que usa JQuery Mobile y Offline Storage.</li><li>App de compatir fotos en la nube con JQuery Mobile y Appcelerator Cloud Services</li></ul><p>Este curso ha sido creado por Pablo Farías Navarro, founder y CEO de Zenva, Master in Information Technology de la Universidad de Queensland (Australia). Cientos de personas toman nuestros cursos y aprenden a convertir sus ideas en realidad. Estarás en buenas manos!<br></p>", 
    "end_date": null, 
    "title": "Apps de iOS y Android con HTML5 para Principiantes", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21967_8e22_4.jpg", 
    "course_url": "https://www.udemy.com/apps-iphone-android-con-html5/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-29T23:37:36Z"
}