{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t   La mayoría de los diseñadores y creadores de apps para iPhone, crean mockups o imágenes estáticas de sus diseño y de las ideas que tienen para su app; pero a medida que pasa el tiempo vemos que las apps son todo menos estáticas, lo que significa que los diseñadores y desarrolladores necesitan una mejor herramienta para crear la interacción de sus apps.  </p>  <p>  \t  Origami Engine es una plataforma de publicación del iPad que te permite diseñar, crear prototipos y publicar interesantes publicaciones iPad interactivas sin escribir una sola línea de código. Utilice el iPad como su portavoz para conectar con la gente en formas que no podemos con cualquier otro medio. Con el motor Origami, puede utilizar el poder de la tecnología táctil para contar su historia - ya sea un libro, una revista, un informe, o algo completamente nuevo.  </p>  <p>  \t<strong style=\"\">Experiencia del profesor:</strong>  </p>  <p>  \tCarlos Leal, ingeniero en Informática, Centrado su especialización en el campo de las aplicaciones móviles, y de manera especial en iOS, IDE Xcode, android y mucho mas.. Posee también una licenciatura, dos masters y es formador en diferentes tipos de cursos de diferentes lenguajes y sistemas, charlas, ponencias, colaboraciones con diversos portales especializados. Un verdadero maestro de la programación móvil.  </p>", 
    "end_date": null, 
    "title": "Aprende Origami paso a paso y aplícalo a tus iPhone apps", 
    "price": "20.00", 
    "instructors": "Pixel Web Pro", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273480_97b1_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-origami-paso-a-paso-y-aplicalo-a-tus-iphone-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-02T15:21:11Z"
}