{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>คอร์สนี้จะทำให้คุณสามารถใช้งาน Corona SDK ที่เป็น Tools ในการสร้าง Mobile App ได้อย่างรวดเร็วและง่ายดายตั้งแต่เริ่มต้น ด้วยผู้เชี่ยวชาญที่ผลิต Business App ด้วย Corona SDK มาแล้วทั้ง iOS และ Android Version พร้อมทั้งเผยเคล็ดลับในการเขียน Mobile App ให้ถูกใจ, Design ให้ดูดี ไม่ให้ไปเป็นขยะอยู่บน Store</p><p>หลายๆครั้งเราเรียนการเขียน <strong>App iPhone</strong> มาอย่างแพง ใช้เวลาเป็นเดือนในการเรียน ฝึกฝนทดลองด้วยตัวเองอีกเป็นเดือนกว่าจะเขียน <strong>App</strong> ได้สักตัว แถมค่าเรียน <strong>iOS</strong> ก็แพงลิ่ว แต่กลับได้มาแค่เขียน <strong>Tableview, Tabview</strong> แถมทำความเข้าใจยากและเขียน <strong>Code</strong> เยอะมาก “ทั้งๆที่ลูกค้าไม่ได้มาดูว่าเราเขียน <strong>Code</strong> มากน้อยแค่ไหน เขาดูที่งานที่เนื้องานต่างหาก”</p><p>พออยากจะเขียน <strong>App</strong> <strong>Android</strong> ก็ต้องไปเริ่มกระบวนการขั้นตอนใหม่ทั้งหมดคือ เข้าคอร์สเรียนแล้วก็ฝึกเขียนใหม่หมดอีก เพราะ <strong>Coding</strong> คนละภาษา ระบบแตกต่างกันสิ้นเชิง</p><p>จะดีกว่าไม๊ถ้าคุณจะสามารถเรียนรู้การเขียน <strong>App</strong> แบบ <strong>Native</strong> ได้ในเวลาอันสั้น และเขียน <strong>Code</strong> น้อยลง เอาเวลาไปสร้างสรรค์ <strong>Interface</strong> หรือรับงานได้เพิ่มมากขึ้นซึ่งนั่นก็หมายถึงรายได้ที่มากขึ้นนั่นเอง <strong>Corona SDK</strong> จึงเป็นทางออกของผู้เริ่มต้น รวมไปถึงนักพัฒนาหน้าเก่าที่ต้องการเพิ่มขีดจำกัดในการแข่งขันในตลาดการพัฒนา<strong> Mobile App</strong> “ในเมื่อคนอื่นใช้เครื่องจักรขุดดิน แล้วทำไมคุณถึงยังใช้จอบเสียมอยู่อีก?”</p><p><br></p><p><strong>คอร์สนี้เหมาะสำหรับใคร?</strong></p><ul><li>โปรแกรมเมอร์ที่ต้องการเปลี่ยนมาเขียน <strong>Mobile App</strong> โดยเริ่มต้นใหม่</li><li>โปรแกรมเมอร์ที่เคยเขียน <strong>iOS</strong> มาก่อนแล้ว และต้องการได้งานที่เร็วขึ้นพร้อมจบงาน <strong>Android</strong> ได้ใน <strong>Code</strong> เดียว</li><li>โปรแกรมเมอร์ <strong>Android</strong> ที่ต้องการเขียน <strong>iOS</strong> ได้ใน <strong>Code</strong> เดียวกัน</li><li>บริษัท <strong>StartUp</strong> ที่ต้องการมีทีม <strong>Programmer</strong> ไว้ให้สามารถตอบสนอง <strong>App</strong> ธุรกิจโดยใช้ต้นทุนและเวลาในการพัฒนาน้อย</li><li>นักศึกษาที่สนใจเขียน <strong>Mobile App</strong> ในการทำ <strong>Project</strong></li></ul><p><strong>คุณสมบัติผู้เข้าฝึกอบรม</strong></p><p>1. มี <strong>iOS Device</strong> เป็นของตัวเอง เช่น<strong> iPhone iPad</strong> ตั้งแต่ <strong>iPhone 4</strong> ขึ้นไป<br>2.มีเครื่อง <strong>Mac</strong> หรือ <strong>Windows</strong> ที่ Support <strong>OpenGL2.0</strong><br>3. สมัคร <strong>iOS Developer</strong> แล้ว เพื่อ <strong>Built App</strong> ลง <strong>Device</strong> ได้ (ยังไม่มีก็เรียนได้)<br>4. มีพื้นฐานภาษา <strong>C++,C#,Objective C , Java , PHP</strong> อย่างใดอย่างหนึ่ง<br>5.<strong>Android Device</strong> สำหรับการทดสอบบน <strong>Android</strong></p><p><br></p><p><strong>F.A.Q. คำถามที่พบบ่อย</strong></p><p><strong>ถาม: </strong><strong>Corona SDK</strong> เป็น <strong>Webview HTML5</strong> หรือไม่ เห็นว่า <strong>Cross Platform</strong> ได้<br><strong>ตอบ: </strong><strong>Corona SDK</strong> ไม่ได้เป็น <strong>Webview</strong> หรือเขียน <strong>HTML5</strong> โค๊ดครับ เป็น <strong>Native</strong> เขียนด้วยภาษา <strong>Lua</strong> ซึ่งง่ายกว่า <strong>Java</strong>คล้ายกับ <strong>Action Script</strong></p><p><strong>ถาม: </strong><strong>Performance</strong> <strong>Issue</strong> มีปัญหาเรื่องความเร็วหรือไม่ ถ้าเทียบกับ <strong>Native</strong> จริงๆ<br><strong>ตอบ:</strong> <strong>App</strong> ที่สร้างจาก <strong>Corona</strong> ไหล่ลื่นกว่า <strong>Webview</strong> แน่นอน และมีความเร็วเทียบเท่าหรือดีกว่า <strong>Native</strong> เสียอีก(ในกรณีเขียน <strong>Native Code</strong> ไม่ดี) ทดสอบบน <strong>iPhone4</strong> และ <strong>Android</strong> ราคาหลักพันก็ยังใช้งานไหลลื่นปกติ</p><p><strong>ถาม: </strong>สามารถ <strong>Reuse Code</strong> ได้มากน้อยแค่ไหน<br><strong>ตอบ: </strong>โค๊ดทั้ง <strong>Android</strong> กับ <strong>iOS</strong> เหมือนกันเกือบ 100% ครับ จะแตกต่างกันบ้างที่ตรง <strong>Setting</strong> มากกว่า และโค๊ดส่วนที่ปรับขนาดหน้าจอ ต่างจากบางค่ายที่ต้องแยกโค๊ด <strong>View</strong> ออกจากกัน</p><p><strong>ถาม: </strong><strong>Corona SDK</strong> ต้องจ่ายเงินซื้อหรือไม่<br><strong>ตอบ: </strong>ปัจจุบัน <strong>Corona SDK</strong> <strong>ฟรีครับ</strong> ก่อนหน้านี้ต้องจ่ายราวๆปีละ 19,000 บาท ตอนนี้แจกฟรีแล้ว</p><p><strong>ถาม: </strong>มี <strong>App</strong> ตัวอย่างที่เขียนด้วย<strong> Corona SDK</strong> ที่ <strong>Active</strong> อยู่หรือไม่<br><strong>ตอบ: </strong>มีระบบ <strong>App Ecommerce</strong> อย่าง <strong>PayAll</strong> ที่ใช้งานเชิงพานิชย์และ <strong>Active</strong> อยู่ สามารถ <strong>Download</strong> มาลองดูได้ทั้ง <strong>iOS</strong> และ <strong>Android</strong></p><p><strong>ถาม: </strong>ไม่เคยเขียน <strong>App Mobile</strong> เลย จะเริ่มจาก <strong>Corona SDK</strong> ได้หรือไม่<br><strong>ตอบ: </strong>ได้ครับ นักเรียนหลายคน ไม่ได้ผ่านการเขียน <strong>iOS</strong> หรือ <strong>Android</strong> แบบ <strong>Native</strong> มาก่อน ใช้เวลาเรียนและฝึกทำอยู่ 1 เดือนก็สามารถรับงานลูกค้าได้แล้วครับ</p>", 
    "end_date": null, 
    "title": "Basic iOS/Android App Development with Corona SDK", 
    "price": 0, 
    "instructors": "CoronaSDKThailand Mongkon Paobnang", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702238_b42f_3.jpg", 
    "course_url": "https://www.udemy.com/making-native-app-ios-android-with-corona-sdk/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T16:47:12Z"
}