{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong>คอร์สนี้ถูกออกแบบมาสำหรับผู้ที่ต้องการผลิตงาน <strong>Application iOS/Android</strong> ด้วย <strong>Corona SDK</strong> ในระดับกลางถึงระดับสูง หรือใช้งานในเชิงพานิชย์ โดยสามารถเรียนพื้นฐาน <strong>Corona SDK</strong> ได้ฟรีจากคอร์ส <strong>Corona SDK Basic</strong></p><p><strong>ทำไมถึงเขียน App ได้กว่าดีกว่า<br></strong>หลายๆครั้งเราเรียนการเขียนโปรแกรม <strong>iOS</strong> มาอย่างแพง ใช้เวลาเป็นเดือนในการเรียน ฝึกฝนทดลองด้วยตัวเองอีกเป็นเดือนกว่าจะเขียน <strong>App</strong> ได้สักตัว แถมค่าเรียน <strong>iOS</strong> ก็แพงลิ่ว แต่กลับได้มาแค่เขียน <strong>Tableview, Tabview</strong> แถมทำความเข้าใจยากและเขียน <strong>Code</strong> เยอะมาก “ทั้งๆที่ลูกค้าไม่ได้มาดูว่าเราเขียน <strong>Code</strong> มากน้อยแค่ไหน เขาดูที่งานที่เนื้องานต่างหาก”</p><p>พออยากจะเขียน <strong>App</strong> บน <strong>Android</strong> ก็ต้องไปเริ่มกระบวนการขั้นตอนใหม่ทั้งหมดคือ เข้าคอร์สเรียนแล้วก็ฝึกเขียนใหม่หมดอีก เพราะ <strong>Coding</strong> คนละภาษา ระบบแตกต่างกันสิ้นเชิง</p><p>จะดีกว่าหรือไม่ถ้าคุณจะสามารถเรียนรู้การเขียน <strong>App</strong> แบบ <strong>Native</strong> ได้ในเวลาอันสั้น และเขียน <strong>Code</strong> น้อยลง เอาเวลาไปสร้างสรรค์ <strong>Interface</strong> หรือรับงานได้เพิ่มมากขึ้นซึ่งนั่นก็หมายถึงรายได้ที่มากขึ้นนั่นเอง <strong>Corona SDK</strong> จึงเป็นทางออกของผู้เริ่มต้น รวมไปถึงนักพัฒนาหน้าเก่าที่ต้องการเพิ่มขีดจำกัดในการแข่งขันในตลาดการพัฒนา<strong> Mobile App</strong> “ในเมื่อคนอื่นใช้เครื่องจักรขุดดิน แล้วทำไมคุณถึงยังใช้จอบเสียมอยู่อีก?”</p><p><strong>คอร์สนี้เหมาะสำหรับใคร?<br></strong>เหมาะกับผู้ที่ต้องการเขียน <strong>App iOS/Android</strong> ด้วยตัวเอง และมองหาเครื่องมือที่จะอำนวยความสะดวกให้สามารถศึกษาและเขียน <strong>App</strong> ได้เร็วขึ้น สร้างความได้เปรียบมากกว่าคนอื่น<strong></strong></p><p><strong>F.A.Q. คำถามที่พบบ่อย</strong></p><p><strong>ถาม: </strong><strong>Corona SDK</strong> เป็น <strong>Webview HTML5</strong> หรือไม่ เห็นว่า <strong>Cross Platform</strong> ได้<br><strong>ตอบ: </strong><strong>Corona SDK</strong> ไม่ได้เป็น <strong>Webview</strong> หรือเขียน <strong>HTML5</strong> โค๊ดครับ เป็น <strong>Native</strong> เขียนด้วยภาษา <strong>Lua</strong> ซึ่งง่ายกว่า <strong>Java</strong> คล้ายกับ <strong>Action Script</strong></p><p><strong>ถาม: </strong><strong>Performance</strong> <strong>Issue</strong> มีปัญหาเรื่องความเร็วหรือไม่ ถ้าเทียบกับ <strong>Native</strong> จริงๆ<br><strong>ตอบ:</strong> <strong>App</strong> ที่สร้างจาก <strong>Corona</strong> ไหล่ลื่นกว่า <strong>Webview</strong> แน่นอน และมีความเร็วเทียบเท่าหรือดีกว่า <strong>Native</strong> เสียอีก(ในกรณีเขียน <strong>Native Code</strong> ไม่ดี) ทดสอบบน <strong>iPhone4</strong> และ <strong>Android</strong> ราคาหลักพันก็ยังใช้งานไหลลื่นปกติ</p><p><strong>ถาม: </strong>สามารถ <strong>Reuse Code</strong> ได้มากน้อยแค่ไหน<br><strong>ตอบ: </strong>โค๊ดทั้ง <strong>Android</strong> กับ <strong>iOS</strong> เหมือนกันเกือบ 100% ครับ จะแตกต่างกันบ้างที่ตรง <strong>Setting</strong> มากกว่า และโค๊ดส่วนที่ปรับขนาดหน้าจอ ต่างจากบางค่ายที่ต้องแยกโค๊ด <strong>View</strong> ออกจากกัน</p><p><strong>ถาม: </strong><strong>Corona SDK</strong> ต้องจ่ายเงินซื้อหรือไม่<br><strong>ตอบ: </strong>ปัจจุบัน <strong>Corona SDK</strong> <strong>ฟรีครับ</strong> ก่อนหน้านี้ต้องจ่ายราวๆปีละ 19,000 บาท ตอนนี้แจกฟรีแล้ว</p><p><strong>ถาม: </strong>มี <strong>App</strong> ตัวอย่างที่เขียนด้วย<strong> Corona SDK</strong> ที่ <strong>Active</strong> อยู่หรือไม่<br><strong>ตอบ: </strong>มีระบบ <strong>App Ecommerce</strong> อย่าง <strong>PayAll</strong> ที่ใช้งานเชิงพานิชย์และ <strong>Active</strong> อยู่ สามารถ <strong>Download</strong> มาลองดูได้ทั้ง <strong>iOS</strong> และ <strong>Android</strong></p><p><strong>ถาม: </strong>ไม่เคยเขียน <strong>App Mobile</strong> เลย จะเริ่มจาก <strong>Corona SDK</strong> ได้หรือไม่<br><strong>ตอบ: </strong>ได้ครับ นักเรียนหลายคน ไม่ได้ผ่านการเขียน <strong>iOS</strong> หรือ <strong>Android</strong> แบบ <strong>Native</strong> มาก่อน ใช้เวลาเรียนและฝึกทำอยู่ 1 เดือนก็สามารถรับงานลูกค้าได้แล้วครับ</p><p><strong>ถาม: </strong>คอร์สจะมีการอัพเดทเพิ่มเติมหรือไม่<br><strong>ตอบ: </strong>จะมีการอัพเดทบทเรียนใหม่ๆเพิ่มเติมให้ครับ เมื่อผมเจอเทคนิคหรือแนวคิดใหม่ๆจะอัพเดทบทเรียนให้</p>", 
    "end_date": null, 
    "title": "Be the Professional iOS/Android App Builder with Corona SDK", 
    "price": "30.00", 
    "instructors": "CoronaSDKThailand Mongkon Paobnang", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715214_ef26_2.jpg", 
    "course_url": "https://www.udemy.com/app-ios-android-corona-sdk-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T05:30:34Z"
}