{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"></strong><strong>## Last updated on April 1st,2016 ###</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">### 5000 students are taking this course ###</strong></p>\n\n<p>Are you looking have a career in <strong class=\"redactor-inline-converted\">Android Development</strong>? Maybe you have a <strong class=\"redactor-inline-converted\">lot of app</strong> ideas but don't know how to start with those? Or you are seeking a career in <strong class=\"redactor-inline-converted\">Android Development and Java Programming</strong> that will finally land you in a great opportunity and also you can start a <strong class=\"redactor-inline-converted\">business of building Apps on the side</strong>?? </p>\n\n<p>Build a strong foundation in Android Development, Android Studio and object-oriented Java Programming with this tutorial and complete course.</p>\n\n<p>Build Android apps from scratch using Android Studio and Java Programming</p>\n\n<p>Upload your apps to <strong class=\"redactor-inline-converted\">Google Play Store</strong> and reach Millions of Android users</p>\n\n<p><strong class=\"redactor-inline-converted\">Content and Overview </strong></p>\n\n<p>This course will take you from knowing nothing about programming to a complete Android developer in 6 weeks. You will learn the following:</p>\n\n<p><strong class=\"redactor-inline-converted\">Section 1: Building Layouts</strong></p>\n\n<p>In this lesson you'll learn about various Views and ViewGroups used to make layouts for your Android apps. Topics include:</p>\n\n<ul><li>Writing XML</li><li>TextViews and ImageViews</li><li>Styling your views</li><li>Positioning your views with ViewGroups</li><li>LinearLayout weight</li><li>Using RelativeLayout to position views relative to each other</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Section  2: Making an App Interactive</strong></p>\n\n<p>In this lesson you'll start learning Java by creating the JustJava coffee ordering app :</p>\n\n<p>Topics include:</p>\n\n<ul><li>Making a button click execute code</li><li>Having the app evaluate math expressions</li><li>Declaring, initializing and using variables</li><li>Variable scope</li><li>Nested layouts</li><li>The String datatype</li><li>Combining Strings, ints and variables with concatenation</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">Section 3: Work with the Android Framework and Control Flow</strong></p>\n\n<ul><li>Method declaration and calling</li><li>Parameters and return values</li><li>An introduction to Object Oriented Programming</li><li>Changing the attributes of your views dynamically</li><li>Creating conditional logic using if/else statements</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">WHY ANDROID DEVELOPMENT IS FUTURE?</strong>Android is known to be one of the most versatile and most used operating system in smart phones . We are in the age where every other person uses a hand held device or a cellphone which makes use of Android. If one goes deep into the world of android, we would see that there is a lot of scope and a lot of potential in the world of android for individuals who are tech geeks (like me)! As vast this world this, learning about it as simple and as easy as a piece of cake. You can make your own app easily and show your true potential to the world of google and android.</p>\n\n<p>Here are some figures to look at!</p>\n\n<p><strong class=\"redactor-inline-converted\">DID YOU KNOW?</strong></p>\n\n<ul><li>Android is the primary operating system for over 90 tablets, for 6 E-Readers and 300 smartphones.</li><li>There are over 1,460,800 apps in Google Play store &amp;they’re growing at an huge pace!</li><li>Everyday about 1.5 million Android devices are activated all around the world.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Why learning android development is important?</strong>Learning android development is both fun and can reap you many profits in the long run. It is safe to say that android development has a lot of potential and can reap you various benefits in the long run. If one knows android development, not only will you be having a stable and sound career but can unleash you hidden talents as a developer.</p>\n\n<p><strong class=\"redactor-inline-converted\">Course Overview</strong></p>\n\n<p>if you<strong class=\"redactor-inline-converted\"> take this course</strong> (which you should!!) know that you are on your way to build a solid and stable foundation of <strong class=\"redactor-inline-converted\">Android Development, Android Studio and object-oriented Java Programming.</strong> You don’t need to spend years and years on learning, with me you can learn in <strong class=\"redactor-inline-converted\">6 weeks!!!</strong>! YES! That is right, in six weeks you’ll be able to make and develop your own app and you never know, you could have it running at the app store and be an instant hit!</p>\n\n<p>I have designed this course assuming your goal is to <strong class=\"redactor-inline-converted\">become an Android developer </strong>and you don't have any <strong class=\"redactor-inline-converted\">background in programming </strong>before. This course is completely h<strong class=\"redactor-inline-converted\">ands  On</strong> and you will be making<strong class=\"redactor-inline-converted\"> your first APP </strong>from the second lecture. I will also share with you the developer forums and the resources that you can use if you face any challenges while building your apps.</p>\n\n<p>Once you buy this course, you have <strong class=\"redactor-inline-converted\">LIFE TIME ACCESS</strong> to it. You can always refer back to any section that you want to revise and move along. Every section of ours has been built to test your ability. You not only get the content but also are given quizzes and assignments to ensure that what you have learnt is retained and you fully understand the content. (Don’t worry, we won’t scold you if you have some problem, we will be throughout). We assure you, with us you’ll be an android developer in no time!</p>\n\n<p>NO NEED TO BE A PRO!</p>\n\n<p>Our course is designed specifically for people who have ZERO prior experience in programming and have never even programmed a single thing before.  It doesn’t matter if you have absolutely no idea about the basics (that is why we are here!), we will teach you everything that you need to know about developing and programming in just 6 weeks. All you need is loads of passion, a hint of dedication, an internet connection and a laptop or PC. It’s that easy!!</p>\n\n<p><strong class=\"redactor-inline-converted\">Why take this course?</strong></p>\n\n<p>Obviously once you’ve made up your mind to become an expert developer, you will question the fact that why should you choose me? The answer is because I am passionate about android, I breathe, live and eat android! I have been in the industry for more than a decade and with my knowledge and experience I can teach you with hands on experience. I have a decade of experience in our bags of solid programming experience along with five years of application development experience. My experience can be measured by us having over fifty applications and games (developed by us) on not only the Android Google Play but also on the Apple App Store. </p>", 
    "end_date": null, 
    "title": "Become an Android Developer ", 
    "price": "20.00", 
    "instructors": "Deepika Khanna", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711086_6ab4_2.jpg", 
    "course_url": "https://www.udemy.com/complete-android-development-course/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T19:48:13Z"
}