{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span><strong style=\"\">Do you want to build applications for the most popular operating system in the world?</strong></span>  </p>  <p>  \t<strong style=\"\">Do you want the opportunity to put your apps on over 1 billion devices?</strong>  </p>  <p>  \t<span>&quot;Become An Android Developer From Scratch” is designed to be the best first step to launching your career as an Android Developer. Whether you&#039;ve never programmed before or are coming to mobile development for the first time, if you&#039;re truly inspired to learn Android Development, this is where you need to start.</span>  </p>  <p>  \tThis course has been in development for over two years, continuously perfected through research and testing in training bootcamps throughout the US. It represents a collaboration between a professional educator with over 20 years of experience in helping people learn and a professional mobile developer who has helped companies like Sony, Verizon, and nVidia build stunning mobile applications.  </p>  <p>  \tStarting with how the Java programming language works and progressing all the way to advanced Android concepts, you will get expertly produced instruction, visually descriptive explanations of deep concepts, screencasts that talk you through not just the “how” but also the “why,” and code challenges to test yourself and mark your progress.  </p>  <p>  \t<strong style=\"\">Here’s what students are saying:</strong>  </p>  <p>  \t“Very clean and well done. Covers everything that you need to know for getting started whether you know how to code starting out or not. If you are at a loss trying to start making android apps this is the course for you.”  </p>  <p>  \t“I like this course, this would transform any normal person to a full fledged android developer.”  </p>  <p>  \t“This one is, by far, the most comprehensive, easy-to-follow, and genuinely well put together one of the bunch.”  </p>  <p>  \t“Inspirational! - got me over the hump (complete android beginner)”  </p>  <p>  \t<strong style=\"\">Why it’s working...</strong>  </p>  <p>  \tOne of the things we&#039;re most excited to offer with this course is access to the inner workings of the mind of a professional mobile developer. Throughout the course you will be able to listen in as our Learning Scientist teases apart all the thoughts that run through a professional mobile developer’s mind as he’s writing the code you will learn to create. It’s like sitting down in a movie with the writer, director, and lead actor. But in this case, it’s all in support of your transformation from novice to professional.  </p>  <p>  \tYou will build several applications throughout the course, and the starting point for each project (as well as solutions to each challenge) will be available for download. You will also get all the visuals and info-graphics used throughout the course for reference and study.  </p>  <p>  \t&quot;Become An Android Developer From Scratch&quot; will give you a new, richer perspective on how mobile devices work. After you’ve completed this rigorous, challenging, and super fun course, you will be able to create your own apps, deploy to the Google Play store, and even interview for a job anywhere in the world.  </p>  <p>  \t<strong style=\"\">The real value...</strong>  </p>  <p>  \tThe most important thing you will get from completing this course is the confidence to say “I’m an Android Developer!” You’ll be able to interact with other students and professionals in the Android community with pride and self-assuredness. You’ll also become an independent learner, able to discern where to go for information and how to continue advancing your skills.  </p>  <p>  \tNo course is going to make you into an expert. It’s up to you to challenge yourself and find your path to making the apps you dream about. Become an Android Developer from Scratch is the best place to begin. Are you ready to get started?  </p>", 
    "end_date": null, 
    "title": "Become an Android Developer from Scratch", 
    "price": 0, 
    "instructors": "Adam Lupu, Adam Schwem", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/146156_c2cc_4.jpg", 
    "course_url": "https://www.udemy.com/become-an-android-developer-from-scratch/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-13T07:40:47Z"
}