{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Get a high-paying high-in-demand job in the tech industry by becoming a mobile app growth hacker. Learn the marketing of the 21st century.</p><p>This course teaches you all the theory and the hands-on techniques to drive insane amount of app downloads and solid user retention.</p><p>This course is not just about theory. It is the only course where you get to see the real on-field techniques used the behind the scene.</p><p><strong></strong><strong>Course Goals</strong></p><ul><li>Learn what is the job of a mobile app growth hacker</li><li>Learn how to read, analyze and interpret iTunes App Analytics</li><li>Learn how to increase app downloads</li><li>Learn how to get users hooked to a mobile app (retention)</li><li>Learn techniques to AB test app icons</li><li>Learn how to record video previews to increase downloads</li><li>Learn how to Create Video Previews for free using QuickTime Player.</li><li>Learn how to Upload a Video Preview to iTunes Connect using multiple sizes.</li><li>Find keywords associated with your app theme</li><li>Get Relevant Words to use for your title and keywords section</li><li>Understand what users are searching for on the iTunes App Store</li><li>Compare which words have optimized app store traffic and exposure</li><li>Come up with an efficient app name</li><li>Increase downloads in other countries</li><li>Spread the word about your app the smart way</li><li>Boost app downloads on a specific day</li><li>Spy on your app competitors, and steal their good keywords</li><li>and much more...</li></ul><p><strong>Who is this course for?</strong></p><p>The course is ideal for people looking to get exposed to the world of mobile app growth hacking, or for anyone who wishes to start their own business or looking to grow an existing mobile app business for the world-class companies like Twitter, Facebook, Dropbox, Pinterest, YouTube, Groupon, Udemy, and Instagram.</p><p><strong>Invest in yourself by taking this course now.</strong></p>", 
    "end_date": null, 
    "title": "Become a Mobile App Growth Hacker . Total Theory & Training", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515544_6767_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-mobile-app-growth-hacker-total-theory-and-training/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T18:04:06Z"
}