{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Apps are here to stay – Most people nowadays have smart phones, and are always on the search for apps that can improve their day to day live and make them more productive. </p><p>Why not get your foot on the ladder and start exploring app development today, by taking this course you will be given the foundation you need order to enter into the fun and very lucrative world of app development.</p><p>I will teach you step by step by step how to build Android Apps with a free web based application called App Inventor 2. This is the perfect way for beginners to learn app development because there is no programming involved.</p><p>By eliminating the need to learn a programming language App Inventor 2 has made the world of app development obtainable to all levels of app developers from very beginners right through to the more advances there is so much that can be built on the platform. </p><p>If you have a PC or laptop with internet access and a desire to make your own apps then this course is for you. You don&#039;t even need an Android device because there is a build in emulator to test your apps on.</p><p><strong style=\"\">What is the target audience?</strong></p><ul style=\"\"><li>Anyone who would like to learn app development</li><li>Very beginners to development</li><li>Anyone who wants to easily make Android Apps, with NO cost</li><li>Anyone from any country with internet access</li><li>Anyone of any age or ability</li></ul><p><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li>Learn a FREE and easy way to develop Android Apps</li><li>Step by step instructions</li><li>Learn as a beginner to build Android apps</li><li>Learn basic beginners apps</li><li>Learn to build a game from start to finish</li></ul><p>The aims and objectives of this course is to give a foundation into the App development world with a hand held approach. Once the basics are learnt the possibilities are endless.</p><p><strong style=\"\">What are the requirements?</strong></p><ul style=\"\"><li>No experience or knowledge is required - everything is shown in this course!</li><li>Laptop or PC with internet access.</li><li>Google Chrome Browser (preferred)</li><li>Gmail account</li></ul>", 
    "end_date": null, 
    "title": "Beginners: Learn Android App Development - No Coding Needed", 
    "price": 0, 
    "instructors": "Jennifer Ashley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502900_4ed7_5.jpg", 
    "course_url": "https://www.udemy.com/beginners-learn-android-app-development-no-coding-needed/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T12:43:15Z"
}