{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Quite obviously, because of the high volume of Android users across the globe, developing mobile applications for consumers on the Android platform has become a lucrative proposition. With close to 2 million Android apps available in Google's Play Store, and predictions that the Android App Market will be a $77 Billion industry by 2017, getting skilled at building Android applications is sure to provide high returns. So if you are fascinated by the idea of building amazing mobile applications for the Android platform, this course is not only going to provide you the perfect start, but is also going to take you to a stage where you will be considered an employable Android developer. This course is especially structured for entry level Android developers with a basic programming background who are looking to build their know-how around Android App development.</p><p>The concepts involved in developing Android applications are discussed right from scratch in this course, making it an absolute beginner friendly course. The focus of this course is on helping you learn the practical aspects of Android Programming and thereby ensuring you will learn a variety of Android Activities that professional Android developers use in their daily scheme of things.</p><p>What makes this course one of the most effective means for learning Android Programming is that it is accompanied with an App which demonstrates all the Android activities that you will learn in this course. The link to App on play store is given in the course. By downloading this free App, you will also get access to demo source codes that can help you quickly build Android Activities that are relevant to the App that you intend to build. Subscribe to this Android Development course now and kick-start your journey as an Android programmer. <br></p>", 
    "end_date": null, 
    "title": "Beginners Guide to Programming in Android", 
    "price": "40.00", 
    "instructors": "FACE Prep", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662824_b10c_5.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-to-programming-in-android/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T08:01:19Z"
}