{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>\r\n\tWith <strong>&quot;Developing a chat app for iOS&quot;</strong>, you will learn everything about chat apps, even if you&#039;ve never build one before!\r\n</p>\r\n<p>\r\n\t     The full course has <strong>several video lectures</strong>, divided into several chapters. Each chapter will give you a new level of knowledge in chat app development. We&#039;ll start from the basics of chat app development to more advanced and the most popular techniques used now a days.\r\n</p>\r\n<p>\r\n\t <strong>&quot;Building a Chat App&quot;</strong> will give you a new perspective on how the Apps and Web-Services work And after you completed the course you will be able to create your own Chat app with the latest technology and technique. Hope you enjoy!\r\n</p>\r\n<p>\r\n\t <strong>NOTE: </strong>In order to keep you up to date in the world of Chat app Development all the chapters will be updated regularly with new lectures, projects, quizzes and any changes in future versions of all the programming languages covered on the course.\r\n</p>\r\n<p>\r\n\t <strong>Why Learn Chat App Development?</strong>\r\n</p>\r\n<p>\r\n\t     The Internet is the fastest and largest platform ever created for humans to learn, communicate, share, or create businesses of any kind, and all of this in just 15 years! It is estimated that in the next 2 or 3 years more than 80%%%% of the companies around the world will become internet dependent which will cause a huge demand for App developer in this market. As the <strong>World Wide Web</strong> grows Chat apps needs to upgraded proportionally.\r\n</p>\r\n<p>\r\n\t     Learning Chat app Development will give you the opportunity to start ahead of other competitors by giving you the knowledge of the most recent app technologies and how to better apply them on your future projects. Knowing Chat app Development will give you the ability to control and create anything on the mobile.\r\n</p>\r\n<p>\r\n\t     We promise you would have never had such kind of learning experience.\r\n</p>\r\n<p>\r\n\t     Welcome to <strong>&quot;Building a Chat App for iOS&quot;</strong>\r\n</p>", 
    "end_date": null, 
    "title": "Building a Chat App for iOS from Scratch", 
    "price": "20.00", 
    "instructors": "QScutter Tutorials", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119726_880d_5.jpg", 
    "course_url": "https://www.udemy.com/building-a-chat-app-for-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T10:11:06Z"
}