{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Build Android Apps with App Inventor 2</strong></p>    <p>Everybody has a great idea for an app. The problem is, not many of those people have the skills or knowledge required to make that idea a reality. Building an app, regardless of its simplicity or platform, requires certain technical know-how like coding, UX/UI design, and more. App Inventor 2, however, cuts through all of the smoke and allows anyone – even those with no coding experience – to build Android apps from the ground up. This course will teach you how.</p>    <p><strong>Build Apps Without Learning Code!</strong></p>    <ul><li>Gain a practical understanding of programming basics</li><li>Navigate and use App Inventor 2 efficiently and effectively</li><li>Create and build your own apps for Android</li><li>Test and update your apps after you've built them</li><li>Learn how to publish your app to Google's Play Store</li></ul>            <p><strong>Android Apps in an Instant</strong></p>  <p><strong> </strong></p>  <p>This course will teach you everything you need to know about building apps – without the complicated coding normally required. If you have a good internet connection, a basic understanding of what an Android app is, and a great idea for an app that doesn't yet exist, then you're the perfect candidate! While the course is aimed at beginner programmers or those with no coding experience whatsoever, experienced app builders who want to learn from a new angle will benefit too.</p>    <p>During the 204 lectures and 17 hours of content contained within this course, you'll learn the basics of programming in a fun and practical way, while creating fully fledged, ready-to-use Android apps. You'll start off with setting up App Inventor 2 and choosing the options you'll need for your future apps. Then you'll get to know the interface and tools before diving straight in and creating not one, not two, but TEN apps. These apps will increase in complexity as you work through them, using features such as the component editor and blocks editor. </p>    <p>When you've built your ten apps you'll also learn how to test, update, and publish them to the Play Store. By the end of this course, you'll be an advanced app builder using App Inventor 2.</p>    <p><strong>Tools Used</strong></p>    <p>App Inventor 2 is an open source web application originally developed by Google and now maintained by MIT. It is aimed at beginner programmers and specially designed to enable them to build Android apps. It turns complicated coding language into visual drag and drop blocks, so there is no need for the user to learn code before building their apps. </p>", 
    "end_date": null, 
    "title": "Build Android Apps with App Inventor 2 - No Coding Required", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "17 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598520_8095_3.jpg", 
    "course_url": "https://www.udemy.com/build-android-apps-with-app-inventor-2-no-coding-required/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T18:31:34Z"
}