{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t     It&rsquo;s no secret that the mobile apps industry is absolutely exploding with growth! Portio Research estimates that there are about 1.2 Billion app users worldwide, and projects that this number will grow to 4.4 Billion by 2017. Businesses everywhere are making the transition to mobile apps as a way to increase customer interaction and revenue at their establishments.  </p>  <p style=\"\">  \t     This all sounds great, but how do you go about developing a mobile app for your business? You don&rsquo;t know how to write code, and are quite sure that hiring an expert developer would be too costly. Well my friend, let me introduce you to Cluvis Apps!  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">&ldquo;CLUVIS APPS PUTS YOU IN THE DRIVER&rsquo;S SEAT!&rdquo;</em></strong>  </p>  <p style=\"\">  \t     Cluvis Apps is the complete mobile solution for your business. Our drag &amp; drop editor enables you to create, edit and manage native iPhone, iPad, Android and HTML5 mobile web apps online, allowing for great design, customization and functionality across a broad range of mobile devices. With our technology specifically built to accommodate various business industries, we are able to provide the necessary features and functionality that any business will need to make their app a successful marketing tool and revenue stream.  </p>  <p style=\"\">  \t <strong style=\"\">What will I learn in this course?</strong>  </p>  <p style=\"\">  \t     In this course, we will cover all of the steps necessary to create a beautiful mobile app on the Cluvis Apps platform. This training includes:  </p>  <ul style=\"\">  \t<li style=\"\">Statistics about the mobile industry and its unprecedented growth</li>  \t<li style=\"\">Why working with Cluvis Apps is a must</li>  \t<li style=\"\">In-depth tutorials about the 40+ functions offered by Cluvis Apps</li>  \t<li style=\"\">Detailed tutorials about creating custom backgrounds &amp; icons</li>  \t<li style=\"\">How to create an app from start to finish</li>  </ul>  <p style=\"\">  \t  Make sure you pay attention, because there will be quiz questions throughout the training.  </p>  <p style=\"\">  \t  In the final section of this course, we will work together to create your own application for the website of your choice!  </p>  <p style=\"\">  \t <strong style=\"\">Course Requirements</strong>  </p>  <p style=\"\">  \t     To create your app, all you need is your internet connection and a strong will to learn!!  </p>  <p style=\"\">  \t <strong style=\"\">I&rsquo;ll see you in class!</strong>  </p>", 
    "end_date": null, 
    "title": "Build native iphone, android and html5 apps in 3 hours!", 
    "price": "20.00", 
    "instructors": "Cluvis Apps", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119566_cc77_6.jpg", 
    "course_url": "https://www.udemy.com/cluvisapps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T00:39:54Z"
}