{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>This course is under active development: get it now before the price rises!  Note: OSX + xcode is currently required!</strong><br></p><p>From the creator of Build Web Apps with React and Flux (the most popular and best reviewed course on React hosted on Udemy), comes Go Mobile with React Native.</p><p>If you're tired of spinning your wheels learning Swift or Android, this is the course for you.  </p><p>This course will get you up and running quickly, and teach you the core knowledge you need to deeply understand and build React components for mobile devices.</p><p>We'll start by mastering the fundamentals of React, including JSX, “props\", “state\", and eventing. Source code is provided for each lecture, so you will always stay up-to-date with the course pacing.</p><p>If you are new to React, or if you've been working to learn it but sometimes feel like you still don't quite 'get it', this is the React course for you! To learn React you have to understand it.</p><ul><li>Learn how to use React's custom markup language, JSX, to clean up your Javascript code.</li><li>Learn the process of converting JSX to raw Javascript on the fly in your browser.</li><li>Master the process of breaking down a complex component into many smaller, interchangeable components.</li><li>Grasp the difference between “props\" and “state\" and when to use each.</li><li>Develop apps that are unique, fun, and responsive.</li><li>Build on both Android and iOS platforms</li><li>Master integration with Parse for user authentication</li><li>Learn the core principles of navigation with React Native</li></ul><p>I've built the course that I would have wanted to take when I was learning React Native. A course that explains the concepts and how they're implemented in the best order for you to learn and deeply understand them.</p>", 
    "end_date": null, 
    "title": "Build Apps with React Native", 
    "price": "20.00", 
    "instructors": "Stephen Grider", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610300_fe42_4.jpg", 
    "course_url": "https://www.udemy.com/reactnative/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T22:53:03Z"
}