{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course is designed to help beginners to get to grabs with building apps for the iPhone or iPad. The course goes from the basics of downloading the needed software, to building an app, and finishing with putting that app on your own iPhone.</p>\n\n<p><br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Create, Design, Build, and Export an iPhone App</strong></p>\n\n\n\n\n\n<ul><li>Put an app on your iPhone</li><li>This course can be completed in a short period of time</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Build an app and put it on your iPhone in one evening.</strong></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>In this course you will use how to use a Mac computer (useful if you come from a Windows background), how to download the necessary software, and have an introduction into how to use it.</p>\n\n\n\n\n\n<p>You will then build your first app and run it on a simulator. Once you have achieved that we move onto building a fully functional app, and by the end of the course this app will run on your own iPhone.</p>\n\n\n\n\n\n<p>To keep things moving fast and fun this course is only 14 lectures in length and comprises a mixture of talking head videos, screen videos, articles, and quizzes. It is a really engaging course that will keep you interested and alert from start to finish.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>The holy grail of this course</em></strong> is that by its completion (usually can be done in one evening) you will end up with a fully functioning app on your iPhone which you can proudly show off to your friends and family.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>So what are you waiting for.....go and purchase it today!!!</strong></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Build an App & put it on YOUR own iPhone in just ONE EVENING", 
    "price": "20.00", 
    "instructors": "Michael Harrison", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/837958_5a1f_2.jpg", 
    "course_url": "https://www.udemy.com/bucketlist-1-create-an-app-and-put-it-on-your-own-iphone/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-02T22:11:47Z"
}