{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t The Intel® XDK provides a comprehensive cross-platform development environment for building hybrid HTML5 apps for mobile phone and tablet devices. HTML5 apps are not limited to smart web pages viewed in a browser, you can also package your HTML5 code and deploy it directly on a mobile device as a locally installed <em style=\"\">hybrid mobile app</em>. This enables the use of the same distribution and monetization channels as for native mobile apps, in addition to the same app installation and launch experience.  </p>  <p style=\"\">  \t This is free software, something that you may or may not regard Intel as having a great track record in. In truth, Intel has worked close to many open projects in the past.  </p>  <p style=\"\">  \t While the majority of Intel developer tools have been focused on lower-level software code designed to run on a specific chipset, this technology is genuinely cross platform benefitting from the abstraction layer of the web and the HTML5-driven browser-based focus that is so strong here.  </p>  <p style=\"\">  \t So Intel XDK allows developers to tap into a technology base known as the &quot;HTML5 foundation&quot;. Not a group or organization of some form, but a collection of standards that are intended to try and advance the growth and progression of the web outwards and onwards beyond the static documents of old to the new world of more dynamic applications. The HTML5 foundation also works to convert those applications that are created in order that they can be finally used on mobile devices.  </p>  <p style=\"\">  \t The Intel XDK is built with a web-based emulator as well as a good collection of demo applications to help test functionality. If you can write it for the web using HTML/HTML5, CSS3, and JavaScript, you can use the Intel XDK to build it as an HTML5 web app or as a native app for all of the major App Stores, says Intel.  </p>  <p style=\"\">  \t The Intel XDK makes it easy for developers to check the look-and-feel of their apps with on-screen emulation on a wide variety of devices. The App Tester allows you to test on a physical device.  </p>  <p style=\"\">  \t According to Intel, &quot;Once your app is finalized, move over to Intel&#039;s App Dev Center where you can package your HTML5 apps for Apple iOS, Google Android, Amazon Kindle, Facebook, and other app stores.&quot;  </p>  <p style=\"\">  \t&lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "Building Mobile Apps Using Intel® XDK", 
    "price": "20.00", 
    "instructors": "QScutter Tutorials", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242848_8134_2.jpg", 
    "course_url": "https://www.udemy.com/building-mobile-apps-using-intel-xdk/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-13T17:36:09Z"
}