{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>I have an app called Yuppi built on Swift. It provides the simplest way to share photos and videos in moments and other people can collaborate also moment owner can set privacy groups. It's cool, elegant and simple user interface. </p><p>I've been working so hard on making this app to be the next social network app so hopefully you can download it so you can give me your valuable feedback.</p><p>Currently Yuppi App is available on IOS 8+ only and soon will be available on android as well. </p><p>If you didn't download it yet, i encourage you to Download it Now. It's Free!!.</p><p>  \t  Technology is everywhere around us but none of us know to code !! This is disaster..  </p>  <p>  \t  I think everyone should know how to code because its only take few lines to make difference and touch people life.  </p>  <p style=\"\">  \t  Coding its not about being smart or talent, its about ideas and stories telling millions of people about it.  </p>  <p>  \t75 Billion Apps were already sold in the iOS App Store. If you ever wanted a chance to participate in this success, here is your chance.  </p>  <p>  \tIn this course you are going to learn all the basics you need to know to create your own simple iOS applications using the new Swift programming language. After learning all about the basics of programming, you are going to build simple code for UIKit Framework which you are going to use to create awesome Apps. After getting in touch with many iOS User Interface components we are going to start using more advanced with Parse backend online database and integrate to our apps with powerful tools such that Push notifications, Retrieve Data, Upload data,Update Data and In-App purchased. The conclusion of this course is a real-life example that will help you connect all the dots and pieces of your newly acquired knowledge.</p>", 
    "end_date": null, 
    "title": "Build Great IOS Apps (Swift)", 
    "price": 0, 
    "instructors": "Hamad Fouad", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/395674_f8d6_3.jpg", 
    "course_url": "https://www.udemy.com/build-great-ios-apps-with-swift/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-16T11:22:18Z"
}