{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Do you know that <strong style=\"\">C# is among more popular programming languages for 2014</strong> by <a href=\"http://www.wpcentral.com/c-trend-2014\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">WpCentral.com</a> and <a href=\"http://blog.codeeval.com/codeevalblog/2014\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">CodeEval</a>. I bet you will fall in love with C# and if you want to create an Android application using that language then you can pursue the great Xamrin Mono (a Cross Platform development tool) which enables developers to develop iOS and Android apps in C# language. Just imagine, .NET developers can code in a familiar language and produce apps that leverage C#&#039;s advantages, including speed increases  </p>  <p>  \t  Look who else is working on C# and Xamrin Mono: <strong style=\"\">Rdio, National Instruments, Bosch, Kimberly Clark have create mobile apps using the tool. </strong>Over 500,000 developers are already using Xamarin to create amazing apps. Don’t miss this opportunity. Learn the basics now.  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">How is this course different?</strong>  </p>  <p>  \t<u style=\"\">Focus on Project</u>: The course is accompanied with a real life application of the tool as a “Social App” with a working project in the end. Completions of project will give you significant confidence. Also, the course is sliced into sections and chapters so you can learn sequentially or hop to topic of interest  </p>  <p>  \t<u style=\"\">Relevant Skills</u>: The course targets relevance both in terms of  process of instruction and learning which signifies the value of knowledge today, and process of ensuring the value of knowledge/information for the future  </p>  <p>  \t<strong style=\"\">Why learn App development using C#?</strong>  </p>  <ul style=\"\">  \t<li>Large market for Android and iOS Apps. C# integrates development for both these platforms</li>  \t<li>Must-learn for Microsoft Mobile App developer</li>  \t<li>Xamarin’s architectural approach provides completely native UIs with better performance than other cross-platform techniques</li>  </ul>  <p>  \t  So Get Ahead and learn App development using C# and Xamrin Mono from our Instructor Tanzeel to stay relevant in the industry  </p>", 
    "end_date": null, 
    "title": "Build Android Apps using C# and Xamarin Mono", 
    "price": "20.00", 
    "instructors": "Yoda Learning", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/243890_ba77_3.jpg", 
    "course_url": "https://www.udemy.com/build-android-apps-using-c-xamarin-mono/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T04:55:16Z"
}