{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">If you&#039;d like to learn how to develop applications for iOS (iPhone and iPad) but haven&#039;t programmed much, the task may seem daunting. &nbsp;iOS programming is based on the Objective C programming language-- and C programming is a prerequisite. Our C programming course will teach you how to program in C. Programming with C is the perfect place to start if you want to create programs for iPhone, iPad or Mac. &nbsp;Learning C is also great to learn if you have never programmed before and want to understand the basics.<br style=\"\"><br style=\"\">C is the basis of many languages used today. &nbsp;C++, Objective C, PHP, Java and even Microsoft&#039;s .net languages have their roots in the C programming language. &nbsp;While C has been around since the 70&#039;s it&#039;s still used today in applications where speed is critical-- Financial applications, video games and complex engineering simulations are all written in C. &nbsp;<br style=\"\"><br style=\"\">In this course master trainer Mark Lassoff will teach you the important concepts you need to learn how to program in C. &nbsp;After completing this course you will be ready to write and adjust C applications. &nbsp;You will also be fully prepared to tackle Objective-C-- the language of iOS (the iPad and iPhone).<br style=\"\"><br style=\"\">There is no programming experience required for this course. So take a tour around this ultimate C programming tutorial.<br style=\"\"><br style=\"\">Already know C programming? Check out <a href=\"http://www.udemy.com/objective-c-for-iphone-developers/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Objective C for Beginners</a> and start coding iPhone and iPad apps today!<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "C Programming: iOS Development Starts Here!", 
    "price": "50.00", 
    "instructors": "LearnToProgram, Inc.", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8723_f995_10.jpg", 
    "course_url": "https://www.udemy.com/c-programming-ios-development-starts-here/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-07-25T05:16:32Z"
}