{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Aprende la estrategia que use para ganar $2348 dlls al mes con un código que me costo $12 dólares sin tener que programar desde cero.</strong></p><p style=\"\">Bienvenidos al curso más completo en español para saber como ganar dinero con apps de android en el mercado latino donde vas a conocer mi estrategia completa.</p><p style=\"\">El curso va directo al punto, no me voy con rodeos de teorías, te enseño lo que me funciona.</p><p style=\"\">Te enseño como buscar un nicho que de dinero, como comprar el código fuente para hacer tu app, como optimizar tu app para la play store y como ganar dinero con tu app.</p><p>ALERTA: Esto no es un curso de como ganar dinero rápido sin trabajar, ocupas dedicarle tiempo y trabajar, ocupas una estrategia y ejecutarla. Esto no es para personas flojas que solo quieren dinero fácil sin trabajar. Mis resultados son fuera de lo normal, tu no vas a tener los mismos resultados. El curso es para novatos que buscan un atajo o para desarroladores que buscan algo diferente, en el curso te explico la manera inteligente de ganar dinero en la play store.<br style=\"\"></p><p>¿La mejor parte? No ocupas saber programar desde cero. </p><p style=\"\">Además quiero enseñarte como crear una aplicación de android  sin necesidad de ser un programador, enseñarte las técnicas que yo he aprendido para comprar código en internet para crear una aplicación para obtener miles de descargas dentro de la Play Store. </p><p style=\"\">También esta diseñado para programadores que han publicado aplicaciones y que no han conseguido a cantidad de descargas  deseadas.</p><p style=\"\">Este curso va ayudarte a entender los siguientes puntos:</p><p style=\"\">Como funciona la Play Store. </p><ul style=\"\"><li>Como utilizar la Play Store para crear una aplicación con un mercado Potencial.</li><li>Como Hacer busquedas de palabras claves dentro de la google Play Store.</li><li>Como crear aplicaciones que superen las expectativas de los Usuarios.</li><li>Como comprar código en internet.</li><li>Como Contratar programadores o diseñadores en internet.</li><li>Como utilizar estrategias de marketing para conseguir más descargas dentro de la Google Play Store.</li><li><span style=\"\"></span>Como monetizar tus aplicaciones.</li></ul><p style=\"\">Este curso esta diseñado para que al finalizar le curso publiques tu primera app sin necesidad de codificar una línea de código.</p>", 
    "end_date": null, 
    "title": "Como ganar dinero con apps de android sin programar ", 
    "price": "20.00", 
    "instructors": "Omar Oviedo", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432270_fabd_4.jpg", 
    "course_url": "https://www.udemy.com/marketing-para-aplicaciones-de-android-aso/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T18:57:57Z"
}