{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "  <p>  \t<strong>Android Kit Kat 4.4 is both Beautiful &amp; Immersive. </strong><em>It has a more polished design, improved performance, and a TON of new features. </em>In fact, this latest Android Update from Google is all set to match Apple's iOS 8  </p>  <p>  \t                      In our <strong>Complete Android Programming Course</strong>, we will walk you through the fundamentals of Android app development in Java.  \t  \t<strong>You will learn ALL the skills </strong>needed to develop exciting and powerful Android mobile apps using the latest versions of the SDK and the new Android Studio development environment.  </p>  <p><em>If you are truly interested in learning mobile app development for the Android platform, then this is the course for you.</em></p>  <p>  \t<strong>What You Will Learn</strong>  </p>  <p>  \t<em>We'll start with the basics: activities and layouts. </em> You'll learn how to <strong>create user interfaces</strong> and how to drive them from activities, and how to harness the <strong>power of intents to link activities</strong> into a <em>compelling user experience.</em>  </p>  <p>  \t  \t                                                 Of course, an app is nothing without its data, and <strong>Android has some pretty powerful tools to store that data.</strong>  </p>  <p>  \t                                                We'll talk about <strong>SQLite</strong>, the mobile version of the  popular SQL relational database management system. You'll learn how to  store data in SQLite databases, and how to retrieve that data later and  use it to populate several different types of user interface controls.   \t  \t                                                 Making your apps <em>sparkle</em> with <strong>2D and 3D graphics</strong> will also be covered.    \t  \t                                                 You'll learn some <strong>basic animation techniques</strong> to use with any view in the course, but you'll also learn how to <strong>animate any object</strong> – that is, to change its properties over time! <em>This is a powerful technique that can be used not just for traditional animation, but for any time-bound task.</em>  \t  \t                                                 We'll also discuss the <strong>OpenGL-ES 3D graphics library.</strong>  </p>  <p>  \t                                                We've included a bonus <strong>One Hour - Live Webinar Introductory Session</strong>  where Rick will walk you through the basics and advanced features that  are covered in the course... at the end of which there will be an open  Q&amp;A session.  </p>  <p>  \t<strong><em>Pretty much anything a developer can do to an Android mobile device is covered in this course.</em> </strong>  </p>  <p>  \t<strong>A brief Outline of the Course Structure &amp; Units</strong>  </p>                                                      Approximately 25 hours of High Quality Video Training, Source Code, Workbooks and Exercises   taught over 12 Sequential Units.  <p>  \t<strong>[Unit 1] Installation of Java and developer tools</strong>   \t  \t                                                 Two options are available: ADT and Android Studio. This course will use  Android Studio, even though it is still in early access beta. First App  (Hello, Android). Activities and the activity lifecycle.  </p>  <p>  \t<strong>[Unit 2] First Steps</strong>  \t  \t                                                 The Model – View – Controller design pattern, and how it applies to  android apps. The relationship between views and activities. Using  Intents with activities. The android manifest file.  </p>  <p>  \t<strong>[Unit 3] User interaction and controls</strong>   \t  \t                                                 Active and passive controls. Writing callback methods for active  controls. XML resource files for strings and other control values.  </p>  <p>  \t<strong>[Unit 4] List views and list activities</strong>   \t  \t                                                 We'll start with list activities, which should be used unless the list  view is a part of another activity. Presenting a new activity when a row  on the list view is tapped. Spinners will also be covered.  </p>  <p>  \t<strong>[Unit 5] SQLite</strong>   \t  \t                                                 SQLite and providing relational data to list views and other controls.  Discussion of the Structured Query Language (SQL) as it pertains to  Android. Creating a database. Modelling the data in an app's classes.  Providing the data to controls, with special attention given to list  type controls.  </p>  <p>  \t<strong>[Unit 6] Services, Content Providers, and Broadcasts Part 1 &amp; 2</strong>  </p>  <p>  \t                  Intents in depth. A look at threading, and its relationship to services.  Content providers are discussed as a way to access data present on the  device but not within the app itself. Broadcasts are a way for one  activity or app to inform others that an event has occurred.  </p>  <p>  \t<strong>[Unit 7] Audio and video</strong>  </p>  <p>  \t  \t                                                 Playing and recording audio and video. The camera and microphone devices. Supported file formats and file storage.  </p>  <p>  \t<strong>[Unit 8] View and property animation</strong>   \t  \t                                                 Includes a discussion of images and how they are used in controls. View  animation allows us to move views over time, but does not change the  underlying properties of the view (the view “snaps back\" when the  animation is finished.) To change the actual properties of objects, we  use property animation.  </p>  <p>  \t<strong>[Unit 9] Location and sensors</strong>   \t  \t                                                 Finding the latitude and longitude of a device using the IP address,  wireless connection information, and GPS. Accelerometer, gyro meter, and  other hardware sensors are covered.  </p>  <p><strong>[Unit 10] Intro to OpenGL – ES</strong> </p><p>  \t  \t                                                 Versions and API levels. Setting up the environment and simple  rendering. Shaders and the programmable graphics pipeline. Simple  animation with matrix transforms.  </p>  <p>  \t<strong>[Unit 11] Best practices for app development</strong>  \t  \t                                                 Team and solo approaches to app development. Organizing the workflow. Case studies are included.  </p>  <p>  \t<strong>[Unit 12] Debugging, and the Google Play store</strong>   \t  \t                                                 Using the debug bridge and other tools. Debugging on an actual device.  Preparing your app for deployment on the Google play store, with  suggestions for supporting your app going forward and how to approach  change requests and updates.  </p>  <p>  \t  \t                          Alongwith this course you get the following Bonuses to keep!  </p>  <p>  \t  \t<strong>Bonus 1</strong> - Android Smart Watch and Wearables Programming    \t  \t<strong>Bonus 2</strong> - Primer on Amazon's hot new Fire OS   \t  \t<strong>Bonus 3</strong> - Live Android Programming Webinar  </p>", 
    "end_date": null, 
    "title": "Complete Android Programming with KitKat 4.4 ", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287970_8f8d_3.jpg", 
    "course_url": "https://www.udemy.com/complete-android-programming-with-kitkat-44/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T06:17:38Z"
}