{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Der Name ist Programm. In diesem Training lernst Du Core Data im Praxiseinsatz kennen. Vorbei die Zeit der automatisch generierten Datenbanken. Nutze diese Technologie nicht einfach, lern sie zu beherrschen. Dieses Training ist dafür der optimale Einstieg.<br></p>\n\n<h4><strong class=\"redactor-inline-converted\">Core Data verstehen</strong></h4>\n\n\n\n<p>In einer Einführung lernst Du Core Data und die wichtigsten Begriffe kennen. Danach fügst Du Core Data manuell zu bestehenden Projekten hinzu und lernst so ganz genau die einzelnen Bestandteile und deren Beziehung zueinander kennen. Du erzeugst einen eigenen Stack aus Managed Object Model, Persistent Store Coordinator, Managed Object Context und Managed Objects.</p>\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Preloading</strong></h4>\n\n\n\n<p>Du möchtest Datenbanken schon bei der Auslieferung mit Werten befüllen? Das Preloading kann auf mehreren Wegen realisiert werden. In mehreren Beispielanwendungen lernst Du wie dies mittels bereitgestellten JSON Dateien umgesetzt werden kann.</p>\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Beziehungen / Relationships</strong></h4>\n\n\n\n<p>Entitäten sind das Herzstück Deiner Datenbanken. Sie werden erst recht mächtig, wenn Du auch entsprechende Beziehungen untereinander erzeugen und konfigurieren kannst. Denn so hast Du verwandte Daten ohne Mehraufwand auf Abruf verfügbar. Du lernst Beziehungen und Begriffe wie „to one“ oder „to many“ am praktischen Beispiel kennen.</p>\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Migrationen</strong></h4>\n\n\n\n<p>Wenn die Datenstruktur definiert ist, kannst Du sie nicht einfach ändern. Das führt zu einem Fehler. Du kannst sie aber auch nicht einfach löschen. Dann verlieren Deine Benutzer ihre Daten. Lern wie Du auch später an Core Data Änderungen vornehmen kannst: über Migrationen und Versionierung.</p>\n\n\n\n<h4><strong class=\"redactor-inline-converted\">NSFetchedResultsController</strong></h4>\n\n\n\n<p>Zusammen mit der UITableView lernst Du einen einfachen zur Anbindung von Core Data kennen: den NSFetchedResultsController. Der erleichtert Dir den Zugriff auf die Daten und die Darstellung als Tabelle. Auch die Aufteilung in Sektionen wird so im Handumdrehen realisiert.</p>\n\n\n\n<h4><strong class=\"redactor-inline-converted\">NSFetchRequests</strong></h4>\n\n\n\n<p>Natürlich arbeitest Du intensiv mit NSFetchRequests und lernst eine Möglichkeit die Abfragen im Cache abzulegen kennen. Dazu erstellst Du einen eigenen Settings View, um Deine Datenbankeinträge nach dynamischen Kriterien zu filtern. Dabei spielt die Klasse NSPredicate eine wichtige Rolle. Gleichzeitig verwendest Du auch den NSSortDescriptor, um die Ergebnisse Deiner Abfrage zu sortieren.</p>\n\n\n\n<h4><strong>iCloud Synchronisation</strong></h4>\n\n\n\n<p>Wie wäre es, wenn Deine Datenbank auf mehreren Endgeräten verfügbar wäre? Egal ob der Benutzer am iPad oder am iPhone arbeitet. Er hat Zugriff auf die aktuellen Daten. Du lernst dies über die iCloud von Apple zu realisieren.</p>", 
    "end_date": null, 
    "title": "Core Data mit Swift im Detail", 
    "price": "30.00", 
    "instructors": "Jan Brinkmann", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/845792_7630_2.jpg", 
    "course_url": "https://www.udemy.com/core-data-swift/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-11T07:06:30Z"
}