{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t        Do you have an interest in <strong style=\"\">Apple Watch</strong>? How about Objective-C or Swift?  </p>  <p>  \t        In this course, you learn how to create the classic and fun <strong style=\"\">Simon-like</strong> Color Memory Game for Apple Watch.  During the course, you will receive all code and video instruction to build your own game in both Objective-C and Swift.  </p>  <p>  \t        You will learn how to create a full game from booting up your XCode, to writing your first view controllers and previewing them in the Xcode Simulator.  As we discuss the terminology, we have pop-ups (<strong style=\"\">think VH1&#039;s Popup Video!</strong>) to provide additional information on-screen for insight and memorization.  </p>  <p>  \t        Our Color Memory Game course has over 2 hours of content which will immerse you in the development of this game alongside Kevin Weiler (seasoned iOS developer) and Miles Rast (veteran web developer). It is a nerdy approach to a very nerdy project.  :-)  </p>  <p>  \t        This course starts with an Apple WatchKit extension, goes into designing a simplified menu and game controller.  And then the magic.  We code the application together while providing tips and tricks that we have learned in our own development journey.  </p>  <p>  \t    We have spent a lot of time building this project, editing the video and providing it to you in a seamless set to get you on your way.  We hope you learn from this, but more importantly - we hope it provides a launchpad to inspire you with your own future game.  Enjoy!  </p>", 
    "end_date": null, 
    "title": "Create an Apple Watch Game with Xcode and Watchkit", 
    "price": 0, 
    "instructors": "Miles Rast, Kevin Weiler", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380436_5d48_5.jpg", 
    "course_url": "https://www.udemy.com/apple-watch-color-memory-game/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T23:37:33Z"
}