{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tA revolution is happening in the world of publishing as tablet computers and pixels are replacing paper and ink. Designers need to consider the limitations of a small screen and the advantages of an interactive medium, and at the same time, learn the new technology required to produce their work. This course will explore some of the basic issues faced by designers of eMags and eBooks, and the basics of getting them onto tablet devices using Adobe InDesign CS5.5 through CC, in combination with Adobe Digital Publishing Suite (DPS).  </p>  <h5> Who Should Take This Course</h5>  <ul>  \t<li><strong>Print designers and producers</strong> who want to learn the essentials of creating digital content for iPad and Android tablets.<br>  \t</li>  \t<li><strong>Print designers who aren’t familiar with production techniques for tablet,</strong> and who want to begin using some of the Adobe Digital Publishing Suite (DPS) tools. <br>  \t</li>  \t<li><strong>Beginner print, web, and mobile, designers</strong> who want to explore the essentials of understanding essential principals of interactive design.<br>  \t</li>  \t<li><strong>Writers interested in producing their own e-books or mobile blowzines.</strong> These students should please note: the foundations of design will not be covered in this course.<br>  \t</li>  \t<li><strong>Any of the above working with tablet devices not running Mac iOS,</strong> such as Amazon Kindle, Barnes &amp; Noble Nook, Samsung Galaxy, and other Android devices. These students should please note: the design content of this course will translate regardless of the device, however some technical content covered may not be applicable.<br>  \t</li>  \t<li><strong>PC users.</strong> Students not working in Windows OS should please note: although content will be demonstrated in Mac OS X, they should easily be able to follow along.<br>  \t</li>  \t<li><strong>Interactive and User Interface designers</strong> who want to explore how users and readers might access interactive content. These students should please note: <strong>this course WILL NOT cover programming apps,</strong> although the process of designing them will be touched on, briefly.<br>  \t</li>  </ul>  <h5>What’s Required</h5>  <ul>  \t<li><strong>Knowledge of essential 2-D graphic design principals,</strong> such as form, space and plane, typography, color.<br>  \t</li>  \t<li><a href=\"javascript:void(0)\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"><strong>Introduction to Adobe InDesign</strong></a> or equivalent knowledge. Students will need to have knowledge of essential print production techniques using Adobe Creative Suite: building pages in InDesign, importing elements from Photoshop and Illustrator, and exporting pages in .pdf format.<br>  \t</li>  \t<li><strong><a href=\"http://www.adobe.com/products/indesign.html\" title=\"Adobe InDesign\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">Adobe InDesign CS6 </a> (<a href=\"http://www.adobe.com/cfusion/tdrc/index.cfm?product=indesign\" title=\"InDesign 30-day Free Trial\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">30-day trial download</a> available), or CS5.5.</strong> Students wanting a hands-on experience should please note: following most content and lessons will be possible in CS5. Students using versions earlier than CS5 will be able to layout content, but won’t be able to explore most, if not all, of the technical content relating to Adobe Digital Publishing Suite (DPS).<br>  \t</li>  \t<li><a href=\"http://get.adobe.com/reader/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"> <strong>Adobe Acrobat Reader</strong></a><br>  \t</li>  \t<li><strong><a href=\"http://www.stuffit.com/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">Stuffit Expander</a></strong> or other software to open .zip files</li>  </ul>  <h5>Suggested Resources </h5>  <ul>  \t<li><strong>Access to an iPad or Tablet Device.</strong> While the device is not critical for completing this course, it will provide students with the opportunity for more in-depth study, and without it, access to a minimal amount of content won’t be possible.<br>  \t</li>  \t<li><strong>Notebook &amp; something to write with,</strong> or equivalent tools.</li>  </ul>", 
    "end_date": null, 
    "title": "Create Your Own iPad & Android Publications  ", 
    "price": "30.00", 
    "instructors": "Joseph Caserto", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/14038_2d5f_13.jpg", 
    "course_url": "https://www.udemy.com/designing-for-the-ipad/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-02-13T17:02:03Z"
}