{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Want to create an application like Twitter?</p><p>Want to learn how to create users?</p><p>Want to learn how to create online databases?</p><p>If YES then this course is for you! </p><p><strong>What's the course about and how is it structured?</strong></p><p>In this course we will develop together an application like Twitter for iOS 8, Xcode 6 and Swift with a step by step approach. </p><p>We explain what you need in order to create the Logic, Database, Connections and Development of a Twitter application. </p><p><strong>The course covers :</strong> </p><p>Creation of the application User Interface for all screen sizes with hard coding. </p><p>Create a new Parse application and connect it to our project. </p><p>User Log in and Sing up development. </p><p>Fetching Users. </p><p>Follow and Unfollow a user development.</p><p>Send a Tweet with text and image.</p><p>Fetch Tweets from users your follow.</p><p>Create different Table Height for each Row.</p><p>Create a Table Refresher.</p><p><strong>Materials</strong></p><p><strong>The course consists of :</strong> </p><p>3.5 + hours of video lectures with code from scratch </p><p>application files for download </p><p>This course can be completed in a couple of days. </p><p><strong>Why to follow this course?</strong></p><p>If you want to make an application like Twiiter from scratch or use this code to upgrade your existing application this course is for you! </p><p>If you want to learn how to connect to an Online Database this course is for you! </p><p>If you want to learn how to create Users this course is for you! </p><p><strong>Who can follow this course ?</strong></p><p>Anyone with basic knowledge of programming can follow this course. </p><p><strong>This course is updated for Swift 1.2 and Parse 1.7.5 and under development for Swift 2.0 and Parse 1.8.2</strong></p><p>Copyright © Valsamis Elmaliotis 2015</p>", 
    "end_date": null, 
    "title": "Create an app like Twitter with Swift", 
    "price": "20.00", 
    "instructors": "Valsamis Elmaliotis", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448412_39fa.jpg", 
    "course_url": "https://www.udemy.com/create-an-app-like-twitter-with-swift/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T08:06:23Z"
}