{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>in this course you will learn how to build your first awesome messenger bot that connects with Foursquare and gives users travelling advises on preferred location directly in their Facebook messenger app! </p>\n\n<p>You will also have knowledge on how you can monetize and promote your bot.</p>\n\n<p>This course is a great starting point for you to start working with bots and getting into that <br>new and soon-competitive market. Just imagine, Facebook Messenger has over <strong>900 million users!</strong> How great would it be to develop something that will help the engagement between it's users?</p><p>This course includes video and article lectures. We have also included a full code for you, so instead of having to re-type everything that I show you from the screen, you will be able to work with the live code, play with it, edit it and upload it to your server (or even sell it!).</p><p>Messenger bots are still very new to this world. While this course was being recorded, Messenger bot coding structure has changed twice. So keep an eye on this course as we will make sure all lectures are updated with an <u>up-to-date material</u>.</p><p>Why you should take this course?</p><p>Because Facebook Messenger bots (and other platform bots) will be a part of nearest future. Have you heard Facebook's plans? They want to have everything to take place within Messenger app: people to order flight tickets, buy clothes, groceries etc. If you are a developer or just a person who wants to be in touch with the technology world - this course is a must for you.</p>", 
    "end_date": null, 
    "title": "Create & Monetize Your Facebook Messenger Bot like a Pro", 
    "price": "35.00", 
    "instructors": "Ruslan Melnik", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/872514_bb03.jpg", 
    "course_url": "https://www.udemy.com/chat-bot-create-facebook-messenger-bot-for-travelling/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-08T16:34:59Z"
}