{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Intel XDK and Ionic form the best combination for <strong>building cross platform mobile apps</strong>.<br></p><p>You may wonder why to build cross platform apps using Intel XDK and Ionic. Well Phonegap is an Intel XDK alternative and jQuery Mobile is an alternative to Ionic.</p><p>The main benefit of creating apps using Intel XDK is that you don't need a MAC and also you <strong>don't need to install eclipse, XCode and Visual Studio to test apps</strong>. Intel provides its own cross platform emulator and also a <strong>cloud binary build. </strong>XDK let's you <strong>test the app on a real device</strong> without install any other software. This is just couple of the lots of features provided by Intel XDK.</p><p>Ionic framework is the most trending topic among developers at present. It provides the <strong>best UI for creating mobile apps.</strong></p><p>In this course we will only learn <strong>design components of Ionic</strong> as we we will using <strong>Intel XDK to test, build, debug and build the app</strong>.</p><p>Creating hybrid mobile applications is a great way to leverage your knowledge of web languages like HTML5, CSS, and JavaScript. Modern frameworks such as AngularJS and Ionic make it easier with pre-built templates and components. In this course we will teach the core Ionic components: pre built, easy-to-use features such as buttons, lists, tabs, and forms. Then Ray shows how to combine these components with AngularJS models, views, and controllers to build a single page app with sliders, pull-to-refresh functionality, and search. <br></p>", 
    "end_date": null, 
    "title": "Create Mobile Apps using Intel XDK and Ionic Framework", 
    "price": "20.00", 
    "instructors": "QScutter Tutorials", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497646_af0d.jpg", 
    "course_url": "https://www.udemy.com/intel-xdk-and-ionic-framework/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T15:45:29Z"
}