{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Welcome to this Swift programming course where you will learn how to develop a cloud powered Live Update chat application.</p><p style=\"\">My Name is Ronny and I am a software developer at Team App Creative. I have been programming online for over 5 years where I Initially started with PHP and Wordpress plugin development.</p><p style=\"\">Currently I am focused in programming with Java, Swift, Android and IOS applications.</p><p style=\"\">I designed to course first of all because I love to teach. I have an extensive list of videos on youtube teaching different programming languages. Secondly, it is for those seeking to learn and develop an IOS application regardless of programming skills and/or background. newbies, pros, students, entrepreneurs e.t.c.</p><p style=\"\">We will be using a common software development methodology known as Model view controller (MVC) pattern where we will separate data from view and controllers and see how to make them interact appropriately.</p><p style=\"\">Aside from the IOS course in Swift, I also include a FREE and COMPLETE video course for the same app but in Android using Java. You will learn everything it took to get this same app up and running in Android. In short, you are getting a complete mobile developer package program for pennies if you ask me.</p><p style=\"\">The IOS course covers everything you need to know on how to start and deploy a working chat application. Along the process, you will learn how to work with button, textfield, table view, view controllers, views, parse, segues, auto-layout and many more.</p><p style=\"\">Join now as you have 30 day days no question money back guarantee by Udemy. If at any moment you feel unhappy about any video, you can request a refund within the 30 days of enrollment. You really have nothing to lose. </p><p style=\"\">See you inside!</p><p style=\"\">regards,</p><p style=\"\">Ronny Kibet.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Create a Live Update chat app with Swift IOS8 and Xcode.", 
    "price": 0, 
    "instructors": "Ronny K", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476332_e67e_4.jpg", 
    "course_url": "https://www.udemy.com/swiftprogramming/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T19:33:50Z"
}