{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\"> <strong style=\"\">Infinite Skills</strong> have a wide range of tutorials covering all the popular applications and programming languages. A full list of courses complete with free demos<br style=\"\">  \t      can be seen here on the <a href=\"http://www.infiniteskills.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"><strong style=\"\">Infinite Skills Web Site</strong></a></strong>  </p>  <p>  \t<strong style=\"\"> <strong style=\"\">About This Tutorial</strong><br style=\"\">  \t      In this iOS app development tutorial, you will learn how to create apps for iPhone and iPad devices. Expert trainer and published author Tony Bove introduces you to using the iOS Software Development Kit (SDK) and Xcode to build apps for the iPhone, iPad and Universal apps. Even if you have never programmed before or built apps before, by the end of this iOS app development tutorial you will be fully capable of building apps and submitting them to the App Store.</strong>  </p>  <p>  \t<strong style=\"\">     Before you even start building an app, Tony takes you through what makes a good app, and the limitations you will face on the iPhone and iPad platforms. You will learn how to design a good user interface, how to use the iOS simulator, how to program in Xcode, and how an app runs. From there, you will jump right into building apps: designing the interface, including iAds in your app, animating, timing, and much more. You will also learn how to build iPad specific apps to take advantage of a larger screen and additional features. Finally, you will learn how to package your apps, and prepare them for submission to the app store.</strong>  </p>  <p>  \t<strong style=\"\">     By the conclusion of this iOS app development tutorial you will be fully capable of designing, creating and submitting an app to the Apple App Store, using the iOS SDK and Xcode. The author has included working files, to allow you to work alongside him as he builds an app throughout this video based iOS app development tutorial.</strong>  </p>  <p>  \t<strong style=\"\"> <strong style=\"\">Please Note:-</strong></strong>  </p>  <p>  \t<strong style=\"\"> <strong style=\"\">This is an older course on Creating iPhone &amp; iPad Apps, if you want to view our more upto date</strong><strong style=\"\"> iOS app development tutorial</strong><strong style=\"\"> that covers all the latest techniques you should follow this link: </strong><a href=\"https://www.udemy.com/beginners-guide-to-iphone-ipad-app-creation/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">https://www.udemy.com/beginners-guide-to-iphone-ipad-app-creation</a></strong>  </p>", 
    "end_date": null, 
    "title": "Creating iPhone & iPad Apps Training - No Coding Required", 
    "price": 0, 
    "instructors": "Infinite Skills", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48456_a3dc_10.jpg", 
    "course_url": "https://www.udemy.com/creating-iphone-and-ipad-apps-no-coding-required/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-03T23:55:19Z"
}