{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong><em>Over 700 students enrolled within 5 days - join them and have your app published in the upcoming week!</em></strong>  </p>  <p>  \t<strong><em>*** See the app i created in this course in section 9***</em></strong></p><p><strong><em></em></strong><strong><em>______________________________________________________________</em></strong></p>  <p>  \t<em>Please note - you will learn how to publish the app for Android devices, and there is a documented tutorial about publishing it for Apple devices as well. A video tutorial about Apple will be added soon.</em>  </p>  <p>  \t<strong>What will my app do?</strong>  </p>  <p>  \t                                     There are so many features you can add to your app, and i will name a few here. Make sure to watch the free preview video which talks about those features as well:  </p>  <ul>  \t<li>News section</li>  \t<li>Online catalogue</li>  \t<li>Custom pages (as many as you want)</li>  \t<li>RSS feeds</li>  \t<li>Image and video galleries from various services (Picasa, Youtube, Vimeo, Instagram) + upload your own</li>  \t<li>Contact form with various field types</li>  \t<li>A booking system</li>  \t<li>A calendar</li>  \t<li>Show your Wordpress posts</li>  \t<li>Show a non-Wordpress articles via RSS</li>  \t<li>Connect your Facebook page</li>  \t<li>Send push notifications</li>  </ul>  <p>  \t                                     (to name a few...)  </p>  <p>  \t<strong>How long will it take me to build the app?</strong>  </p>  <p>  \t                    The course is very straight to the point, i tried to keep out any smalltalks or unneeded information, so you can start working on your app immediately and publish it to the stores within a few days/weeks, depending on your schedule. I divided the steps into 8 days, each takes about 30-60 minutes to complete. You can follow the 8-days program, or work in your own pace depending on your free time.  </p>  <p>  \t<strong>Is this course for me?</strong>  </p>  <p>  \t                    This course is for you if:  </p>  <ul>  \t<li>You own a business and want to offer your customers an app to download, which will make your company look more professional and reliable</li>  \t<li>You own a website and want to turn it into an app, so your followers will have a quick and immediate way to reach you through their devices</li>  \t<li>You own a business and want to make it easier for your customers to reach you when they need your service, by clicking on your app icon</li>  \t<li>You want to send your customers (or website followers) notifications about sales, new articles, new products and such - by sending them push notifications</li>  \t<li>You want to learn how to create apps so you can start a business around it and offer this service to customers</li>  \t<li>You are a webmaster who wants to offer your customers another service besides building their website- creating an app for them too</li>  \t<li>You're looking for an easy to use, free platform to creating an app</li>  </ul>  <p>  \t                    Today, almost every business has a website - which is great, but it makes the competition harder and you have to get creative if you want to stand out in a crowd. The apps world is still at its first stages, and this is JUST the right time to offer your customers another way to reach you by downloading your app. Besides from making you look unique, an app is a GREAT idea if you run a personal blog too, as you can send notifications to your viewers when you publish a new post, and let them reach your content immediately!  </p>  <p>  \t                    Thanks to the platform you will work with in this course, a native app for your business or personal use is at the tip of your fingers. All you need is to carefully pay attention to all the steps, be willing to learn a new (and easy) skill and be motivated to get your first app up in the stores within a few days!  </p>  <p>  \t<strong>Additional costs:</strong>  </p>  <p>  \t                    The platform you will work with is free to download and use. That being said, there are 2 services you *might* have to pay for, which are not related to the free platform:  </p>  <ul>  \t<li>A hosting service - the platform must be installed in a hosting server. Prices of hosting account vary from 4$-10$ a month. There is a detailed PDF explaining about this in the course. If you are already registered to a hosting company (for example, if you run a website) - you will probably not need to pay this fee as you can usually use your current hosting account to install the program.</li>  \t<li>A developer account - anyone who wants to publish apps must be registered as an Android and/or Apple developer. Android developer account costs 25$ (one time) and Apple developer account costs 99$ (per year). One account lets you publish as many apps as you want and it is not related to the program you create the app with. You can avoid those costs if you get someone else to upload the apps for you - but it's NOT recommended!</li>  </ul>  <p>  \t<strong>You're going to enjoy creating your app!</strong>  </p>  <p>  \t                    After spending months looking for an easy to use, straightforward and inexpensive solution to building a native app, i have found an open source CMS that does exactly what i had hoped for - lets me create an app in a way that is almost as easy as creating a Wordpress website!  </p>  <p>  \t                    As a webmaster and a webdesigner, i've been working with Wordpress for the past 7 years and it's one of the things i most enjoy doing - creating websites. Lately, after realizing this world is getting too crowded and the competition becomes tougher everyday, i decided to dive into the apps world, so i can offer my customers a new service - building an app for them. Unfortunately, i was frustrated with what i found - app building services asked for a high monthly or one-time fee and most of the tools were too complicated to understand for a non-programmer like me. A second before giving up, i found the solution i had been looking for - a system that makes the process of creating an app as easy and fun as creating a website, and is open source and free too.  </p>  <p>  \t<strong>But i don't know how to create a website!</strong>  </p>  <p>  \t                    If you've never built a website before, or have no idea what Wordpress is - no worries as i show you exactly what to do in each step, so this course is great for whoever wants to create an app regardless to any prior experience.  </p>  <p>  \t                    The course will guide you through all the steps you have to take in order to get yourself a native app that people can download from the app stores.  </p>  <p>  \t                    The app you will create can be produced as an Andoid app as well as Apple one. I will show you how to get the app online in the Google Play store (Android) while a documented tutorial of how to get the app in the Apple store is available too (a video showing how to do that will follow soon).  </p>  <p>  \t                    In this course, you will watch me going through all the steps from A to Z, while some of the video lectures will be followed by PDF files for further guidance.  </p>  <p>  \t<strong>Course overview in short</strong>  </p>  <ol>  \t<li>About the app you will create</li>  \t<li>Downloading the app program files (free)</li>  \t<li>Registering to a hosting account (please view the \"additional costs\" lecture which is free to preview)</li>  \t<li>Creating a database</li>  \t<li>Uploading the app program files to your hosting account via a (free) FTP client</li>  \t<li>Installing the program platform</li>  \t<li>Configuring your app</li>  \t<li>Designing your app</li>  \t<li>Adding features to your app</li>  \t<li>Creating APIs</li>  \t<li>Creating the app icon</li>  \t<li>Downloading your app files</li>  \t<li>Previewing your app in your device</li>  \t<li>Registering as a developer (please view the \"additional costs\" lecture which is free to preview)</li>  \t<li>Downloading Android Studio (free)</li>  \t<li>Producing your app file</li>  \t<li>uploading your app file to the stores and publishing your app</li>  \t<li>Sending push notifications</li>  \t<li>Updating your app</li>  \t<li>Creating an app business</li>  \t<li>Summary and thank yous :-)</li>  </ol>  <p>  \t<strong>Enroll today - to see your app in the stores within 8 days from now!</strong>  </p>  <ul>  </ul>", 
    "end_date": null, 
    "title": "Create a Native App For Your Business In 8 Days, No Coding!", 
    "price": "50.00", 
    "instructors": "Maya Bielik", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357160_66d3_5.jpg", 
    "course_url": "https://www.udemy.com/create-a-native-app-in-8-days-easy-as-creating-a-website/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T17:32:58Z"
}