{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Nuestro Curso de Desarrollo de Apps para iOS te enseñará las herramientas necesarias para desarrollar apps para iPhone e iPad en Objective-C, el lenguaje nativo utilizado para desarrollar para iOS. El curso incluye algunos algoritmos y patrones de diseño importantes así como consejos y <em>best practices</em>.</p><p>Al finalizar el curso, serás capaz de reproducir y entender la gran mayoría de funcionalidades de las apps más populares de iOS y profundizar en ellas para hacer tus propias apps. </p><p>Sin duda, la práctica a través de la construcción es una muy buena forma de aprender, por eso durante el curso, los estudiantes realizarán más de 10 apps cubriendo todos los aspectos esenciales del desarrollo de apps para iOS. Cada app que realices mejorará tus habilidades y dispondrás del <strong>código fuente </strong>del instructor para acceder a él, contrastarlo con el tuyo y mejorarlo.</p><p><strong>Qué vas a aprender en este curso</strong></p><ul><li><strong>Objective</strong><strong>-C</strong>: Aprende el lenguaje nativo de desarrollo de apps para iOS y Mac.</li><li><strong>Xcode</strong>: Aprende a manejarte por su interfaz y todos los trucos necesarios para maximizar tu tiempo.</li><li><strong>Cocoa y UIKit:</strong> Conoce a fondo los frameworks básicos de desarrollo de apps, tanto a nivel lógico, funcional como a nivel visual.</li><li><strong>iOS9 y XCode 7</strong>: Utiliza la última tecnología disponible de la mano de Apple.</li><li><strong>Diseño de interfaces</strong>: todos los elementos de la vista necesarios para configurar tu app: UIButton, UILabel, UITextField, UIPickerView, UISlider, UIViewController...</li><li><strong>Storyboard y diseño responsive</strong>: Aprende a crear impresionantes interfaces utilizando el Interface Builder a nivel gráfico de Apple. Arrastra los elementos por la pantalla y crea apps para todos los dispositivos de Apple</li><li><strong>Programación</strong> <strong>básica</strong>: aprende programación desde cero, variables, bucles, condicionales, hilos...</li><li><strong>Programación avanzada</strong>: patrones de programación MVC, de fachada, de factoría, delegación, NSNotificationCenter, bloques de código como parámetro, completion handlers...</li><li><strong>Repositorio Bitbucket</strong>: Aprende a utilizar el control de versiones Git de Bitbucket para colaborar de forma productiva en un pequeño equipo o entre varios ordenadores.</li><li><strong>Uso de tablas y colecciones</strong>: UITableViewController (como Facebook, Contactos o WhatsApp) y UICollectionViewController (como la propia app de Fotos) son las dos formas más estandarizadas de mostrar una colección de elementos en pantalla directamente sin casi necesidad de programar vistas. Además veremos como personalizar las celdas de tablas y colecciones.</li><li><strong>Navegación entre diferentes pantallas</strong>: aprende a crear decenas de vistas conectadas entre ellas a través de un menú de navegación gracias a UINavigationController. </li><li><strong>Uso de ficheros</strong>: utilizar las property lists, XML, JSON para almacenamiento y uso de la información en nuestra app separando así datos de la programación en código.</li><li><strong>Bases de datos locales con CoreData</strong>: almacenamiento de datos utilizando XCDataModels y obteniendo resultados con NSFetchResultsController</li><li><strong>Cloud computing y uso de Parse</strong>: utiliza un servidor gratuito en la nube como es Parse para guardar, almacenar, consultar, modificar y eliminar información en tiempo real sin necesidad de subir una nueva app a la App Store. </li><li><strong>30 días con 100% garantía de devolución</strong>: si no quedas satisfecho, tienes 30 días para reclamar la devolución de tu pago sin ningún problema.</li></ul><p><br></p><p><strong>Las opiniones de los estudiantes hablan por si solas - 5 estrellas de valoración</strong><br></p><ul><li><em><strong>Raziel Tovar - Excelente curso! </strong></em>Me parece que Juan sabe como explicar de forma muy sencilla lo que antes me parecía muy complejo. Lo recomiendo bastante!</li><li><span></span><em><strong>María del Mar Cardona - Lo que yo buscaba! </strong></em>Un curso fabuloso, especialmente para mí que aunque sé algo de java me hacía mucha ilusión adentrarme en la programación para iOS que sin duda es muy atractiva! Lo recomiendo al 100% a toda la gente que quiera aprender a hacer apps.</li><li><span></span><strong><em><strong>Miguel Ángel Ferri - E</strong>xcelente curso para empezar a desarrollar tu app desde cero </em></strong>Tengo muchos años de experiencia en el desarrollo de juegos y aplicaciones web y escritorio, elegí este curso para introducirme en el desarrollo de aplicaciones para IOS y me ha parecido muy bien explicado, con un lenguaje fácil y comprensible para cualquier persona. En definitiva 100% recomendable para toda aquella persona, con o sin experiencia, que quiera empezar a desarrollar para IOS.</li></ul><p><br></p><p><strong>Apúntate ahora </strong>y únete a más de 2.000 alumnos en este Curso de Desarrollo de Apps.  </p>", 
    "end_date": null, 
    "title": "Curso completo de apps para iOS 9: aprende desde cero", 
    "price": "50.00", 
    "instructors": "D. Juan Gabriel Gomila Salas", 
    "commitment": "28.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560436_d7d8_3.jpg", 
    "course_url": "https://www.udemy.com/curso-de-desarrollo-de-apps-para-ios-9/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T12:58:43Z"
}