{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">** O curso mais completo de desenvolvimento iOS9 - com Xcode 7 e Swift 2 **</p><p style=\"\">Pensando em montar um App ou dar uma turbinada nos seus conhecimentos sobre desenvolvimento iOS?</p><p style=\"\">Prepare-se para ser um desenvolvedor iOS de verdade!</p><p style=\"\">Com o meu novo Curso Completo do Desenvolvedor iOS, em apenas 6 semanas você já estará construindo aplicativos de verdade no novo Xcode, o mais moderno, completo, amigável e atual software de desenvolvimento da Apple.</p><p style=\"\">Nunca foi tão fácil criar App de altíssima qualidade, graças ao novo <strong style=\"\">Xcode 7</strong> e o <strong style=\"\">Swift 2</strong>.</p><p style=\"\"><strong style=\"\">Divertido, Rápido e Efetivo</strong></p><p style=\"\">Cada vez mais pessoas estão escolhendo trabalhar com o desenvolvimento de aplicativos. Seja para construir sua carreira nessa área, apenas ter uma fonte de renda adicional ou apenas por hobby.</p><p style=\"\">Este curso já ajudou milhares de pessoas a começarem a construir seus próprios Apps rentáveis.</p><p style=\"\"><strong style=\"\">O que você pode esperar:</strong></p><p style=\"\">O Curso Completo do Desenvolvedor iOS é o mais completo, amigável e compreensivo curso que você encontrará online, ou devolvemos seu dinheiro.</p><p style=\"\">Não poderia ser mais fácil. Mesmo que você não tenha nenhum conhecimento de programação e esteja começando do zero, em apenas 6 semanas você já estará construindo aplicativos de verdade.</p><p style=\"\">Você já sabe programar? Fantástico! Agora você pode dar uma turbinada nos seus conhecimentos para construir apps ainda melhores, complexos e rentáveis.</p><p style=\"\"><strong style=\"\">Siga as etapas do curso ou vá no seu próprio ritmo</strong></p><p style=\"\">Ao adquirir o curso você tem acesso a mais de 100 aulas e mais de 28 horas de conteúdo prático e orientado à projetos reais, todos de fácil entendimento.</p><p style=\"\">Você vai aprender rápido e de maneira divertida. O curso foi estruturado usando técnicas de ensino que permitem o rápido desenvolvimento com alta memorização do conteúdo. Sem blá, blá, blá, apenas conteúdos práticos - direto ao ponto.</p><p style=\"\"><strong style=\"\">Apps complexos</strong></p><p style=\"\">Se o que você procura é curso de verdade, completo que te ensinará a construir apps complexos e sensacionais como os que fazem sucesso na atualidade, esse é co urso certo!</p><p style=\"\">Comece a construir aplicativos realmente complexo e ganhe muito dinheiro desenvolvendo apps fantásticos.</p><p style=\"\"><strong style=\"\">Não acredita? Oferecemos uma garantia de satisfação ou o seu dinheiro de volta, desde que você solicite dentro de 30 dias da compra.</strong></p><p style=\"\">Você está pronto ser um super desenvolvedor iOS? Quer mais confiança para encarar o desenvolvimento de apps complexos? Essa é a hora!</p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Curso Completo do Desenvolvedor iOS 9 - Crie 18 Apps", 
    "price": "50.00", 
    "instructors": "Mirago Marketing Digital, Denis Antoniazzi Tierno, Rob Percival", 
    "commitment": "28.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/583882_6c28.jpg", 
    "course_url": "https://www.udemy.com/curso-completo-desenvolvedor-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-15T16:05:52Z"
}