{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Wordpress Blog als native App - <strong>UPDATE 2015-Nov - Intel XDK Update</strong> - wichtig! Alle Infos dazu im Kursabschnitt Update November 2015.</p><p>  \t  Mein Blog ist bei GooglePlay! Und Dein Blog?<br>  </p>  <p>  \t  Der Google Play Store eröffnet Dir neue Leser für Deinen Blog. <strong>Wir erstellen gemeinsam mit kostenlosen Tools eine native App für Android für Deinen Wordpress Blog. </strong>Doch nicht nur das, wir suchen und bearbeiten die passenden Bilder und Icons, erstellen ein Android Developer Konto, veröffentlichen die App bei Google Play und geben Dir ein paar <strong>Tipps für das Ranking in Google Play</strong>.  </p>  <p>  \t      Wir bearbeiten jeden Schritt und egal ob Du Deinen Blog (oder Deine Website) mit dem CMS von Wordpress oder einem anderen System (<strong>Drupal, Joomla</strong>) führst, Du kannst jede mobile optimierte Webpräsenz (responsive Design) mit dem von uns vorgestelltem Tool in eine native App umwandeln. Damit kannst Du auch Deine Business Website bei Google Play präsentieren und neue Interessenten generieren.  </p>  <p>  \t          Warum Android und nicht iOS oder Windows? Android Betriebssysteme dominieren den Markt für Smartphone mit einem Marktanteil von annähernd 80%! Das Procedere zur Veröffentlichung von Apps ist bei Google Play auch einfacher als bei Apple. Wir werden aber das Thema iOS im Januar 2015 behandeln und hier als Bonus einstellen.  </p>  <p>  \t<strong>Warum sollte Dein Blog in den App Store von Google?</strong>  </p>  <p>  \t<strong>Mit Deiner Blog App im App Store wird sich die Reichweite Deines Blogs schlagartig und spürbar erhöhen. Du wirst neue Leser generieren und wenn Du Deinen Blog vermarktest auch mehr Umsatz erzielen können.</strong>  </p>  <p>  \t          Im Bonus Bereich findest Du ab Januar 2015 weitere Videos rund um die Intel XDK und um das App Marketing (<strong>passives Einkommen mit Informations-Apps</strong>). Sichere Dir heute den Eintritt in dieses interessante Thema. Der Preis für den Kurs wird sich ab Januar mit Veröffentlichung von 10 weiteren Videos zum Thema App Design mit dem Intel XDK erhöhen.  </p>  <p>  \t<strong>Dein Wordpress, Joomla, Drupal, Tumblr, Blog im App Store von Google Play</strong>, neue Leser, mehr Reichweite, mehr Einkommen, starte jetzt!  </p>", 
    "end_date": null, 
    "title": "Dein Wordpress Blog als native App im Google Play Store", 
    "price": "45.00", 
    "instructors": "Rene Holz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339984_f9a6_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-blog-wird-native-app-im-google-play-store/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T17:48:28Z"
}