{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>*************************************Öğrencilere indirim uygulamaktayım. İndirimden yararlanmak için benimle iletişime gecebilirsiniz.</em></strong></p><p>  \t<strong>  Programlama dilleri arasında Delphi çok önemli bir yere sahipken 2000 yılından sonra kullanıcı kitlesinde kayıplar yaşamaya başlamıştı. Fakat Delphi XE2 sürümü ile birlikte gelen mobil desteği sayesinde ayakta kalmayı başarmış ve gelecekte şimdikinden çok daha iyi bir yerde olacaktır. Mobil programlamanın önemli olduğu bir dönemde Delphi programcıların bu ihtiyacını çok estetik ve kullanışlı bir şekilde gidermiştir. Yani Delphi ile yazdığınız uygulamaları Windows, MacOS, IOS ve Android platformlarına göre derleyebilir ve bu işletim sistemlerinde kolaylıkla çalıştırabilirsiniz.  </strong>  </p>  <p>  \t          Bu kurs tamamen mobil programlama ile ilgilidir. Android ve IOS işletim sistemine sahip mobil cihazlarda çalıştırmak üzere mobil yazılımların nasıl yapıldığı hakkında detaylı bilgiler içermektedir.  </p>  <p>  \t          Mobil programlama eğitimi Delphi kullanılarak anlatılmaktadır. Bu kursu alan kişilerin hiç bir şekilde mobil programlama bilgisine sahip olmadıkları varsayılarak her bir adım sade ve anlaşılır olması için yavaş bir şekilde anlatılmıştır.  </p>  <p>  \t          Kursta yer alan videolarda yapılan ufak veya büyük uygulamaların bir çoğu materyal olarak her bir dersin içerisine yerleştirilmiştir. Bunların yanı sıra bazı ek kaynaklar hazırlanarak derse ek olarak ilave edilmiştir.  </p>  <p>  \t          Kurs 68 dersten oluşmakta ve mobil programlama hakkında hiç bir bilgiye sahip olmayan bir kişinin bu kursu 3 haftada bitirebileceği tahmin edilmektedir. Kurs içerisinde gereksiz konu veya modüllere yer verilmemiştir önemli olan yerler ise gerekli yerlerde vurgulanarak öğrencilerin derse odaklanması amaçlanmaktadır.  </p>  <p>  \t          Kurs içerisinde yer alan dersler mobil programlama hakkında hiç bir bilgiye sahip olmayan kişilerin zorlanmadan öğrenmeleri, az bilgiye sahip olan kişilerin ise temel seviyedeki bilgileri daha iyi öğrenerek Delphi içerisinde her bir modülün nasıl daha etkili kullanabileceği hakkında örneklere ve anlatımlara yer verilmiştir. Bir konuyu veya dersi öğrenirken temelin iyi atılmasının kişinin ilerleyen konularda daha rahat etmesini ve kendisini daha çok geliştirmesini bir eğitimci olarak çok iyi bilmekteyim. Bu açıdan bu kurs içerisindeki derslerin anlatımı çok sade yavaş bir şekilde olmaktadır. Dersler ilerledikçe anlatım biraz hızlanmakta ve keyifli bir hale gelmektedir. Bu eğitimdeki dersleri pekiştirmek için videoları tekrar tekrar izlemenize gerek kalmayacaktır. Çünkü her konuda anlatım içerisinde özet, adım adım konu anlatımı ve pekiştirmek için örnekler mevcuttur.  </p>  <p>  \t<strong>      Bu eğitim sonunda kendi uygulama ve oyunlarınızı geliştirerek bunları google play ve app store'a yükleyerek para kazanabilirsiniz. Bütün bunlar için gerekli bütün bilgileri bu eğtimde bulabileceksiniz.  </strong>  </p>  <p>  \t                Bu kurs Delphi programlama dilini kullanarak istediğiniz IOS, Android ve Windows için istediğiniz uygulamaları geliştirmeniz için gerekli bilgileri içermektedir. Anlatım başlarda yani tanıtım kısmında sıkıcı olabilir fakat ilerleyen dersler ile keyifli bir hal almakta.  </p>", 
    "end_date": null, 
    "title": "Delphi ile Android ve IOS Programlama 1", 
    "price": "20.00", 
    "instructors": "Özgen İmrağ", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294926_8153_4.jpg", 
    "course_url": "https://www.udemy.com/delphi-ile-android-ve-ios-programlama-1/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T21:35:59Z"
}