{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>***Öğrencilere indirim uygulamaktayım. İndirimden yararlanmak için benimle iletişime gecebilirsiniz.</em></strong></p><p><strong><em></em></strong>Programlama dilleri arasında Delphi çok önemli bir yere sahipken 2000 yılından sonra kullanıcı kitlesinde kayıplar yaşamaya başlamıştı. Fakat Delphi XE2 sürümü ile birlikte gelen mobil desteği sayesinde ayakta kalmayı başarmış ve gelecekte şimdikinden çok daha iyi bir yerde olacaktır. Mobil programlamanın önemli olduğu bir dönemde Delphi programcıların bu ihtiyacını çok estetik ve kullanışlı bir şekilde gidermiştir. Yani Delphi ile yazdığınız uygulamaları Windows, MacOS, IOS ve Android platformlarına göre derleyebilir ve bu işletim sistemlerinde kolaylıkla çalıştırabilirsiniz.  </p>  <p>  \t  Bu kurs tamamen mobil programlama ile ilgilidir. Android ve IOS işletim sistemine sahip mobil cihazlarda çalıştırmak üzere mobil yazılımların nasıl yapıldığı hakkında detaylı ve ileri seviye bilgiler içermektedir.  </p>  <p>  \tBu eğitimde konular hem görsel hem de işitsel açıdan takip edenleri beslemek için vurgulanması gereken yerlerde görsel efektler içeren videolar ile kolaylıkla öğreneceğiniz bir yapıdadır.  </p>  <p>  \t  Bu eğitim seti sonunda Delphi ile ister oyun isterseniz çeşitli uygulamalar geliştirebilirsiniz. Sıradanlıktan kurtulmak için Delphi'nin bizlere sunduğu yeteneklerden bir tanesi de 3D uygulamalar geliştirebilmektir. Özellikle 3D uygulamaların ne kadar dikkat çekeceğini tahmin edebilirsiniz.  </p>  <p>  \t  Eğitim seti içeriği de sıradan bir eğitim setinden uzak bir yapıdadır. Bir konuyu dallandırıp budaklandırıp hep aynı şeyleri anlatmak yerine çeşitli konulara değinerek hem bakış açınızı genişletmek hem de Delphi'nin yeteneklerini daha iyi sunabilmektedir.  </p>  <p>  \t  Hazırlamış ve hala hazırlamakta olduğum Delphi eğitim setlerindeki birinci amacım Delphi'nin hakettiği popülariteyi tekrar sağlayabilmektir. Çünkü Delphi ile yapılabilecek olan uygulama ve modüller göz önünde bulundurulduğunda ve diğer dillere kıyasla bu yeteneklerini daha estetik bir şekilde sunması ile bunları fazlasıyla hakettiğini düşünüyorum.  </p>    <p>  \t<strong>Bu eğitim sonunda kendi uygulama ve oyunlarınızı geliştirerek bunları google play ve app store'a yükleyerek para kazanabilirsiniz. Bütün bunlar için gerekli bütün bilgileri bu eğtimde bulabileceksiniz.</strong>  </p>", 
    "end_date": null, 
    "title": "Delphi ile Android ve IOS Programlama 2 (İleri Seviye)", 
    "price": "35.00", 
    "instructors": "Özgen İmrağ", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416396_618b_5.jpg", 
    "course_url": "https://www.udemy.com/delphi-ile-android-ve-ios-programlama-2-ileri-seviye/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T10:25:17Z"
}