{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong>LEARN TO MAKE REAL LIFE IOS 9 CUSTOM KEYBOARDS</strong></p><p style=\"\"><strong>DEVELOP ANY KEYBOARD YOU IMAGINE</strong></p><p style=\"\">Ever wanted to learn how to make a custom iOS 9 keyboard? This course will teach you everything there is to know about making any custom iOS keyboard. Whether you want to build a gif keyboard or make a custom keyboard that you can use personally, this course will teach you everything you need to know.</p><p style=\"\"><strong>Learn how to develop marketable keyboards you can sell on the iTunes App Store, and make constant revenue!</strong></p><p style=\"\"><strong>Keyboard's you will develop:</strong></p><ul><li>Basic one button keyboard - learn the basics of developing any keyboard</li><li>Calculator keyboard</li><li>Clone the stock iOS keyboard</li><li>Quotes keyboard</li></ul><p style=\"\">We will cover many important topics that correlate with the development of iOS keyboards. First we will setup Xcode 7 and create a custom keyboard that has a simple action. Then, later on in the course we will begin developing more complex keyboards.</p><p style=\"\">If you know the basics of Swift iOS Development that's awesome! If not, don't worry, with the purchase of this course, you get access to all videos and are able to watch and learn at your own pace.</p><p style=\"\"><strong>So what are you waiting for! Join my course today and learn to build your first custom iOS keyboard!!!</strong></p><p style=\"\"><strong>Certificate of Completion - </strong>All Students who complete this course will receive a Free digital certificate of completion from Udemy.</p><p style=\"\"><span style=\"\"></span><strong>Money Back Guaranteed - </strong><strong>If in any way you are not satisfied with my course, feel free to request a refund!</strong></p><ul></ul>", 
    "end_date": null, 
    "title": "Develop a Custom Keyboard in iOS 9 & Swift 2 - 4 Keyboards!", 
    "price": "20.00", 
    "instructors": "Stefan DeClerck", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589706_1a52_3.jpg", 
    "course_url": "https://www.udemy.com/keyboards/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T18:32:37Z"
}