{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">This course will teach you how to develop iPhone and iPad apps with zero programming experience.</strong></p>    <p style=\"\">My name is Benny Hsu and I had an idea for an app back in 2011, but didn&#039;t know any programming. I tried to learn from books and courses but found it way too hard. I didn&#039;t have years and the patience to learn how.&nbsp;</p>    <p style=\"\"><strong style=\"\">Then I discovered outsourcing. </strong>I thought outsourcing was for simple tasks only. You know - make reservations, update calendar, maybe book some airplane tickets. It turns out - there is a lot more to it. This was the answer to how I could get my idea developed amazingly fast, without spending hours and hours learning new skills and technologies. </p><p style=\"\"></p><p style=\"\"><strong style=\"\">Outsourcing was my ticket to make it happen, but I still I had a lot of concerns:</strong></p><ul style=\"\"><li style=\"\">Where do I look?</li><li style=\"\">How do I convey my idea?</li><li style=\"\">How to hire?</li><li style=\"\">How can I make sure I don&#039;t get ripped off?</li><li style=\"\">How much will it cost?&nbsp;</li><li style=\"\">And more...</li></ul><p style=\"\"></p><p style=\"\">So I learned as much as I could about this business to just get started. I would learn the rest along the way.</p><p style=\"\">I finally got started in 2011 with my first app, Photo 365. When it was released in August 2011, it had earned me $33,997.77 in 30 days. </p><p style=\"\">Apple featured it as New and Noteworthy two weeks after I launched. A week later, Apple named it ‘App of the Week’. Unbelievable! </p><p style=\"\">Usually apps that get selected are from companies with employees and startup funding. Apple probably didn&#039;t know I was just a guy, with no experience, who outsourced his work overseas. </p><p style=\"\">If it wasn&#039;t for outsourcing and the process I created, this would have never happened. </p>Now I have three more apps (see my bio) and am developing more.&nbsp;<br style=\"\"><p style=\"\"></p>    <p style=\"\"><strong style=\"\">I still have no idea how to program.</strong> I couldn&#039;t write a single line of code to save my life. I don&#039;t even know how to upload my apps. I&#039;m not technical at all.&nbsp;</p>    <p style=\"\"><strong style=\"\">I&#039;m just a regular guy who hated my job and wanted to find a way to make money that I actually enjoyed.&nbsp;</strong></p>    <p style=\"\">What about you?</p>    <p style=\"\"></p><p style=\"\"><strong style=\"\">Have you dreamed about developing an iPhone app, but don’t know how? I can teach you.</strong></p><p style=\"\">Building my first app has changed my life. I used the same framework again and again to create my other apps, and I’ll keep on using it. I want to give you this framework, so you can start creating your very first app.&nbsp;</p><p style=\"\">I know that’s what I needed two years ago when I was looking for answers. </p><strong style=\"\">I have step-by-step videos that will teach you my proven framework for developing a winning app idea, where to hire, what to look for, how to conduct interviews, hiring the best team, and getting your app looking good in the App store.</strong><br style=\"\"><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\">When I began creating apps, I learned a lot! I&#039;ve made costly mistakes, but I have learned from them. I&#039;m made adjustments and have fine tuned the process. I want to make sure you don&#039;t make the same mistakes and don’t have to go through such a steep learning curve.</p><p style=\"\">You will get answers to all of these common questions:</p><ul style=\"\"><li style=\"\"><p style=\"\">I have an idea, but what should I do if it’s been done already?</p></li><li style=\"\"><p style=\"\">How can I make sure I don’t get ripped off when I hire people?</p></li><li style=\"\"><p style=\"\">How can I protect my idea?</p></li><li style=\"\"><p style=\"\">Will this cost a lot of money?</p></li><li style=\"\"><p style=\"\">I have an idea for an app, but don’t know what the next steps are.</p></li><li style=\"\"><p style=\"\">How can I make money from apps?</p></li><li style=\"\"><p style=\"\">I’m not technical so I can’t do this.</p></li><li style=\"\"><p style=\"\">I’m really bad with graphics and don’t know how to make it pretty. </p></li><li style=\"\"><p style=\"\">And more...</p></li></ul><p style=\"\">All are good questions, but none of the above can stop you from achieving your goal if you follow my framework.</p><strong style=\"\">Are you ready? Let&#039;s do it!!</strong><br style=\"\"><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p><p style=\"\"></p>  <p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Develop iPhone and iPad apps with no programming experience", 
    "price": "25.00", 
    "instructors": "Benny  Hsu", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48114_b061_6.jpg", 
    "course_url": "https://www.udemy.com/develop-iphone-and-ipad-apps-with-no-programming-experience/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-01T13:04:05Z"
}