{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    ### Update on dec 27th with two new apps; more are on the way.  </p>  <p>  \t    ### A new section called Livecode cookbook is coming very early next year: there you will find a set of recipes to solve everyday programming problems that don&#039;t require a full sample app but still can create non trivial challenges to your everyday livecoding. If you have any particular topic that you would like to see in this section just get in touch: we&#039;ll see if it can be covered !  </p>  <p>  \t    ________________________________________________________________________  </p>  <p>  \t                                    This course will teach you how to <strong style=\"\">develop apps for iOS and Android</strong> using Livecode.  </p>  <ul style=\"\">  \t<li>Learn app development for iOS and Android using Livecode&#039;s natural language</li>  \t<li>Learn how to download and set up Livecode&#039;s free version</li>  \t<li>Create a fast and efficient Android device simulator that really works</li>  \t<li>Learn how to adapt your apps to any screen resolution with just 1 line command</li>  \t<li>6 complete apps built step by step and fully explained</li>  \t<li>Develop apps for iOS and Android in 1/10th of the time needed using traditional SDKs</li>  </ul>  <p>  \t              These are the main benefits of developing apps with Livecode:  </p>  <ul style=\"\">  \t<li>Easy-to-use English-like programming language; accessible to anybody</li>  \t<li>Code once and deliver on iOS and Android</li>  \t<li>Apps can be adapted to any screen size with one command</li>  \t<li>Development time is a fraction compared to traditional SDKs</li>  \t<li>Apps are not slow html: they are fast and native compiled apps</li>  \t<li>Free Livecode version is available for learning</li>  </ul>  <p>  \t                                    Livecode is a <strong style=\"\">unique</strong> platform that allows to develop apps for Mac, Windows, Linux, iOS and Android using a very simple, yet sophisticated, programming language: English. By learning <strong style=\"\">one language</strong> you will be able to develop apps for <strong style=\"\">all the major operating systems</strong> and devices on the market, hence the motto &quot;one language to rule them all&quot;. However, this course is focused on developing apps for mobile devices  </p>  <p>  \t<strong style=\"\">    Forget Java or Objective-C&#039;s intricacies</strong>: Livecode&#039;s programming language has been designed to be as close as possible to the English language. For example to display the word &quot;hello&quot; on screen you would write <em style=\"\"><strong style=\"\">put &quot;hello&quot; into field &quot;display&quot;</strong></em>. We have computers that recognize fingerprints and human voice, so why shouldn&#039;t we be able to create apps using our natural language ?  </p>  <p>  \t                  Apps developed with Livecode can <strong style=\"\">automatically adapt to any screen size</strong> and rescale with just one line command: this alone is huge bonus for mobile developers who are often confronted with a plethora of screen sizes and proportion.  </p>  <p>  \t                              Actually Livecode is a <strong style=\"\">fully integrated development environment</strong> (IDE) that contains all the tools you need to develop professional apps in a <strong style=\"\">fraction</strong> of the time that would normally be required using traditional programming languages and SDKs.  </p>  <p>  \t<strong style=\"\">            No previous programming experience is required</strong>, the course starts from the very beginning and takes you till the development of real apps that can be tested on software simulators or installed on physical devices.  </p>  <p>  \t                            The course will lead you through the <strong style=\"\">development of 6 real apps</strong> for Android and iOS devices. At the moment you can see only Finger Catch in the curricilum, but the other ones will come by the end of November (Currency Conversion, Tic Tac Toe, RSS Reader, Countdown Timer, Tripmaster and Portable Movie Player); just Udemy dosn&#039;t allow sections with &quot;upcoming&quot; lectures so I had to remove them from the curriculum.  </p>  <p>  \t                            Also, you will learn how to set up a working and <strong style=\"\">efficient Android device simulator</strong> that really works for testing (if anybody tried to use Google&#039;s simulator you know what the issues are). This simulator will work smoothly also with other development tools, not just Livecode and could be worth the course by itself !  </p>  <p>  \t<strong style=\"\">    One more thing</strong>: Livecode and the simulator can be downloaded for <strong style=\"\">free</strong>, so you can learn and save money. You&#039;ll need Livecode&#039;s paying version only later, if you wish to lock and compile your apps for App Store distribution.  </p>  <p>  \t                            If you&#039;re still uncertain and want to have a peek at Livecode&#039;s possibilities before enrolling this course you can enroll my free <strong style=\"\">Livecode entry-level course</strong>; you&#039;ll create a clone of the Flappy Bird game in less than the duration of a football match !  </p>  <p>  \t              Finally, with your support and feedback this course will have the chance to be extended and cover the most advanced Livecode features like sql databases and Cocoa interaction. Once you enroll the course it&#039;s yours forever, so you&#039;ll have access also to every new topic at no additional cost.  </p>  <p>  \t        Yes, app development can bring you additional income but can also be fun !  </p>", 
    "end_date": null, 
    "title": "Develop professional apps for Android and iOS using Livecode", 
    "price": "30.00", 
    "instructors": "Fulvio Massini", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314470_eaef_3.jpg", 
    "course_url": "https://www.udemy.com/livecodemobile/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T17:52:45Z"
}