{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>When it comes to cross-platform development you may be well versed with </span><strong style=\"\">HTML5, JavaScript and CSS3 </strong><span>but you don’t have the necessary tools to be able to successfully develop a mobile app due to lack of a proper framework or IDE perhaps. But, it is all about to change now. With </span><strong style=\"\">Intel XDK </strong><span>you get a very </span><strong style=\"\">integrated approach towards cross-platform application development </strong><span>using a variety of device specific API’s. Now you can directly emulate virtual devices to get a look and feel of your application while being able to emulate crucial device frameworks like the accelerometer, compass, geolocation, etc. You are then provided with very simple tools that make debugging and performance testing your application much easier.</span>  </p>  <p>  \tFinally, you can easily build your application for a variety of devices like <strong style=\"\">iOS devices </strong>for iPhone and iPad,<strong style=\"\">Android devices </strong>and also for <strong style=\"\">Windows Phone devices </strong>using a very simply step by step approach. This framework makes programming a fun and easy experience while maintaining all the standards.  </p>  <p>  \tThis course includes the following:  </p>  <ul style=\"\">  \t<p>  \t\t·Introduction &amp; Setup  \t</p>  \t<p>  \t\t·Integrating your application and using sample API’s  \t</p>  \t<p>  \t\t·Building &amp; Deployment to Various Platforms  \t</p>  </ul>  <p>  \tSo, if you want to learn from the very best instructors, save a lot of time and plough your way into application development, while ensuring a presence and stability across every available platform, sign-up now and pave your way to success  </p>", 
    "end_date": null, 
    "title": "Develop a Cross-platform Mobile App using Intel XDK", 
    "price": "20.00", 
    "instructors": "Yoda Learning", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280846_97dc_2.jpg", 
    "course_url": "https://www.udemy.com/cross-platform-mobile-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-14T10:17:28Z"
}