{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>After working for so many years, i must admit that developing native Android App is not easy. And it is even more difficult for the newbies. They not only have to know about programming concept, but at the same time they must be fully aware of the Android OS architecture.. For example, they must know how they should handle the situation when the screen rotates from landscape to portrait view or the vice versa. Similarly they must know how to handle different screen sizes of Android phones. Keeping all these things in mind i have developed this training course so that the newbies can get enough confidence to get their hands dirty to develop their first native Android app. In this series of lectures, the students not only know about how to develop a simple Unit Converter app, but also how to apply the concept of design pattern to design the App. However, this training course assumes that the students are already familiar with Android Studio, they have developed a simple helloworld application and they are a bit familiar with Android Layouts and such basic things of Android. If someone is absolutely new to Android and Android Studio, I would like to request him to first go through the section 2 - Supplement (Lecture 6 &amp; 7) which will make him familiar with the basics of Android. However, in the section 2, Introduction to Android (lecture 6 &amp; 7), i have briefly discussed about some of the internals of Android like Binder Framework, tweaking of Linux kernel, Dalvik Virtual Machine etc. Hence this part may be useful for experienced programmers as well. So again welcome and i hope you will enjoy this training course....</p>", 
    "end_date": null, 
    "title": "Developing an Unit Converter App on Android", 
    "price": 0, 
    "instructors": "Somenath Mukhopadhyay", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802870_67a4_2.jpg", 
    "course_url": "https://www.udemy.com/som-itsolutions-unitconverter/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T13:18:09Z"
}