{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Join the digital publishing world!</strong> Its easy and cost effective with this course. This course will teach you how to publish a digital newsstand magazine that you will then make money from. No advanced technical skills required. Infact there will be minimal technical work done. If you can copy and paste then you can publish a digital magazine.<br></p><p><strong>Make money from apps-Specifically from a digital newsstand magazine app:</strong></p><p>Without a list . . .<br>Without writing sales copy . . .<br>Without pumping out videos constantly . . .<br>Without PPC<br>Without SEO<br></p><p><strong>Why Digital Newsstand Magazine Apps?</strong><br>1. Huge Market - Over 300 million tablets in the Market!<br>2. Super Low Competition - Less than 10,000 magazine apps in iTunes Appstore!<br>3. Recurring Income - Readers are Paying You Monthly!<br>4. Super Low Chargeback!<br>5. Instant Results!</p><p><strong>What am I going to get from this course?</strong></p><ul><li>Over 12 detailed lectures. Nothing is left out. </li><li>10 ways to make money with your digital magazine</li><li>Learn How To Create Newsstand Magazine Apps Without Technical Skills</li><li>Where and how to get content for your digital newsstand magazine.</li><li>How to compile content for your magazine?</li><li>How to add images and your affiliate ad links. Where to get ad images and affiliate ad links. </li><li>Learn How To Create Developer Account</li><li>Learn How To Make in-App Purchases For Your App</li><li>Learn How To Create New Issues For Your Magazine (Coming Soon)</li><li>Learn How To Add Interactive Elements For Your Newsstand App</li><li>Learn How To Publish Your App To Google Play Store</li><li>Learn How To Market Your Newsstand App And More.</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Digital Publishing: Learn To Create Newsstand Magazine App", 
    "price": "40.00", 
    "instructors": "Jack Kogera", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/740520_69b8.jpg", 
    "course_url": "https://www.udemy.com/digital-publishing-learn-to-create-newsstand-magazine-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T02:48:06Z"
}