{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tLearn to develop iOS Apps in only 1 hour <strong style=\"\"><strong style=\"\">with absolutely no coding, design, or development skills necessary.</strong></strong>  </p>  <p class=\"PIN_1373135521985_hazClick\" style=\"\">  \t<br style=\"\">  \t    Have you ever wanted to make your own iPhone apps, but have no idea where to start? Either you don&#039;t have the time, the computer know-how, or simply just don&#039;t have any idea what the next step would even look like to make it a reality?<br style=\"\">  \t<br style=\"\">  \t    My name is Sam Knox. I&#039;m a designer and app developer,  and I want to teach you how to build and distribute your very own iOS apps <strong style=\"\"><strong style=\"\">without any coding, design, or development skills whatsoever. </strong></strong>All you&#039;ll need to participate, are your great ideas. <br style=\"\">  \t<br style=\"\">  \t    DO IT YOURSELF APP CLASS consists of 12 short easy to follow step-by-step video based lectures. In only about 1 hour 1/2,  you will learn all the essential tools and knowledge necessary to transform your great ideas into realized iOS applications for iPhones, iPads, and iPod devices, that the whole world can enjoy.<br style=\"\">  \t<br style=\"\">  \t    What you can expect to learn:<br style=\"\">  \t<br style=\"\">  \t       •   Why app development is such an essential modern day skill. <br style=\"\">  \t       •   How to get up and running immediately with the Apple Developer Program and iTunes Connect (the launch pad for all iOS apps). <br style=\"\">  \t       •   How to find fantastic and profitable app ideas.<br style=\"\">  \t       •   How to design and build your app (without any artistic skills or technical knowledge). <br style=\"\">  \t       •   An introduction to freelancing, and a step-by-step guide to Elance.<br style=\"\">  \t       •   How to hire a freelancer, and how to work with them throughout the app building process. <br style=\"\">  \t       •   How to submit your app to the itunes app store, and what to expect along the way.<br style=\"\">  \t       •   How to effectively promote, market, and price your app.<br style=\"\">  \t       •   Long term app maintenance. <br style=\"\">  \t<br style=\"\">  \t    The course also provides additional guides and eBooks as a bonus, including &quot;75 Ways To Promote Your App,&quot; the essential app promotion and marketing tool, that includes links tips and tricks to effective app promotion,  and important site checklists so you can get to work immediately.  <br style=\"\">  \t<br style=\"\">  \t    Upon completion of this course, you will immediately be able to design, develop, distribute, market, and maintain your very own iPhone, iPad, and iPod apps.  </p>  <p class=\"PIN_1373135521985_hazClick\" style=\"\">  </p>  <p class=\"PIN_1373135521985_hazClick\" style=\"\">  </p>  <p class=\"PIN_1373135521985_hazClick\" style=\"\">  \t    DISCLAIMER:<br style=\"\">  \t<br style=\"\">  \t<em style=\"\">The information contained in this course is for informational purposes only. Users of this course are advised to do their own due diligence when it comes to making business decisions and all information, products, services that have been provided should be independently verified by your own qualified professionals. By taking this course and utilizing its respective guides, you agree that the author is not responsible for the success or failure of your business decisions relating to any information presented.<br style=\"\">  \t<br style=\"\">  \t    The material in this course may include information, products or services by third parties. Third Party Materials comprise of the products and opinions expressed by their owners. As such, we assume no responsibility or liability for any Third Party material, opinions, or actions.<br style=\"\">  \t<br style=\"\">  \t    The publication of such Third Party Materials does not constitute any guarantee of any information, instruction, opinion, products,  or services contained within the Third Party Material. The use of recommended Third Party Material does not guarantee any success and or earnings related to you or your business. Publication of such Third Party Material is simply a recommendation and an expression of opinion of that material.<br style=\"\">  \t<br style=\"\">  \t    No part of this course or guides included within the course  shall be reproduced, transmitted, or sold in whole or in part in any form, without the prior written consent of the author. All trademarks and registered trademarks appearing in this course and guide are the property of their respective owners.</em>  </p>", 
    "end_date": null, 
    "title": "Do It Yourself App Class (iOS) With No Skills Necessary", 
    "price": "20.00", 
    "instructors": "Sam Knox", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50239_ef87_7.jpg", 
    "course_url": "https://www.udemy.com/develop-ios-apps-in-only-1-hour-with-no-skills-necessary/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-17T17:29:38Z"
}