{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>WAS DU LERNST<br></p><p>In diesem Kurs lernst du, wie du mit dem System \"Chayns\" eine eigene Smartphone App ganz kostenlos erstellst und in den gängigen App Stores veröffentlichst.</p><p>Ich zeige dir,</p><ul><li>was Chanys ist</li><li>wie du Chayns einrichtest und nutzt</li><li>wie du du alle Vorraussetzungen für die Erstellung der App erfüllst</li><li>wie du deine App einrichtest (ohne Programmierkenntnisse und innerhalb von nur 60 Minuten)</li><li>wie du deine App im iTunes und Google Play Store veröffentlichst</li><li>und noch vieles mehr</li></ul><p><br></p><p>FÜR WEN IST DER KURS?<br></p><p>Dieser Kurs richtet sich vor allem an KMU´s, Coaches und Berater, sowie Blogger, YouTuber und Freelancer und alle, die gerne eine eigene App veröffentlichen möchten. Ich zeige dir Schritt für Schritt, wie Chanys funktioniert und wie du dir eine tolle App kostenlos erstellen kannst Bei Fragen helfe ich dir gerne weiter!</p><p>Du möchtest professionelle Newsletter erstellen und versenden? Dann ist dieser Kurs genau der Richtige für dich!</p><p>Also, Take Action und sicher dir meinen Kurs \"Eigene App erstellen - kostenlos mit Chayns\" zum Einführungspreis!</p><p>+++++++++++++++++++++++++++++</p><p>WICHTIG:</p><p>Das ist ein brandneuer Kurs, der die aktuellen Ansichten, Funktionen und Einstellungen berücksichtigt!</p><p>Sobald Chayns Änderungen vornimmt, werden diese so schnell wie möglich im Kurs aktualisiert!</p><p>Ebenfalls wichtig: Mit dem Chayns-System hast du viele Möglichkeiten, deine App zu individualisieren. Allerdings handelt es sich hier nicht um einen Kurs, in dem du lernst, deine eigene App selbst zu programmieren.</p><p>+++++++++++++++++++++++++++++</p><p><em>Denk daran: Du hast eine uneingeschränkte 30 Tage Geld zurück Garantie durch udemy! Sollte dir mein Kurs absolut nicht weiterhelfen, bekommst du ohne Wenn und Aber dein Geld zurück!</em></p><p><em>----</em></p><p><em>Hinweis: Thumbnail-Bild Video - stockunlimited / Bildnr.: 1254498</em></p>", 
    "end_date": null, 
    "title": "Eigene App erstellen - kostenlos & einfach mit Chayns", 
    "price": "35.00", 
    "instructors": "Jessica Ebert", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672356_dd63_2.jpg", 
    "course_url": "https://www.udemy.com/eigene-app-erstellen/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-17T15:20:32Z"
}