{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  This free video documentation is coming to Udemy&#039;s great platform to give users of <a href=\"http://www.cartoonsmartkits.com/fantastic_worlds_ios_starter_kit.php5\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">CartoonSmart&#039;s Fantastic Worlds iOS Starter Kit</a>, a virtual home to ask questions on the course board and have them answered by the kit&#039;s author (great questions deserving of a video response will get one).  </p>  <p>  \t  Learn how to make an iOS app for either the iPad or iPhone, without writing ANY code. You&#039;ll see how to design levels graphically with Tiled, and enter simple values to setup the parameters of your own top-down view, side scrolling or isometric world. Features include: a team of players, physics based worlds, animated enemies, weapons, equitable inventory,  collectibles, in-game currency, In-App Purchase and Parental Gates, and much more.  <strong style=\"\">The kit is not provided with this free documentation.</strong>  </p>  <p>  \tKit modifiers should also be sure to download the free iBooks format documentation, <a href=\"http://www.cartoonsmartkits.com/fantastic_worlds_ios_starter_kit.php5#written_documentation\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">available here</a>.  This gorgeous format is 170 pages long, includes details on every property, and has links within the book to related reading.  </p>", 
    "end_date": null, 
    "title": "Fantastic Worlds iOS Starter Kit Setup Guide", 
    "price": 0, 
    "instructors": "Justin Dike", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/209042_ac49_2.jpg", 
    "course_url": "https://www.udemy.com/fantastic-worlds-ios-starter-kit-setup-guide/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-02T01:53:54Z"
}