{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tWhen developing a mobile app for iPhone and Android, most people think they need deep experience in programming languages like Objective-C and Java.  </p>  <p>  \t    Becoming competent in even one of these languages requires either 1.) 1,000s of hours of work. Then, even if you were to avoid that route, you could 2.) end up spending $10,000+ on a professional developer.  </p>  <p>  \t    In both cases you&rsquo;ll only be creating an app for just the iPhone, or just Google Play - both of which didn&rsquo;t exist a few years ago and are sure to change.  </p>  <p>  \t    In this course, I&rsquo;ll take you through avoiding both of these huge problems.  </p>  <p>  \t    Within 60 minutes of taking this course you&rsquo;ll be able to both develop and push live your own iPhone AND Android app.  </p>  <p>  \t    Then, with some basic HTML knowledge, and a little creativity, you&rsquo;ll also be able to launch similar apps, as many times as you&rsquo;d like.  </p>  <p>  \t    I know, because just using the template I developed, which I provide all the code for in this course, I&rsquo;ve personally launched over a dozen applications in both the Apple and Google Play Stores.  </p>  <p>  \t    These apps are not only simple to launch, but when marketed the right way, can even make you some additional passive income. Without much effort you can even get into the thousands of dollars per month.  </p>  <p>  \t    Not sure how to do that? Don&rsquo;t worry, I have included an additional section with strategies on exactly how to do it.  </p>  <p>  \t    I look forward to seeing you in the class.  </p>  <p>  \t    Thanks,  </p>  <p>  \t    Ankur Nagpal  </p>  <p>  \t    P.S. Keep in mind, I&rsquo;ve lowered the price of this course to be able to build enough student sample projects. If you&rsquo;re able to make this through this course, I&rsquo;d love to know and feature your project.  </p>  <p>  \t    P.S.S. My personal teaching philosophy is to have a good time while doing it, so you will hear me cuss and mess around. Don&rsquo;t take this stuff too seriously, OK?  </p>", 
    "end_date": null, 
    "title": "From HTML to App Store in 60 Minutes", 
    "price": "30.00", 
    "instructors": "Ankur Nagpal, Conrad Wadowski", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/64784_e3e9_4.jpg", 
    "course_url": "https://www.udemy.com/your-first-android-and-iphone-app-in-60-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-10T15:24:06Z"
}