{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>To get the source code for $1, Google \"Wharton Animation Angry Eyes.\"</strong> Click on the first search result. Scroll down to the bottom, and click \"Get Started.\" Then, on the next page, where it says \"Coupons,\" enter the promo code \"1\" and click \"Redeem.\" <strong>This code will expire after the first 500 orders, so get yours today if you are interested in making your own photo app.</strong><strong></strong><br></p><p><strong>Starting with this code, I made a business earning $100/day with apps. </strong>With this code, you can launch your own successful photo/video app this week on the App Store.</p><ul><li>“Hipstacam\", originally made with this code, was <strong>featured in the Yahoo News</strong> article “8 Awesome Paid iPhone Apps You Can Get Free Right Now\".</li><li><span></span>“StupidFox\", originally made with this code, received 2,000+ likes and 100+ shares on it's first day on the App Store.</li><li><span></span>After over 100 transactions, I have received <strong>100% positive customer feedback</strong> from anyone who has ever bought a code from me. Search Flippa for \"WhartonApps\".</li><li><span></span>You can test the source code we'll be working from on the App Store. It's iOS 8 and 64-bit compatible, and optimized for iPad, iPhone 6 and 6 Plus. Search the App Store for \"Angry Eyes Photo Editor\".</li><li><span></span>Both the Udemy video and the source code come with a <strong>full-refund, 30-day money-back guarantee.</strong></li></ul><p>This course will provide concepts, skills, and practical knowledge to produce your own stickers apps at $0 variable cost per app. <strong>I demonstrate everything in front of you on the computer.</strong></p><p><strong></strong>You will also <strong>learn rarely-discussed ways to market your apps and monetize them.</strong></p><p>In 3 hours from now, you can transform your app business, or get one started. There is still time to get in on the<strong> $25 billion app marketplace</strong>. With the 30-day money-back guarantee, you have nothing to lose, and everything to gain.</p><p>While you can learn about app reskinning by just watching the course, to get the most out of the course, I recommend getting the source code \"Angry Eyes\" and following along with the tutorial as you make your own photo stickers app. <strong><em>The source code can be accessed from the resource tab in video lecture 1.</em></strong></p>", 
    "end_date": null, 
    "title": "Get 10x Returns: Make a Photo App With a Top-Performing Code", 
    "price": 0, 
    "instructors": "Brett Wharton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543538_1249_4.jpg", 
    "course_url": "https://www.udemy.com/get-10x-returns-make-a-photo-app-from-a-top-performing-code/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T21:58:21Z"
}