{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>*** Code using Swift 2.2 for iOS 9 ***</strong><br></p>\n\n<p><strong></strong>Did ever think about have access to the <strong>world’s largest open source community</strong>? To be able to <strong>s</strong><strong>hare your projects</strong> with the world, <strong>get feedback,</strong> and <strong>contribute to millions of repositories</strong>?</p>\n\n\n\n\n\n\n\n<p><strong>Better</strong> than this just if you could have access to all of this <strong>directly from inside XCode, </strong>making everything from only one place, coding, committing, pushing and pulling the code or even creating new branches, merging branches and even solving conflicts in a very visual interface.</p>\n\n\n\n\n\n<p>If you are <strong>working in group</strong> or as a collaborator in a project you probably want great great communication between users and/or collaborators, <em>making clear r</em><em>eview changes, comment on lines of code, report issues, and plan the future of your project </em>with discussion tools all this with less friction development across teams and/or friends.</p>\n\n\n\n\n\n<p>Learn all this building an application from beginning to end using Swift, learn about <strong>MVC </strong><strong>designing, debugging, lldb, and so much more.</strong></p>\n\n\n\n\n\n<p>This course is full of challenges that we can all participate as an individual or as a group afterall we will learn how to master <strong>GitHub the </strong><strong>world’s largest open source community </strong>so we will be able to share our code, our ideas and specially our knowledge.</p>", 
    "end_date": null, 
    "title": "GitHub for XCode (Swift/Objective-C) create a beautiful app", 
    "price": "20.00", 
    "instructors": "Icaro Lavrador", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664776_c92d_4.jpg", 
    "course_url": "https://www.udemy.com/learn-github/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T15:35:44Z"
}