{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn how simple it is to build an iPhone application!  You'll take your first steps in getting familiar with the basic building blocks for making an iPhone app, and you'll see just how easy it is to do it! Even without knowing how to code!</p><p><strong>Have FUN and build confidence in your own abilities to create iPhone apps through following this tutorial for beginners.</strong></p><ul><li>Download &amp; Install XCode</li><li>Tour XCode</li><li>UI (User Inteface) Elements - Putting Buttons, Labels &amp; More on the screen.</li><li>Connecting Actions to Buttons and make things <em><strong>happen</strong></em> on the screen</li><li>Getting familiar with If-else (Also known as conditional) statements</li><li>Building your <strong>FIRST</strong> iPhone App!</li></ul><p><strong></strong></p><p><strong></strong></p><p><strong>A Powerful tool to help you create ANYTHING! (Well ... almost anything ;)</strong></p><p><strong></strong>XCode is the tool we'll use to work with when creating iPhone Apps, but the even MORE important tool is <strong>YOU</strong> and your creative powers!</p><p><strong></strong></p><p><strong>Content and Overview</strong></p><p><strong></strong>Kids are some of the most creative people in the World, right!?! We learn by <em>doing</em>, and in this course, you will DO! Lets dive in and start getting our hands dirty!</p><p>Mainly suitable for Kids aged between 7 through 11 and/or any beginners in iPhone app development, through the course of 12 lectures you'll learn how to download and use XCode, the basic tool for creating iPhone applications, as well as learning some of the fundamental building blocks that you'll use to build apps. </p><p> And hey, how do you feel about bananas? Great! Mee too! Cuz we're gonna make our very first \"Hello Banana App\"!</p><p>Beginning with the download and installation of XCode, the course will take you through a basic tour of it's different areas, and what you can do with it.  You'll learn how to add labels and buttons to your screen, and explore other types of UI (User Interface) elements that you can work with and customize.  You'll see how you can add \"Actions\" to buttons, and start seeing how easy it is to  \"make things happen\" and make your app \"do stuff\".  At the end of the course, we'll also begin touching a bit on simple coding concepts.</p><p>The course will take about 1 hour to complete, and at the end of the course I'll take you through building your very first Hello Banana! iPhone app, and you will get a feel for yourself of how simple it is to create your own amazing apps! You'll be able to work alongside with the tutorials. You'll begin to feel comfortable getting your way around XCode and have the confidence you need in order to break through to your next level of creating even more complex and advanced apps.</p><p><strong></strong></p><p><strong>What am I going to get from this course?</strong></p><ul><li>Learn to make an iPhone app in less than 2 hours!</li><li>Suitable for Kids and beginner programmers who learn by doing.</li><li>Focused on learning things one step at a time.</li><li>The understanding that having FUN and ENJOYING what you do is just as important as the knowledge of how to do it.</li></ul>", 
    "end_date": null, 
    "title": "Hey Kids! Develop iPhone Apps! Using XCode & Swift!", 
    "price": "20.00", 
    "instructors": "Yehuda Oren Cohen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555128_3a6e_3.jpg", 
    "course_url": "https://www.udemy.com/for-kids-creating-iphone-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T06:27:32Z"
}