{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Make your first app in 30 days with an extremely limited budget and without learning to code</strong>  </p>  <p style=\"\">  \t       Listen, I know what you’re going through.  </p>  <p style=\"\">  \t    You’ve thought about making an app for awhile but <strong style=\"\">you’ve been unsure how to find the ‘perfect’ idea or have been bogged down by too many ideas.</strong>  </p>  <p style=\"\">  \t        If you’re like me you had a long list of ideas that you never acted on. <strong style=\"\">You don’t have the time to learn to code and you’re scared to risk money by hiring a developer</strong>.  You are worried that you’ll spend all of this time and energy creating an app - and who knows if anyone will actually use it?  </p>  <p style=\"\">  \t<em style=\"\"> Less than a year ago, I was in your shoes.</em>  </p>  <p style=\"\">  \t       Ever since the App Store was created, I dreamt about making an app.  </p>  <p style=\"\">  \t       But I always thought that it took thousands and thousands of dollars and years of acquired, technical knowledge.  </p>  <p style=\"\">  \t       So for YEARS I would brainstorm random app ideas, fantasize about how huge they were going to be and how much money I would make.  Then I’d remember that I actually didn’t have 100s of hours in spare time to learn how to program so I’d quickly drop the idea..<strong style=\"\"> only to repeat this process over and over.</strong>  </p>  <p style=\"\">  \t       I know you’ve probably been experiencing the same thing.  </p>  <p style=\"\">  \t<strong style=\"\"> But then I realized that it wasn’t true.</strong>  </p>  <p style=\"\">  \t That you could actually produce your own app with only a few hundred dollars and NOT have to learn to write a single line of code.  </p>  <p style=\"\">  \t<strong style=\"\"> In this class you’ll learn how I created my first iPhone app by hiring a developer for less than $250 total (and how I’ve since earned double my money back.. and then some). </strong>  </p>  <p style=\"\">  \t       I’ll go through how I did it step by step so that you can duplicate my process and my results.  </p>  <p style=\"\">  \t<strong style=\"\"> A few months ago, I had:</strong>  </p>  <ul style=\"\">  </ul>  <ul style=\"\">  \t<li style=\"\">No idea for an app</li>  \t<li style=\"\">No clue how to program (still don’t)</li>  \t<li style=\"\">Very little time to dedicate since I have a full-time job</li>  \t<li style=\"\">and little money to pay someone to code an app for me</li>  </ul>  <p style=\"\">  \t       BUT - just 1 month after I started, I launched my first app to the app store… and so can you :)  </p>  <p style=\"\">  \t       Today it has generated almost 70,000 downloads and has made hundreds in revenue. (It will be worth tens of thousands of dollars to me over the next few years however, keep reading to find out why)  </p>  <p style=\"\">  \t <strong style=\"\">In this course you will learn:</strong>  </p>  <p style=\"\">  \t       - The <strong style=\"\">exact steps</strong> I took to go from nothing to having my own app 1 month later for only $250.  And then how I grew it to 65,000+ downloads and profitability.  </p>  <p style=\"\">  \t       - How to set up accountability so that you actually complete your app <em style=\"\">instead of continuing to brainstorm</em>  </p>  <p style=\"\">  \t       - How to analyze and research existing applications to identify gaps and opportunities for new <strong style=\"\">apps that people want</strong>  </p>  <p style=\"\">  \t       - How to validate that your app idea is worth pursuing <strong style=\"\">before spending a cent on a developer</strong>  </p>  <p style=\"\">  \t       - Why competition is <strong style=\"\">GOOD</strong>  </p>  <p style=\"\">  \t       - A <strong style=\"\">proven framework</strong> to handle ‘idea overload’ so that you don’t waste weeks debating back and forth between which idea to pursue  </p>  <p style=\"\">  \t       - The best way to deal with the <strong style=\"\">fear</strong> of other people stealing your ideas  </p>  <p style=\"\">  \t       - How to easily communicate your app idea and design to a developer so that there is no miscommunication and costly mistakes  </p>  <p style=\"\">  \t       - <strong style=\"\">How to hire a developer without worry or stress (I’ll even give you a referral to my personal developer to save you the trouble of finding a solid programmer - This alone is worth the cost of the class)</strong>  </p>  <p style=\"\">  \t       - The ridiculously simple hiring strategy I used to weed out 75%% of developers, save myself hours of looking through portfolios and automatically identify the best candidates  </p>  <p style=\"\">  \t       - The best approaches to app marketing and how to get 80%% of the results with 20%% of the effort.  I’ll tell you which popular app marketing methods are complete time-wasters.  </p>  <p style=\"\">  \t       - <strong style=\"\">How to get tens of thousands of downloads without paying a dime on advertising</strong>  </p>  <p style=\"\">  \t <strong style=\"\">This course is perfect for people who:</strong>  </p>  <p style=\"\">  \t       - Want to start their own business  </p>  <p style=\"\">  \t       - Want to earn a small amount of passive income  </p>  <p style=\"\">  \t       - Want to break into or boost their careers in technology or digital advertising by having an app in their portfolio and on their resume  </p>  <p style=\"\">  \t <strong style=\"\">This course is NOT for </strong>  </p>  <p style=\"\">  \t       - Someone who thinks they’re going to make $1,000,000 on their first app  </p>  <p style=\"\">  \t       - People who aren’t willing to put in the work  </p>  <p style=\"\">  \t <strong style=\"\">THE HANG UP</strong>  </p>  <p style=\"\">  \t       First off - if you are looking to make thousands extra a month, quit your job and live on the beach, this is not for you.  I haven't done that so I can't teach you how.  This is not a get rich quick scheme.  </p>  <p style=\"\">  \t       But - if you want to build your skills, get more comfortable working with developers so you can move on to bigger projects, build a strong resume/portfolio piece and bring in an extra $100 or so passively a month, that I can help you with. :)  </p>  <p style=\"\">  \t       Maybe you’re thinking “Oh big deal, $3 a day.”  And I felt that way at first as well.  But then I realized, if today you’re making $3 per day in passive income - just imagine where you’ll be in 5 years.  </p>  <p style=\"\">  \t       Maybe you’re wondering why you should take a class from a guy who hasn’t earned $100,000+ dollars or gotten 5 million downloads for his app.  </p>  <p style=\"\">  \t<strong style=\"\">Lebron James shouldn't teach you basketball fundamentals</strong>  </p>  <p style=\"\">  \t       If you’re just starting out to play basketball - is taking lessons from Lebron James going to be beneficial and worth the cost?  While that would be awesome to brag about to your friends, the answer is No - taking lessons from him would be beneficial once you had already achieved some level of mastery and were looking to develop your skills even further - not when you’re at square one.  </p>  <p style=\"\">  \t       You need someone who is only a few steps ahead of you to guide you and get you started, not someone who is lightyears ahead of you, has a huge budget at their disposal and can’t relate to what you are about to go through.  </p>  <p style=\"\">  \t       I personally don't believe anyone who isn't technical or hasn't worked with developers before should start out with a complex project on their first go-around.Too much can go wrong and too much money can be wasted if you attempt to bite off more than you can chew.  </p>  <p style=\"\">  \t<strong style=\"\"> That's why I strongly advise that you start off with a simple application first, go through the motions and steps to get more familiar - and then if you want - go after the big app idea.</strong>  </p>  <p style=\"\">  \t       The sad truth is that most people would rather dream about making a super popular, amazing, money-pumping application then actually take the initial steps to make something useful but simple and then continue on from there.  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Mark Zuckerberg</strong> made dozens of little websites before starting Facebook.</li>  \t<li style=\"\"><strong style=\"\">Richard Branson</strong> started like 30 businesses and an airline before starting a space tourism company.</li>  </ul>  <p style=\"\">  \t       They laddered up and slowly snowballed their experience and expertise into bigger and bigger things.  </p>  <p style=\"\">  \t<strong style=\"\">IT'S ALL ABOUT MOMENTUM</strong>  </p>  <p style=\"\">  \t       If your ultimate goal is to make $3,000 a month on the side - and right now you are at $0, it’s going to be REALLY hard to go right from 0 to $3,000. BUT if you go through the process and experience and even just get to $60/month, it’ll be much easier to bump that number up once you have that initial momentum.  </p>  <p style=\"\">  \t       The difference between $0 and $3/day is actually WAY bigger than the difference between $3/day and $100/day.  <strong style=\"\">It’s all about momentum.</strong>  </p>  <p style=\"\">  \t       It’s often said that the difference between winners and losers is simply - movement.  </p>  <p style=\"\">  \t       Losers stay still and spin their wheels and second guess themselves.  </p>  <p style=\"\">  \t       Winners take action, make mistakes, fail and continue to correct course until they’ve found what works.  </p>  <p style=\"\">  \t<strong style=\"\">TAKE ACTION, TAKE ACTION, TAKE ACTION</strong>  </p>  <p style=\"\">  \t       The deciding factor on whether you're successful here is if you take action.  Taking action can mean you fail also - not just that you build something awesome.  My goal for you is that you stop the cycle of idea, idea, idea or dream, dream, dream - without acting on it.  </p>  <p style=\"\">  \t       Hey - I've been there, I know it's addicting.  </p>  <p style=\"\">  \t       But it's truly amazing how much you can accomplish in so little time when you commit to taking specific action towards a specific goal.  </p>  <p style=\"\">  \t       Finishing your first app will also give you the confidence to move forward with more complex projects with more potential earnings.  This is why my first app will be worth thousands of dollars to me later on - because it will have saved me from costly mistakes on a larger scale project and give me the insight and experience to make it more successful.  </p>  <p style=\"\">  \t       This is why 99%% of people who tell you their cool app idea never go anywhere- they don’t have the confidence that they can create it.  But if you’ve already got a simple app under your belt, you have the confidence to ladder up and take on the next one.<a class=\"external-link\" href=\"http://benphilabaum.com/how-i-made-my-first-app-in-3-weeks-for-250-with-no-coding-skills-and-make-passive-revenue/\" rel=\"nofollow noreferrer\" style=\"\" target=\"_blank\"></a>  </p>  <p style=\"\">  \t<strong style=\"\">   NO more excuses!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">   It’s time to stop waiting for:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Inspiration</li>  \t<li style=\"\">The ‘perfect’ idea</li>  \t<li style=\"\">Permission</li>  \t<li style=\"\">Someone to tell you what to do</li>  \t<li style=\"\">To be discovered</li>  \t<li style=\"\">Tomorrow</li>  </ul>  <p style=\"\">  \t       If you don’t do it now will you ever?  </p>  <p style=\"\">  \t   A year from now will you still be daydreaming about your app idea - or will you already have one under your belt, be making a little passive revenue and already be working on your next, bigger app?  </p>  <p style=\"\">  \t <strong style=\"\">In this course, we will go through 6 modules:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">   1. Forming a success mindset and setting yourself for accountability:</strong> Tactics and strategies don’t matter if you don’t do the work.  I’ll show you how to ensure that you follow through.  </p>  <p style=\"\">  \t<strong style=\"\">   2. How to find and choose an idea:</strong> You’ll learn how to validate that an idea is in fact a “good idea” before spending any money or time on it.  We’ll also dive into ‘idea overload’ and how to handle the fear of someone stealing our idea.  </p>  <p style=\"\">  \t<strong style=\"\">   3. Creating your app wireframe or “blueprint”:</strong> Mess this part up and you will end up spending WAY more on a developer than you intended.  You’ll learn how to easily create a basic design that a developer will be able to understand.  We’ll cover the free tools available to you to do so. Don’t worry no design skills needed here. If you can make a basic PowerPoint presentation you can do this.  </p>  <p style=\"\">  \t<strong style=\"\">   4. Hiring and managing a developer:</strong>  How to find the best and most cost effective developer, how to weed out candidates, and how to manage them once you hire one.  You’ll also get the contact info for my developer to save you the time and hassle of finding one.  </p>  <p style=\"\">  \t<strong style=\"\">   5. Choosing your monetization strategy:</strong> The goal of this project is to make an app but not spend a lot of money, but it would still be nice to earn back our small investment right?  That’s what we’ll cover here.  </p>  <p style=\"\">  \t<strong style=\"\">   6. Marketing:</strong> Just because you build it doesn’t mean they will come.  You’ll learn which marketing activities are complete time wasters and which are gold.  I’ll personally review my marketing system that brought in almost 70,000 downloads on auto-pilot without spending one cent on advertising.  </p>  <p style=\"\">  \t<strong style=\"\">   After completing this course:</strong>  </p>  <p style=\"\">  \t       - You will have a solid foundation of how to choose app ideas, how to create basic wireframes, how to hire a developer and how to do app marketing  </p>  <p style=\"\">  \t       - If you take action you should have your first app live on the App Store.. I can’t wait to see what you create!!  </p>  <p style=\"\">  \t       When I showed the class to one of my buddies, his first comment was that I should double my price.  I’m not comfortable doing that right now - but I might be in the future.  </p>  <p style=\"\">  \t       The price for the course is really low considering access to my personal developer is worth the cost alone.  But you also get all of the systems, strategies and tactics to launch your first app in 30 days.  Sure - you could maybe find all of this information on Google.. if you have 100+ hours to waste surfing the internet.  </p>  <p style=\"\">  \t<strong style=\"\">   F.A.Q.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">   Q. Is this course teaching me how to code?</strong>  </p>  <p style=\"\">  \t       A. No - this course teaches you how to hire and manage a developer very inexpensively so that you don’t waste months and months learning to code.  </p>  <p style=\"\">  \t<strong style=\"\">   Q. How much money do I need to create my first app?</strong>  </p>  <p style=\"\">  \t       A. That will vary based on what you want to build, but my development costs were only $150.  There is also a $99 fee that you have to pay Apple to publish your app on the App Store.  If you keep your development costs low it shouldn’t take long for your app to earn that back.  </p>  <p style=\"\">  \t<strong style=\"\">   Q. Does this course teach how to make an Android app?</strong>  </p>  <p style=\"\">  \t       A.  While the concepts apply to both Android and iOS (Apple), the content and examples of the course focus on iOS.  </p>  <p style=\"\">  \t<strong style=\"\">   Q. How do you make money with apps?</strong>  </p>  <p style=\"\">  \t       A. I talk about that in the course :)  </p>", 
    "end_date": null, 
    "title": "How To Make An iPhone App W/No Coding Skills", 
    "price": "20.00", 
    "instructors": "Benjamin Graham Philabaum", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160330_f727_2.jpg", 
    "course_url": "https://www.udemy.com/your-first-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-08T22:07:30Z"
}