{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Have you ever seen a beautiful screen and wondered how it was designed or read a hundred lines of neatly formatted code and wondered how it works? This course aspires to seamlessly blend <strong>app design</strong> with <strong>android development</strong> giving you the complete picture. Learn how to <strong>design</strong> and <strong>code</strong> a fully working, professionally designed Android app from <strong>Photoshop</strong> to <strong>Playstore</strong> under <strong>16 hours</strong>. </p>\n\n<p> We build an app called <strong>BucketDrops</strong> in the series which lets you keep track of life goals. The course begins with app design instructed by <strong>Gary</strong> and covers the following:</p>\n\n<ol><li><strong>Photoshop</strong> basics</li><li><strong>Illustrator</strong> basics</li><li>Principles of <strong>Logo</strong> <strong>Design</strong></li><li>Process to design the app mockup screens</li></ol>\n\n<p>We then dive into Android Programming using <strong>Android</strong> <strong>Studio</strong> instructed by Vivek Ramesh \"<strong>Vivz</strong>\" which covers the following topics</p>\n\n<ol><li>Basic components of Android (Activities, Services, Intents, Fragments, and BroadcastReceivers</li><li><strong>Drawables</strong> and selectors</li><li>Efficient Image Loading With <strong>Glide</strong></li><li><strong>Fragments</strong>, <strong>FragmentManager</strong> and <strong>FragmentTransaction</strong></li><li><strong>Realm</strong> database and queries</li><li><strong>RecyclerView</strong>, sections, animation and swipe to delete</li><li>Styles and themes</li><li><strong>Custom</strong> <strong>Widgets</strong> and Views</li><li>Running periodic tasks with <strong>IntentService</strong>, <strong>AlarmManager</strong> and BootReceiver</li><li><strong>Reverse</strong> <strong>engineering</strong> an APK file</li><li><strong>Proguard</strong></li><li>Publishing on Google Play</li></ol>\n\n<p>Follow along as Gary Simon and Vivek Ramesh \"Vivz\" walk you through the entire process of designing and coding a production-ready android app.</p>\n\n<p><strong>Prerequisites</strong></p>\n\n<ol><li>You have Photoshop and Illustrator installed on your system.</li><li>You know a bit of Object Oriented Programming (Any language will do but Java is preferable)</li></ol>\n\n<p><strong>Materials included</strong></p>\n\n<ol><li>Assets wherever appropriate</li><li>Presentations, keynotes and slides wherever appropriate</li><li>Document containing GitHub code links attached on lecture 39</li><li>Videos are enabled for offline access</li></ol>\n\n<p><strong>Who are these guys?</strong></p>\n\n<p><em>Gary Simon</em> has been a professional designer for over 15 years and has dealt with over a thousand clients on a variety of design and development projects. He owns a popular design business, along with its associated youtube presence which is one of the most popular design channels with almost 100,000 subscribers.</p>\n\n<p><em>Vivz </em>has been a java developer for nearly a decade and is the founder of a channel called slidenerd that deals with mobile programming on YouTube with almost 100,000 subscribers</p>\n\n<p>Between the two, millions upon millions of aspiring designers and coders alike have benefited from their instructions.</p>\n\n<p><strong>Who should take this course?</strong></p>\n\n<p>Anyone that's interested in designing and developing apps for android. You can be an absolute beginner and follow along. You can also be an intermediate/advanced designer or coder and still gain valuable insights.</p>\n\n<p>So if you're ready to start designing and coding amazing android apps, let's get started!</p>", 
    "end_date": null, 
    "title": "How To Launch Your App In  Just 16 hrs - Android Development", 
    "price": "25.00", 
    "instructors": "Vivek Ramesh, Gary Simon", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717884_9892.jpg", 
    "course_url": "https://www.udemy.com/design-code-an-android-app-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T03:47:22Z"
}