{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>The How To Developer iOS Apps course teaches you all the essential knowledge to be able to create and release your own iOS apps.</strong> </p><ol><li>Start at the very beginning by downloading and getting familiar with all of the essential tools needed to begin developing iOS apps. </li><li>Then transition into learning the Objective-C programming language, one of two standard languages used to develop iOS apps. Learning a programming language is not hard with this course: whether Objective-C is your first language or not, this course makes sure even beginners can learn it. </li><li>Next, get down to the very core of the iOS Software Development Kit (SDK) and really learn and create upon what drives apps. </li><li>Finally, learn all of the necessary steps to release and submit your app to Apple's App Store and have it be downloaded by everyone globally.</li></ol><div><span style=\"\"><br></span></div><p>The course contains <strong>69 HD video lectures</strong> and <strong>10.5 hours</strong> of content. Included in each applicable lesson is the copy of the exact source code worked on in the lecture so you can follow along.</p><p>On average each lecture is about 9 minutes per lecture, making the course easy to finish increments. Spend simply an hour to two hours a day to become an iOS developer in only a week.<br><br>The course is constructed in a logical and chronological order. It starts with introducing and teaching the basics and tools needed to develop apps, then moving onto applying this knowledge to make iOS apps. Finally, after you have learned to make your app, learn how to submit it to the app store. Literally go from learning to program, to learning the iOS SDK, to finally releasing it globally to the world. </p><p>If you want to become an iOS developer, one of the most in demand software areas today, <strong>the How To Develop iOS Apps Course is exactly what you are looking for.</strong> Take the course today, and begin on your path as an iOS developer. <br><br></p>", 
    "end_date": null, 
    "title": "How To Develop iOS Apps Course: No Experience to App Store", 
    "price": "30.00", 
    "instructors": "Alec Kriebel", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611056_fa7c_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-develop-ios-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T21:48:29Z"
}