{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Why watch a generalize training course on how to build a mobile app when you can watch the EXACT steps we take when developing particular apps!  </p>  <p>  \t  Watch over our should as we show you how to build a RSS Feed news app with our EXACT steps.  </p>  <p>  \t  And best of all, there is no programming, coding or other technical knowledge required to get started!  </p>  <p>  \t<strong style=\"\">Who would benefit from this course?</strong>  </p>  <p>  \t  If you want to get started in developing apps, make money from home or even expand other development ideas then this course is for you!  </p>  <p>  \t  All you need to do is watch the videos and follow the training as we cover the EXACT steps you should take when creating simple RSS Feed news apps.  </p>  <p>  \t<strong style=\"\">THIS IS NOT AN OVERVIEW SHOWING YOU A BUNCH OF FEATURES!</strong>  </p>  <p>  \t  This is the EXACT steps we do to make RSS Feed news apps quickly and easily. Implement this course, start publishing and come back here to leave a review!  </p>  <p>  \t  In niche RSS Feed app development, the rule of thumb is to make <strong style=\"\">QUALITY</strong> apps but a lot of them also!  </p>  <p>  \t  In time you will be amazed by the results!  </p>  <p>  \t<em style=\"\">- Let me help your mobile app success</em>  </p>  <p>  \t<em style=\"\">Donovan</em>  </p>", 
    "end_date": null, 
    "title": "How To Make An App - Build An App Business - RSS Feed Apps", 
    "price": 0, 
    "instructors": "Donovan Wells", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437112_094f_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-an-app-build-an-app-business-rss-feed-news-apps/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T00:43:09Z"
}