{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong></p>\n\n<p>  \t<strong>[Attention #1: Source code included!] </strong></p>\n\n<p><strong>[Attention #2: Course had been updated to Android Marshmallow!]</strong><br></p>\n\n<p><strong><strong>[Attention #3: <strong>Course updated to April 22, 2016.</strong>]</strong> <br></strong>  \t  </p>\n\n<p>  \t<strong>[Do Not Reinvent the Wheel]</strong>  </p>\n\n<p>  \t                                           The wheel is round in shape. It is unwise to reinvent and change it into another shape. Analogously, it is better not to develop Android apps from scratch, unless you already acquired excellent programming knowledge. Of course, we are not advocating that everyone should NOT learning programming language.  </p>\n\n<p>  \t                                         Here's the reality. You may need to take years to master those knowledge. So, if you get overwhelmed by the programming language and you are rush enough to build your first Android app, then this course is definitely for you! Additionally, this course can provide you a \"big picture\" of what Android development is all about.  </p>\n\n<p>  \t<strong>[Apps Reskinning]</strong>  </p>\n\n<p>  \t                                     Apps Reskinning can be a very lucrative field to penetrate if you know what you are doing. In this course, you will first learn how to install Eclipse (an Android Integrated Environment) and install a software plugin called the ADT (Android Development Tool). Before you can generate the binary file, you will also need to update the Android SDK (Software Development Kit) Manager. You will learn how to update to the latest Android version, particularly Android Lollipop (in the time of writing).  </p>\n\n<p><strong>And now - Android Marshmallow...</strong><br></p>\n\n<p>  \t                                   Next, you will know where to get the source code inexpensively. This save your cost and increase your Return On Investment (ROI) greatly! There are newbie developer that disappointed with the expensive source code and eventually gave up the app goldmine. With this course, we provided you a solution!  </p>\n\n<p>  \t                                   We have been added a very special video (where mobile screen activity was captured in HD mode) so that you will know how to install the APK (Android Package) file as to preview your apps. Note that APK is a binary file that you will need to generate as part of the Android development. With generating APK, you cannot view your apps. No internet connection is needed when you want to preview your apps. In this course, you will be able to install a demo version of a game app as well as your newly build app on your mobile device before deploying to Google Play Stores or other alternative mobile app stores.  </p>\n\n<p>  \t                                 Pertaining to app marketing, you will be discover where to learn <em><strong>workable</strong></em> app marketing techniques and discard other easily-get-overwhelmed-and-not-applicable courses. We have created more than 100 mobile apps and we know what happens!  </p>\n\n<p>  \t                               Any wrong steps in reskinning the codes may result in compilation errors in Eclipse. This is why we will teach you step-by-step how to import the source code right in the first place. Setting the libraries (not the physical library where you can borrow books of course) wrongly in the beginning may get you overwhelmed! So, you are at the position of unfair advantage, where other newbie developers still scratching their head - you save your time! Note that NOT every code you need to \"touch\", we will revealed to you which codes you need to edit, and there is no programming skills required! Many newbies get stucked here because they don't know how to \"get out\".  </p>\n\n<p>  \t<strong>[Photoshop: Learn-Less-And-Apply-More Series]</strong>  </p>\n\n<p>  \t                           Frankly, to sustain in the long run, you will need to learn Photoshop. We know there is other alternative softwares out there, but learning Photoshop is still the wise move because of its advanced editing features. You may feel Photoshop is not user-friendly at first, but by studying our learn-less-and-apply-more Photoshop series, you will get used to it. By the way, it is not hard at all when you know the tricks. From editing game character to app icons to app screenshots, we have covered a few simple yet powerful Photoshop techniques. Learning too much in a short period of time will make you crazy. This is why we make it as succinct as possible. We have also included some useful shortcut keys as well as free software to boost your productivity!  </p>\n\n<p>  \t<strong>[Where to get Royalty-Free Sounds, Musics and Graphics?]</strong>  </p>\n\n<p>  \t                       We will tell you where to get the big list of royalty-free sounds, musics and graphics! This is a must so that you will not have a relationship with copyright infringement. This \"affair\" will not happen on you!  </p>\n\n<p>  \t<strong>[Monetization Secrets/Tricks]</strong>  </p>\n\n<p>  \t                     In this course, we will show you the secrets or tricks that Google may not want you to know. These are the secrets that many developers forgot to do it and not aware of it! Additionally, you will discover what not to do with your apps. Doing so may ruin your business instantly. Sound ridiculous? Join to find it now. Is either you know or don't know about it. These secrets WILL impact your business GREATLY!  </p>\n\n<p>  \t<strong>[Exporting the Binary File (the APK)]</strong>  </p>\n\n<p>  \t                 When you come to our session of exporting the binary, you will learn step-by-step how to exporting the APK. We will show you when to use appropriate file extension and when you should not use it. We will also give you possible errors (together with its solutions of course) that will be occurred during the last steps of Android development. We will also let you know how to use a FREE knowledge base site to further strengthen your Android development arsenal. You will also get to know on how to deploy to different Android App Stores out there for maximum exposure.  </p>\n\n<p>  \t<strong>[App Tsunami May Hit You Without Warning]</strong>  </p>\n\n<p>  \t             On this session, we will reveal to you the possible threats that you may go through in the future and how to overcome it! Every business has risks, so were apps. We certainly don't want you to go through those tough times as we did last time. Let's see what many developers overlook the possible threats.  </p>\n\n<p>  \t           With all of the course materials, you will have a solid knowledge on how to reskin Android apps, sustain in the long run and most importantly, make MORE money!  </p>", 
    "end_date": null, 
    "title": "How To Build Mobile App Without IT Skills & Make First App!", 
    "price": "50.00", 
    "instructors": "Jason Low", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/395804_3a54_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-mobile-app-without-it-skills-and-make-first-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-16T15:26:42Z"
}