{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t                                  Welcome to this class, I’m Hieu Pham, I started to work this IOS about 5 year ago.I start to work with Swift about 6 months ago and I very like this language and specially I’m very interested in apple Watch App. So I make this course to help you make applications for Apple Watch with Swift Language, whether you are a beginner or advanced developer, this course is for you!  </p>  <p style=\"\">  \t        The course covers the apple watch kit, with tons of exercises and real useful Apple Watch apps built from scratch, with the final completed source code for you to enjoy!  </p>  <p style=\"\">  \t        This course is suitable for any one who want to make an apple watch app. I’m similar like you and I only start to work with Apple Watch before you only few months so I will know how it is and I can give you my advises also my experiments to work with Apple Watch. I come from zero to learn how to make an app for IOS and apple watch and I know how to guide the student like you to make your apps with your idea. So don’t worry. I will let you step by step from the beginning to the end of this course and will help you to fix your bugs and give you some advice to improve it. You will learn to prepare for you code environment and start your developer Carrier by making some easy app and I will guide you step by step to better apps.  </p>  <p style=\"\">  \t      Some of these watch apps you will build are:  </p>  <p style=\"\">  \t      - Sec 1 - hello word  </p>  <p style=\"\">  \t      - Sec 2 - Wallpaper  </p>  <p style=\"\">  \t      - Sec 3 - Timer app  </p>  <p style=\"\">  \t      - Sec 4 - Friend&#039;s Birthday App  </p>  <p style=\"\">  \t      - Sec 5 - VAT calculator  </p>  <p style=\"\">  \t      - Sec 6 - BasketBall ScoreBoard  </p>  <p style=\"\">  \t      - Sec 7 - Glance App  </p>  <p style=\"\">  \t      - Sec 8 - VCB Exchange  </p>  <p style=\"\">  \t      - Sec 9 - Notification  </p>  <p style=\"\">  \t      - and much more to come…  </p>  <p style=\"\">  \t    At the end of this course , You can do it all apps by your self (Absolutely YES!) and so more and more. The target of this course is help you to make your own app or you can make apps for everyone!!  </p>  <p style=\"\">  \t    It’s very interesting isn’t it? So let start with me and don’t for get to take a look some video preview of my course. If you get this course you will get 50% off for my next “real Calculator app course”.  </p>  <p style=\"\">  \t    —————————————————  </p>  <p style=\"\">  \t    The course consists of:  </p>  <p style=\"\">  \t    8.5+ Hour video lectures with code from scratch  </p>  <p style=\"\">  \t    Application files and source code ready for download.  </p>", 
    "end_date": null, 
    "title": "How to Make an App With Apple Watchkit", 
    "price": "20.00", 
    "instructors": "Hieu Duc Pham", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389590_4126_4.jpg", 
    "course_url": "https://www.udemy.com/create-an-app-with-apple-watchkit/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-09T16:25:16Z"
}