{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h5></h5>  <h5><strong>IMPORTANT NOTICE: </strong></h5>  <h5><strong>This course was originally sold for $97 but now I am selling it at $19. If you want to learn about MKStoreKit than this is your course. It&#039;s the only course on the market covering MKStoreKit so feel free and tai it for only $19.</strong></h5>  <h5><strong>If you won&#039;t like what you see, don&#039;t worry: there is a 30 day money back guaranty on all Udemy courses :)<br>  </strong></h5>  <h5><strong>In App Purchases are the Holy Grail of app monetization.</strong></h5>  <p>  \t     But for years it has been a real hassle for newbie developers to add In App Purchases to their apps. One had to be a coding genius to understand all the aspects of implementing IAP. Just take a look at <a href=\"https://developer.apple.com/appstore/in-app-purchase/index.html\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">Apple&#039;s documentation</a>.  </p>  <p>  \t <strong>This was just overly complicated for me! I wanted something simple and fast!</strong>  </p>  <h5>Than I found MKStoreKit by Mugunth Kumar.</h5>  <p>  \t     MKStoreKit does all the magic of dealing with all that complicated stuff. Hurray!!!  </p>  <p>  \t     But, wait. I found no comprehensive MKStoreKit tutorial explaining how to use MKStoreKit. There isn&#039;t any documentation at all on how to implement it into your Xcode project!(besides Kumar&#039;s brief description which just isn&#039;t enough) I have dug myself into the code and after countless sleepless nights I have made this MKStoreKit tutorial course for you. It documents every step you have to make to learn in order to take advantage of in app monetization.  </p>  <p>  \t     Note: for now MKStoreKit is not advised for auto-renewable subscriptions, but if you want to add <strong>consumabels</strong> or <strong>non-consumables</strong>, take this course now:)  </p>  <p>  \t <strong>This course covers all you will ever need to know about adding In App Purchases to your app using MKStoreKit.</strong>  </p>  <p>  \t     ☛ Take a look at the FREE lecture inside  </p>  <p>  \t     ☛ iOS6 ready  </p>  <p>  \t     ☛ simple, fast, easy  </p>  <p>  \t     What are you waiting for?  </p>  <h5><strong>Take this course now and boost your sales with In App Purchases!</strong></h5>  <p>  \t <strong>⬇⬇⬇  TAKE A LOOK AT THE FREE LECTURES  ⬇⬇⬇</strong><strong><br>  \t</strong>  </p>", 
    "end_date": null, 
    "title": "How to add In App Purchases to your iPhone app the easy way", 
    "price": "25.00", 
    "instructors": "Sandor Nagy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/24251_085b_12.jpg", 
    "course_url": "https://www.udemy.com/how-to-add-in-app-purchases-to-your-iphone-app-the-easy-way/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-05T10:25:47Z"
}