{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Join Udemy's <strong>most fun class</strong> and learn how to make your own freaking Android apps! <strong>No prior programming experience necessary</strong>.</p>\n\n<p>We run through every single step from installing Android Studio (the program we use to make apps) down to making apps 3 complete apps. <strong>And we'll never talk over your head.</strong> We've experienced the harsh reality of complicated and wordy tutorials and online classes. <strong>This class is what we wish we'd had when we were first learning to make apps</strong>. It's the first class to break everything down to the level that is perfect for \"newbies\" so that you never feel lost, and can excel and learn quickly.</p>\n\n\n\n<p><strong><em>Who is this class for?</em></strong><br></p>\n\n\n\n<ul><li><strong>People who want to make apps</strong>. We will not be teaching wordy or complicated computer science philosophies. We'll cover how to make apps that you can play with, share with friends &amp; family, and offer to the world!</li><li><strong>Beginners.</strong> You don't need any programming experience to take this class. We've been the absolute beginners before and want to help you.</li><li>People who like to have fun, you might see a mullet or two in this class :)</li><li><strong>Entrepreneurs</strong> who have an idea for an app. Don't pay somebody thousands to build your app. Do it yourself. Having the ability to create something you can think of is extremely powerful.</li></ul>", 
    "end_date": null, 
    "title": "How to Make a Freaking Android App", 
    "price": "50.00", 
    "instructors": "Rick Walter", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815816_7c01.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-freaking-android-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T20:12:43Z"
}