{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>La integración de funciones de Facebook en una aplicación es hoy en día una tarea bastante común, y uno de los pasos más importantes en el proceso de integración es la implementación de la funcionalidad de inicio de sesión. El inicio de sesión con Facebook no sólo nos permite adjuntar una característica sociales en su aplicación, pero también puede ser utilizado como un sistema de registro en lugar de crear uno personalizado (y facilitanto así la tarea de desarrollo). Añadiendo que es lo que ofrece a los usuarios una manera familiar para autenticar, teniendo en cuenta que la mayoría de los usuarios utilizan Facebook.</p>\n\n<p> <br>La integración de Facebook es compatible de forma nativa desde iOS 6, a pesar de que todavía es necesario añadir manualmente el SDK de Facebook en los proyectos. Hay dos formas proporcionadas por el SDK para iniciar la sesión con Facebook. La primera de ellas consiste en una solución relativamente fácil, ya que utiliza una vista de entrada predefinido que gestiona cosas todo el período de sesiones y entrada relacionada. El segundo es un enfoque más \"pesado\", ya que todo debe ser implementado y manejado por el desarrollador, pero por otro lado el proceso de inicio de sesión puede ser altamente personalizado. El método que se debe utilizar en un proyecto depende definitivamente de los requerimientos de la aplicación. En este curso aprenderemos el primer enfoque y veremos como explotar algunas funcionalidades básicas como el invitar, compartir o dar a me gusta en un curso de poco menos de una hora de duración.</p>", 
    "end_date": null, 
    "title": "Integra Facebook en tu App o Videojuego", 
    "price": "20.00", 
    "instructors": "D. Juan Gabriel Gomila Salas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858442_aba4_3.jpg", 
    "course_url": "https://www.udemy.com/integra-facebook-en-tu-app-o-videojuego/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T10:16:24Z"
}