{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Have you taken a beginner iOS class on Udemy? Are you looking for something more? Do you want to advance beyond the basics of making simple iPhone apps? Do you want to dive deeper, get paid to make apps, and launch your career in iOS development? Or do you simply want to become an amazing iOS developer?</p><p>If you haven’t taken a beginner class yet, you should. :) They’re wonderful! But if you have, you realize <strong>there comes a point when you’re ready to move on</strong><strong>, move forward, and escalate your capabilities</strong>. You want to build amazing apps, apps that can handle greater complexity, and apps that <strong>truly impress</strong>. You want to see results in your career and in your earning potential. You want to become an advanced iOS developer.</p><p>Welcome to the first advanced iOS development class, the <em>ONLY </em>class on Udemy to unfold the most advanced iOS topics available, while coaching you through building your career in iOS development.</p><p>We (Nick Walter and Mark Price) came together to create this class because we want to provide something that can only be provided by a team of two fully-committed, experienced, professional iOS developers. We’ve built <strong>iOS apps</strong>. We’ve had <strong>iOS internships</strong>. We’ve done <strong>iOS freelance work</strong>. We’ve applied for <strong>iOS jobs</strong>. We’ve had <strong>full-time iOS careers</strong>. We’ve coached and taught in meetups and <strong>live bootcamps</strong> that charge each student <strong>THOU$AND$</strong>. And we’ve taught over 50K people on Udemy how to get started. Now we’re ready to help YOU take the <strong>NEXT STEP</strong> in advancing your skills, and launching your career.</p><p>We’re bringing every element of a <strong>live bootcamp</strong> that charges <em>thousands of dollars</em> to you in this course. Below are some specifics:</p><p><strong>Advanced iOS Topics</strong>:</p><ul><li>Advanced Auto Layout - <em>Adaptive text, adaptive UI, Size Classes in-depth</em></li><li>In-App Purchases - <em>Subscriptions, consumables, restoring purchases</em></li><li>In-App Advertising - <em>iAds, Google AdMob</em></li><li>Advanced Storyboards</li><li>Localization</li><li>Debugging &amp; Instruments</li><li>Drawing on iOS</li><li>UISplitViewController</li><li>Advanced Core Data</li><li>Push Notifications</li><li>UITesting</li><li>Unit Testing</li><li>Apple Pay</li><li>Protocol Design</li><li>Closures</li><li>Core Animation</li><li>TestFlight Beta Distribution</li><li>Git &amp; Github</li></ul><p><strong>Advanced Support</strong>:</p><ul><li>LIVE CHAT - Get <strong>24/7</strong> support and help while you learn<strong></strong></li><li>How to access hundreds of iOS <strong>job openings</strong></li><li>How to make a polished <em>Resume</em> and <em>LinkedIn</em> profile</li><li>How to answer iOS job <strong>interview questions</strong></li><li>How to <em>showcase your app(s)</em> to potential employers</li><li>How to become a <strong>freelance</strong> iOS developer</li></ul>", 
    "end_date": null, 
    "title": "Intermediate iOS - Get Job Ready with Swift 2", 
    "price": "40.00", 
    "instructors": "Rick Walter, Mark Price", 
    "commitment": "24 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706004_0259_3.jpg", 
    "course_url": "https://www.udemy.com/intermediate-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T22:08:26Z"
}