{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t Develop applications for OSX and iOS.  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">The authors are available to answer your questions within 24 hours.</strong></li>  \t<li style=\"\"><strong style=\"\">More course materials, demos and tutorials will be added as soon as XCode is released.</strong></li>  </ul>  <p style=\"\">  \t If you want to write and sell iOS and OSX applications there&#039;s no way around it — You need to learn Objective-C or Swift.  </p>  <p style=\"\">  \t Swift is an awesome new language, released by Apple in autumn 2014. It makes it much easier to write applications for iOS and OSX. And it is incredibly easy to learn for beginners, because of the newly introduced Playgrounds.  </p>  <p style=\"\">  \t If you tried to learn iOS Development but found it too difficult to understand, you will be amazed how easy it is with Swift. Playgrounds let you start programming in Swift right away, without prior knowledge of XCode, the OS architecture or frameworks.  </p>  <p style=\"\">  \t You&#039;ll learn the basic concepts and functions of the new and modern programming language Swift. This is not only an introduction but also lays the stepping stones to learn more aspects and details of the language.  </p>  <p style=\"\">  \t In this Swift video tutorial you&#039;ll work with instructor Tim Schneider. You will master the first steps with the Swift programming language used by iPhone, iPad and OSX application developers worldwide.  </p>  <p style=\"\">  \t He will teach you the different types of variables (String, Bool, etc), what operators are and how to use them. You’ll also have access to two bonus lectures providing an in depth look at all the basic operators, and how to use them.  </p>  <p style=\"\">  \t With the completion of this instructional video course, you will have a basic knowledge of how the Swift language is used.  </p>  <p style=\"\">  \t If you have questions along the path, and you will, just <strong style=\"\">ask the instructor</strong>. You will not only be able to communicate directly with the authors, but also with the other students who enrolled in this course.  </p>", 
    "end_date": null, 
    "title": "Introduction to Swift for Non-Programmers", 
    "price": 0, 
    "instructors": "Tim Schneider", 
    "commitment": "28 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244396_8876_6.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-swift/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T19:59:05Z"
}