{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>INTRODUCTION TO IOS CORE DATA WITH SWIFT </strong></p><p><strong>==============================================</strong></p><p><strong>***** Created with Xcode 7.2 and Swift 2.1 ****</strong></p><p><strong>==============================================</strong></p><p><strong><em>What is Core Data? Why should I know about Core Data?</em></strong><br></p><p>Core Data is one of the most powerful framework that Apple has provided for developer. \"Core Data is a framework that you use to manage the model layer objects in your application. It provides generalized and automated solutions to common tasks associated with object life cycle and object graph management, including persistence.\" - Source from Apple\". </p><p>If you are passionate about learning mobile development for iOS and looking to take your iOS development skills to the next level, Core Data framework should be at the top of your list.<br></p>By the time you are done with <strong>Introduction to iOS Core Data with Swift</strong> course, you will understand the basic of Core Data implementation. <p><strong><em><br></em></strong></p><p><strong><em>There are 2 similar courses: Introduction to iOS Core Data vs Mastering iOS Core Data.  What are the differences?</em></strong></p><p><strong>Introduction to Core Data</strong>: covers the basic concept of Core Data.  It gives you the foundation of Core Data and by the time you are done with this course you will be able to start implementing Core Data in simple application such Grocery List. If you only wants to know the basic of Core Data, this might be the right course for you.</p><p><strong>Mastering Core Data</strong>: covers all the lectures in Introduction to Core Data + advanced features in Core Data such as: aggregate function, compound predicate, NSFetchedResultsController, performance tuning, data migration and iCloud integration. If you would like to go beyond the basic of Core Data implementation, you will want to get this course instead. </p><p><br></p><p><strong><em>What's in it for me?</em></strong></p><p>In this course we will cover basic Core Data concept and implementation:</p><ul><li>Entity</li><li>Attribute Type</li><li>Relationships</li><li>ManagedObjectContext</li><li>ManagedObject</li><li>PersistenceStore</li><li>PersistenceStoreCoordinator</li><li>Handling JSON data</li><li>Handling plist data</li><li>Predicate</li><li>Fetching</li></ul><p>We will start by creating a simple app that is utilizing Core Data framework, building our own Core Data stack. </p><p><strong><em>Do at your own pace</em></strong><br></p><p>Lots of students have different methods of learning. Through out this course I will provide the starter Xcode project solution, so you can follow along one step at a time. </p>", 
    "end_date": null, 
    "title": "Introduction to iOS Core Data with Swift", 
    "price": "20.00", 
    "instructors": "Andi Setiyadi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/774418_39b8.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-ios-core-data-with-swift/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T20:35:05Z"
}