{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn <strong>Ionic</strong>, the best way currently available to <strong>develop mobile apps in HTML5. </strong>Covers Ionic v1.x. Last updated: January 2016.</p><p>You're familiar with web development (HTML/CSS/JavaScript) and would like to build mobile apps, but don't fancy having to learn Objective C and/or Swift for iOS, Java for Android, etc. Or maybe you've tried developing apps the \"native\" way only to realize that it's a huge pain and you end up duplicating the same codebase in a different language for each platform.</p><p>If that's you then you should seriously consider hybrid cross-platform mobile development. Built on top of <em>Apache Cordova</em> (the open source project underlying PhoneGap) and <em>AngularJS</em>, <strong>Ionic</strong> lets you <strong>develop mobile apps in </strong><strong>HTML, CSS, and JavaScript</strong>, while providing a <strong>native look and feel</strong> on each supported platform. </p><p>This course will provide you with all the knowledge necessary to start developing your own apps using Ionic, by taking a hands-on \"by example\" approach. It will walk you through the creation of <strong>two complete apps</strong>, as well as provide <strong>many more smaller examples</strong> illustrating various Ionic features and development practices.</p><p><em>Included with this course you get access to the source code for each example and for each step.</em></p>", 
    "end_date": null, 
    "title": "Ionic by Example: Create Mobile Apps in HTML5", 
    "price": "25.00", 
    "instructors": "Mirko Nasato", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480494_e979_4.jpg", 
    "course_url": "https://www.udemy.com/ionic-by-example/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-19T18:03:53Z"
}