{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course will teach you the fundamentals of how to use the Ionic 2 Framework to <strong>develop cutting-edge mobile application from scratch.</strong></p><p>The HUGE benefit to using the Ionic 2 Framework is that <em>you can utilize your existing web technologies knowledge like HTML, CSS &amp; JavaScript.</em></p><p>This means that <strong>you don't have to learn an entirely new language from scratch</strong>; How amazing is that!</p><p>Not only will you be able to create mobile applications from scratch, you will also be able to <em>take your career to the next level</em>. Not a lot of people have the ability to create mobile applications this fast.</p><p>Ionic 2 Framework will help you <em>jumpstart </em>your mobile application development career.</p><p>This course will have<strong> no fluff, just straight to the point knowledge &amp; lectures.</strong> I'll be teaching you <em>exactly </em>how to make mobile applications for iOS and Android using the Ionic 2 Framework.</p><p>Want to hear the <em>most amazing</em> part?</p><p><strong>You'll learn how to develop mobile application for iOS &amp; you'll learn how to develop mobile applications for Android; all with one piece of technology!</strong></p><p>Jumpstart your career today, come join in!</p><p><em> The best investment you can ever make is an investment in yourself.</em> </p><p>There are <em>tons </em>of reasons why you'd want to pick up Ionic 2 and at it to your <strong>awesome arsenal of tools.</strong></p><p>One of the biggest benefits of using Ionic 2 is t<strong>hat you'll only have to make &amp; maintain one codebase; that will run on both iOS &amp; Android (even Windows Phone in the future)!</strong></p>", 
    "end_date": null, 
    "title": "Ionic 2 Quickstart: Cutting-Edge Mobile Development", 
    "price": "20.00", 
    "instructors": "Nick Kenens", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739760_91d7_9.jpg", 
    "course_url": "https://www.udemy.com/ionic-2-quickstart/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T09:52:23Z"
}