{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">In this course you will learn  how to build your very own iPhone app. This course will teach you how to create a basic app, so that you will get a solid foundation in app development. </p><p style=\"\">You will learn how to build a simple app with Swift and Xcode, the language we will be developing with. <em style=\"\">Swift</em> is a programming language created by Apple for building iOS and Mac apps. It&#039;s powerful and easy to use, even for beginners.</p><p style=\"\">My focus is to explain things in simple, plain English, so that you can get started making your own apps. My approach to this course will be to slowly introduce concepts as you need them, rather than trying to equip you with everything up front only to overwhelm you!</p><p style=\"\">Towards the end of  this course you will have learned about the core concepts and by the end you will have finished creating an app that will get you oriented with the world of iOS development.</p><p style=\"\">Not only will you be learning how to create an app, but this course will give you a boost in your career. Programming can be self-taught and yes, you can start your own career in software development even if you don&#039;t have a formal background. It&#039;s probably the single greatest thing about this field; that merit is based on your achievements and hard work rather than by seniority.</p>", 
    "end_date": null, 
    "title": "iOS Development: Learn to Build Your First App", 
    "price": "20.00", 
    "instructors": "Psan Premarat", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537228_9312.jpg", 
    "course_url": "https://www.udemy.com/ios-development-learn-to-build-your-first-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-25T17:17:37Z"
}