{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t <strong style=\"\">THIS COURSE IS NOW UPGRADED FOR iOS7 </strong>  </p>  <ul style=\"\">  \t<li>Learn How To Program For Both IOS Mobile Devices And The Mac Operating System</li>  \t<li>Aimed Towards The Beginner, No Prior Experiance Required</li>  \t<li>Easy To Follow Lessons That Allow You To Learn At Your OwnPace</li>  </ul>  <p>  \t In this Objective-C programming training course expert author will teach you how to leverage the technologies that Objective-C, Xcode and the Apple Frameworks have to offer. This course focuses on the Objective-C programming language, utilizing Xcode and Frameworks wherever necessary to build your App.  </p>  <p>  \t You start the tutorial with a review of the Xcode interface, and how you are going to use it to build your Objective-C project. Jesse teaches you what Objective-C is, and the structure of an Objective-C App. Throughout this video tutorial you will learn about using declared properties and instance variables, how to manage memory, creating and working with classes, and how to use the debugger effectively. You will explore protocols and delegates, using blocks, handling exceptions, using selectors and much more!  </p>  <p>  \t Once you have completed this computer based training course on Objective-C programming, you will understand how to write Objective-C code, how to utilize provided Apple Frameworks and how to use Xcode to build your App.  </p>", 
    "end_date": null, 
    "title": "iOS 7 & Mac OS X Programming Tutorial - Objective C & Xcode", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38917_26d7_7.jpg", 
    "course_url": "https://www.udemy.com/programming-for-ios-and-mac-os-x-in-objective-c-and-xcode/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-29T18:57:56Z"
}