{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>LEARN TO DESIGN MOBILE APPS IN ONE DAY!</strong><br></p>\n\n<p><strong>**OVER 2,100 students! Course is now listed as a 'top instructor' course.**</strong></p>\n\n<p><strong>Overview: </strong></p>\n\n\n\n<p>Photoshop is seen as an intimidating and difficult tool that only experienced designers can use. However, what most people don't realise and other course instructors fail to teach is that anyone can design an app utilising <strong>only</strong><strong> 5 Photoshop features.</strong> <em>No need to learn unnecessary features you will never need. </em><br></p>\n\n\n\n<p><em></em></p>\n\n\n\n<p>This course will teach you the main tools needed to design an app in Photoshop, whilst laying the foundation for web and graphic design. Forget tedious and difficult courses; this course is <strong>concise and easy to follow.</strong> Section 3 consists of short step-by-step videos introducing the '5 main tools'. Students learning will be consolidated and mastered in Section 4 and 5 through walkthroughs of replicating popular app designs such as Facebook, Instagram, Tumblr ect. <strong>This course limits video watching and engages students through doing real design activities</strong>. <em>After all, you learn by doing!</em></p>\n\n\n\n<p><strong>Why this course?</strong></p>\n\n\n\n<p>I learnt Photoshop in an intensive three days through rapid reading, watching videos and relentless practice. I saw Photoshop as a vast and complex tool that I couldn't possibly learn. After three days I mastered the core tools needed to design apps plus more. Looking back, I wish that someone could have created a course that concisely shows you the only tools needed to design apps; instead of thinking you have to learn heaps and not knowing where to begin. </p>\n\n\n\n<p>Many instructors make long courses, often with 40+ videos. Whilst these videos may be helpful, they are often unnecessary and can be learnt in a only few short videos. <em>Learning isn't about watching videos</em>, it's about following the <strong>80:20 rule - 20% listening, reading and watching, and 80% applying. </strong><strong>This course features short, easy to follow videos.</strong> Afterwards, students <strong>master the skills</strong> learnt by applying their knowledge in recreating popular app designs in Photoshop. Learning is aided through step-by-step walkthroughs. </p>\n\n\n\n<p><strong>Hmmm....I'm still not convinced. Why your course? </strong><br></p>\n\n\n\n<p>Photoshop is seen as a tool for experienced designers and creative people only - but it's not, it's actually <strong>really simple!</strong> <em>This course is for <strong>beginners</strong> and those with <strong>zero experience.</strong> In one day you could go from zero experience to a pro designer ready to create real app designs, and maybe even web designs!</em></p>\n\n\n\n<p><strong>Okay, I'm nearly convinced. So what will I get out of this?</strong></p>\n\n\n\n<ul><li>You will learn all the necessary skills needed to design apps! </li><li>You will also have laid the foundation for other design work such as web and graphic design.</li><li>Includes necessary PSD's, JPEGs and helpful resources. </li><li>An entire community of students on the same boat! Having a problem with something? Post in the forum and you have the entire course community there to help - not to mention, myself! </li></ul>\n\n\n\n<p><strong>One day seems a bit too soon to learn such a difficult tool! Are you sure I can learn Photoshop in one day? </strong></p>\n\n\n\n<p>Absolutely. This course will teach you the only necessary tools needed to design apps. This course is self-paced, so if you want to take more than one day, it's completely up to you. To watch the entire course wouldn't take more than a couple of hours. </p>\n\n\n\n<p><strong><em>Recommended Timetable: </em></strong></p>\n\n\n\n<p>1.5-2.5 HOURS: Watch entire course and take notes. Don't touch Photoshop! </p>\n\n\n\n<p>1 HOUR: Re-watch Section 3 and make sure you understand whats being taught. Maybe even have a little practise. </p>\n\n\n\n<p>1-4 HOURS: Test your knowledge and start replicating the assigned designs. The time frame for replicating the designs is an estimate. Don't stress if it takes you longer. The main thing is you are making progress and sooner or later you will have mastered app design! </p>\n\n\n\n<p>How fast you learn is dependent on your own ability. What this course <strong>guarantees</strong> is that by the end of it, however long you may take, <strong>you will be able to design great apps. </strong></p>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "iOS 8 Mobile App Design for Beginners: Design 6 Apps", 
    "price": "20.00", 
    "instructors": "Simone Simmons", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622938_22dd_2.jpg", 
    "course_url": "https://www.udemy.com/app-design-in-one-day/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-26T10:19:15Z"
}