{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn the basic subjects about iOS and Cloud-based services that you will need to create powerful applications enhanced by the cloud.</p><p><strong>Build amazing apps that are empowered by cloud services with this tutorial for both beginners and experts that want to learn about cloud-services.</strong></p><ul><li>The Basics of the Swift Programming Language</li><li>Using Table Views</li><li>Core Data</li><li>Cloud-hosted Data Bases</li><li>Cloud Storage for photos and other files</li><li>Facebook, Twitter, Google and Microsoft Authentication</li></ul><p><strong>Powerful apps that your users will love</strong><br></p><p>Including cloud services inside your apps creates a better user experience that your users will appreciate. Having data in the cloud is amazing so your users can have the same things on their iPhone and on their iPad and even on their Android (if you develop your app for other platforms as well).</p><p>iOS is growing amazingly, so a lot of users could download your apps. You could even be hired as an iOS developers, those guys are very well paid.</p><p><strong>Content and overview</strong><br></p><p>Suitable for beginners or anyone who is barely starting on mobile app development. You'll learn the basics of the Swift programming language, the basics of app creation and you'll even create real-world basic apps.</p><p>Also suitable for experieced developers who want to learn what they can do by integrating powerful cloud services in their apps. You'll learn how you can acces cloud-hosted databases (and create thos databases), upload photos to a cloud storage service that YOU create, authenticate your users with Facebook or other services and more!</p><p>The courses flow is designed to take you from beginner (if you are one) to an experienced developer with apps that take advantage of the power of the cloud.</p><p>Work alonside the aouthor and you'll end up with 5 real-world apps. You will also have learnt how to create powerful iOS apps from the ground up.</p>", 
    "end_date": null, 
    "title": "iOS Apps Powered by Azure Cloud Services", 
    "price": "20.00", 
    "instructors": "Eduardo Rosas", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/547282_4d7f_3.jpg", 
    "course_url": "https://www.udemy.com/ios-apps-powerd-by-the-cloud/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T22:45:47Z"
}