{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Programming step by step</strong>  </p>  <p style=\"\">  \t<em style=\"\">iOS for Beginners</em> was prepared for <strong style=\"\">developers taking their first steps</strong> into the world of Apple. Multimedia materials have been developed with great care to explain step by step the various issues of iOS platform. This course is <strong style=\"\">full of theory and Case Studies</strong>, preview code created during exercise.  </p>  <p style=\"\">  \t<strong style=\"\">Comprehensive knowledge and solid base for everyone</strong>  </p>  <p style=\"\">  \t          Completion of the course provides a solid base and a comprehensive understanding of the <strong style=\"\">key issues of programming for iOS</strong>. Training is ideal for those who begin programming in Objective-C and have some programming skills. If you are just iOS enthusiasts who doesn&#039;t have any programming knowledge, you can also complete this course. You will <strong style=\"\">need a little motivation and willingness to learn:-) </strong>  </p>  <p style=\"\">  \t<strong style=\"\">What you will learn?</strong>  </p>  <p style=\"\">  \t          Our trainer will present you from scratch the architecture of iOS platform, will show you how to install the Xcode, how to get around it. Then you will find out what are t<strong style=\"\">he basic structure of the application</strong>, you will learn how to <strong style=\"\">create your first project</strong>, and run it on the simulator or on your own device. More about the course content in the section: What am I going to get from this course?  </p>  <p style=\"\">  \t<strong style=\"\">Why start to programming for iOS?</strong>  </p>  <p style=\"\">  \t          We know at leat 3 main reasons. IOS developer means <strong style=\"\">prestige, quality and high earnings</strong>.  </p>  <p style=\"\">  \t          For sure you know that Apple&#039;s software developers have the highest earnings in the mobile market, and users of iPhones and iPads are the group that most often getting paid games and apps.  </p>  <p style=\"\">  \t<strong style=\"\">The most comprehensive course for beginning iOS programmers. Full of basic theory and practice. Create your first application with Educativo trainer! Try it now!</strong>  </p>", 
    "end_date": null, 
    "title": "iOS - Programming for Beginners", 
    "price": "20.00", 
    "instructors": "Educativo Trainings, IT Security Academy", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/154570_efc3_3.jpg", 
    "course_url": "https://www.udemy.com/ios-programming-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-29T09:08:49Z"
}