{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>One of the most popular platform that people love to use is iOS. That is the reason why iOS apps are so popular and in high demand and probably <strong><em>that is the reason why you are here, because you want to learn how to develop iOS apps!</em></strong></p><p><strong><em>This course will help you kick start your app development journey in iOS platform for both iPhone &amp; iPad. </em></strong></p><p>iOS app development isn't tedious once you get past the setting up of the development environment and getting comfortable with the various tools that you can use.</p><p>We know that in the begining everything can seem hard beacuse you simply don't know where to start. That is just frustrating and keeps you off your way to developing your first app.</p><p>Our years of experience in app development have taught us the process of <em><strong>how to start with ease in iOS app development and that is exactly what we will teach you in this course.</strong></em></p><p>We have designed this special <strong><em>course for anyone who has the desire to learn iOS development</em></strong> and create apps. </p><p><strong>This course will walk you through:</strong></p><ul><li><strong>How to install and setup XCode, </strong></li><li><strong>De-mystify Interface Builder, UI Elements and other components of iOS development</strong></li><li><strong>How the various app templates work.</strong></li><li><strong>Develop an app for iPhone &amp; iPad</strong></li><li><strong>Build the app and use the Simulator</strong></li></ul><p><em><strong>Other benefits:</strong></em></p><ul><li><strong>Lifetime Access to all other updates!</strong></li><li><strong></strong><strong>FULL Support!</strong></li><li><strong>30 Day Money Back GUARANTEE if you feel this course didn't help you at all and you can't apply anything...that is how dedicated we are to your success!</strong></li></ul><p><em><strong><br></strong></em></p><p><em><strong>All of this in less than 3 hours (out of your busy schedule) of simple to follow lectures that YOU CAN APPLY from TODAY !</strong></em><br></p><p><em><strong>It's Time to take action!</strong></em></p><p><strong>PS: If, you follow this video course and perform the steps mentioned then you will be ready to go live with app development in less than 4 days!</strong></p><p><em><strong></strong></em></p>", 
    "end_date": null, 
    "title": "iOS for Beginners - How to create your own app", 
    "price": "20.00", 
    "instructors": "Sreeprakash Neelakantan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29563_96b3_5.jpg", 
    "course_url": "https://www.udemy.com/ios-for-beginners-with-free-email-support/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-13T22:27:03Z"
}