{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t Do you want to program iPhone  apps and iPad apps but are not sure where to start?  Are you ready to jump right into the exciting world of mobile development  but have little or no programming experience?  Then this is your course!  <br style=\"\">  \t <br style=\"\">  \t Our iOS Development Code Camp is the only course available that allows a non-programmer to learn the basics of programming and then create iOS  apps. The set of iOS app development tutorials  will teach you how to program iPhone  and iPad  apps. <br style=\"\">  \t <br style=\"\">  \t Starting with the very basics of C programming long-time technical trainer Mark Lassoff will take you through the fundamentals of programming iPhone apps.  Our iOS Development Code Camp  is truly three courses in one:  <br style=\"\">  \t <br style=\"\">  \t Course 1: Master the basics of the C language which almost all modern programming languages are based on.  The C section of the course alone contains almost 4 hours of video instruction and dozens of code examples.  In this section you will learn c programming.  <br style=\"\">  \t <br style=\"\">  \t Course 2: Learn Objective C programming the language that iPhone apps are coded in.  A superset of C Objective C is a powerful object oriented language.  The best iPhone programmers are Objective C masters and this part of the course will have you ready to create and understand iOS code.  <br style=\"\">  \t <br style=\"\">  \t Course 3: Discover how to program for iPhone and how to program for iPad .  This final part of the course applies what you learned about C and Objective C to create actual iOS apps . You&#039;ll review concepts that will allow your apps to functionwithin the iOS environment.  You&#039;ll also learn how to exploit the features available in the iPhone or iPad  hardware to make more comprehensive applications.  <br style=\"\">  \t <br style=\"\">  \t Begin programming iPhone and iPad apps today with this course which includes over 12 hours of video lecture over 25 engaging and fun lab exercises and almost 100 separate code examples. Our iOS app development tutorials are  designed to do one thing: Get you on your way to programming the iOS app of your dreams!  </p>", 
    "end_date": null, 
    "title": "iOS School: iOS Development Code Camp", 
    "price": "30.00", 
    "instructors": "LearnToProgram, Inc.", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/11562_9fe8_12.jpg", 
    "course_url": "https://www.udemy.com/ios-development-code-camp/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-12-01T22:28:59Z"
}