{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>iOS 9 and Swift 2 developers are some of the highest paid coders throughout the planet right now.  There couldn't be a better time to join the world of app development.</p><p><strong>About this iOS 9 &amp; Swift 2 Course</strong></p><p>You are going to learn everything you need to know to be able to work professionally as a Jr. iOS 9 developer.  Even if you aren't interested in a career change this course will give you the necessary skills to build and publish iPhone and iPad apps to the Apple App Store.</p><p>All concepts and apps built within this course are designed with careful purpose. You won't be learning some obscure concept just to learn that concept - you will learn the technologies and principles that actually <em>matter </em>when building professional applications.</p><p>You will learn Swift 2 and iOS 9.</p><p><strong>Why Choose this iOS 9 &amp; Swift 2 Course?</strong></p><p>So many programming courses are built by people who are just looking to make a buck. They learn the coding skills literally right before they teach them!  I am a professional iOS developer and have built <strong>58</strong> mobile apps to date with both Swift 2 and Objective-C. I also am a professional instructor at a coding bootcamp. I know what skills you will use in the industry (It is so important to learn Swift). I know how to help you learn. Most importantly, I am most interested in helping you change careers and/or increase your income.</p><p><em><strong>Students I have helped have jumped from as little as $32,000 a year to $85,000 a year in a matter of months.</strong></em></p><p>Other courses take you from A-Z teaching you each iOS concept one by one. This is not effective for retaining knowledge - information overload. This course will teach you iOS 9 and programming concepts in the order of importance - what potential employers are looking for and the core skills you need to make professional applications. Then you will test against those principles and build exercises to practice what you have learned. We will cover all of iOS 9 and Swift 2, but everything is prioritized for your benefit.</p><p><strong>iOS 9 &amp; Swift 2 Course Structure</strong></p><p>You should watch the concepts and follow along building what we build in the videos.  Then build the exercises and do the warmups on your own. If you really want to become a <em>great</em> iOS &amp; Swift developer watch the concepts, and then do the exercises, warmups, and quizzes.</p><p><em>Warmups</em></p><p>Warmups will help you learn how to think like a programmer and are more algorithmic based. It is important to keep training your brain.</p><p><em>Quizzes</em></p><p>This course will be treated as closely to an live in-person course as possible.  After each core principle is taught you will be given real industry-standard interview questions, meaning questions that you would likely be asked in a iOS development job interview.</p><p><em>Exercises</em></p><p>At the end of each core principle you will be given an exercise that you must build that demonstrates the skills you have just learned.</p><p><strong>Testimonials for this iOS 9 &amp; Swift 2 Course</strong></p><p><em>\"This course helped me to get my first job as an iOS Developer, I am really happy with it, it is the best course you can get if you want to switch careers and make cool stuff with Xcode and Swift. It really covers everything you need.</em><em>\" - Rigoberto<span></span></em><br></p><p><em>\"Mark has helped me learn several technologies. Not only he has wide array of technologies under his belt but also he has amazing teaching skills. Every class Mark taught, class material was covered step by step and with implementation. That really helped me understand what I was learning. Moreover, he is energetic and passionate about making learning process fun.\" - Amit Chaudhari</em></p><hr><p><em>\"It is obvious that he is passionate about teaching coding. He makes sometimes dry subjects very entertaining with his humor and overall teaching style. He never loses patience with students and takes the time to make sure you understand. <br>Mark also goes the extra mile with students. Whenever I would be stuck or in need of help on a project he would take time to help me. I was lucky he took the time to get to know me and assist in the understand subjects I had difficulty with.\" - Jacob Evans</em></p><hr><p><em>\"...More impressive is his ability to teach. He's patient, optimistic, and able to take complex ideas and teach them with examples and in ways that are digestible, energetic, and fun. He's taught bootcamps and mentored many developers that I know. As a teacher and mentor, I couldn't give anyone a higher recommendation. If you can enlist his tutelage, you're in good hands.\" - </em><em>Jonathan Wood</em></p><p><em>\"Mark is a smart, experienced, patient mentor, teacher and iOS Engineer. As I have gone from knowing nothing about iOS to full fledge iOS engineer Mark has been there every step of the way to both guide and encourage.\" - </em><em>Pearson Basham creator of NoThyme iOS App</em></p><hr><p><em>\"He has this way of teaching that captivates your attention and makes all the ones and zeros come to life. Mark taught me that learning computer science doesn't have to be the way it was in college, simply put: boring, time-consuming, and overwhelming. He mentored me in the course materials and I am an even better developer today and I make a lot more money too, all because of the example Mark set and the individual time he spent with me. <br><br>Seriously, an hour spent with this man teaching you technical subjects will be worth 100 hours spent in another course or bootcamp taught by someone else\" - </em><em>Erik Slack</em></p><p><em><br></em></p>", 
    "end_date": null, 
    "title": "iOS 9 and Swift 2: From Beginner to Paid Professional", 
    "price": "35.00", 
    "instructors": "Mark Price", 
    "commitment": "51.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555100_bdbe_5.jpg", 
    "course_url": "https://www.udemy.com/ios9-swift/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T05:32:36Z"
}