{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>***Realizado con la ultima versión de Xcode - iOS 9 &amp; Swift 2***</strong></p><p>Udemy ha querido unir sus bestsellers absolutos en iOS: </p><ul><li>El curso de iOS en inglés más vendido y mejor valorado en la plataforma - <strong>The Complete iOS 8 and Swift Course: Learn by Building 15 Real World Apps.</strong></li><li><strong></strong>Y los creadores del Curso iOS en español <strong>Programación iOS para iPhone &amp; iPad,</strong> bestseller absoluto entre todos los cursos en español de Udemy;  <strong>KeepCoding. </strong> </li></ul><p>Y el resultado es esta versión en Español de dicho bestseller llevada a cabo por un experto instructor<strong> KeepCoding, Juan José Ramirez. </strong></p><p><strong>Bienvenidos a...</strong><strong>iOS 9 y Swift 2 Completo: Aprende creando 15 Apps Reales</strong></p><p>Crearás<strong> hasta 15 Apps profesionales, divertidas y relevantes </strong>que te permitirán poner en práctica todos los conocimientos adquiridos a lo largo del curso y formar un portafolio sólido para comenzar tu carrera en desarrollo mobile.</p><p><strong>Más de 80.000 personas han disfrutado este curso en inglés.</strong> Ahora es tu oportunidad de aprenderlo en español, con el soporte permanente de Instructores que hablan tu idioma, y por supuesto con la calidad KeepCoding.</p><p><strong>APRENDERÁS DESARROLLANDO</strong>. Está diseñado de manera tal que conocerás nuevos conceptos y podrás aplicarlos en un desarrollo real a tu propio ritmo y practicando inmediatamente.</p><p>A lo largo del curso verás temas como :</p><ul><li>XCode e Interface Builder</li><li>Inputs, Buttons, y Reactive Interfaces</li><li>El nuevo language de programación de Apple: Swift</li><li>Variables, Arreglos (Arrays), Tablas y Loops</li><li>Navegacion, Almacenamiento y Live Content</li><li>Imagenes, Mapas y Musica</li><li>Acelerometros y Motion Feedback</li><li>Core Data y JSON</li><li>Almacenamiento Online con Parse</li><li>Juegos y Sprite Kit</li><li>Clones de Instagram, Snapchat y muchos más...</li></ul>          <p><strong></strong></p><p><strong><strong>iOS 9 y Swift 2</strong>: Aprende creando 15 Apps reales es un bestseller en su versión e inglés y ahora lo tienes disponible también en Español.</strong></p><p>Tu empleabilidad en el ámbito del desarrollo móvil aumentará de manera exponencial.</p><p><strong>Harás aplicaciones y juegos que usan contenido web, animación y geolocalización.</strong></p><p>Comenzarás creando apps sencillas pero potentes que te hagan practicar todos los conceptos: una App capaz de calcular la edad de un gato, lista de tareas interactiva, herramienta para revisar el clima en tiempo real, un juego de tres en raya y un lector de blogs.</p><p><strong>Desarrollarás clones de las aplicaciones más populares: Instagram, Tinder con Log in a través de Facebook, Flappy Bird y Snapchat.</strong></p><p>Nuestra especialidad en KeepCoding es hacer cursos de éxito ¿Nuestro secreto? Proporcionar una base muy sólida en aquellos conceptos que de verdad son importantes y los más difíciles de asimilar por cuenta propia.</p><p><strong>¡Matricúlate ya y continúa tu camino como desarrollador de élite!</strong></p>", 
    "end_date": null, 
    "title": "iOS 9 y Swift 2 Completo: Aprende creando 15 Apps reales", 
    "price": "50.00", 
    "instructors": "Juan José  Ramírez, Rob Percival, KeepCoding Online", 
    "commitment": "23 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499888_630f_3.jpg", 
    "course_url": "https://www.udemy.com/curso-completo-desarrollador-ios-15-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T12:25:14Z"
}