{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>\n</p>\n\n<p>\n</p>\n\n\n\n\n\n\n\n\n\n<p>Hello, My name is Yohann, I will be your instructor.</p>\n\n\n\n\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n\n\n\n\n<p>This course is not just about learning programming with iOS 10 and Swift 3. This course unlike any other course, teaches you how to make real useful apps using the new iOS 10 features.</p>\n\n\n\n\n\n\n\n\n\n<p>We will be using both objective-C and the new Swift 3 language. </p>\n\n\n\n\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n\n\n\n\n<p>You will learn how to use  the new messages framework where you'll get to make iOS 10 sticker packs. Get to make sticker apps in no time and get to sell them in the new app store called the messages app store which the media has named as the new gold rush, full of opportunities, let's do this together.</p>\n\n\n\n\n\n\n\n\n\n<p>Then you will learn how to make advanced messages app extensions that where you'll get to customize message conversation changing backgrounds, adding stickers, and animations.</p>\n\n\n\n\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n\n\n\n\n<p>Then we will introduce the new iOS 10 Siri Kit. You will get to program Siri to send commands to your app. For example, if you want to  send commands to play / pause the video,  or start / stop a workout session.</p>\n\n\n\n\n\n\n\n\n\n<p>Then you will learn how to use Speech recognition. You will make an app that will take your voice from the microphone and automatically translate it into text. Isn't it amazing?</p>\n\n\n\n\n\n\n\n\n\n<p>Finally, you will learn how to bake app store SEO techniques right within your app to give your app more exposure in the iTunes app store which will drive more downloads and potentially more revenue.</p>\n\n\n\n\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n\n\n\n\n<p>As we go through the creation of these apps, you also get to learn Swift 3 as I go over the differences between the old Swift and the new one.</p>\n\n\n\n\n\n\n\n\n\n<p> </p>\n\n\n\n\n\n\n\n\n\n<p>Now is the perfect time to learn of these amazing skills. If you need help, my students can tell you that I'm always available in the forums.</p>\n\n\n\n\n\n\n\n\n\n<p>And this course comes with a full refund if you're not satisfied, You've got nothing to loose.</p>\n\n\n\n\n\n\n\n\n\n<p>Join now and let's get started.</p>", 
    "end_date": null, 
    "title": "iOS 10 Swift 3 hands on features - Siri Kit , Messages , ...", 
    "price": "50.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/883130_6e9c_4.jpg", 
    "course_url": "https://www.udemy.com/ios-10-swift-3-hands-on-features-siri-kit-messages/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-20T12:46:19Z"
}