{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>Update July 2015 - Added lessons on how to publish hybrid apps on iOS and Android using Cordova and the Intel XDK</em></p><p>-</p><p>  \t<em>Make those apps you've always wanted, and sell them on the App Store and on the Google Playstore. Get started TODAY.</em>  </p>  <p>  \t  In this couse, you'll learn how to create HTML5 apps for iPhone, iPad, Android devices and the web. The course is aimed for both beginners and people with some web development experience.  </p>  <p>  \t  Some of the topics we cover:  </p>  <ul>  \t<li>HTML, CSS and JavaScript from scratch.</li>  \t<li>HTML5 semantic elements.</li>  \t<li>HTML5 video and audio.</li>  \t<li>CSS3 containers.</li>  \t<li>JQuery from scratch.</li>  \t<li>JQuery Mobile to create professional looking user interfaces.</li>  \t<li>Geolocation.</li>  \t<li>Camera access.</li>  \t<li>Offline storage.</li>  \t<li>Cloud-enable your app: user login, user signup, photo sharing and more</li><li>Understand what <strong>hybrid apps</strong> are</li><li>Learn the difference between Android and Crosswalk app building.</li><li>Build your apps for iOS and Android using <strong>Cordova</strong> and the <strong>Intel XDK</strong> tool.</li>  \t<li>Publish your apps in the <strong>App Store</strong> and the <strong>Google Playstore</strong>.</li>  </ul>  <p>  \t  In addition, this course covers the creation of two HTML5 sample apps that you can use as starters for your own projects:  </p>  <ul>  \t<li>Cooking recipie app which uses JQuery Mobile and Offline Storage.</li>  \t<li>Photo sharing app built with JQuery Mobile and Appcelerator Cloud Services to share photos and create users in the cloud.</li>  </ul>  <p>  \t  This course was created by Pablo Farias Navarro, founder and CEO of ZENVA. Over 100k students are taking our high-quality courses in HTML5, mobile apps and game development.  </p>  ", 
    "end_date": null, 
    "title": "iOS and Android HTML5 Apps for Beginners", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22021_da68_4.jpg", 
    "course_url": "https://www.udemy.com/iphone-and-android-html5-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-30T21:33:54Z"
}