{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>I will teach you everything you need to know about app development in just 5 hours. WHY spend 20 hours on other courses that are simply filled with endless blabber??</strong>\n</p>\n\n<p>--------------------------------------------------------</p>\n\n<p>You will go from beginner to <strong>completely</strong> published on the App Store. <strong>NO OTHER COURSE</strong> takes you all the way through the process, and what's more - with a published money generating app :)</p>\n\n\n\n<p>Join over a thousand students who have already benefitted from having a published app making them money while they sleep!</p>\n\n\n\n<p>-----------<strong>Review of this course</strong>--------------</p>\n\n\n\n<p><em>I am a beginner in iOS development with very little programing experience and I thought this course was awesome because it is easy to follow and actually goes through the whole process. The app demo built in this course is actually a real app you can download on the App Store.</em><em></em><br></p>\n\n\n\n<p>------------------------------------------------------</p>\n\n\n\n<p>Stop buying 'How to code 100 iOS apps in 10 days' courses...<br></p>\n\n\n\n<p>There is so much more to iOS app development than just code after code tutorial!</p>\n\n\n\n<p>That's why I created this course! No other Xcode or Swift app course takes <strong>you</strong> from beginner (with no experience) to published. They only show you 'How to develop an iOS app', wth no reference to all the other parts such as:</p>\n\n\n\n<ul><li>Signing an iOS app</li><li>Becoming an Apple developer</li><li>Installing Apple development certificates</li><li>Submitting an app to Apple for review</li><li>Marketing your iOS app through the app listing</li></ul>\n\n\n\n<p>Join this course and you will learn all of the above and more!<br><br></p>\n\n\n\n<p><strong>This course is for you if you want to: </strong></p>\n\n\n\n<ul><li>Learn the Apple iOS development process - from complete beginner to App Store publishing (no-one else does this, they only show 'how to code' app tutorials)</li><li>Get paid $100 - $150 per hour to make apps for paying clients</li><li>Create your own wildly popular apps</li><li>See the whole iOS development process <em>as it really is</em>.</li><li>Have a real iOS app you can release on the App Store under your own account</li></ul>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>This course is <em>not</em> for you if:</strong></p>\n\n\n\n<ul><li>You are an expert or intermediate iOS programmer</li></ul>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>What makes this course different?</strong></p>\n\n\n\n<p>It reveals the true nature of app development - an involved process with many design and usability iterations. Top clients (those with money) will expect a certain level of professionalism and do not mind large bills to match if you bring them value.</p>\n\n\n\n<p>That's why you should take this course, it gives you far more than just iOS app coding skills. It makes you competent in other areas such as:</p>\n\n\n\n<ul><li>iOS app graphical design</li><li>iOS app user experience</li><li>Ability to estimate how much time you'll spend making an app</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Why do you need the above?</strong></p>\n\n\n\n<p>Clients will pay far more money if you can show you're a complete package!</p>\n\n\n\n<p>For example, my last invoice amounted to £18,000 for a simple, unpublished version 1 iOS app written in Swift. It was paid off immediately with the App project manager commenting 'great value and cheaper than large studios'. He loved it because we had gone through several design stages beforehand, allowing him to get exactly what he envisioned.</p>\n\n\n\n<p>If I had simply presented my 'app coding abilities' I would have only been able to charge one third of that amount.</p>\n\n\n\n<p>The reality is that making beautiful apps allows you to charge far more <strong>and </strong>produce fantastic looking work.</p>\n\n\n\n<p>That work becomes your calling card, with clients seeking you out instead of the other way around.<br><br></p>\n\n\n\n<p><strong>The extras you get when taking this course:</strong><br></p>\n\n\n\n<ul><li>I break down some industry guidelines you should follow when creating an app (hint: we borrow from other creative industries).</li><li>You learn to think outside the box, giving you an advantage over all your competitors</li><li>A good basic grounding in iOS Xcode app development (and the Swift language)</li><li>An app you can actually publish yourself!</li></ul>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "iOS App Development - A Published RSS Reader App", 
    "price": "20.00", 
    "instructors": "Mr Grant Klimaytys", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685882_1fb4.jpg", 
    "course_url": "https://www.udemy.com/beautiful-ios-9-apps-with-swift-and-xcode-7-beginner-to-published/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-01T09:07:38Z"
}