{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>-----  UPDATED COURSE with FIREBASE    06.04.2016   -------</strong></p>\n\n<p><strong>------ MOBILE ACTION APPSTORE INTELLIGENCE TOOL  - $39  WORTH -  PROMO CODE INCLUDED -----</strong></p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p>Learn in Fast Track the basic concepts of<strong> iOS and Swift 2 </strong>and integration with <strong>Firebase</strong> that you will need to build fully functional mobile app for <strong>iPhone and iPad!</strong><br></p>\n\n<p><strong>-   All lectures are programmed with Swift 2!</strong></p>\n\n<p><strong></strong><strong>-   No Programming Experience needed!</strong></p>\n\n<p><strong></strong><strong>-   Projects explained in Lectures can be downloaded!</strong></p>\n\n<p><strong>-   Application ideas included which are quick to be monetised!</strong></p>\n\n<p><strong><br></strong></p>\n\n<p><strong>Learn in a realistic way, Learn Fast!</strong><br></p>\n\n<p>Swift is the new language of the future, and with this course you will learn the fundamentals of Swift just from the beginning in easy to understand step by step format.</p>\n\n<p>This course assumes you have no programming experience, so its perfect for the beginner. It is also a nice fit for the intermediate as well, who is looking for unique coding ideas.</p>\n\n<p>If you are frustrated from iOS you will see with this course how easy it is to make an app!</p>\n\n<p><strong>Content and Overview</strong></p>\n\n<p>We will begin with creating a basic app and then go deep dive with Swift and iOS. Then we will learn using Gestures, Version Control Systems and then using MapKit library and finally we will work with <strong>Firebase</strong> which is one of the most popular and easy to work backend server.</p>\n\n<p>Additional resources, quizzes, and assignments will be given through out the course to continually test your knowledge.</p>\n\n<p>This course gives a realistic approach to the student : It shows which mistakes you may make and how you should handle them. It teaches you how to be a good programmer who is doing research!</p>\n\n<p><strong>Application ideas which are quick to be monetised are waiting for you!</strong></p>\n\n<p>At the end of the course you will be able to program all application ideas included in the course and earn money from them if you submit them to AppStore as paid applications!</p>\n\n<p>By adding some of your own creativity and data, you will be transformed into an Apple Developer in a very short time!</p>", 
    "end_date": null, 
    "title": "iOS 9, Swift 2 and Firebase - Build a Tinder-like App", 
    "price": "20.00", 
    "instructors": "Muge Cevik", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659942_e39b_4.jpg", 
    "course_url": "https://www.udemy.com/ios-app-with-swift-2-and-parse-learn-in-fast-track/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T11:07:48Z"
}