{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Mobile app development is the present - and the future.</p><p style=\"\">If you&#039;re looking to enter or upgrade your stance in the iPhone and iPad app marketplace, then this is the course for you.</p><p style=\"\">My name is Jason, and I&#039;ll be guiding you through this journey of techno improvement.</p><p style=\"\">We&#039;ll learn the latest Xcode, currently version 7. The cutting edge Swift 2 programming language. And the new iOS 9 operating system for the Apple suite of mobile products.</p><p style=\"\">In this course you can go from knowing no code, to being able to confidently code any app you can dream of.</p><p style=\"\">We&#039;ll cover the basics of Swift 2, and the more in depth concepts and frameworks developed for the Apple iPhone and iPad.</p><p style=\"\">You&#039;ll learn to code about ten different apps, each teaching you something new. This is core code development taught in a style where you effortlessly learn the concepts.</p><p style=\"\">Want to learn how to add images using core data? It&#039;s in here. How about add a web page to your app, or how about a map, we&#039;ve got you covered.</p><p style=\"\">From basics to high level code, you&#039;ll know how to code the app of your dreams, and be able to put it in the Apple App Store if you want.</p><p style=\"\">With nearly 18 hours of video content and counting, this course never stops. Student suggestions quickly make their way into new topics, and support is always just a click away.</p><p style=\"\">You&#039;ve made it this far, take the time to invest in yourself and your future, enroll today.</p>", 
    "end_date": null, 
    "title": "iOS 9, Swift 2, and Xcode 7 - Apple Mobile App Development", 
    "price": "20.00", 
    "instructors": "Jason Rybka", 
    "commitment": "17 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572462_f9ae.jpg", 
    "course_url": "https://www.udemy.com/apple-mobile-app-development-with-swift-xcode-and-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T14:45:55Z"
}