{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>I will teach you everything you need to know about app development in just 2.5 hours. WHY spend 20 hours on other courses that are simply filled with endless blabber??</strong><br></p><p>-------------------------------</p><p>Does coding scare you? Think apps can only be made by geeks? Well I'm here to change that!</p>\n\n<p>Learn the basic concepts, tools, and functions that you will need to build fully functional iOS apps with the popular programming language, Swift 2. </p>\n\n<p>-------------------------------</p>\n\n<p><strong>I assume you are a complete and utter beginner. So much so that fancy words like 'object orientation' and 'delegate' mean nothing to you! This course is the ideal way to learn programming - BONUS - You'll have an app by the end of it!</strong></p>\n\n<p>-------------------------------</p>\n\n<p><strong>Things You'll Learn</strong></p>\n\n<ul><li>Xcode Installation on a Mac</li><li>Variables</li><li>Functions or Methods</li><li>Basic App Creation</li><li>Complex App Creation (you'll make a full calculator app!)</li></ul>\n\n<p><strong>A Powerful Skill at Your Fingertips </strong><br>Learning to program in Swift 2 for iOS apps puts power in your pocket. You will have the ability to make your own apps (that make money) or hire yourself out at $60 - $150 per hour.</p>\n\n<p><strong>Content and Overview </strong><br>I must repeat - this course is for complete and utter beginners only!</p>\n\n<p>You will be taken on a journey through:</p>\n\n<ul><li>What programming is (it's quite simple, really)</li><li>How to write really simple programs (before we start making an app)</li><li>How to make the worlds simplest app</li><li>How to make a temperature converter app</li><li>How to make a fully featured calculator app</li></ul>\n\n<p>Suitable for beginning programmers, through this course will give you the fundamentals of programming. It establishes a strong understanding of app creation concepts and includes big, fancy words like \"object-oriented programming (OOP)\". Each chapter closes with a small exercise, helping you put your new learned skills into practical use immediately. </p>\n\n<p>With these basics mastered, the course will take you through app flow control by teaching you how to use if statements and lots of other little programming nuggets of information.<br></p>\n\n<p>Students completing this course will have the knowledge to create their own apps and create apps for paying customers.</p>\n\n<p>All the source code is included in zip files so you can compare it with yours.</p>\n\n<p>Join today and never look back!</p>\n\n<p>Credit: Promo music provided by bensound</p>", 
    "end_date": null, 
    "title": "iOS App Development For Complete & Utter Coding Beginners", 
    "price": "20.00", 
    "instructors": "Mr Grant Klimaytys", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744698_e4a5.jpg", 
    "course_url": "https://www.udemy.com/ios-app-development-for-complete-and-utter-coding-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T11:38:06Z"
}