{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">** CHECK OUT THE FIRST VIDEO TO SEE WHAT YOU WILL DEVELOP IN THIS COURSE **</strong></p><p style=\"\">Looking to become an App Developer? Or maybe you just want to improve your app developing skills and would like to learn how to build some additional apps? </p><p style=\"\">Look what my Students say:</p><p style=\"\"><br style=\"\"></p><p style=\"\"><em style=\"\"><strong style=\"\">Worth every Penny</strong></em></p><p style=\"\"><em style=\"\">this course is great. I started learning to program with this course and had to learn, that it was much easier than I always thought. Denis brings across the topics in a very easy and fun way and building the apps by following the course is just awesome. I can highly recommend the course!</em></p><p style=\"\"><br style=\"\"></p><p style=\"\"><em style=\"\"><strong style=\"\">One-stop-shop to become awesome at iOS9!!</strong></em></p><p style=\"\"><em style=\"\">This course was something I had been searching for .. and here it is. Really clear, easy to follow and most importantly super relevant to what I wanted.</em></p><p style=\"\"><em style=\"\">The quality of the course was great and was delivered and a good pace. The information provided about developing in iOS9 was detailed and to the point.</em></p><p style=\"\"><em style=\"\">Denis is an awesome instructor and I hope there will be more to come!</em></p><p style=\"\"><br style=\"\"></p><p style=\"\"> <strong style=\"\">Join us now, be part of the success, don&#039;t get left behind.</strong><br style=\"\"></p><p style=\"\"> <strong style=\"\">NOW is the time!</strong> <strong style=\"\">Get ready to create amazing iOS9 Apps.</strong>  With this iOS9 course you will learn to build 12 awesome, marketable and real apps for the iPhone and iPad. And the best thing about it is, you do that on the BEST and MOST USER-FRIENDLY Platform.</p><p style=\"\">I am talking about<strong style=\"\"> Xcode 7 and Swift2</strong>. This environment makes it really easy to start programming, even if you are a complete newbie. If you aren&#039;t and have worked with other tools, you will instantly fall in love with Xcode and Swift2.   Apple has been working for years to learn from the best programming languages and has created their own amazing one – SWIFT!</p><p style=\"\">Are you excited yet? You should be, as the time to become an app developer has never been better. There are hundreds of million iOS users out there, and you can reach them as easy as never before.</p><p style=\"\"><strong style=\"\">DON&#039;T MISS OUT </strong>on this great opportunity and sign up today and build your own awesome and successful apps.</p><p style=\"\">No matter if you want to become the next Mark Zuckerberg and build a new Facebook, Twitter or Whatsapp, or just want to start a new career to make more money or even just want to build some fun applications – here is the right place to start your journey!</p><p style=\"\"><strong style=\"\">Fun, easy to follow and effective</strong></p><p style=\"\">The apps we build are fun and entertaining and you will learn building them in a very easy to follow fashion, as I take you by the hand and explain every single thing I do in the course, and why I do it. Check it out for yourself J</p><p style=\"\"><strong style=\"\">The All-In-One iOS9 Developer Course</strong> is the best way to learn building your own apps. You learn EVERYTHING you need to know to start creating successful apps with millions of downloads – which make you serious money!</p><p style=\"\">You are a developer already? Great, then this is the perfect place for you to go from good to great!  </p><p style=\"\"><strong style=\"\">Speed it up, or slow it down</strong></p><p style=\"\">You get immediate Access to over 150 Lectures and more than 20 hours of content each developed with you in mind, to bring you from where you are, to where you want to be, regarding building iOS apps.</p><p style=\"\">You will enjoy the videos as you will not get lost and will have fun programming along and seeing instant results. Consuming them in your own speed and way.</p><p style=\"\">Throughout the course you will build upon knowledge into bigger apps using different technologies, such as MapKit, Parse, etc.. Together these technologies will allow you to create apps like many on the top 100 lists of the App Store.</p><p style=\"\"> <strong style=\"\">From Beginner to iOS Developer in 30 Days</strong></p><ul style=\"\"><li style=\"\">Xcode and Interface Builder</li><li style=\"\">Buttons, user input, and adaptive UI</li><li style=\"\">Variables, tables, touch gestures, and Auto Layout</li><li style=\"\">Swift2: The latest version of Apple&#039;s new programming language (the future of iOS)</li><li style=\"\">Maps, web content and storage</li><li style=\"\">Images and animations</li><li style=\"\">XML and JSON</li><li style=\"\">App Store submission</li><li style=\"\">Making a Marketing Website For Your App</li><li style=\"\">Playing Music</li><li style=\"\">Games with Sprite Kit</li><li style=\"\">Recording Sound</li></ul><p style=\"\">I promise that you will never have to waste your time and hard earned money to buy difficult to read and boring books or expensive online courses which dont deliver. With this <strong style=\"\">All-In-One iOS9 Developer Course</strong> you will learn everything you need within this amazing platform, which makes it super easy to navigate and find information you need.   <strong style=\"\">Super friendly, responsive and fast support by email and in the Udemy Discussios!</strong></p><p style=\"\"><strong style=\"\">MY MISSION IS MAKING YOU AN iOS APP DEVELOPER</strong></p><p style=\"\">You only need to sign in and become part of this amazing group of thriving App developers in the course!</p>", 
    "end_date": null, 
    "title": "iOS9 and Swift2 Developer Course - Make 13 Awesome Real Apps", 
    "price": "30.00", 
    "instructors": "Denis Panjuta, Panjutorials – Tutorial-Plattform", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403186_9410_9.jpg", 
    "course_url": "https://www.udemy.com/all-in-one-ios9-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T21:47:25Z"
}