{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Hey everyone!</p><p><br></p><p>My name is David Kababyan, I am developing iOS applications for more then 2 years now. This is my second course on Udemy. We are going to build eWallet application for iPhone, iPad and iPod Touch.</p><p>If you want to learn how to Build AppStore ready app for less then 2 hours, then this course is for you!</p><p>All you need to have is a Mac computer and xCode software (free from app store)!</p><p>We will be using the latest version of xCode 7.1 and Swift 2.0!</p><p>No previous experience is required. I will show you all you need to build your dream application!</p><p>In this course you will learn:</p><ul><li>CoreData</li><li>NSUserDefaults (to save your app settings)</li><li>AutoLayout</li><li>TableViews</li><li>UISegmentedController</li><li>NSFetchedResultsController</li><li>UIPickerView</li><li>UITextfieldDelegats  </li><li>Create your own UITableViewCells</li></ul><p>We are going to build eWallet app where you can save your incomes and expenses right in your mobile. I will show you how to add, edit and delete your entries in CoreData. </p><p>We will go through this app step by step and build AppStore ready app from scratch! I will show you how to find and fix the bugs in the application.  </p><p>Most of the courses out there doesnt teach you how to build a real world application. Here we are going to build very useful application and submit it to app store. The final version of the application can be found in AppStore under the name of Wallet+</p><p>After this course you will have the knowledge to build your dream app, or to modify an existing application to bring it to all new level.</p><p>If you have any questions regarding the course, fill free to ask me any questions, I am here to help you and guide you through this course!</p><p>David</p>", 
    "end_date": null, 
    "title": "iOS9 & Swift 2.0 Build eWallet App", 
    "price": "20.00", 
    "instructors": "David Kababyan", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657702_50fc.jpg", 
    "course_url": "https://www.udemy.com/ios9-swift-20-build-ewallet-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T12:34:51Z"
}