{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Are you an iPhone developer, or are you aspiring to be one? Do you have or hope to have an app in the app store sometime soon? If so, then you already know that creating an app that works well with the iPad is crucial.</p><p>In 2016, there are projected to be <strong>80 million iPad users in the United States alone</strong>. With Apple's recently announced iPad Pro, and constant effort to innovate and improve the iPad experience, there are many beautiful opportunities to be on the front line with the world of iPad programming.</p><p>In this class, we'll very quickly get you up to speed on what you need to know to make sure your apps work well with the iPad. <br></p><p><em>Some of what we'll cover:</em><br></p><ul><li>How to make your apps work for both the iPhone and the iPad</li><li>Designing with the iPad in mind</li><li>How to optimize for Multi-Tasking functionality</li><li>UISplitViewControllers</li><li>UIPopoverControllers</li><li>All for iOS 9 and Swift apps</li></ul><p><em><br></em></p><p><em>What makes me the right teacher?</em><br></p><ul><li>I have more than 9 iOS apps in the App Store which total over 300,000+ downloads</li><li>I teach more than 23,000 other students in my conglomerate of highly rated iOS development Udemy courses</li><li>I like to use, *ahem*, an energetic and engaging course style</li><li>I have 4+ years iOS development experience</li><li>I'll <em>never</em> talk over your head.</li></ul><p><em></em></p><p><em>Who is this class for?</em></p><ul><li>Those who already have an app or hope to make an app that they want to <strong>be available to the millions of worldwide iPad users</strong></li><li>Those who understand iPhone development. This class will not be of use to you if you don't learn how to make apps elsewhere (I'd recommend my iOS 9 class!)</li><li>Those who intend to learn iPhone development outside of this class. Use this class to make sure you're making your apps useful for the iPad as you learn iPhone development elsewhere (like my iOS 9 class!)</li><li>Those who want to make money with their apps as an entrepreneur</li><li>Career development professionals who want to earn money professionally via contract work, consulting, full-time employment, and so forth</li></ul>", 
    "end_date": null, 
    "title": "iPad Programming for iPhone Developers - Extend Your Reach", 
    "price": "20.00", 
    "instructors": "Rick Walter", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620668_57a0_4.jpg", 
    "course_url": "https://www.udemy.com/ios9-ios-9-ipad-programming-for-swift-iphone-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T20:33:23Z"
}