{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Are you ready for an adventure?! Join Udemy&#039;s <strong style=\"\">most enjoyable class</strong> and learn how to make your own freaking iPhone apps! <strong style=\"\">No prior programming experience necessary</strong>.</p><p>We&#039;ll walk you through everything needed to create and submit your very own app idea to the app store, starting from scratch. We firmly believe in learning by doing, so we&#039;ll make <strong style=\"\">14 real world iOS 9 apps using Swift 2 and Xcode 7 </strong>together.</p><p>We run through every single step from installing Xcode (the program we use to make apps) down to how to make money with your apps. <strong style=\"\">And we&#039;ll never talk over your head.</strong> We&#039;ve experienced the harsh reality of complicated and wordy tutorials and online classes. <strong style=\"\">This class is what we wish we&#039;d had when we were first learning to make apps</strong>. It&#039;s the first class to break everything down to the level that is perfect for &quot;newbies&quot; so that you never feel lost, and can excel and learn quickly.</p><p><strong style=\"\"><em style=\"\">Some of what we&#039;ll cover in our apps:</em></strong></p> <ul style=\"\"> <li>GPS Navigation</li> <li>Using the Camera</li> <li>Using the Microphone</li> <li>Integrating with Social Media</li> <li>In-App Purchases</li> <li>Bluetooth</li> <li>Games</li> <li>Making Social Networks with Parse</li> <li>More (you can look through the sections below)</li> </ul> <p></p><p>But ultimately we are not just checking off apps. We are helping you to move toward sustainable growth and becoming a professional in iOS development. We&#039;ll help you get integrated with the iOS developer community and provide you with the resources you need to accomplish your goals.</p><p><strong style=\"\"><em style=\"\">What makes us (Jenna and Rick) the right teachers?</em></strong></p> <ul style=\"\"> <li>We have more than <strong style=\"\">10</strong><strong style=\"\"> iOS apps in the App Store</strong> which total over <strong style=\"\">300,000+ downloads</strong></li> <li>Rick teaches more than 23,000 other students in his conglomerate of highly rated iOS development Udemy courses</li> <li>We have personality! We like to use, *ahem*, an energetic and engaging course style </li> <li>We have 6+ years iOS development experience</li> <li>We were once newbies who got confused by wordy blog posts and tutorials. We&#039;ll<strong style=\"\"> <em style=\"\">never</em> talk over your head.</strong></li> <li>Rick created the first Udemy Swift course and also teaches the highly rated “Apple Watch - Go From Newbie to Pro by Building 15 Apps&quot; course.</li> </ul> <p><strong style=\"\"><em style=\"\"></em></strong></p><p><strong style=\"\"><em style=\"\">Who is this class for?</em></strong></p> <ul style=\"\"> <li><strong style=\"\">People who want to make apps</strong>. We will not be teaching wordy or complicated computer science philosophies. We&#039;ll cover how to make apps that you can play with, share with friends &amp; family, and offer to the world!</li> <li><strong style=\"\">Beginners.</strong> You don&#039;t need any programming experience to take this class. We&#039;ve been the absolute beginners before and want to help you.</li> <li>Those <strong style=\"\">programmers who are new to iOS 9 or Swift 2</strong>. Dive in with your prior experience and move more quickly, on to become an impressive iOS developer.</li> <li><strong style=\"\">Entrepreneurs</strong> who have an idea for an app. Don&#039;t pay somebody thousands to build your app. Do it yourself. Having the ability to create something you can think of is extremely powerful.</li> <li><strong style=\"\">Career development</strong> professionals who want to earn money professionally via contract work, consulting, full-time employment, and so forth</li></ul>", 
    "end_date": null, 
    "title": "iPhone App Programming for Noobs - UPDATED iOS 9 Swift 2", 
    "price": "30.00", 
    "instructors": "Rick Walter, Jenna Miller", 
    "commitment": "26.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560928_d760_2.jpg", 
    "course_url": "https://www.udemy.com/ios-9-swift-2-xcode-7-make-an-app-programming-code-ios9-dev/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T21:25:41Z"
}