{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>Turbo charge your app development. </strong>Take advantage of a great iOS component community. Using components that others have already developed and proven successful, you can focus on the core of developing your own app.  </p>  <p>  \t<strong>Find and use awesome iOS components today with this course for developers with some iOS experience.</strong>  </p>  <ul>  \t<li><span>Browse Cocoacontrols to find the latest open source controls</span></li>  \t<li><span>Download controls that you need</span></li>  \t<li><span>Integrate controls in your apps</span></li>  \t<li><span>Customize controls to meet your needs</span></li>  \t<li><span>Gain publicity and market your app</span></li>  </ul>  <p>  \t<strong>Find free-to-use polished controls , saving you hours of developing them yourself.</strong>  </p>  <p>  \tRecreating text input fields specific to your needs is tedious and time-consuming. Wouldn&#039;t it be nice to just use a currency input field that you wished Apple would have included as a basic component? <strong>This course will teach you how to find and use components</strong> just like this.  </p>  <p>  \tOnce you learn how to use the cocoacontrols site you will improve your development efficiency and <strong>increase your own return on investment</strong>. Once I learned to be efficient with cocoacontrols my app development business grew substantially. I&#039;ve developed over 100 apps for myself and clients big and small - most of which use this skill to make my apps better. In this course <strong>I will teach you these crucial skills</strong>.  </p>  <p>  \t The skills I teach you will be the <strong>same skills I just used to win the 2014 AT&amp;T Western New York Civic App Challenge</strong>.  </p>  <p>  \t<strong>Content and Overview</strong>  </p>  <p>  \tThis course contains over 1 hour worth of screencasts that will help you learn by example. We go through the development of an app that integrates multiple controls of various degrees of difficulty and customization options. I&#039;ve found that learning by example works best for me and others and that&#039;s exactly what this course is.  </p>  <p>  \tI&#039;m light on the fluff and focus on finding controls that work and showing how to actually integrate these into your apps. In addition <strong>I&#039;ve included the full source code</strong> for the sample app that we create in this course. Once you complete all of these lessons your iOS development skills will be vastly improved in both quality and speed to market.  </p>  <p>  \tThe best part about this course is you can start it in the morning and by the afternoon you will already be a much better iOS app developer. You can immediately start <strong>improving your earning potential with freelance development and/or by creating your own high quality apps</strong>.  </p>", 
    "end_date": null, 
    "title": "Jumpstart iOS App Development Using Cocoacontrols", 
    "price": "25.00", 
    "instructors": "Mr Scott Falbo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/344802_871a_2.jpg", 
    "course_url": "https://www.udemy.com/jumpstart-ios-app-development-using-cocoacontrols/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-15T01:43:05Z"
}