{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Do you want to start a career in Android Development? Great, your timing could not better! I have designed this course to teach you the fundamentals of Android development and to show you first hand what it takes to create and publish an Android App end to end.</p><p><strong style=\"\">Android continues to be the dominant mobile app platform</strong> providing great demands for Android development skills which results in premium compensation for Android developers . The benefits of becoming an Android Developer includes:</p><ol style=\"\"><li>Near Zero unemployment rate!</li><li>Opportunity to work from anywhere!</li><li>Opportunity to translate your idea into app!</li><li>Opportunity to be your own boss and set your schedule!</li><li>Opportunity to reach 82% of mobile device owners in the world!</li><li>Annual salaries between <strong style=\"\">$110K to $155K</strong> compared to $105K to $155K for iOS developers!</li></ol><p>Find out in one day what it takes to design, develop and publish an Android App. In this course you will learn.</p><p><strong style=\"\">Setup: </strong>How to setup Android development environment, I will cover</p><ol style=\"\"><li>What tools you need,</li><li>What they do and why you need them</li><li>Where to get and/or download these tools</li><li>How to install these tool and start using them.</li><li>A tour of Android Studio which is the main development software you need</li></ol><p><strong style=\"\">Warm Up App</strong> - We will create a warm up app to get a first hand taste of what it takes to create Android App. This is an enhanced Hello World App that demonstrates the usage of Activities and Intents which are two of the core components of Android development.</p><p><strong style=\"\">Main App</strong> - the main App for this course is a Resume App - your own Resume App. We will design, develop and deploy your own Resume app to the Google Play Store. If you want to start a career in Android what better way to start than to showcase your own resume on the App Store. The next time you apply for a job you can send a link to your Resume App in the Play Store instead of sending a PDF.</p><p><strong style=\"\">Start an exciting career</strong> - become an Android Developer. This course is designed to put you in the track to a great and rewarding career creating apps that will be used by millions of people. Click the Enroll Button.</p>", 
    "end_date": null, 
    "title": "Learn How to Create Your First Android App", 
    "price": "20.00", 
    "instructors": "Val Okafor", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576042_8427_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-create-your-first-android-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T20:56:22Z"
}