{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t          Objective C is a native programming language used in developing Apple’s iOS and Mac OS X operating systems as well as its applications. This course on Objective-C  programming language is designed to serve as both a concise quick-reference and a comprehensive introduction for newcomers to the language.  </p>  <p style=\"\">  \t    The most important thing to do when learning Objective-C is to focus on concepts and not get lost in language technical details.  </p>  <p style=\"\">  \t    The purpose of learning a programming language is to become a better programmer, that is to become more effective at designing and implementing new systems and at maintaining old ones.  </p>  <p style=\"\">  \t    Objective-C has large base of iOS users and largely increasing Mac OS X users and since Apple focuses on quality first, its wonderful for those who started learning Objective-C.  </p>  <p style=\"\">  \t          Designed by seasoned experts and tutors who know exactly how to present the course in a systematic step by step manner - this is by far the most thorough Objective C course available anywhere - online today!  </p>  <p style=\"\">  \t          If you&#039;ve struggled with other Objective C online courses, that confuse you and cause you to drop out - this is exactly what you&#039;re looking for.  </p>  <p style=\"\">  \t          The full course spans over a total of about three hours of high quality video training. All topics are easy to learn and presented in digestible short 5 to 15 minute videos. The course contains discussions, demos, and exercises to test your skill. All demos come with full source code.  </p>  <p style=\"\">  \t          We start the course with some of the important design patterns used when developing in Objective - C for iPhones and iPads.  </p>", 
    "end_date": null, 
    "title": "Learn Objective C Programming for iOS Apps", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/279984_21e1_2.jpg", 
    "course_url": "https://www.udemy.com/learn-objective-c-programming-for-ios-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T07:18:10Z"
}