{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Learning Meteor Application Development will get you up and running on the Meteor platform, and have you well on your way to creating powerful, effective web and mobile applications in hours instead of weeks. By taking advantage of all of Meteor&#039;s efficient development capabilities, you can take your development skills to the next level, and build those “killer apps&quot; you&#039;ve been dreaming about.</p><p style=\"\">We&#039;ll begin by installing Meteor, configuring the development environment and building a baseline application, allowing us to quickly and easily create a fully functional application.</p><p style=\"\">Then we&#039;ll create a full-stack application, and build a simple, elegant, data-reactive UI. We will connect that UI to back-end services by creating a MongoDB data collection, Meteor DDP services, and a RESTful API. As we come to the end we will test our application and deploy it to Meteor&#039;s servers or to a customized production environment, so that we can show it off to the world!</p><p style=\"\"><span style=\"\"></span><strong style=\"\">About the Author</strong></p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">Isaac Strack</strong> is a design technologist and STEM education advocate, currently working as a Solutions Consultant for Adobe Systems. With 15+ years experience in Management Information Systems, Web and Creative technologies, Isaac has a strong background in modern web application development. A self-proclaimed Meteor junky, He is the co-captain of the MeteorSLC Meetup group, he is the author of the Packt Publishing book Getting Started With MeteorJS JavaScript Framework, he wrote the soon-to-released Packt book Meteor Web Applications Cookbook, and he assisted as a Technical Reviewer on the recent Building Single-page Web Apps with Meteor. He holds a patent for online fraud detection and is an experienced lecturer/speaker, speaking at conferences such as UtahJS, NMC Summer Conference, and the Consumer Electronics Show (CES).<strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Learning Meteor Application Development", 
    "price": "30.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507800_d861_2.jpg", 
    "course_url": "https://www.udemy.com/learning-meteor-application-development/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T05:11:53Z"
}