{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Think that you need to learn both Java and Swift to make cross platform apps? Well you don't and I'm here to show you how!</p>\n\n<p>Learn the basic concepts, tools, and functions that you will need to build fully functional iOS and Android apps using Xamarin and the C# language. </p>\n\n<p>-------------------------------</p>\n\n<p><strong>This course covers what others do not! The focus is <em>strongly</em> on how to share code between iOS and Android - not on just making single platform apps. No other course on Udemy does that, which is a shame because that's the whole point of Xamarin!</strong></p>\n\n<p>-------------------------------</p><p>Forget the $2000 fee at Xamarin University, get the same information here for a fraction of the cost!<br></p>\n\n<p><strong>Things You'll Learn</strong></p>\n\n<ul><li>Xamarin Installation</li><li>Basic C# Programming (if you need it)</li><li>Basic App Creation with Code Sharing Tasks, Hints and Tips</li><li>Complex App Creation (you'll make a magnet detector, yes a real one!)</li><li>More Complex Apps (music player allowing you to play music from a scrolling list)</li></ul>\n\n<p><strong>A Powerful Skill at Your Fingertips </strong><br>Xamarin has over 1.5 million developers and is in BIG demand with companies. You will have the ability to market yourself uniquely as a Xamarin developer, commanding salaries of  $60,000 - $120,000. You can also make your own money generating apps or hire yourself out at $60 - $150 per hour!</p>\n\n<p>The possibilities are endless once you complete this course!</p>\n\n<p><strong>Content and Overview </strong><br></p>\n\n<p>Suitable for beginners to Xamarin, this course will give you the fundamentals of C# programming as well as mobile app development. It establishes a strong understanding of mobile concepts, whilst avoiding too much technical jargon!</p>\n\n<p>Each section closes with a small exercise, helping you put your new learned skills into practical use immediately. Some are tough though, so prepare yourself for a mental workout!</p>\n\n<p>Join right now, upgrade your skill set and never look back!</p>\n\n<p>Credit: Promo music provided by bensound</p>", 
    "end_date": null, 
    "title": "Learn Xamarin by Creating Real World Cross-Platform Apps", 
    "price": "20.00", 
    "instructors": "Mr Grant Klimaytys", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789692_2116.jpg", 
    "course_url": "https://www.udemy.com/learn-xamarin-by-creating-real-cross-platform-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T14:33:07Z"
}