{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "SchoolSteps(.in) is a team of 7 professionals having an average experience of 12+ years. Our core strength is Java/J2EE, Web and Android Programming and we have been doing rigorous R&amp;D in Android Wear Programming since the API has been introduced. Through this series, we thought of sharing our knowledge with you.<p style=\"\">The series contains 6+ hours of video tutorials with maximum focus on programming. The series do focus on some theoretical concepts to make the base for you to learn wear programming. </p><p style=\"\">The series starts your learning journey with the basics like what is android wear, design principles, android SDK installation, using android studio etc and then moves to the interesting concepts like building notifications for android wear, adding page to a notification, voice input for notifications and notification stacking etc. </p><p style=\"\">Next it takes you to world of Custom UIs, where you learn to create layouts, cards, list , 2D pickers, confirmations etc for the Android Wear.</p><p style=\"\">Eventually, it takes you through the advanced concepts where you learn to send and receive messages, sync data items, transferring assets, designing android wear faces etc.</p><p style=\"\">Last but not the least, you will experience a LIVE EXAMPLE, using Google Play Store, on how to package and distribute your Android Wear App.</p><p style=\"\">The prerequisite for this course is to have basic to average knowledge of Java/J2EE. Knowledge of Android programming is good to have.</p>", 
    "end_date": null, 
    "title": "Learn Android Wear Programming", 
    "price": "20.00", 
    "instructors": "- SchoolSteps.in", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356666_aa1b_6.jpg", 
    "course_url": "https://www.udemy.com/learn-android-wear-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T02:48:48Z"
}