{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>***Updated Oct. 19th, 2015 ****  New Content Added ******</p><p>Learn  iOS 9 development by building real apps today!  Everything you need to know to get started in App development is right here at your finger tips.  No need to spend hours combing through YouTube or Stack Overflow looking for just the right information or bits of code to help you make apps. This course has compiled all the information that can get you started on becoming an app developer today.  From the first steps of downloading XCode to the culmination of putting your awesome apps up on the App Store.  Each section focuses on a different app and will teach the concepts needed for that app in that section.  No long boring lectures of concepts video after video with out making an app.  This course gets you to jump in right away and build your first app with in minutes.   </p>Take the first step toward a more lucrative career by enrolling in the Learn iOS 9 App Development course by The Code Lady. This hands-on course teaches iOS 9 development using Swift 2 Programming language by having you actually build apps. With over <p>6 hours of content, this course is perfect for the complete beginner or anyone who would like to enhance their career options by becoming an app developer. </p><p>This is a fun, clearly instructed and concise course that will have you becoming a developer Ninja in no time at all! So invest in your future, earn a higher salary and learn to become an iOS 9 Developer today with The Code Lady!</p>", 
    "end_date": null, 
    "title": "Learn iOS 9 App Development with Xcode 7 and Swift 2 ", 
    "price": "20.00", 
    "instructors": "Susie Starkman", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/254526_a3fb_5.jpg", 
    "course_url": "https://www.udemy.com/learn-ios-app-development-and-make-more-money/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-02T15:27:08Z"
}