{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">    Course Description  </strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">*** 700+ happy students, many 5-star ratings and fantastic testimonials from satisfied students! Hurry! Get this regularly updated course today, before the price rises further! ***</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>  <p>  \t<strong style=\"\">Update 01/02/2015: <em style=\"\">Added new lecture on Context Menus.</em></strong>  </p>  <p>  \t<strong style=\"\">Update 27/01/2015: <em style=\"\">Added new lecture to implement Segues In Apple Watch.</em></strong>  </p>  <p>  \t<strong style=\"\">Update 14/01/2015: <em style=\"\">All the videos are now optimized for mobile viewing. Now you can see the active area of Xcode zoomed in. Start learning from your mobile today!</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>  <p>  \tDont waste hours reading the new documentations and tutorials - with lots and lots of boring theory stuff - for Apple Watch.  Beat the competition, jump right in and use your creativity to build applications today that will help you dominate the fresh new Apple Watch App market. Take this course and build your first sample app within 60 minutes. If you hit a trouble, you always have the support forum to ask questions, collaborate with peers and learn more effectively.  </p>  <p>  \t    Dont miss out the Apple Watch gold rush! This course will teach anyone who has basic programming knowledge in any language how to create Apple Watch apps using Swift. This is the best time to learn Apple Watch programming and<strong style=\"\"><em style=\"\"> make the most money in the first wave of Apple Watch apps and dominate for years</em></strong>!  </p>  <p>  \t                  The course will show you 100% code and live coding demo video on building real world apps that run in the Apple Watch and primarily covers the new UI concepts introduced in Apple Watch. I will add more samples and contents to this course as Apple releases  more complete versions of the WatchKit sdk in early 2015.  Currently they have exposed only very limited feature sets.  </p>  <p>  \t<strong style=\"\">        How is this course different to others?</strong>  </p>  <ul style=\"\">  \t<li>I love learning from my mobile even while travelling. I&#039;ve done the favour for my students, <strong style=\"\"><em style=\"\">videos in the course are mobile-optimized.</em></strong> You can see active area of the xcode zoomed in so that you can <strong style=\"\"><em style=\"\">even watch the whole course from your mobile screen</em></strong>.</li>  \t<li>For a single one-off free students will get full lifetime access (including video downloads) to the course and all the future updates I add later.</li>  \t<li>Most of the lectures will be hands-on videos of real applications, we will deal with very little theory where it is useful.</li>  \t<li>Theory parts are <em style=\"\"><strong style=\"\">made interesting to learn and is created using white-board animations that are easy to follow</strong></em>.  Graphical representations are used more than text to convey core ideas.</li>  \t<li>You can get up and running with your first &#039;Hello World&#039; app in a very short time of just first 15 minutes and start building a real world app in the first 45 minutes.</li>  </ul>  <p>  \t<strong style=\"\">        Who is this course for?  </strong>  </p>  <p>  \t                  Anyone who wants to build Apple Watch applications. The ordinary mobile market is already saturated. Apple Watch is the new wave. It brings fantastic opportunities for developers to create amazing apps that never existed before. If you want to earn good money selling apps in the Appstore then investing time and resource to learn Apple Watch programming is the key to your success. Being among the first few people who make Apple Watch applications will give you a good lead in the new app ecosystem of Apple Watch.  </p>  <h4><strong style=\"\">What are the requirements?</strong></h4>  <ul style=\"\">  \t<li>A Mac.</li>  \t<li>Basic programming experience in <strong style=\"\"><em style=\"\">at least any one</em></strong> language is required. I&#039;ve included some fantastic links to learn it for free online.</li>  \t<li>A real Apple Watch to see the live code in action is NOT required. You can use a simulator to see that from within your Mac.</li>  </ul>  <h4>  <p>  \t<br style=\"\">  \t<strong style=\"\">    What am I going to get with this course?  </strong>  </p>  <ul style=\"\">  \t<li>100% live programming video, that you can save offline.</li>  \t<li>Complete code of the examples demoed during the course.</li>  \t<li>I will be assisting you with any difficulty via the support forum. Post a query and I&#039;ll get back to you in a maximum of 48 hours. </li>  </ul>  <p>  \t<strong style=\"\"><em style=\"\"><br style=\"\">  \t</em></strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">What is the most tangible outcome of this course?</em></strong>  </p>  <ul style=\"\">  \t<li><em style=\"\">Have you ever imagined that it is possible to read long novels in the Apple Watch screen? Yes!! It is possible, in this course you will build a live speed reading application on the Apple Watch and increase your reading speed over 600%. This idea have the power to let users read long novels in a matter of hours without straining their eyes and without sacrificing the font-size for the small screen space. This opens up an &#039;industry&#039; of opportunities. Want to learn how? Join today!</em></li>  \t<li><em style=\"\">Make your app navigate page by page, by using Segues in Apple Watch</em></li>  </ul>  <p>  \t<strong style=\"\">Who am I?</strong>  </p>  <p>  \t        Hello, I&#039;m Akhil , you instructor for this course. I’m from India. I have a Bachelors degree in Computer Science and have over 3 years of work experience in Computer Programming with clients from all United States and many other parts of the world. I also have an MBA degree specialized in IT and Systems. <span style=\" color:inherit;\">I have experience working in several technologies like Java, Android, Php, Html etc for the past 3 years. And trust me Xcode + Swift is the easiest of them all.</span>  </p>  <p>  \t        Since it’s so easy to understand and learn Swift, I thought it’s worth my time to put up a course to teach others how I did it.  </p>  </h4>", 
    "end_date": null, 
    "title": "Learn Apple Watch Programming Quickly By Examples", 
    "price": "20.00", 
    "instructors": "Akhil Anil", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378116_c898_3.jpg", 
    "course_url": "https://www.udemy.com/learn-apple-watch-development-by-building-example-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-26T18:29:16Z"
}