{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t    Have you ever wanted to learn how to build apps? This course is for you! This course will show you how to build educational apps for iOS and OSX in Xcode 6! Learn how to build apps for a very lucrative area of the app store!  </p>  <p>  \t    This course will show you how to code in Swift and Objective - C. This course is for complete beginners and not experienced programmers. Learn how to build apps for yourself, your kids or somebody you know.  </p>  <p>  \t  John Bura is one of the 10 highest grossing Udemy instructors. Recently the top 10 instructors have sold over 10 million dollars of courses collectively. John Bura has been programming games since 1997 and teaching since 2002. John is the owner of the game development studio Mammoth Interactive. This company produces XBOX 360, iPhone, iPad, android, HTML 5, ad-games and more. Mammoth Interactive recently sold a game to Nickelodeon! John has been contracted by many different companies to provide game design, audio, programming, level design and project management. To this day John has 40 commercial games that he has contributed to. Several of the games he has produced have risen to the top 10 in the Apple&#039;s app store. In his spare time John likes to play ultimate Frisbee, cycle and work out.  </p>", 
    "end_date": null, 
    "title": "Learn to build educational apps in XCode 6 with Swift and C", 
    "price": "20.00", 
    "instructors": "John Bura", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327548_149a_5.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-educational-apps-in-xcode-6-with-swift-and-c/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-26T13:53:09Z"
}