{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">NOTE: this course typically sells for $299, but we reduced the price to $49 until the end of the month to help make it more affordable for you.</strong></p><p>This Android development course teaches you how to take an idea and transform it into a fully functioning Android app and publish it to the Google Play Store within just a few days or weeks. </p><p><strong style=\"\">Stop your frustration today</strong></p><p>Did you try learning Android development before, and it was too complicated, frustrating and difficult? Were you left with the bad options of having to hire expensive app developers or dev agencies? This course solves all those problems.</p><p>With this course you will get a step by step, very clear guide, on how to make your own apps, and get two instructors committed to helping you develop your app, launch it like a pro, and get many downloads for it.  </p><p><strong style=\"\">Try the course now and start getting closer to building the next amazing app</strong></p><p>How good would you feel if you never had to depend on hiring app developers or needing any money to launch your app? It would be amazing, right? And it is completely within reach!</p><p><strong style=\"\">If you have an idea for an Android mobile app, all your frustrations can end today</strong> so sign up for the course, and start taking real steps to making your app a reality. </p><p>If you are stuck trying to figure out where to start, you will love how this course is structured. This course teaches you the practical core concepts of Android development in a step by step manner, and you will be able to immediately use those concepts to build productivity and utility Android apps.</p><p><strong style=\"\">Android Dominance: Every Day You Don&#039;t Have An App, You Are Missing Out</strong></p><ul style=\"\"><li>1,500,000 DAILY new global Android device activation</li><li>78% Android global smart phone market share</li><li>Soon Android will overtake Apple for revenue generated by app developers and it is currently almost even.</li></ul><p><strong style=\"\">Learning by Doing</strong></p><p>You learn development by</p><ol style=\"\"><li>Study</li><li>Practice and</li><li>Reading other peoples code</li></ol><p>This course was designed to help you become an Android developer with a published app at the end of the course. Complex topics will be explained to you in common terms and you will be provided the <strong style=\"\">source code </strong>that we will work on throughout the course and you will also be provided with a <strong style=\"\">PDF step by step guide</strong> on all the programming task that will be performed.</p><p> This course will teach you how to use <strong style=\"\">Android Studio</strong> which is now <strong style=\"\">the official IDE </strong>for Android development. You will learn how to structure your project, which components to add first, how to proceed and more importantly how to integrate source control into Android development.</p> <ul style=\"\"><li>Learn Android Material Design</li> <li>Learn the core components of Android development including Activity, Fragments and Intent, etc</li> <li>Master how to implement List in Android app using RecyclerView</li> <li>Learn how to implement data persistence in Android using SharedPreferences, SQLite Database and ORM</li> <li>Learn Android features such how to use the Camera, Settings, and how to Pick Contact from Address book.</li> <li>Learn advanced topics such as how to generate and export a CSV file from Android, how to run a task in the background and Android in app purchases</li></ul> <p><strong style=\"\">Learn App Business Planning, Marketing and Monetization To Get 1,000,000 Downloads And Make A Significant Income From Your Apps</strong></p><p>This is the first Android course that combines software development with extensive app marketing, monetization and business strategies.</p><p>With this course you won&#039;t simply make an app, but you will learn how to position and promote your app to get tremendous exposure and make you money. </p><p>Most app entrepreneurs find themselves lost after they launch their app because they struggle to get downloads. But not you. In this course, you will learn the business of apps, find growth, and make your apps a success, starting from absolute scratch.</p><p><strong style=\"\">No risk to try, so sign up now</strong></p><p>Every Udemy course comes with a 30-day money back guarantee. So if there is something you don&#039;t quite right with the course, you can just get your money back. But we are sure that you will love the course, and that you will love being able to make many apps of your own without having to depend on anyone. And if all else fails, you will be able to get a very well paying Android development job and make a great salary. <strong style=\"\">So go ahead, sign up for the course, and begin making your app a reality starting today.</strong></p>", 
    "end_date": null, 
    "title": "Learn Android App Development & Promote Your App like a Pro", 
    "price": "20.00", 
    "instructors": "Val Okafor, Alex Genadinik", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492556_da80_4.jpg", 
    "course_url": "https://www.udemy.com/android-app-development-in-3-days-1000000-downloads/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-03T14:58:14Z"
}