{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Android platform</strong> is used to make new and innovative <strong style=\"\">mobile applications</strong> by smart developers to make full use of all functions connected to handset internet. Unless you are making the most basic of Android applications, you need data management and the platform uses the <strong style=\"\">SQLite</strong> database system, which is an open-source and stand-alone SQL for this purpose.  </p>  <p style=\"\">  \t                        Database is the lifeline for every application and for ALL serious <strong style=\"\">Android App Developers</strong> knowledge of <strong style=\"\">SQLite</strong> is a <strong style=\"\">MUST</strong>.  </p>  <p style=\"\">  \t<strong style=\"\">          SQLite</strong> eases the data-storage burden and makes it easy to incorporate powerful database features that provide users with a much more interactive experience.  </p>  <p style=\"\">  \t  In this miniscule course on SQLite, our expert <strong style=\"\">American Tutor </strong>starts off on the basics of Android Application with example of a simple app creation. All the lectures are simple, professional and straight to the point.  </p>  <p style=\"\">  \t<span style=\"\">The course spans about 110 minutes of </span><strong style=\"\">HIGH Quality Videos </strong><span style=\"\">which consists of </span><strong style=\"\">11 Lectures</strong><span style=\"\"> and </span><strong style=\"\">Assignments</strong><span style=\"\">.</span>  </p>  <p style=\"\">  \t                        Our <strong style=\"\">prime focus</strong> is to ensure that <strong style=\"\">learning is simple and done methodically</strong> through easy to follow video sessions. All topics are easy to learn and presented in <strong style=\"\">digestible short 5 to 15 minute videos</strong> with real world examples and demos. The course contains discussions and demos to test your skills. All demos come with full source code that you can download and use for your projects.  </p>  <p style=\"\">  \t                    We hope that our course has benefited you and you enjoyed taking it, just as we enjoyed making it for you.  We have received positive reviews from students for specific subject courses like this which are small, easy to learn and are a kind of reference source in the field.  </p>  <p style=\"\">  \t                  We are always <strong style=\"\">available</strong> to you <strong style=\"\">for SUPPORT</strong> through the Udemy Messaging System if a need arise. Please do not hesitate to approach us with any query on the subject.  </p>  <p style=\"\">  \t<strong style=\"\">    HAPPY LEARNING!!!  </strong>  </p>", 
    "end_date": null, 
    "title": "Learn SQLite Programming on Android Kitkat ", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315194_68b5.jpg", 
    "course_url": "https://www.udemy.com/learn-sqlite-programming-on-android-kitkat/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T17:21:45Z"
}