{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tThe course provide an introduction to Android Programming and allows someone with a basic knowledge of programming to start creating Android Applications. It is a light course to cover fundamentals of Android. It will teach you the Android programming Paradigm and how to think while creating an Android program. We will cover topics such as Installation, Activities, Layouts, List Views, SQLite, Services Multimedia and Google Play.  </p>  <p>  \tThe course is divided into 6 units covering each of the above topics. You will start with basic installation process and will move on to the first Android example which will outline the structure of Android Programs.  You will then learn about the activities which forms the heart of Android application. Once you are clear with Activities and activity lifecycle you are ready to create small native applications of your own.  You will then learn about Layouts for designing your UI and will learn it while creating sample applications along with it. You will then learn about the ListViews and SQLite for data persistence. The next unit will be about services which allows you to perform tasks in the background while UI activity is active on the screen. This unit will provide you enough examples to clarify your concepts for services. We will then move towards multimedia involving Audio and Video Playback. You will work on examples involving both of them. We conclude our course with a discussion on submitting your apps to Google Play.  </p>  <p>  \tIt will be a fun learning course that is sure to help you get going with Android programming. </p>", 
    "end_date": null, 
    "title": "Learn Android Programming From Scratch - Basics", 
    "price": 0, 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47806_ba82_4.jpg", 
    "course_url": "https://www.udemy.com/learn-android-programming-from-scratch-beta/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-29T07:01:44Z"
}