{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Learn to build iOS Apps with the latest version of Swift. This course which focus on the swift programming language teaches you the best techniques for iOS App development with all the power packed features that the new and improved version of Swift promises. This course will take you deeper into the swift concepts and constructs and will then help you quickly learn and master professional iOS development. </p><p>The course starts with basic introduction to swift programming and Xcode IDE and then help you learn programming concepts covering the general programming paradigms and the ideas unique to swift. As with all our courses you will be creating an real world iOS App along with the course. This will allow you to assimilate all the concepts as they are covered by the instructor.</p><p>After this course you will be able to:</p><p><strong>Build iOS Apps using the latest version of Swift</strong></p><p><strong>Master Swift programming concepts such as Sets, Tuples, Arrays, Dictionaries </strong></p><p><strong>Understand the Swift programming paradigm</strong></p><p><strong>Learn professional app development techniques</strong></p><p><strong>Master iOS Programming</strong></p><p>This course also provides you with a programming lab project which you are encouraged to try out. Get all this and much more on the other side. Get started and start building you App. </p>", 
    "end_date": null, 
    "title": "Learn to Build iOS Apps with Swift 2", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630980_afd2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-ios-apps-with-swift-2/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T05:24:12Z"
}