{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>We'll cover the basics of Swift and the Apple watch programming.</strong></p><p>The best part is that <strong>no prior programming experience is required.</strong>I will not be teaching wordy or complicated computer science philosophies. I will be teaching you <strong></strong>how to make apps<strong> </strong>that you can play with, share with friends &amp; family, and offer to the world.</p><p><span><strong>Beginners</strong>: You don't need any programming experience to take this class. I have been the absolute beginner before and I want to help you.</span></p><p><strong>Professionals:</strong> professionals who want to earn money professionally via contract work, consulting, full-time employment, and so forth.</p><p>The course is designed to provide a comprehensive introduction to Swift,\n so that you can begin experimenting right away. Upon completion, you \nwill understand the foundations of Swift code and will be able to \ndevelop custom Apple Watch Applications. From basics to high level code, you'll know how to code the app of your \ndreams, and be able to put it in the Apple App Store if you want.</p><p>You'll learn to code about <strong>Two</strong> different apps. This is core code development taught in a style where you\n effortlessly learn the concepts.<span>This course is <em>project based</em><strong></strong> so you will not \nbe learning a bunch of useless coding practices. At the end of this \ncourse you will have real world apps to use in your portfolio.</span><br></p><p><br><span></span></p><p><span><span></span> </span><br></p>", 
    "end_date": null, 
    "title": "Learn Swift And Create 2 Apple Watch Applications", 
    "price": "20.00", 
    "instructors": "Shibli Murtaza", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680936_8429.jpg", 
    "course_url": "https://www.udemy.com/learn-swift-and-create-2-apple-watch-applications/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T21:04:00Z"
}