{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Want to learn everything there is to know about Apple's programming language Swift and have some fun developing awesome iOS applications on the way?</p>\n\n<p><strong class=\"redactor-inline-converted\">You have found the right course!</strong></p>\n\n\n\n<p>We have put our knowledge in a course that follows a hands-on approach even in the theoretical parts!</p>\n\n\n\n<p>By taking this course you will learn every aspect of Swift to be able to develop your own applications with ease. To make this even easier we will talk about different applications and provide examples for a lot of different functionalities.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">No copy and pasting of code without understanding what it does!</strong></p>\n\n\n\n<p>We want for you to become proficient at what you do and be able to use the knowledge gained throughout the course to <strong class=\"redactor-inline-converted\">help your career and future plans!</strong></p>\n\n\n\n<p>We are here to help you understand everything we talk about and have done our best to achieve this. If however you still have questions we will gladly <strong class=\"redactor-inline-converted\">help you  personally</strong> in the Q&amp;A section here on Udemy.</p>\n\n\n\n<p>We will provide you with all the resources you need to build everything included in this course, including step by step source codes for all of the projects!</p>\n\n<p><strong>We will always update this course according to the latest Swift and iOS versions so you don't need to buy a new course each year.</strong></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn How To Code - Professional Swift Development For iOS", 
    "price": "50.00", 
    "instructors": "Timothy Meixner, Johannes Ruof", 
    "commitment": "18.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794962_80db_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-code-professional-swift-development-for-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T18:12:52Z"
}