{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t          Learn how to make an amazing Apple Watch app with Watchkit.  </p>  <p>  \t          For the beginners and the pros, hands on step by step lectures on how to design and program a casino slot machine app. Check the intro video how neat this app is!  </p>  <p>  \t          Do you remember 8 years ago when blackberries where the top phones and how Apple smashed them with the release of the iPhone?<br style=\"\">  \t          Well, Apple is going to be doing the same thing with his brand new Apple Watch.<br style=\"\">  \t<br style=\"\">  \t          Now is the time for you and I to be part of this revolution and make apps for this brand new device.<br style=\"\">  \t<br style=\"\">  \t          The Apple Watch is coming! It&#039;s an amazing gadget loaded with wearable technology from your wrist.<br style=\"\">  \t<br style=\"\">  \t          Apple also announced Watchkit which is a way for developers to make apps for the watch.<br style=\"\">  \t          This course teaches you the practical way to  use watchkit and how you can create apps on this amazing new device.  </p>  <p>  \t          By the way, you will get the source codes of the finished apps! You could use it to publish your very own casino watch app to the store and secure your spot.  </p>  <p>  \t          The possibilities are endless but you have an opportunity to make these apps become real. Some of you may have missed the iPhone gold rush in 2007, so don’t miss the boat on this one, and come make history with us.  </p>  <p>  \t      My name is Yohann, computer college prof for 5+ years. I like to get things done, and I do what I preach. I myself have more than a hundred apps on the app store, many of them reached top 10 worldwide, and I’ve helped thousands of students become professional iPhone developers. I’ve been featured in the press in prestigious media like Forbes online, WIRED, and Yahoo news. Want to be part of it?  </p>  <p>  \t          I’m really excited about you taking this course cause I strongly believe this is a game changer, and I&#039;d want my own kids take this course.  </p>  <p>  \t          It’s 2015, it’s time to make awesome apple watch apps! Apple said their watch is coming out early 2015. There’s no reason you shouldn’t have an app ready for the launch.  </p>  <p>  \t          So join this course and let’s go make some amazing apps.  </p>", 
    "end_date": null, 
    "title": "Learn Apple Watchkit with Swift, Casino Slot Machine app", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365166_1b40.jpg", 
    "course_url": "https://www.udemy.com/learn-apple-watchkit-with-swift-casino-slot-machine-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-07T12:26:24Z"
}