{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tSwift is Apple’s new programming language. This new language is for iOS and OS X applications. Popularity of this language has skyrocketed ever since it was introduced last June. The main reason for such a hype of this language is because it is expected to replace the 30-year-old Objective-C language that Apple has required developers use to write OS X and iOS applications.  </p>  <p>  \t    Swift is easier to code in and most developers will use Swift in preference to Objective-C because of its sheer simplicity in coding so learning this new language is a big plus.  </p>  <p>  \tLEARN the basics of the newest language “SWIFT” of Apple from the Experts in the field. The purpose of this short course is to make you comfortable with this language.  </p>  <p>  \tSwift is a language built for average programmer. Learning a new language is always fun and challenging. Swift is ready for your next iOS and OS X project and apps or for addition into your current app.  </p>  <p>  \t     In creating this language Apple has used a clever tool called “Playgrounds” for coding even the simplest of mobile apps. Developers are always making hundreds of apps using Objective-C on immensely popular apple products like iPhones, iPads and this trend will go on and on. Swift is an immensely improvement of Objective-C and the popularity of Swift will increase manifold in days to come.  </p>  <p>  \t     If you are planning to write your new innovative applications on iOS and OSX you have to learn Swift or Objective-C. Our course “SWIFT PRIMER” will provide you the basic concepts and functions of Swift language.  </p>  <p>  \t     Our course taught by our American Guru is a foundation course on Swift language and will help your way of learning path with various features of this new programming language.  Our prime focus is to ensure that learning is simple and our training is done through step by step easy to follow video sessions. All topics are easy to learn and presented in digestible short 5 to 15 minute videos with real world examples and demos. The course contains discussions and demos to test your skill. All demos come with full source codes that you can download which is complimentary and use for your projects.  </p>", 
    "end_date": null, 
    "title": "Learn Swift Programming for iOS8", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314934_8c77.jpg", 
    "course_url": "https://www.udemy.com/swift-primer/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T09:48:54Z"
}