{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tThe best iOS course on the web just got better. The iOS course now have been updated for the latest iOS7 SDK. This update not only covers the design basics but also cover topics such as Airdrop, Multitasking, Local Notifications, SpriteKit, Game Center, Core Motion, Core Location and Camera Updates. You will not only learn about the concepts but will get a proper understanding with live demo examples.  </p>  <p>  \tThis 3+ hours update covers the real iOS7 changes and will sure add to you iOS competence.  </p>  <p>  \t This Video series is the most comprehensive course on net to learn and master iOS programming. We have designed the course keeping in mind the need of the developer community to have a complete a structured curriculum to learn this exciting technology. The course will allow even a beginner to grasp the important concepts and create apps by the end of this course. iOS apps are the most profitable across all Smartphone platforms and with a large community of active app users this technology continues to present great opportunity for any developer. This course is based on years of teaching iOS programming to thousands of students and build on the inputs received from students and industry professionals alike.  </p>  <p>  \t The course does not assume any prior knowledge of iOS or Objective C the primary programming language for iOS development and is well suited for both beginners and intermediate developers. Our course covers the latest OS version as permitted by Apple Developer NDA.  By the end of the series you will be able to develop interesting and exciting Apps of your own or for your customers. This series has been created by our in house experts and focus on real and practical usage of the technology. This series is useful for anybody who wants to quickly learn iOS or wants to upgrade their knowledge for the latest OS.</p>", 
    "end_date": null, 
    "title": "Learn iOS Programming from Scratch", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54257_2412_9.jpg", 
    "course_url": "https://www.udemy.com/learn-ios-programming-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-15T15:58:09Z"
}