{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Apple’s dedicated OS has constantly been giving head to head competition to Android, even though Android’s market share greatly surpasses that of iOS. However, in terms of innovation, iOS is often labeled as a hands-down winner and app developers make more money on the Apple platform.</p><p>With the growing number of users on a steady basis, Apple has made it easier to make and distribute apps on their App Store for any developer with the knack of developing apps. They have also introduced the new programming language, Swift, to make this daunting task easier.</p><p>With iOS9, Apple hopes to bring their technology into the hands of the creative masses. iOS9 was recently introduced and came packed with many new features. These features include a significantly faster processor, battery improvement and under-the-hood optimizations. Other features that could be found on the OS included the ability to divide your screen into two, adding images and photos to notes, maps including public transports, 3D touch that allows the ability to peak and pop, and even Live Photos. This has opened the market up for many different innovative apps that can now incorporate these brilliant technologies. </p><p>This course is the perfect course to get your ios development started. Learn how to develop iOS applications from scratch and start making your own applications with ease. This comprehensive course has been created keeping in mind the beginners as well as advanced developers and breaks down simple concepts before taking the learner on the journey to more complex constructs.</p><p>The course will cover new technologies such as UIStack View and SFSafari View Controller and will also include basics of iOS 9, Swift, and iOS9 features (guard statement, optionals, forced unwrapping). The iOS9 tutorial has been designed to break down basics as well as advanced concepts and includes defining terms such as different kinds of loops, constants and variables, arrays and dictionary, conditional flows, Enums and etc. Our course will also help you learn to design a full-functional app from scratch by helping you make the app along with the instructor. </p><p>With iOS being one of the most preferred operating systems, it is no wonder that a lot of people are jumping on the bandwagon to learn developing for iOS platforms. So what are you waiting for, enroll now and start creating your own iOS apps.</p>", 
    "end_date": null, 
    "title": "Learn to Build iOS9 Apps : The Complete Course for Coders", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672918_e0d1.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-ios9-apps-the-complete-course-for-coders/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T04:03:41Z"
}