{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p></p><p>Have you ever tried to code an iPhone app from scratch? Have you spent lots of time learning how to code in multiple different languages only to have your project not compile at the last second? Do you just want your app to be on the app store without the hassle of programming? Have developers quoted you a price tag of several thousand dollars just to make your app.</p><p>With this course you can learn how to make an iPhone/iPad app from scratch with absolutely no programming. It sounds too good to be true but yes, you can learn how to make iPhone apps without any programming knowledge.</p><p>In this course you will learn how to prototype, design and release apps onto the app store. The best part is that the process is so streamlined you can build a prototype or an app in less than an hour. You will learn then entire process from idea creation to production to release. Along the way you hear creative and technical commentary that is designed to help you avoid the pitfalls of production. While every project has pitfalls, this course will show you how to over come them and release your app.</p><p>This is a course that is aimed at beginners who want to make an app for themselves or for somebody else. This course isn&#039;t a technical development course. The course mainly focuses on how to get a workable app on the app store. If you want upload an app to the app store you will need to get a developer&#039;s account. Also you will need a mac computer. If you do not want to get a developer account, you have to purchase xCode from the mac app store, using the Loin operating system is highly recomended for most current version of Xcode. This course will be using the buzztouch platform. For more infomation you can visit the buzztouch website. Usually, when developing apps the most recent software version is the best to develop with.</p><p>This course will take you through a mock client proposal and show you how to make apps for other people. With this course you can start making apps for people and start making money. There is no excuse not to get started.</p><p>In addition you get access to an exclusive private course that shows you how to use push notifications and in app purchases. Please keep in mind that if you want to use push notifiations or in app purcahses extra BuzzTouch fees apply.&nbsp;</p><p>This course is for</p><p>- Beginners who want to make and release apps today</p><p>- People who want to release apps and add them to their resume</p><p>- People who want to start making money by making apps for other people</p><p>- Designers who want to rapid prototype app ideas</p><p>- Small businesses who don’t want to hire a developer</p><p>This course is not for</p><p>- Experienced programmers who know what they are doing. This course is meant for people who don&#039;t want to program. Or want an easier starting point than traditional coding courses.&nbsp;</p><p>Take this course and you can release your app to the app store!</p><p><br></p><p></p>  ", 
    "end_date": null, 
    "title": "Learn how to make iPhone apps in 1 hour without any coding", 
    "price": "25.00", 
    "instructors": "John Bura", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37376_6412_7.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-make-iphone-apps-in-1-hour-without-any-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-21T22:45:51Z"
}