{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>** New Videos and Updates Added Weekly **</strong>  </p>  <p>  \t<strong><em>** Join Now and Get it All at a LOW price! ** </em></strong>  </p>  <p>  \t<em>**<strong>Comes with a 30 day Money Back Guarantee</strong>**</em>  </p>  <p>  \t                              iOS 8 offers amazing new possibilities for iPhone and iPad developers. However, you will need to learn entirely new design and development techniques in order to take f<strong>ull advantage of the new system and APIs.  </strong>  </p>  <p>  \t                              In our <strong>brand new iOS 8 and Swift Programming Course</strong> our Head Tutor, Rick \"the iGuru\" - will teach you <em>ALL these new techniques</em>, in a complete step by step system.  </p>  <p>  \t                              This iOS8 with Swift App Programming Course is designed to <em>involve you in a high degree of training</em>. You will be provided with <strong>source codes and assignments</strong> along with the lectures so that you get a sound understanding and grip of the concepts you will be learning.  </p>  <p>  \t                              This course introduces you to the basics of iOS8 and Swift App development and is a course is for beginners and advanced level coders.  </p>  <p>  \t                  This course is designed by seasoned experts and tutors who know exactly how to present the course subjects in a s<strong>ystematic step by step manner.  </strong>  </p>  <p>  \t                              All topics are easy to learn and presented in digestible short 10 to 15 minute videos with <strong>real world examples, demos and exercises.  </strong>  </p>  <p>  \t<em>We continue to put a TON of time and effort in preparing this course and adding new material every week.</em>  </p>  <p>  \t<strong>This is by far the best and most high quality iPhone Programming Training Video Course that we have released.</strong>  </p>    <p>  \t<strong>Approximately 25 hours of High Quality Video Training, Source Code, Workbooks and Exercises - taught over 16 sequential Units.</strong><strong></strong>  </p>  <p>  \t<strong>Section 1</strong> <strong>and 2 </strong>– The Swift primer along with Swift programming language: variables and constants, types, control structures, arrays and dictionaries, optionals, functions, and enumerations. </p><p>  \t  \t<strong>Section 3</strong> – The Swift programming language: structs and classes, stored and calculated properties, property observers, methods. </p><p>  \t  \t<strong>Section 4</strong> – Setting up view layouts in Interface Builder, using constraints, Intro to view controllers. </p><p>  \t  \t<strong>Section 5</strong> – Hierarchies of view controllers using tab bar and navigation controllers.</p><p>   \t  \t<strong>Section 6</strong> – All about table view controllers: standard and custom cells, how to respond to a user tap on a cell, indexing a table view, grouped table views, headers and footers.  </p>  <p>  \t<strong>Section 7</strong> – Using SQLite to store structured data in an app.   </p>  <p><strong>Section 8</strong> – Simple threading using NSThread, more complex threading using operations and operation queues, and Grand Central Dispatch. </p><p><strong>Section 9</strong> – Using hardware sensors: accelerometer, gyro-meter, location services, etc.</p><p>   \t  \t<strong>Section 10</strong> – Intro to the HealthKit API </p><p>  \t- Upcoming Sections - </p><p> \t<strong>Section 11</strong> – Recording and playing back audio and video, including a discussion of the camera API and taking still photos. </p><p><strong>Section 12</strong> – View drawing, views and layers in detail, core graphics and core animation.</p><p>   \t  \t<strong>Section 13</strong> – SpriteKit: a 2D graphics library that incorporates physics. </p><p>  \t  \t<strong>Section 14</strong> – SceneKit for iOS: a high level 3D rendering framework, now available to iOS developers. </p><p>  \t  \t<strong>Section 15</strong> – Metal: a low level 3D graphics framework that is up to 10 times faster than equivalent OpenGL – ES code. </p><p>  \t  \t<strong>Section 16</strong> – Best practices for app design, development, and unit testing.  </p>", 
    "end_date": null, 
    "title": "Learn iOS8 and Swift App Programming", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302798_0d8b_3.jpg", 
    "course_url": "https://www.udemy.com/ios8-and-swift-app-programming-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T08:32:36Z"
}