{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">iOS 8 offers amazing new possibilities for iPhone and iPad developers. However, you will need to learn entirely new design and development techniques in order to take full <strong style=\"\">advantage of the new system and APIs</strong>.</p><p style=\"\">In our <strong style=\"\">brand new iOS 8 and Swift Programming Course</strong> our Head Tutor, Rick &quot;the iGuru&quot; - will teach you <em style=\"\">ALL these new techniques</em>, in a complete step by step system.</p><p style=\"\">This iOS8 with Swift App Programming Course is designed to <em style=\"\">involve you in a high degree of training</em>. You will be provided with <strong style=\"\">source codes and assignments</strong> along with the lectures so that you get a sound understanding and grip of the concepts you will be learning.</p><p style=\"\">This course introduces you to the basics of iOS8 and Swift App development and is a course is for beginners and advanced level coders.</p><p style=\"\">This course is designed by seasoned experts and tutors who know exactly how to present the course subjects in a <strong style=\"\">systematic step by step manner</strong>.</p><p style=\"\">All topics are easy to learn and presented in digestible short 10 to 15 minute videos with <strong style=\"\">real world examples, demos and exercises</strong>.</p><p style=\"\"><em style=\"\">This is the lite version of our main core course.</em></p><p style=\"\"><strong style=\"\">This is by far the best and most high quality iPhone Programming Training Video Course that we have released.</strong></p><p style=\"\">High Quality Video Training, Source Code, Workbooks and Exercises</p>", 
    "end_date": null, 
    "title": "Learn to Make iPhone Apps - for Absolute Beginners", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546682_4f77_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-make-iphone-apps-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T13:06:38Z"
}