{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Android Kit Kat 4.4 is both Beautiful &amp; Immersive</strong>. <em style=\"\">It has a more polished design, improved performance, and a TON of new features. </em>In fact, this latest Android Update from Google is all set to match Apple&#039;s iOS 8</p><p style=\"\">In our <strong style=\"\">Android Programming Course</strong>, we will walk you through the fundamentals of Android app development in Java.<strong style=\"\">You will learn ALL the skills</strong> needed to develop exciting and powerful Android mobile apps using the latest versions of the SDK and the new Android Studio development environment.</p><p style=\"\"><em style=\"\">If you are truly interested in learning mobile app development for the Android platform, then this is the course for you.</em></p><p style=\"\"><strong style=\"\">What You Will Learn</strong></p><p style=\"\"><em style=\"\">We&#039;ll start with the basics: activities and layouts. </em>You&#039;ll learn how to <strong style=\"\">create user interfaces</strong> and how to drive them from activities, and how to harness the <strong style=\"\">power of intents to link activities</strong> into a <em style=\"\">compelling user experience.</em></p><p style=\"\">Of course, an app is nothing without its data, and <strong style=\"\">Android has some pretty powerful tools to store that data</strong>.</p><p style=\"\">We&#039;ll talk about SQLite, the mobile version of the popular SQL relational database management system. You&#039;ll learn how to store data in SQLite databases, and how to retrieve that data later and use it to populate several different types of user interface controls. You&#039;ll learn some basic animation techniques to use with any view in the course, but you&#039;ll also learn how to animate any object – that is, to change its properties over time! <em style=\"\">This is a powerful technique that can be used not just for traditional animation, but for any time-bound task.</em></p><p style=\"\"><em style=\"\"><em style=\"\">This is the lite version of our main core course.</em></em></p><p style=\"\"><em style=\"\">Pretty much anything a developer can do to an Android mobile device is covered in this course.</em></p>", 
    "end_date": null, 
    "title": "Learn to Make Android Apps - for Absolute Beginners", 
    "price": "20.00", 
    "instructors": "EDUmobile Academy", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550866_b452.jpg", 
    "course_url": "https://www.udemy.com/learn-to-make-android-apps-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T08:27:31Z"
}