{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<h4>  <p><br></p>  </h4>    <p>Have you ever wanted to make a game? You have tried to Google tutorials and tried to learn how to code. You plow through tutorial after tutorial and get nowhere. After much frustration, you give up and put your fantastic game ideas aside.<br>  <br>  Luckily if you want to make iPhone, iPad, mac store and android games you are in luck. If you take this course you can learn the basics of game design and learn how to make iPhone and iPad games with absolutely zero programming! &nbsp;It sounds too good to be true but you can realize your game without writing one single line of code!<br>  <br>  This course goes through all of the fine details you will need to start building successful games. The course is designed for beginners to help you understand how a game engine works and the logic behind game production. In this course the fine details on how to make games offered. The instructor shows you the theory behind the games and give you the student a great knowlege base that you wouldn&#039;t normally find on the internet. There is tons of content that will give you the foundation you need to become a great game designer. <br>  <br>  This is a course that is aimed at beginners who want to make a game for themselves or for somebody else. This course is not a technical development course. The course mainly focuses on how the basics of games design and is not for experienced users. For this course you will need a mac computer. The software only runs on a mac. It is highly recommended that you have the latest version and OS that apple has provided. <br>  <br>  This course is recommended for<br>  - This course is aimed at beginners who want to make games today<br>  - People who want to build games and add them to their resume<br>  <br>  This course is not for<br>  - Experienced programmers who know what they are doing. This course is meant for people who don&#039;t want to program. Or want an easier starting point than traditional coding courses. <br>  <br>  There is no excuse not to start. Start learning how to make games today!</p>  ", 
    "end_date": null, 
    "title": "Make iPhone and iPad games in 1 hour without programming", 
    "price": "50.00", 
    "instructors": "John Bura", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/13539_b416_5.jpg", 
    "course_url": "https://www.udemy.com/make-iphone-and-ipad-games-in-1-hour-without-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-02-02T16:19:06Z"
}