{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t Android is taking the market by storm. Why not make your first Android app today!  </p>  <p>  \t Despite what some think, Android has 60%% of the market share on apps. IOS has a mere 20%%. That means your Android app can spread like wildfire once you get it out there.  </p>  <p>  \t If you&#039;ve ever wondered about making your own app, NOW is your chance.  </p>  <p>  \t With this course you will watch over my shoulder as I walk you through the making of a real live Animal Sounds Android app.  </p>  <p>  \t No you don&#039;t need to know how to code. You don&#039;t even need to know HTML.  </p>  <p>  \t Yes! This is a real app, not some app slap on of some weird website.  </p>  <p>  \t It&#039;s a really fun Animal Sounds app you&#039;ll be so excited you built.  </p>  <p>  \t You can publish this app in the Play store, make money from it or just show it off to your friends and co-workers.  </p>  <p>  \t Once you learn the basics you can make more fun apps to your heart&#039;s galore.  </p>  <p>  \t I can&#039;t wait to see what you make.  </p>  <p>  \t I structure my videos in little bits and pieces. First I walk you through the software and installation.  </p>  <p>  \t If you&#039;re on a Mac you&#039;ll learn the one single trick to run Android on Macs. Without it, it has stopped so many Mac users from building Android apps.  </p>  <p>  \t Then I show you how to do everything STEP BY STEP. I don&#039;t skip anything so you&#039;ll never miss a thing and wonder what happened.  </p>  <p>  \t You&#039;ll watch these videos in <strong>High Definition (HD)</strong>. They&#039;re crisp and clear, with step by step instructions and <em>high quality audio</em>.  </p>  <p>  \t No squinting to see what to do, just clear video. In full screen you&#039;ll see all the details.  </p>  <p>  \t Go ahead and make your very first Animal sounds Android app in less than 60 minutes.  </p>", 
    "end_date": null, 
    "title": "Make Your first Android App in 60 minutes FLAT with NO code", 
    "price": "20.00", 
    "instructors": "Omar Elbaga", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65067_d3ed_6.jpg", 
    "course_url": "https://www.udemy.com/make-your-first-android-app-in-60-minutes-flat-with-no-code/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-12T05:23:50Z"
}