{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<span>Thank you for your interest in this course, my name is Yohann, I will be your instructor.</span>  </p>  <p>  \tWith this course, you get the full source code of a game called “Jumpy Surfer”.  </p>  <p>  \tThis is an iOS game where the player controls a Surfer and you get one point every time you avoid from getting bitten by the shark by jumping over it.  </p>  <p>  \tThe gameplay is simple &amp; addictive, which are the main ingredients to make a small game successful in the app store. We call it the circular Flappy Bird game mechanics  </p>  <p>  \tIn this course, I show you every single steps you need to start, and I’m assuming you know nothing or very little,and I’m gonna help you succeed having your very own game, published in the itunes app store, without having to write not even one single line of code!  </p>  <p>  \tSince this source code comes with advertising banners you not only get an education but you also have the potential to make passive incomes from it.  </p>  <p>  \tMany of my students that took my courses, just like this course, made it to the top iTunes charts and they are now making a living out of creating mobile games!  </p>  <p>  \tThis game source code costs hundreds of dollars on its own, and you’re getting it for free with this course. You can keep using this code and make dozens of games out of it. You can make games about collecting gems, candies, pets, rainbows, or treasures and so much more, You imagination has no limits.  </p>  <p>  \tThis is a perfect way to start your mobile app business or increase your app portfolio quickly.  </p>  <p>  \tMake the right decision and join us now. I’ll see you in the classroom.  </p>", 
    "end_date": null, 
    "title": "Make an iPhone game without Programming: Round Flappy Bird", 
    "price": "20.00", 
    "instructors": "Yonatan Zvik, Yohann Taieb", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/239468_e505_2.jpg", 
    "course_url": "https://www.udemy.com/make-an-iphone-game-without-programming-round-flappy-bird/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-08T14:28:27Z"
}