{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>My Udemy Courses have been taken by over 6,000 people in 135 countries. They have also received high ratings throughout Udemy.</strong></p><p>Android devices are used worldwide and over 1.15 billion Android Devices are predicted to ship this year. Did you know that's more than apple?</p><p>Making Android Apps has sort of always been thought of as some magical process that only programmers can do. It was never thought possible that anybody would be able to make Android Apps.</p><p>I'm here to tell you that it is possible! Plus, you never have to write a single line of code! In this course I teach you how to use a tool called App Inventor 2 to make Android Apps using an easy mouse-driven drag and drop block system to make your app work. You build the user interface visually,and then just click the blocks together using the mouse to make it work.</p><p>I know you might be thinking that apps you can make are limited, right? In all honesty, most any kind of app can be made using App Inventor 2, and they are updating it quite often.</p><p>App Inventor 2 is also free to use. It's run by MIT and you use your Google Account. Easy!</p><p>In this course I teach you, in over 5 hours of video instruction, how to leverage the power of App Inventor 2 to make Android Apps easily and without coding. It's set at a pace that starts out at a beginner level and works it's way up to a more advanced level to include making 2 games.</p><p><strong>What are the requirements?</strong></p><ul><li>You will need a computer with an internet connection. Can be Windows/Mac/Linux.</li><li>You should have an Android device, but not required. Although would make it easier.</li><li>A desire to learn.</li></ul><p><strong>What am I going to get from this course?</strong></p><ul><li>Over 5 hours of video lectures showing you how to create Android Apps without coding!</li><li>Learn how to make 2 games.</li><li>You learn the App Inventor 2 environment</li><li>You get periodic course updates.</li><li>Learn how to monetize your apps with ads.</li><li>A good understanding of how Android Apps are made and work.</li><li>A way to make your ideas a reality.</li></ul><p><strong>What is the target audience?</strong></p><ul><li>Beginners interested in learning to make Android Apps.</li><li>Intermediates who took my Make 5 Apps in 1 Hour course.</li><li>Advanced users who are coders that want to learn an easier way to make Android Apps</li><li>Anybody interested in learning how to make Android Apps without coding.</li><li>Anybody who has an app idea that needs to learn how to make it a reality.</li></ul><p><span></span></p><p><span></span></p>", 
    "end_date": null, 
    "title": "Make Android Apps No Coding App Inventor 2 Complete Course", 
    "price": "20.00", 
    "instructors": "Robert Pugh", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620966_5523_3.jpg", 
    "course_url": "https://www.udemy.com/make-android-apps-no-coding-app-inventor-2-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T02:49:27Z"
}