{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t            This app design course will show you how to very easily create and manage GREAT native apps for Android, iPhone, and iPad.  No programming is required and almost anyone can do it quickly and easily.  This tool will create HTML5 mobile apps too. Apps created using this tool are beautiful, efficient, and extremely powerful!  This course uses a step by step method with video lectures walking you through every step of the app design and development process. I have literally built an app for a small business from start to finish without writing a single line of code and I have recorded every step of the process.  I will narrate exactly what I am doing and highlight the important information along the way.  Members of the class may also publish their apps to the Android market (Google Play) and mobile websites free of charge. Class member will also have the ability to publish to iOS (iPhone and iPad) but if you decide to publish to iPhone and iPad there will be a small monthly fee.  If you follow our step by step process and use our tool, you will be designing beautiful and powerful apps in no time at all.  Start building apps for your company, school, golf course, restaurant, church, etc. or start an app design company and build apps for several small businesses and start earning some serious income.  </p>  <p>  \t        There are over 4.5 hours of video lectures in this course and more information is added when new features are added.  The app design tool is cloud based and easy to use from any connected computer and you can have your app built very quickly!  You can also start building apps for others and start generating income.  </p>  <p>  \t        There are over 35 video lectures and you can proceed at your own pace.  You can also skip around and only view the lectures that describe features you plan to use in your app.  If there is a lecture that describes an app feature that you have no interest in using, simply skip that lecture.  You can always come back to that lecture should you decide you want to learn about that app feature for a different app.  </p>  <p>  \t  If you want to start building beautiful, powerful, and GREAT Android, iOS (iPhone and iPad), and HTML5 (mobile websites) apps today, then this course is for you!  </p>", 
    "end_date": null, 
    "title": "Make iPhone, Android, & HTML5 apps using GreatAppBuilder", 
    "price": "20.00", 
    "instructors": "Great AppBuilder", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61762_22f5_4.jpg", 
    "course_url": "https://www.udemy.com/make-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-24T19:37:56Z"
}