{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong style=\"\">Wanting to increase downloads for your app?</strong></p><p>With more than 1.2 million apps in the App store, you know that you should market your app and heard about App Store Optimization (ASO) but don&#039;t know where to start?</p><p>Then this course is for you!</p><p>Here, I show you step by step (using real examples) how to do ASO for your iPhone and iPad apps on iOS 8. The course is accessible to anybody and no prior knowledge of App Marketing or App Development is required.</p><p>My name is Seb Hareng. I&#039;m an app developer, marketer and entrepreneur based in the Silicon Valley (close to the Apple HQ). I published my first iPhone app in the store in 2010. I&#039;ve been doing ASO for my own apps for years and help other app publishers getting more downloads.</p><p>I&#039;m also the host of the App Marketing Lab blog where I write about App Marketing every week.</p><p>With this course, you&#039;ll learn how to find the best keywords for your app and how to maximise the number of keywords your app ranks for. </p><p>You&#039;ll also learn how to treat your app like a real product and make it stand out in the app store by creating a great app icon, screenshots, description.</p><p>Are you ready? Then don&#039;t wait!</p><p>Join this course and get more downloads for your app NOW!</p>", 
    "end_date": null, 
    "title": "Marketing iOS Apps Using App Store Optimization (ASO)", 
    "price": "30.00", 
    "instructors": "Sebastien Hareng", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386824_0a74_4.jpg", 
    "course_url": "https://www.udemy.com/app-store-optimization-for-ios-aso/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T16:46:38Z"
}