{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "  <p><strong>Course Overview</strong><br></p>  <p>  \t        First thanks for the visiting my course page. In this course it's about Flow of app  It has various name given by people like Blueprint/UX/Wireframe/App Flow/Prototype  here we call Blueprint or sometime wireframe. You will need to just spend 20-30 minute in a day so course will be finish in 1 week, You will learn all aspect about Blueprint and became master to create app Blueprints. And Its not require any prior skill to join this course.  </p>  <p>  \t<strong>Who can join ?</strong>  </p>  <p>  \t          After all this course is start from first step of mobile app development so it's best suite for beginner who want to make app for their own business, Professional developer, designer, college student and teachers and Software Consultant.  </p>  <p>  \t<strong>Why take this course?</strong>  </p>  <p>  \t          When you think about create app just think you want this kind of app but don't know how to represent that idea to someone who can build and understand your exact concept so here is the solution.  </p>  <p>  \t          This course is very useful for everyone and learn skill of how to start app development because its first step and get clear vision of your entire app which is in your mind. if you are consultant service provide, college student or full time developer designer you can prepare feature list from rough idea then easily convert each screen into working  App blueprint.  </p>  <p>  \t          This course does not mean just make screens but it'll  convert your app idea into and Action and represent like working app blueprint/wireframe/prototype and there is no require any coding skills.  </p>  <p>  \t<strong>Course Material</strong>  </p>  <p>  \t          In 39 best quality lecture you will learn and  able to make working app blueprint from concept to and Action. You will clearly understand the app prototyping what control where to use and how to represent in screen and which object look better in terms of UX.  </p>  <p>  \t          This course start from basic so everyone understand,  How to implement  app idea and  how to use your idea to make app. So you will learn how to prepare app features from idea then use feature list to create screens. Learn how to connect each other.  </p>", 
    "end_date": null, 
    "title": "Mastering  in iOS/Android App Blueprint/UX/App Flow", 
    "price": "25.00", 
    "instructors": "Alpesh Patoliya", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354726_55d3_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-in-iosandroid-app-blueprintuxapp-flow/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T21:12:29Z"
}