{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Android is the most popular operating system around the world and has held the record for having the highest number of apps in its App Store. Hundreds of Apps are launched on the App Store every day, with the majority of the apps being developed by the general people.</p>  <p>Google recently announced the latest version of its Android, the Android M – also known as Android Marshmallow. Labeled as the ‘sweetest, smartest Android version yet’, Android M comes packed with a lot of treats for users as well as developers.</p>  <p>Google has upped its innovative factor by incorporating amazing features to the latest Android version. Marshmallow becomes more interactive with the new Google Now on Tap feature that allows users to search for something related to the context of a conversation by just tapping on the Home button. This result can also be shared with a particular person or on social media websites.</p>  <p>Other improvements are sweet battery optimization including a Doze features that helps reserve battery by putting apps on sleep mode, while the phone is idle. Finger print recognition support has also been added for apps that wish to make transactions more secure. It also comes with another security feature, permissions, where user decides what apps can access what aspects of the phone. </p>  <p>All of these amazing features allow developers to build better and stronger apps. Do you want to become a developer? Do you wish to create some brilliant apps, but you don’t have any idea how to? Well, look no further. This course is answer to all your developing problems.</p>  <p>Our course has been designed to cater to not only the advanced users, but also the beginners. It aims to give you a full-fledged understanding about Android, app development using the Android platform, as well as designing apps for the Marshmallow version. </p>  <p>The course will cover technologies such as the fundamentals of Android, setting up the Android environment, installing and using Android studio and SDK tool, building blocks of android app development (application, activities, events and layouts), java programming language, and Android aspects (Views, Layouts, Event Listeners and Intents). </p>  <p>If this is not enough, the course will also help you build an app from scratch along with the instructor. </p>  <p>With so much packed in the course, it is no wonder that this course is as sweet as the newest member of the Android family. Enroll now and become an android wiz.</p>", 
    "end_date": null, 
    "title": "Mastering Mobile App Development for Android Marshmallow", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626728_bebf.jpg", 
    "course_url": "https://www.udemy.com/mastering-mobile-app-development-for-android-marshmallow/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T06:25:10Z"
}