{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>O <strong>Minicurso Intel XDK</strong> é um curso expresso sobre a ferramenta Intel XDK, onde são apresentados os principais tópicos para o desenvolvimento de aplicativos nesta IDE, utilizando tecnologias como HTML5 e Apache Cordova.</p><p>Dividido em 12 aulas, o curso contempla desde os conceitos básicos da ferramenta, suas bibliotecas, até o acesso aos recursos de hardware do dispositivo (GPS, Câmera, etc.).</p><p>Ao final, será explicando ainda como realizar testes, validações e a publicação do projeto nas lojas de aplicativos.</p><p>Tudo isso de maneira objetiva, através de uma didática diferenciada e exemplos práticos.</p><p><strong>Neste curso você aprenderá a:</strong></p><ul><li>Conceitos básicos do desenvolvimento mobile</li><li>Interagir e utilizar todos os recursos da ferramenta Intel XDK</li><li>Desenvolver aplicativos que utilizem Câmera, GPS, Agenda, Banco de dados e etc.</li><li>Realizar testes e gerar aplicativos móveis para Android</li></ul><p><em>* Ao realizar o Minicurso Intel XDK você ajuda a criar novos conteúdos educacionais e contribui com a formação de novos desenvolvedores no Brasil.</em></p><p><em></em><strong>Dúvidas?</strong> entre em contato pelo e-mail contato@diegocavalca.com</p><p><strong>Dúvidas Frequentes</strong></p><p><em>1. Qual é o prazo para concluir o curso?</em></p><p>Você tem acesso de tempo ilimitado para fazer o curso!</p><p><em>2. O curso tem horário fixo?</em></p><p>Não, você pode fazer o curso a qualquer horário, só precisa de um computador com acesso a internet!</p><p><em>3. Vou ter um certificado ao concluir o Minicurso Intel XDK?</em></p><p><span>Sim! A plataforma Udemy lhe garante um certificado de conclusão reconhecido após o término do Minicurso Intel XDK.</span></p><p><strong>OUTRAS DÚVIDAS?</strong><br><span></span></p><p>Caso tenha alguma outra dúvida ou queira conversar sobre algo relacionado ao Minicurso Intel XDK, por favor envie um e-mail para contato@diegocavalca.com.</p>", 
    "end_date": null, 
    "title": "Minicurso Intel XDK", 
    "price": 0, 
    "instructors": "Diego Cavalca", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478994_df5e_5.jpg", 
    "course_url": "https://www.udemy.com/minicurso-intel-xdk/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-17T13:32:42Z"
}