{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">More than 100 Tools for you......!</p><p style=\"\">This is not just a simple make your APP course. Its much much beyond that! Its a holistic approach course.....</p><p style=\"\">Their is a big list of people who are interested in creating their own iPhone/iPad and Android apps these days. Publishers,&nbsp;small businesses, advertising agencies, app enthusiasts/hobbyists/wannabe  developers–the list keeps growing. No matter who you are or what&nbsp;experience&nbsp;you have&nbsp;<strong style=\"\">this course has everything you need to develop,&nbsp;enhance and refine your next top Application</strong>. I have covered from basic to advance level Platform analysis, you wont find anywhere else. Get  ready for some great tools that can help you create a more polished app with  the biggest chance of meeting your goals (like making money or engaging users).</p>    <p style=\"\">&nbsp;For small  businesses I’ve included some great services that let you create an app on your  own with no coding required. If you’re a developer and you use this list to  create an app, let me know! I’d be happy to help promote it if it’s good.</p><p style=\"\">This is the most comprehensive and concise courses on the web. You will learn everything here.&nbsp;</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Mobile Apps Development without Coding,100 Tools Analysis", 
    "price": "50.00", 
    "instructors": "Philanthropy and Entrepre... Moud Nuri", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46763_debf_20.jpg", 
    "course_url": "https://www.udemy.com/mobile-apps-development-without-coding100-tools-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-21T01:06:39Z"
}