{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>Course updated: October 2015</em></strong></p><p><strong><em></em></strong>Use these various tools and techniques to go from app idea to earning money in the app stores <strong>today</strong>! Save time by removing the hurdles that come with coding apps manually.</p><p><strong>Profitable iOS and Android Apps in Just a Few Hours </strong></p><ul><li>Step by step instructions from app concept, to app store submission</li><li>Tips for selecting a profitable niche</li><li>Including in-app purchases, ads, or paid apps</li><li>See your app changes instantly without resubmitting to the app store</li><li>Tools to quickly generate beautiful graphics to make your app stand out</li><li>Build apps with maps, directions, social media streams, videos, music, push notifications and more!</li><li>Enable your clients to easily edit the content of the apps you've created for them</li><li>Learn techniques to get better app reviews</li><li>Save tons of time by avoiding the hurdles that come with learning code</li><li>Easily create a Flappy Birds clone</li><li>Keep all the source code for your app to change at anytime</li><li>Start earning money from apps today!</li></ul><p>First, I'll show you how to download, install, and setup all of the tools you'll need to get started. Then, you'll learn how to select a profitable niche and create an outline of your app.</p><p>From there, you'll be creating and editing your app while seeing your changes on your device or emulator in real time! You can create basic apps with simple features or more complex ones with many different screens and functions.</p><p>Then, you'll see how to upload your app directly to the App Store and Google Play Store and begin generating income!</p><p>Whether you know nothing about code or you just need a quicker way to make apps, this is the best course for you! Additional lectures may be added to the course, plus you'll get prompt, friendly, responsive support by email or on the Udemy forums to help you every step of the way.</p>", 
    "end_date": null, 
    "title": "Mobile App Development: Make iOS & Android Apps Without Code", 
    "price": "20.00", 
    "instructors": "Cameron Wills", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427228_c4c6_3.jpg", 
    "course_url": "https://www.udemy.com/mobile-app-development-make-ios-and-android-apps-without-code/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T21:46:12Z"
}