{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>WELCOME TO THE NEW, IMPROVED AND UPDATED VERSION OF THE BEST SELLING MOBILE APP DESIGN COURSE ON UDEMY</strong></p><p><strong></strong>This course is not just about creating a pretty app, it’s about designing an app that works great and happens to be beautiful. We'll teach you a complete design workflow that will allow you turn your idea into a fully designed and engaging mobile app using Sketch 3.</p>\n\n<p><strong>Learn to design engaging apps with this beginners mobile app design course <br></strong></p>\n\n<ul><li>Master the ins and outs of Sketch 3</li><li>Design a beautiful and user-friendly interface for your app</li><li>Learn UX Research techniques to craft an engaging app</li><li>Learn Design best practices to build your product efficiently</li><li>Outline your visual concept</li></ul>\n\n<p><br><strong>A skill that will change your life</strong><br>Mobile apps are everywhere, transforming our personal and profesionnal lives. And what makes an app successful is how well it is conceived. The demand for people able to design such engaging and well thought apps is constantly growing. That's why mobile app designers are averaging over $100k a year.<br>With Sketch 3 and this course, you'll have the skills to produce professional designs even if you have zero previous experience.</p><p><strong>Content and Overview</strong></p><p><strong></strong>This course is efficiency oriented and is taught with an example. Each lesson represents a step in the design process that will be applied to the app we will be building and that we'll help you apply to your own idea. You don't need any previous experience as a designer, we'll teach you everything you need to know along the way.</p><p>We'll begin by teaching you what UX is, how it affects the UI design and how you can use UX research techniques to craft a great app. We'll show you how to efficiently build a quick first version of your app and how to preview it on a device. This will get you used to Sketch and we'll give you exercises to build up your design skills.<br>We'll then work on the visual concept of your app, you'll learn about colors, fonts and how to properly use them. This will allow us to create the final design of our app, beautiful and functional. In this section we'll dive deep into Sketch amazing functions and best practices.<br>You'll even learn how to design an icon for the app and showcase your finished app !</p><p><strong>By the end of this course you'll...</strong></p>\n\n<ul><li>Be able to explore your idea in depth to find the right way to build your app</li><li>Have a <strong>full proficiency in design software</strong></li><li>Have a very good understanding of design principles and how to use them</li><li>Be able to build graphic illustrations and icons even if you've never drawn anything in your life</li><li>Know how to choose the flow and navigation of your app</li><li>Know how to create a very clear layout that will serve your content</li><li>Know how to create the identity of your app and how to choose and use colors and fonts</li><li>Be completely autonomous as a designer</li><li>Save a lot of money and time by not needing to work with a freelance designer</li></ul>", 
    "end_date": null, 
    "title": "Mobile App Design from scratch with Sketch 3 : UX and UI", 
    "price": "25.00", 
    "instructors": "Maxime Cormier, Adrien Dupuy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99554_d15d_12.jpg", 
    "course_url": "https://www.udemy.com/mobile-app-design-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-30T16:53:49Z"
}