{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tWith mobile application development steadily on the rise, the ability to create native apps for multiple platforms using a single code base is certainly advantageous, if not essential. Titanium Studio is an IDE that allows developers to do just that.  </p>  <p>  \tThis course offers in-depth instruction of how to effectively use Titanium Studio, as well as multiple hands-on projects, ensuring students can create apps for Android, Blackberry, iOS, and MobileWeb with a single code base using JavaScript.  </p>  <p>  \t<strong style=\"\">Learn and Master Titanium Studio in this Comprehensive Course</strong>  </p>  <ul style=\"\">  \t<li><span>Create new projects using JavaScript</span></li>  \t<li><span>Build mobile applications that utilize web services</span></li>  \t<li><span>Gain understanding of event listeners, layouts, and views</span></li>  \t<li><span>Become proficient in UI controls</span></li>  \t<li><span>Learn advanced app navigation and effective data display</span></li>  \t<li><span>Gain tips and tricks to assist in app design</span></li>  \t<li><span>Learn methods for quicker app development and plan for complicated projects</span></li>  </ul>  <p>  \t<strong style=\"\">A Lucrative Tool For New and Experienced Mobile Developers Alike</strong>  </p>  <p>  \tWhether you are looking to work in the mobile development field, or want your apps to appeal to a wider mobile-audience, this course is for you. No longer do you have to choose to market to Android or iOS, or spend valuable time developing your app for both platforms. With less time spent developing and higher profits from an expanded market, this lucrative skill set is an asset to new and experienced developers alike.  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \tComprised of more than thirty lectures and over four hours of content with multiple hands-on projects, this course offers in-depth instruction, covering everything from how to create a new project to using event listeners, layouts, and views. Students will learn to effectively use UI controls, such as image views, labels, text fields, text areas, switches, alert dialogues, activity indicators, web views, scroll views, scrollable views, and buttons.  </p>  <p>  \tUsing the classic framework, students will build three apps, taking advantage of the tools provided in Titanium Studio. These projects are designed to maximize hands-on learning, with the final project being all-encompassing, tying together all course material and providing an excellent reference tool for future projects. Substantial sample code is provided in a format that is easy to follow.  </p>  <p>  \tUpon completion of the course, students will be proficient in Titanium Studio and have the knowledge and confidence to create functional, real-life apps.  </p>", 
    "end_date": null, 
    "title": "Mobile App Development with Titanium Studio by Jason Foster", 
    "price": "20.00", 
    "instructors": "Jason Foster", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350066_44e7_3.jpg", 
    "course_url": "https://www.udemy.com/mobile-app-development-with-titanium-studio-by-jason-foster/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T20:57:47Z"
}