{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Descubre un MUNDO NUEVO de posibilidades en el desarrollo y marketing de aplicaciones móviles en iOs y Android.</strong>  </p>  <p style=\"\">  \t                  Este video curso te AYUDARÁ a entender las diferente PLATAFORMAS y constructores móviles existentes, aprenderás cómo utilizar mensajes SMS y códigos QR en tus campañas de marketing, DESARROLLAR sitios web, aplicaciones y juegos para móviles, todo en un formato ameno y simple de entender.  </p>  <p style=\"\">  \t<strong style=\"\">MobileMático Full</strong> está lleno de CONTENIDO e <strong style=\"\">información ÚTIL</strong>, con videos actualizados permanentemente sobre cómo desarrollar desde cero un <strong style=\"\">RENTABLE</strong> y lucrativo negocio móvil desarrollando apps.  </p>  <p style=\"\">  \t        Y esto puede ser la <strong style=\"\">VÍA DIRECTA</strong> para que comiences a <strong style=\"\">GANAR DINERO</strong> desarrollando aplicaciones móviles, aprenderás todas las <strong style=\"\">TÉCNICAS </strong>necesarias para hacerlo, te mostraré los <strong style=\"\">CONSTRUCTORES</strong> más avanzados y la forma correcta de utilizarlos para que tus aplicaciones luzcan profesionales y únicas.  </p>  <p style=\"\">  \t<strong style=\"\">Aprenderás</strong> cómo OBTENER atractivas ideas y cómo <strong style=\"\">PLANIFICAR</strong> el desarrollo de tus aplicaciones, donde encontrar los más talentosos desarrolladores y cómo <strong style=\"\">PROMOCIONAR</strong> cada uno de tus lanzamientos y/o desarrollos.  </p>  <p style=\"\">  \t<strong style=\"\">Descubre con este video curso…</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Cómo desarrollar desde cero apps nativas en iOs a través de <strong style=\"\">Xcode</strong>.</li>  \t<li style=\"\">Los <strong style=\"\">CONSTRUCTORES</strong> de aplicaciones en Android gratuitos disponibles en Internet.</li>  \t<li style=\"\">Técnicas probadas de<strong style=\"\"> MARKETING</strong> que te asegurarán cada vez más <strong style=\"\">DESCARGAS</strong> diarias.</li>  \t<li style=\"\">Cómo evitar los <strong style=\"\">ERRORES</strong> que otros desarrolladores cometen y que no les permiten crecer.</li>  \t<li style=\"\">Cómo encontrar desarrolladores <strong style=\"\">EXPERTOS</strong> para crear tus super APPS.</li>  \t<li style=\"\">Como lograr fieles <strong style=\"\">SEGUIDORES</strong> dispuestos a descargar cualquier aplicación que decidas crear.</li>  \t<li style=\"\">Todo sobre el <strong style=\"\">NEGOCIO</strong> de las apps.</li>  </ul>", 
    "end_date": null, 
    "title": "MobileMatico Full >Todo Sobre Desarrollo y Marketing De Apps", 
    "price": "20.00", 
    "instructors": "Daniel Rogers", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339818_37ec_4.jpg", 
    "course_url": "https://www.udemy.com/mobilematico-todo-sobre-desarrollo-y-marketing-de-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T12:14:46Z"
}