{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Hello, </strong><strong>fellow entrepreneurial soul!</strong></p><p><strong>Do You Have An Awesome Mobile App Idea Spinning Around In Your Head?</strong></p><p><strong>But Have NO IDEA How To Code/Program An App?</strong></p><p><strong>Then This Course Is For You!</strong></p><p>I mean I get it:</p><p>You want to be able to create an amazing mobile app that you can truly be proud of and share with friends or possible future investors, but you freak out whenever you see a line of complex code.</p><p>I was just like you until I found a way around the tiresome and kinda scary process of coding an entire app from scratch. I started to use Photoshop and a few online prototyping tools and within a few hours time had most of the app designed that was originally only an idea.</p><p>This course was created so you too can have the exact same skillset and toolbox so to speak that will enable you to design your dream app..because it's not much use if it's just in your head right?</p><p><strong>Here are some of the amazing things you will learn in this step-by-step over the shoulder, 10 hour long course! Phew, that was a lot to say!</strong></p><ul><li><em><strong>Learn simple techniques to design the screens of your app in Photoshop and then use online prototyping tools to make it function like a real app.</strong></em></li></ul><p><em><strong></strong></em></p><ul><li><em><strong>See what your app will look like in the hands of another human being</strong></em></li></ul><p><em><strong></strong></em></p><ul><li><em><strong>Get a glimpse of what your app might look like in the app store.</strong></em></li></ul><p><em><strong></strong></em></p><ul><li><em><strong>Learn how to showcase your app on an attractive website.</strong></em></li></ul><p><em><strong></strong></em></p><ul><li><em><strong>Create an app trailer video to show off your app to the world.</strong></em></li></ul><p><em><strong></strong></em></p><ul><li><em><strong>And much more..</strong></em></li></ul><em><strong></strong></em><p><br></p><p><strong>Now I know what your thinking...</strong></p><p>Mike, this sounds great but...</p><ul><li><em><strong>I don't have Photoshop!</strong></em></li><li><em><strong>I don't have an artistic bone In my body!</strong></em></li><li><em><strong>I don't have an app idea!</strong></em></li><li><em><strong>I don't have a ton of money to spend on expensive tools like Photoshop!</strong></em></li></ul><p><em></em></p><p>I hear ya!</p><p>I catch your drift (how old school right)</p><p>And here's the good news...you don't have to have an app idea (or any photoshop skills for that matter).</p><p>And I'll show you how to snag photoshop <strong>WITHOUT</strong> paying hundreds of dollars!</p><p>Plus you can watch the free previews below if your not sure if this course is the right one for you!</p><p>-------------------------------------------------------------------------------------------------------</p><p><span></span></p><p>So obviously there's nothing to lose and everything to gain!</p><p>Are you ready to transform your app pipe dream into a fully functioning prototype masterpiece that you can be proud of?</p><p>If so \"<strong>CLICK THE TAKE THIS COURSE BUTTON</strong>\" AT THE TOP</p><p>I'll See You Inside The Course My Friend!</p><p>This Is Going To Be A Blast!</p><p>P.S.:) I forgot to mention the extremely exciting part...</p><p>This course will be updated over time with more material and other prototyping tips/tutorials.</p><p>That's right : pay once..get access to all future updates<strong> FOREVER!!!</strong></p><p>So what are ya wait'n for?</p><p><strong>CLICK THE TAKE THIS COURSE BUTTON!</strong></p><p>-Mike<br></p>", 
    "end_date": null, 
    "title": "Mobile App Design Mastery", 
    "price": "50.00", 
    "instructors": "Mike Acquaviva", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635978_e903_7.jpg", 
    "course_url": "https://www.udemy.com/app-prototype-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T16:21:36Z"
}