{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Tired of seeing endless 'How to code 50 Android apps in 10 days' courses?</p><p>Ever just wanted to <strong>get stuck in to Android app development right away</strong>?</p><p>Well, that's why I created this Android development course! No other course takes you from beginner (with no experience) to a full Android app in less time than it takes to make  a sandwich! I will show you how to:</p><ul><li>Install Android Studio (and required extras)</li><li>Setup the graphical look of your app</li><li>Connect layout elements like buttons and Text Fields to your java code </li><li>Code in Java within an Android activity</li><li>Store items in Android Shared Preferences, making them accessible across app restarts</li></ul><p><strong>This course is for you if you:</strong></p><ul><li>Are a beginner or novice to Android App development</li><li>Want to understand Android apps in a short period of time</li><li>Love proceeding at an awesomely brisk pace!</li></ul><p><strong>This course is not for you if:</strong></p><ul><li>You are an expert or intermediate programmer</li></ul><p><strong>What software do you need?</strong></p><ul><li>Android Studio (free) which runs on PC / Mac / Linux</li></ul><p><strong>Do you need experience?</strong></p><ul><li>No. I assume you are a complete beginner to apps and development in general</li></ul><p><strong>What makes this course different?</strong></p><p>It's just <strong><em>so</em></strong> quick! Take i right now and you'll learn Android apps before you can even blink! Everyone used to tell me apps were hard to make - but they're wrong. It's probably because they had bad teachers - join me and I'll show you what good teaching is!</p><p>------------------------------------------------</p><p><strong>PLEASE NOTE: </strong>This course is designed to get you up and running with Android and Android Studio in <strong><em>record</em></strong> time. Therefore we have limited time to actually explain everything. My other course on Android app development explains everything we do in <strong><em>much</em></strong> <strong><em>more</em></strong> detail.</p>", 
    "end_date": null, 
    "title": "Mobile App Development in 27 Minutes: Android", 
    "price": "20.00", 
    "instructors": "Mr Grant Klimaytys", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695836_2fba.jpg", 
    "course_url": "https://www.udemy.com/create-an-android-app-in-12-minutes-with-android-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T18:38:09Z"
}