{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t&quot;Moodle for Mobile Learning&quot; will show you how you can transform your classroom by using mobile learning activities. You will learn how to create engaging mobile content in Moodle that will captivate your students and with the help of social media, students will be able to communicate and collaborate more effectively.  </p>  <p>  \t&quot;Moodle for Mobile Learning&quot; starts with the setting up of Moodle to enable effective learning through mobile devices. It ends by looking at different mobile activities that a teacher can use to engage their classroom. Along the way we have easy-to-follow, clear video instructions that will revolutionize the way you teach.  </p>  <p>  \tYou will learn how to set up up Moodle, including theming for mobile devices and the new Moodle mobile app. You will discover different ways of creating innovative content and assessments for mobile devices. You will be able to use social media to interact with your students. Assessment and communication through mobile devices will add a new dimension to your course.  </p>  <p>  \t&quot;Moodle for Mobile Learning&quot; will help you to achieve a different classroom from the one you currently have. It will give you the skills and techniques to transform your teaching, through easy-to-follow, practical video tutorials.  </p>  <h4 style=\"\"><strong style=\"\">About the Author</strong></h4>  <p>  \t <strong style=\"\">Graeme </strong>has been involved with learning technology for over 10 years and has been a Moodle administrator for the last four years. He recently project managed his organization&#039;s move from Moodle 1.9 to Moodle 2.1. Graeme devised the concept for the soon-to-be-released Caboodle Moodle block. This block has been created through a combined project with five educational institutions, and aims to increase the student utilization of e-resources by making access to the resources easier.  </p>", 
    "end_date": null, 
    "title": "Moodle for Mobile Learning", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351800_f52d_2.jpg", 
    "course_url": "https://www.udemy.com/moodle-for-mobile-learning/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T10:48:12Z"
}