{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">If you want to produce iOS applications there&#039;s no way around it-- You need to learn Objective C. Based on the C programming language, Objective C is a cool derivative of C that adds many functions and features. &nbsp;In our Objective C course, you&#039;ll learn everything you need to know about the Objective C programming language to competently start learning the iOS libraries and development.<br style=\"\"><br style=\"\">If you tried to learn iOS Development but found it too difficult to understand, this is the course you need. &nbsp;If you have NEVER programmed before, take our &quot;<a href=\"http://www.udemy.com/c-programming-ios-development-starts-here/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Learn C Programming</a>: iOS Development Starts Here!&quot; course first and then join this course and learn Objective C. <br style=\"\"><br style=\"\">You&#039;ll love the experience as you start with Objective C variables and move through more complex concepts like the Objective C foundation classes, data structures and creating your own classes and objects. &nbsp;This class contains over four hours of video lecture, lab exercises, and more.<br style=\"\"><br style=\"\">In this ultimate Objective C video tutorial you&#039;ll work with instructor Mark Lassoff to master the concepts of Objective C programming used by iPhone and iPad application developers worldwide.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Objective C for Beginners", 
    "price": "45.00", 
    "instructors": "LearnToProgram, Inc.", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8620_ebdc_10.jpg", 
    "course_url": "https://www.udemy.com/objective-c-for-iphone-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-07-17T20:14:07Z"
}