{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>In this course you will<strong> create a fully customised iOS 9 application </strong>called Quotes To Go from start to finish. Quotes to Go was created specifically to work as an example for this course and has already been<strong> downloaded from the Appstore by thousands of people around the world</strong>. So this is not just a simple demo application. <strong>This is a 100% real world app</strong>.<br></p><p>This course is for everyone who wants to learn more than the basics of iOS development. After watching this course you will have immersive knowledge about professional iOS development and advanced programming techniques. </p><p>Some of the <strong>highlights</strong> that we we are going to cover are:</p><ul><li>custom ViewController transitions</li><li>TableView customisation</li><li>custom menues</li><li>CoreData database searches</li><li>asynchronous programming</li><li>iCloud integration</li></ul><p><strong><br></strong></p><p><strong>Course abstract</strong></p><p>After introducing you to the Quotes To Go App, which this course is about, we will have a close look at the design and we will identify key obstacles that we have to face when translating UI design into code. We will move on by learning more about data saving techniques like CoreData and plists. After saving our first quotes we will cover custom ViewController transitions to ensure a great user experience. Displaying all quotes in a beautifully designed TableView will be the next item on our way. We will even <strong>use Wikipedia to find images of famous people</strong> and use them as author images. We will also <strong>perform face detection</strong> to ensure that a persons face is always visible. After integrating some basic features like adding, deleting and sharing quotes, we will focus our efforts on one of the app’s highlights, which is generating great looking quote images that can be saved, but also shared on social media, via text, or e-mail. We will conclude this course by integrating the ability to sync data using iCloud.</p>", 
    "end_date": null, 
    "title": "Professional iOS App Development with Swift", 
    "price": "20.00", 
    "instructors": "Daniel Autenrieth", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643464_84e2.jpg", 
    "course_url": "https://www.udemy.com/real-world-ios-app-in-10-days/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T17:50:46Z"
}