{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Du willst alle über Apples Programmiersprache Swift lernen und dabei eigene tolle iOS Applikationen entwickeln?</p>\n\n<p><strong class=\"redactor-inline-converted\">Dann ist das hier der richtige Kurs für dich!</strong></p>\n\n\n\n<p>Wir haben all unser Wissen in einen praktischen Kurs gepackt, der sogar in the theoretischen Teilen immer einen beispielhaften Praxisbezug sucht und das Lernen damit kinderleicht macht!</p>\n\n\n\n<p>Mit diesem Kurs lernst du alle Aspekte von Swift kennen und wirst dazu in der Lage sein deine eigenen iOS Apps mit Leichtigkeit selbst zu programmieren. Um das noch weiter zu erleichtern, werden wir viele praktische Anwendungen beispielhaft mit verschiedenen Projekten besprechen.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Es gibt hier kein Copy Paste von irgendwelchem Code den keiner versteht!</strong></p>\n\n\n\n<p>Wir wollen, dass unsere Studenten verstehen was sie schreiben und professionell mit den neu erlernten Dingen umgehen können. Damit legst du den <strong class=\"redactor-inline-converted\">Grundstein für eine erfolgreiche Karriere im Bereich der iOS Programmierung!</strong></p>\n\n\n\n<p>Wir wollen dir dabei helfen, indem wir alle wichtigen Dinge ausführlich erklären. Und solltest du dennoch weiter Fragen haben, stehen wir dir <strong class=\"redactor-inline-converted\">persönlich</strong> im Q&amp;A Bereich auf Udemy zur Verfügung.</p>\n\n\n\n\n\n<p>Du bekommst in diesem Kurs alle Ressourcen zur Verfügung gestellt. Das schließt auch Schritt für Schritt Source Code für alle unsere Projekte ein, sodass du immer den aktuellen Stand vergleichen kannst.</p><p>Damit ihr <strong>immer zuverlässig auf dem neuesten Stand seid, wird dieser Kurs mit neuen Versionen von Swift und iOS aktualisiert</strong>, sodass ihr nicht jedes Jahr einen neuen Kurs kaufen müsst!</p>", 
    "end_date": null, 
    "title": "Progammieren lernen: Swift von A bis Z", 
    "price": "50.00", 
    "instructors": "Johannes Ruof, Timothy Meixner", 
    "commitment": "19 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794960_c6f2_2.jpg", 
    "course_url": "https://www.udemy.com/progammieren-lernen-swift-von-a-bis-z/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T18:11:46Z"
}