{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t      ¿Nunca has programado pero vives rodeado de Apps? ¿Quieres desarrollar la tuya?  </p>  <p>  \t<strong style=\"\">El Curso “De la Nada a las Apps” es para ti</strong>. En tiempo récord desarrollarás dos juegos y una aplicación básica; no necesitamos que tengas ningún concepto previo de programación, partimos de cero y avanzamos paso a paso compañándote en tu aprendizaje.  </p>  <p>  \t      El curso se basa en el Corona SDK que permite crear, con gran facilidad apps para dispositivos iOS (iPhone &amp; iPad) y Android. Corona es el SDK de desarrollo multiplataforma más usado del mundo.  </p>  <p>  \t      El lenguaje utilizado es Lua, lenguaje muchísimo más sencillo que Objective-C o Java, pero no menos potente: es utilizado en juegos de primer nivel, como World Of Warcraft.  </p>  <p>  \t      Disfrutarás la metodología AGBO Training: <strong style=\"\">aprender casi sin darte cuenta</strong> y de forma muy dinámica conceptos que en otro curso te llevaría meses asimilar. Y así lo han vivido nuestros alumnos:  </p>  <p>  \t<em style=\"\">\"No existen cursos como este, que te expliquen desde cero, y además con personal MUY EXPERIMENTADO\" </em>J. Gonzalez.  </p>  <p>  \t<em style=\"\">\"No es fácil que gente de tanto nivel se preste a compartir su sabiduría y su ilusión con alguien que no sabe nada, y sean capaces en tan poco tiempo de darte una base tan sólida\". </em>D. López  </p>  <p>  \t<em style=\"\">\"Mi experiencia ha sido buenísima y además, si no ocurre nada raro, voy a seguir hasta hacerme un Jedi\"</em>. D. Fuertes.  </p>  <p>  \t      Pero no se trata sólo de crear una app, lo más importante es que <strong style=\"\">tendrás las bases de programación necesarias para trabajar con cualquier lenguaje. Aquí comienza tu carrera en desarrollo mobile.</strong>  </p>  <p>  \t      Al completar este curso podrás perfectamente avanzar a nuestro best-seller, el <strong style=\"\">Curso de Programación iOS para iPhone &amp; iPad con Fernando Rodríguez.</strong>  </p>  <p>  \t<strong style=\"\">El mercado de Apps sube, y las oportunidades laborales te esperan.</strong>  </p>  <p>  \t<strong style=\"\">CONVIÉRTETE EN DESARROLLADOR MOBILE</strong>  </p>", 
    "end_date": null, 
    "title": "Programación de Apps para NO Programadores", 
    "price": "50.00", 
    "instructors": "KeepCoding Online, María José Olivares", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315862_8d5c_3.jpg", 
    "course_url": "https://www.udemy.com/programacion-de-apps-para-no-programadores-agbotraining/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T14:57:56Z"
}