{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>Become a professional iOS 9 app developer by building Real-World projects.</strong>  </p>    <p>  \t         In this project-based course you'll learn how to build a <strong>beautiful and elegant iOS 9 Blog Reading app</strong> that fetches content from a <strong>Wordpress site</strong>.  </p>  <p>  \t               Blog reading apps are one of the most common use cases and if you become a full-time iOS developer you will surely come across this requirement. We'll guide you step by step into building this entire app from total scratch.  </p>  <p>  \t<strong>Join the 45,000 students that are learning new skills in our Udemy courses!</strong>  </p>  <p>  \t               This course is authored by <strong>Sebastian Dobrincu</strong>, professional iOS developer and trainer with over 5 years of experience.</p>  <p>  \t               What you'll learn in this <strong>Learn by Doing</strong> training:  </p>  <ul>  \t<li>Creating an elegant iOS 9 app using Objective-C and Xcode.</li>  \t<li>Using Xcode's drag and drop tools to build beautiful User Interfaces.</li>  \t<li>Implement sleek animations and transitions inside your app.</li>  \t<li>Fetch data from a Wordpress site, using the Wordpress API plugin.</li>  \t<li>Putting it all together to make a complete Real-World app</li>  </ul>  <p>  \t<strong>Wordpress powers around 40% of the Internet, and iOS 9 is the hottest tech to learn. This course allows you to combine the two and build an awesome portfolio!</strong>  </p>", 
    "end_date": null, 
    "title": "Project-Based iOS 9 App Development - Build a Real App", 
    "price": "20.00", 
    "instructors": "Sebastian Dobrincu", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/281352_13b6_6.jpg", 
    "course_url": "https://www.udemy.com/ios-8-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-15T07:49:16Z"
}