{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>The Projects in PhoneGap course is here with 10 amazing enterprise class applications. Build them while you learn one of the fastest growing mobile development technology. You no longer need to learn multiple languages to support your app across multiple platforms like iOs, Android, Windows, Blackberry and Bada.   Master this awesome tool and you can just use HTML, CSS and JavaScript to build mobile apps which run on all the mobile platforms. We have hand picked projects which will help you master PhoenGap along with lots of frontend and backend technologies. </p><p>The projects covered in the course are as follows:</p><p><strong style=\"\">Basic PhoneGap App</strong></p><p>Learn to set up tools and build this app to learn and understand the entire lifecycle of app production using PhoneGap</p><p>Technologies you will learn - PhoneGap, Node, NPM, XAMMP, JQuery Mobile, PhoneGap</p><p><strong style=\"\">Channel Vidz -Youtube App</strong></p><p>The Project will use Youtube Data API to allow us to specify a channel name and get the uploaded videos for the channel</p><p>Technologies you will learn - JQuery Mobile, PhoneGap APIs</p><p><strong style=\"\">Github Repo Finder</strong></p><p>Interact with Github API to get developer and repository content</p><p>Technologies you will learn - HTMl, CSS, JavaScript and jQuery Mobile</p><p><strong style=\"\">Ionic Task Manager</strong></p><p>Build a Mobile Task manager</p><p>Technologies you will learn - Ionic framework, Angular JS, Local Storage HTML5</p><p><strong style=\"\">Loc Weather App</strong></p><p>Build a full featured weather reporting application.</p><p>Technologies you will learn - Geolocation API, Geocode services, Bootstrap, </p><p><strong style=\"\">RentFind Apartments</strong></p><p>Full featured CRUD applications where users can find search, add and edit rental listings.</p><p>Technologies you will learn - AngularJS, Foundation UI and Firebase</p><p><strong style=\"\">RSS Feed Reader</strong></p><p>Allow users  to easily add their favourite news feeds for easy access.</p><p>Technologies you will learn - Jquery Mobile, Google Feed API</p><p><strong style=\"\">Facebook Mobile App</strong></p><p>Learn to build a facebook Mobile application</p><p>Technologies you will learn - Facebook SDK, Graph API, Local Storage</p><p><strong style=\"\">PhotoCloud</strong></p><p>Build app to create photo album on cloud</p><p>Technologies you will learn - Firebase cloud system</p><p><strong style=\"\">Mobile Diary</strong></p><p>A complete Mobile Diary Application with full CRUD functionality</p><p>Technologies you will learn - Framework7 UI, IndexedDB</p><p></p>", 
    "end_date": null, 
    "title": "Projects in PhoneGap - Learn by Building 10 Projects", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523870_5a24_2.jpg", 
    "course_url": "https://www.udemy.com/learn-phonegap-development-by-building-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-09T04:22:55Z"
}