{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Hi,  </p>  <p>  \t  My name is Yohann, I will be your instructor.  </p>  <p>  \t  I want to thank you for your interest in this course.  </p>  <p>  \t  This course comes with the Super Zombie Juggle source code. Now I’m sure you’ve heard about the Flappy Bird game, haven’t you?.  </p>  <p>  \t  The source code we give you is a clone of the flappy bird’s owner second best selling game called Super Ball Juggling.  </p>  <p>  \t  Many of my students have been riding the Flappy Bird trends and made tons of money with it, and I’ve got to admit I did too!  </p>  <p>  \t  If you’ve ever tried to make a mobile app, you know how hard it can be especially if you’re missing a step, you could get stuck for hours or even days, and would end up giving up.  </p>  <p>  \t  Now you’ve come to the right place. In this course I show you every single step you need to get the game published in the app store,  </p>  <p>  \t  This game will bring you passive income because we’ve integrated advertising banners and in-app purchases right out of the box.  </p>  <p>  \t  Now the game Super Ball Juggling is gaining popularity and you don’t want to be late to the party,  </p>  <p>  \t  So don’t wait for another opportunity and come ride the wave with us  </p>  <p>  \t  See you in the classroom.  </p>", 
    "end_date": null, 
    "title": "Publish a Simple & Addictive iPhone Game that Monetizes", 
    "price": "20.00", 
    "instructors": "Yonatan Zvik, Yohann Taieb", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176694_1c5a_3.jpg", 
    "course_url": "https://www.udemy.com/publish-a-simple-addictive-iphone-game-that-monetizes/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T15:38:00Z"
}