{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  Thank you for your interest in this course, my name is Yohann, I will be your instructor.  </p>  <p style=\"\">  \t  With this course, you get the full source code of a game clone called 4 Pics 1 Word.  </p>  <p style=\"\">  \t  This is an iPhone app where the player is shown 4 images and he or she needs to guess what is the hidden word in these pictures. It’s simple enough that anyone can pick it up quickly, and it’s also very addictive.  </p>  <p style=\"\">  \t  This type of game has made it to the top chart and what’s great about it is that it’s not just a trendy game, it’s an app that keeps getting downloaded over the years and people keep playing it. Since this source code comes with advertising banners and in-app purchases, the game is prone to bring you passive income for the years to come.  </p>  <p style=\"\">  \t  This game source code costs $200 on its own, and you’re getting it for free with this course, with an unlimited license, meaning you can keep using this code and make dozens of games out of it. You can make games about guessing the artists, celebrities, logos, icons, TV shows, countries, presidents and so much more, You imagination has no limits.  </p>  <p style=\"\">  \t  In this course, I show you every single steps you need to start, and I’m assuming you know nothing or very little,and I’m gonna help you succeed having your very own game, published in the itunes app store, without having to write not even one single line of code!  </p>  <p style=\"\">  \t  This is one of the easiest app you’ll ever get to put your hands on. There is barely any graphics to change, just a few colors and the words to guess.  </p>  <p style=\"\">  \t  This is a perfect way to start your mobile app business or increase your app portfolio quickly.  </p>  <p style=\"\">  \t  This is a great course with a source code that’s proven to work, make the right decision and join us now. I’ll see you in the classroom.  </p>", 
    "end_date": null, 
    "title": "Publish your own \"4 Pics 1 Word\" iPhone Game Clone, 0 coding", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/205502_2979_2.jpg", 
    "course_url": "https://www.udemy.com/publish-your-own-4-pics-1-word-iphone-game-clone-0-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-26T13:07:30Z"
}