{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>UPDATE: The course is updated to the latest Firebase!</p><p>This course will teach you how to building <strong>step-by-step</strong> a WhatsApp clone using Swift 2.0, Firebase and Backendless backend service.</p>\n\n<p>We will be using Firebase as backend for our chat and Backendless for user login management, Push Service and File Storage.</p>\n\n<p>The cool thing about Firebase is that its a real time backend, what does this mean? We dont have to constantly query for new messages, Firebase will push each new message to us automatically with no additional code required. This is very efficient on code writing and on network usage. <br></p>\n\n<p>The application will work online and offline, Firebase will keep local datastore and will sync with online datastore ones the device gets internet connection.</p>\n\n<p>We will use Facebook Login as well as user registration on Backendless.</p>\n\n<p>The course will teach you how to integrate 3rd party libraries to your project, how to combine the Objective-C and Swift libraries. </p>\n\n<p>I will teach you how to send and receive Push notifications to keep your users notified when they receive messages. </p>\n\n<p>The application is build in a way that its very easy to modify to integrate to other applications as well, also you can continue building the app to a stage that you can post it to appstore as ready fully functional chat application. </p>", 
    "end_date": null, 
    "title": "QuickChat (WhatsApp like chat) iOS9.1 and Swift 2", 
    "price": "30.00", 
    "instructors": "David Kababyan", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780848_7954_5.jpg", 
    "course_url": "https://www.udemy.com/quickchat-whatsapp-like-chat-ios91-and-swift-2/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-03T07:04:16Z"
}