{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Learn how to build an app that's featured on Ionic's Showcase!</strong></p><p><em><strong><em><strong>Rapid Prototyping with Ionic: </strong></em></strong></em><em><strong><em><strong>Build a Data-Driven Mobile App —</strong></em><span></span></strong></em></p><p>This course contains step-by-step lectures and implementations of HTML5, CSS3, and JavaScript web technologies on AngularJS and the Ionic framework to create a complete stock market mobile application. </p><p><strong>Content and Overview:</strong></p><p>Take advantage of the advancement of web technologies and build a mobile application that's rich with functionality yet simple to understand. </p><p>You will be provided with how-to videos and text material, guiding you through the process of creating a hybrid native mobile application for iOS (easily adjusted for Android too!) with coding techniques that anyone with any experience making websites can master.</p><p><strong>What you'll get from this course:</strong></p><p>•  Valuable lectures and hours of coding tutorials</p><p>•  A full mobile application with source code to use at your discretion </p><p>•  Cutting edge and highly marketable programming skills</p><p>•  Increased confidence in your ability to make applications on your own </p><p>•  Gateway into the billion dollar mobile apps industry </p><p><strong>The value of this course:</strong></p><p>Mobile app development skills link you to a billion dollar market. This course leaves you ready to create high quality applications whether you are a programming veteran or just getting into web development. </p><p><strong>Course structure and teaching style:</strong></p><p>You will be taken through every step of setting up your development tools, being introduced to the coding languages to be used, and taken through the development phases of a functional mobile application, as I explain every aspect in a conversational and contextual manner without skipping a single line of code, resulting in a complete, full featured stock market app. </p><p>Like all Udemy courses, the course itself is broken up into sections and lectures. The sections represent broad, headline subjects. Under each section, you'll find multiple lectures: this is the meat of the course. You'll see that lectures can come in various formats — screen recordings, presentations and talking head style videos, and text.</p>", 
    "end_date": null, 
    "title": "Rapid Prototyping with Ionic: Build a Data-Driven Mobile App", 
    "price": "20.00", 
    "instructors": "Hunter Leaman", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534066_cbf9_2.jpg", 
    "course_url": "https://www.udemy.com/learn-ionic-framework-build-a-stock-market-mobile-app/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-22T11:40:12Z"
}