{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tThank you for your interest in this course, my name is Yohann, I will be your instructor.  </p>  <p>  \tIf you’ve ever tried to make a mobile app, you know how hard it can be especially if you’re missing a step, you could get stuck for hours or even days, and you will end up giving up.  </p>  <p>  \tNow you’ve come to the right place. With This course we give you the <strong style=\"\">full source code of the Jumpy Skating iPhone game clone, a game that made it 2nd in the apple app store worldwide! </strong>  </p>  <p>  \tThis source code license already cost $200 on its own and you’re getting it with this course!  </p>  <p>  \tI show you every single step you need to start, and I’m assuming you know nothing or very little,and I’m gonna help you succeed having your very own game, published in the app store, without having to write not even one single line of code!  </p>  <p>  \tI’ll <strong style=\"\">show you everything</strong>, and I really mean EVERYTHING, from getting a developer license to creating graphics with Adobe Photoshop and Illustrator, finding free graphics,the process to submit your game to the app store, and a lot more!  </p>  <p>  \tNow, These skills are <strong style=\"\">priceless</strong>, and I can assure you that in the future, you will thank yourself for having taken this course.  </p>  <p>  \tOh and by the way, I forgot to mention that the game that you will publish will bring you <strong style=\"\">passive income</strong> because we’ve integrated advertising banners and in-app purchases right out of the box.  </p>  <p>  \tThis is a great course, with an addictive game source code, make the right decision and join us now. I’ll talk to you in the classroom.  </p>", 
    "end_date": null, 
    "title": "Reskinning the Side scroller Jumpy Skating Game iOS Game, EZ", 
    "price": "20.00", 
    "instructors": "Yohann Taieb, Gareth Ffoulkes", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/180996_493b_2.jpg", 
    "course_url": "https://www.udemy.com/reskinning-the-side-scroller-jumpy-skating-game-ios-game-ez/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-12T13:50:37Z"
}