{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Aprende a construir aplicaciones TVOS en Xcode con Swift.<br></strong></p>\n\n<p><em>Una de las mejores características es que se puede ver los cursos en cualquier velocidad que desee. Esto significa que puede acelerar o ralentizar el vídeo si quieres.</em></p>\n\n\n\n<p>Este curso está basado en un proyecto donde vamos a aprender un montón de prácticas de codificación útiles, enfocadas a la produccción de un videojuego para Apple TV y TVOS. Al final de este curso tendremos una aplicación del mundo real que podremos utilizar en nuestro propio portfolio. Creemos que el aprendizaje basado en proyecto es la mejor manera de ir de A a B. Tomando este curso significa que se aprenderán las habilidades prácticas, que se pueden emplear inmediatamente.</p>\n\n\n\n<p>Se pueden utilizar los proyectos a construir en este curso para añadir a su perfil de LinkedIn. Dar a su portfolio un aire y habilidades adicionales para llevar su carrera al siguiente nivel.</p>\n\n\n\n<p>Aprender viendo el código es una gran manera de saltar en una nueva carrera o mejorar su carrera actual. La programación es la nueva matemática y aprender cómo programar le impulsan hacia adelante para cualquier situación. Aprenderlo hoy y conseguir una ventaja para mañana. Las personas que dominen la tecnología gobernarán el futuro.</p>\n\n\n\n<p>Obtendrá acceso de por vida completo a este curso para una sola tarifa única. Juan Gabriel Gomila ha creado muchos juegos, aplicaciones y cursos de formación por lo que es extremadamente cualificado para enseñarle a dominar la tecnología. Este es un instructor que no sólo enseña, sino que también produce aplicaciones. Esto significa que obtiene la información más relevante sobre la forma de escribir código en Swift y SpriteKit. La mayoría de los cursos no le muestran las habilidades prácticas y ejemplos del mundo real, Juan Gabriel sí lo hace.</p>\n\n\n\n<p><strong>Cómo va a hacer dinero mediante el aprendizaje de nuevas habilidades</strong></p>\n\n\n\n<ul><li>Aprendiendo habilidades prácticas</li><li>Más información sobre cómo aprovechar sus nuevas habilidades para una mayor riqueza y llevarlas a su terreno</li><li>Aprender a través de ejemplos prácticos</li></ul>\n\n<p><strong>¿Por qué debe aprender en un curso online?</strong></p>\n\n<p>Hay una revolución en la educación en línea que tienen lugar. Es posible que haya oído hablar de él en las noticias o escuchado de un amigo. De cualquier vía, la educación va a ser cambiado para siempre. En este breve curso Hablo de cómo tiene la educación en línea</p>\n\n\n\n<p style=\"\"><strong>¿Qué me motiva a hacer cursos online?</strong><br></p>\n\n<ul><li>Ayudado a mi carrera</li><li>me ha ayudado como profesor</li><li>Impactadas varias vidas en todo el planeta</li><li>Prometo que este curso será mejor y más eficaz que la lectura de libros. Miles de estudiantes en Udemy ya opinan lo mismo</li><li>Muestro cómo dominar la tecnología a través del uso de video. Este curso en particular, nos enseñará a domina Swift, SpriteKit y aplicarlo al desarrollo de videojuegos para TVOS y AppleTV</li></ul>", 
    "end_date": null, 
    "title": "Space Invaders para AppleTV: Crea un videojuego en una hora ", 
    "price": "40.00", 
    "instructors": "D. Juan Gabriel Gomila Salas", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/804442_a03e_2.jpg", 
    "course_url": "https://www.udemy.com/space-invaders-para-appletv-crea-un-videojuego-en-una-hora/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-26T13:17:23Z"
}