{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tA course for developers who want to create their iOS applications using good practices, while avoiding some traditional code smells.  </p>  <p>  \tFor first time iOS developers, this course will guide you through several parts of the the language and the API, how and why to use them properly. Avoid common iOS and developers mistakes while building a real world application. The number of applications is not the goal here: a good, well written app is what we are looking for.  </p>  <p>  \tIn this course you will learn the basics that will allow you to understand what you are building: how and why. You don't really know something until you learn why.  </p>  <p>  \tIf you already develop for iOS, but are tired of developing applications that are costly to mantain, tired of writing code noone else understands, or even the simplest change requires too much energy, this course will fit your needs: learn how to avoid those mistakes using features both from the language and the API.  </p>  <p>  \tYou will learn Swift, the iOS API, good practices, design patterns and code smells. You will not just learn how to use, but understand what and why you are using it. As a newcomer, learn how to use the long press gesture, show modal alert controllers, use encapsulation, when and how to use optional chaining, if let, the DRY and SRP principles, default parameters, the extract class and method refactorings, use closures, understand the serialization process, the NSCoding type, and the DAO pattern.  </p>  <p>  \tUnderstanding what is going on is the difference between a language and API user and a professional programmer. This is our goal, let's understand Swift and iOS development.  </p>", 
    "end_date": null, 
    "title": "Swift and iOS from scratch: coding like a pro 3", 
    "price": "30.00", 
    "instructors": "Guilherme Silveira", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366666_f7fb_2.jpg", 
    "course_url": "https://www.udemy.com/swift-and-ios-from-scratch-coding-like-a-pro-3/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T14:58:36Z"
}