{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>** ** 77 lectures - 20 hours of content - the most comprehensive course about Swift programming ever! ** **</strong></p>\n\n<p>We focus on practice. You will build over <strong>20 apps for iOS 9</strong> - from a simple photo gallery to calculator to the best-seller Flappy Bird. Step-by-step instructions shed light on the nuts and bolts of all features and functions and explain each code line in detail. </p>\n\n\n\n<p>You will also explore the Xcode 7 environment that facilitates app design and development.</p>\n\n\n\n<p><strong>3 bestselling games and apps:</strong></p>\n\n\n\n<p><strong><em>1. FLAPPY BIRD</em></strong></p>\n\n\n\n<p>Build an alternative to the hit mobile game Flappy Bird and get inspired to create the next world sensation.</p>\n\n\n\n<p><strong><em>2. TODO LIST</em></strong></p>\n\n\n\n<p>A step-by-step guide to creating a todo list app. Time and task management apps are chart-toppers at the App Store.</p>\n\n\n\n<p><strong><em>3. TINDER</em></strong></p>\n\n\n\n<p>An amazingly popular app that broke a million hearts. Learn how to create a similar application and see how easy it is.</p>\n\n\n\n<p><strong>Several smaller apps:</strong></p>\n\n\n\n<p><strong><em>• Hello world!</em></strong></p>\n\n\n\n<p>Hello world! is the first app you'll build minutes into the course. See how easy it is to learn Swift 2.</p>\n\n\n\n<p><strong><em>• Lotto machine</em></strong></p>\n\n\n\n<p>Create a lottery app and discover how to use functions and randomize and sort data.</p>\n\n\n\n<p><strong><em>• Tic-tac-toe</em></strong></p>\n\n\n\n<p>We all played it on a piece of paper once.. This app will introduce you to user interfaces and touch detection.</p>\n\n\n\n<p><strong><em>• Calculator</em></strong></p>\n\n\n\n<p>Design a great UI and learn simple data operations.</p>\n\n\n\n<p><strong><em>• Photo gallery</em></strong></p>\n\n\n\n<p>Discover how to add resources like photos or videos to a project and create your own photo gallery.</p>\n\n\n\n<p><strong><em>• Birdy Scream</em></strong></p>\n\n\n\n<p>This app will show you how to add sounds to games. You'll also learn how to control app volume level so your neighbors can get some sleep while you work.</p>\n\n\n\n<p><strong><em>• Stones on stage</em></strong></p>\n\n\n\n<p>Your first steps in game building. Code your first 2D game scene with the SpriteKit framework.</p>\n\n\n\n<li><strong><em> Color balls</em></strong></li><p><strong><strong><strong><em></em></strong></strong></strong></p>\n\n\n\n<p>With color balls flooding your screen, you'll explore how to create multiple types of views and add constraints.</p>\n\n\n\n<li><strong><em> Book list</em></strong></li><strong><em></em></strong><br><strong><em></em></strong><p>Tables are so hot right now. Shopping list, task list, book list? Tabular data will always be in vogue - learn how to handle it.<br></p>\n\n\n\n<li><strong><em> Notepad</em></strong></li><strong><em></em></strong><br> <p>Storing data in a smartphone app and cloud is a must. Learn how to write and read data while creating an all-purpose notepad app.</p>\n\n\n\n<p><strong><em>• About Us</em></strong></p>\n\n\n\n<p>During developing this app, you'll learn how to use Storyboards, make transitions, how to add buttons and present informartions.</p>\n\n\n\n<li> <strong><em>Where am I?</em></strong></li><strong><em></em></strong><br><strong><em></em></strong><p>Are you lost? Write an app that'll help you find where exactly you are by tracking your device and showing your location on a map.<br></p>\n\n\n\n<li> <strong><em>Where is my car?</em></strong></li><strong><em></em></strong><br> <p>This app allows you to track your position relative to the position of your car. Never again lose your car in a multi-storey parking lot.</p>\n\n\n\n<li><strong><em> Network gallery</em></strong></li><strong><em></em></strong><br> <p>Write a web photo gallery. Learn how to get data from networks and present it on mobiles.</p>\n\n\n\n<p><strong>Learn how to create fast and secure applications.</strong></p>\n\n\n\n<p>Swift is a programming language used for mobile applications for iOS. It was presented for the first time at the WWDC conference in June 2014. Since then it has become increasingly popular among programmers and app developers.</p>\n\n\n\n<p>The new language created by Apple is much simpler than Objective-C. It's recommended in particular <strong>for beginner programmers</strong> because of the simplified code structure, the possibility of applying corrections on bar graphs or testing the project operation in real time.</p>\n\n\n\n<p><strong>We can guarantee this course will give you all the skills to code progressively complex games and apps on your own!</strong></p>", 
    "end_date": null, 
    "title": "Swift programming - Build 20 apps for iPhone!", 
    "price": "20.00", 
    "instructors": "Educativo Trainings, IT Security Academy", 
    "commitment": "19.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599192_de5e_3.jpg", 
    "course_url": "https://www.udemy.com/swift-2-programming-learn-how-to-create-20-apps-for-ios/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T10:31:06Z"
}