{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t  From a former Apple employee and the incredibly successful Kickstarter project (475% funded) comes the <strong style=\"\">Swift and iOS8 Apps in 31 Days: build 16 iPhone apps </strong>course.  </p>  <p style=\"\">  \t  Do you want to boost your income as an app developer?  </p>  <p style=\"\">  \t  Or do you want to change careers to increase your salary, flexibility, and freedom?  </p>  <p style=\"\">  \t  The <strong style=\"\">Swift and iOS8 Apps in 31 Days course </strong>is the most comprehensive, cost effective, and career changing iPhone app development course that you’ll find online – or your money back.  </p>  <p>  \t<strong style=\"\">BONUS CONTENT - </strong>Learn from the creators of <strong style=\"\">Square</strong>, <strong style=\"\">Zombie Highway</strong>, and <strong style=\"\">Fantastical</strong>. You’ll get insight into how successful app developers have been able to <strong style=\"\">get millions of downloads and tons of money</strong>. Listen to the exclusive interview and Q&amp;A that you can’t get anywhere else! The insight is worth $1000’s!  </p>  <p style=\"\">  \t  It is the complete course that you can use to start making professional iOS apps that will delight users, solve problems, and will make you money!  </p>  <p style=\"\">  \t  If you are looking for a course that will turn your ideas into apps that will start earning you cash, I personally guarantee this is the best course for you.  </p>  <p style=\"\">  \t<strong style=\"\">From Beginner to iOS App Developer in 31 Days</strong>  </p>  <ul style=\"\">  \t<li>Xcode and Interface Builder</li>  \t<li>Buttons, user input, and adaptive UI</li>  \t<li>Swift: Apple’s new programming language (the future of iOS)</li>  \t<li>Variables, tables, touch gestures, and Auto Layout</li>  \t<li>Navigation, storage, and web content</li>  \t<li>Images, animations, and App Store polish</li>  \t<li>Facebook SDK and JSON</li>  \t<li>Web services + top 100 App Store app tracker</li>  \t<li>App Store submission</li>  \t<li>Open source code and SDK integration</li>  \t<li>Interview with successful app developers (millions of downloads + $$$ = Day 12)</li>  </ul>  <p style=\"\">  \t  Throughout 150 lectures and over 18 hours of content, you will start with the basics and build apps from the very beginning. You’ll learn tips and tricks to work effortlessly with Xcode and Swift.  </p>  <p style=\"\">  \t  Throughout the course you will build upon knowledge into bigger apps using web, animations, and touch input. Together these technologies will allow you to create apps like many on the top 100 lists of the App Store.  </p>  <p style=\"\">  \t  I promise that this course will not waste your time or hard earned money. You don’t need to buy books, expensive online courses, or bootcamps. Skip old YouTube videos that lack a structured curriculum.  </p>  <p style=\"\">  \t  With the <strong style=\"\">Swift and iOS8 Apps in 31 Days course</strong> you will get everything you need, all with one convenient, easy to navigate online course. Plus, you will get fast, friendly, and responsive support by email, Twitter, and on the Udemy discussions.  </p>", 
    "end_date": null, 
    "title": "Swift and iOS8 Apps in 31 Days: Build 16 iPhone apps", 
    "price": "30.00", 
    "instructors": "Paul Solt", 
    "commitment": "35 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336050_d14a_17.jpg", 
    "course_url": "https://www.udemy.com/make-iphone-apps-with-swift-and-ios-8/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-04T22:41:54Z"
}