{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">Are you ready to build elegant iOS apps? A prerequisite to that is learning Swift, Apple&#039;s maturing Programming Language for iOS Development. This is the course for you if you&#039;re curious about iOS, or if you even know it already. Let&#039;s dive into the specifics about this course.</p><p style=\"\">What Do I Need to Take This Course?</p><ul style=\"\"><li style=\"\">Mac OS X 10.10 or Later</li><li style=\"\">Strong Interest and/or Passion for Technology and iOS Development</li></ul>How Experienced Do I Have to Be For This Course?<ul style=\"\"><li style=\"\">My Target Audience For this Course is a Beginner to Intermediate Programmer</li><li style=\"\">If You&#039;ve Never Coded in Your Life, You Will Finish This Course Without a Problem.</li></ul><p style=\"\">Why this course?</p><ul style=\"\"><li style=\"\">I&#039;ve Spent Over 250 Hours Perfecting This Course For My Students</li><li style=\"\">I Relate to Beginner Programmers To Explain Things In a Way They Can Understand </li><li style=\"\">I Spent A While of Time Reading Not Only The Swift Docs, but Other Books On Swift</li><li style=\"\">I Put Nearly 20 Challenges With Solutions For The Sections</li><li style=\"\">I&#039;m Active! Any Question You Have, I Will Answer Them Quickly</li><li style=\"\">After Completing This Course, You Will Be Ready to Learn Cocoa Touch</li></ul><p style=\"\">How Much Commitment Do I Have to Have To Complete This Course?</p><ul style=\"\"><li style=\"\">Spending 30 Minutes A Day: Complete it in 24 Days</li><li style=\"\">As Long as You Have A Passion For Learning Swift, You&#039;ll Be Fine </li></ul><p style=\"\">How is This Course Structured?</p><ul style=\"\"><li style=\"\">This Course Covers Swift Front and Back</li><li style=\"\">We Start Out By Installing Xcode, and Move Our Way Up To Generic Types</li><li style=\"\">There Are Challenges After The Sections To Practice What You&#039;ve Learned</li></ul><p style=\"\">Whether You&#039;re New To Programming Or You&#039;re Experienced In It, This Course is For You Because You&#039;re Going To Be a Master Of Swift By The End Of The Lectures.</p><ul style=\"\"><li style=\"\"><span style=\"\"></span></li></ul>", 
    "end_date": null, 
    "title": "Swift 2 Programming eBook Complete Guide", 
    "price": "20.00", 
    "instructors": "Justin Rose", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534546_5c1d_4.jpg", 
    "course_url": "https://www.udemy.com/swift-programming-from-learner-to-earner/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-22T22:58:23Z"
}