{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong><em>Updated August, 2015</em></strong></p><ul><li><strong>Be entered to win a free Apple Watch! *</strong></li><li><strong>Make exciting applications for Apple Watch using WatchKit!</strong></li><li><strong>Learn a new easy-to-use programming language called Swift!</strong></li><li><strong>Migrate over to Swift from Objective-C with ease!</strong></li></ul>    <p>In this course, you will gain a deep understanding of Swift and WatchKit so you can develop your own Apple Watch apps! Whether you're developing an app from scratch, or you want to extend an already-existing application you've written for iPads and iPhones to support the Apple Watch, you've come to the right place! You will learn to do ALL of those things!  </p>  <p>  \t<em>This course is both for new developers, and Objective-C developers who want to learn Swift!</em>  </p>  <p>  \t<strong>What is this course about?</strong>  </p>  <p>  \t        It's about building a solid understanding of Apple's Swift programming language, and then taking that knowledge to build your own Apple Watch applications! This course will be evolving over time, with added content being added often!  </p>  <p>  \t        More importantly, I want to urge you to <strong>START NOW</strong>! Apple Watch is going to be the next big thing. I say this with a heightened sense of urgency! So many manufacturers (I'm picking on Android Wear users here!) have tried to develop smart watches that would really take off and make a splash, but it just hasn't happened. Based on Apple's history of hardware launches, as well as the design of Apple's Watch, you can bet that people with Apple Watches will be the centerpiece of conversation for a while. The sheer number of style combinations that will be at the release will appeal to a very broad range of people!  </p>  <p>  \t<strong>Why take this course, and why take it from me?</strong>  </p>  <ul>  \t<li>Learn Swift and XCode from a full time professional iOS developer!</li>  \t<li>Really burn in the knowledge with lots of course quizzes!</li>  \t<li>We'll sketch, design and develop 3 Apple Watch applications from the ground up, with more being added in the future!</li>  \t<li>As more application tutorials are added, the price of the course will go up, so don't delay your purchase!</li>  \t<li>My regularly priced PPCH (Price Per Content Hour) is the lowest on Udemy, without sacrificing quality!</li><li>Who wouldn't want a chance to win a free Apple Watch? :)</li>  </ul>  <p>  \t<strong>How is the course structured?</strong>  </p>  <p>  \t        The 'Getting Started' section will talk about course structure in more detail. However, in short, each section has an introduction that explains what we'll be doing, and a conclusion to go over what we've learned. I use a presentation format to go over details about a topic, then I'll dive into XCode screencasts to show how to use what we've learned. Quizzes will appear at the end of each section. This applies for the entire course from start to end. Please preview some videos below so you know exactly what you're getting!  </p>  <p>  \t<strong>Thank you!</strong>  </p>  <p>  \t        Lastly, I'd like to say thank you for taking a look at my course that I've created for you. I love talking to my students, so please know that I will always be available for support if any help is needed along the way!  </p><p>-</p><p>*For every 500th paying student, I'll randomly select a student to receive a free Apple Watch Sport! Get in early to potentially have more chances to win. (Ex: If you're the 50th student, and I reach 1500 paid students, you'd have 3 chances to win!). Note that 30 days must elapse after joining this course before any prize is awarded. This promotion is valid for USA residents in the 48 contiguous states only. One entry per person. No purchase necessary to win.</p>", 
    "end_date": null, 
    "title": "Swift by Example; Make Apple Watch Apps with Apple Watchkit", 
    "price": "20.00", 
    "instructors": "Nathan Cope", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135672_e8a2_2.jpg", 
    "course_url": "https://www.udemy.com/swift-by-example-make-apple-watch-apps-with-apple-watchkit/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-19T14:37:17Z"
}