{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tİndirim talep eden arkadaşlar benimle iletişime geçebilirler : saidbicer@gmail.com  </p>  <p style=\"\">  \t      Swift ile artık hızlı ve kolay bir şekilde iOS programlarınızı hazırlayabilirsiniz. Bu dil ObjC&#039;ye ve bir çok dile göre hem daha hızlı, daha güvenli, daha kolay ve etkileşimlidir, yani kodunuzu derlemeden sonucunu hemen görebilirsiniz. Yeni bir dil öğrenip daha güzel ve hızlı uygulama yapmanın zamanı gelmedi mi? Bir çok şahıs ve kurum swift dili ile yeni uygulamalar geliştirdi ve önceden ObjC ile hazırladıkları uygulamaları swifte çevirdi. Swifti öğrenmek gerçekten çok kolay, yapmanız gereken şey sadece niyet edip başlamak. Zafer ilk adımla başlar diye güzel bir fikir var, bu hakikaten doğrudur, iOS cihazlara uygulama hazırlamak hakikaten büyük ve güzel bir zaferdir, bu zaferi elde etmek için azimle ve sadakatle çalışmak gerektir, inşallah sizde bu hedefe ulaşabilirsiniz. Objective C mazisi uzun olmasına rağmen artık ihtiyaçlara cevap veremeyecek hale gelmiştir, zira hem yazılışı ve öğrenmesi zor hemde gelecek teknolojilere alt yapı olarak destek ve kuvvet verecek bir potansiyelde değildir. Bu eksiği yazılımcılar çoktan farkettiği gibi Apple firmasının çalışanlarıda farketmiş yeni ve dinamik bir dil oluşturma niyetiyle 2010 yıllarında bu dili hazırlmaya başlamış ve nihayet günümüz ve istikbaldeki teknolojilere zemin oluşturabilecek kolay anlaşılır, hızlı, güvenilir ve interaktif bir dil oluşturmayı başarmışlardır. Apple firması katı kuralları olmasına rağmen kaliteli çalışmalarıyla meşhur olmuş ve mobil cihazlar cihetinden piyasada %50 oranında pay almayı başarmıştır. Belkide istikbalde en fazla kullanılan cihazlar artık Apple&#039;nin cihazları olacaktır. Swift&#039;i öğrenmek demek piyasanın yarısından fazlasına hitab edebilmek demektir, geleceğe açılan bu hazineden sizde istifade etmek istiyorsanız bir an önce bu eğitimin heyecanlı basamaklarını tırmanmaya başlamalısınız  </p>  <p style=\"\">  \t  -Kursumuz özetle Swift dilinin temellerini ve orta seviyenin bir kısmını ele almaktadır  </p>  <p style=\"\">  \t  -Eğer hedefiniz iOS cihazlarına uygulama yazmak veya ObjectiveC ile yazılmış uygulamaları Swift diline çevirmek ise bu kurstan istifade edebilirsiniz  </p>  <p style=\"\">  \t  -Kursumuzu birden izleyerek bitirmeyiniz, yavaş yavaş ve programlı bir şekilde ilerleyiniz  </p>  <p style=\"\">  \t  -Kurs içerisindeki tüm çalışmaları kendinizde uygulayarak tecrübeler edinmeye çalışınız.  </p>  <p style=\"\">  \t  -Kursun dili Türkçedir, ülkemizde henüz kaynak az olmasına rağmen Swifte olan ilgi gittikçe büyümektedir, bu dili bilenler arasında geri kalmayın, hemen öğrenmeye başlayın  </p>", 
    "end_date": null, 
    "title": "Swift ile Türkçe iPad iPhone Programlama Görsel Eğitim Seti", 
    "price": "20.00", 
    "instructors": "Said Biçer", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367182_2f0d_8.jpg", 
    "course_url": "https://www.udemy.com/swift-ile-turkce-ipad-iphone-programlama-gorsel-egitim-seti/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T08:49:52Z"
}