{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>*** Attention ***</strong><br></p>\n\n<p>This course is based on <strong>PARSE</strong>, Parse will be fully retired on January 28th, 2017, however <strong>Parse platform is open source</strong> what means you can <strong>create your own servers</strong> on a click of a few buttons. <strong>Furthermore, this course</strong> is not about Parse, it <strong>is about how to make everyone a better SWIFT developer.</strong></p>\n\n\n\n\n\n<p><strong>Learn more elegant ways to code </strong>and if you not satisfy with the course, <strong>you can request your money back in 30 days</strong></p>\n\n\n\n\n\n<p><strong>*** Course Last Update 27/01/2016 ***</strong></p>\n\n\n\n\n\n<p><strong>Course Description</strong></p>\n\n\n\n\n\n<p>Can you remember when you were first learning math and teachers showed you how to count with your fingers to solve the problems? For the first year or so this is fine, however the problems become too complex and it becomes cumbersome and impractical to count and solve problems with your fingers. <strong>For me iOS and Swift development started out similar to this, except I couldn't find a decent teaching tool to help me make that next step</strong>. After a lot of trouble and research <strong>I eventually got there in the end.</strong><br></p>\n\n\n\n\n\n<p>This is where you get lucky! I have created the class I wish I had when I was trying to take the next step in iOS development with Swift and <strong>I can guarantee you that there is nothing like this course out there</strong>, <strong>trust me, I've been there.</strong></p>\n\n\n\n\n\n<p>During this course <strong>I will challenge</strong> you to complete many tasks that will <strong>help improve your coding</strong> and <strong>app development skill</strong>. My first challenge, challenge number 0 is free. Before you start, turn your phone onto airplane mode and see how many apps are still useful to you. Other than the basic phone functionalities such as alarm, calculator, calendar, etc., most apps require a connection; even games require some sort of connection. We live in a connected world today. People want to share everything, including where they go, what they do, and even what they eat. This is what I'm going to teach you.</p>\n\n\n\n\n\n<p><strong>I do not believe in one-size fits all. In my view, courses that claim to cater to beginners right through to advanced levels, either fail to stimulate the experienced students, or they overwhelm the newcomers with too much information and complexity.</strong></p>\n\n\n\n\n\n<p>However, you don't need to be an expert. If you know what variables, classes, and loops are, <strong>you're ready for this course</strong>. If you have taken another course in any other language such as object-c or swift <strong>you're definitely ready for this course</strong>. Be sure <strong>I'll always be available to help you along your journey in case you have any problems related to the Swift language.</strong></p>\n\n\n\n\n\n<p><strong>I firmly believe that the best way to learn is by doing, so these are the steps we are going to take together:</strong></p>\n\n\n\n\n\n<ul>\n<li>Install cocoa pods</li>\n<li>Create a (free) account in Parse</li>\n<li>Find/install and use pods</li>\n<li>Save/read data in Parse</li>\n<li>Create many different login screens with different levels of customization</li>\n<li>Create/log users</li>\n</ul>\n\n\n\n\n\n<p><strong>We will also learn:</strong></p>\n\n\n\n\n\n<ul>\n<li>Proper and elegant error handling in Swift</li>\n<li>Proper and elegant code refactoring in Swift</li>\n<li>Proper and elegant use of enum in Swift</li>\n<li>Proper and elegant use of inheritance in Swift</li>\n</ul>\n\n\n\n\n\n<p><strong></strong><br></p>\n\n\n\n\n\n<p><strong>The qualifications I have that I believe will help me teach you?</strong></p>\n\n\n\n\n\n<ul>\n<li>I have received my first certification in programming in <strong>1987 when I was only 10 years old</strong> in an apple II</li>\n<li>I have been a professional developer for <strong>over 20 years</strong></li>\n<li>I am an <strong>active member on StackOverflow, </strong>and I am always helping members on the site. Helping people is the passion that brought me to create this course.</li>\n<li>I currently rank as<strong> top 10% for Swift Help in StackOverflow</strong></li>\n<li>I currently rank as <strong>top 20 % for iOS Help in StackOverflow</strong></li>\n<li>I am dedicating a lot of time to this course so you can be sure you will have <strong>plenty of support</strong> in your journey.</li>\n</ul>\n\n\n\n\n\n<p><strong></strong><br></p>\n\n\n\n\n\n<p><strong>Who is this class for?</strong></p>\n\n\n\n\n\n<ul>\n<li>People that have some previous experience in programming, or who have taken any kind of programming course before, or at least know what a variable, a class and a loop are.</li>\n<li>People who want to make real apps using proper methodology</li>\n<li>Entrepreneurs who have an idea for an app and don't want to pay somebody thousands to build it.</li>\n<li>Developers from different languages that want to start to program in the new and exciting program language - Swift</li>\n<li>Career development professionals who want to earn money via contract work, consulting, full-time employment and so forth.</li>\n</ul>\n\n\n\n\n\n<p><strong>What are the requirements?</strong></p>\n\n\n\n\n\n<ul>\n<li>You will need a Mac computer or Virtual Machine that runs the Mavericks, Yosemite or El Capitan operating system</li>\n<li>Xcode 6, Xcode 7 or greater </li>\n<li>An iPhone with iOS 8 or iOS 9 for testing is desirable but not essential</li>\n<li>An open mind and desire to learn new things</li>\n</ul>\n\n\n\n\n\n<p><strong>What are you going to get from this course?</strong></p>\n\n\n\n\n\n<ul>\n<li>You will be able to create our own fully customized login screens</li>\n<li>You will learn how to properly reuse code in different projects</li>\n<li>How to handle errors and refactor code in quick and elegant way </li>\n<li>Over 40 lectures and 5.5 hours of content!</li>\n<li>Install cocoa pods</li>\n<li>Create an application that connect to parse</li>\n<li>Create/login/logout users at parse</li>\n<li>Install parse open source pods into the application</li></ul>\n\n\n\n\n\n<p><strong>Who is the target audience?</strong></p>\n\n\n\n\n\n<ul>\n<li>People with some programming experience,</li>\n<li>Someone who has finished other tutorial/s, and are now stuck, and want to further their progress</li>\n<li>Someone who cares and wants to create an app that will be easy to maintain and keep going over a long period of time because it has been built right.</li>\n</ul>\n\n\n\n\n\n<p><strong>It is time to leave the crutches behind and take the Next Step, see you there!</strong></p>\n\n\n\n\n\n<p><strong></strong><br></p>", 
    "end_date": null, 
    "title": "Swift the Next Step, Be the BEST Swift Developer TODAY", 
    "price": "20.00", 
    "instructors": "Icaro Lavrador", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599064_43f6_6.jpg", 
    "course_url": "https://www.udemy.com/swift-the-next-step/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T06:41:16Z"
}