{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course takes you from 0 knowledge of Swift to a complete understanding of programming in Swift. After this course you will be able to explore Swift on your own and begin to write your own apps. </p><p>In this course we will start by writing the most basic code as we explain each concept. No stone unturned. </p><p>Each idea will be related to some knowledge that you already posses. We assume nothing. </p><p>This course is a full fledged version of our \"Swift for Absolute Beginners\" course on YouTube. Due to the success of those videos and the demand for more, we created this course.</p><p>We will start by opening a text editor and typing our first code in Swift. From there we will take you through the different programming ideas while we make little programs that perform little tasks. </p><p>Through the 55 videos you will learn: </p><ul><li>How to store data</li><li>Where data goes when it's stored</li><li>How to create lists</li><li>How to make your life easier with code</li><li>How to create loops</li><li>What classes are</li><li>What protocols are</li><li>When to use them</li><li>Many many more things</li></ul><p>This course will guide you through all the very important concepts of programming and describe those concepts using metaphors and ideas that you are already familiar with in the real world so that you will have deepest understanding of Swift.</p><p>This course is structured into three sections. </p><p>The first section goes gets you started with the most primitive concepts of programming, like storing variables. </p><p>The second section goes through the basics of programming like arrays, dictionaries, looping and more. </p><p>The third section will go into the core of object oriented programming with classes, inheritance and protocols. </p><p>Through each section you will be taught each idea in it's entirety. We go over each idea multiple times in multiple different ways to make sure the concept sticks and you are left with the knowhow. </p><p>Even though the later sections are technically more \"advanced\" you will see the natural progression towards those more advanced topics. In the end the more advanced stuff won't feel advanced at all. </p><p>This course in it's entirety is 3 hours in 55 videos. Each video packs a punch of information so it's best to take it slow.</p>", 
    "end_date": null, 
    "title": "Swift for Absolute Beginners", 
    "price": "25.00", 
    "instructors": "Skip Wilson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607462_2c4b_3.jpg", 
    "course_url": "https://www.udemy.com/swift-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T00:16:32Z"
}