{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  75 Billion Apps were already sold in the iOS App Store. If you ever wanted a chance to participate in this success, here is your chance.  </p>  <p>  \t<strong style=\"\">Course abstract</strong>  </p>  <p>  \t  In this course you are going to learn all the basics you need to know to create your own simple iOS applications using the new Swift programming language. After learning all about the basics of programming (variables, constants, if-statements, loops ...), you are going to become familiar with object oriented programming (OOP). These are the fundamentals to be able to grasp the awesome UIKit Framework which you are going to use to create awesome Apps. After getting in touch with many iOS User Interface components we are going to start using more advanced user interaction techniques like recognizing gestures on the iPhone screen. The conclusion of this course is a real-life example that will help you connect all the dots and pieces of your newly acquired knowledge.  </p>  <p>  \t<strong style=\"\">Section 1: Welcome</strong>  </p>  <p>  \t  You will start off creating a nice App that allows you to manipulate images, using image filters. Although this is an advanced topic, this example will show you the possibilities of the iOS SDK and the workflow within Xcode. This project is supposed to replace the standard „Hello World“ example.  </p>  <p>  \t<strong style=\"\">Section 2: Xcode - Your favourite environment</strong>  </p>  <p>  \t  You have to know the tools you are using. So, this section is all about Xcode itself.  </p>  <p>  \t<strong style=\"\">Section 3: Swift Basics</strong>  </p>  <p>  \t  Since you don’t need any programming experience to start developing iOS Apps, here are all the programming basics that you are going to need to be become a successful iOS App developer. We are covering topics like variables and constants, datatypes, collection types (Arrays and Dictionaries), control flow using if statements, loops …  </p>  <p>  \t<strong style=\"\">Section 4: Swift beyond the Basics</strong>  </p>  <p>  \t  Since object oriented programming is the fundamental paradigm, on which Swift and the iOS SDK are based, you are going to learn all the basics you need to know in order to successfully use the classes provided by Apple.  </p>  <p>  \t<strong style=\"\">Section 5: Your daily bread – User-Interface Components</strong>  </p>  <p>  \t  In this section we are going to cover UI components like textfields, buttons, labels and you are are also going to learn the basics about Storyboards, ViewControllers and Delegates.  </p>  <p>  \t<strong style=\"\">Section 6: Let’s get dangerous</strong>  </p>  <p>  \t  In this section you are going to learn how to use gesture recognizers for responding to touch events on the iPhone screen. You will also learn the basics of animating objects, as well as the usage of the UIAlertController class to display messages to your users.  </p>  <p>  \t<strong style=\"\">Section 7: Welcome to the real world</strong>  </p>  <p>  \t  In this final section we are going to put all the dots and pieces together and create a great calculator App from scratch. We are going to design the User Interface, write all the necessary Swift code and finally you are going to learn how to add a great Icon to your App.  </p>", 
    "end_date": null, 
    "title": "Swift for Beginners - Create your first iOS App with Swift", 
    "price": "20.00", 
    "instructors": "Daniel Autenrieth", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285956_2348_3.jpg", 
    "course_url": "https://www.udemy.com/start-developing-ios-apps-with-swift-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-22T14:56:07Z"
}