{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>Note: Xcode 7.3 and Swift 2.2 Videos. </em> <br></p><p><strong>Swift Fast Track</strong> is designed for speed. Busy professionals need straight-to-the-core approach to Swift with practical examples and code segments that can be integrated immediately in real-life apps. Swift theoretical frameworks are well covered in plenty of published documentation, primarily Apple's. Swift Fast Track aims to show, with visual and clear examples, how the most important tools of Swift are used in practical ways.</p>\n\n<p>Upon completion of the course, you will have covered all the <strong>fundamental 'building blocks' </strong><strong>of Swift</strong>. You can then venture into actually building complete real-life apps, integrating the tools code segments seamlessly in your own apps. <br></p>\n\n<p> Swift Fast Track is recorded in <strong>Full HD 1080p</strong>, with video special effects and annotations,for crystal clear and crisp movies and slides, and a <strong>Blue Yeti microphone</strong> with unsurpassed sound quality and clarity. All major code segments are presented twice: once during recording within Xcode (Swift's development environment) and at the end of each lecture using <strong>PPT slides</strong> with large fonts, colors and explanations. </p>\n\n<p><em class=\"redactor-inline-converted\">Brand New Lecture on <strong>CocoaPods</strong> (Firebase Example). Step by Step in Visual Detail.</em><br></p>\n\n<p> Wish to build a complete App Store ready app? Proceed to the comprehensive (7 hours of videos, 64+ lectures) '<strong>Swift Core Data, Maps &amp; Media</strong>' Course.<br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Swift Fast Track Intro for Busy Developers", 
    "price": 0, 
    "instructors": "Mazen Kilani", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748398_3d3c_5.jpg", 
    "course_url": "https://www.udemy.com/swift-fast-track/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T02:20:18Z"
}