{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Almost every mobile application requires User Sign up, Login, Logout and Password reset functionality. Also, very often mobile apps use left side menu as navigation which is some times called Navigation Drawer.</p><p>In this course we will create a fully functional examples that you can take and integrate into your Swift mobile app.</p><p>We will use Xcode development environment and Swift programming language to create:</p><ul><li>User interface for User Sign Up view,</li><li>User interface for User Sign in view,</li><li>User interface for Sign Out functionality</li><li>User interface for Password Reset functionality</li><li>Email Verification feature</li><li>Left side navigation menu or navigation drawer with 3 different views. Left side panel for navigation menu, centre view and right side panel for additional information if needed. This Navigation drawer will serve as a main container of your mobile app which needs to be protected with user login view.</li></ul><ul><li>Using phpMyAdmin we will create a new MySQL database</li><li>We will learn to create new MySQL database tables </li><li>We will learn how to establish MySQL database connection from our PHP script </li><li>We will learn to write \"select\", \"insert\", \"update\" and \"delete\" SQL queries</li><li>We will write business logic to upload user profile picture to our server</li><li>We will write business logic to implement User Sign up, Sign in and Sign out functionality</li><li>We will write business logic to implement Password Reset functionality and Email verification feature</li><li>Send Push Messages using PHP scripts.<br><br><strong>Bonus:</strong></li></ul><ul><li>We will create Application left side sliding menu which is sometimes called Navigation Drawer which will be displayed after user successfully logs into our application.</li><li>Left side menu or Navigation Drawer will have left side panel as well as right side panel which user will be able to \"Tap to open\" or \"Swipe to open\"</li><li>We will integrate into our application a very popular and customizable activity indicator called MBProgressHUD</li></ul><p><br>You will also learn <strong>How To Create Your Own Push Notifications Server. </strong>We will learn how to use easy apns open source project to <strong>send different types of push messages to a specific iOS device</strong> registered with our application and how to <strong>send a new push message to multiple iOS devices at the same time</strong>. </p>", 
    "end_date": null, 
    "title": "Swift, PHP & MySQL. User Sign Up, Sign In, Sign out and more", 
    "price": "35.00", 
    "instructors": "Sergey Kargopolov", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440950_a9a0_3.jpg", 
    "course_url": "https://www.udemy.com/swift-php-mysql-user-sign-up-sign-in-sign-out-and-more/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T03:16:40Z"
}