{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong><em>Are you an aspiring Android Developer?</em></strong></p><p style=\"\"><strong><em>Do you want to step into the world of Mobile application development and earn money?</em></strong></p><p style=\"\"><strong>Then this is your destination.</strong> </p><p style=\"\">You are going to build android apps from scratch by step by step tutorials designed in such a way that a real noob can also start making apps in professional way. You will start off by building basic apps, and progress to more complex apps by inculcating more complex advance features in you application.</p><p style=\"\">The apps you will create, you will be shown how to <strong>publish</strong> those apps in the <strong>Google Playstore</strong> and reach billions of Android users world wide.</p><p style=\"\">Also, learn how to monetise your application and earn thousands of dollars. How to prepare your playstore listing and also, how to make your apps rank higher in playstore search engine.</p><p style=\"\">Get familiar with two mostly used Tools for developing Android apps: </p><ul><li><strong>Android Studio and,</strong></li><li><strong> Eclipse.</strong></li></ul><p style=\"\">Android Studio is the official IDE by Google and is gradually picking up popularity. But at the same time if you belong to java background then you must be an eclipse lover. Yes, you will learn Android App development by Eclipse too.</p><p style=\"\">Both the Tools Android Studio and Eclipse are well shown and explained how to make effective use of it.</p><p style=\"\">Configure your own <strong>Virtual Android device</strong> - emulator which runs on your Mac or Windows which means you do not need your own personal device to run your android apps.</p><p style=\"\">Save your precious time while developing learn how to install 200% faster emulator- <strong>Genymotion</strong> on your Mac or PC.</p><p style=\"\">If you have your own Android device then learn how to configure your IDE to deploy and test Android APK files on your real device.</p><p style=\"\"><strong>Debug your android apps</strong> in your Virtual device and also learn how to debug it in your real android device.</p><p style=\"\">Building these projects will help you understand the basics of Android development, and then in the coming weeks, the more advanced apps being added to the course will show you many of the new techniques and functionality built into the new Marshmallow SDK to really make your apps pop!</p><p style=\"\">An all new app that takes advantage of the stunning new material design from Lollipop which brings all new and stunning visual, motion and interaction to your apps.</p><p style=\"\">You'll will also learn how to take advantage of the all new enhanced notification functionality built into Lollipop as well as heads-up, display content and actions in a small floating window.</p><p style=\"\">Configure your apps with <strong>Graphics and design</strong>, and give support for your application to run on Multiple Screens i.e. <strong>Make apps that are compatible with </strong><strong>Tablets as well as Smartphones. </strong></p><p style=\"\"><strong>Learn Animation - Give polished look to your apps</strong></p><p style=\"\">Explore the android animation and it's implementation in your application. Attract more and more users by showing incredible animation effects in your apps.</p><p style=\"\"><strong>Introducing brand new Marshmallow 6.0 and 5.0 Lollipop features.</strong></p><p style=\"\">Learn about new Marshmallow/Lollipop feature such as <strong>Recycler View</strong> which is the advance version of Listview.</p><p style=\"\">Implement <strong>Grid View, Staggered View horizontal</strong> and also <strong>Staggered view Vertical </strong>with the help of Recycler View.</p><p style=\"\">Implement all new <strong>Lollipop Animation transitions </strong>in your Recycler view.</p><p style=\"\">Want to make your recycler view more attractive? Yes, here we go. Learn <strong>Android CardView</strong> in detail.</p><p style=\"\">Learn about <strong>Android Toolbar</strong> which is the trending feature of Android 5.0 that replaces old Action Bar.</p><p style=\"\"><strong>Text to Speech feature - </strong>Learn how to convert Text to Speech and make your app speak and interact with the app user.</p>", 
    "end_date": null, 
    "title": "The Complete Android Marshmallow Tutorial - Make 30 Apps", 
    "price": "25.00", 
    "instructors": "Sriyank Siddhartha", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438570_356a_3.jpg", 
    "course_url": "https://www.udemy.com/the-complete-android-tutorial-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T13:36:13Z"
}