{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">*** NEW VIDEOS EVERY WEEK ***</p><p style=\"\">  \tDo you know this course is different from others? This is the only <strong style=\"\">interactive</strong> course in Udemy service! You will learn writing applications by using my programs (<strong style=\"\">20 Real World Apps</strong>), and furthermore, I`m going to write some applications that my students invent!  </p>  <p style=\"\">  \tI`m just making <strong style=\"\">the best Udemy Course</strong> available to You! The Complete Apple Watch Developer Course - <strong style=\"\">learn building 20 Real World Apps. </strong>Don`t you believe? Then keep reading and let me resolve Your doubts!  </p>  <p style=\"\">  \tIf You are a total beginner ... don`t worry! This course is for You!  </p>  <p style=\"\">  \tStep by step you have a chance to become <strong style=\"\">a professional!</strong>  </p>  <p style=\"\">  \tHow did I hit on the idea of this course?  </p>  <p style=\"\">  \tEverything started when Apple revealed some information about their new product.  </p>  <p style=\"\">  \tThey introduced <strong style=\"\">Apple Watch</strong>! Everyone has been amazed!  </p>  <p style=\"\">  \tThink what happens when Apple put on the market a new product! People are going crazy and they wish to have it at their homes or in their pockets.  </p>  <p style=\"\">  \tThe same will happen to Apple Watch, but now people are given a chance to have a new gadget on their wrists!  </p>  <p style=\"\">  \tWhat else? There are millions of different applications available on iPod or iPhone. <strong style=\"\">On a watch ... there are none!</strong> What does it mean? I open you the way to become the best Apple Watch developer! You can be the first who has a chance to sell an application on the App Store!  </p>  <p style=\"\">  \tAre you ready to take part in this course? I`m going to let you know what else you can win and then ... you`ll be convinced for sure!  </p>  <p style=\"\">  \tOnce you have finished this course, you`ll be able to write programs on iWatch and iOS. You`ll be able to write any application that comes to Your mind! Besides, you`re going to find a job as a developer! You have my guarantee!  </p>  <p style=\"\">  \tIn addition, I`ll give you this <strong style=\"\">for free</strong>:  </p>  <p style=\"\">  \t- access to 2000 <strong style=\"\">exclusive</strong> graphics that you can use in Your application (worth $500)  </p>  <p style=\"\">  \t- <strong style=\"\">unlimited</strong> access time to this course  </p>  <p style=\"\">  \t- access to the information on how to promote Your applications and make real money!  </p>  <p style=\"\">  \tAs you can see, after this course, you`ll be given a chance to join developer group and, as You know for sure, this kind of job is very profitable!  </p>  <p style=\"\">  \t<strong style=\"\">Still hard to believe?</strong>  </p>  <p style=\"\">  \tI`m going to discuss all the elements of WatchKit library. Moreover, I`m going to show You how to write iOS applications available on iPad or iPhone! I`m going to show You Sketch program as well! You`re going to be taught how to make graphics to Your own applications. This is <strong style=\"\">over 20-hour</strong> course, full of high-value information!  </p>  <p style=\"\">  \tSuch a huge knowledge costs <strong style=\"\">few thousand dollars! </strong>Videos are high quality and English language is clear and comprehensible.  </p>  <p style=\"\">  \tYou are going to love this course, I guarantee you that! I did the best material in Udemy service, and beside that fact, the course will definitely meet Your requirements.  </p>  <p style=\"\">  \tI`m going to write few applications which my students come up with and I`m going to put them in updates. Incredible! None of teachers offer something like that! I`m sure You`ll be satisfied with this course and I hope that, thanks to me, you`ll be able to become a career as a professional developer.  </p>  <p style=\"\">  \tI`m going to prove that money is not everything! Only You satisfaction is what matters most! If you are not satisfied with the course, I will give You the money back!  </p>  <p style=\"\">  \tThis course is for everyone! From a total beginner to a professional!  </p>  <p style=\"\">  \t<strong style=\"\">What`s included in the course?</strong>  </p>  <p style=\"\">  \t- Xcode and Interface Builder  </p>  <p style=\"\">  \t- UI elements for both Apple Watch and iOS (buttons, labels, sliders, images and more)  </p>  <p style=\"\">  \t- Apple&#039;s New Programming Language: Swift  </p>  <p style=\"\">  \t- Variables, Arrays, Dictionaries, Tables, Loops  </p>  <p style=\"\">  \t- Navigation, Storage and Live Content from Web  </p>  <p style=\"\">  \t- API&#039;s and HTTP Request (JSON and XML)  </p>  <p style=\"\">  \t- Maps, Images and Music  </p>  <p style=\"\">  \t- CoreData (Database)  </p>  <p style=\"\">  \t- Marketing your Apps  </p>  <p style=\"\">  \t<strong style=\"\">What are You waiting for?</strong>  </p>  <p style=\"\">  \tIt`s just 199$ ! Satisfaction guaranteed! Otherwise, You`ll get Your money back!  </p>", 
    "end_date": null, 
    "title": "The Complete Apple Watch Developer Course - Build 20 Apps!", 
    "price": "20.00", 
    "instructors": "Mateusz Fraczek", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425982_5041.jpg", 
    "course_url": "https://www.udemy.com/the-complete-apple-watch-developer-course-build-20-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T15:10:26Z"
}