{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>From the creator of The Complete Web Developer Course (the most popular and best reviewed course on Udemy ever), comes <strong>The Complete iOS8 and Swift Course: Learn by Building 15 Real World Apps.</strong><br></p>  <p>  \t                  Looking to boost your income as an app developer? Or maybe you're seeking a career change that gives you more free time and flexibility?  </p>  <p>  \t<strong>The Complete iOS8 and Swift Course</strong> is THE most comprehensive, cost-effective and career-enhancing mobile app development course you'll find on the web – or your money back.  </p>  <p>  \t                  It's a one-stop-shop for everything you need to start creating professional mobile apps that engage users, call them to action, and ultimately make you money!  </p>  <p>  \t<strong>  Not only that but you'll get unlimited web hosting for one year (worth $200), and a copy of my ebook How To Earn $10,000 While Learning To Code, rated 5-Stars on Amazon. AND you'll get over 1,000 graphical assets (backgrounds, icons, buttons etc), worth $300, to use in your apps.</strong>  </p>  <p>  \t                  If you're looking for a genuinely effective course that equips you to build stunningly presented apps that will start earning you cash, I personally guarantee this is the number one course for you.  </p>  <p>  \t<strong>  From Beginner to Advanced Mobile Developer in Six Weeks  </strong>  </p>  <ul>  \t<li>XCode and Interface Builder</li>  \t<li>Inputs, Buttons, and Reactive Interfaces</li>  \t<li>Apple's New Programming Language: Swift</li>  \t<li>Variables, Arrays, Tables, and Loops</li>  \t<li>Navigation, Storage, and Live Content</li>  \t<li>Images, Maps and Music</li>  \t<li>Accelerometers and Motion Feedback</li>  \t<li>Core Data and JSON</li>  \t<li>Online Storage With Parse</li>  \t<li>Games and the Sprite Kit</li>  \t<li>Instagram and Snapchat Clones</li>  \t<li>App Store Submission</li>  \t<li>Making a Marketing Website For Your App</li>  </ul>  <p>  \t                  Throughout 145 lectures and over 19 hours of content, we first start with the basics. I'll then show you the tips and tricks to work effortlessly with Xcode and Swift in your sleep.  </p>  <p>  \t                  After that we progress to building more advanced apps and games using web content, animation and geolocation.  </p>  <p>  \t                  By then you'll be developing live applications like Instagram and Snapchat clones that allow users to interact with one another across the web.  </p>  <p>  \t                  I promise that you'll never have to waste time and hard-earned cash learning from books, expensive online courses, or YouTube videos. With The Complete iOS Developer Course, you will get everything you need, all within one convenient, easy to navigate package. Plus, you will get fast, friendly, responsive support by email, Twitter and on the Udemy forums.  </p>", 
    "end_date": null, 
    "title": "The Complete iOS8 and Swift Course: Learn by Building 15 Real World Apps", 
    "price": "30.00", 
    "instructors": "Rob Percival", 
    "commitment": "22.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/250114_bcc3_4.jpg", 
    "course_url": "https://www.udemy.com/complete-ios-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T04:06:31Z"
}