{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Welcome To The Complete Android Developer Course: Beginner To Advanced </strong></p>\n\n<p><strong class=\"redactor-inline-converted\">⇉ Watch the promo video </strong>to see How You Can Begin Building And Developing Your Very Own Android Applications Today! <br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">⇉ This Course is MASSIVE! </strong>You receive over<strong class=\"redactor-inline-converted\"> 17+ hours of video</strong> content &amp; <strong class=\"redactor-inline-converted\">140+ lectures!</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">⇉ Join Over 100,000+</strong> <strong class=\"redactor-inline-converted\">Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">⇉ 2500+ Five Star Reviews Shows</strong> Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n\n\n<p><em>\"Thank you very much Ashutosh and Joe for such a simple and excellent course. I am still in the process of learning.\"</em> -Mohammed Imran Farooqui</p>\n\n<p><em class=\"redactor-inline-converted\">\"It's good to follow a course from beginner to advanced! I am so excited... Thank you! </em></p>\n\n<p>-Asma Hawari</p>\n\n<p><em>\"Good course. The instructor is using a simple way to explain the course that every student could understand easily.\" -</em>Salim Ben</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">__________________________________________________________________________</em><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here Is Everything You Will Learn In This Complete Course: </strong></p>\n\n\n\n<ul><li>How to create android applications from scratch! </li><li>We will learn how we could use Java to make android applications.</li><li>We will learn what tools are required to develop android applications.</li><li>We will also learn about Android Studio, AVD to run apps on pc. Then we move on to learn how to make user interface for our application by using multiple widgets. Also we go through how we could add properties to widgets.</li></ul>\n\n\n\n<p>We then study the different types of layouts used to design the user interface for <br>our application. we go through the methods used for handling events such as a touch.<br>we also learn how to handle multiple events. Understanding fragments and their use is the <br>next which we study in this course, we also learn how to use create fragments to merge multiple activities on a single screen. We have an overview about gestures and the techniques to handle them</p>\n\n\n\n<p>To go through the basic concepts we develop a basic workout android applications which suggests workouts depending on the option selected by the user, this gives you an idea about how android apps work.Moving along we learn how to add animations and transitions to our app, so as to make it more attractive to the end user. We then move on to intents and from there we go on to study about threads and their usage in developing android applications. Next part includes concepts such as intent,services and list views.we study about them in depth as well.</p>\n\n\n\n<p>We then move to the most important part of saving the data in database using SQLite.<br>We will then learn and understand the basic database queries such as adding and deleting data from database. After we are done with database we then move on to multimedia in which we study how to apply filters and styles to our image.</p>\n\n\n\n<p>Last but not the least we have a basic introduction to game development by studying the<br>game development platform Libgdx, here we study the basic structure of a game.<br>Also we learn how to animate characters while developing games for android. We also go through the sound effects while developing games using Libgdx.</p>\n\n\n\n<p>You will learn all of this and so much more by enrolling in our course! </p>\n\n\n\n<p><em class=\"redactor-inline-converted\">__________________________________________________________________________</em></p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards becoming an <strong class=\"redactor-inline-converted\">Android Developer! </strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">When we learn something new,</strong> I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the <strong class=\"redactor-inline-converted\">Udemy</strong> <strong class=\"redactor-inline-converted\">30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course. If you ever have any questions please feel free to message us directly and we will do our best to get back to you as soon as possible! </p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">What I can't do in this Course..</em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n\n\n<p><em class=\"redactor-inline-converted\">I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">__________________________________________________________________________</em></p>\n\n\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Click the \"take this course\" button at the top right now!</strong></p>\n\n\n\n<p>...<em class=\"redactor-inline-converted\">every hour you delay is costing you money</em>...</p>\n\n\n\n<p>See you in the course!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Sincerely,</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Joe Parys &amp; Ashutosh Pawar </strong></p>", 
    "end_date": null, 
    "title": "The Complete Android Developer Course: Beginner To Advanced!", 
    "price": "50.00", 
    "instructors": "Joe Parys, Ashutosh Pawar", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709660_24ad_2.jpg", 
    "course_url": "https://www.udemy.com/androidcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T14:05:38Z"
}