{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong><strong>Do You Want To Create Your Own iPhone and iPad iOS 9 Apps</strong> but are not sure where to start? Are you ready to jump right into the exciting world of mobile development but have little or no programming experience? Then this is your course!</p><p><strong>This Complete IOS 9 &amp; Xcode 7 Guide - Make 20 Applications</strong> will give you everything your need to start your new career in IOS 9 development, The course has been structured to support Objective-C and Swift 2, Teaching you all you need to know from creating your first project to Submitting to the AppStore.</p><p><strong>Create <strong>20</strong> Real iOS 9 Applications</strong> throughout the course from fun and simple games to powerfull utility apps using the native features of IOS 9 devices to help you understand the process of creating applications</p><p>Sell Your App to Millions of Potential Users and earn extra revenue from Ad networks and in app purchases, Making money has never been so easy!</p><p>Not only do you get the best online IOS 9 development course online buy You also get first class responsive support by email, Twitter or on the Udemy forums, So you can rest assure you have full guidance in your new career!</p><p><strong>Why Choose This iOS 9 &amp; Xcode 7 Course?</strong></p><p>Many programmers learning to create there first iOS 9 application often learn from a boring 300 paged book or a short online video tutorial and are often left with more questions they they asked! This iOS 9 &amp; Xcode 7 course teaches you from the ground up and i never leave you hanging as i support you through each and every step, i am there to assist you when you run into a problem in Xcode 7 and to offer any advice needed and before you know if you will have created your first iOS 9 app and will feel like everything your learned has stuck in your head.</p><p><strong>Topics Covered:</strong></p><ul><li>Understanding Xcode 7, iOS 9, Interface Builder, Simulator and Project Types</li><li>Objective-C: Full guide to creating full featured apps</li><li>Swift 2: Get to know the new updated language</li><li>Create 20 real iOS 9 applications in both languages</li><li>All Objects, Actions and Outlets possible in App Development</li><li>Social Integration: Facebook, Twitter, SMS, Email and more</li><li>Storyboards and nib Files</li><li>Universal Support and Screen Size Support</li><li>Images and Sounds Integration</li><li>Full Featured iOS 9 Apps</li><li>Saving and Loading: From text to data</li><li>Earning Revenue Ad Networks</li><li>Fun and Simple iOS 9 Games</li><li>Full In App Purchase Support</li><li>Core Data Applications</li><li>Camera Support Applications</li><li>App Store Submission and Update Support</li></ul>", 
    "end_date": null, 
    "title": "The Complete IOS 9 & Xcode 7 Guide - Make 20 Applications", 
    "price": "30.00", 
    "instructors": "Aaron Caines", 
    "commitment": "30 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535034_29b6_6.jpg", 
    "course_url": "https://www.udemy.com/the-complete-ios-9-xcode-7-guide-make-20-applications/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T11:57:51Z"
}