{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">This course was funded through a massively successful Kickstarter campaign.</strong>  </p>  <p style=\"\">  \t  Have you ever wanted to learn how to make android apps? Chances are you have tried but haven&#039;t got anywhere. Sometimes the tutorials are either too basic or too complex. What you need is a pre planned curriculum that shows you how to build apps.  </p>  <p style=\"\">  \t  Look no further because this course is the number 1 course that will show you how to build apps for Android. Reach a ton of people with your amazing idea today.  </p>  <p style=\"\">  \t  One of the best features is that you can watch the courses at any speed you want. This means you can speed up the or slow down the video if you want to.  </p>  <p style=\"\">  \t  This course is <strong style=\"\">project based</strong> so you will not be learning a bunch of useless coding practices. At the end of this course you will have real world apps to use in your portfolio. We feel that project based training content is the best way to get from A to B. Taking this course means that you learn practical, employable <strong style=\"\">skills immediately. </strong>  </p>  <p style=\"\">  \t  Learning how to code is a great way to jump in a new career or enhance your current career. Coding is the new math and learning how to code will propel you forward for any situation. Learn it today and get a head start for tomorrow. People who can master technology will rule the future.  </p>  <p style=\"\">  \t  You will get full <strong style=\"\">lifetime</strong> access to this course for a single one off fee. John Bura has created many games, apps and training courses so he is extremely qualified to teach you how to master technology. This is an instructor that does not only teach, he produces apps. This means you get the most relevant information on how to code. Most courses do not show you practical skills and real world examples.  </p>  <p style=\"\">  \t<strong style=\"\">What makes you a good teacher?</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·I have released over 40 games and apps that have done very well in the app store.  \t</p>  \t<p style=\"\">  \t\t  ·I run a company called Mammoth Interactive so I am actively in the field building apps and making money  \t</p>  \t<p style=\"\">  \t\t  ·I have been teaching since 2002  \t</p>  \t<p style=\"\">  \t\t  ·I personally love learning online and my life is much better because I have learned online rather than a classroom  \t</p>  \t<p style=\"\">  \t\t  ·I am one of the top 10 highest grossing Udemy teachers  \t</p>  \t<p style=\"\">  \t\t  ·I have been a Udemy instructor since 2011.  \t</p>  \t<p style=\"\">  \t\t  ·I make sure people learn how to make money from their creations.  \t</p>  \t<p style=\"\">  \t\t  ·I have over 110k students worldwide  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\">Who is this class for?</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·People who want to improve their technical skills  \t</p>  \t<p style=\"\">  \t\t  ·Complete beginners  \t</p>  \t<p style=\"\">  \t\t  ·People who want to make money. I show people the tools on how to make money through various methods of passive income  \t</p>  \t<p style=\"\">  \t\t  ·People who want to get ahead of the pack by learning online.  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\">How you will make money by learning new skills</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·Learn practical skills  \t</p>  \t<p style=\"\">  \t\t  ·Learn about how leverage your new skills to greater wealth  \t</p>  \t<p style=\"\">  \t\t  ·Learn through practical examples  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\">Why should you learn online?</strong>  </p>  <p style=\"\">  \t  There is an online education revolution taking place. You may have heard about it in the news or heard it from a friend. Either-way, education is going to be changed forever. In this short course I talk about how Online Education has  </p>  <p style=\"\">  \t  ·Motivated me  </p>  <p style=\"\">  \t  ·Helped my career  </p>  <p style=\"\">  \t  ·Helped me as a teacher  </p>  <p style=\"\">  \t  ·Impacted several lives around the planet  </p>  <p style=\"\">  \t  I promise that this course will be better and more effective than reading books. I show how to master technology through the use of video. This course will give you everything you need to thrive in our technological society.  </p>", 
    "end_date": null, 
    "title": "The ultimate Android course for complete beginners", 
    "price": "20.00", 
    "instructors": "John Bura", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375614_e1c6_4.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-android-course-for-complete-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T14:34:25Z"
}