{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Are you Looking to <strong>boost your income as an Android Developer</strong>? Maybe you have a lot of app ideas but don't know where to start? Or you are <strong>seeking a career in Android Development and Java Programming</strong> that will finally give you freedom and flexibility you have been looking for?</p><p><strong>Build a strong foundation in Android Development</strong><strong>, Android Studio and object-oriented Java Programming with this tutorial and complete course.</strong></p>  <ul><li>Build Android apps from scratch using Android Studio and Java Programming</li><li>Upload your apps to Google Play and reach Millions of Android users</li><li>Make Money from your apps by displaying ads. (How To Monetize Apps)</li></ul><p><span></span></p><p><strong>Content and Overview</strong></p>  <p>\t This course will take you from knowing nothing about Android development to a complete Android developer in 5 weeks. You will learn the following:</p>  <ul><li>Android Studio and build User Interface (Set up and walkthrough)</li><li>Fundamentals of <strong>Java Programming used to build Android apps</strong></li><li>Inputs, Buttons and Reactive (Tap) Interfaces</li><li>Android Building blocks</li><li>Variables, Arrays, Loops, ArrayLists, ListView</li><li><span></span>Navigate between screens</li><li>Passing information between screens</li><li>Learn how professional android apps developers think and work</li><li>Learn how to design android apps</li><li><span></span>Build several amazing apps - Hands on</li><li>Publish your apps on Google Play</li><li>Build Sound Box app</li><li><strong>Build WhatsApp Clone</strong></li><li><strong>Earn Money from your Android apps</strong> - How to integrate ads in your apps</li><li>And Learn much more by Building 21 Real World Apps ...</li></ul><p><strong>WHY ANDROID?</strong></p><p>Android is known to be one of the most versatile and most used operating systems. We are in the age where every other person uses a handheld device or a cell phone which makes use of Android. If one goes deep into the world of android, we would see that there is a scope and a lot of potential in the world of android for individuals who are tech geeks (like us)! As vast this world this, learning about it as simple and as easy as a piece of cake. You can make your own app easily and show your true potential to the world of google and android.</p><p>Here are some numbers to get you in the mood!</p><p><strong>DID YOU KNOW?<br>\n</strong>Android is the primary operating system for over 90 tablets, for 6 E-Readers and 300 smartphones.<br>There are over 1,460,800 apps in Google Play store &amp;they’re growing at an astounding pace!<br>Every day about 1.5 million Android devices are activated all around the world.<br>About 60% of the apps available at the Google play store are absolutely free!</p><p><strong>Why learn android development?<br>\n</strong>Learning android development is both fun and can reap you many profits in the long run. It is said that by the year 2018, there will be about 4 billion android users, hence doubling the current market. It is safe to say that android development has a potential and can reap you various benefits in the long run. If one knows android development, not only will you be having a stable and sound career but can unleash you hidden talents as a developer.</p><p><strong>Course description<br>\n</strong>if you take this course (which you should!!) know that you are on your way to building a solid and stable foundation for Android Development, Android Studio and object-oriented Java Programming. You don’t need to spend years and years on learning, with us you can <strong>learn in 5 weeks!!!! </strong>YES! That is right, in five weeks you’ll be able to make and develop your own app and you never know, you could have it running at the app store and be an instant hit!</p><p>We have built this course in a way that everything that you learn, you will be able to retain it for a long time. This is why we have distributed the whole course into various sections and not sessions. The reason why we did this is because our course is live and <strong>ON DEMAND</strong>. Once you buy this course, you have <strong>LIFETIME ACCESS</strong> to it. You can always refer back to any section that you want to revise and move along. Every section of ours has been built to test your ability. You not only get the content but also are given quizzes and assignments to ensure that what you have learnt is retained and you fully understand the content. (Don’t worry, we won’t scold you if you have some problem, we will be throughout). We assure you, with us you’ll be an android developer in no time!</p><p><strong>NO NEED TO BE A PRO!<br>\n</strong>Our course is designed specifically for people who have ZERO prior experience in programming and have never even programmed a single thing before. It doesn’t matter if you have absolutely no idea about the basics (that is why we are here!), we will teach you everything that you need to know about developing and programming in just 5 weeks. All you need is loads of passion, a hint of dedication, an internet connection and a laptop or PC. It’s that easy!!</p><p><strong>What do I learn from this course?<br>\n</strong></p><ul>\n<li>You will be able to learn android app development and Java programming in just 5 weeks.</li>\n<li>You can create engaging and real-world Android apps (which you can later show off to your family and friends).</li>\n<li>You will be learning the course by building 21 apps that include big buzz word apps such as the popular Whatsapp clone, calculator, YouTube video player, and a simple and basic application as a Headstart, a mood setter application and what not!<br>\n</li>\n<li>This course is offered via visual training that engages students and has a better chance of retention. You will have a personal trainer at your desk at all times that will guide you fully.</li>\n<li><strong>We aren’t finished! <br>\n</strong>You can learn how to work with APIs, web services and advanced databases Upload your android apps to the Google play and reach millions of android users and <strong>EARN MONEY</strong> by monetizing your applications and allowing advertisements to run on them!</li>\n</ul><p><strong>Why choose us?<br>\n</strong>Obviously, once you’ve made up your mind to become an expert developer, you will question the fact that why should you choose us? The answer is because we are passionate about android, we breathe, live and eat android! We have been in the industry for more than a decade and along with our knowledge, we can teach you with hands on experience. We have a decade of experience in our bags of solid programming experience along with five years of application development experience. Our experience can be measured by us having over fifty applications and games (developed by us) on not only the Android Google Play but also on the Apple App Store. You’ll be taught by people who have more than 5 years of training and teaching experience, are Registered Android Developers on Google Play and manage a large community that consists of more than 10 thousand Developers.</p><p>Are you sold yet? No? we are dedicated teachers and want to spread the joy we receive by developing to others as well, we have made and developed this course by making sure that that joy is kept alive in every section and every lesson.</p><p><strong>If you’re a …<br>\n</strong>Everyone can learn this course! Whether you want to develop apps as a hobby, whether you’re an entrepreneur who’s looking to save costs and develop his/her own applications, newbies who are new to the tech world or a student looking to develop skills for extra income. You are welcome to join us and this course!</p><p>If you have any questions or queries related to us or our course you can contact us by email or through any Udemy forum. We shall help you before, during and after the course as well.</p>  <p>\t<strong>Enrol now.</strong></p>  <p>\t<strong></strong><strong>We'll be really excited to see you inside! </strong>  </p>", 
    "end_date": null, 
    "title": "The Complete Android & Java Developer Course - Build 21 Apps", 
    "price": "40.00", 
    "instructors": "Fahd Sheraz, Paulo Dichone", 
    "commitment": "28 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360920_681f_19.jpg", 
    "course_url": "https://www.udemy.com/complete-android-developer-course/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T23:44:39Z"
}