{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Have you ever dreamed of <strong>creating professional java or android </strong>applications? would you like to apply for your dream job as a <strong>professional android developer? </strong><strong></strong></p><ul><li>Well, in this course you are<strong> going to build 100 android apps</strong> from scratch. Java is the most popular programming language in the world, so if you want to master Java, then this course is completely designed for you. I am going to teach you to <strong>master android application development</strong><strong>  by building 100 real apps. </strong>This course will teach you to think like a programmer. building applications have never been so fun, with the <strong>Android Studio </strong>Tool from the popular Google Company, you have got every thing you need to create awesome android applications. </li><li>You will also learn how to work with web services which is an important concept in software development. I'll teach you every thing you need to know to create powerful databases and how to interact with the <strong>PHP code</strong> via  android application. I'll also teach you the essentials of php development.</li><li>I will teach you how to create<strong> custom controls</strong> yourself.</li><li>Learn Android Programming from scratch by building 100 android apps.</li><li>This course consists of tutorials that take you from a person who has no programming experience at all to a person who is the best java and android developer in the world.</li><li>This course gives you enough knowledge and experience about java and android programming so that you can build your own android apps from scratch. </li><li>This course consists of the best android tutorials so far.</li></ul><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "The Complete Java, Android Developer Course: Build 100 Apps", 
    "price": "50.00", 
    "instructors": "Morteza Kordi", 
    "commitment": "30 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746240_3b0a_2.jpg", 
    "course_url": "https://www.udemy.com/the-complete-android-developer-course-build-100-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-29T20:25:28Z"
}