{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Do You Want To Create Your Own tvOS application for the new Apple TV</strong> but are not sure where to start? Are you ready to jump right into the exciting world of tvOS application development but have little or no programming experience? Then this is your course</p><p><strong>This tvOS &amp; Swift 2 - Apple TV Development Guide</strong> will give you everything your need to start your new career in tvOS development, The course has been carefully structured to support Swift 2 &amp; tvOS, Teaching you all you need to know from creating your first project to submitting to the AppStore.</p><p><strong>Create <strong>13</strong> Real tvOS Applications</strong> throughout the course we will create exciting tvOS applications from fun and simple games to powerful utility apps using the native features of the tvOS Apple TV device to help you understand the process of creating applications from start to finish.</p><p>With the brand new tvOS Apple TV App Store you can sell Your Applications to Millions of Potential Users around the world and now has never been a better time with only a few thousand apps currently for sale on Apple TV, you can take the charts by storm.</p><p>Not only do you get the best online tvOS development course online but You also get first class responsive support by email, Twitter or on the Udemy forums, So you can rest assure you have full guidance in your new tvOS career!<br><strong><br>Why Choose This tvOS &amp; Swift 2 Course?</strong><br></p><p>Many programmers learning to create there first tvOS application often learn from a boring 300 paged book or a short online video tutorial and are often left with more questions then they asked! This tvOS &amp; Swift 2 course teaches you from the ground up and i never leave you hanging as i support you through each and every step, i am there to assist you when you run into a problem in Xcode 7 or tvOS and i offer any advice needed. Before you know it you will have created your very first tvOS app and will feel like everything you have learned has embedded in your head.</p><p><strong>Topics Covered:</strong><br></p><ul><li>Understanding Xcode 7, tvOS, Interface Builder, tvOS Simulator, tvOS Remote and Different tvOS Project Types</li><li>Swift 2: Get to know the new updated language</li><li>Create 13 real tvOS applications in Swift 2</li><li>All Objects, Actions and Outlets possible in tvOS App Development</li><li>tvOS Focused Engine</li><li>tvOS Native Application Controls</li><li>tvOS Storyboards and nib File support</li><li>Images and Sounds Integration</li><li>Full Featured tvOS Apps</li><li>Fun and Simple tvOS Games</li><li>Core Data tvOS Applications</li><li>App Store Submission and Update Support</li></ul>", 
    "end_date": null, 
    "title": "tvOS & Swift 2 - Apple TV Development Guide", 
    "price": "20.00", 
    "instructors": "Aaron Caines", 
    "commitment": "17 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648898_e824_14.jpg", 
    "course_url": "https://www.udemy.com/tvos-apple-tv/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T15:10:55Z"
}