{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Note: Videos recorded using Unity version 5.3.2 (2016)</strong></p><p><strong>Important</strong>: all softwares used in this course are <strong>FREE</strong> to download and use on PC and MAC computers (no need to pay, cheers!)</p><p><strong>*** BREAKING NEWS ***</strong></p><p><strong>This is the most comprehensive course when it comes to build and publish a Unity 3D shooter game and publishing it to app stores.</strong></p><p><strong>Great course to keep as a reference</strong></p><p><strong>********</strong></p><p>In this course you will learn how to <strong>design, program, and publish a 3D shooter video game</strong> in the style of MineCraft and publish it in the Google Play store and iTunes app stores (iOS and Android).</p><p>Why would you want to learn how to make a 3D shooter game? </p><p>Because it's fun, and it's proven to be top games in the app stores. People love to play these games. And the best reason of all: thanks to this course, you will create a good looking game by yourself that you can publish in the app stores, without having the need of a team of multiple people.</p><p>This course can be taken by anyone even if you've got no programming skills or very little</p><p>This course is meant for non-artists, meaning you don't have to be an artist to be able to use 3D pixel art graphics.</p><p>You will learn how to use free tools to make an amazing game from scratch as I will show you every single line of programming and how to use Unity 3D to be able to make professional games all by yourself quickly and without having to spend money.</p><p><br></p><p>By the way as a bonus, this course includes free downloads of the finished 3D models, Unity projects and levels as well.</p><p>The skills you will learn in this course can be applied to so many more projects as they are the core foundations of any professional video games. Invest in yourself by joining this course now</p><p><strong>What is 3D Pixel Art?</strong></p><p>3D Pixel art is a form of digital art, created through the use of 2D-like raster graphics software, where images are edited on the pixel level in the form of blocks. Graphics in most old (or relatively limited) computer, console, graphing calculator and mobile phone video games are mostly 2D pixel art, and now we use the new technologies t have the retro-cool style with the amazing functionality that 3d technology provides.</p><p><em><br></em></p><p><em>Note: This course's graphic assets are used for educational purpose only.</em></p>", 
    "end_date": null, 
    "title": "Unity 2016 - Build , program and publish a 3D shooter game", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759194_4f6d_4.jpg", 
    "course_url": "https://www.udemy.com/unity-3d-2016-build-program-publish-1st-person-shooter/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T02:54:42Z"
}