{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em><strong>THE BEST WINDOWS APP DEVELOPMENT COURSE ON UDEMY!</strong></em></p><p>  \t<em><strong>This course readies you to create a Windows app that will run on any device runing this OS as of Windows 10, and makes you a job-ready, employable Windows developer.</strong></em></p>  <p>  \t                                         Start creating universal apps for Windows and get ready for Windows 10, which will run on IoT devices, small phones, phablets, tablets, laptops, two-in-ones, desktops, all-in-ones and even on some futuristic glasses with hollograms! <strong>Windows 10 will just be everywhere, and your apps can too!</strong>  </p>  <p>  \t                                         All you need is Visual Studio (available as a FREE tool)!</p>  <p>  \t                               Enroll now, if by the time you finish this course you are not entirely happy with its content, or the way I answered to your questions, you can have your money back! You have a 30 day money back guarantee, no questions asked.  </p>  <p>  \t                                         ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>  <p>  \t                                         Learn how to make universal apps for Windows, which will run on devices runing Windows 8.1 and up:  </p>  <ul>  \t<li>Phones</li>  \t<li>Tablets</li>  \t<li>PCs</li>  </ul>  <p>  \t                                         You can start creating Windows apps as of TODAY with no prior experience on the platform.  </p>  <p>  \t                                         You will learn by creating real world apps as you learn key concepts, so you'll be able to practice, not just hear the theory. <strong>You'll get apps developed.</strong>  </p>  <p>  \t                                         All you will need is to install Visual Studio (we talk about it in one lecture), which can be found as a free tool (you will also see how on that lecture).  </p>  <p>  \t                                         You'll learn:  </p>  <ol>  \t<li>How to define XAML elements into the UI</li>  \t<li>How to control those elements with C# code</li>  \t<li>The basic way of how Object Oriented Programming is used</li>  \t<li>How to integrate source control into your projects</li>  \t<li>Add navigation between pages (screens)</li>  \t<li>Use the most common elements for the UI</li>  \t<li>How to use special elements that help with the design of a Windows 10 UI</li>  \t<li>Save data to SQL tables</li>  \t<li>Save data settings</li>  \t<li>Integrate HTTP requests to your app</li>  \t<li>Integrate the cloud inside your app</li>  \t<li>Make money with your apps with ads and in-app purchases</li>  \t<li>Publish your app</li>  </ol>  <p>  \t                                         ...and more!  </p>  <p>  \t<strong>Enroll now and get ready for the next Windows! Every second that passes counts! Windows 10 is just around the corner!</strong>  </p>", 
    "end_date": null, 
    "title": "Universal Windows App Development", 
    "price": "20.00", 
    "instructors": "Eduardo Rosas", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404102_6eb7_5.jpg", 
    "course_url": "https://www.udemy.com/windows10/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T05:19:09Z"
}