{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>The first major update for the Apple Watch has launched! And it's fantastic! You can finally download third-party apps that access most of the Apple Watch's sensors. You can reply to email directly from Apple Watch, get detailed transit maps, keep all your credit cards in one place, send multicolor digital sketches, do much more!</strong></p><ul><li>This update puts more customization at your finger tips! </li><li>Pick from 9 new colors that match Apple's new watch bands</li><li>Choose any favorite photo for your Watch Face</li><li>Set an entire photo album as your Watch Face</li><li>Get 6 Time Lapse Watch Faces: Hong Kong, New York, Shanghai, London, Paris, or Mack Lake</li><li>Customize with Third-party complications</li></ul><p><br><strong>Upgrade to watchOS 2 for faster loading apps, more fluid navigation, and better ways to stay in touch with the world from your wrist.</strong><br><br>This course will show you step-by-step how to download watchOS 2 for Apple Watch. Then from there I jump right into some fun little additions, including some hilarious new animated emojis. Send a kiss-blowing emoji, fist bump, or even raise-the-roof emoji that are sure to get some laughs.<br><br>Also learn how third-party apps are about to get MUCH better. Now that iOS Developers can access the Apple Watch's sensors directly, things like sleep tracking are now possible. Using a third-party app called Sleep++ I show you how I track my sleep throughout the week.</p><p>Learn how to stay more on top of your day using Apple's latest innovation called \"Time Travel\". With just a spin of the Digital Crown you can get a look ahead at your next appointment or see if it's going to rain later in the day.</p><p>Add third-party complications to your watch face. Use the more intelligent Siri to open apps, glances, ask questions, or do specific tasks. Make FaceTime audio calls. Add multiple Friends circles. There's so much you can do with watchOS 2!</p>", 
    "end_date": null, 
    "title": "watchOS 2 | Apple Watch's Latest Software Update", 
    "price": "20.00", 
    "instructors": "Cory Kensinger", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/601816_f3cd_3.jpg", 
    "course_url": "https://www.udemy.com/watchos-2/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T20:29:24Z"
}