{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>Gain prestige Microsoft Certified Proffesional Developer (MCPD) title.</strong>  </p>  <p>  \t    This course will help to prepare for following exams:  </p>  <p>  \t    - <strong>(70-506), (70-516), (70-599)</strong></p>  <p>  \t <strong>Programming Windows Phone step by step</strong>  </p>  <p>  \t                     We have prepared <strong>22 professional lectures</strong>, during which you will learn from sctrach, how to create mobile apps for one of the quickest growing system in the world! This course is full of theory and Case Studies, preview code created during exercise.  </p>  <p>  \t                                          Are you a beginner in programming or you can already program on iOS or Android platform, but you want to <strong>be multiplatform developer</strong> and expand your skills? This course is for you!  </p>  <p>  \t<strong>Comprehensive knowledge and solid base for everyone</strong>  </p>  <p>  \t                                          The course is prepared in an attractive, multimedia package, <strong>trainer demonstrates step by step how to properly code and together you will create your first application</strong>. Completion of the course provides a solid base and a comprehensive understanding of the key issues of programming for Windows Phone. Additionaly lecturer is an experienced programmer and <strong>Nokia Developer Certified Trainer</strong>!  </p>  <p>  \t<strong>What you will learn?</strong>  </p>  <p>  \t                Our trainer will present you from scratch the architecture of Windows Phone platform, will show you how to install the Visual Studio, how to get around it. Then you will find out what are the basic structure of the application, you will learn how to create your first project, and run it on the simulator or on your own device.<strong> Don't worry, If you don't know C# - in this course you will find basics of this programming language (4 lectures). </strong>  More about the course content in the section: What am I going to get from this course?  </p>  <p>  \t <strong>It's one and only course for beginning Windows Phone programmers that you'll find on Udemy.</strong> Full of basic theory and practice. Create your first application with Educativo - Nokia Developer Certified Trainer!! Try it now!  </p>", 
    "end_date": null, 
    "title": "Windows Phone - Programming for Beginners", 
    "price": "20.00", 
    "instructors": "Educativo Trainings, IT Security Academy", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/183190_8065_2.jpg", 
    "course_url": "https://www.udemy.com/windows-phone-programming-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-15T20:29:33Z"
}