{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t This course <strong>Windows Phone</strong> - <strong>Programming for Advanced</strong> and <strong>Windows Phone - </strong><strong>Programming for Beginners</strong><strong> </strong> will help you to prepare for following exams:  </p>  <p>  \t<strong>       - (70-506), (70-516), (70-599)</strong></p>  <p>  \t     ---  </p>  <p>  \t<strong>Windows Phone - Programming for Advanced</strong> is the continuation of our <strong>basic course</strong>. You will acquire knowledge and skills needed to attain the position of mobile application developer, you will create advanced applications. You will see the ways of displaying advertisements and you will find out how to earn from them! More about the course content in the section: What am I going to get from this course?  </p>  <p>  \t             Are you a beginner in programming or you can already program on iOS or Android platform, but you want to be multiplatform developer and expand your skills? This course is for you!  </p>  <p>  \t <strong>          Comprehensive knowledge and solid base for everyone</strong>  </p>  <p>  \t   Completion of the course provides a solid base and a comprehensive understanding of the key issues of programming for Windows Phone. Additionaly lecturer is an experienced programmer and <strong>Nokia Developer Certified Trainer</strong>!  </p>  <p>  \t <strong>      It's one and only course for Windows Phone developers that you'll find on Udemy.</strong> Full of theory and practice. Create advanced application with Educativo - Nokia Developer Certified Trainer!! Try it now!  </p>", 
    "end_date": null, 
    "title": "Windows Phone - Programming for Advanced", 
    "price": "20.00", 
    "instructors": "Educativo Trainings, IT Security Academy", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184036_1424_2.jpg", 
    "course_url": "https://www.udemy.com/windows-phone-programming-for-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-17T16:30:03Z"
}