{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tSo you want to make apps but you don&#039;t know where to start. You start a few tutorials on the internet but you end up without an app or any knowledge whatsoever.  </p>  <p>  \t  If you want to make apps you pretty much have to use Xcode, Apple&#039;s app making program. But when you download it and take a look it seems really complicated to use. There are tons of books on how to program and use Xcode but none of them are that user friendly.  </p>  <p>  \t  That&#039;s where this course is different! This course shows you how to use Xcode while learning another in demand valuable skill: user experience. User experience is one of the toughest jobs to fill in 2012 according to Forbes. With this course you get to learn mobile user experience and Xcode at the same time!  </p>  <p>  \t  http://www.inc.com/keith-cline/talent-shortages-in-2012.html?nav=next  </p>  <p>  \t  This course shows you the ins and outs of Xcode and contains valuable information on how to get your app idea to developers and the app store as quickly as possible. If you have an app idea and you want to learn an in demand skill this course is for you!  </p>  <p>  \t  This course is intended for beginners and not professional developers. There is no programming in this course. This is strictly a design and app building course.  </p>  <p>  \t  Enjoy the course!  </p>", 
    "end_date": null, 
    "title": "Xcode Fundamentals: How to design a user experience in Cocoa", 
    "price": "25.00", 
    "instructors": "John Bura", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50854_d4d1_7.jpg", 
    "course_url": "https://www.udemy.com/xcode-fundamentals-how-to-design-a-user-experience-in-cocoa/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-22T16:10:22Z"
}