{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>When you first decide to learn about iOS programming, let's face it, it's kind of daunting. It feels like there's so much to learn, so much to understand.</p><p>There are hundreds of hours worth of training courses out there, but right now, <strong class=\"redactor-inline-converted\">you don't even know if you're going to <em class=\"redactor-inline-converted\">enjoy</em> programming</strong>!</p><p>That's why I've created this bite-sized course. To give you a taster of programming Swift, and help you to build a cool Swift project in the space of a couple hours.</p><p>Instead of diving head-first into a huge Swift and iOS course, and committing yourself to hundreds of hours of learning, <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">let's dip your toe in the water gently</em></strong>.</p><p>In this mini-course all about Swift programming, <strong class=\"redactor-inline-converted\">you're going to create a cool little Swift console app that lets you send SMS text messages</strong> from your computer to any phone.</p><p>This course is designed to be <em class=\"redactor-inline-converted\">fun</em>. To get you started with Swift, achieve something cool, and ultimately to help you decide whether this iOS programming stuff is really for you!</p><p>Armed with the knowledge you'll get in this course, you can march on to a full-blown iOS course feeling <strong class=\"redactor-inline-converted\">all the more <em>confident</em>.</strong></p><p>But remember, <strong>this mini-course is about having fun</strong>. It's not about stressing yourself and trying to learn every little programming concept we cover off by heart. It's not about getting hung up on the details.</p><p>Let's have a little fun, create something cool, prove to yourself that you can do it, and build a nice solid foundation for you to build more Swift knowledge on!</p><p>Oh, one last thing... This course is free, and will always be free. You'll never be charged a penny for it.</p><p><br></p>", 
    "end_date": null, 
    "title": "Your First Swift Project - A Swift Tutorial for Beginners", 
    "price": 0, 
    "instructors": "Pete Morris", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/832792_4449_4.jpg", 
    "course_url": "https://www.udemy.com/your-first-swift-project-a-swift-tutorial-for-beginners/", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-26T19:56:04Z"
}