{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>หลักสูตรนี้ เขียนเกมเพียงครั้งเดียว สามารถลงได้ทั้ง iOS และ Android</strong></p><p>เคยไหมที่บางทีคุณอยากสร้างเกมหนึ่งเกม แต่ไม่รู้ว่าจะเริ่มต้นตรงไหนดี </p><p>บางคนลองทำดูแล้วแต่อาจติดปัญหาต่างๆ และก็ยอมแพ้ไป บางคนทำแล้วไม่มีใครเล่น</p><p>บางคนเคยเล่นเกมที่ตัวเองชอบและอยากมีเกมเป็นของตัวเอง บางคนทำงานจนไม่มีเวลา</p><p>ปัญหาเหล่านี้จะหมดไปด้วยคอร์สเรียนออนไลน์ สร้างเกม ด้วยภาษาที่ง่ายที่สุด และดีที่สุด</p><p>ในขณะนี้ไม่จำเป็นต้องโค๊ดยากๆและนานแบบเมื่อก่อนอีกต่อไป คอร์สนี้จะตอบโจทย์ของคุณ</p><p>เทคโนโลยีที่ง่าย และรองรับทุกอุปกรณ์ เขียนเพียงครั้งเดียวก็ใช้งานง่ายๆ ถ่ายทอดประสบการณ์</p><p>จากโปรแกรมเมอร์ที่ทำงานอยู่จริงๆ ของ Nooknan Studio ผู้สร้าง Mobile App และ Games มากกว่า 4 ปี ลักษณะการสอนในฉบับเป็นกันเองไม่เน้นหลักการมากมาย เข้าใจไปพร้อมกันทำไปพร้อมกัน</p><p>ที่สำคัญคือ สำหรับผู้ที่สนใจอยากสร้างเกมออนไลน์ หรือ Multiplayer เกมในหลักสูตรจะอธิบาย</p><p>การสร้างเกมแบบออนไลน์เบื้องต้น ขั้นพื้นฐานเอาไว้ด้วย เพื่อบางคนจะสามารถต่อยอดไปยังการสร้างเกมออนไลน์ ขนาดใหญ่</p><p><strong>เนื้อหาในหลักสูตร</strong></p><ol><li>เรียนรู้พื้นฐานของ Mobile Game และเทคโนโลยีในการสร้างเกม</li><li>รู้จักกับ ตัวช่วยในการสร้างเกมด้วย HTML5</li><li>ทำความรู้จักกับ Framework ต่างๆในการสร้างเกม</li><li>รู้จักกับการทำงานต่างๆ ไม่ว่าจะเป็น ระบบ Physics Arcade Box2d เป็นต้น</li><li>รู้ถึงการสร้าง Animation ใส่เสียงในเกม และสร้าง Game Play ด้วยตัวเอง</li><li>เข้าใจถึงหลักการสร้างเกมแบบออนไลน์เบื้องต้น ระหว่าง Sever และ Client</li></ol><p><strong></strong><strong>เวลาที่ใช้ในการเรียน</strong></p><ul><li>ไม่เกิน 24 ชม สรุปในกระชับไม่เสียเวลา</li></ul><p><strong>ลักษณะการเรียน</strong></p><ol><li><strong>ทำความ</strong><strong>เข้าใจ</strong> - อธิบายถึงหลักการข้างต้นทั้งหมดในวิดีโอให้ผู้เรียนทำตาม</li><li><strong>ดูและทำตาม</strong> - ดาวน์โหลดไฟล์ Workshop แล้วทำตามในวิดีโอที่สอน</li></ol>", 
    "end_date": null, 
    "title": "คอร์สเรียน สร้างเกมบน iOS และ Android ด้วย HTML5", 
    "price": "20.00", 
    "instructors": "Thirawut Phetyoi", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759412_7ee0_4.jpg", 
    "course_url": "https://www.udemy.com/ios-android-html5/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T08:25:14Z"
}