{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>หลักสูตรนี้สอนการทำ Mobile App เขียนครั้งเดียว ได้ทั้ง iOS App และ Android App</strong></p><p>จากประสบการณ์ของ  Nooknan Studio  ผู้พัฒนา Mobile App มามากกว่า 4 ปี ซึ่งได้ทำการสอน และสร้าง Mobile App เกมต่างๆ หรือบน PC ไม่ว่าจะเป็นภาษา ActionScript Objective c Swift JAVA HTML5 CSS Javascript และ ผู้ที่เคยผลิตแอพขายจริงบน Appstore และ GooglePlay ถ่ายทอดประสบการณ์โดยตรงผ่านโปรแกรมเมอร์ของเรา ง่ายและเข้าใจเร็วสามารถนำไปประกอบอาชีพจริงได้<br></p><p>บทเรียนนี้มาจากโปรแกรมเมอร์ที่ทำงานอยู่จริง เข้ามาแชร์ประสบการณ์การทำงานและอธิบายการทำงานจริงๆ</p><p>คอร์สนี้เราตั้งใจและพยายามอย่างเต็มที่ในการสร้าง course online เนื้อดีๆขึ้นมา เพื่อให้ได้เนื้อหาเข้าใจง่ายจากเริ่มต้นไปจนระดับมืออาชีพ<br></p><p>นอกจากนั้น คอร์สเรียนนี้จะมีการอัพเดทอย่างต่อเนื่องตามยุคสมัยต่างๆไม่ได้หยุดนิ่งไว้แค่ปัจจุบันจนพาพวกเราก้าวไปสู่มืออาชีพ<br></p><p>บทเรียนจะถูกอัพเดทไปเรื่อยๆ ตามยุคสมัย จะเพิ่มบทเรียนใหม่และตัวอย่างในการทำงานมาแชร์เรื่อยๆ</p><p><strong>เป้าหมายในการสร้างคอร์สนี้ขึ้นมา</strong></p><p>เราอยากให้คอร์สนี้มีส่วนร่วมช่วยสร้างนักพัฒนา iOS และ Android ในแบบยั่งยืนและทำให้คุณกลายเป็นมืออาชีพ พร้อมสร้างบุคลากรที่มีความสามารถเพิ่มขึ้นสำหรับอุตสาหกรรมด้านนี้ จงเชื่อมั่นได้เลยว่าคุณทำได้แน่นอน</p><p><strong>ประโยชน์ที่ได้รับ</strong><br></p><ol><li>สร้างโปรเจ็คจบเองได้</li><li>สร้าง cai เพื่อพัฒนาตัวเองได้</li><li>มีแอพเป็นของตัวเอง นำไปสู่การพัฒนาหน้าที่การงานที่ดี</li><li>สร้างรายได้เสริมได้โดยง่าย</li></ol><p><strong>สิ่งที่่จะได้กลับไป</strong></p><ul><li>ตัวอย่างการสร้างเกมต่างๆ มีอัพเดทมาเรื่อยๆตามคำขอในคอร์ส</li><li>ตัวอย่างการสร้าง cai ในรูปแบบต่างๆ</li><li>การนำแอพไปใช้งานจริงหรือขายจริง</li><li>แอพของคุณที่สามารถลงในเครื่องของงคุณเองได้</li><li>สามารถนำ App หรือ  Game ที่เรียนกับเราไปสร้างโปรเจ็คจบ หรือทำผลงานได้สบาย</li></ul>", 
    "end_date": null, 
    "title": "สอนสร้าง App iOS & Android ด้วย ActionScript 3.0 ภายใน 1 วัน", 
    "price": "20.00", 
    "instructors": "Thirawut Phetyoi", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747660_e697_2.jpg", 
    "course_url": "https://www.udemy.com/app-ios-android-actionscript-3-thai/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Apps"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-31T08:59:58Z"
}