{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Accounting Analytics explores how financial statement data and non-financial metrics can be linked to financial performance.  In this course, taught by Wharton’s acclaimed accounting professors, you’ll learn how data is used to assess what drives financial performance and to forecast future financial scenarios. While many accounting and financial organizations deliver data, accounting analytics deploys that data to deliver insight, and this course will explore the many areas in which accounting data provides insight into other business areas including consumer behavior predictions, corporate strategy, risk management, optimization, and more. By the end of this course, you’ll understand how financial data and non-financial data interact to forecast events, optimize operations, and determine strategy. This course has been designed to help you make better business decisions about the emerging roles of accounting analytics, so that you can apply what you’ve learned to make your own business decisions and create strategy using financial data. \n\n                                            Syllabus\n                        Ratios and ForecastingThe topic for this week is ratio analysis and forecasting. Since ratio analysis involves financial statement numbers, I’ve included two optional videos that review financial statements and sources of financial data, in case you need a review. We will do a ratio analysis of a single company during the module. First, we’ll examine the company's strategy and business model, and then we'll look at the DuPont analysis. Next, we’ll analyze profitability and turnover ratios followed by an analysis of the liquidity ratios for the company. Once we've put together all the ratios, we can use them to forecast future financial statements. (If you’re interested in learning more, I’ve included another optional video, on valuation). By the end of this week, you’ll be able to do a ratio analysis of a company to identify the sources of its competitive advantage (or red flags of potential trouble),  and then use that information to forecast its future financial statements.  Earnings ManagementThis week we are going to examine \"earnings management\", which is the practice of trying to intentionally bias financial statements to look better than they really should look. Beginning with an overview of earnings management, we’ll cover means, motive, and opportunity: how managers actually make their earnings look better, their incentives for manipulating earnings, and how they get away with it. Then, we will investigate red flags for two different forms of revenue manipulation. Manipulating earnings through aggressive revenue recognition practices is the most common reason that companies get in trouble with government regulators for their accounting practices. Next, we will discuss red flags for manipulating earnings through aggressive expense recognition practices, which is the second most common reason that companies get in trouble for their accounting practices. By the end of this module, you’ll know how to spot earnings management and get a more accurate picture of earnings, so that you’ll be able to catch some bad guys in finance reporting!Big Data and Prediction ModelsThis week, we’ll use big data approaches to try to detect earnings management. Specifically, we're going to use prediction models to try to predict how the financial statements would look if there were no manipulation by the manager. First, we’ll look at Discretionary Accruals Models, which try to model the non-cash portion of earnings or \"accruals,\" where managers are making estimates to calculate revenues or expenses. Next, we'll talk about Discretionary Expenditure Models, which try to model the cash portion of earnings. Then we'll look at Fraud Prediction Models, which try to directly predict what types of companies are likely to commit frauds. Finally, we’ll explore something called Benford's Law, which examines the frequency with which certain numbers appear. If certain numbers appear more often than dictated by Benford's Law, it's an indication that the financial statements were potentially manipulated. These models represent the state of the art right now, and are what academics use to try to detect and predict earnings management. By the end of this module, you'll have a very strong tool kit that will help you try to detect financial statements that may have been manipulated by managers.Linking Non-financial Metrics to Financial PerformanceLinking non-financial metrics to financial performance is one of the most important things we do as managers, and also one of the most difficult. We need to forecast future financial performance, but we have to take non-financial actions to influence it. And we must be able to accurately predict the ultimate impact on financial performance of improving non-financial dimensions. In this module, we’ll examine how to uncover which non-financial performance measures predict financial results through asking fundamental questions, such as: of the hundreds of non-financial measures, which are the key drivers of financial success? How do you rank or weight non-financial measures which don’t share a common denominator?  What performance targets are desirable? Finally, we’ll look at some comprehensive examples of how companies have used accounting analytics to show how investments in non-financial dimensions pay off in the future, and finish with some important organizational issues that commonly arise using these models. By the end of this module, you’ll know how predictive analytics can be used to determine what you should be measuring, how to weight very, very different performance measures when trying to analyze potential financial results, how to make trade-offs between short-term and long-term objectives, and how to set performance targets for optimal financial performance.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Accounting Analytics", 
    "price": 0, 
    "instructors": "Brian Bushee and Christopher D. Ittner", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/accounting-analytics", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}