{
    "selfpaced": true, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Actuary is rated the best job of 2015 by CareerCast.com because it pays well and offers abundant opportunities for advancement. \n\nYou may have heard of actuarial science, or you might even know an actuary, but do you know what an actuary does? During the course you’ll hear from a wide variety of actuaries about their careers.\n\nAnd don’t be scared that the course will be “just a whole lot of mathematics”. Together, we will go beyond the math to learn how actuaries approach problems relating to risk, using examples from:\n\nFinance\n\tInvestments\n\tBanking\n\tInsurance\nYou will learn how actuarial science applies mathematical and statistical methods to assess risk in these industries and other professions.\n\nYou’ll experience “hands-on” learning using Excel (or an equivalent spreadsheet tool) to project and investigate the financial condition of a company choosing appropriate strategies for the company through the use of simulations.\n\nThe course has been carefully designed for students from a wide variety of backgrounds, with secondary/high school level being the only assumption of mathematical background. Even if you don’t have any background in, for example, calculus, the course has been designed so you can skip over these sections without affecting your understanding of the rest of the course. You also do not need to have any Excel or other spreadsheet background to take the course.\n\nFor those with stronger mathematical backgrounds, extension questions are provided to test you further. You’ll learn a huge amount about actuarial science no matter what your background is!\n\nJoin us today. To connect with the course community before and during the course, join our Facebook group, and tweet us with #actuarialedX.\n\n\"Great introduction to this specialized field; every day there are new challenges where as a student you are put in a situation to learn and apply the lessons with practical exercises. Great structure of the course, with main concepts to review at the end of a lesson. I would recommend to anyone who would like to learn more about actuarial science.\" - Previous student\n\n                                    ", 
    "end_date": "2018-12-25T00:00:00Z", 
    "title": "ANU-ActuarialX: Introduction to Actuarial Science", 
    "price": 0, 
    "instructors": "Adam Butt", 
    "institution_name": [
        "Australian National University"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/introduction-actuarial-science-anux-anu-actuarialx-0", 
    "duration": "201 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-02-17T00:00:00Z"
}