{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Se trata de un curso sobre Educación Financiera orientado a un ciudadano general, que se centra en la exposición de los contenidos fundamentales con vistas a la adquisición de un conjunto de competencias básicas para poder desenvolverse con autonomía en el ámbito financiero. Se incide en el marco general de adopción de decisiones financieras, en la presupuestación familiar, en la oferta de instrumentos para el ahorro y la inversión, y en la utilización del crédito.\r\nConocimientos necesarios:\r\nSe considera recomendable que el alumno que realice el curso esté en posesión de conocimientos previos equivalentes al nivel de la Educación Secundaria Superior. No obstante, dicha recomendación no se entiende como un requisito insalvable, toda vez que, mediante un enfoque gradual que parte de la exposisión de los fundamentos, podrían tener cabida alumnos sin ese bagaje educativo en sentido estricto.\n\n                                            Syllabus\n                        Módulo 0. Introducción\r\nMódulo 1. El presupuesto familiar y la interpretación de la información económica\r\nMódulo 2. La adopción de decisiones financieras\r\nMódulo 3. El dinero, los medios de pago y los depósitos\r\nMódulo 4. La renta fija y la renta variable\r\nMódulo 5. Fondos de inversión y productos de previsión\r\nMódulo 6. Préstamos\n                                    ", 
    "end_date": "2015-11-12T00:00:00Z", 
    "title": "Claves de Educación Financiera para la Ciudadanía", 
    "price": 0, 
    "instructors": "Francisca Mª García Lopera and José M. Domínguez Martínez", 
    "institution_name": [
        "Universidad de Malaga"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.miriadax.net/web/claves-de-educacion-financiera-2-ed", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Miríada X"
    ], 
    "start_date": "2015-10-01T00:00:00Z"
}