{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Why do the prices of some companies’ stocks seem to move up and down together while others move separately? What does portfolio “diversification” really mean and how important is it? What should the price of a stock be? How can we discover and exploit the relationships between equity prices automatically? We’ll examine these questions, and others, from a computational point of view. You will learn many of the principles and algorithms that hedge funds and investment professionals use to maximize return and reduce risk in equity portfolios.\n\n                                            Syllabus\n                        Portfolio Management and Market MechanicsIn this module, you will understand the course content from a portfolio manager's viewpoint, the incentives for portfolio managers, types of hedge fund, and how to assess fund performance; Also, you will gain insight into market orders, the basic infrastructure of an exchange, and computational components of a hedge fund. Company Worth, Capital Assets Pricing Model and QSTK Software OverviewIn this module, you will learn how to value a company, and an overview of the theory Capital Assets Pricing Model (CAPM), its assumptions, implications and how you can apply it in fund management. Finally, you will learn to install QSTK Software. Manipulating Data in Python and QSTKIn this module, you will learn how to work with financial data, create a portfolio and optimize a portfolio using Python with Numpy library as well as  QSTK and the Pandas library.Efficient Markets Hypothesis and Event Studies, Portfolio Optimization and the Efficient FrontierIn this module, you will learn about information may affect equity prices and company value, understand efficient market hypothesis and how event studies work; Also, you will learn about the inputs and outputs of a portfolio optimizer, correlation and covariance, Mean Variance Optimization, and the Efficient Frontier. Digging into DataWe will go into more detail in this module about how to read an event study. We will also talk about the differences between actual and adjusted \nhistorical price data, and how to detect and fix wrong data. The Fundamental Law, CAPM for PortfoliosIn this module, you will learn the fundamental law of active portfolio management. We will recap CAPM, and extend it for portfolios. Finally, we're going to look at ways that we can leverage the capital assets \npricing model to manage, maybe even reduce market risk. Information Feeds and Technical AnalysisIn this module, we will dive deeper into a few examples of information feeds, and learn about technical analysis, and look at a few example technical indicators. Finally, we are going to learn about Bollinger Bands. Jensen's Alpha, Back Testing and Machine LearningIn this module, we're going to learn about another measure of a fund performance called Jensen's Alpha, and dig deeper into back testing. We will also take a sneak peek at machine learning. \n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Computational Investing, Part I", 
    "price": 0, 
    "instructors": "Tucker Balch", 
    "institution_name": [
        "Georgia Institute of Technology"
    ], 
    "commitment": "8-12 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/computational-investing", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}