{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Ce MOOC est dédié à la comptabilité de gestion et à l’utilisation du tableur. Il permettra de comprendre les liens entre la comptabilité de gestion et la comptabilité générale ainsi que de maîtriser la mise en place de calculs de coûts dans un tableur (Microsoft, Libre office, Google Sheets...).\r\nIl propose d’aborder 4 méthodes de calcul de coûts complémentaires.\n\n                                            Syllabus\n                        Semaine 1 : Introduction et notions clés\r\nCette semaine est consacrée à l’introduction, à la présentation des notions clés de la comptabilité de gestion et l’utilisation du tableur. L’étude de cas fil rouge sert à établir le lien entre la comptabilité générale et la comptabilité de gestion.L’étude de cas fil rouge permet d’une part de revenir sur la notion de compte de résultat et, d’autre part, de caractériser les charges (charges directes/indirectes et variables/fixes).\r\nSemaine 2 : Les coûts complets : méthode des centres d’analyse (1/2)\r\nLa deuxième semaine aborde la première partie du cours consacré aux coûts complets (méthode des centres d’analyse) en proposant une première réflexion sur les centres d’analyse et en expliquant le réseau des coûts.L’étude de cas fil rouge permettra de mettre ces éléments en application en proposant un calcul des coûts aux différents stades d’exploitation (de l’achat des matières premières au coût complet du produit fini et livré au client).\r\nSemaine 3 : Les coûts complets : méthode des centres d’analyse (2/2)\r\nLa troisième semaine termine le thème des coûts complets méthode des centres d’analyse en allant plus loin, avec les notions de stocks et de cas particuliers (produits encours, déchets et rebuts). Une analyse critique de la méthode vient conclure ce thème.Le cas fil rouge, propose de reprendre les données précédentes en rajoutant les stocks, en cours et rebuts.\r\nSemaine 4 : La méthode ABC\r\nLa quatrième semaine est consacrée à l’étude d’une seconde méthode de coût complet, la méthode Activity-Based Cost (Méthode ABC, comptabilité par activité) et à son analyse critique. Le cas fil rouge permettra de souligner la pertinence de cette méthode dans le contexte actuel par rapport à la méthode précédente.\r\nSemaine 5 : Les coûts standards\r\nLa cinquième semaine est consacrée à la gestion budgétaire au travers les coûts standards/prévisionnels, le calcul des écarts sur charges directes et indirectes (méthode des tableaux) et conclu cette thématique par son analyse critique.L’étude de cas fil rouge met en lumière les écarts entre coûts standards et coûts réels et propose une analyse organisée des explications possibles des écarts constatés.\r\nSemaine 6 : Le seuil de rentabilité\r\nLa dernière semaine aborde l’étude d’une méthode de calcul de coût partiel, la méthode du coût variable direct, qui nous permettra de calculer le seuil de rentabilité. Nous en proposerons aussi une analyse critique. Le cas fil rouge est le prétexte de caractériser les charges (les charges fixes versus les charges variables) et de calculer le seuil de rentabilité (en quantité́ ou en chiffre d’affaires).Un chapitre de conclusion est l’occasion de faire le point sur le rôle du contrôleur de gestion dans l’organisation, la place de l’informatique (et plus largement du système d’information de gestion) dans son quotidien.\n                                    ", 
    "end_date": "2016-06-09T00:00:00Z", 
    "title": "Comptabilité de gestion et pratique du tableur", 
    "price": 0, 
    "instructors": "Christine Marsal and Céline Averseng", 
    "institution_name": [
        "Université Montpellier 2"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.fun-mooc.fr/courses/umontpellier/08005/session01/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-04-28T00:00:00Z"
}