{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, participants will learn about the key financial decisions modern corporations face, as well as the alternative methods that can be employed to optimize the value of the firm’s assets. This is part of a Specialization in corporate finance created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).\n\n                                            Syllabus\n                        Alternative Approaches to Making the Optimal Investment DecisionThis week we will define and explain the key approaches to investment evaluation utilized by corporations around the world. We will also consider the way in which sensitivity analysis might be employed so as to provide information to management beyond the simple “invest-don’t-invest” decision. Raising Capital and the Choices Firms FaceIn week 2 we will explain the mechanics behind how firms go to the market via an initial public offering (IPO) to raise new equity capital. We then demonstrate the impact of introducing debt on the returns to shareholders and highlight the different factors that influence debt levels for firms operating in different industries. We conclude by considering how firms make decisions about the optimal level of profits that should be returned to shareholders.Creating Value via Takeovers, Mergers and Corporate RestructuringDuring week 3 we will explain how takeovers and mergers occur in practice, define the key terms used in the analysis of markets for corporate control and then develop an understanding of how changes in control might be objectively assessed via financial analysis. In addition to answering the question “how might we create wealth through growth?” we will also consider how value might be created by getting smaller in our review of the impact of corporate restructuring on shareholder wealth.Alternative Approaches to Risk ManagementIn the final week of this course we define and demonstrate the use of different derivative securities in risk management including; forwards, futures and option contracts. We explain the key drivers of option values and explain how options might be combined to provide different payoff structures. We conclude by considering how risk management might create value for shareholders. \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Corporate Financial Decision-Making for Value Creation", 
    "price": 0, 
    "instructors": "Paul Kofman and Sean Pinder", 
    "institution_name": [
        "University of Melbourne"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/value-creation", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}