{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    This course shows how financial reports provide a wealth of information into the performance of a business, and how they can be used specifically to identify early warning signs of potential future problems.\r\nWe will see that a profitable business may not necessarily be performing well or taking the right steps to build for its future. Just as a doctor conducts a diagnosis of a patient and recommends a course of treatment, we will use simple and yet powerful tools to analyse a business and identify where and how things can be improved.\r\nWhat will I learn?\r\n\r\nHow to evaluate the performance of a business with reference to its financial reports.\r\nHow to conduct financial analysis by integrating information across its balance sheet, income statement and cash flow statement (as opposed to viewing data in isolation).\r\nHow to identify early warning signs of potential financial difficulties in a business and thus be forward-looking in your approach.\r\nHow to assess risks in a business by reference to its financial reports.\r\nHow to identify the assumptions and estimates that are made by managers in constructing their financial reports and assess the implications for interpreting the performance of a business.\r\nHow to measure and interpret the sustainable growth rate of a business and identify implications for its future heath.\r\nHow to distinguish between the income statement and the statement of comprehensive income of a business.\r\nHow to measure the operating cash cycle of a business and assess the implications for the funding needs of the business.\r\nHow to determine if a firm is generating appropriate returns on its assets and for its owners.\r\n\r\nThis course requires approximately 2 - 4 hours of study per week, but can vary depending on the student. This includes watching videos, and taking quizzes and assessments.\r\nIf you pass this course you'll receive a Certificate of Achievement. While this certificate isn't a formal qualification or credit, you can use it to demonstrate your interest in learning about this area to potential employers or educational institutions.\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nManagement\r\nFinance\r\nAccounting\r\nInvestment analysis\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: THE BALANCE SHEET\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: INCOME STATEMENT\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: STATEMENT OF CASH FLOWS\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: ASSESSING FINANCIAL PERFORMANCE\r\n\r\n\r\n\r\n\n                                    ", 
    "end_date": "2016-02-08T00:00:00Z", 
    "title": "Diagnosing the Financial Health of a Business", 
    "price": 0, 
    "instructors": "Guy Ford", 
    "institution_name": [
        "Macquarie Graduate School of Management"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.open2study.com//node/1774", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open2Study"
    ], 
    "start_date": "2016-01-11T00:00:00Z"
}