{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Ce Mooc  vous permettra de mieux comprendre le fonctionnement du système financier afin, en tant que citoyen, de pouvoir le questionner et en tant qu’épargnant de pouvoir l’utiliser en confiance en ayant acquis compétence et indépendance. \n\nL’objectif de ce mooc est :\n\n  vous familiariser avec des notions qui vous permettront de mieux dialoguer avec les intermédiaires financiers comme les banques.\n  avoir une meilleure compréhension des circuits qui permettent de mettre en relation l’épargnant et les entreprises qui ont besoin de notre capital pour investir.\n  devenir familier du fonctionnement réel, au quotidien, des marchés\n  connaître plus précisément le cadre de commercialisation des produits financiers, vos droits et les recours possibles.\n\n\nNous nous attarderons également sur les réflexes à adopter afin de prendre une décision d’investissement éclairée puis de suivre les performances de celle-ci. \nPlus généralement, ce Mooc vous permettra de pénétrer l’organisation et le fonctionnement des marchés financiers au travers desquels circule votre épargne. Ceci afin de vous permettre de mieux comprendre pour mieux décider. \n\nA l’issue de ce Mooc :\n\n  vous serez en mesure d’analyser et de mieux comprendre les offres des intermédiaires financiers comme les banques.\n  vous aurez acquis des compétences pour suivre vos placements en termes de rendement et de risque.\n  vous aurez une meilleure connaissance de l’arsenal juridique qui vous protège.\n  vous aurez une vision d’ensemble des marchés financiers, leur place, leur rôle dans l’économie sera bien plus clair à vos yeux.\n\n\n\n\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Epargner et Investir", 
    "price": 0, 
    "instructors": "Philippe Dupuy", 
    "institution_name": [
        "Grenoble School of Management"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/epargner-et-investir?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-23T00:00:00Z"
}