{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Banking and financial markets encompass the ‘ecosystem’ that (a) channelizes money from those who have it (i.e. savers/investors) to those who need it (i.e. borrowers) and (b) facilitates cross-border flow of funds through exchange of currencies. The ecosystem of banks and financial markets (including Central Banks) has deepened in size, sophistication and complexity over the years. However, in recent times they have also been the subject of abuse, failures and economic distress in several countries resulting in a ‘contagion’ that has concurrently affected several countries around the world!\n\nMore recently, and perhaps more importantly, thanks to the liberalization of most economies, the world has witnessed an exponential increase in the free flow of capital across countries. Banking institutions and financial markets, being the predominant conduit for such free flow of capital across countries, have therefore become even more \"globally interconnected.\" Such a globally interconnected financial system, combined with regulatory systems that are country-specific and hence varying considerably in rigor and implementation, has further compounded the risks and the consequent contagion, as witnessed in the global financial meltdown that was triggered in 2008.\n\nIntroduction to Banking and Financial Markets - I helped learners understand the theory and concepts underlying banking and financial markets, the products and instruments offered and the underlying market mechanisms.\n\nPart II of this economics and finance course will discuss:\n\nThe complex ecosystem of banking and financial market in a global context\n\tThe appending risks in that ecosystem\n\tHow these risks and potential adverse outcomes are addressed and redressed using several risk mitigation techniques and sound regulatory oversight\n\n\n                                    ", 
    "end_date": "2016-10-13T00:00:00Z", 
    "title": "FC201.2x: Introduction to Banking and Financial Markets - II", 
    "price": 0, 
    "instructors": "PC Narayan", 
    "institution_name": [
        "Indian Institute of Management Bangalore"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/introduction-banking-financial-markets-iimbx-fc201-2x", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-08-25T00:00:00Z"
}