{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    For almost 15 years, Acumen has been making long-term debt and equity investments in early-stage enterprises tackling poverty and striving to provide low-income consumers with critical products and services—from affordable education, housing, andhealthcare, to clean energy, safe drinking water, and productivity-enhancing agricultural technologies.\r\nOver time, we have reviewed thousands of business plans and mentored dozens of the world’s best-known social enterprises. We have also learned a lot about what it takes to be successful, including a passionate leadership, humility, and being closely attuned to the unique needs and cultural context of low-income consumers. Financial rigor is another key to creating a sustainable and scalable business model—the organization’s plan for profitably making and selling a product or service.\r\nWe have come across entrepreneurs who have not been sufficiently rigorous in assessing the business case. In some cases, their numbers just didn’t add up—targeted price points couldn’t generate enough income to cover anticipated sales and operating costs. Other times, a business could look profitable at first glance. But on deeper investigation, the business could never scale without continued subsidies because it didn’t generate enough net profit to pay for up-front set up costs, capital depreciation, and overhead.\r\nHaving a clear line of sight on how your social enterprise will reach a profit level required for scaling is a critical part of being a successful social enterprise and achieving the goal of broad social impact and transformation. It’s an issue important at all stages of a new enterprise’s birth and growth (i.e. Blueprint, Validate, Prepare, Scale up phase).\r\nBecause of this, we have teamed up with Dr. Erik Simanis to develop this introductory course on financial modeling for start-up social enterprises. Erik has more than a decade of hands-on experience leading and advising social enterprises and major corporations in Africa, Asia and Latin America.\r\nThe course will show you how to think about and build a basic financial model from the ground up, starting from a single “business unit”—a stand-alone profit-center (like a branch, sales office, or individual franchise) that is replicated when you scale. The course will then explain how to connect the business-unit financials with the “home-office” and its associated costs—these are the supporting operations and administrative structures that have to be put in place in order to scale a business. This approach helps ensure that your product or service can be realistically commercialized, and that the business model is built for scalability from the start.\r\nThis course is valuable for social entrepreneurs of all shapes and sizes, and at all stages of the start-up cycle. It is as applicable to aspiring social entrepreneurs with a great idea, as it is to non-profits preparing to replicate a market-based project, to impact investors evaluating a new business, and to corporate intrapreneurs launching a bottom-of-the-pyramid venture.\r\nSo please join us, and get fluent with the numbers side of social enterprise—a critical skill for all the world’s changemakers!\n\n                                    ", 
    "end_date": "2015-06-18T00:00:00Z", 
    "title": "Financial Sustainability: The Numbers side of Social Enterprise", 
    "price": 0, 
    "instructors": "Dr. Erik Simanis", 
    "institution_name": [
        "+Acumen"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/unit-economics-q2-2015", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2015-05-14T00:00:00Z"
}