{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/financialmarketszh\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/financialmarketszh-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    financialmarketszh-001\n                                                                    financialmarketszh-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    (This is a translated version of Financial Markets in Chinese. Please click here to visit the original course in English)金融机构是文明社会的重要支柱之一。它们为创业及投资活动提供支持和风险管理。想要预测金融机构当今的行为及他们在信息时代的发展趋势，我们必须对其业务运作有所了解。本课程致力于帮助学生掌握：金融学理论、金融业的发展历程、金融机构（例如银行、保险公司、证券公司、期货公司及其他衍生品市场）的优势与缺陷以及这些机构的发展前景。【 此版本是Coursera首次尝试推出的中文翻译版。课程视频为英文原版附中文字幕，课程页面和习题已译成中文。同时，课程论坛开放了中文支持。此版本仍在测试中，欢迎大家批评指正。】\n\n                                            Syllabus\n                        第1周——财务和风险管理的基本原则来自席勒（Shiller）教授的第1周介绍投资组合多样化和支持性金融机构（第1部分和第2部分）保险，风险管理制度的原型：机遇与挑战客座嘉宾：格林伯格（Maurice \"Hank\" Greenberg）第2周——有效市场与行为金融来自席勒（Shiller）教授的第2周介绍有效市场行为金融以及心理学的作用客座嘉宾：大卫·斯文森 （David Swensen） 第3周——债务与股票来自席勒（Shiller）教授的第3周介绍债务理论，其作用以及期限结构股票客座嘉宾：史美伦（Laura cha）第4周——房地产，监管及企业来自席勒（Shiller）教授的第4周介绍房地产不当操作，危机，监管和自律客座嘉宾：卡尔·伊坎（Carl Icahn）第5周——远期、期货和期权市场来自席勒（Shiller）教授的第5周介绍远期和期货市场期权市场客座嘉宾：安德鲁·雷德利夫（Andrew Redleaf ）第6周——货币政策来自席勒（Shiller）教授的第6周介绍银行货币政策客座嘉宾：拉里·萨默斯（Larry Summers）第7周——金融基础设施的关键因素来自席勒（Shiller）教授的第7周介绍投资银行 职业投资经理和他们的影响证券交易，经纪人，经销商，票据交易所 苏世民（Schwarzman）先生的演讲 第8周——金融及其更广义的公共目标来自席勒（Shiller）教授的第8周介绍公共和非盈利金融 在金融资本主义的世界里寻找你的目标来自席勒（Shiller）教授的总结\n                                    ", 
    "end_date": "2015-04-06T00:00:00Z", 
    "title": "Financial Markets 金融市场（中文版）", 
    "price": 0, 
    "instructors": "Robert Shiller", 
    "institution_name": [
        "Yale University"
    ], 
    "commitment": "6-12 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/course/financialmarketszh", 
    "duration": "8 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-02-09T00:00:00Z"
}