{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    The dramatic events of the financial crisis in the late 2000s transformed the UK financial services industry. Long established institutions went out of business, others were forced into takeovers and only the intervention of governments worldwide - courtesy of eye-watering sized financial recovery packages - prevented the banking industry from implosion.\n\nNow nearly 10 years on from the crisis it’s time to take stock and examine how the industry looks today - how both its structure, the way it operates and the way it is regulated have changed. Most importantly how is the industry now working for the consumer? What are the products? How competitive is the industry? Is regulation working effectively to protect consumers in the financial market place? And where can consumers go to get help and guidance in a changing environment where rules about product selling are changing and where greater freedoms can be exercised with pension savings?\n\nThis facilitated 4-week course guides you through the UK financial market place.\n\n\n  We start with a rapid review of the history of the industry leading up to the financial crisis that transformed it.\n  We examine the institutions that comprise the industry and the issues they are currently grappling with.\n  We walk down the financial supermarket aisles and see what’s changing with the products on offer.\n  And we examine how the industry is now regulated and how this regulation and the guidance provided by various agencies can help consumers make the right, informed, choices when transacting in the financial market place.\n\n\nAt the end of the course you will have gained a full insight into how the financial services industry operates and how you can transact business with knowledge and confidence.\n\nDevelop fundamental business and finance skills\n\nThis course has been developed by The Open University Business School – a pioneering institution that is triple accredited by AMBA, EQUIS and AACSB.\n\nIt is one of eight from The Open University, designed to help you gain fundamental business and financial skills, including communication, networking, relationship building, project management, personal financial planning and management, investment and financial services.\n\nYou can complete this course as part of one of these two programs:\n\nFinance Fundamentals: four courses, which will give you valuable skills to manage finances at home and at work, and enable you to earn a FutureLearn Award.\n\nBusiness and Finance Fundamentals: eight courses; holders of FutureLearn Certificates of Achievement for all eight courses can earn 30 UK credits towards The Open University Business School’s BA in Business Management by passing a linked Open University assessment module (requiring separate OU registration and fee).\n\nThe True Potential Centre for the Public Understanding of Finance (True Potential PUFin)\n\nThis course has been adapted from original material created by The Open University’s True Potential Centre for the Public Understanding of Finance, and was made possible thanks to the generous support of True Potential LLP.\n\nFor further information about registration, the final assessment course and the BA in Business Management, visit the Open University website.\n\n\n                                    ", 
    "end_date": "2016-12-19T00:00:00Z", 
    "title": "Finance Fundamentals: Financial Services after the Banking Crisis", 
    "price": 0, 
    "instructors": "Martin Upton", 
    "institution_name": [
        "+Acumen", 
        "The Open University"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/financial-services-after-the-banking-crisis?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-11-21T00:00:00Z"
}