{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Do you work in finance or interact with finance professionals? Is it necessary to speak, write or understand English in your career? Follow the authentic characters in this course as they work through common business situations in finance and economics. Learn from your successes and failure, and think critically about your own communication options. After taking this course, you will be able to read and create efficient e-mails, reports, and impactful presentations with words and phrases commonly used in finance and economics. Communicate clearly under pressure utilizing recently learned strategies, and obtain immediate feedback about the efficiency of your business communication skills in English from other finance professionals around the world! Gain the English communication skills that you desire and that global managers expect.\n\n¿Trabaja usted en las finanzas o interactuar con profesionales de las finanzas? ¿Es necesario hablar, escribir o entender inglés en su profesión? Siga los personajes auténticos en este curso a medida que trabajan a través de situaciones de negocios comunes en las finanzas y las económicas economía. Aprenda de sus éxitos y fracasos, y piense críticamente sobre sus propias opciones de comunicación de Ud. Después de tomar este curso, usted será capaz de leer y crear mensajes de correo electrónico eficaces, informes, y presentaciones impactantes, con las palabras y frases del uso común en las finanzas y las económicas economía. ¡Comuniquese claramente bajo presión utilizando estrategias recién aprendidas, y obtenga información inmediata sobre la eficacia de sus habilidades de comunicación de negocios en inglés por parte de otros profesionales de las finanzas de todo el mundo! Obtenga las habilidades de comunicación en inglés que Ud. desee y que los gerentes globales esperan.\n\n                                            Syllabus\n                        BudgetingMientras hacemos presupuestos, Catherine le pide a los gerentes que mantengan los gastos como están. Jake, mientras tanto, ignora lo pedido ya que él cree que el puede aumentar las ventas invirtiendo más en promociones. ¿Cómo crees que Catherine maneja esta situación? En esta semana, veras a Catherine y a Jake hablar sobre este presupuesto.  Observaras como ella usa preguntas para ayudar a Jake lograr los objetivos que tienen los dos. Después de completar esta semana, serás capaz formular preguntas que lo lleven a tener conversaciones honestas y producir resultados positivo. Ahora en inglés: While in the budgeting process, Catherine asks managers to keep their expenses flat. Jake, however, ignores this request believing he can increase sales by spending more on promotions. How do you think Catherine handles this situation? In this week, you’ll watch Catherine and Jake talk about his budget. You’ll observe how she uses questions to help Jake think of ways to meet both of their needs. After completing this week, you’ll be able to form questions that lead to open and honest conversations and produce positive results.ForecastingYa conseguiste la información, hiciste el análisis y los pronósticos. Ahora, tendrás que explicar tus conclusiones. Después de completar esta semana, estarás más preparado para esta dificil tarea. Practicarás el lenguaje adecuado para describir una historia basada en la información presentada a través de tablas y gráficos, y usaras  estrategias para mantener la calma y evitar estar a la defensiva cuando alguien te desafía. Con Catherine como ejemplo en El reto, tendrás un buen comienzo. Ahora en inglés: You’ve collected the data, done the analysis, made the forecasts. Now, you must be able to clearly explain your conclusions. After completing this week, you’ll be more prepared for this difficult task. You’ll practice useful language for describing the whole story represented in your charts and graphs and use strategies for staying calm and avoiding defensiveness when challenged. With Catherine as a model in El reto, you’ll be off to a good start.PurchasingAprovar gastos grandes significa muchas horas de negociación, persuasión, y concesión. Esto puede ser un proceso doloroso, pero no necesita serlo. Sigue un proceso el cual te quitara el dolor. Aprende el lenguaje y el proceso exitoso para negociar soluciones donde todos estén de acuerdo.  Después de completar esta semana, serás capaz de seguir un proceso donde podrás usar el lenguaje adecuado para negociar situaciones beneficiosas para todos. También podrás identificar situaciones éticas complicadas donde tu integridad brillará. Ahora en inglés: Approving a large expenditure means many hours of giving and taking, of persuading and conceding. This can be a painful process, but it doesn’t need to be. Follow a process that will take the pain away. Learn the language and the process for successfully negotiating solutions where everyone is happy. After completing this week, you’ll be able to follow a process and use the language for negotiating win-win solutions. You’ll also be able to recognize tricky ethical situations where your integrity can shine.Auditing“¿Que tipo de documentos necesitas?” “Disculpa, pero no tengo tiempo.” Este tipo de frases son común al prepararse para una auditoría. ¿Tienes superpoderes para hacer que todos hagan lo que les pides? Aunque no tengas superpoderes, definitivamente tienes el poder de dirigir a otros.  Después de completar esta semana, serás capaz de identificar los 5 tipos de poder, influenciar interacciones positivas, y encontrar palabras que lleven comuniquen de una forma efectiva lo que deseas decir. Ahora en inglés: “What documentation do you need?”  “I’m sorry, but I don’t have time.” These statements are commonly heard while preparing for an audit. Do you have to have super powers to get everyone to just do what you ask? Although you may not have super powers, you definitely have the power to lead others. After completing this week, you’ll be able to recognize 5 types of power, influence positive interactions, and find words that carry the tone of your intended meaning. Economics¡Tantas tendencias por seguir y tan poco tiempo! Después de completar esta semana, serás capaz de usar estrategias de lectura para encontrar y comprender rápidamente información y el vocabulario necesario--hasta de textos difíciles. Ahora en inglés: So many trends to follow, so little time. After completing this week, you’ll be able to use reading strategies for quickly finding and comprehending the information and vocabulary you need--even from difficult texts.ReviewEn esta semana, revisaremos y practicaremos conceptos clave y el lenguaje aprendido durante el curso. Veremos videos, comprobaremos tus conocimientos y comprensión con el apoyo de nuestras hojas de revisión. Ahora en inglés: In this week, you’ll review and practice key concepts and language from the course. Watch the videos, check your knowledge and understanding with the support of review worksheet.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Inglés Empresarial: Finanza y Economía", 
    "price": 0, 
    "instructors": "Jenny Young, Andrea Haraway and Wanda Huber", 
    "institution_name": [
        "Arizona State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/ingles-empresarial-finanzas-economia", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}