{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    En este curso estudiaremos el objetivo principal de las finanzas, la importancia en la creación de valor y mantenerlo a través de un uso eficiente de los recursos financieros.\nAdemás, incluiremos algunas herramientas básicas que te permitirán crear un plan financiero con el que podrás establecer objetivos y metas claras, identificar qué factores pueden afectar el rumbo de tu empresa o idea de negocio y saber si estás aplicando los recursos de una manera eficiente.\nAl término del curso aplicarás herramientas básicas de análisis, control y evaluación de información financiera para una adecuada gestión de negocio.\n\n                                            Syllabus\n                        Información FinancieraEn este módulo, analizarás qué es la información financiera, de dónde proviene, para qué sirve, cómo debe utilizarse para tomar decisiones y quiénes deben utilizarla. Estados Financieros BásicosEn este módulo, revisarás cómo se obtiene la información financiera en los negocios, por lo que es momento de conocer los estados financieros que debes analizar para tomar decisiones que afectarán el futuro de la empresa; se analizarán, así, los cuatro estados financieros básicos.Análisis FinancieroEn módulo 3, revisarás la importancia de la información financiera y cuáles son los estados financieros básicos que se deben elaborar para tomar el control del negocio. Aprenderás las herramientas fundamentales para analizar esta información financiera y tomar las mejores decisiones para el éxito del negocio.Importancia de la Planificación FinancieraEn el módulo 4, identificarás la importancia de la planificación financiera empresarial. Herramientas para el Control FinancieroLas herramientas para el control financiero son la mejor forma de asegurar el éxito de un negocio; es mantener un estricto control financiero. En este módulo, analizarás algunas técnicas básicas para este propósito.Gestión Financiera a Corto PlazoEn el módulo 6, identificarás cómo cuidar el recurso más importante para la administración financiera: el capital de trabajo. Al concluir el módulo, te sentirás aún más preparado para tomar el control del negocio.Gestión Financiera a Largo PlazoEn el módulo 7, revisarás que la visión prospectiva es clave para orientar el destino de los negocios. Para que los negocios crezcan, se necesita planear la forma en que deberán hacerlo y los recursos financieros que se requerirán.Gestión de la CarteraEn el módulo 8, explorarás la metodología de las 5 C's que te ayudará a mantener un sano ejercicio de las cuentas por cobrar.Creación de EmpresasSeguramente ahora tienes una visión clara sobre la importancia de la administración financiera y su repercusión para lograr el éxito del negocio. En este módulo, revisarás algunos conceptos básicos para la creación de empresas.Business Start-UpHabiendo concluido el curso, es momento de aplicar lo aprendido. A continuación, tendrás la oportunidad de elaborar los estados financieros y analizarlos con base en los resultados de razones financieras y el EVA.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Introducción a las Finanzas", 
    "price": 0, 
    "instructors": "Daniel Béjar", 
    "institution_name": [
        "Universidad Nacional Autónoma de México"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/estrategia-financiera", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}