{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso proporciona una breve introducción a los fundamentos de las finanzas. Puedes aplicar estas habilidades en un reto empresarial real como parte de la Programa Especializado de Fundamentos Empresariales de Wharton.\n\n                                            Syllabus\n                        Semana 1: Valor Tiempo del Dinero¡Te doy la bienvenida a Finanzas Corporativas! En este primer módulo conocerás uno de los conceptos fundamentales más importantes en Finanzas, el valor tiempo del dinero. Antes de sumergirte en las vídeo lecciones, te animo a que eches un vistazo unas breves lecturas que te ayudará en  el curso. Especialmente, echa un vistazo a “Visión Global de la Motivación del Curso” para obtener motivación adicional y contexto para el curso, “ Resumen del Valor Tiempo del Dinero”, para conseguir motivación y contexto sobre nuestro primer tema, e “Introducción de Respuestas en Problemas de Cuestionarios”. Este último es especialmente importante para evitar confusión con los grupos de problemas. Después, dirígete a las vídeo lecciones y ¡comienza a aprender Finanzas!Semana 2En este módulo, concluiremos el  tema del Valor Tiempo del Dinero con un debate sobre la inflación antes de avanzar al segundo tema, Tipo de Interés, y presentar nuestro tercer tema, Análisis de Flujo de Fondos Descontados. Al final de este módulo, te sentirás cómodo descontando y componiendo flujos de efectivo arbitrarios para valorar diferentes reclamaciones y tomar mejores decisiones financieras.Semana 3Este módulo continua con nuestra discusión sobre el análisis de flujo de fondos descontados en forma de un caso de presupuesto del capital. ( Puede que quieras descargar o ver el documento Excel que uso en las lecciones, “Tablet Case Spreadsheet.xlsx,” pero que no es necesario para comprender el material). Al final de este módulo  deberías sentirte cómodo valorando reclamaciones y tomando decisiones financieras en las que el tiempo del flujo de efectivo y de la composición del interés es arbitraria (p.e. anual,  trimestral, mensual, etc.) Trabajando los problemas, también dominarás la toma de decisiones financiera en el mundo real relacionada con los ahorros de jubilación, financiación y refinanciación de viviendas, arrendamiento de coches y otros escenarios.Semana 4Este módulo cierra la discusión sobre el análisis de flujo de fondos descontados y clausura el curso con un debate sobre el retorno de inversión. Al final de este módulo, manejarás la noción de flujo de efectivo libre y la  habilidad de aplicar un conjunto de impulsores de predicciones para proyectar flujos de efectivo libre en el futuro. Estos son algunos de los elementos de un modelo financiero básico, que usaremos para adoptar una decisión sobre el proyecto y para analizar las hipótesis detrás de nuestra valoración.\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Introducción a las Finanzas Corporativas", 
    "price": 0, 
    "instructors": "Michael Roberts", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/wharton-finanzas-corporativas", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}