{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Domina las habilidades técnicas necesarias para analizar estados financieros y declaraciones. Después podrás aplicar estas habilidades a un reto empresarial del mundo real como parte de la Programa Especializado de Fundamentos Empresariales de Wharton.\n\n                                            Syllabus\n                        Semana 1: Introducción y Hoja de BalancePara aprender una lengua extranjera como la Contaduría, se necesita un poco de práctica de las bases fundamentales (gramática, sintaxis, expresiones idiomáticas, etc.). Este material es absolutamente esencial para poder leer y entender los libros escritos en el idioma (en nuestro caso, estados financieros). Esta semana, iniciaremos construyendo estas bases. Comenzaremos con una vista general de los reportes financieros. ¿Qué tipos de reportes se necesitan? ¿Quién hace las reglas? ¿Quién las hace valer? Después cubriremos la ecuación de las hojas de balance y definiremos/discutiremos activos, pasivos y capital de los accionistas. Introduciremos la contabilidad de débito-crédito y practicaremos mucho en traducir transacciones a débitos y créditos. Finalmente, introduciremos el caso de una compañía naciente para que ofrezcan su entendimiento de todos los pasos necesarios para registrar desde la primera transacción de un nuevo negocio hasta el primer juego de estados financieros.Semana 2: Contabilidad Devengada y Estado de ResultadosComenzaremos con una discusión acerca de la contaduría de acumulación y como afecta el reconocimiento de las cuentas de estados de ingreso: Ganancias y Gastos. Luego, cubriremos las entradas de ajuste, las cuales se necesitan para preparar los libros internos de los estados financieros futuros. Finalmente, discutiremos las entradas de cierre y la preparación de la hoja de balance y del estado de ingreso. En cada etapa, continuaremos trabajando en el caso de la nueva compañía. Y si no están cansados hasta el hastío de las entradas en su diario, entonces ¡no he hecho bien mi trabajo!Semana 3: Flujos de Efectivo¡El efectivo es el Rey! Comenzaremos con la clasificación de los flujos de efectivo divididos en operaciones, inversión y actividades financieras. Luego, trabajaremos en preparar y analizar los Estados de flujo de efectivo. Abarcaremos el caso de la nueva compañía preparando y analizando sus estados de flujo de efectivo. Finalmente, discutiremos las diferencias entre Ganancias, Efectivo de Operaciones, EBITDA y Flujo de efectivo libre.Semana 4: Análisis de índicesTendremos nuestro examen final este semana. Debido a ello, cubriré análisis de (), que no involucra ningún “nuevo” material. Mientras definimos y discutimos un número de índices, básicamente todos involucrarán dividir un número de contaduría entre otro. Sin embargo, el análisis de dichos índices significará que involucraremos un entendimiento más profundo de las cuentas de hojas de balance y estados de ingreso. De tal modo que, los videos de Análisis de índices ayudarán a que tengan una buena revisión del material, que al mismo tiempo les ayudará a prepararse para su examen. Sin embargo, no habrá preguntas acerca del análisis de rango en su examen. La única cosa pendiente después del examen es impresionar a su familia, amigos y compañeros de trabajo con su basto conocimiento de Contaduría financiera.\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Introducción a la Contabilidad Financiera", 
    "price": 0, 
    "instructors": "Brian Bushee", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/wharton-contabilidad-financiera", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}