{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Qu’est-ce que l’impact investing ? Quelles entreprises l’impact investing a-t-il vocation à financer ? Qui sont les financeurs « à impact » ? Peut-on en dresser une typologie ? Quelles solutions de financement proposent-ils ? Quel sont les ingrédients d’un écosystème favorable à l’impact investing, au nord comme au sud ? \nVoici les questions auxquelles ce 1er  MOOC de notre série « L’impact investing, la finance qui change le monde » cherche à apporter des réponses. \n\nCe 1er MOOC, Comprendre les fondamentaux, est incontournable pour ceux d’entre vous qui découvrent ces notions, mais il sera aussi très utile à tous ceux qui n’ont pas de connaissances structurées sur le sujet.    \n\nDans le 1er module, nous nous intéresserons aux entreprises cibles de l’impact investing, les entreprises sociales,  dont nous chercherons à appréhender les contours, puis nous poserons une définition de l’impact investing. Dans le 2ème module, nous nous pencherons sur les acteurs de l’impact investing côté investisseurs et en dresserons un panorama, en intégrant la question des outils de financement disponibles. Puis, dans le 3ème module,  nous nous poserons la question du rôle des politiques publiques et du cadre réglementaire dans le développement de l’impact investing, en faisant un zoom sur la Grande-Bretagne, pays le plus avancé en la matière, et sur la France. Enfin, le 4ème module nous permettra de nous intéresser à l’écosystème de l’impact investing dans les pays du Sud, en cherchant à en cerner les spécificités, tant au plan de l’entrepreneuriat que du rôle joué par les acteurs traditionnels de l’aide au développement.\n\nA la fin de ce MOOC, vous pourrez :\n•\tDécrire ce qu’est l’impact investing, ses acteurs et son écosystème, au Nord comme au Sud\n•\tFaire une veille active sur les évolutions du secteur\n•\tDialoguer avec les acteurs de l’impact investing en comprenant les enjeux des différents acteurs \n•\tParticiper à la promotion de l’impact investing\n\n                                            Syllabus\n                        Entrepreneuriat social et impact investingQui sont ces entreprises sociales auxquelles l'impact investing s'intéresse ? Qu'est-ce que l'impact investing ? Comment différencier impact investing et ISR ? Impact investing et philanthropie ?Acteurs de l'impact investing au NordQui sont les financeurs des entreprises sociales ? Quel potentiel de financement représentent-ils ? Que peuvent-ils apporter ? Qu'attendent-ils des entreprises sociales ?Écosystème pour développer l'impact investing au NordPourquoi et comment l’Impact investing se développe-t-il avec succès en Angletere depuis le début des années 2000 ? Quelles sont les conditions qui doivent être réunies pour que l’impact investing se développe en France ? Quels sont les atouts, mais aussi les lacunes de notre « écosystème » national ?Acteurs et écosystème de l'impact investing au SudDans quel contexte l’entrepreneuriat en général et donc l’entrepreneuriat social, se développe-t-il dans les pays du Sud ? Quelles sont les limites de l’aide au développement pour répondre aux immenses besoins sociaux et environnementaux de ces pays et quel pourrait être le rôle des entrepreneurs sociaux pour les dépasser ? Quel est l’état des lieux de l’impact investing dans les pays du Sud ? Quels sont les obstacles à lever pour en faire un outil de développement à la mesure des défis ?\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "L'impact investing : comprendre les fondamentaux", 
    "price": 0, 
    "instructors": "Thierry Sibieude", 
    "institution_name": [
        "ESSEC Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/investing-fondamentaux", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}