{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    La finance est omniprésente et les décisions financières nous concernent tous. Tout individu est un jour ou l’autre amené à épargner ou emprunter. La sélection des projets d’investissements et leur financement sont des questions cruciales pour les entrepreneurs ou managers. D’une manière plus large, les décisions prises par le monde politique en matières financières influencent directement ou indirectement le quotidien des citoyens. Les récentes crises financières ont pu nous montrer à quel point il peut être primordial de comprendre les fondamentaux de la finance. Sans un minimum d’éducation financière, il est difficile d’appréhender le fonctionnement du monde dans lequel nous évoluons. Ce cours introductif vous propose un cadre conceptuel et des outils pour vous aider à prendre des décisions financières judicieuses, avec un focus particulier sur les opérations financières courantes.   \n \nAu terme de ce cours, vous serez capable de :\n\nDécrire les principes fondamentaux du raisonnement financier : absence d’opportunités d’arbitrage dans un marché concurrentiel, intégration de la dimension temporelle et du risque dans la décision financière ;\n\tCalculer des valeurs actuelles ou futures, de flux ou de séquence de flux ;\n\tAppliquer les techniques de l’évaluation actuarielle aux opérations financières courantes (de type épargne ou emprunt) et aux principaux actifs financiers (actions et obligations) ;\n\tUtiliser les différents outils de sélection d’investissement pour des projets en entreprise ;\n\tAnalyser la problématique de la décision d’investissement, en tenant compte du lien entre rendement attendu et risque ;\n\tDéterminer le taux de rendement qu’une entreprise doit utiliser lorsqu’elle doit prendre une décision d’investissement et utiliser ce taux pour calculer la valeur générée par un projet ;\n\tSuivre des cours de finance plus avancés (finance d’entreprise, gestion de portefeuille, marchés financiers, finance internationale, produits dérivés, etc.).\nFinancial decisions impact all of us. As individuals we earn money, spend it, borrow it and at times save and invest it. At work, for managers or entrepreneurs, financial decisions are crucial. In the public sector , financial decisions made by politicians affect us every day. Without minimal financial literacy, it is very difficult to succeed, especially in light of the recent financial crises. This introductory course provides a framework and tools to help you make sound financial decisions, with a particular focus on common financial operations.\n\nAt the end of this course, you will be able to:\n\nDescribe the basics of financial reasoning: absence of arbitrage opportunity in a competitive market, decision-making based on both time and risk ;\n\tCalculate present or future values of cash-flows or sequences of cash-flows ;\n\tApply the principles of valuation to value common financial operations (savings or loans) and main financial assets (stocks and bonds);\n\tUse different criteria to select investment projects in firms ; \n\tAnalyze capital budgeting problems, involving the relationship between expected return and risk ;\n\tDetermine the return a firm should use when facing an investment decision, and use this return to compute the value generated by a project ; \n\tTake more advanced courses in finance (corporate finance, portfolio management, financial markets, international finance, derivative securities, etc.). \n\n\n\n Ce cours est enseigné en français. This course is taught in French.\n\n                                    ", 
    "end_date": "2016-05-03T00:00:00Z", 
    "title": "Louv9x: Les principes de la finance", 
    "price": 0, 
    "instructors": "Isabelle Platten and Catherine D'Hondt", 
    "institution_name": [
        "Université catholique de Louvain"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edx.org/course/les-principes-de-la-finance-louvainx-louv9x-0", 
    "duration": "13 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-02-02T00:00:00Z"
}