{
    "selfpaced": true, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Learn the key facets of cost analysis. Topics will include types of costs, cost behavior, costing system design, activity-based costing, and cost-volume-profit analysis.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\n                                            Syllabus\n                        Course Overview and Introduction to Managerial AccountingIn this module, you will become familiar with the course, your instructor, your classmates, and our learning environment. Then, you will be introduced to Managerial Accounting and Costing Concepts.Costing Systems I - Elements and DesignOrganizations can organize cost information however best suits their decisions. In this module, we introduce the role of costing systems, identify some example systems and settings in which they are most useful, and explore how accounting for overhead costs influences the value of cost information.Costing Systems II - Activity-Based CostingActivity-based costing systems adopt a more refined view of the organization, and can increase the accuracy of cost information. In this module, we introduce the fundamentals of activity-based costing systems, identify related advantages and disadvantages, and demonstrate how such systems are implemented using an in-depth example.Cost-Volume-Profit (CVP) AnalysisCost-volume-profit (CVP) analysis is the tool that managers can use to better understand the answers to \"what-if\" questions in order to make better decisions for their companies. In this module you will explore the power of CVP analysis.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Managerial Accounting: Cost Behaviors, Systems, and Analysis", 
    "price": 0, 
    "instructors": "Gregory Davis", 
    "institution_name": [
        "University of Illinois at Urbana-Champaign"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/managerial-accounting", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}