{
    "selfpaced": true, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    \r\nStocks and bonds have always been a critical part of any investment portfolio, but what do investors actually get in exchange for their investment? Why do publicly traded stocks and bonds have value?\r\nThis course will present an overview of stocks and bonds, with a focus on the finance fundamentals behind these instruments. We’ll start out with an overview of the bond market, paying special attention to corporate and municipal bonds. Next, we’ll review interest rates and their impact on the valuation of treasury bonds. Then we’ll take a look at the fundamentals of the stock market, and finally we’ll dive into an analysis of how to make smart decisions as an investor.\r\nSince the course is self-paced, you can take as much time as you need. Short lecture videos introduce the concepts in manageable chunks. Following each video are practice exercises to help cement your understanding of the key concepts. Finally, a recorded panel discussion featuring a Nobel Prize-winning economist will allow us to delve into the finer details of asset management.\r\nWhether you’re an experienced shareholder, a novice investor, or simply interested in how our financial markets work, join us as we study the financial principles behind stocks and bonds.\r\n\r\nPREREQUISITES\r\nThere are no formal prerequisites, but students will ideally have had some exposure to college-level courses in economics or finance, even if that exposure was not especially recent or extensive. An understanding of the following key concepts will be helpful:\r\n\r\ndiversified stock portfolio\r\ninterest rates\r\ninflation\r\npresent value formula\r\nstatistical concepts like mean, median, standard deviation, and percentiles\r\n\r\n\n\n                                    ", 
    "end_date": null, 
    "title": "Stocks and Bonds: Risks and Returns", 
    "price": 0, 
    "instructors": "Joshua Rauh", 
    "institution_name": [
        "Stanford Graduate School of Business", 
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://class.stanford.edu/courses/GSB/StocksBonds/SelfPaced/about", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Stanford OpenEdx"
    ], 
    "start_date": "2014-10-13T00:00:00Z"
}