{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    In this eight-week course, you will learn the financial concepts behind sound retirement plan investment and pension fund management. Course participants will become more informed decision makers about their own portfolios, and be equipped to evaluate economic policy discussions that surround public pensions. The course begins with the principles of financial economics, such as the distribution of outcomes when investing in stocks, bonds, or annuities. These serve as the building blocks for an understanding of different retirement strategies that can help you improve your asset allocation. Finally, the course applies these principles to government programs and policies.\r\nThe Finance of Retirement and Pensions will culminate in an interactive symposium about the challenges of U.S. pension systems. Held in January 2014 at Stanford Graduate School of Business, the event will feature representatives of the MOOC teams with the five most promising ideas for pension reform, who will present their proposals to a distinguished panel of faculty and experts in finance and public policy. Expenses will be covered by Stanford Graduate School of Business and the Hoover Institution.\r\n \r\nRecommended Background:\r\n\r\n\r\nIdeally, you will have had some exposure to economics or finance in the form of college-level courses, even if that exposure is not especially recent or extensive\r\n\r\n\r\nYou’ll want to understand the value of a diversified stock portfolio, interest rates, and inflation\r\n\r\n\r\nYou’ll be able to follow along best if you understand the present value formula, as well as statistical concepts like means, medians, standard deviations, and percentiles\r\n\r\n\r\nWe will provide review sheets about formulas for the present value of a perpetuity, a growing perpetuity, and an annuity, and suggest that you review a few concepts about probability\r\n\r\n\r\nWe will be doing calculations in Microsoft Excel as part of the coursework\r\n\r\n\n\n                                    ", 
    "end_date": "2013-12-09T00:00:00Z", 
    "title": "The Finance of Retirement & Pensions", 
    "price": 0, 
    "instructors": "Joshua Rauh", 
    "institution_name": [
        "Stanford Graduate School of Business"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/rauh-finance", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2013-10-14T00:00:00Z"
}