{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    All organisations - whether multinationals, small and medium-sized enterprises, or not-for-profits - need money to be sustainable, and achieve their vision and objectives.\n\nThis award-winning free online course gives you the opportunity to delve into the exciting world of business, and gain the skills that are required by employers for a successful career in accountancy, finance and business.\n\n\nLearn from the real life experiences of business professionals\n\nOver four weeks, you will get insights from business professionals and entrepreneurs at leading global brands including adidas, PwC, FitFlop, Cobra Beer, Ryecroft Glenton, ICAEW, Save the Children, Wow Company, Tea Huggers, Tesco, M&amp;S and NHS.\n\nBy the end of the course, you will be able to:\n\n\n  demonstrate your commercial awareness to employers;\n  have confidence in dealing with financial matters;\n  appreciate the impact of cash flow on a business;\n  and understand the strategies used for growing a business.\n\n \n\n\nGain the business, finance and accounting skills needed to succeed\n\nLed by Professor Peter Moizer, Dean of the Leeds University Business School, the course will show you a creative and innovative approach to developing the business, finance and accounting skills needed to succeed.\n\nContent will be delivered through videos, animations, interviews, hints and tips, quizzes and discussions with other learners around the world.\n\nThe course will enable you to map your skills and gain evidence of your experience, to create a comprehensive record of learning and develop your CV.\n\nYou will also be able to buy a Statement of Participation, or sit an optional examination to achieve a Statement of Attainment, to enhance your career prospects.\n\n\n\n  What business professionals say\n  “Go into it, open your eyes, gain an understanding, absorb information and then you will be more educated and more informed as to the opportunities that are out there.” - Judith, adidas.\n\n\nYou can find out more about this course in two posts on the FutureLearn blog: Peter Moizer discusses why managing your company’s finances is key, while Alice Shepherd talks about the lasting impact of money problems in business.\n\n\n                                    ", 
    "end_date": "2016-04-04T00:00:00Z", 
    "title": "The Importance of Money in Business", 
    "price": 0, 
    "instructors": "Alice Shepherd and Peter Moizer", 
    "institution_name": [
        "University of Leeds"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.futurelearn.com/courses/money-in-business?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-03-07T00:00:00Z"
}