{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Курс раскрывает секреты инвестирования на рынке акций с позиции частного (миноритарного) инвестора. Слушатель курса погружается в сопоставление акций по инвестиционной привлекательности, в особенности работы финансовых аналитиков (брокерских и инвестиционных компаний), в интересный мир построения инвестиционных стратегий на базе фундаментального анализа.\n\nВы освоите профессиональную терминологию финансовых аналитиков и консультантов, поймете, как выставляются рекомендации «купить», «продать», «держать», почему отчеты аналитиков могут вводить в заблуждение.\n\nВ результате прохождения курса вы \n- получите навыки самостоятельного принятия  среднесрочных инвестиционных  решений на базе общедоступной информации на рынке;\n- научитесь ранжировать акции по инвестиционной привлекательности и выбирать для себя адекватную инвестиционную стратегию (на базе расчета дивидендной и общей доходности (TSR) инвестирования в акции, общего риска, как стандартного отклонения доходности по акции и  изучения финансовой и нефинансовой информации по компании, ликвидности ее акций;\n- поймете значимость учета  качества корпоративного управления и странового риска;\n- сумеете правильно воспользоваться фундаментальным анализом с учетом специфики функционирования российского фондового рынка, налоговой нагрузки на инвестора, биржевых (транзакционных) издержек.\n\n                                            Syllabus\n                        ВведениеДобро пожаловать в третий курс специализации! В этом модуле Вы найдете основную вводную информацию о курсе, которая поможет вам сориентироваться в нем и понять, какие знания Вы можете получить в ходе его прохождения.Рынок акций: оцениваем выгоды и доходность.Здравствуйте, уважаемые слушатели! Мы рады приветствовать Вас на нашем курсе. На первой неделе курса  Вы научитесь сопоставлять доходность акций с другими финансовыми инструментами, узнаете, кто такие \"быки\" и \"медведи\" и какую инвестиционную позицию надо занимать на растущем и падающем рынках. Вам станет понятно, почему отчеты финансовых аналитиков могут быть \"кривые\". Вы сумеете разобраться в  правах держателей обыкновенных и привилегированных акций  и принимаемых ими рисках. Вы научитесь сопоставлять акции по риску (волатильности), по дивидендной и общей доходности. Сумеете рассчитать чистую доходность с учетом налогов и комиссионных биржи и брокера. На этой неделе предусмотрено 8 видеолекций. По итогам недели вам будет доступен тренировочный тест, по которому мы готовы дать комментарии на форуме. Неделя заканчивается контрольным заданием (тесты+задачи). Желаем вам успехов в освоении материала!Что лежит в основе принятия инвестиционных решений на рынке акций.Дорогие слушатели! Вторая неделя нашего курса посвящена изучению принципов фундаментального анализа на рынке акций. Вы сумеете разобраться в преимуществах и ограничениях фундаментального анализа. Сумеете рассчитывать справедливую стоимость акции по заданным прогнозам денежных выгод, сопоставить расчетную (модельную) оценку с наблюдаемой на рынке и принять инвестиционное решение. Важные компетенции этой недели - Вы сумеете комментировать основные финансовые показатели компании, на которые стоит обращать внимание при диагностировании \"качества\" компании. Кроме того, Вы научитесь рассчитывать значимые аналитические финансовые показатели (FCF, FCFE), поймете, почему аналитики рассчитывают WACC. На этой неделе предусмотрено 14 видеолекций по 5-15 минут. По итогам недели вам будет доступен тренировочный тест, после которого необходимо будет решить тест для оценки полученных знаний.   Желаем вам успехов в освоении материала!Поиск относительно дешевых акций.Дорогие слушатели! На этой неделе мы с Вами поймем как находить относительно дешевые акции из тех, которые есть на рынке. Вы научитесь подбирать рыночные мультипликаторы, строить их самостоятельно, поймете, какие ловушки и подвохи таят некоторые из них. Вы научитесь корректировать мультипликаторы P/E, EV/EBITDA на ожидаемые темпы роста и страновые риски. Вы, как консультанты, сумеете объяснить инвесторам как подобрать аналоги для изучаемых акций. Изучение материалов лекции 3 позволит Вам находить недооцененные и переоцененные акции на рынке с помощью сравнительного подхода. Вы освоите профессиональную терминологию сравнительного анализа, разберетесь с многообразием используемых аналитиками мультипликаторов и поймете, на какие из них имеет смысл действительно обращать внимание. Вы научитесь самостоятельно конструировать  и рассчитывать мультипликаторы на основе открытых данных, обосновывать подразумеваемую стоимость компании и акции. Материалы лекции 3 (видео и текстовые файлы, тренировочные тесты и задачи) раскроют вам секреты сопоставления акций разных отраслей и темпов роста, разной долговой нагрузки. Вы сумеете правильно сделать выводы по недооценке при работе с аналогами развитых рынков капитала.Особенности инвестирования на развивающихся рынках капитала.Доброго времени суток! Изучение материалов лекции 4 позволит Вам разобраться, в чем заключаются особенности обоснования и принятия решений на развивающихся рынках капитала (в чем отличие развитых и развивающихся рынков и какие дополнительные премии за риск требует инвестор).  Вы поймете, как формируются требования по доходности на развивающихся рынках и как меняется понимание риска по стадиям делового цикла. Вы сумеете вводить коррекции в оценки акций, полученные стандартными конструкциями DCF и сравнительного анализа, объяснять различия в привлекательности акций по странам и при изменении макроэкономической ситуации. Акцент в лекции 4 сделан на расчет премий за риск. Вы научитесь обосновывать премии (дополнительные требования по доходности)  по акциям с низкой ликвидностью, по компаниям с высокой долговой нагрузкой,  с низким качеством корпоративного управления. Вы научитесь сопоставлять акции по ликвидности (с учетом числа сделок в день, торгового оборота, бид-аск спреда) и вводить в расчет ставки дисконтирования (конструкция DCF)  поправки за специфические риски.ЭкзаменЗдравствуйте, уважаемые слушатели! На экзамене (в виде тестов, задач и кейса с опцией взаимного оценивания) слушателям курса дается возможность вспомнить и обобщить основные положения, которые разбирались  по курсу – как и какую доходность рассчитываем по акциям и как сопоставляем акции по риску (общему и систематическому), как рассчитываем рыночную и общую капитализацию по компании и как обосновываем  подразумеваемую стоимость по мультипликаторам компаний-аналогов, зачем нужен расчет справедливой рыночной стоимости компании и одной акции по модели DCF. Вспомним, как включить в наши оценки  значимость с позиции миноритария таких характеристик компаний, как качество корпоративного управления и мера систематического риска владельца собственного капитала (бета коэффициент). Продемонстрируем, какую роль в обосновании инвестиционных решений играет  такая биржевая характеристика акции, как ликвидность и как на основе сопоставления наблюдаемой (с учетом налогообложения и комиссий) и расчетной (модельной) цены акции выставляется рекомендация аналитиками и консультантами. Взаимное оценивание на 70 балловТесты на 22 баллаЗадачи на 8 баллов\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Инвестиции в акции", 
    "price": 0, 
    "instructors": "Теплова Тамара Викторовна", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/investicii-akcii", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}