{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Рынок облигаций представляется частному инвестору сложным и запутанным. На нем торгуется огромное количество инструментов, которые сначала кажутся непонятными. Тем не менее, этот рынок дает огромные возможности инвестору как для диверсификации вложений и гарантирования дохода, когда на рынке нет достойных инвестиционных идей, так и для получения спекулятивного дохода.\n\nЦЕЛЬ - получение знаний об облигационном рынке и приобретение навыков расчета доходности и оценки рисков инвестиций в различные долговые инструменты. \n\nПосле изучения курса вы сможете: \n- самостоятельно находить необходимую информацию для расчета потенциального дохода и рисков предполагаемой операции, \n- сравнивать выгоду от покупки различных долговых финансовых инструментов и \n- выбирать для инвестиций наиболее подходящий вариант, основываясь на достоверных расчетах. \n\nКроме инструментария и методологии для успешного старта инвестиционной деятельности курс содержит ряд практических примеров, которые позволят вам ознакомиться с рынком облигаций в реальности.\n\nВы получите возможность понять механизм ценообразования на рынке облигаций, узнаете, как можно зарабатывать на этом рынке, ориентируясь на консервативную или спекулятивную стратегию в зависимости от своих собственных предпочтений. \n\nБольшой и сложный рынок облигаций станет вам понятным!\n\n                                            Syllabus\n                        ВведениеЗдесь будет основная вводная информация о курсе и специализацииОблигация как инструмент инвестирования.  Виды облигацийВ первой части курса «Инвестиции в облигации» нам предстоит познакомиться с базовой терминологией облигационного рынка, изучить основные параметры облигаций и их классификацию. Первый модуль состоит из пяти уроков. После каждого урока Вам будут предложены тренировочные тестовые задания.По итогам модуля необходимо будет решить оцениваемый тест. Желаем Вам удачного обучения!Ценообразование облигацийДобро пожаловать во второй модуль курса «Инвестиции в облигации». Данная часть посвящена изучению принципов расчета стоимости облигаций и их доходности. Также, особое внимание будет уделено факторам, влияющим на цену и доходность облигаций. \nВторой модуль состоит из пяти уроков. После каждого урока Вам будут предложены тренировочные тестовые задания.По итогам модуля необходимо будет решить оцениваемый тест. \nЖелаем Вам удачного обучения!Облигации как инструмент инвестированияПриветствуем Вас на третьей части нашего курса «Инвестиции в облигации». В этом модуле мы перейдем от теоретической составляющей курса к ее практической составляющей. Сначала поговорим о привлекательности облигаций как средства инвестирования, затем, подробнее остановимся на различных типах облигаций и их особенностях. Особое внимание будет обращено на практические примеры с реального рынка. \nТретий модуль состоит из четырех уроков. После каждого урока Вам будут предложены тренировочные тестовые задания.По итогам модуля необходимо будет решить оцениваемый тест. \nЖелаем Вам удачного обучения!Риски инвестирования в облигации. Стратегии инвестирования в облигацииУважаемые слушатели, мы добрались до последней части нашего курса «Инвестиции в облигации». Четвертый модуль направлен на изучение особенностей процесса инвестирования в облигации. Подробно будет освещена  схема торгов облигациями. Кроме того, внимание будет уделено процессу выбора инструментов облигационного рынка в зависимости от предпочтений инвестора. \nЧетвертый модуль состоит из четырех уроков. После каждого урока Вам будут предложены тренировочные тестовые задания.По итогам модуля необходимо будет решить оцениваемый тест. \nЖелаем Вам удачного обучения!Итоговые заданияУважаемые слушатели, данная часть курса состоит из итоговых заданий, который Вам необходимо выполнить для успешного окончания курса «Инвестиции в облигации». Итоговые задачи включают в себя одно задание на взаимное оценивание и четыре расчетные задачи. Для выполнения заданий Вам потребуется применить все полученные в ходе четырех модулей знания.Желаем Вам удачного прохождения всех заданий!\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Инвестиции в облигации", 
    "price": 0, 
    "instructors": "Столяров Андрей Иванович", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/investicii-obligacii", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}