{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Курс состоит из двух самостоятельных тем.  \n\nВ теме «Инфраструктура рынка» вы получите представление о деятельности профессиональных участников рынка ценных бумаг, единственной задачей которых является создание благоприятных условий для покупки или продажи акций различными типами инвесторов. По результатам изучения этой темы вы сможете: \n- описать деятельность фондовой биржи, на которой совершаются сделки с ценными бумагами; \n- отличать функции брокера, дилера, депозитария, расчётной (клиринговой) палаты и пользоваться ими при открытии и ведении брокерского счета; \n- понимать особенности, правила и риски и Интернет-торговли;  \n- знать правила и возможности использования индивидуальных инвестиционных счетов;\n- понимать назначение и виды приказов на покупку или продажу ценных бумаг, условия совершения различных сделок с акциями – маржинальных, сделок РЕПО и других.\n\nТема «Методы и технологии инвестирования» раскрывает перед вами особенности и инструменты краткосрочных инвестиционных стратегий. Здесь описываются различные инвестиционные стратегии, излагаются основные принципы технического анализа, даётся понятие  торговых стратегий. Вы познакомитесь с методами разработки математических моделей прогнозирования движения биржевых цен, лежащих в основе индикаторов и осцилляторов - основных инструментов принятия краткосрочных инвестиционных решений.\n\nПо итогам изучения курса вы сможете:\n- владеть основными принципами технического анализа, знать его основные подходы и  инструменты;\n- уметь самостоятельно выбирать индикаторы и осцилляторы при разработке и реализации торговых стратегий и создании собственных торговых систем.\n\nОЦЕНИВАНИЕ\nПрактические задания с использованием математических моделей прогнозирования цен и теоретические тесты на понимание технического анализа.\n\nНЕОБХОДИМЫЕ ЗНАНИЯ И НАВЫКИ\nДля освоения материалов курса вам понадобятся знания об основах рынка ценных бумаг, которые вы можете получить во 2 и 3 курсе нашей специализации - \"Инвестиции в облигации\" и \"Инвестиции в акции\".\n\n                                            Syllabus\n                        ВведениеВ этом модуле вы найдете основную информацию о курсе, которая поможет вам успешно его пройти.Рыночная инфраструктура для частного инвестораПервый модуль посвящен теме «рыночная инфраструктура для частного инвестора». Данная тема содержит 5 разделов, которые помогут максимально полно и логично усвоить предложенный материал. Здесь Вы получите полное представление об участниках фондового рынка, что позволит увидеть общую картину взаимоотношений этих участников, понять их основные функции. Знания, полученные в этом разделе, полезны не только частным, но и институциональным инвесторам, а также другим участникам рынка ценных бумаг. В первом разделе будет рассмотрено взаимодействие инвестора с брокером, далее Вы познакомитесь с институтами, обеспечивающими хранение и учет прав на ценные бумаги инвестора, затем Вы узнаете, как организована фондовая биржа и внебиржевой рынок, что такое онлайн торговля и индивидуальный счет для частного инвестора.Механизмы торговли ценными бумагамиВо втором модуле Вам предложена на рассмотрение тема «механизм торговли ценными бумагами». Данный раздел будет полезен для тех, кто собирается работать на фондовом рынке, заключать сделки купли-продажи ценных бумаг с помощью выставления приказов брокеру в торговом терминале. Тема представлена четырьмя разделами. В первом разделе Вы познакомитесь с тем, какие виды приказов на покупку и продажу существуют на фондовых биржах, в чем их особенности. Во втором разделе вы узнаете, что представляет маржинальная торговля, какие риски она несёт. В третьем разделе на примере Вы разберете, что такое короткие продажи. Третий раздел посвящён подробному рассмотрению коротких продаж. И последний, четвертый раздел посвящен сделкам РЕПО и способам их заключения на российском рынке.Спекулятивные инвестиционные стратегииВ третьем модуле рассматривается тема: «спекулятивные инвестиционные стратегии». Здесь Вы узнаете об инвестиционных стратегиях, основанных на следовании за трендом, разберете такие понятиях, как поддержка и сопротивление на фондовом рынке, а также поймете, как с помощью технического анализа возможно принимать решения при выборе инвестиционной стратегии. В данном разделе Вы приобретете навыки построения инвестиционных стратегий, которые так необходимы частному инвестору, ознакомитесь с основными принципами технического анализа.Инструментарий технического анализа для частного инвестора В четвертой и заключительной теме этого курса Вы подробно рассмотрите инструментарий технического анализа, который требуются частному инвестору для торговли на фондовом рынке. Здесь Вам предлагается разобрать различные графики технического анализа, которые предлагают удобное визуальное представление цен финансовых инструментов, рассмотрите отличие индикаторов и осцилляторов, какие возможности они представляют при торговле на фондовом рынке. \n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Инфраструктура рынка, методы и технологии инвестирования", 
    "price": 0, 
    "instructors": "Меньшиков Сергей Михайлович", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/infrastruktura-rynka", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}