{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    В этом курсе вы получите представление о том, как определить стоимость компании, чтобы использовать  эти знания в управленческих решениях, и почему такие навыки необходимы менеджерам, аналитикам, предпринимателям, собственникам бизнеса. Курс открывает специализацию “Корпоративные финансы и стоимость компании”, включающую 5 связанных курсов и заключительный прикладной проект “Мастерство создания стоимости компании”\n\nКурс будет полезен тем, кто стремится получить новые навыки анализа бизнеса, нарастить мастерство управления, создать успешный бизнес, усилить профессиональные позиции в аналитической, управленческой и в предпринимательской среде.\n\nПосле успешного завершения курса Вы будете:\n- уметь оценивать деятельность компании с помощью финансовой отчётности;\n- знать, каковы границы ее применения и в чем состоят радикальные отличия финансовой модели анализа компании от бухгалтерской;\n- уметь определять потоки свободных денежных средств компании и использовать драйверы стоимости для расчета фундаментальной стоимости компании  методом дисконтируемого потока денежных средств;\n- уметь оценивать стоимость компании с помощью рыночных сравнений;\n- понимать специфику  оценки стоимости в различных отраслях бизнеса.\n\nДля эффективного освоения курса Вам полезны начальные знания бухгалтерского учета и основ финансов. По итогам каждой недели Вам потребуется выполнять контрольные задания, а по окончании курса - итоговый экзамен. Курс ведут преподаватели и профессиональный консультант в области оценки.\n\n                                            Syllabus\n                        ВведениеДобро пожаловать в первый курс специализации \"Корпоративные финансы и стоимость компании\"!   В этом модуле вы найдете основную информацию, которая поможет вам сориентироваться в структуре курса и успешно его пройти.Как предпринимательская деятельность представлена в финансовой отчетности?На первой неделе мы познакомимся с тем, как предпринимательская деятельность представлена в финансовой отчетности. Вы узнаете, кто является поставщиком финансовой информации и кому нужна финансовая информация. Мы раскроем цели ключевых финансовых отчетов, выпускаемых компаниями (отчеты о финансовом положении, о совокупном доходе и о движении денежных средств). Затем мы определим основные элементы финансовой отчетности компании (активы, обязательства, собственный капитал, доходы и расходы). Наконец, вы научитесь проводить различие между классами активов и пассивов, доходов и расходов на основе индивидуальных характеристик этих элементов. Чтобы овладеть вышеуказанными навыками, важно просмотреть все видео лекции и выполнить предлагаемые тестовые задания.Как оценить деятельность компании с помощью финансовой отчётности?На этой неделе мы рассмотрим, как оценить деятельность компании с помощью финансовой отчётности. Вы узнаете, как применять финансовые показатели для измерения эффективности и анализа конкурентоспособности, какие существуют факторы рентабельности и оборачиваемости. Вы научитесь использовать коэффициентный анализ, чтобы показать, насколько эффективно используются активы компании относительно сопоставимых компаний. Затем мы обсудим, как определяются денежные потоки компании в отчете о движении денежных средств и какова роль денежных потоков от финансовой и инвестиционной деятельности для финансового анализа. В итоге, вы получите навыки применения инструментов измерения ликвидности, основанных на денежных потоках, которые позволяют оценить риск финансовых затруднений для компании.   Чтобы овладеть вышеуказанными навыками, важно просмотреть все видео лекции и выполнить предлагаемые тестовые задания.Какие ограничения имеет финансовая отчетность?На этой неделе мы обсудим какие ограничения имеет финансовая отчетность. Для этого мы в начале узнаем, как измеряется балансовая стоимость и прибыль, как соблюсти баланс между качественными характеристиками финансовой информации, между затратами на ее представлении и выгодами от ее использования. Затем мы разберёмся, как улучшить качество финансовой информации.  И, наконец, мы рассмотрим альтернативную бухгалтерской финансовую модель анализа. Полученные навыки позволят Вам выявлять возможные недостатки, связанные с использованием опубликованной финансовой отчетности для проведения финансового анализа и понимать практики бухгалтерского учета, с помощью которых менеджеры и бухгалтеры могут искажать финансовое положение компании. Чтобы овладеть вышеуказанными навыками, важно просмотреть все видео лекции и выполнить предлагаемые тестовые задания.Оценка стоимости на основе дисконтированных потоков денежных средствНеделя посвящена главному методу оценки стоимости компании на основе анализа ее эффективности и потока доходов, и поэтому наиболее важному для целей управления. Вы изучите алгоритм метода дисконтируемого потока денежных средств, метод ключевых факторов стоимости, позволяющий быстро определить прогнозные потоки денежных средств в рамках горизонта планирования, и специфику анализа завершающего (остаточного) потока денежных средств  компании. Полученные навыки позволят Вам строить финансовые модели компании для разных вариантов ее развития, и они необходимы для финансового анализа стратегий роста любой компании. Чтобы освоить этот материал эффективно, важно выполнить тренировочные расчеты и прочитать дополнительные материалы, которые мы Вам подготовили.Применение сравнительного подхода в оценке стоимости бизнесаПятая неделя посвящена особенностям применения сравнительного подхода в оценке стоимости бизнеса. Мы кратко повторим традиционные подходы в оценке стоимости бизнеса и подробно остановимся на основных методах сравнительного подхода – методе рынка капитала, методе сделок, а также методе отраслевых коэффициентов. Рассмотрим основные этапы (шаги) сравнительного подхода. Наиболее важные вопросы в разделе – это критерии сопоставимости компаний и применение финансовых и нефинансовых мультипликаторы. При применении методологии подхода кратко остановимся на нормализации отчетности. В результате перейдем к расчету и корректировкам мультипликатора, рассмотрим практические примеры: расчет мультипликаторов; применение исторических и прогнозных мультипликаторов, а также проанализируем возможное некорректное применение сравнительного подхода.Виды оценки стоимости. Обязательная и необязательная оценка. Пользователи и стандартыШестая неделя отведена на рассмотрение специальных вопросов в оценке стоимости бизнеса и активов и оценке бизнеса в различных отраслях.\n\nПрежде чем перейти к оценке бизнеса в конкретных отраслях мы рассмотрим вопросы регулирования и стандартов оценочной деятельности.\n\nДалее рассмотрим оценку стоимости бизнеса в промышленном/потребительском секторе, основного актива (лицензии) в добывающем секторе, остановимся на вопросах оценки стоимости бизнеса сельскохозяйственной компании. Далее перейдем к специфике оценки стоимости недвижимости и стоимости бизнеса в сфере гостепреимства.\n\nЗавершим лекции рассмотрением примера оценки стоимости бизнеса в секторе медиа и оценки стоимости библиотеки прав.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Оценка стоимости компании", 
    "price": 0, 
    "instructors": "Тихомиров Дмитрий Викторович, Ивашковская Ирина Васильевна and Кузубов Сергей Анатольевич", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/ocenka-stoimosti-kompanii", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}