{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    Основной целью данного курса является формирование у слушателей понимания того, что в современном мире крайне необходимо грамотное управление личными финансами, и это обязательно поможет человеку стать финансово состоятельным и независимым. Изучение курса позволит лучше ориентироваться в текущих финансовых вопросах, практически ежедневно возникающих у людей, и находить оптимальные для каждого человека способы управления личным капиталом.\nВ ходе прохождения курса слушатель, прежде всего, научится распределять свой капитал по трем элементам: текущий, страховой и инвестиционный капитал. Далее будут рассмотрены возможности осуществления инвестиционных операций на финансовом рынке и оценка их эффективности. Для объективной оценки совершаемых операций в представленном курсе даются основы финансовых вычислений (простой и сложный процент, номинальная и эффективная процентная ставка, номинальная и реальная доходность, текущая и будущая стоимость денег). Понимание рисков является особо важным в финансовом мире, и этому также будет посвящена отдельная часть курса, в ходе освоения которой слушатель научится оценивать эффективность принимаемых инвестиционных решений по критерию «риск-доходность». А в заключительной части будут рассмотрены вопросы, касающиеся формирования инвестиционного портфеля и управления им. \nКак результат – у слушателя сформируется комплексное представление об управлении личными финансами, что сделает этот процесс для каждого более успешным и интересным!\n\nПЛАН КУРСА\nНЕДЕЛЯ 1: Финансы в жизни человека\nНЕДЕЛЯ 2: Риск и доходность личных финансовых инвестиций\nНЕДЕЛЯ 3: Технология принятия решений частным инвестором\nНЕДЕЛЯ 4: Инвестиционные стратегии частного инвестора\n\nНЕОБХОДИМЫЕ ЗНАНИЯ И НАВЫКИ\nПредварительных требований к слушателям курса не предъявляется\n\nОЦЕНИВАНИЕ\nПо результатам каждого из 4-х модулей предусмотрен контрольный тест, который будет состоять из классических тестов (вопрос и даны варианты ответов), из задач, предполагающих проведение расчетов в рамках прослушанного материала. Итоговая оценка по курсу формируется нарастающим итогом по результатам тестов по каждому модулю.\n\nНЕОБХОДИМОЕ МАТЕРИАЛЬНОЕ И ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ\nСпециального материального и программного обеспечения для освоения курса не требуется.\n\nДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ\nВ курсе будут делаться ссылки на наиболее интересные и актуальные статьи и сайты по вопросам личных финансов.\n\n                                            Syllabus\n                        ВведениеДобро пожаловать в первый курс специализации! В этом модуле Вы найдете основную вводную информацию о курсе, которая поможет вам сориентироваться в нем и понять, какие знания Вы можете получить в ходе его прохождения.Финансы в жизни человекаЗдравствуйте, уважаемые слушатели! Первая неделя курса посвящена рассмотрению общей роли финансов в жизни человека. На этой неделе вы освоите базовый понятийный аппарат по вопросам личного финансового планирования и научитесь распределять личный капитал на составляющие части. Помимо этого, в заключительной части вы рассмотрите вопросы, касающиеся определения необходимых пропорций в распределении личного капитала, обеспечивающих постоянное потребление на протяжении жизни человека. На первой неделе предусмотрено 6 видеолекций по 9-17 минут, слайды из которых содержатся в презентации, прикрепленной к первому видео на вкладке Resources. По итогам недели предусмотрен тест для оценки полученных знаний. Желаем вам успехов в освоении материала! Риск и доходность личных финансовых инвестицийУважаемые слушатели! На второй неделе мы рассмотрим вопросы, касающиеся риска и доходности личных финансовых инвестиций. Вначале вы узнаете об основных причинах возникновения риска на финансовом рынке и научитесь оценивать риск и доходность рыночных активов. Затем вы ознакомитесь с влиянием временного горизонта на риск и доходность. А в конце недели научитесь оценивать факторы, влияющие на изменение инвестиционной стратегии. На второй неделе предусмотрено 8 видеолекций по 10-15 минут, слайды из которых содержатся в презентации, прикрепленной к первому видео на вкладке Resources. По итогам недели предусмотрен тест для оценки полученных знаний. Надеемся, вам будет интересно, успехов!Технология принятия инвестиционных решенийДоброго времени суток! Третья неделя курса посвящена технологиям принятия решений частным инвестором. На этой неделе вы узнаете, что подразумевается под оценкой рисков инвестиционных решений, как принимать обоснованные решения такого рода и какие инструменты можно применять для успешной защиты от рисков. На третьей неделе предусмотрено 7 видеолекций по 10-15 минут, слайды из которых содержатся в презентации, прикрепленной к первому видео на вкладке Resources. По итогам недели предусмотрен тест для оценки полученных знаний. Успехов вам в освоении материала!Финансовые инструменты для инвестированияЗдравствуйте, уважаемые слушатели! Заключительная, четвертая неделя курса  посвящена инвестиционным стратегиям, которые применяют частные инвесторы. На этой неделе вы научитесь выбирать инвестиционную стратегию, соответствующую вашим жизненным установкам, узнаете о финансовых инструментах, используемых для реализации инвестиционных стратегий, ознакомитесь с особенностями формирования личного инвестиционного портфеля. Помимо этого, в заключительной части будет расмотрен механизм передачи средств в доверительное управление. На четвертой неделе предусмотрено 6 видеолекций по 12-17 минут, слайды из которых содержатся в презентации, прикрепленной к первому видео на вкладке Resources. По итогам недели предусмотрен тест для оценки полученных знаний. Желаем вам успехов в освоении материала!\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Управление личными финансами", 
    "price": 0, 
    "instructors": "Берзон Николай Иосифович", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/upravlenie-lichnymi-finansami", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}