{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    В рамках данного курса рассматриваются основные вопросы функционирования финансовых рынков, деятельности финансовых институтов, изучаются финансовые инструменты, с которыми приходится сталкиваться человеку в своей жизни. Помимо этого, раскрываются базовые принципы инвестирования свободных средств на финансовом рынке, основы проведения финансовых вычислений.\n\nВ настоящее время финансовый рынок активно используется компаниями, регионами и государством для привлечения финансовых ресурсов, обеспечивающих реализацию инвестиционных проектов. Однако востребован финансовый рынок не только со стороны финансовых институтов, но и частных инвесторов, которые используют его для размещения временно свободных денежных средств с целью получения дохода на вложенный капитал. Изучение курса позволит слушателю лучше ориентироваться в современном финансовом мире, понимать причины финансовых кризисов, роль процессов глобализации и секьюритизации финансовых рынков, возможности финансовой инженерии.\n\nФинальная оценка за курс основана на 9 тестах, выполняемых в конце каждой недели. Курс считается пройденным при успешной сдаче всех тестов.\nКаких-либо специальных знаний в области финансов и фондовых рынков для освоения курса не требуется.\n\n                                            Syllabus\n                        Организация и структура финансового рынка.Здравствуйте, уважаемые слушатели! Первая неделя курса посвящена рассмотрению организации и структуры финансового рынка. На этой неделе вы узнаете об основных понятиях и структуре финансового рынка, выясните место фондового рынка на финансовом рынке, ознакомитесь с функциями, которые выполняют денежный рынок и рынок капитала. Далее вы рассмотрите вопросы, касающиеся роли и значения первичного и вторичного рынков и получите представление об общих тенденциях развития финансовых рынков. На первой неделе предусмотрено 7 видеолекций по 9-15 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. Желаем вам успехов в освоении материала!Секьюритизация и глобализация финансовых рынков.Уважаемые слушатели! На второй неделе мы рассмотрим вопросы, связанные с секьюритизацией и глобализацией финансовых рынков. Вы узнаете об основных этапах развития процессов глобализации финансовых рынков, о различии секьюритизации финансовых рынков и финансовых активов, ознакомитесь с особенностями влияния данных процессов на структуру финансовых рынков. Помимо этого, вы получите сведения о причинах развития процессов секьюритизации финансовых рынков и рассмотрите механизм секьюритизации финансовых активов. На второй неделе предусмотрено 8 видеолекций по 10-15 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. Надеемся, вам будет интересно, успехов!Риск и доходность.Доброго времени суток! На третьей неделе будут рассмотрены вопросы, связанные с измерением риска и доходности на финансовых рынках. На этой неделе вы узнаете, что подразумевается под риском на финансовом рынке, как измеряются риск и доходность инвестиций и какое влияние на соотношение этих показателей оказывает временной горизонт инвестирования. Также вы получите знания о том, как оценить эффективность инвестирования и какие существуют различия между систематическим и несистематическим рисками. Помимо этого, вы рассмотрите механизм минимизации риска за счет диверсификации вложений, научитесь рассчитывать риск портфеля и узнаете как определить уровень требуемой доходности по активу. На третьей неделе предусмотрено 7 видеолекций по 10-25 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. Успехов вам в освоении материала этой недели!Рынок долгового капитала. Облигации.Рады снова вас видеть на курсе \"Финансовые рынки и институты\"! На четвертой неделе вы познакомитесь с рынком долгового капитала и облигациями. Вы узнаете о структуре долгового рынка, фундаментальных свойствах облигаций, основных их видах по способу выплаты дохода инвесторам и возможности досрочного погашения. Затем вы рассмотрите вопросы, касающиеся определения стоимости облигации и факторы, влияющих на нее. Помимо этого, вы узнаете как рассчитать различные виды доходности купонных и бескупонных облигаций и изучите параметры, учитываемые при присвоении облигации рейтинга. На четвертой неделе предусмотрено 9 видеолекций по 7-25 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. Желаем вам интересной и плодотворной учебы!Рынок акций.Здравствуйте, уважаемые слушатели курса! Пятая неделя курса посвящена рассмотрению рынка акций. На этой неделе вы узнаете о фундаментальных свойствах акций и основных их видах, ознакомитесь с вопросами, касающимися оценки доходности и стоимости акций, получите представление о различиях между механизмами их приобретения и выкупа. Также вы рассмотрите механизмы голосования на собрании акционеров и получите сведения о целях использования преимущественных прав, имеющихся у акционеров компании. На пятой неделе предусмотрено 10 видеолекций по 8-19 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. До новых встреч!Банковский сектор.Всем доброго времени суток! На шестой неделе курса будет рассмотрен банковский сектор. Вы узнаете о ключевых функциях Центрального банка, инструментах денежно-кредитного управления, роли банковского сектора в экономике России. Также вы ознакомитесь с основными тенденциями международного регулирования банковской деятельности, узнаете, как определить минимальный размер достаточности собственного капитала банка и  каковы характерные черты проектного финансирования и инвестиционного кредитования. На шестой неделе предусмотрено 7 видеолекций по 12-25 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. Желаем вам дальнейших успехов в освоении материала!Фонды коллективного инвестирования.Здравствуйте, уважаемые слушатели! На седьмой неделе вы узнаете про фонды коллективного инвестирования. В рамках данной недели вы рассмотрите основные виды конкурирующих организационных форм инвестирования, узнаете о характерных чертах доверительного управления, достоинствах и недостатках индивидуального и коллективного инвестирования. Помимо этого, в рамках данной недели будут рассматриваться вопросы, касающиеся пенсионной системы РФ, содержания пенсионной реформы и схемы деятельности негосударственных пенсионных фондов. На седьмой неделе предусмотрено 8 видеолекций по 10-27 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. Надеемся, материал этой недели будет для вас интересен! Успехов!Гибридные финансовые инструменты.Уважаемые слушатели, доброго времени суток! Восьмая неделя курса посвящена рассмотрению гибридных финансовых инструментов. На этой неделе вы узнаете, как проходил процесс эволюции и трансформации финансовых инструментов, рассмотрите конкурирующие организационные формы инвестирования, принципы формирования структурированных финансовых продуктов. Далее вы ознакомитесь с основными предпосылками и последствиями появления конвертируемых ценных бумаг. Помимо этого, вы получите сведения о том, как рассчитывается доходность структурированного финансового продукта. На восьмой неделе предусмотрено 7 видеолекций по 10-20 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. Желаем вам интересной и плодотворной учебы!Международные рынки капитала.Здравствуйте, уважаемые слушатели! Заключительная, девятая неделя курса  посвящена рассмотрению международных рынков капитала. На этой неделе вы изучите структуру международного рынка капитала, узнаете характерные черты рынка еврооблигаций и цели, которые преследуют компании, выходя на зарубежные рынки капитала. Помимо этого, будут рассмотрены вопросы, касающиеся депозитарных расписок: структура программ различных уровней ADR, механизм конвертации ADR в акции, функции депозитарного банка при выпуске расписок и ряд других. На девятой неделе предусмотрено 6 видеолекций по 12-17 минут, слайды из которых содержатся в прикрепленной презентации. По итогам недели предусмотрен тест для оценки полученных знаний. Желаем вам успехов в освоении материала!\n                                    ", 
    "end_date": "2015-12-21T00:00:00Z", 
    "title": "Финансовые рынки и институты (Financial Markets and Institutions)", 
    "price": 0, 
    "instructors": "Nikolay  Berzon", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/finansovye-rynki", 
    "duration": "9 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-10-19T00:00:00Z"
}