{
    "selfpaced": false, 
    "topic_name": [
        "Finance"
    ], 
    "description": "\n\n                    \n                    \n                    في كثير من الأحيان نشعر وكأن جيوبنا مثقوبة، نجني المال لكن لا نعرف كيف يتم صرفه. نصل منتصف الشهر وتم صرف كامل الراتب، كما في بعض الأحيان يصرف الراتب في أول اسبوع من الشهر. في الماضي كان دخلنا أقل وكان يكفينا ويزيد، الآن تضاعفت دخولنا عدة مرات وهي لا تكفينا، المصاريف كثيرة والالتزامات عديدة. لا نستطيع أن نوفر أو ندخر.\r\nهذا الواقع حقيقة، لكن في معظم الأحيان ومهما كان مقدار دخلنا، نستطيع أن نسيطر على ما نجنيه من مال ونستفيد منه بأحسن وأحكم طريقة. هذا المساق سيساعدك في تحقيق ذلك.\r\nستتعلم في هذا المساق:\r\n\r\nأهمية التخطيط المالي وضرورته.\r\nبناء موازنة تقديرية شخصية بطريقة عملية والاستفادة منها في تحقيق اهدافنا الشخصية والعائلية.\r\nلتوفير والادخار والابتعاد عن الصرف الزائد.\r\nالاستثمار وكيفية زيادة مدخرتنا لتحقيق أهدافنا المستقبلية.\r\nالقيمة الزمنية للنقود، وأهمية مفهوم التركيب.\r\nأنواع القروض وكيفية التعامل معها.\r\nكيفية التعامل مع المؤسسات المالية المختلفة للاستفادة منها.\r\n\r\nالمال هو أمانة فنحن نحتاج أن نتعامل به بحكمة، كما أن هنالك احصائية تقول أن خلال ١٠ سنوات القادمة ٧٨٪ ممن يقرأون هذه المقدمة عن المساق سيواجهون ضائقة مالية إن لم نكن نواجها الآن. معظم مشاكلنا المالية ليست بسبب نقص أموالنا بل بسبب سوء ادارتنا لها.\r\nهذا المساق سيكون فرصة لكم حتى تقيموا أنفسكم في مجال تخطيط الأمور المالية وسيساعدكم على إتخاذ القرارات والأفعال وتغييروا السلوكيات الضرورية لسيطرة على أموركم المالية.\r\nهذا المساق يأتيكم بدعم من:\n\n                                    ", 
    "end_date": "2015-12-22T00:00:00Z", 
    "title": "تخطيط الأمور المالية الشخصية", 
    "price": 0, 
    "instructors": "Odeh Habash", 
    "institution_name": [], 
    "commitment": "1 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.edraak.org/course/course-v1%3AEdraak%2BFL100%2B2015_T4_R1/", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Edraak"
    ], 
    "start_date": "2015-11-24T00:00:00Z"
}