{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>A creative life is any life governed more by curiosity than by fear</strong>.  In this course Elizabeth Gilbert, the best-selling author of books including <em>Eat Pray Love, Committed,</em> <em>The Signature of All Things</em><em> </em>and <em>Big Magic</em> will equip you with the practical tools and inspiration to jumpstart your own creative journey.  She’ll bring the key lessons from her latest book, <em>Big Magic, </em>to life and offer coaching and insights that expand on her chapters. You’ll learn why perfectionism, originality, and passion are overrated and why we should instead strive to be authentic doers who follow our curiosity.  In addition to building upon the insights from <em>Big Magic,</em> Elizabeth will respond to three brand new case studies of change makers struggling to get started, and offer tips to help push your own creative projects into the next gear.</p>\n\n<p>Each of the 5 sections will be accompanied by Creativity Notebooks &amp; practical exercises that enable you to put concepts from <em>Big Magic</em> into practice in your own life.  Through a self-paced journey of reflection, you’ll pinpoint your creative blockages; mine your sources of curiosity; corral your ideas on paper; and unlock your own capacity to get something done. Whether you are an entrepreneur or an artist, you’ll learn about how to pursue a life driven more by curiosity than fear. </p><p>You should be prepared to roll up your sleeves and think hard about your own sources of curiosity and authenticity.  You’ll leave the learning experience with a Creativity Notebook documenting your ideas.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This is a course created by +Acumen, an organization committed to creating social change. We think creativity is a vital component of tackling the world’s toughest problems and are thrilled to present Elizabeth Gilbert’s exclusive Creativity Workshop. This is one in a series of +Acumen master classes built with incredible instructors and experts including Seth Godin, Krista Tippett, and Chris Anderson to bring the most cutting edge ideas to the social sector.<br></p>", 
    "end_date": null, 
    "title": "+Acumen Presents: Elizabeth Gilbert's Creativity Workshop", 
    "price": "40.00", 
    "instructors": "+Acumen Courses, Elizabeth Gilbert", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806626_f5c3_3.jpg", 
    "course_url": "https://www.udemy.com/elizabeth-gilberts-creativity-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T22:29:30Z"
}