{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>* Launched March 2016 with over 4000 enrollments in the first two weeks. Thank you!!!</em></strong></p>\n\n<p>Have you been craving a life that feels more creative and filled with intention, meaning, and joy?</p>\n\n\n\n\n\n<p>Maybe you’ve tried to fit a regular creative practice into your life but you’re having trouble sticking with it or just getting started?</p>\n\n\n\n\n\n<p>Whether you consider yourself to be a beginning or experienced creative, this course is for you!</p>\n\n\n\n\n\n<p><strong>This comprehensive, fun, and informative course on creativity is filled with inspiring ideas and activities that are designed to take no more than twenty minutes a day for 21 days.</strong></p>\n\n\n\n\n\n<p>Since it takes 21 days to make a new habit, by the end of the course you will be well on your way to making creativity a regular and daily part of your life. <strong>A life filled with creativity is a life filled with passion, magic, and purpose.</strong><strong></strong></p>\n\n\n\n\n\n<p>Here is a brief summary of what the course covers:</p>\n\n\n\n\n\n<p><strong><u>COURSE OUTLINE:</u></strong></p>\n\n\n\n\n\n<p><strong>Getting Prepared:</strong> How to find the right space and time for creating.</p>\n\n\n\n\n\n<p><strong>Getting Started:</strong> Techniques for transitioning from your busy day-to-day life to your creative work - or for getting unstuck - that include journaling, walking, ritual, meditation, etc.</p>\n\n\n\n\n\n<p><strong>Getting Inspired:</strong> Learn to identify what inspires you and how you can tap into that at any time.</p>\n\n\n\n\n\n<p><strong>Getting Focused:</strong> How to go from initial inspiration to actual completed project through planning, goal setting, and scheduling (in a fun creative way!)</p>\n\n\n\n\n\n<p><strong>Getting Productive:</strong> How to stay with your creative work by holding yourself accountable, finding the right supports, and tracking your progress.</p>\n\n\n\n\n\n<p><strong>Carrying It Forward:</strong> How to take what you have learned from this course and apply it to your future creative work.</p>\n\n\n\n\n\n<p><strong>WHAT YOU WILL LEARN IN THIS COURSE:</strong></p>\n\n\n\n\n\n<ul><li>How to make creativity a daily part of your life</li><li>How to sample various creative practices and techniques to determine what works best for you</li><li>How to pick the one creative project that is most meaningful to you at this time</li><li>How to set goals for your project so that you can see it through to completion</li><li>How to make a long-term and short-term plan for your creative work</li><li>Lots of creative ideas and inspiration</li><li>A deeper understanding of your creative rhythms and habits</li><li>How to get started with your creative work</li><li>Discover what inspires you and how to tap into that anytime</li><li>How to find the right creative support for yourself and hold yourself accountable</li><li>How to get unstuck from a creative project</li><li>How to commit to yourself and your creative work</li><li>And much more!</li></ul>\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><strong><u>How to take this course:</u></strong></p>\n\n\n\n\n\n<ul><li>Ideally, this course is done over 21 days</li><li>However, you are welcome to simply follow the course at your own pace.</li><li>Either way, you will learn a lot and be inspired!</li></ul>\n\n\n\n\n\n<p><strong><u>How to sign up:</u></strong></p>\n\n\n\n\n\n<p><strong><u></u></strong><strong>Simply click the “Take this course” button on the top right-hand side of this page – and come join the fun!</strong></p>\n\n\n\n\n\n<p><strong><u>Other benefits:</u></strong></p>\n\n\n\n\n\n<ul><li>This course is available <strong>on-demand</strong> – which means you can access it anytime.</li><li>This course is <strong>100% refundable</strong> for the first thirty days if for some reason you are not satisfied.</li><li>You will have the opportunity to <strong>ask the instructor questions</strong> anytime!</li></ul>\n\n\n\n\n\n<p><em><strong></strong></em></p>\n\n\n\n\n\n<p><em><strong>“Lauren worked with me last year on my creative process and I can tell you she really gets this stuff. Her help gave a real boost to my creativity. If you are looking for help in increasing your creativity you should take this course.” – Ian Murray, Photographer</strong></em></p>\n\n\n\n\n\n<p><em><strong> </strong></em></p>\n\n\n\n\n\n<p><strong><em>“Thanks to Lauren, I have most of the first draft of a book I had been saying I was writing for years, but had never sat down to write before.” </em>– Amber Hadigan, Writer</strong></p>\n\n\n\n\n\n<p><strong><em>“She is wonderful to work with and is helping me expand my creativity in ways I had not imagined.”</em><em> </em>– Andrew Getch, songwriter and painter</strong></p>\n\n\n\n\n\n<p><strong>                                                                                                                  </strong></p>\n\n\n\n\n\n<p><strong><em>“I highly recommend Lauren’s creativity coaching. I LOVE having a cheerleader who helps me stay focused.”</em> – Sarah Starkey, musician</strong><em></em></p>", 
    "end_date": null, 
    "title": "21 Days to Creativity: How to Develop a Creative Practice", 
    "price": "20.00", 
    "instructors": "Lauren Lapointe", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741588_7b2a_2.jpg", 
    "course_url": "https://www.udemy.com/21-days-to-creativity/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T22:58:56Z"
}