{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>More than 425 happy students and 13 five-star ratings!</strong>  </p>\n\n<p>  \t  If you're reading this, you probably consider yourself to be a creative person. Great. <strong>But are you an \"Empowered Artist\"?</strong>  </p>\n\n\n\n<p>  \t      If you are truly empowered, you don't buy into the misguided notions of the \"starving artist\" or the \"struggling artist.\"  </p>\n\n\n\n<p>  \t      You know that your gifts and talents have value, and that - once properly honed and presented to the world - <strong>you can make a difference and maybe even make a living with your art</strong>.  </p>\n\n\n\n<p>  \t      But most creatives don't start off their careers with that level of confidence, and with this course, I'm out to change that!  </p>\n\n\n\n<p>  \t      I've been blessed to have made a living most of my life from my creative endeavors. For the past ten years, my efforts as an author, speaker and teacher have paid the bills. I also supplement my income by playing music, selling original paintings, teaching and performing improv comedy, and more.  </p>\n\n\n\n<p>  \t<strong>I know first-hand what it's like to live a rich, creative life</strong>. I also know there are countless others around the world who would like to do the same thing ... but convince themselves that it is not possible.  </p>\n\n\n\n<p>  \t      In this course I'll take you by the hand and walk you through:  </p>\n\n\n\n<ul>  \t<li><strong>Laying the Foundation for Creative Success</strong></li>  \t<li>Setting Yourself Up to Thrive as an Artist</li>  \t<li><strong>Making Money and Growing Your Career</strong></li>  \t<li>Marketing Your Talent and Getting Paid</li>  \t<li><strong>Talking to Your Fans So They Support You</strong></li>  \t<li>Mastering the Art of Sales</li>  \t<li><strong>Preparing for a Long-Term Creative Career</strong></li>  </ul>\n\n\n\n<p>Make no mistake. Creative people have a long history of making a difference in the world. Most innovation and human progress over the centuries has come from human beings who think like artists.  </p>\n\n\n\n<p>  \t      But for some reason, the role of the artist has become diluted, and even frowned upon, in many cultures. And that's just wrong!  </p>\n\n\n\n<p>  \t<strong>Seriously, I'm tired of creative people being treated like second-class citizens</strong> (by themselves and others), when the truth is ... We are the ones who create the culture, innovation and new ideas that humanity needs now more than ever.  </p>\n\n\n\n<p>  \t      So, if you're ready to grow and thrive with your own unique brand of creativity, watch the welcome video and the preview lessons, then ...  </p>\n\n\n\n<p>  \t<strong>Register for this course on Udemy today and get lifetime access to the lessons</strong>. Watch them on your computer, or on your smartphone or tablet using the free Udemy app.  </p>\n\n\n\n<p>  \t<strong>Plus, it comes with a 30-Day, Money-Back Guarantee! </strong>  </p>", 
    "end_date": null, 
    "title": "30 Ways to Become an Empowered Artist", 
    "price": "20.00", 
    "instructors": "Bob Baker", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354140_a13e.jpg", 
    "course_url": "https://www.udemy.com/30-ways-empowered-artist/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T00:44:57Z"
}