{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you ever asked yourself these questions?</p>\n\n<ul><li>What is a good leader?</li><li>How do I develop great leadership qualities?</li><li>How do I inspire others to be more creative?</li></ul>\n\n<p>While there are numerous different answers to these questions, there is one thing that is incredibly clear:</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">It doesn't take a creative genius to lead people to creativity--it just takes a willingness to support your team in success.</strong><br></p>\n\n<p>If you want to learn how to lead people with confidence and creativty, then this class is the place to start. </p>\n\n<p><em>In this class you will get:</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">7 practical skills to building a more creative environment</strong>. Whether you are the leader of 1 or 1000, these practical steps will give you the framework for a more productive and harmonious work space.</p>\n\n\n\n<p>Sometimes we expect leaders to be the most knowledgeable or most innovative people in the room; in actuality,<em> a good leader is one that effectively creates an environment that allows people to thrive.</em> In essence, leaders are responsible for leading his or her team members into success.</p>\n\n\n\n<p>While there are any number of statistical reports, brain analyses, and business practices, I will bring you my leadership experience from one of the most unexpected places: the middle school classroom. Trust me, if I can get a room full of 12-13 year olds to be excited about learning, then I can help you!</p>\n\n<p><strong>Hear what others are saying about this class:</strong></p>\n\n<ul><li><em class=\"redactor-inline-converted\">\"Very good class. it takes many things we know and puts our thoughts in order and provides a new way to engage and to view creativity. This can be in the classroom or the workplace or even in our personal lives. These seven skills are universal.</em><em class=\"redactor-inline-converted\">\" ~Carolee</em></li></ul><p><span style=\"\"></span></p><ul><li><em class=\"redactor-inline-converted\">\"As a businessman, I enjoyed how simply I could apply his lessons to my work.\" ~Scott</em></li></ul><p><span style=\"\"></span></p><ul><li><em class=\"redactor-inline-converted\">\"I really like the simple objectivity of how this course is organized.</em><em class=\"redactor-inline-converted\">\" ~Luis</em></li></ul>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"></em></p>\n\n\n\n<p>By the end of this course, <strong class=\"redactor-inline-converted\">I'm confident that you will have a clearer vision of how to lead your group towards creative productivity.</strong><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">ENROLL TODAY--RISK FREE--BECAUSE YOU ARE BACKED BY UDEMY'S 30-DAY 100% MONEY BACK GUARANTEE.</strong></p>", 
    "end_date": null, 
    "title": "7 Creative Leadership Skills that Drive Change", 
    "price": "20.00", 
    "instructors": "Josh Withrow", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349958_7a9f_3.jpg", 
    "course_url": "https://www.udemy.com/leadership-skills-to-ignite-creativity/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T19:28:55Z"
}