{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Art Therapy: Online Art Therapy Course</p>\n\n<p>This art therapy course can be enjoyed by everyone and by all ages.<br></p>\n\n\n\n<p>You don't need to be a great artist, or indeed consider yourself to be particularly creative.  All you need is an imagination and an open mind to get the most from this art therapy course.</p>\n\n\n\n\n\n<p>We also offer an exclusive support service to Udemy students. On enrolment, you'll be given access to a fully supported learning experience which extends to personal support via email with the course creator, Libby Seery. As previously stated, this is a bespoke service available to Udemy students only.<strong></strong></p>\n\n\n\n\n\n<p>This art therapy online course is self paced and offers you complete flexibility. Choose to study at a time and place that suits you, safe in the knowledge that help is always at hand.</p>\n\n\n\n\n\n<p>Within this art therapy online course, you'll find a section on self exploration and healing painful emotions, as well as a section for pure enjoyment and recreation.  You'll also find a section on therapeutic art for family bonding. This is great for better communication and an appreciation for each other, as you learn and create with one another.</p>\n\n\n\n\n\n<p>Art and the therapeutic creative process of creating art, can be incredibly useful for children who may have experienced bullying or trauma and can provide a safe sanctuary to share our feelings and emotions.</p>\n\n\n\n\n\n<p>Art therapy can be described as being an expressive and creative, form of therapy. </p>\n\n\n\n\n\n<p>The therapeutic, creative process of self expression, can improve our physical and mental health, as well as our emotional well being. </p>\n\n\n\n\n\n<ul><li>It helps us to manage our feelings in a more positive way</li></ul>\n\n\n\n\n\n<ul><li>Can give us the confidence to address and resolve issues from the past and present</li></ul>\n\n\n\n\n\n<ul><li>Increase self esteem and develop a greater self awareness</li></ul>\n\n\n\n\n\n<p>Creating art through art therapy, provides an outlet to express yourself freely, which will encourage and promote a healthier, happier life. </p>\n\n\n\n\n\n<p>Did you know that colouring-in books for adults are outselling cook books? Colouring-in for just twenty minutes a day, can bring you enormous benefits, including:</p>\n\n\n\n\n\n<ul><li>A more relaxed state of mind</li></ul>\n\n\n\n\n\n<ul><li>Lowering stress hormones</li></ul>\n\n\n\n\n\n<ul><li>Help with insomnia</li></ul>\n\n\n\n\n\n<p>Art Therapy may sound a bit daunting, especially if you believe yourself not to be particularly artistic or creative. However, this need not be an issue, as the purpose of art is simply to express, and not to judge, or compare.</p>\n\n\n\n\n\n<p>Art should be an extension of how you're feeling, and for that you are your own expert. </p>\n\n\n\n\n\n<p>With well over 30 exercises and activities, here are just a few included in this art therapy online course:</p>\n\n\n\n\n\n<p>Scribble drawing for relaxation</p>\n\n\n\n\n\n<p>Painting your emotions</p>\n\n\n\n\n\n<p>Exploring our inner and outer self</p>\n\n\n\n\n\n<p>Meditative painting</p>\n\n\n\n\n\n<p>Self soothing images </p>\n\n\n\n\n\n<p>Creating your future with a vision board</p>\n\n\n\n\n\n<p>Create your own emotions wheel</p>\n\n\n\n\n\n<p>Zentangles and mandalas</p>\n\n\n\n\n\n<p>Accessing your inner child</p>\n\n\n\n\n\n<p>Creative writing</p>\n\n\n\n\n\n<p>There's also some super fun things to enjoy with younger ones, like face painting and creating your own pinata.</p>", 
    "end_date": null, 
    "title": "Art Therapy: Online Art Therapy Course", 
    "price": "20.00", 
    "instructors": "Libby Seery", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589308_9a01_3.jpg", 
    "course_url": "https://www.udemy.com/art-therapy-for-everyone/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T10:41:24Z"
}