{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                         La <strong style=\"\">biomimética</strong> es la ciencia que se fija en la naturaleza para resolver nuestros retos emulando las formas, procesos y sistemas naturales. Utiliza <strong style=\"\">la naturaleza como fuente de ideas creativas y soluciones innovadoras</strong>, que han pasado un proceso de prueba y error de 3800 millones de años.  </p>  <p>  \t                          Con más de una hora de vídeo, materiales adicionales, tareas prácticas y cuestionarios, este curso te permitirá descubrir <strong style=\"\">qué es la biomimética</strong>, <strong style=\"\">para qué se puede utilizar,</strong> las <strong style=\"\">ventajas que proporciona </strong>y <strong style=\"\">cómo podemos llevarla a la práctica</strong>. Todo ello basado en la identificación y traducción de las funciones de la naturaleza con el objetivo de poder aplicarlas a diferentes proyectos de ingeniería, diseño, organizaciones, etc. El curso está estructurado en <strong style=\"\">cinco secciones:</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">Introducción a la biomimética:</strong> conocerás su historia y las diferentes escalas en las que se aplica.</li>  \t<li><strong style=\"\">Niveles de analogía: </strong>descubrirás cada uno de los tres niveles junto con un ejemplo.</li>  \t<li><strong style=\"\">Identificar y traducir funciones:</strong> aprenderás a trasladar las soluciones de la naturaleza a campos técnológicos.</li>  \t<li><strong style=\"\">La biomimética en la práctica: </strong>Descubrirás las diferentes metodologías y conceptos para poder llevarla a práctica.</li>  \t<li><strong style=\"\">Conclusiones: </strong>Repasaremos lo aprendido y te propondremos un cuestionario final para afianzar tus conocimientos</li>  </ul>  <p>  \t<span style=\" color:inherit;\">Para empezar el curso, <strong style=\"\">h</strong></span><span style=\" color:inherit;\"><strong style=\"\">az clic en el botón &quot;Toma este curso&quot;</strong></span><span style=\" color:inherit;\"> en la parte superior</span><span style=\" color:inherit;\"> de esta página. </span><span style=\" color:inherit;\">El equipo de Biomimetiks estaremos a tu disposición para ayudarte con cualquier duda que te surja en el foro del curso.</span>  </p>  <h4><span style=\" color:inherit;\"></span></h4>", 
    "end_date": null, 
    "title": "Biomimética. Aprende a innovar inspirándote en la Naturaleza", 
    "price": "50.00", 
    "instructors": "Innobide Formación", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/146990_7408_11.jpg", 
    "course_url": "https://www.udemy.com/introduccion-a-la-biomimetica/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-14T21:46:34Z"
}