{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t             Why Take <strong style=\"\">This </strong>Course on Creative Genius?  </p>  <p>  \t            Hey,  </p>  <p>  \t            I know...You must be thinking.  </p>  <p>  \t<strong style=\"\">What is so special about this course?</strong>  </p>  <p>  \t            It&#039;s tough to evaluate any course like this because creativity is a &quot;Meta-Skill,&quot; meaning it is enormously powerful...  </p>  <p>  \t            but very difficult to measure and track progress.  </p>  <p>  \t            I&#039;ve spent over 5 years, hundreds of dollars and thousands of hours of my own time poring through dozens of the best books and courses out there on creativity.  </p>  <p>  \t            And I felt the same way you probably feel afterwords...<strong style=\"\">unsatisfied</strong>.  </p>  <p>  \t            Why?  </p>  <p>  \t            Because the products currently on the market fit into these two categories:  </p>  <ol style=\"\">  \t<li>Books and courses that tell you what a genius did, but not how they did it. <strong style=\"\">Stories instead of strategies</strong>.</li>  \t<li>Books and courses where a &quot;creativity expert&quot; projects their pet creativity strategies onto their favorite geniuses. <strong style=\"\">Projections instead of deconstruction.</strong></li>  </ol>  <p>  \t            Sure, stories are great. And almost any creativity strategies &quot;works&quot; in the sense that you will get some marginal, indeterminate &quot;bump&quot; in your creativity. But neither of these types of books or courses give you what you really need.  </p>  <p>  \t<strong style=\"\">A blueprint for creating the same kind of complete mental system that geniuses use to create their masterpieces.</strong>  </p>  <p>  \t          What does that mean?  </p>  <p>  \t<strong style=\"\">     In 1956, President Eisenhower</strong> signed into law the bill that created the interstate highway system in the United States. (If you are from Europe, think of the railroad system built in the 1800s) These 6 and 8 lane highways replaced the smaller and ill-kept roads that connected the country up until that point.  </p>  <p>  \t          The new highways increased trade massively and opened up the country to the full benefits of the industrial age.  </p>  <p>  \t          Cultural trends started passing across the country on interstate paths like Route 66.  </p>  <p>  \t          The interstate system also served the critical military purpose of evacuating millions of people quickly from cities in the event of an atomic bomb.  </p>  <p>  \t<strong style=\"\">     Eisenhower&#039;s vision took a vast but under-connected group of 48 states and turned it into a more unified country.</strong>  </p>  <p>  \t          Similar effects have resulted from the expansion of the telephone and internet. Each innovation massively improved the interconnectedness, productivity and creativity of the United States.  </p>  <p>  \t          Countries (and even continents, especially Africa) struggle economically and fail to produce creative geniuses because they lack this basic infrastructure that underpins all creative and productive efforts.  </p>  <p>  \t<strong style=\"\">     So what?</strong>  </p>  <p>  \t          Well, it turn’s out that<strong style=\"\"> your brain is really just a big network of neurons</strong> connected to each other.  </p>  <p>  \t          Each time you think a thought, the connection between the neurons your brain just fired get “myelinated.”  </p>  <p>  \t          Your “Train of Thought” rides along a path of neurons every time you think a thought. Mylin, an insulator made of fat, wraps around that path of neurons (just like rubber around a USB cable) and makes that train of thought go faster next time you think the same thought.  </p>  <p>  \t          Geniuses have found a way to hack this natural process.  </p>  <p>  \t          Most of us never intentionally try to connect the different areas of our brain, the different “neural nets” that represent our different areas of interest or expertise.  </p>  <p>  \t<strong style=\"\">     But these connections are the most important part of creativity.</strong>  </p>  <p>  \t          And the difference between a genius brain and an average brain is how it’s wired.  </p>  <p>  \t<strong style=\"\">     A genius has built (often unintentionally) the equivalent of an “interstate highways system” between their different areas of expertise.</strong>  </p>  <p>  \t          This system allows them to “trade” thoughts between different domains of knowledge to generate creative breakthroughs.  </p>  <p>  \t          Remember how Steve Jobs credited his calligraphy class to his knack for intuitive design?  </p>  <p>  \t          He couldn’t have done what he did without this sort of “creative interstate system” running 24/7 in his brain, allowing it to generate one blockbuster, industry transforming product after another.  </p>  <p>  \t          The first half of the course will take you through building this system in your brain. The second half will show you how to maximize your use of your new “creative interstate system” once you have built it.  </p>  <p>  \t<a href=\"https://www.udemy.com/payment/checkout/?boId=201872&amp;boType=course&amp;dtcode=7sxlhnu9\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Click Here to Begin the Course</a>  </p>  <p>  \t          See you on the other side,  </p>  <p>  \t          Timothy  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Description from the Back of the Box</strong>  </p>  <p>  \t                  The biggest lie about Genius is that genius is inborn. IQ is inborn. Genius is the combination of IQ and other factors. The truth is, many geniuses were only slightly above average in terms of IQ (Richard Feynman, widely regarded as the last American genius, had an IQ of only 122)… it is their thinking strategies that made them exceptional.  </p>  <p>  \t                  The other big lie about genius is that it only relates to intellectual performance. The truth is that there are 9 intelligence types, and a genius is someone who excels in any one of those areas. But because western culture values intellectual performance above all others, our collective view of genius is skewed. In fact, the root word of genius comes from Greek. Genius originally meant the potential within any person that, if cultivated, would make them exceptional in what they were born to do.  </p>  <p>  \t                  This course is only meant for people who believe the secret to talent is 80% strategy and 20% genetics, not the other way around. Ideally you have already read my book and taken some of my other courses, because I will only be covering advanced ideas in this class.  </p>  <p>  \t                  The key difference between this class and other books and courses on genius is that you will not just learn the stories of geniuses and what they did, but how to actually apply the strategies and build the frameworks in your own head so that they are useable and you actually feel and see yourself getting smarter and more creative.  </p>  <p>  \t<strong style=\"\">The patterns of Genius we will cover:</strong>  </p>  <p>  \t                  Geniuses look at problems from multiple perspectives  </p>  <p>  \t                  Geniuses think in images so that they can see systems, hierarchies, and larger patterns  </p>  <p>  \t                  Geniuses master the language of metaphor, which allows them to see patterns nobody else sees  </p>  <p>  \t                  Geniuses live in the flow and have the ability to remove distractions and focus  </p>  <p>  \t                  What you will learn:  </p>  <ol style=\"\">  \t<li>How multiple intelligences work, which ones are your strengths and how to develop the other areas in key areas for the highest short term payoff</li>  \t<li>How to install many different perspectives into your brain quickly. This is not just lateral thinking.</li>  \t<li>How to think in systems so you see everything from a birds eye view by using visual mapping for all your ideas</li>  \t<li>How to download a ton of the most common metaphors into your head so that you start seeing them everywhere</li>  \t<li>How to set up your life and your workspace so you can consistently get into the flow and stay there</li>  \t<li>Why vertical and lateral thinking is not enough if you want to unlock your genius potential, and what to do to get there</li>  \t<li>4 non-thinking habits of geniuses that you can instantly incorporate into your daily routine and work habits</li>  \t<li>How to see the genius in everyone you meet and how to foster the latent genius in your children</li>  \t<li>The epic genius battle stories between Thomas Edison and Nikola Tesla and how to incorporate their different approaches/flavors of genius into your own thinking</li>  </ol>", 
    "end_date": null, 
    "title": "Creativity: Creative Genius for Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/201872_4c4d_5.jpg", 
    "course_url": "https://www.udemy.com/creative-genius/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-19T22:26:28Z"
}