{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn the basic principles of creative and lateral thinking. Then learn the practical tools and techniques to solve all kinds of problems at work, and beyond… creatively.</p>    <p><strong>Generate multiple potential solutions with the techniques you will learn from this course to help find the ‘gem’ that elegantly solves your problem.</strong></p>  <ul><li>Principles of creativity and creative problem solving</li><li>Warm-up techniques</li><li>Analogy techniques</li><li>Consult techniques</li><li>Inaction techniques</li></ul>            <p><strong>Multiple techniques for multiple solutions</strong></p>  <p>Everyone has to deal with problems every day in one way or another. Some problems have obvious solutions; others do not. This course will help you deal with problems where the solution is less than obvious or where previous solutions have not worked as well as expected.</p>    <p>The more techniques you apply to a particular problem, the more potential solutions you will generate. This is demonstrated in the course where you can apply different techniques to the same example problem and different potential solutions are generated.</p>    <p><strong>Once you have learned these techniques, you may well start actively <em>hunting</em> for problems to apply them to!</strong></p>  <p><strong> </strong></p>  <p><strong> </strong></p>  <p><strong>Content and overview</strong></p>  <p>This course is suitable for anyone who has to deal with significant problems on a regular or frequent basis - especially at work. It provides you with 27 lectures including 5 practice activities, 44 minutes of video, plus interative exercises within the videos. All of the information you see on screen is also available to you as a downloadable resource.<br></p>    <p>The course starts by taking you through the principles of creativity and creative problem solving. </p>    <p>You will then learn twelve techniques to help you produce potential solutions to problems, at work or beyond. </p><p>For most of the techniques you will learn the process of applying them on a step-by-step basis. You will then see an example of the technique being used on a realistic problem, followed by an opportunity for you to practice the technique for yourself.</p>    <p>In the final section of the course you will learn some of the barriers to creativity that can often arise, and how to overcome them. You will also learn some of the legitimate constraints that you may need to work within when implementing any of your solutions.</p>    .And of course, you have a 30 day money back satisfaction guarantee.", 
    "end_date": null, 
    "title": "Creative Problem Solving", 
    "price": "20.00", 
    "instructors": "John Rodwell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777796_4dfa_4.jpg", 
    "course_url": "https://www.udemy.com/creative-problem-solving-o/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T14:41:51Z"
}