{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This is not a common course about <strong style=\"\">Creative Thinking</strong>, but a positive mindshake to help open your mind to what is possible and make you question what you usually take for granted. <strong style=\"\">A course focused on exploring possibilities.</strong></p><p style=\"\">Through <strong style=\"\">11 sessions </strong>you will journey to a broader view about Creativity in a very easy way. Each session has a theme that is developed in 4 to 7 short videos, plus a summary-video, so your attention stays focused all the time. You will have <strong style=\"\">3,5 hours of videos, </strong>in total, that you can watch according to your needs. You will also find quizzes and experiential activities after each of the sessions, including lots of additional resources that you can explore (links to videos, articles, book references). Plus, <strong style=\"\">you will have the instructor available to reply to all your questions at least twice per week.</strong></p><p style=\"\"><strong style=\"\">This course will be mostly focused on the person,</strong> as the basis of the Creative Thinker. The majority of the content is centered on the structure any creative person should have before starting to create: <strong style=\"\">consciousness, ability to think big, unconstrained perspective, openness to inspiration and to relationships.</strong> </p><p style=\"\">We will also focus on <strong style=\"\">practical aspects of the creative process</strong>: its different steps and phases, some of the most used techniques to generate and systematize ideas and the most common blocks on creativity including suggestions to overcome them. </p><p style=\"\">Finally, we will explore <strong style=\"\">contexts where you can apply your creative thinking</strong>. It can be in your own personal life, or in the society that surrounds you, from your closer circle to your neighborhood or country. </p><p style=\"\">The course is <strong style=\"\">taught through examples and personal stories</strong> from the Portuguese instructor, illustrating scientific research in an easy to understand way. At the end, you will probably feel that you belong to her creative tribe, too. And the course gets better and better, so don&#039;t judge it for the first sessions.</p><p style=\"\">Take all the inspiration, insights and techniques you can from this course and start changing your world. <strong style=\"\">It is all in your hands just waiting for you to open your mind and embrace the creative thinker inside you!</strong></p><p style=\"\">Video credits:</p><p style=\"\">- The course was produced and developed by Edite Amorim with the collaboration of Rita Pureza and video and edition by Mário Brandão<span></span></p>", 
    "end_date": null, 
    "title": "Creative Thinking", 
    "price": "50.00", 
    "instructors": "Edite Amorim", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418222_b4cb_2.jpg", 
    "course_url": "https://www.udemy.com/creative-thinking-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T12:06:00Z"
}