{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Creativity and Innovation</strong> are your birthright.  Whether you know it or not, you have the capacity for Creative Genius Within You Right Now.</p>\n\n<p>Some people believe that you are either born with creativity or you're not.</p>\n\n\n\n<p>The good news is that creativity is a skill that can be learned and practiced, which means you can can increase your creative abilities.</p>\n\n\n\n<p>When you <strong>watch the video above</strong>, check out the reviews, previews and description below, then you will get a more clear picture of how this course will help you.<br></p>\n\n\n\n<p><em>*Course up to date as of 4/20/16*</em></p>\n\n\n\n<p>This is currently The Very <em><strong>Top Paid Creativity Course</strong></em> On Udemy</p>\n\n\n\n<p>*<strong>4,900+ students</strong> in 142 Countries</p>\n\n\n\n<p>*40 Student Reviews (<em><strong>Overall Student Rating 4.8</strong></em>)</p>\n\n\n\n<p><strong>Here's a few recent reviews:</strong></p>\n\n\n\n<p>\"Awesome materials</p>\n\n\n\n<p>I really enjoyed the analysis of how Creativity gets sabotaged and we don't even notice it! The steps Ken describes to overcome any obstacle that gets in the way between you and your true potential are so helpful and easy to follow, I loved this course! :)\"<br></p>\n\n\n\n<p><strong><em>-Elena Seranova</em></strong></p>\n\n\n\n<p>\"Excellent Class</p>\n\n\n\n<p>Ken cuts to the chase and breaks things down into easy to understand language of our conscious minds and brain states. Whoever knew, other than neuroscience? He describes many ways to overcome that nagging feeling in the pit of your stomach, that you're supposed to be doing something with your life, and just can't carry it to task.<br></p>\n\n\n\n<p>He references concepts and lays out strategies we can implement to use the \"right\" part of our brains to get the most accomplished, and hopefully, into a better mindset to achieve our goals.</p>\n\n\n\n<p>Ken is not only a great instructor; he's not afraid to show his human side, someone most of us, can relate to!\"</p>\n\n\n\n<p><strong><em>-Marie Patten</em></strong></p>\n\n\n\n<p>\"Brilliant!</p>\n\n\n\n<p>I loved this course...it starts off with a bang and remains sharp until the end.\"<br></p>\n\n\n\n<p><strong><em>-Darnell Rinehart</em></strong></p>\n\n\n\n<p>\"Creativity Tools &amp; Techniques</p>\n\n\n\n<p>Easy to follow, course is well organized, content is usable and in depth, the instructor is engaging and interesting. Not your average course on Creativity. This one dives deeper and gets into the psychological aspect of creativity more than most.\"<br></p>\n\n\n\n<p><strong><em>-Perry Lyons</em></strong></p>\n\n\n\n<p>\"Enlightening &amp; Interesting!</p>\n\n\n\n<p>This course is very informative and engaging.\"<br></p>\n\n\n\n<p><strong><em>-Soon Kheng, Chan</em></strong></p>\n\n\n\n<p>This course will take you from knowing nothing about creativity, to teaching you how to <strong>unleash your own creative genius</strong> and even bring your creative vision to life.</p>\n\n\n\n<p><strong>Here's What You Will Be Able to Do After You Enroll in this Course:</strong></p>\n\n\n\n<ul><li>Naturally Create More Creative Brain States</li><li>Generate Creative Ideas at Will</li><li>Find Creative Solutions to Problems Quickly</li><li>Overcome Procrastination to Taking Action on Your Creative Ideas</li><li>Find More Joy and Fulfillment in Life Through Increased Self-Expression</li><li>Unlock Your Inner Creative Genius</li></ul>\n\n\n\n<p><strong>Here's Some of What You Will Learn in this Course:</strong></p>\n\n\n\n<ul><li>Understanding The Best Brain States That Naturally Give Rise to Creativity</li><li>How to Easily Get into a More Creative Frame of Mind</li><li>A Simple Often Overlooked Method to Get Your Creative Juices Flowing</li><li>The \"Random Cocktail Method” For Coming Up with Fresh Ideas</li><li>How to Use “The Letter Idea Generator” To Boost Your Creativity</li><li>A Powerful Technique to Quickly Find Solutions to Problems</li><li>How to Easily Transform Your Worldview &amp; See Solutions Everywhere</li><li>How to Turn Problems Into Opportunities &amp; Resources Fast</li><li>A Simple Way to a Fresh, New Perspective</li><li>How to Beat The Biggest Enemy of Creativity</li><li>How to Avoid The Major Pitfall Faced By Artists &amp; High Achievers</li><li>How to Overcome Writer's Block...The Right Way</li><li>Outline a Plan for a Bringing Your Creative Vision to Life</li></ul>\n\n\n\n<p><strong>Why You Should Take This Course:</strong><br></p>\n\n\n\n<ol><li>Enhanced Creativity</li><li>Understand How to Use Your Mind to Avoid Problems</li><li>Greater Self-Expression</li><li>Increased Problem Solving skills</li><li>Develop a More Creative Perspective</li><li>Overcome Limiting Beliefs</li><li>Avoid Common Creative Mistakes</li><li>Learn How to Use Your Mind Creativity</li><li>More Self-Confidence</li><li>Overcome Your Fears Related to Creativity</li><li>Greater Control Over Your Emotions &amp; Thoughts</li><li>Become More Productive</li><li>Establish Successful Creative Habits</li><li>Ability to Use Your Mind Effectively for Goal Achievement</li><li>Stronger Sense of Self &amp; Creative Identity</li><li>Develop Lasting Creative Qualities</li></ol>\n\n\n\n<p><strong>What Should I Do Now?</strong></p>\n\n\n\n<p>Give this course a chance to help you increase your creative skills &amp; abilities.  You <em>can</em> truly unlock the power of your creative genius and change your life. I'm looking forward to seeing you on the inside if you choose to enroll.</p>\n\n\n\n<p>I invite you to notice that every moment that you're not leading the way in life, is time wasted pursuing someone else's dream.</p>\n\n\n\n<p>So you can, breath, relax, <strong>enroll in the course now</strong> and begin to bring your creative vision to life!</p>", 
    "end_date": null, 
    "title": "Creativity Made Simple:  Easily Discover Your Creativity", 
    "price": "20.00", 
    "instructors": "Ken Wells", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660532_15e7_3.jpg", 
    "course_url": "https://www.udemy.com/creativity-s/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T23:37:07Z"
}