{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>First of all, I tell you the conclusion: the truth about creativity, so you save your time. Creativity is \"<strong>How you connect things</strong>\".</p>  <p>\t You do not have to join conferences to be creative, to learn design to be creative, and to go to school paying tons of money to be creative. You can be creative from this moment, right now, in the present. It is just about how you connect things that you already known and experienced. However, because of the education system and common sense, the way you connect them is directed to a specific direction. You have been made think in a certain way.</p>  <p>\t<strong>My mission is making the humanity awake. </strong>  </p>  <p>\t The importance of Creativity has been increasing dramatically. Adobe said CREATIVITY drives business success. IBM reported that CREATIVITY is Selected as Most Crucial Factor for Future Success. Deloitte mentioned 'Digital know-how', 'management' and CREATIVITY are the skills London businesses increasingly need. There is no doubt Creativity is the key to survive in the 21st century and enjoy your potential. There are so many classes and subjects but no one shares with you “How to think\" to make the most of them creatively.</p>  <p>\t Your will learn “HOW TO THINK\" to be creative. By taking this course, you would experience a paradigm shift in your way of thinking and be able to CONNECT THINGS DIFFERENTLY as Steve Jobs said that creativity is about connecting dots.</p>  <p>\t<strong>The lecturer </strong>  </p>  <p>\t Masaaki Hasegawa has rich experience in international business and creation. He has experience as an investment strategist at Daiwa Securities, which is listed on the first section of Tokyo Stock Exchange, professional MMA fighter, and public speaker. He joined FITC Tokyo 2014 as the youngest speaker. He is now based in Spain and joined White Bull and 3 Day Startup Madrid as a mentor, and also shared his insight at Creative Morning Madrid. He is the founder of Third Vision and the author of Yes Progressive.</p>  <p>\t<strong>This course is for・・・</strong>  </p>  <p>\t This course is for those who wish to have their creative minds freed and expanded. It is for those who have a true passion to be creative. I do not wish to dictate what you do, but simply open your eyes to your own creative visions and possibilities. If you commit yourself to the suggestions in the course, you will change your viewpoints and develop a much higher sense of the creativity within yourself. Being creative is not just academia but rather changing one's way of viewing, thinking about and interpreting the world around us. <strong>Are you ready to develop creativity for your own sake?</strong> What you learn here is not a formula for differentiating yourself from others but a way of thinking that will transform the present you to a more creative you.</p>  <p>\t<strong>The basic flow of the course</strong>  </p>  <p>\t 1. Essence of Creativity</p>  <p>\t 2. Structuring creative Mindset</p>  <p>\t 3. Verbal approach to enhance your creativity</p>  <p>\t 4. Non-verbal approach to enhance your creativity</p>  <p>\t 5. Progressive Thinking ~to Think Differently</p>  <p>\t 6. Third Vision ~to have completely new perspective~</p>", 
    "end_date": null, 
    "title": "Creativity: Making a paradigm shift in your Creativity", 
    "price": "20.00", 
    "instructors": "Masaaki Hasegawa", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358398_d51d_7.jpg", 
    "course_url": "https://www.udemy.com/creativity-progressive-thinking/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T11:34:00Z"
}