{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Creative Writing is a fun and potentially profitable hobby. Writing needn't be intimidating or scary, and this course will get you started!</p><p>This Creative Writing course has a fun informal style, to help you become more aware of your writing style and improve your skills. If you're looking to get started with creative writing and want to unlock your creativity and imagination, this course is for you. We encourage everyone to write at least a tiny bit every day, and capture the fascinating world around them. This course will suit those who are busy and want to fit writing around their lifestyle, or those who eventually seek to write full time or get published.<br></p><p>A relaxed, fun course to act as a creative writing jump start! If you are looking to be inspired to get writing, this course contains tips and hints for being motivated and inspired to put your pen to paper or digits on the keyboard.</p><p>Creative writing is accessible to everyone regardless of how busy you are, our education history, or your eventual goals. Join us on the course and start having fun with words!</p><p>Course outline contains:</p><ul><li>Practical advice to get you writing on a daily basis</li><li>Expert tips from a creative writing professional</li><li>How to get paid for your writing when you're ready</li><li>Controlling, and silencing, the fears and negativity in your head</li><li>Enjoying writing and capturing moments around you</li><li>Tools and tips to reduce the barriers to writing</li></ul>", 
    "end_date": null, 
    "title": "Creative Writing - Get Writing, Keep Writing", 
    "price": "20.00", 
    "instructors": "Tracy Baines, Louise Croft", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608924_e590.jpg", 
    "course_url": "https://www.udemy.com/get-writing-keep-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T08:48:16Z"
}