{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>*** Over <strong>500 new students</strong> and three <strong>5 star reviews</strong> in the first 10 days of this course ***</p><p>Getting funding for your creative projects can be a really frustrating task and the good news of the last few years is crowdfunding!</p><p><strong>Crowdfunding is a very accessible and realistic way to get your creative work funded.</strong></p><p>Knowing how to run a successful crowdfunding campaign will allow you to get not only the money you need but also exposure for you and your work and to start (or continue) building a fan base - happy to follow your work for years to come.</p><p>You will learn how to use crowdfunding in an effective way to get the money you need and create the work you want. This course breaks down all the different elements needed for a successful crowdfunding campaign including many secrets from “behind the scenes\" promotion of successful campaigns.</p><p><strong>Start today and get the money you need for your art.</strong></p><p>With 33 lectures and 3 hours of video content this course will to take you through clear and simple steps from planning your campaign to what you do after.</p> <ul><li>How to choose the right crowdfunding platform for you.</li> <li>What are the differences between campaign types.</li> <li>How to create an effective crowdfunding video, a great reward list and other things you should add to your page</li> <li>How (and when) to approach each group of people to get the most support.</li> <li>What to do after your campaign's finished.</li> <li>Homework exercises</li></ul> <p>I really want you to have a successful campaign and a great experience working on it, so don't hesitate to approach me with questions while you are taking this course.</p><p><strong><em>“Tal, I have just finished all the videos, and I have to tell you, your content is amazing, <br style=\"\">Thank you so much, it's really great, inspiring and encouraging.\" </em></strong> Vincent Leleux, artist and poet</p>", 
    "end_date": null, 
    "title": "Crowdfunding for Artists: Get Funding to Create Your Artwork", 
    "price": "40.00", 
    "instructors": "Tal Jakubowiczova", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489352_88ab_2.jpg", 
    "course_url": "https://www.udemy.com/crowdfunding4artists/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T11:39:09Z"
}