{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>¿Por qué apuntarse a este curso?</strong><strong></strong><br></p><p>Este curso trata el tema tan importante del hábito de la lectura en los niños, no basta con aprender a leer, la sociedad necesita ciudadanos interesados en leer. La lectura trae más beneficios de los que podamos imaginar, no sólo a nivel intelectual sino también a nivel social y por supuesto personal. </p><p>En base a mi experiencia e investigación ofreceré en este curso la información necesaria para comprender la mejor metodología para enseñar a leer a los niños, así como también consejos y herramientas para hacer del proceso de aprendizaje de la lectura una experiencia agradable y una hábito de toda la vida.</p><p><strong>El objetivo y estructura de este curso es</strong>  sencilla y va desde la base teórica hasta la práctica:</p><p>1. Sección de bienvenida.</p><p>2. Los métodos conocidos como los más efectivos para enseñar a leer.</p><p>3. Los beneficios de la lectura.</p><p>4. Herramientas para iniciarse en la lectura.</p><p><strong>¿Qué tipo de materiales incluye?</strong></p><ul><li>Con videos e imágenes explicativas y material de apoyo, este curso ofrece una guía completa.</li><li>El curso tiene una estructura y una terminología sencilla, con recursos que te permitirán llevar a cabo con éxito los objetivos del mismo.</li><li>Las clases se van a actualizar constantemente. Contarás con mi apoyo y asesoría a lo largo del curso.</li></ul><p><strong>Garantías</strong><br></p><ol><li>Acceso de por vida</li><li>30 días de garantía. Devolución de dinero si no estás satisfecho ( te aseguro que no te arrepentirás).</li></ol><p><strong>Beneficios</strong></p><ol><li>Descubrir la magia de la lectura.</li><li>Niños más creativos y felices.</li><li>Invertir en cultura es invertir es desarrollo personal.</li><li>Guía y asesoría del instructor a lo largo del curso.</li></ol><p><br></p>", 
    "end_date": null, 
    "title": "Cómo desarrollar el hábito de leer en los niños", 
    "price": "20.00", 
    "instructors": "Alejandra Acuña", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634252_ef6a.jpg", 
    "course_url": "https://www.udemy.com/como-desarrollar-el-habito-de-la-lectura-en-los-ninos/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T01:02:44Z"
}