{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>I know how hard it is to edit your first draft.</p>\n\n<p>I know how hard it is to WRITE your first draft, to begin with!</p>\n\n<p>I've been where you are.</p>\n\n<p>Perhaps disappointed by what you've written.</p>\n\n<p>Perhaps feeling that it's not QUITE what you had in mind.</p>\n\n<p>Well, this is the right course for you.</p>\n\n<p>First, I take a POSITIVE and FUN approach to editing.</p>\n\n<p>Nothing to be dreaded or afraid of.</p>\n\n<p>I've written six novels and a bucket load of short stories.</p>\n\n<p>Three of my novels are published, as is my collection of short stories.</p>\n\n<p>Now here's the thing.</p>\n\n<p>My novels were TERRIBLE when I finished writing them.</p>\n\n<p>Really, really awful.</p>\n\n<p>So, I got help. I learned everything I could about editing your novel from some great books and some great online courses, including those by the wonderful Holly Lisle and the amazing Shawn Coyne and the brilliant James Scott Bell, among many, many other great writers and editors.</p><p>I also worked with genius editors through draft after draft and learned from what they told me about my writing (some of it eye opening).</p><p>And I discovered online resources you won't believe exist -- they are that good!</p><p>This course can be finished in an hour, but in my opinion it should ideally be used this way:</p><p>     1. After the intro lessons, take ONE lesson, learn from it.</p><p>     2. Then, APPLY it to your current manuscript.</p><p>     3. When you're done, come back and take the next lesson.</p><p>     4. Apply what you've learned to your manuscript AGAIN.</p><p>     5. Rinse and repeat.</p><p>In this manner, make your way through the course.</p><p>When you are done with the course — whether it takes you hours, days, weeks, or months -- so, too, your manuscript will be done!</p><p>So don't delay. I promise it's painless. You'll learn a lot and have fun doing it.</p><p>And remember, this course, like all the courses on udemy.com, is yours to access forever.</p><p>That's really good for two reasons:</p><p>You can retake the course every time you have a new novel or short story to edit</p><p>The course will increase in content over time, and will always be up-to-date, because I will be adding new courses and refreshing existing courses all the time.</p><p>So sign up, and best of luck.</p><p>And remember, you can always ask me questions right in the course.</p><p>This course — again, like all of udemy's courses — are personal. They aren't just posted here and forgotten. Letting you sink or swim on your own.</p><p>I'll be here to offer advice, answer questions, and guide you through the rough spots.</p><p>Aren't you excited to get started? I am eager to have you jump in with both feet!</p><p>Let's do this!</p><p>Best,</p><p>Carl</p>", 
    "end_date": null, 
    "title": "Edit Your Novel the Right Way!", 
    "price": "20.00", 
    "instructors": "Carl Plumer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581214_2f37_6.jpg", 
    "course_url": "https://www.udemy.com/writers-success-series-edit-your-novel-the-right-way/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T14:58:21Z"
}