{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Todos sabemos que el camino de la creatividad es arduo, complicado y todas las veces, bastante menos que asfaltado.</p>\n\n<p>Pero también existen muchos mitos acerca del talento necesario, el pánico a la hoja en blanco y demás cosas, que solo fueron inventadas para dejar estos procesos en manos de unos pocos.</p>\n\n<p>Bueno, ¡eso se acabó! </p>\n\n<p>Aquí te traigo un curso que te enseñará a desarrollar historias interesantísimas, sólidas y tan atractivas que te sorprenderás de lo rápido que vences tus miedos y de lo lejos que llevas tu potencial creativo.</p>\n\n<p>A través de simples y cortos videos explicativos, primero, te enseñaré a dar vida a un personaje fuerte; luego, veremos la importancia de construir antagonistas para generar conflictos y veremos paso a paso cómo construir un relato con ellos; finalmente, llevaremos ese relato al lenguaje audiovisual.</p>\n\n<p>En solamente tres clases, de no más de 20 minutos en total, podrás aprender de forma fácil y rápida cómo llevar adelante el proceso creativo de escritura.</p>\n\n<p>¡Pero eso no es todo! </p>\n\n<p>Siguiendo los lineamientos de este curso, construiré un personaje sólido y le crearé los antagonistas; armaré un relato con ellos y, luego, lo convertiré en un guion de cortometraje al que podrás acceder cuantas veces quieras. Seré la primera en llevar adelante este proceso para demostrarte prácticamente por qué puedes confiar en mí y en este curso.</p>\n\n<p>Una vez finalizadas las tres clases, a través de dos videos, te llevaré en un recorrido por el desglose de ese guion, para que puedas adentrarte en la mente de una guionista y que te sirva de ejemplo para tus futuras creaciones.</p>\n\n<p>Pero... ¡espera! ¡Todavía hay más!</p>\n\n<p>Con este curso, te llevarás de regalo una copia digital de mi libro de teoría de guion de cine \"La vuelta al guion en 80 secretos\", en el que podrás encontrar aun más herramientas para desarrollar tu creatividad, resolver problemas de escritura y aprender acerca del lenguaje cinematográfico.</p>\n\n<p>¡Te espero para que emprendamos juntos este maravilloso viaje por el mundo de la escritura creativa!</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Escribe un Guion de \u000bCortometraje en 3 Pasos", 
    "price": "20.00", 
    "instructors": "Escritora. Guionista. Script Dr. Laura de los Santos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/800950_4178.jpg", 
    "course_url": "https://www.udemy.com/guiondecortoen3pasos/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T15:05:13Z"
}