{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you fallen out of love with your writing? Were you able to write whirlwind drafts, but now it's a constant struggle to get anything written? Do you feel congested by all of the options that screenwriting has? </p>  <p>This course will help you. </p>  <p><strong>Recapturing the magic of writing </strong></p>  <ul><li>Understanding the driving force behind every worthwhile      project put to screen and literature. </li><li>Tips and tricks that will help you utilize different      parts of creativity and make you a better writer </li><li>Real life examples of how these techniques were      utilized </li></ul>  <p>This course will save you from the agony of being stuck. </p>  <p>In this two hour course with 40 lectures, the essentials of why we write will be given to you. In this society of hypercritical pop culture and attempted observational humor, we cut the fat and remind ourselves why we write stories. </p>  <p>By the end of this course, you will figure out what you need to make your story pop. You will have regained your focus. </p>  <p>What are the requirements? </p>  <p>A legal pad. </p>  <p>A willingness to learn. </p>  <p>Who is the target audience? </p>  <p>Novelists and screenwriters who have problems finishing their latest project. </p>  <p>New writers who might be afraid of taking that next step. </p>      <p>This course will help you analyze the reasons why a lot of writers have problems writing their screenplays or novels. This course will analyze the various pitfalls that contribute to writer's block and how to overcome them. </p>  <p>For best results, students should have a project they wish to complete before taking this class. An understanding of prose and screenwriting would be a big plus for taking this course. This course was created with the belief that, above format, a writer's gift comes from their passion. Be inspired again. </p>  <p>No additional software is required. </p>  <p>This course will help you finish your work.</p>", 
    "end_date": null, 
    "title": "Finishing Your Awesome Story", 
    "price": "20.00", 
    "instructors": "Redd Kaiman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689310_1036_2.jpg", 
    "course_url": "https://www.udemy.com/finishing-your-awesome-story/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-05T02:19:06Z"
}