{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong></strong>THESE TIPS &amp; TOOLS HELPED ME GET MY <strong>SEVEN</strong> NOVELS WRITTEN AND THEY WILL WORK FOR YOU, TOO!</p><p><em><strong><em>► </em>Have you always wanted to write a novel, but not sure you can do it?</strong></em></p><p><em><strong><em>► </em>Do you have a love of language, but are afraid you'll get stuck with only a few pages written?</strong></em></p><p><em><strong><em>► </em>Are you suffering from fear or procrastination when it comes to writing a novel?</strong></em></p><p><em></em></p><p>Well, then you've come to the right place!</p><p><strong></strong></p><p><em>If You Can Follow Simple Directions, Here's How To Get Your\nNovel Written In Your Spare Time — And Have Fun Doing It!\n\n</em><em></em></p><p>→ → → WHY THIS COURSE? ← ← ←</p><p>This course is for every writer who wants to write but finds that days go by and still they are no closer to their dream of writing a novel.  This course requires only three things:</p><ol><li>The love of writing</li><li>The love of exploring your own mind</li><li>The love of a job well done</li></ol><p>If you have these three (and I'm pretty sure you do), then this course will help you reach your goal of having a finished novel in your hands, ready to ship or email to an agent, or publish on your own!</p><p>This is a fast and fun course that will guide you gently through the creative process covering such areas as:</p><ul><li>How to conquer procrastination</li><li>\"Top secret\" software that will keep you writing</li><li>Techniques to meet your word count that “they” don’t want you to know about</li><li>POV - why it’s important to pick one in your first draft</li></ul><p><em>and much, much more!</em></p><p><strong>Why Listen To Me?</strong></p><p>I have a Masters in Creative Writing and have taken many, <em>many</em> courses on writing, and I have studied literally hundreds of books about the craft of writing. As far as I am concerned, I have earned me the equivalent of a PhD in writing! I've also been a judge on an international writing contest, so I know what I'm doing and people respect my judgement.</p><p>My teachers (for both the books and in the courses) have been the best of the best. In other words, I've learned from the experts. In addition, I have written all my life: I've been a technical writer, scientific report writer, proposal writer, and aftermarket software writer (you know, the books you buy at bookstores that <em>really</em> tell you how to use software, with tips 'n' tricks and all that).</p><p>But always and foremost, I am a creative writer—a novelist. I currently have three novels and a collection of short stories available online everywhere. One of my books was an Amazon Breakthrough Novel Award finalist. By early 2017, I will have ten books out—five more novels and another collection of stories.</p><p><strong>Try This Course TODAY!</strong></p><p>This is a brand new course for AUTHORS. I'm sure you will love the course and immediately benefit from what you learn. As with all of the WRITERS' SUCCESS SERIES courses, ask as many questions as you need to in the discussion area. I'll answer promptly.</p><p><em>No-Risk Trial </em>If you are interested in finding out how to take this essential step to becoming a REAL writer, try my course risk-free. This course comes with a 30-day money-back guarantee. Should you decide it's not for you, no problem and I thank you for giving it a try.</p><p><strong>Sign Up Now, And Be On Your Way to Great Writing</strong></p><p><em>Scroll back up and click the green <strong>Take This Course </strong>button in the upper right of the udemy screen and enroll. Don't wait another day to turn your dreams of being a successful writer into reality. See you inside!</em><br></p><p>++++++++++++++</p><p>Fully up-to-date as of November, 2015</p>", 
    "end_date": null, 
    "title": "Get Your First Draft Written Right!", 
    "price": "20.00", 
    "instructors": "Carl Plumer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421096_754e_2.jpg", 
    "course_url": "https://www.udemy.com/writers-success-series-get-your-first-draft-written-right/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T15:05:49Z"
}