{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\"><li style=\"\"><span style=\"\"></span>How do you get high quality, without getting all tangled up with self-criticism and pesky perfectionism?</li><li style=\"\">How do you stay on target when the MAKE process takes weeks, or even months?</li><li style=\"\">How do you take care of both the trees AND the forest?</li></ul><p style=\"\">Realizing an attractive vision is never an easy task; and the more exciting and rare your mission is, the more treacherous and confusing the path becomes. </p><p style=\"\">In this course you&#039;ll learn how to</p><ul style=\"\"><li style=\"\">Let your inner critic and your inner artist work effectively together</li><li style=\"\">Work faster and with more control with the principle of exponential progress</li><li style=\"\">Judge your work more objectively</li><li style=\"\">Polish the finest details, without losing focus on the big picture</li><li style=\"\">Avoid the dangers and pitfalls of the longest and toughest part of the creative process.</li></ul><p style=\"\">GO MAKE is the 4rd in a 5 courses program called GO CREATE - a complete guide to the universal creative process. You can take GO MAKE as a standalone course, or take the entire program for a fully integrated creative working method.</p><p style=\"\">Like with all GO CREATE courses, I&#039;ve made an effort to fit everything into a mean and lean 60 minutes course. Take the course now, and in just one short hour you&#039;ll have the keys to:</p><ul style=\"\"><li style=\"\">Higher quality work AND less frustration - already on your next project!</li><li style=\"\">Better planning, better time estimation, and better ways of dealing with short deadlines.</li><li style=\"\">Extreme creative confidence and control in your MAKE phase.</li></ul><p style=\"\"><strong style=\"\">One last thing: </strong>the course include some extra materials – more examples, interesting links and some fun exercises. I encourage you to <strong style=\"\">do the exercises. </strong>My experience as a teacher shows me clearly, that the ones who make it are always the ones who DO THE EXERCISES.</p><p style=\"\">Join the course, fasten your seat-belt, and GO MAKE your best work ever.</p>", 
    "end_date": null, 
    "title": "GO MAKE: From Exciting Vision to High Quality Work", 
    "price": "20.00", 
    "instructors": "Doron Meir", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522428_4a7b_4.jpg", 
    "course_url": "https://www.udemy.com/go-make-from-exciting-vision-to-high-quality-work/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-07T09:53:03Z"
}