{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Many artists dislike the idea of having to manage their creative work. They feel that real-world issues, like deadlines and efficiency, are somehow the opposite of art and creativity.</p><p style=\"\">That&#039;s not necessarily true. Just like some managers kill creativity while others foster it, a good self-management approach will push your creativity forward, rather than inhibit it.</p><p style=\"\">In this course, we&#039;ll teach your internal manager - your PRO persona - how to:</p><p style=\"\">•Break down a creative project to 7 linear chunks.</p><p style=\"\">•Use <strong style=\"\">Fractal Chunking</strong> to conquer truly massive creative projects.</p><p style=\"\">•Use<strong style=\"\"> micro-deadlines</strong> to achieve a hyper-focus workflow.</p><p style=\"\">•Use <strong style=\"\">Dynamic Resolution Planning</strong> to easily shift between tight and loose planning.</p><p style=\"\">•Shape your work to match its context, and at the same time - use the context to make your work shine brighter.</p><p style=\"\">GO PRO is the last course in a 5 courses program called GO CREATE - a complete guide to the universal creative process. You can take GO PRO as a standalone course, or take the entire program for a fully integrated creative working method.</p><p style=\"\">Like with all GO CREATE courses, I&#039;ve made an effort to fit everything into a lean and mean 60 minutes course. In just one short hour, you will have the tools to:</p><p style=\"\">•Have no more stress - only hyper-focus.</p><p style=\"\">•Constantly exceed your clients or supervisors expectations, professionally and artistically.</p><p style=\"\">•Become a natural lead, with the time management tools to lead creative teams in large-scales projects.</p><p style=\"\"><strong style=\"\">One last thing:</strong> the course include some extra materials – more examples, interesting links and some fun exercises. I encourage you to <strong style=\"\">do the exercises.</strong> My experience as a teacher shows me clearly, that the ones who make it are always the ones who DO THE EXERCISES.</p><p style=\"\">Join the course now, and let&#039;s GO PRO! </p>", 
    "end_date": null, 
    "title": "GO PRO -  How to Plan and Control Your Creative Projects", 
    "price": "20.00", 
    "instructors": "Doron Meir", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555184_f227_2.jpg", 
    "course_url": "https://www.udemy.com/go-pro-how-to-plan-and-control-your-creative-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T08:10:35Z"
}