{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">New Bonus Lectures as of January 2015!</em></strong>  </p>  <p style=\"\">  \t          Want to get anything you want, using your amazing mind? Could telling lies be the key? You bet!  </p>  <p style=\"\">  \t                This <em style=\"\">76 item </em>course by life coach, Becky Shortt, will take you step by step through some of the most powerful processes for <strong style=\"\">getting what you want in life and doing it using your natural creative powers</strong>.  </p>  <p style=\"\">  \t          It includes how thinking. writing, speaking, drawing, questioning and reflection can <strong style=\"\"><em style=\"\">easily improve the quality of your life</em></strong>, your business and relationships.  </p>  <p style=\"\">  \t          This course will speak to you on a deep level and will give you the means and motivation you need to transform your life and have more fun! It also includes some <strong style=\"\"><em style=\"\">life-coaching secrets</em></strong> based on psychology and NLP.  </p>  <p style=\"\">  \t      This course includes 55 lectures, 4 ebooks and supplementary resources and materials that are proven to lead to greater happiness and fulfilment. Even using half these practices have had powerful consequences for my students&#039; lives. As such, do not feel you must use absolutely every recommendation. Just the ones that resonate with you.  </p>  <p style=\"\">  \t<em style=\"\">&#039;I didn&#039;t think I had the strength to change the story of my life until I did this course.&#039; </em>(Michael, 28)  </p>  <p style=\"\">  \t                I know that you will gain great success and happiness from the changes you make as a result of this course. And there is a <strong style=\"\">100% 30 day money-back guarantee</strong> if you do not see results after applying the techniques and principles taught in this course. Do discuss your successes and stay in touch with me to let me know how your are going.  </p>  <p style=\"\">  \t          Click <strong style=\"\">Take This Course</strong> at the top of this page to get enrolled and enjoy the most incredible year of your life. Note: Price increases as of July 2015.  </p>  <p style=\"\">  \t          And, enjoy <strong style=\"\">free access to all of my upcoming courses</strong>, just for being my student!  </p>  <p style=\"\">  \t          Happy manifesting!  </p>", 
    "end_date": null, 
    "title": "Golden Lies: Be Creative and Get ANYTHING you want in life!", 
    "price": "20.00", 
    "instructors": "Becky Shortt", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140690_482a_11.jpg", 
    "course_url": "https://www.udemy.com/golden-lies-the-ultimate-guide-for-the-creative-soul/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-02T06:19:26Z"
}