{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Are you stuck creatively and unsure where to find inspiration?</strong></p>\n\n<p>What if I told you that creativity is <em class=\"redactor-inline-converted\">all around you</em>, you just have to stop and look? In this introductory course I help you to think more creatively in any area of your life. I give you the tools to use the resources and the environment around you to think more creatively from here on forward. I use the knowledge from my BFA degree in Creative Writing and minor in Psychology to work your mind creatively with various exercises. Doing a couple exercises isn't enough, <strong>I want you to have the entire creative treasure chest so you can draw creative inspiration from it, no matter where you are!</strong></p><p>Creative thinking is not just for artists, <em>anyone</em> can think more creatively starting today! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I want you to gain knowledge and hands on experience as fast as possible. Almost all of the lectures will have a creative thinking exercise for you to complete. The best part is that not only do I walk you through the exercise but I complete the exercise with you and share my results at the end to keep you moving forward creatively.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">This creative thinking class will always stay up to date and I check this course on a daily basis to answer any questions you may have for me and to offer any additional help that you may need. There are no stupid questions, so if you need help just let me know. I am 100% committed to improving your creativity!</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Sign up for this course today and let's get you to not only to think more creatively but open your mind to the endless creative possibilities awaiting for you inside this course!<br></p>", 
    "end_date": null, 
    "title": "How to Increase Creative Thinking with Valuable Exercises", 
    "price": "20.00", 
    "instructors": "Tatiana Ambrose", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749432_b344_4.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-thinking-more-creatively-hands-on-exercises/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T22:35:36Z"
}