{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tHow to write a book in two weeks is about how to write a NON-FICTION book in two weeks and get it published. Its a course meant for all those people out there who have &#039;an idea&#039; bubbling around in their head, but yet they haven&#039;t quite got it down on paper yet, and they&#039;re just not sure where and how to start.  </p>  <p>  \tThis course starts at the very beginning, and it guides you through the process, of how to write a book with various examples of how the lecturer herself has personally achieved this herself. This isn&#039;t a theoretical course. This is practical. It is ideal for entrepreneurs, business people, experts, self-employed, those who want to write as a career and those who just want to get one book done.  </p>  <p>  \tWe look at your ideas, the structure of the book, overcoming challenges, publishing and completion and we also touch on marketing.  </p>  <p>  \tTemplate writing plans, book budget plan and an e-book are included.  </p>  <p>  \tThe course will take approx 3-4 hours to complete. There&#039;s a slideshow presentation with plenty of ideas for you and no doubt if you only have one book idea now, but the time we&#039;ve finished, you&#039;ll have a lot more!  </p>  <p>  \tThis course is ideal if you&#039;ve always wanted to write a book, have an idea for a book, know that a book will help you in your career and you just want to get it completed in the quickest, easiest, most pain-free way possible. Book coaches can cost thousands of pounds for their service. This course guides you through the steps and you&#039;ll know exactly what you have to do. Do clear time in your schedule to write. Attending this course will not write the book for you! You&#039;ll be inspired but you must act on this.  </p>  <p>  \tThe tutor is happy to discuss book ideas with you and can give you chapter feedback but is unable to read complete books sent in.  </p>", 
    "end_date": null, 
    "title": "How To Write A Book In 2 Weeks", 
    "price": "50.00", 
    "instructors": "Lisa Newton", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302470_15d7_3.jpg", 
    "course_url": "https://www.udemy.com/writeabook/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:14:21Z"
}