{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>How To Think And Grow </strong><strong>Great Ideas Fast - Easily Generate New Concepts, Ideas and Aha Moments - Even If You Are NOT Creative…</strong></p>\n\n<p>Do you want to quickly start generating game-changing ideas?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Ideas powerful enough to energize your life, improve business and shape the very world you live in?  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>If your answer is yes,</em>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then you’ve come to the right place – Even if you don’t think, you’re a creative person…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>… It's okay,</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Let me explain!</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you can understand these words, then you have the brain power RIGHT NOW, to start forming new ideas and concepts – Ones you may never have thought possible.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Until today, that is…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You see creative idea generation is like a muscle, the more you use it - the greater your ideas WILL become.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Your AGE doesn’t matter, you can, from today, start to harness your power to think and grow great ideas fast, whenever and wherever you like.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The most powerful force in the universe is a human thought – Your thoughts have the power to ALTER REALITY, change history and make a real difference in other people’s lives.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Your thoughts are the spark of all idea, and its ideas, GOOD IDEAS, which rework reality – When it comes to the greatest ideas, simply take a look around you…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br><strong></strong></p><p><strong>Everything You See Is The Result Of A Thought That Became A Great Idea In The World</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>All the buildings, all the technologies, all the different entertainment available to you, are all the by-products of ideation. In a very real sense – your world is built on the power of thought.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The main aim here is to show you how to harness that immense idea power, you already have WITHIN you - even if you didn’t know it…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>... Let’s face it, good ideas are the STAIRWAY to your success.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>A great concept not only has the power to change your life, but also yields profit, exposure, and increased market share for you, as its by-products.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Learn How To Think And Grow Great Ideas Fast</strong>, starting right now on your computer, smartphone, or other portable device.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Let me show you… </strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What you're about to discover in this crash course on great idea generation.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong>The fast and easy way to start generating game-changing ideas yourself.</strong></li><li>Shocking TRUTH about the real power contained in your thoughts, ideas, and feelings…</li><li><strong>Learn new ways to recognize a great idea or concept when you see one!</strong></li><li>How to develop a strong appreciation, of what your new ideas mean to you.</li><li><strong>The specific process involved in generating ideas, concepts, and “aha!” moments.</strong></li><li>Find out about the TOP methods and techniques involved in ideation.</li><li><strong>You’ll discover proven steps to raising your percentage of good ideas over your bad ones.</strong></li><li>Understand what to do once you have your HANDS on that great idea.</li><li><strong>You’ll learn the best practices needed to turn your idea into a project and that project into a production...</strong></li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>3 Easy Sections To Get You Up And Running Quickly</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>How To Think And Grow Great Ideas Fast … Has been split into 3 simple but powerful sections for you, called,</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>The Power of Ideas</li><li>Generating Great Ideas</li><li>And What Now?</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You receive assignments, videos and fill in the blank worksheet templates - all expertly crafted and designed, to get you up and running generating game-changing <strong>C</strong><strong>oncepts</strong>, <strong>Ideas,</strong> and <strong>Aha! Moments…</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>…<strong> </strong>Faster than you ever thought POSSIBLE.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You are free to work your way through each section of the course at your own pace. (turning yourself into an idea thinking machine in the process.) </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Nothing else compares to developing your understanding of how ideation works.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This understanding allows you to control the creative process – meaning the number of good ideas you generate, increases dramatically. YES, the way you think about creativity and generating ideas, is all about to change.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You’re in for a real treat indeed…</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As you experience the thrill of this journey, through the wonderful creative process of great idea generation.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you’re tired of thinking the same OLD THOUGHTS daily, and serious about discovering the magic like creativity of your mind…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>Then treat yourself today, with the gift of great ideas.</em></strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And start generating more ideas for both fun and profit – then in your wildest dreams…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br><strong></strong></p><p><strong>Try It Today! With ZERO-RISK On Your Part…</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>That’s right, you get a full 30 days to go through all the material and see if its everything you had hoped for – learn, discover and then use the proven steps to start generating great ideas fast.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Anytime within the next 30 days, if the course isn’t everything I say it is…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>… If it doesn’t live up to your expectations, <strong>for any reason, what so ever</strong>.<strong> </strong>Then simply ask for a FULL REFUND, and get all your money back – no questions asked! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If this sounds fair to you?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then don’t wait around any longer…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Simply join the course today, to start making an instant impact in your life and in your business, with all the great ideas – you're about to start generating.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’ll wonder why you waited so long to start thinking and growing, great game-changing ideas of YOUR OWN – Ideas that have the potential to change your life, your business, and your whole world…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>You ready?</em></strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Right now, it’s never been easier for you to get started, generating great ideas fast – so don’t delay – <em>you really should join this course, TODAY…</em> \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>You won’t regret it, one single bit,</em> And, if you decide to join, which I really hope you do, then I’ll see you on the inside.</p>", 
    "end_date": null, 
    "title": "How To Think And Grow Great Ideas Fast", 
    "price": "40.00", 
    "instructors": "MMBO Online", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258914_243c_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-think-and-grow-great-ideas-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T10:45:27Z"
}