{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course explains how to get started in the art of free-machine embroidery with very little financial outlay for equipment or materials. The course begins by suggesting the best type of machine and goes on to describe the features and functions of the machine such as bobbins, stitches, presser feet and tension. The sewing notions which are required are also described as are the methods which students can use to be both safe and comfortable when embroidering. Preparation for stitching and a practice session using a hoop are the next stages. If you have always wanted to learn free-machine embroidery but didn't know where to start, this course will guide you through the basic equipment, materials and procedures and instill in you a lifelong love of free-machine embroidery.</p><p>Enroll in this course now and, with a few days of practice, you will be making beautiful embroidered pieces for your home, family and friends.</p><p>Also, when taking this course, you will get:</p><ul><li>Unlimited lifetime access to all future lectures, bonuses and updates</li><li>A 30-day, no questions asked, money back guarantee</li><li>My help, which is always available to you - just ask! </li></ul><p>Course updated 1/02/2016</p><p><strong>Over 400 students enrolled in the first week!</strong></p>", 
    "end_date": null, 
    "title": "How to Get Started in Free-Machine Embroidery - Low Outlay!", 
    "price": "30.00", 
    "instructors": "Margo Price", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505078_8ea5_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-started-in-free-machine-embroidery/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T11:28:34Z"
}