{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In the modern publishing world, any successful fiction writer has to become more productive and prolific than ever before.</p>  <p>As a full-time writer, I know how easy it is to get distracted and confused by all of the different story structure elements that need to be in place to create a powerful romance.</p>  <p>You know what happens when things go wrong and you don’t think your story is working. You lose momentum. You lose interest. You stop and move on to the next shiny thing which is untainted by your sense of frustration and failure.</p>  <p>But here is the secret.</p><p>When you are planning to write a new romance story, all you need to focus on are the characters, and how they are going to change during the course of the romance as a result of the relationship.</p>  <p>That’s right. Forget standard screenwriting structure and focus on the core of any romance fiction – two characters and their journey to falling in love. That is what will make your story both unique and compelling.</p><p>Advanced story craft techniques are very handy at the editing and revision stage when you shape your story for the reader – but not here. This first draft is for you!</p>  <p>Instead, we use the power of character arc and emotional conflict to create a simple but effective emotional story map for your romance novel.</p>  <p>As you write your romance, your characters will come to life on the page and reveal their true personalities through what they say and do, but you will never find out unless you can get those characters onto the page and interacting with one another – fast!</p><p>Find out how you can outline your romance fiction faster than you thought possible, even if you know nothing about story structure.</p><p>This is the exact process I have used to create my award-winning romance novels.</p><p>Here is what I will be covering:</p><p><strong><em>Emotional Story Maps</em>: How to develop the opening chapters of your novel in less than an hour using romance story maps.</strong></p><p><strong><em>Perfect for Intuitive Writers:</em> Use this 6-Step Story Development Process to make sure that you never get lost again – but with the freedom to take detours and respond fully to where your characters take you. You <em>can</em> finish this romance - and love the writing process.</strong></p><p>              <strong><em>Case Study</em>: Follow the development of a contemporary romance story from idea to finished script.</strong><br></p>", 
    "end_date": null, 
    "title": "How to Outline Your Romance Novel - Fast!", 
    "price": "40.00", 
    "instructors": "Nina Harrington", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683954_ca3b_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-outline-your-romance-novel/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T09:53:47Z"
}