{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong><strong><em><u>This course originally cost $89.<br><strong><em><u>The price has been adjusted to fit Udemy's new pricing guidelines.</u></em></strong></u></em></strong></strong></em><em><strong></strong></em></p><p><strong><br></strong></p><p><strong>Contrary to popular belief, a “sense of humor\" is not a magical “gift\" a few special people are born with. Humor and writing are skills anyone can develop.</strong><br></p>  <p>  \t<strong></strong>In this online workshop, award-winning humorist and bestselling author Dave Fox teaches you how!  </p>  <p>  \t<strong> Discover the techniques professional comedy writers use to write consistently funny material. You'll learn how to think, write, speak, and be funnier.</strong>  </p>  <p>  \t                                                                                                                                                                                                                        Each lesson includes specific writing techniques and exercises to  incite maximum laughs. We'll focus on writing humor columns, personal essays, and creative non-fiction, but the skills you learn can be applied to writing genres of all sorts -- fiction and non-fiction -- as well as stand-up and  sketch comedy, cartooning, movie scripts, and more.  </p>  <p>  \t                                                                                                                                                                                                                  Full-blown comedy might or might not be your goal. Perhaps you want to take more serious forms of writing — fiction, feature articles, blog posts, travel writing, children's stories, personal memoirs … even office memos, cover letters, or devilishly sexy personal ads — and sprinkle in some giggles. Whatever genres you write in, this class will help you infuse more laughter into your work.  </p>  <p>  \t<strong>This course is also wildly useful for people who do any kind of public speaking, who want to keep their audiences awake and riveted to what they are saying. </strong>  </p>  <p>  \t                                                                                                                                                                                                                       So come join us in this fun and inspiring (and occasionally weird) workshop, and stretch your comedic potential to cackle-inducing new levels!  </p>  <p>  \t<strong>                     Some of the topics we'll cover include: </strong>  </p>  <ul>  \t<li>The universal element present in all humor</li>  \t<li>Proven tricks to create or strengthen your comedy</li>  \t<li>Giving your jokes maximum impact with the right words and timing</li>  \t<li>Stretching your punch lines to make them punchier</li>  \t<li>Streamlining your phrasing so your punch lines don't get swallowed up in flabby verbiage. (Mastering this skill will make a vast improvement in <em>all</em> of your writing.)</li>  \t<li>Learning from your favorite professional humorists</li>  \t<li>When and why to throw away your best joke</li>  \t<li>Publishing your humor</li>  \t<li>How to not be that annoying guy at the party with the lampshade on his head</li>  </ul>    <strong> What's Included:</strong><ul><li><span></span>Lots of fun and super-informative video lessons.</li><li>Links to lots more videos on YouTube that illustrate specific concepts you've learned. (That's right! You can watch \"Saturday Night Live\" sketches and a clip from the iconic \"Soup Nazi\" episode of \"Seinfeld\" ... and call it studying!</li><li>A free e-book of humor essays referenced in the videos</li><li>A teacher who's a best-selling author and award-winning humorist ... who <em>loves</em> helping people become hilarious.</li><li>And a few more surprises in the works. </li></ul>  <p>  \t<strong>I am utterly positive you will not find a humor writing course of this quality <em>anywhere</em> for such a low price! </strong>(And if you disagree after checking it out, Udemy offers a 30-day, no-hassle, money-back guarantee.)</p><p>So hey! What are you waiting for? Dive in today and start making people laugh so hard, milk will come out of their noses ... even when they're not drinking milk!<br></p>    <hr><p><em>\"You are the best writing teacher I have ever had. Talented, funny, approachable, and structured.\"</em></p><p>-- Leslie in Surrey, England</p><p><em><br></em></p><p><em>\"Dave Fox is an amazing teacher who will give you online feedback as if you were sitting right next to him.\"</em></p><p>-- Joan in Bakersfield, California</p><hr><p>Also check out my other writing courses on Udemy:</p><p><em></em></p><ul><li>Globejotting: How to Write Extraordinary Travel Journals (and still have time to enjoy your trip!)</li><li>Travel Writing: Explore the World and Publish Your Stories</li><li>Write-Brained 1: Overcome Writer's Block and Write with Confidence! (The first in my new series of courses on the psychology of writing: This course explores how to cure writer's block, writer's overwhelm, and perfectionism. You'll write more, write better, and write more happily.)</li></ul>", 
    "end_date": null, 
    "title": "Humor Writing: How to Think, Write, Speak, and Be Funnier!", 
    "price": "30.00", 
    "instructors": "Dave Fox", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304132_5e1e_4.jpg", 
    "course_url": "https://www.udemy.com/humor-writing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T08:15:04Z"
}