{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p><p>Hypnosis for Boosting creativity guided hypnosis program has been created to simulate and offer the same results of a private hypnosis session with me.</p><p>Learn how to use and why Hypnosis is called magnified concentration a completely focused consent state meaning that to use Hypnosis effectively you agree to focus on the suggestions or outcome while hypnotized. Your creativity can now be enhanced by using hypnosis as a tool for brain storming solutions to projects that you are working on or planning to work on.</p>\n\n<p>Some of the Greatest business minds us brain storming to get solutions and with hypnosis you will be able to brain storm more effectively as you enter a relaxed even meditative focused state that will help you to gain solutions to creating and being more creative.</p>\n\n<p> <em><strong>What I will teach you in this course</strong></em></p>\n\n<p><em>1. You will begin by creating an image in your mind of what you want so that you will know where you are going and what you want from your project</em></p>\n\n<p><em>2. Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</em></p>\n\n<p><em>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</em></p>\n\n<p><em>4. Learn how you naturally resist changes even changes that can be very good for you</em></p>\n\n<p><em>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</em></p>\n\n<p><em>6. Learn who can and cannot be hypnotized</em></p>\n\n<p><em>7. Learn how you can feel amazing any time you want to</em></p>\n\n<p><em>8. Creativity Hypnotherapy Explode your Creativity Hypnosis  </em></p>\n\n<p><em><strong>hypnosis Course bonus download section</strong></em></p>\n\n<p><em>Assertiveness Hypnosis mp3</em></p>\n\n<p><em>Perfect Memory Hypnosis mp3</em></p>\n\n<p><em>Improve Creativity mp3</em></p>\n\n<p><em>How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings </em></p>\n\n<p><strong><em>All Files and videos are downloadable for easier access</em>  </strong></p>", 
    "end_date": null, 
    "title": "Hypnosis for Boosting creativity guided hypnosis program", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433976_c52a_2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-for-brain-storming-ability/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T11:33:54Z"
}