{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t                  Have you always felt you had a book or story inside your mind? Or perhaps you are already a writer, but looking to improve your process.  </p>  <p style=\"\">  \t                  You’re who this course is for.  </p>  <p style=\"\">  \t                  This course is set up to take you through the process of writing a work of fiction of any length, all through a series of short videos.  We’ll start with the first step—idea generation—and go all the way through to revisions. I even included a video on working with beta readers, which is the step after that.  </p>  <p style=\"\">  \t                  You will learn:  </p>  <p style=\"\">  \t          6 ways of adding tension to a story,  </p>  <p style=\"\">  \t          2 things to always do when working with beta readers  </p>  <p style=\"\">  \t          6 ways of making characters interesting  </p>  <p style=\"\">  \t          Tips for doing research  </p>  <p style=\"\">  \t          7 qualifications for a good ending  </p>  <p style=\"\">  \t          and much more, including, dialogue, and plot. In addition, I have an exercise on turning the most blank-slate character you can think of into a well-rounded, fleshed-out inhabitant of your story.  </p>  <p style=\"\">  \t                  The course can be taken in order or you are free to jump around as you please. At the end, you’ll be able to refine your fiction writing so you can write much more smoothly, more quickly and with more intensity. That means you&#039;ll be cranking out more and better stories in less time!  </p>  <p style=\"\">  \t    Don&#039;t forget--30-day guarantee if you aren&#039;t 100% satisfied! You have nothing to lose!  </p>", 
    "end_date": null, 
    "title": "Improve your Fiction Writing and Finish More Stories", 
    "price": "25.00", 
    "instructors": "Stephanie Chichester", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357418_2200_4.jpg", 
    "course_url": "https://www.udemy.com/improve-your-fiction-writing-and-finish-more-stories/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T23:18:10Z"
}