{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t <strong style=\"\">This course is designed for people who are trying to drive innovation in an organisation and need some practical tools to help generate breakthrough solutions to problems and opportunities that they are facing.</strong>  </p>  <p>  \t <br style=\"\">  \t    If innovation is a priority for your business, then it is critical that you build the necessary skills in your people to help drive breakthrough thinking on your biggest business challenges. This course will provide you with a stack of practical innovation tools that have driven remarkable results in organisations such as Coca-Cola Amatil, Red Bull, LEGO, Deloitte, Heinz, Commonwealth Bank of Australia, and many others.<br style=\"\">  \t<br style=\"\">  \t    This course will teach you how to:  </p>  <li>Create the optimal mindset in people so that they are comfortable with taking risks (which is vital for idea generation).</li>  <li>Build instant and critical rapport with their break-out groups. </li>  <li>Learn how to activate the creative thinking parts of the brain.</li>  <li>Become skilled at setting up the physical environment to make it conducive to creative thinking.</li>  <li>Optimise the behaviour of any sized group.</li>  <li>Provide people with effective stimulus that will consistently generate breakthrough ideas and thinking.</li>  <li>Mix intuitive and analytical methods of decision-making for making optimal decisions about ideas.</li>  <li>Structure decision-making/shortlisting within a workshop or meeting to make the best use of people&rsquo;s brains.</li>  <li>Flesh out an idea into a one page, mini-business plan.</li>  <li>How to incorporate all these tools to plan workshops of various lengths (e.g. 30 minutes versus half a day).</li>  <p>  \t    The course is broken into the following sections:  </p>  <p>  \t <br style=\"\">  \t<strong style=\"\">Setting the Scene</strong>  </p>  <p>  \t Learn tools to help you set the right mindset to give innovation the best chance of happening.  </p>  <p>  \t<strong style=\"\">Group Optimisation</strong>  </p>  <p>  \t Learn how to get the most out of groups when it comes to generating creative solutions to problems.  </p>  <p>  \t<strong style=\"\">Idea Generation</strong>  </p>  <p>  \t Learn tools that will help individuals and groups generate breakthrough ideas.  </p>  <p>  \t<strong style=\"\">Decision-Making</strong>  </p>  <p>  \t Learn how to make effective decisions about which ideas to progress and which to leave behind.  </p>  <p>  \t<strong style=\"\">Harvesting</strong>  </p>  <p>  \t Learn how to flesh out ideas.  </p>  <p>  \t <strong style=\"\"> Last but not least, the team at Inventium are around to answer any questions you have when it comes time to apply the tools from this course! Just contact us at hello@inventium.com.au</strong>  </p>  <p>  \t <strong style=\"\"> To get started, click on the &quot;Take This Course&quot; button at the top of this page.</strong>  </p>", 
    "end_date": null, 
    "title": "Learn how to innovate in 5 easy steps", 
    "price": "50.00", 
    "instructors": "Amantha Imber", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/87856_39a3_6.jpg", 
    "course_url": "https://www.udemy.com/innovation/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-04T01:23:13Z"
}