{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Introduction</strong>  </p>  <ul style=\"\">  \t<li>Have you faced situations where you cannot think of any Idea or Solution to a problem?</li>  \t<li>Do you want to learn how to get new creative ideas and solve problems in any situation?</li>  </ul>  <p>  \t<strong style=\"\">This unique and interesting course is going to change your perception towards Idea Generation. </strong>  </p>  <p>  \t<strong style=\"\">Just imagine if you can get fresh ideas on any new product or for improving existing ones in less than 15 minutes. </strong>  </p>  <p>  \t<strong style=\"\">Over 2000 students have benefited from this course.</strong>  </p><p><strong style=\"\"></strong></p><p>You will be able to:</p><ol style=\"\"><li>Get more creative ideas on your online or offline ventures esp. E- Commerce</li><li>Evaluate the right ideas and increase your venture success rate</li><li>Make your idea/product attractive to your investors or board members</li><li>100+ ways to innovate and generate creative business ideas</li></ol>  <p>  \t  I have designed a unique framework called <strong style=\"\">getSMART </strong><strong style=\"\"></strong>to make your idea generation and brainstorming exercise very effective. This framework can be applied in any situation to assess the problem you are trying to solve. Then, there are 5 methods that can be applied to the particular situation to get more ideas. If you are alone, the method would be different that if you are in a group.  </p>  <p>  \t  In this course, you will see how a simple service like &quot;<strong style=\"\">Loyalty</strong>&quot; card for a apparel brand can be transformed into an innovative and unique product through <strong style=\"\">getSMART </strong><strong style=\"\"></strong>framework.  </p>  <p>  \t  You will learn how leading companies in technology, software, FMCG etc. generate ideas through a structured methodology. Irrespective of your job whether you are Product Manager, Marketing Manager, Services Manager, R&amp;D professional, Artist or Student, you encounter situations that require ideation to create new stuff or improve the existing things.  </p>  <p>  \t<strong style=\"\">Bonus</strong><strong style=\"\">:</strong><strong style=\"\"></strong>You will get an approach to present your Idea to your boss, management or investors as a bonus chapter with this course  </p>  <p>  \t  Starting with a brief on main source for ideas, the course takes you through 5 popular and useful methods to “Generate Ideas&quot;. A complete unit is dedicated to each unit and each method is explained in detail with examples. At the end of each unit, you will be able to take any object around you, apply this method and improve it.  </p>  <p>  \t  After you learn 5 Idea generation methods, you will have sufficient skills to generate ideas either in individual setup or as a group. The next part of course teaches you how to evaluate ideas and select the best of various ideas generated through above methods. Idea evaluation is critical skill as selection of wrong ideas or rejection of promising ideas might have huge financial impact.  </p>    <p>  \t<strong style=\"\">What will you learn?</strong>  </p>  <ul style=\"\">  \t<li>What are the main sources of ideas? – You will learn how professionals and firms keep track of various sources to understand trends for idea generation</li>  \t<li>getSMART framework to convert your idea into a sellable product</li><li>9 Types of Innovation Situations</li><li>9 Methods for Idea Generation</li><li>InCUBATER framework to evaluate ideas</li><li>Idea to Product conversion steps</li><li>Idea and Product Validation Methods and Online Tools (available for free)</li><li>4D model for Idea or Product Presentation design</li><li>Online resources with more than 100 advanced ideation techniques.</li><li><strong style=\"\">This course will serve as a reference toolkit that you can refer to at any stage of your career whenever you need to generate fresh ideas.</strong></li></ul>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "Learn How to Get Creative Business Ideas (100+ ways)", 
    "price": "20.00", 
    "instructors": "Pragmatic Learning Solutions", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/174990_1515_5.jpg", 
    "course_url": "https://www.udemy.com/idea-generation-and-selection-methods/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-01T20:26:51Z"
}