{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">If you are looking for something cool to learn, or if you just want to impress someone, then this cours is for you! Learn sick and impossible magic tricks from a real magician. These magic tricks can get people to be impressed! Take the opportunity to learn the crazy stuff, you will get a step by step course that will get you to become an impressive magician. This course contains magical secrets from the popular magicians. Those who take this course will get over 2 hours of learning processes, a mentor and a step by step course. Everyone can do this magic tricks, but only a few people know about the secrets! My name is Esman Fakhro and i will be both your mentor/teacher and coach! I have over 14 years experience in magic. You are going to love this course! NOT only will you get my magic tricks secrets, but you are also going to be reached by the biggest magician on the world, one of my favorites that will teach you is Eric Jones. He is a professional magician and he does very sick coin tricks. </strong></p>\n\n<p><strong>This magic course is about making tricks with playing cards, coins, balls, cigarettes, silk, levitations and so much more! Are you ready to change? Are you ready to become something big? And are you ready to get better? You've come to the right place! So what are you waiting for? Grab the opportunity and change!</strong></p>", 
    "end_date": null, 
    "title": "Learn Amazing Magic Tricks", 
    "price": "20.00", 
    "instructors": "Esman Fakhro", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/829166_c727.jpg", 
    "course_url": "https://www.udemy.com/learn-amazing-magic-tricks/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-22T14:35:51Z"
}