{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn The Art Of Henna is a course aimed at anybody male or female  that wants to know more about Henna, but are not sure where to start. This is a great course for beginners and for those who want to brush up on any existing techniques<br></p><p>Henna is a temporary tattoo and is used throughout the world as part of wedding or cultural traditions sometimes referred to as mehendi or mehndi.  Although this was an old custom it has become a very popular skill to learn over the years especially outside it's traditional Middle Eastern, South Asian base.</p><p>Briefly to outline, the Henna course will demonstrate the preparation and mixing of your own Henna paste from powder form.Going on to discuss the adding of secret ingredients which will be revealed to ensure that you obtain the optimal Henna stain.</p><p>Following tuition in the preparation of Henna cones the course will move on to designing actual Henna patterns.Starting with the construction of a basic strip of Henna to finishing with creating a bridal pattern. Aftercare using a special sugar and lemon paste will also be covered towards the end.</p><p>All materials required can be found around the home except Henna powder and possibly the material for Henna cone construction. Anything that needs to be purchased can be sourced possibly locally in stores but ultimately everything is available to purchase online.</p><p>The current modules cover the core principles of Henna design and application as we go forward we hope to bring our students more video's exploring particular schools of design from different parts of the world and invaluable tips and tricks of the trade.</p>", 
    "end_date": null, 
    "title": "Learn The Art of Henna", 
    "price": "20.00", 
    "instructors": "Pam Sangha", 
    "commitment": null, 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598374_31b5_3.jpg", 
    "course_url": "https://www.udemy.com/learn-the-art-of-henna/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T16:05:46Z"
}