{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is designed for children and educators interested in learning about art with the famous cat, Lucy, and art teacher, Krista Schumacher. \"Lucy Loves Art\" will engage your child or students through several videos. The videos teach children about different art elements such as color and line, famous artists such as Van Gogh and Wyland, and provide different art activity ideas! The videos are quick, engaging, and educational for children ages 5 to 15+. Some of the videos briefly demonstrate the project, while others walk children through the entire length of the lesson.</p><p><strong>Included in this courses are the following videos:</strong></p><ol><li>Introduction to Color: Lucy learns about basic color theory</li><li>Warm &amp; Cool Colors: Lucy learns the difference between warm and cool colors</li><li>Line: Lucy learns line is an element of art</li><li>The Dot Activity: Lucy shares an art activity for you and your child to do at home to unleash creativity</li><li>Cave Art: Lucy brings us back in time to explore cave art (art project idea included!)</li><li>Wyland: Lucy introduces us to American environmental artist, Robert Wyland</li><li>Starry Night: Lucy teaches us about the different elements of art in Van Gogh's \"Starry Night\" and create oil pastel masterpiece</li><li>Van Gogh Watercolor: Lucy learns how to recreate Van Gogh's \"Sunflowers\" with watercolor paint</li><li>Wayne Thiebaud Clay Project: Lucy learns about American artist, Wayne Thiebaud and create different dessert items from clay and paints them</li><li>Pumpkin Painting: Lucy learns how to draw and paint a pumpkin</li><li>Value Pumpkins: Lucy learns about value, as an element of art, by drawing pumpkin</li><li>Chalk Pastel Snowman: Lucy creates chalk pastel snowman</li></ol><p><strong>Materials </strong>*Please note: these materials are recommended and can be altered depending on the art project.</p><ul><li>Sheets of paper (including brown &amp; blue construction paper)</li><li>Crayons</li><li>A \"dot\" of construction paper</li><li>Glue</li><li>Oil Pastels</li><li>Watercolors</li><li>Crayola Air-Dry Clay </li><li>Charcoal pencils</li><li>Tempera paint: yellow, white, and red</li><li>Chalk pastel </li><li>Pastel pencils </li></ul>", 
    "end_date": null, 
    "title": "Lucy Loves Art", 
    "price": "30.00", 
    "instructors": "Krista Schumacher", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643398_4019.jpg", 
    "course_url": "https://www.udemy.com/lucylovesart/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T16:30:40Z"
}