{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you a screenwriter who has wondered what it would be like to write your script as a novel? Are you tired of not seeing your work produced? Releasing your story as a novel is a great way to get it out there and see if you can find an audience. This could help Hollywood take notice. Novelizing your script is also a way to share your story with the world and not wait anymore. Especially in the age when self-publishing is available to all of us. I got tired of waiting for \"Hollywood\" to decide my stories were worth telling and started getting into the novelizations process after my film, The Ultimate Gift, was produced. I've done six of these now. One novelization on my own, and five with my writing partner, Rene Gutteridge, who has been a published novelist over thirty times. She's also a produced screenwriter. This class will walk you through what has to change from screenwriting to novel writing. Rene Gutteridge joins me for quite a few of the video lectures so you have an expert in screenwriting and an expert in novel writing teaching this class. Each section has PDF downloads. Together these include all segments of our published book Novelizations: How to Adapt Scripts Into Novels. You'll see real live samples from many of our published works so you can get a complete understanding for how a screenplay translates into the very different writing form of a novel. </p><p>PLEASE NOTE: Udemy estimates this class has 4.5 hours of lecture content. This includes both video lectures and written PDF documents. The run time on video content is approx. 100 minutes. </p>", 
    "end_date": null, 
    "title": "Novelizations: How to Adapt a Screenplay Into a Novel", 
    "price": "30.00", 
    "instructors": "Cheryl McKay", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779974_b1ba_3.jpg", 
    "course_url": "https://www.udemy.com/novelizations-how-to-adapt-scripts-into-novels/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T13:25:40Z"
}