{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Transformer vos écrits en livre audio avec un logiciel gratuit?</strong></p>\n\n<p><em>Bienvenue dans cette formation qui va vous aider à préparer, enregistrer et créer votre livre audio!</em>\n</p>\n\n\n\n\n\n<h4>Bonjour!</h4>\n\n\n\n\n\n<ul><li>Vous êtes auteur/e et vous avez compris l’intérêt majeur de pouvoir transformer votre livre en une version sonore?</li><li>Vous avez un budget réduit et ne pouvez pas encore vous payer les services d’acteurs ou d’un studio d’enregistrement professionnel?</li><li>Vous avez des tas de questions sur les étapes à suivre pour pouvoir enregistrer vous-même un livre audio et savoir où le publier?</li></ul>\n\n\n\n\n\n<p>Bonjour, nous sommes Cristina &amp; Olivier Rebière, un couple d’aventuriers de la vie et d’entrepreneurs. Nous avons des milliers d’étudiants et de lecteurs dans le monde entier qui apprécient nos livres numériques en français, anglais et espagnol (e-books) ainsi que nos formations vidéo en ligne (e-learning).</p>\n\n\n\n\n\n<p>Nous connaissons bien les difficultés techniques posées par l’enregistrement audio de la voix et le traitement de la bande son.</p>\n\n\n\n\n\n<ul><li>Mais ne vous inquiétez pas, nous allons voir pas à pas comment faire pour enregistrer votre voix pour créer des bandes audio mp3 prêtes à être insérées dans un livre audio ou dans un podcast.</li><li>Il vous faudra tout de même un bon micro cardioïde USB ou bien en acheter un.</li></ul>\n\n\n\n\n\n<h4>Préparez-vous à acquérir de nouvelles compétences utiles!</h4>\n\n\n\n\n\n<p>Dans cette formation, nous allons vous expliquer une méthode simple et efficace pour créer et produire votre livre audio grâce au logiciel gratuit Audacity.</p>\n\n\n\n\n\n<p>Vous allez notamment:</p>\n\n\n\n\n\n<ol><li>Comprendre l’importance d’un son de bonne qualité et l’impact de l’environnement sur la qualité audio</li><li>Savoir quoi faire avant l’enregistrement pour bien le préparer</li><li>Enregistrer correctement son livre en y prenant plaisir</li><li>Traiter, découper et exporter votre projet audio avec le logiciel gratuit « Audacity »</li><li>Connaître des sites spécialisés pour la publication de livres audio francophones </li></ol>\n\n\n\n\n\n<h4><em>Quelle est la terminologie utilisée?</em></h4>\n\n\n\n\n\n<p><em>Dans cette formation nous allons parler entre autre de: bon son, mauvais son, acoustique, écho, réverbération, onde, microphone, micro cardioïde USB, articulation, narration, hydratation, virelangue… Ne vous inquiétez pas, vous comprendrez tout et nous répondrons à vos questions si vous avez besoin d’un éclaircissement!</em></p>\n\n\n\n\n\n<h4><em>Qu’allez-vous obtenir de cette formation sur la création de livre audio?</em></h4>\n\n\n\n\n\n<ul><li><em>20 leçons vidéo de grande qualité</em></li><li><em>2 heures de formation</em></li><li><em>un certificat de complétion de la formation lorsque vous l’aurez terminée</em></li><li><em>Lien vers le programme de formation officiel contenant toutes les ressources utilisées dans le cours</em></li><li><em>Lien vers un fichier zippé des signets de la formation pour cliquer facilement vers les ressources en utilisant votre navigateur internet préféré</em></li><li><em>zone de discussion pour échanger directement avec nous</em></li><li><em>l’accès à la communauté des Formateurs &amp; Auteurs Numériques En Ligne</em></li></ul>\n\n\n\n\n\n<h4><em>Ce que d’autres personnes disent de nos formations sur les Outils Auteurs:</em></h4>\n\n\n\n\n\n<ul><li><em><em>« Avant l’acquisition de cette formation, j’avais commencé par lire plusieurs instructions, sur PDF, ebook. Cela devenait un casse-tête. Le cours par vidéos d’Olivier Rebiere rend les opérations nécessaires fabuleusement simples et confortable ! Les explications sont claires, bien agencées, pas à pas. L’accompagnement est dynamique, enthousiaste et cela motive lorsqu’il y a des efforts de patience à fournir. C’est vraiment un plaisir de suivre les instructions, telles que le prof semble être présent ! Je me réjouis même d’envoyer les prochains doc. sur Create Space ! Clair, limpide, stimulant et EFFICACE, puisque mon livre s’est envolé aux US, pour me revenir en papier. Merci infiniment de la qualité de votre cours, qui a rendu « toute simple » une démarche que je redoutais !! Un grand pas vers la création, la réalisation d’ouvrages, de partages ! Bien à Vous, Cosette. »</em> – Cosette Ingold</em></li><li><em><em>« COURS TRES BIEN EXPLIQUÉ RICHE EN INFORMATIONS ET RENSEIGNEMENTS J´AI BEAUCOUP APPRECIÉ LE COURS MERCI »</em>– Ikrame Selkani</em></li></ul>\n\n\n\n\n\n<ul><li><em><em>« Excellent ! »</em> – Urquidez Yves</em></li><li><em><em>« C’est un cours excellent qui donne beaucoup d’astuces pour faire sa promo sur Facebook. Je ne peux qu’encourager les auteurs ou ceux qui veulent le devenir, comme moi, à le suivre. Une vraie mine d’informations. »</em></em></li></ul>\n\n\n\n\n\n<p><em>Alors, êtes-vous prêt(e) pour la formation?! Oui?</em></p>\n\n\n\n\n\n<h4><em><em>Alors on démarre!</em></em></h4>\n\n\n\n\n\n<p><em>Cristina &amp; Olivier Rebiere</em></p>\n\n\n\n\n\n<p><em><br></em></p>", 
    "end_date": null, 
    "title": "Outil Auteurs: Enregistrer Audio, Créer Livre Audio soi-même", 
    "price": "20.00", 
    "instructors": "Olivier Rebiere, Cristina Rebiere", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/861840_2a33.jpg", 
    "course_url": "https://www.udemy.com/creer-livre-audio/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-27T22:16:20Z"
}