{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  This is the foundational seminar for your screenwriting career.  </p>  <p>  \t  Or if you&#039;ve ever wanted to tell stories that inspire an audience, this is your way.  </p>  <p>  \t  Abraham Lincoln said, &quot;If I had eight hours to cut down a tree, I&#039;d spend six hours sharpening my axe.&quot;  Well, when  it comes to screenwriting, most people unfortunately spend 6 months to a  year scratching away, then half-heartedly sharpening dialog while never  considering how good their tools are. Then one day they realize that  after all that hacking they still haven&#039;t cut down that tree and give up.  </p>  <p>  \t  That won&#039;t be you. Pre-Pro is here for you.  </p>  <p>  \t<strong style=\"\">Purpose</strong>  </p>  <ul style=\"\">  \t<li>Reduce the time needed to create a MARKETABLE Script</li>  \t<li>Prevent the “theft of time” caused by developing unsellable stories</li>  \t<li>Break free of FALSE concepts about the way screenplays are written</li>  \t<li>To create a repeatable, professional approach to the business of entertainment</li>  </ul>  <p>  \t  The following 5+ hours of video with accompanying text, and files are meant to shave YEARS off your screenwriting journey.  Take it seriously.  Work through the concepts involved.  Apply them vigorously and you&#039;ll meet with a success unexpected in common hours.  </p>  <p>  \t  Ready to begin?  </p>", 
    "end_date": null, 
    "title": "Pre-Script Pro-Strategy Screenwriting Seminar", 
    "price": "40.00", 
    "instructors": "Brennan Smith", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384924_b499_4.jpg", 
    "course_url": "https://www.udemy.com/pre-script-pro-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T16:07:43Z"
}