{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h5 style=\"text-align: left;\">Pilot Season Never Ends!</h5>\n<p>\n\t<a href=\"http://mystorycanbeatupyourstory.com/wp-content/uploads/2013/06/breaking_bad.jpg\" rel=\"nofollow\" target=\"_blank\"></a>\n</p>\n<p>\n\t  The big opportunity for screenwriters has shifted dramatically from film to television, and the best way to get in the writing game  -- <strong>TV &amp; features</strong> -- is to write a <strong>professional, bulletproof 1 hour pilot script</strong>.   A rock-solid 1 hour pilot script is not just a sample of your TV writing skills, but or your feature writing chops, too.\n</p>\n<h5></h5>\n<p>\n\t Thanks to cable, the Internet, and channels such as Netflix, Hulu, and Amazon the hunt for great shows is a year-round event.  In this <strong>ONLINE VIDEO CLASS </strong>, Gemini award-winning television producer and two-time Emmy nominated TV writer Jeffrey Alan Schechter shows you how to structure the <strong>Bulletproof 1 Hour Pilot Script</strong>, teaching you the private system  you can use to <strong><em>immediately</em></strong> to make your scripts professional and memorable.\n</p>\n<p>\n\t  In this online class you'll learn:\n</p>\n<ul>\n\t<li>The <strong>3 questions</strong> you need to answer <em><strong>before</strong></em> you write your pilot script</li>\n\t<li>The <strong>6 business reasons</strong> why an original pilot script is better than a sample episode of an existing series</li>\n\t<li>The <strong>surprising insight</strong> why a 1 hour pilot script is also a killer <strong>feature sample</strong>.</li>\n\t<li>The <strong>4 reasons</strong> to write an episodic pilot and not a serialized one</li>\n\t<li>The <strong>differences between cable &amp; broadcast</strong> <strong>pilots</strong> (and which one is better to write)</li>\n\t<li>The <strong>5 essential steps</strong> to knowing your show</li>\n\t<li>The <strong>7 distinct characters</strong> you need to round out your cast.</li>\n\t<li>A formula to <strong>quickly pitch your entire show</strong> (series, season, <em>and</em> episode)</li>\n\t<li>The <strong>9 bulletproof plot points</strong> of your Teaser &amp; Act 1.</li>\n\t<li>A <strong>step-by-step guide</strong> to tracking the <strong>A, B, and C stories</strong> through the entire script.</li>\n\t<li>The <strong>3 essential plot points</strong> that make up the final act and reset the episode so viewers are back next week, eager for more of your show.</li>\n</ul>\n<p>\n\t     The online class includes lifetime access to:\n</p>\n<ul>\n\t<li>All lectures and updates, forever!</li>\n\t<li><strong>A downloadable file of all the key slides</strong> used in the course (a master course in pilot writing all by themselves)</li>\n\t<li>The following <strong>downloadable breakdowns:</strong>\n\t<ul>\n\t\t<li><strong>CSI:NY  (Season 5, Episode 22)</strong> -  This is a very clean Teaser/4 Acts breakdown of an EPISODIC show.</li>\n\t\t<li><strong>NCIS  (Season 5, Episode 7)</strong>  - One of the most popular shows on broadcast, this episode uses a Teaser/5 Act structure.</li>\n\t\t<li><strong> Breaking Bad (Season 1, Episode 6)</strong> - Some of the best writing on TV, this is an excellent example of a SERIALIZED show that follows the Teaser/4 Act structure but with heavy character development .</li>\n\t</ul>\n\t</li>\n\t<li>The following <strong>downloadable templates:</strong>\n\t<ul>\n\t\t<li><strong>Blank Structure Template</strong> - 1 Hour, Episodic, Teaser/4 Acts</li>\n\t\t<li><strong>Blank Structure Template </strong>- 1 Hour, Episodic, Teaser/5 Acts</li>\n\t\t<li><strong>Blank Structure Template</strong> - 1 Hour, Serial, Teaser/4 Acts</li>\n\t\t<li><strong>Blank Character Template</strong> - A blank character chart to help you know which characters you need and what roles they play in your series.</li>\n\t</ul>\n\t</li>\n</ul>\n<p>\n\t     You can find other courses that charge <em><strong>a lot more</strong></em> given by writers who work <em><strong>a lot less</strong> </em>(sorry guys, you know it's true) but this is the only online course that packs <strong>this amount of current information</strong> into <strong>this concise a format</strong> with <strong>these many resources </strong>and all from a working writer who knows what you're going through and knows how to make it <strong>easier and better</strong>.\n</p>\n<p>\n\t <a href=\"http://mystorycanbeatupyourstory.com/wp-content/uploads/2012/12/60Day-money-back-guarantee-img.jpg\" rel=\"nofollow\" target=\"_blank\"></a>\n</p>\n<p>\n\t     This course comes with a no hassle money back guarantee.  After taking the class, if you don't think the information is worth it, tell us and you'll get your money back, no questions asked. And we'll still let you keep your access to the lectures, breakdowns, and templates.  Just like Captain Kirk, we don't believe in the no-win scenario and neither should you.\n</p>\n<p>\n\tReady to get started?  Good!  Let's go write something AWESOME.\n</p>", 
    "end_date": null, 
    "title": "Screenwriting: Creating the Bulletproof 1 Hour TV Pilot", 
    "price": "50.00", 
    "instructors": "Jeffrey Alan Schechter", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/83594_68ea_6.jpg", 
    "course_url": "https://www.udemy.com/bulletproof-tv-pilot/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-25T16:42:27Z"
}