{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will teach you simple, yet effective self-editing techniques that will improve your success as a writer. Whether you have already written a book, would like to try writing a book, or just enjoy writing, you will learn to eliminate unnecessary words and phrases while strengthening your story. When you apply the techniques to your writing, they will soon become habits, which will cut your editing time and costs if you are going to publish your book. </p><p>These techniques work with fictional and non-fictional writing. The techniques can also help college and high school students write stronger papers.</p><p>Each lecture includes a short video explanation, a technique to apply to your writing, and additional exercises to reinforce the technique. There are also various handouts for quick reference to be used with future writing projects. These techniques will make the reader experience more enjoyable, and when readers enjoy your writing, you will sell more books.</p><p>As you go through the course, you will be using your own manuscript or written piece. Writing prompts are provided for those who have no prior writing samples.</p><p>The time required to go through the course will vary with each student since you are using your own written pieces that differ in length. Starting out, you will only be applying the techniques to a couple chapters. Once you have mastered the techniques, you will go back and apply what you have learned to your whole book or written piece.</p><p>By doing some <em>initial</em> editing yourself, you can save hundreds of dollars when hiring an editor. Then you can use the extra money on marketing. Let's get started!</p>", 
    "end_date": null, 
    "title": "Self-Editing Techniques That Make Books Sell", 
    "price": "25.00", 
    "instructors": "Karen Crowell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179302_17a1_2.jpg", 
    "course_url": "https://www.udemy.com/self-editing-techniques-that-make-books-sell/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-09T09:37:49Z"
}