{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t Become a creative genius! Enrol in the Skool* of Creativity and gain the ability to  see things in new ways and come up with better and more impactful ideas.  </p>  <p style=\"\">  \t Everyone is creative, it just takes a little directed focus and practice to harness creativity as a skill for truly succeeding in business and in life.  </p>  <p style=\"\">  \t Here’s a run-down of the modules:  </p>  <p style=\"\">  \t 1- Kick the Habit. Break routine and invigorate your creativity.  </p>  <p style=\"\">  \t 2- Kill Your Internal Censor. Free your creative voice.  </p>  <p style=\"\">  \t 3- You’ve Been Reframed. Seek new meaning in your challenges.  </p>  <p style=\"\">  \t 4- Method in the Madness. Extract concepts to make any idea work.  </p>  <p style=\"\">  \t 5- I Did it My Way. Design thinking for better solutions.  </p>  <p style=\"\">  \t 6- Preconception is Mental Contraception. Destroy rigid thinking structures.  </p>  <p style=\"\">  \t 7- One Plus One Gives One. Combine ideas for new creations.  </p>  <p style=\"\">  \t 8- Use the Force. Go abstract for creative inspiration.  </p>  <p style=\"\">  \t 9- Fun and Mental is Fundamental. Harness provocative arrangements.  </p>  <p style=\"\">  \t 10- A Win-Whinge Situation. Evaluate ideas in a productive way.  </p>  <p style=\"\">  \t There&#039;s a whole mix of content including video and narrated presentations. There  are also assignments to put your skills to the test and 30 trigger  cards to collect for when you need a rapid creative refresher.  </p>  <p style=\"\">  \t *Yes, Skool is intentionally misspelled... but to be creative, you sometime have to break the rules, as you&#039;ll see!  </p>", 
    "end_date": null, 
    "title": "Skool of Creativity", 
    "price": "50.00", 
    "instructors": "Simon Jack", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36275_11eb_4.jpg", 
    "course_url": "https://www.udemy.com/skool-of-creativity/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-15T14:28:50Z"
}