{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Smashwords is the fast way to publish everywhere that is not Amazon. But it's not for everyone.</p><p>Allow me to explain...</p><p>First, you should publish in Amazon Kindle format via KDP. Kindle eBooks are where you'll find most of your readership and therefore generate the most revenue. If you haven't already published via KDP, stop reading now and check out my course entitled \"Publishing on Kindle: Self-publishing eBooks on Amazon KDP\".</p><p>Second, you should publish in Print on Demand (POD) paperback format via CreateSpace. If you haven't already done so, stop reading now and check out my course titled \"Publishing on CreateSpace: Self-publishing Books on Amazon\".</p><p>Third, I recommend that you enroll in the KDP Select program to generate more revenue on Amazon Kindle eBooks through the KU and KOLL lending programs and to take advantage of promotional opportunities only made available to members of this program. Entering the KDP Select program requires that you publish your eBooks exclusively with Amazon and therefore do not publish on Smashwords.</p><p>If you have already 1) Published via KDP, 2) Published via CreateSpace and 3) chosen not to enter the KDP Select program, this course is for you.</p><p>This is the final step. Now that you've published on Amazon, use Smashwords to publish everywhere else. Smashwords will transform your Microsoft Word formatted document to the appropriate formats required by several eBook readers (e.g. ePub, MOBI, PDF ...) and then distribute your book for sale at all the non-Amazon eBook distributors (e.g. Apple iBook store, Barnes &amp; Noble, Kobo, Scribd ...).</p><p>In this course you'll learn everything you need to publish via Smashwords. You'll learn:</p><ol><li>What Smashwords is an how it works.</li><li>How to format your manuscript for publication via Smashwords.</li><li>How to upload your manuscript for publication via Smashwords.</li><li>How to monitor sales and modify your book.</li></ol><p>So, if you're ready to publish everywhere that is not Amazon, I'm ready to show you how.</p><p>---Brian</p>", 
    "end_date": null, 
    "title": "Smashwords Self-publishing", 
    "price": "20.00", 
    "instructors": "Author/Publisher Brian Jackson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548118_5cd1.jpg", 
    "course_url": "https://www.udemy.com/smashwords-self-publishing/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-07T17:08:32Z"
}