{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tSnapseed is a powerful image enhancing tool that is easy to use.  In this course you&#039;ll learn how to use Snapeed in creative ways by walking you through the exact steps I used to create eleven different images.  </p>  <p style=\"\">  \tThe goal of the course is not only  to teach you how to use the various features of Snapseed but learn the fundamentals of creative image processing.  This course is just as much about &#039;how to&#039; do it as &#039;why&#039; we do it.  </p>  <p style=\"\">  \tBy the end of this course, not only will you be fired up about using Snapseed photo editing tools, you will be able to explore your own creativity and make photographs you are excited to share with your friends, family and maybe even the world!  </p>  <p style=\"\">  \t<strong style=\"\">Reasons To Attend</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Real Examples</strong> - You can download copies of all the images in the course and follow along with me as we make some magic together! Click Here - To see the images we work through.  </p>  <p style=\"\">  \t<strong style=\"\">Real World Creativity</strong> - This is not just a Snapseed tutorial. It is so much more than that. The principals you learn here are the same creative processing principals you can apply to all your photo processing!  </p>  <p style=\"\">  \t<strong style=\"\">Q/A</strong> - You can ask me questions directly...and yep, I will happily answer them.  </p>  <p style=\"\">  \t<strong style=\"\">Bang For The Buck</strong> - The techniques you learn here can be applied to Snapseed for the desktop, iPad, iPhone, &amp; Droid!  </p>  <p style=\"\">  \t<strong style=\"\">Self-Paced</strong> - Take your time, you will have lifetime access to the course and its content.  </p>  <p style=\"\">  \t<strong style=\"\">The Best Part</strong> - As long as you remain a student, you will receive free updates whenever I publish new course material.  </p>  <p style=\"\">  \tLearn smart use of Snapseed with my especial photo editing tutorials and get most out of your iPhone or Andriod.  </p>  <p style=\"\">  \tI really look forward to teaching you!  </p>  <p style=\"\">  \tJustin  </p>  <p style=\"\">  \t</p>  &lt;/p&gt;", 
    "end_date": null, 
    "title": "Snapseed - The Definitive Guide", 
    "price": "20.00", 
    "instructors": "Justin Balog", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28923_14de_4.jpg", 
    "course_url": "https://www.udemy.com/snapseed/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-07T20:18:11Z"
}