{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hey y'all! Let me ask you; have you ever witnessed a <strong>phenomenal presentation</strong> and thought, \"I wish I could be that charismatic and memorable!\" If so, you're at the right place. This course will tell you how incorporating <strong>storytelling &amp;</strong> <strong>activity design</strong> into your <strong>presentation</strong> will help alleviate anxiety for both you and your audience. We will look five different methods &amp; strategies that will help in forming your own style of storytelling and activity design. By becoming an avid <strong>storyteller</strong> and <strong>facilitator</strong>, or teacher, you'll be less anxious while <strong>collaborating</strong> with your <strong>audience</strong>, and realize that's it's really not about you! </p><p><b>Why this topic?</b> Are you afraid to speak in public? If you answered yes, you're not alone. This is formally called Speech Anxiety Disorder. Some of the most common symptoms of speech anxiety are: shaking, sweating, butterflies in the stomach, and rapid heartbeat. Every year, surveyed Americans share that public speaking is their number one fear (University of Pittsburgh). In fact, year after year it is listed even before death! This topic is relevant and important because public speaking must be reframed into basic communication! There is a need for newly designed presentation methods because the current focus is not working to reducing fear. There has to be a component to reduce anxiety and allow for great &amp; fun presentations. Remember, it is not about you. Your focus should be on your audience! </p><p><b>What makes this different? </b>The concept of pairing a story with an activity to open your presentation makes the interaction a facilitation, or teaching opportunity. Interaction between the speaker and the audience creates an architect aspect and allows one to project, \"This audience needs me to teach them something (said topic); it's not about me, it's about helping them understand ____.\" A teaching-learning transaction is an opportunity for learners to grow and develop using personal experiences. The teacher is a process facilitator working to create active learning environments for their audience. As a presenter, you are being is an instructor. You are teaching other adults something you feel they should know. Successful instructors recognize the wide range of anxieties that adults bring into a room, and they make every effort to alleviate them early. The first 3 minutes of your presentation are crucial to your success. By creating a climate in which each participant can feel comfortable, secure, and able to learn, they (the instructor) have created the conditions for successful teaching and learning.<b></b></p><p>Opening with an activity reduces tension and anxiety in both the instructor and the audience. This fosters involvement from all members, helping to familiarize participants with each other. A great communicator knows to put the people before the message! Instead of initially trying to get your audience to immediately download information; have them connect with each other.</p><p><b>How will you measure success?</b> Focus on developing your skills. You should have the desired outcome of creating an authentic and compelling story and activity in which you are proud of. Too often, people get caught up in the fear of being measured by their results. You should feel that by using the outlined methods, you have earned credibility among your audience. Brookfield (1990) believes that building trust and authenticity is essential for meaningful learning. An authentic presenter is one who emanates credibility. This is achieved by revealing aspects of oneself as a person through stories and testimonies. Authenticity shines bright when one is teaching and telling a personal story to involve their audience. Setting a tone of authenticity should be deliberate from every communicator, and should be considered when you measure your success!</p>", 
    "end_date": null, 
    "title": "Storytelling + Activity = Presentation Readiness ", 
    "price": 0, 
    "instructors": "Grace Janoski", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499226_ee54_4.jpg", 
    "course_url": "https://www.udemy.com/storytelling-activity-presentation-readiness/", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T18:51:15Z"
}