{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> This course is a dynamic framework featuring \"The 10 Ps,\" or 10 Steps that take you from the foundation, Purpose, through Practice and Process, all the way to Promotion and Publication. How to go from inspiration to publication—from initial idea for your book, to ways to stay focused and motivated, through common hindrances, editing, how to secure an agent, create community and promote your work in the world.</p><p>Take this course, and within just weeks, you’ll be enjoying:</p><ul><li>Innovative writing prompts, and a great skills guide!</li><li>The clear and concise steps that take you from inspiration to publication!</li><li>Methods for overcoming writer's blocks and other obstacles!</li><li>Techniques for setting up a quality writing practice!  <br>\n</li><li>Tips on editing: moving from compost heap to flower garden!\n</li><li>How to create community and build your platform!</li><li>The secret to finding a literary agent!\n</li><li><strong>And so much more...</strong></li></ul><p><strong>Wether you are just starting out, or have been writing in fits and starts for years, this course can help you stay focused and disciplined in order to complete that book project you've always wanted to write, learn how to connect with agents, build your platform and community, and finally publish your work and connect with readers.</strong></p><p> Even if you already have an MFA in writing, this is a great \ncompliment course that fills in all the gaps that most MFA programs \nmiss, including meditations on practice and persistence, how to write a \nsuccessful book proposal, how to create community, and powerful tips on \neffective promotion. </p>", 
    "end_date": null, 
    "title": "Successful Writers Master Class", 
    "price": "45.00", 
    "instructors": "Albert Flynn DeSilver", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645932_bc0e_3.jpg", 
    "course_url": "https://www.udemy.com/brilliant-writers-master-class-for-successful-writers/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T15:31:51Z"
}