{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Are You Frustrated Because Whenever You Try To Write Content Fast, Nothing Ever Comes?</strong><br></p>\n\n<p>Have you ever been mad that it just takes you too long to write articles, blogs, and other web content?</p>\n\n\n\n<p>Are you constantly banging your head against the wall, because whenever you try to get into the swing of writing, it just never works?</p>\n\n\n\n<p><strong>How Would It Feel If You Could Write High Quality Content Quickly And Reliably?</strong></p>\n\n\n\n<p>You probably realize the benefits of being able to churn out a raging river of content for your business.</p>\n\n\n\n<p>Imagine the benefits and prestige that comes with being able to produce content that your end users actually read, and content that's easy for you to write?</p>\n\n\n\n<p><strong>Imagine The Power Of An Infinite Wealth Of Content At Your Fingertips</strong></p>\n\n\n\n<p>How would it feel if you could create a 500 word article or blog post in 20 minutes instead of 20 hours?</p>\n\n\n\n<p>If you know what it's like to spin your wheels, and if you've ever suffered from chronic writer's block, you're going to love this course.</p>\n\n\n\n<p>So you can finally fill your websites, blogs, online courses, article directories, and client's hands with awesome content that didn't take a month until Sunday to write.</p>\n\n\n\n<p><strong>I Know What It's Like To Struggle Writing! That's Why It's My Honor To Help You</strong></p>\n\n\n\n<p>See, I've spent years of my life writing content. I'm an established ghostwriter, email marketer and blogger, so if there's one thing I can help you with, it's writing high quality content fast.</p>\n\n\n\n<p>So you can finally have the confidence and web presence that's only possible when you can create your own content quickly.</p>\n\n\n\n<p><strong>Discover The Secret To Fast Content Creation By Enrolling In This Course Today!</strong></p>\n\n\n\n<p>Ask yourself how it would feel to finally be able to write content that your end users find interesting. Content that your clients thank you for. And content that doesn't take you very long to write at all.<br></p>\n\n\n\n<p>Imagine the look on your face when people are actually visiting your websites because you have content created on a consistent basis.</p>\n\n\n\n<p>If it would feel good, then I honestly think you'll love this course.</p>\n\n\n\n<p><strong><em>Enroll Now So You Can Finally Start Writing Fast Even If You're Suffering From Soul-Crushing Writer's Block, And Even If The Cat Has Had Your Tongue For God Knows How Long!</em></strong></p>", 
    "end_date": null, 
    "title": "Super Fast Writing Hacks", 
    "price": "20.00", 
    "instructors": "Mike DeVincent", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642092_2672_3.jpg", 
    "course_url": "https://www.udemy.com/super-fast-writing-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T04:53:12Z"
}