{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Develop your creative problem solving skills, and your ability to help others to think more creatively.</p><p>We design, and deliver, innovation workshops that focus on important global challenges. Our workshops are based on the principles of Creative Problem Solving (CPS).  CPS is the oldest, and best researched, of the deliberate creative problem solving processes.  This course introduces you to the fundamental principles of creative behaviour, and teaches you the same methods we use when we are working with everyone from NASA, to the Government of New Zealand.</p><p>The course is designed around a few simple ideas:</p><ul><li>Everyone has the skill to think creatively</li><li>You can enhance this skill through practice</li><li>When you are developing a new skill, you need to start with the right level of difficulty. Enough so that it challenges you, but not so much that you become deflated. </li><li>You will need to practice the skill for a few weeks before you really notice the difference. So, please don't try to rush through the course.</li></ul>Now for the most important point. You have to make time to learn. No matter how enthusiastic you are about this topic, life will get in the way.  This is the main problem with online learning. It is incredibly easy to put to one side, and forget about. Don't let this happen to you.  Book learning meetings with yourself, and make it a priority. None of the videos are very long, and the exercises are designed to fit in with your daily life.Course details.<p>The course is taught through a combination of 19 short videos (maximum 10 minutes), and guided practice. It comes with a workbook that you can fill in along with the lesson videos. Each video introduces you to a new element of the creative thinking process, and we will encourage you to apply the lesson to your normal daily routine. The videos build on each other, so over the course of a few weeks you will have learned a lot, and practiced even more!</p>", 
    "end_date": null, 
    "title": "The Creative Thinking Course", 
    "price": "50.00", 
    "instructors": "Knowinnovation Inc", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485346_a99f_3.jpg", 
    "course_url": "https://www.udemy.com/the-creative-thinking-course/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T15:57:18Z"
}