{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong># Update # </strong></p><ul><li><strong>Over 2000 students already joined</strong></li><li><strong>New easy to use Cheat-sheets under each section ready           to be download</strong></li><li><strong>New blog is going to be used for our community</strong></li><li><strong>Start to share us with your friends ;-) </strong></li></ul><p><strong>***************************************************************</strong></p><p>  \t<strong>    WHY ?</strong>  </p>  <p>  \t        It is well known that innovation is the growing engine for many successful companies around the globe, fueling the economy growth. Now, zooming to the <strong>individual level</strong>, companies are looking for such <strong>\"creative leaders\"</strong>. Learning to be more creative and contribute ideas is becoming an <strong>important skill </strong>in many industry domains.  </p>  <p>  \t<strong>Creative attitude</strong> in our career can help us to get ahead, stand out from the crowd, capturing more opportunities along the way and <strong>adapt faster</strong> to ongoing changes around us. Becoming more <strong>proactive creative person</strong> will probably lead you to much more enjoyable and fulfilling life's journey whether you are a teacher, high-tech engineer, programmer, business man/women, doctor, college student and more.  </p>  <p>  \t              We can apply creative thinking almost everywhere !  </p>  <p>  \t<strong>WHAT are we looking for ?</strong>  </p>  <p>  \t        Did you ever wonder why some people seems to be more creative and innovative than other ? why they keep get a head in their career or business ? is that saved only for special people ?  </p>  <p>  \t                                                In each and every one of us, the <strong>SPARK </strong>of the creative mind is waiting to be discovered. We will learn how to become much more creative and innovative. The course will cover the needed step by step framework for such important personal development.  </p>  <p>  \t<strong>      HOW are we going to that ? </strong>  </p>  <p>  \t<strong></strong>The course has more than <strong>40</strong> <strong>video lectures</strong>, divided to <strong>8 sections</strong>. We will start our journey with introduction on innovation and creativity, next we will learn to adjust the most effective \"creative climate\" with some very important preparation steps. Then we will follow the creative thinking cycle, phase by phase, learning to boost creative thinking, translate ideas into action plan and much more.  </p>  <p>  \t<strong>ARE you ready to START your creative journey ?</strong>  </p>", 
    "end_date": null, 
    "title": "The Complete Innovator Guide to Spark Creative Thinking", 
    "price": "25.00", 
    "instructors": "Idan Gabrieli", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376958_4e0f_6.jpg", 
    "course_url": "https://www.udemy.com/the-complete-innovator-guide-to-spark-creative-thinking/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-24T12:18:23Z"
}