{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Are you trying to write more words everyday....but failing? </strong></p><p style=\"\"><strong style=\"\">Are you frustrated about the number of words you can physically write each day? </strong></p><p style=\"\"><strong style=\"\">Are you seeking a system that will allow you to achieve more?</strong> </p><p style=\"\">It is a constant problem of anyone engaged in any form of freelance writing activity - simply not being able to write enough. You fully understand that the more words that you write the more money you will get paid, be it in the form of more kindle book sales, more article sales or being able to get more freelance jobs completed. However, writing lots of words a day can be tough. What if there was a system that could be used that would increase your daily word count to levels that you thought were impossible? </p><p style=\"\">The good news for you is that there is. A method that one of the most famous figures in history used to publish more words than Shakespeare and Dickens combined, while at the same time achieving a range of other successes in different fields. </p><p style=\"\">This method is broken down and brought unto date to allow for modern technology. </p><p style=\"\">You can start using it in your writing business almost immediately. </p><p style=\"\"><strong style=\"\">By taking this course you will be able to:</strong> </p><ul style=\"\"><li style=\"\">Understand that volume is the key success </li><li style=\"\">Plan your writing better to achieve better results </li><li style=\"\">Tap into a method to write used by one of the most famous figures in history. </li><li style=\"\">Develop the method to fully reach your potential</li></ul><p style=\"\"><strong style=\"\">As a result:</strong> </p><ul style=\"\"><li style=\"\">You will publish more books and articles than ever before</li><li style=\"\">Generate more income.</li></ul>", 
    "end_date": null, 
    "title": "The Churchill Method  - How to write more words everyday! ", 
    "price": "20.00", 
    "instructors": "Mark Garber", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532736_bc77_2.jpg", 
    "course_url": "https://www.udemy.com/the-churchill-method-how-to-write-more-words-everyday/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-20T06:48:00Z"
}