{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Do you </strong><strong class=\"redactor-inline-converted\">have an idea for a novel</strong> but, you don't know where to start? You can see it so clearly in your head but can't seem to put it on the page? Novel writing without a guide can be scary or even intimidating. Where do you start? </p>\n\n<p>Luckily you found the right place. <strong class=\"redactor-inline-converted\">Guyton-Moore Strategic Services' the Basic's of Novel Writing</strong> is just what you need and this course is only available on Udemy. With us by your side your masterpiece will shine like a gem. In Guyton-Moore Strategic Services' the Basics of Novel Writing we will go over <strong class=\"redactor-inline-converted\">everything you will need to know on the basic level of novel writing</strong>.</p>\n\n<p> Including how to prewrite your work so that you can properly <strong class=\"redactor-inline-converted\">see your ideas and formulate your manuscript</strong> before beginning chapter one. </p>\n\n<p>We will also be discussing <strong class=\"redactor-inline-converted\">how to overcome writer's block and other creative stoppages</strong> that threaten all novel writers. Learn about practices you need to avoid to successfully write your final draft. </p>\n\n<p>You can also expect these important subjects: Types of Conflict, Plot Development, Advantages and Disadvantages of each POV, Scene Transition and of course many more in Guyton-Moore Strategic Services’ The Basics of Novel Writing. We look forward to arming you with the tools you will need to <strong class=\"redactor-inline-converted\">master the art of novel writing</strong>.</p>", 
    "end_date": null, 
    "title": "The Basics of Novel Writing", 
    "price": "20.00", 
    "instructors": "Clarence Moore", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835888_187a_2.jpg", 
    "course_url": "https://www.udemy.com/novelwritingbasics/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-30T06:37:40Z"
}