{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course is dealing with mammalian cloning in general, and with a special method developed by the author and his colleagues that makes the method simple, inexpensive, efficient, reliable, and applicable under compromised conditions, even - possibly - in your garage.. </p><p style=\"\">This is a special subject among UDEMY courses, hard to insert in any existing category, nevertheless, I think more and more similar courses will be produced and needed. Keywords for the subject include science, biotechnology, embryology, cloning, animals, agriculture, medicine, innovation. </p><p style=\"\">The  course consists of 8 sections and 13 lectures. The language is simple and easy to understand for laymen (once they understand my bad pronunciation due to my deafness...). First lectures prepare the audience to the main subject by stepwise introduction re. the author, the course itself, embryology, theory and traditional practice of cloning. The main subject, handmade cloning will be discussed in two long chapters with ample video illustration. Understanding of events on the video are facilitated by the previous explanation - and may also mean a kind of exam for the students. In the final lectures, the controversial situation of cloning is described. Hopefully students will understand the situation and support our efforts, or at least won&#039;t regard cloners as evil creatures any more.</p><p style=\"\">Anybody who is interested in this subject (with controversial reputation, I admit) is encouraged to enroll. This is not a demanding scientific education, just an invitation to an excursion to see our world as it is. Sometimes funny, sometimes frustrating, but at least - authentic.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Ultimately Simplified  Approach for Animal Cloning", 
    "price": "45.00", 
    "instructors": "Gabor Vajta", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412810_be24.jpg", 
    "course_url": "https://www.udemy.com/animal-cloning-can-it-be-done-in-your-garage/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T01:59:58Z"
}