{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Unified Structure: <em style=\"\">Using Theme to Develop Character and Plot </em></strong>takes on the primary screenwriting struggle to make stories resonate.  </p>  <p style=\"\">  \t      Have you ever been told one of the following?  </p>  <ul style=\"\">  \t<li style=\"\">You story feels like a series of happenings with an ending tacked on.</li>  \t<li style=\"\">Your protagonist or hero doesn&#039;t seem to learn anything.</li>  \t<li style=\"\">I read your story and, um, so what?</li>  </ul>  <p style=\"\">  \t      Bren designed this seminar to help writers, especially  screenwriters, to create a unified narrative. If you consider yourself  an intuitive writer, this will give you a structural perspective without  crushing your creative impulses. If you&#039;re a plot-driven structuralist,  this will allow you to expand your creative tool set to maximize your  protagonist&#039;s inner journey, so that it connects with audiences.  </p>  <p style=\"\">  \t      After assessing the strengths and weaknesses of the three  foundational screenwriting texts on theme development, Bren lays out how  to identify, brainstorm, and develop your story&#039;s theme through  character journey and plot.  </p>  <p style=\"\">  \t      Using examples from various films, you will learn specifically:  </p>  <ul style=\"\">  \t<li style=\"\">How to recognize the weakness in a movie&#039;s theme</li>  \t<li style=\"\">How to brainstorm the values of your story as a means of finding unifying story elements, and the most vehicle for your theme</li>  \t<li style=\"\">How to integrate your theme into a story without making it sound preachy or tacked on. </li>  </ul>  <p style=\"\">  \t      The course itself is roughly an hour, but it&#039;s packed with  information to consider and work through. There are no prerequisites so  you don&#039;t need to have read anything prior to the course.  You may want  to go back and watch some of the movies referenced in the course  afterward to help solidify the concepts in your mind.  </p>", 
    "end_date": null, 
    "title": "Unified Structure: Using Theme to Develop Character and Plot", 
    "price": "20.00", 
    "instructors": "Brennan Smith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322354_099c_3.jpg", 
    "course_url": "https://www.udemy.com/unified-structure/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-19T00:27:51Z"
}