{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn how the writers behind Jurassic World utilized methods to make it one of the biggest films in the world. Instead of talking about abstract screenwriting theories that are hard to grasp, you will see actual scenes dissected so you can understand how the pros are actually writing these big hit movies.</p><p><strong class=\"redactor-inline-converted\">Master Screenwriting Methods Utilized in Jurassic World and Use Them in Your Own Screenplays</strong></p><p>Participate in writing activities based on the methods used in Jurassic World</p><p>Understand the themes of Jurassic World and how they shape the movie</p><p>Learn how different characters are written and what makes them unique</p><p><strong class=\"redactor-inline-converted\">Beef Up Your Screenwriting Skills by Seeing How Big Movies are Written</strong></p><p>Jurassic World was one of the biggest films of 2015, breaking the opening weekend box office record at the time. Overall, the success of the film comes down to the writing - this is where every movie starts.</p><p>Seeing how the writers of Jurassic World employed methods to their characters, plot points and themes will give you more tools to use in your own writing. It will spark your creativity and show you methods you may have never seen before. And with the included activities, you will be able to practice these methods until you understand them inside and out.</p><p><strong>Content and Overview</strong></p><p>Geared towards beginning screenwriters but useful to ALL writers, you will see why particular scenes from Jurassic World are so successful, the usage of the characters in the film, and how the themes of the movie drive the story. The lessons included have activities at the end so you can practice writing immediately! Think of them as exercises for your writing muscles.</p><p>First, we will cover the themes of Jurassic World, such as the ethics of genetic engineering and what our theme parks tell us about our capitalist society. Then, we will look at lessons taken from individual scenes and plot points. You will see how character skills are introduced, how benefits to characters are suddenly taken away, and how you can surprise your audience with the climax of your movie. Finally, we will focus on the 4 main characters of Jurassic World and understand what makes them unique.</p><p>After completing this course, you will have a better understanding as to how professional screenwriters write these big movies. Even better, you will be able to practice these skills with the included exercises and them use them in your OWN movies!</p><p><br></p>", 
    "end_date": null, 
    "title": "Write Like Jurassic World", 
    "price": "20.00", 
    "instructors": "Ryan Estabrooks", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/774800_e1a8_2.jpg", 
    "course_url": "https://www.udemy.com/write-like-jurassic-world/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-26T06:28:20Z"
}