{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Course Update 3/12/2016</p><p>Additional videos have been added that show how to transition a rough draft to polished product. Some of the focus on using an artist.  I've moved the material to its own section, Section 11.</p><p><strong>ABOUT THIS COURSE</strong><br></p><p>If you've ever wanted to make the world a better place for children by sharing some of your values and life lessons, this is the course for you. You will learn simple, proven, techniques that will empower you to write the first draft of a picture book. You'll learn how to get feedback on that manuscript, and explore ways to enhance the manuscript. You'll learn how to judge when it is ready to send out for publication or to self publish. </p><p>The course includes:</p><ul><li>Videos - including videos that show how to use successful books as models and how to use photographs to write a book</li><li>Checklists</li><li>Audio interviews</li><li>Pre-assessments</li><li>Assessments</li><li>Detailed notes in .pdf files</li><li>Inspirational materials</li><li>Labs that will help you to get feedback from your peers and the instructor</li></ul>Some of the lectures use examples from my picture book, The Monster on Top of the Bed and other books that I have written. This is a comprehensive course for beginners, and you are welcome to ask questions and participate in discussions. After you're written and published your children's book, children will thank you, and you'll find that you're making a difference in the world.", 
    "end_date": null, 
    "title": "Write a Picture Book - Entertain Children - Be a Hero", 
    "price": "20.00", 
    "instructors": "Alan H. Jordan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521394_664d_3.jpg", 
    "course_url": "https://www.udemy.com/write-a-picture-book-empower-children-make-money-101/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-05T16:40:34Z"
}