{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Want to write great short stories? Want to improve your creative writing and get feedback from a prize winning author? Then this course is for you. </p>\n\n<p>Working through the life cycle of a story from idea to publication, you'll learn everything you need to know to be a successful short story writer. Find ideas, get playful, learn about drafting, structure and polishing your work, and how to publish yourself too. The course continues with extra help once your story is out there. Learn how to publicize your work, as well as dealing with feedback and reviews with a smile on your face. </p>\n\n<p>Led by Authors' Club and Betty Trask Award winning author Nicola Monaghan (aka best selling thriller writer Niki Valentine), this course contains over two and a half hours of video lectures on creative writing, as well as plenty of additional material in the form of resource sheets and proformas. There are regular exercises throughout, and you'll get the chance to post examples of your writing and get feedback. There's also a bonus free ebook 'The Night Lingers and other stories' by Nicola Monaghan, available to download towards the end of the lectures, as a thank you for choosing this course. </p>\n\n<p>Enrol on this course now, and start flexing your creative writing muscles and writing great stories! </p>", 
    "end_date": null, 
    "title": "Write great short stories: learn from a prizewinning author!", 
    "price": "20.00", 
    "instructors": "Nicola Valentine", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334902_ecec_3.jpg", 
    "course_url": "https://www.udemy.com/short-story-workshop-learn-from-a-prizewinning-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Creativity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T16:05:08Z"
}