{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  If you would like to &quot;download&quot; the world&#039;s deadliest self defense moves directly into your brain... just by turning on your computer, tablet, or smart phone and without even having to get off your couch... then this course will show you how.  </p>  <p>  \t  Here&#039;s the story:  </p>  <p>  \t  Many years ago, while traveling the world seeking the perfect fighting style that would work for anyone (regardless of size, speed or experience) I met &quot;Colonel B.&quot;—the last remaining Close Combat Training master.  </p>  <p>  \t  But Colonel B. did not look like your typical killer.  </p>  <p>  \t  He was an old man at the time—constantly drunk, out of shape and so wirey thin he almost looked like &quot;gollum&quot; in the Lord Of The Rings movies.  </p>  <p>  \t  Yet, he and his &quot;rag-tag&quot; battalion of Close Combat Training masters were legendary in World War 2 for terrorizing elite Nazi soldiers and...  </p>  <p>  \t  Killing Them With Their Bare Hands!  </p>  <p>  \t  Before meeting the Colonel, I THOUGHT I was a tough guy.  </p>  <p>  \t  I thought I knew a lot about fighting and surviving.  </p>  <p>  \t  I&#039;d been a military interrogator (i.e. trained to extract information from hostile enemy combatants), had black belts in 5 different martial arts and was even a US Gold Medal Grappling Champion.  </p>  <p>  \t  Not to mention all the &quot;black hat&quot; methods I learned while training with violent Arabian assassins in Egypt, West Bank Israeli soldiers and even the few remaining Japanese Samurai.  </p>  <p>  \t  But the Colonel just laughed when I told him what these killers taught me.  </p>  <p>  \t  He said he thought it was &quot;cute.&quot;  </p>  <p>  \t  And after training with the Colonel for several grueling months, I realized just how LITTLE I knew about fighting. And just how silly all those &quot;killer&quot; techniques I&#039;d learned were compared to Close Combat Training.  </p>  <p>  \t  Anyway, here&#039;s why this is important for you:  </p>  <p>  \t  At the end of my time with the Colonel, he dragged me to a pub in a nasty part of London. He walked over to a pack of psychotic looking thugs in the corner, said something to them and pointed at me. I&#039;m not sure exactly what he said. But these tattooed, muscle-bound thugs dropped their drinks, pulled weapons from their pockets and rushed my way.  </p>  <p>  \t  And that&#039;s when I learned—REALLY learned—Close Combat Training.  </p>  <p>  \t  You see, I was no longer in the &quot;safety&quot; of a class. These guys had real anger, real aggression and...  </p>  <p>  \t  Real Weapons!  </p>  <p>  \t  Including chains, razor-sharp knives and even guns.  </p>  <p>  \t  And as they rushed towards me, I knew the Colonel was giving me my &quot;final lesson&quot;—where I would either kill or BE killed.  </p>  <p>  \t  No &quot;do overs.&quot;  </p>  <p>  \t  No getting back up if I go down.  </p>  <p>  \t  No screwing around.  </p>  <p>  \t  These guys were out for blood. And if I made even one &quot;slip&quot; up...  </p>  <p>  \t  I Wouldn&#039;t Live  </p>  <p>  \t  To See Another Day!  </p>  <p>  \t  What happened?  </p>  <p>  \t  The instant the first thug got within arm&#039;s reach, everything the Colonel taught me suddenly &quot;clicked&quot;—and I ripped through them like a tornado, leaving them broken-boned, howling in pain and bleeding all over the floor.  </p>  <p>  \t  Frankly, there&#039;s not much to tell.  </p>  <p>  \t  It was over almost as fast as it began.  </p>  <p>  \t  But even so... those few moments changed EVERYTHING for me.  </p>  <p>  \t  Because, you see, I simply did not know what REAL combat was until my life was threatened by a half dozen blood thirsty thugs armed to the teeth in that pub—where I had no weapons, no back up and no help.  </p>  <p>  \t  And it was ONLY at that point when, for the first time in my life...  </p>  <p>  \t  I Finally Awakened My  </p>  <p>  \t  &quot;Inner Bad Ass&quot;  </p>  <p>  \t  It didn&#039;t matter how fast, strong or fit I was.  </p>  <p>  \t  It didn&#039;t matter how many skirmishes I&#039;d been in.  </p>  <p>  \t  And it didn&#039;t matter how many black belts or medals I had.  </p>  <p>  \t  None of that mattered. In fact, I always wondered how the Colonel—who was always drunk and could barely walk a flight of stairs without stumbling or tripping—could do what he did.  </p>  <p>  \t  Now I had my answer:  </p>  <p>  \t  Colonel Nigel Baywood simply knew Close Combat Training at a &quot;cellular&quot; level. It was &quot;in&quot; him—as much a part of him as his very skin—from actually USING it in real life-or-death combat.  </p>  <p>  \t  And since then, Close Combat Training has been &quot;in&quot; me, too—as part of me as my own hands and feet.  </p>  <p>  \t  But here&#039;s the problem:  </p>  <p>  \t  When I went back home and taught Close Combat Training, I could never (legally) put my students in the same life-or-death situation—so they could really get it at that killer instinct, &quot;inner bad-ass&quot; slice of the brain.  </p>  <p>  \t  The part of you that only takes over...  </p>  <p>  \t  When Your Life Is  </p>  <p>  \t  TRULY In Danger!  </p>  <p>  \t  Even my Close Combat Training videos (considered the best in the industry by Special Forces soldiers, international mercenaries and even Olympic level mixed martial artists) can&#039;t teach this mindset unless you go out and pick a fight with some goons in an alley like I did.  </p>  <p>  \t  And then one day, while at the movies, it hit me.  </p>  <p>  \t  Have you ever noticed how, after watching a good action movie, you can remember the fight scenes?  </p>  <p>  \t  And, in many cases, even mimic what you saw?  </p>  <p>  \t  That&#039;s because, outside of being in a real fight, that&#039;s the BEST way to learn self defense—by watching a scenario unfold in &quot;live action.&quot; It&#039;s very easy for your brain to follow and absorb what you see in movie form.  </p>  <p>  \t  So I got to thinking:  </p>  <p>  \t  What if I did a video series with life-like fights, using Close Combat Training? Scenarios that would be like a good action movie—both entertaining AND educational? Where I would SHOW you a realistic (and common) violent scene, and then go back and walk you, step-by-step, through how to defend against it?  </p>  <p>  \t  And that&#039;s when &quot;Scientific Self Defense&quot; was born.  </p>  <p>  \t  You literally watch these lessons just ONE TIME—and the world&#039;s most deadly self defense skills are basically &quot;downloaded&quot; into your brain, without practicing, sweating or even getting up off your couch.  </p>  <p>  \t  Scientific Self Defense gives you a quickie &quot;idiot&#039;s guide&quot; to putting down anyone who pulls a gun on you, including:  </p>  <p>  \t  A childishly easy way to disarm someone you can learn in 60 seconds or less... A dead &quot;give away&quot; which tells you if a gunman really intends to shoot you or not... What to do if someone sticks a gun to your back... The FIRST (and only) thing you should do if someone waves a gun at your face... Why you should NEVER drop your keys if attacked at gun point... And even...  </p>  <p>  \t  Why You Must NEVER Shoot Someone With Their Own Gun!  </p>  <p>  \t  This is no joke.  </p>  <p>  \t  When you disarm someone, the LAST thing you want to do is shoot them with their own gun. Believe it or not, that can put you and your family in mortal danger.  </p>  <p>  \t  Nobody else teaches this, because so few have ever been in a real situation like that. Lucky for you, I have. And I can tell you exactly what to do to keep you and your family safe in a gun attack.  </p>  <p>  \t  Plus I want to show you a &quot;can&#039;t fail&quot; way to tear through any opponent (or multiple opponents) so fast they&#039;ll be...  </p>  <p>  \t  Strapped To A Gurney In An Ambulance Before They Even Know What Hits Them!  </p>  <p>  \t  This is the single most gruesome attack you&#039;ll ever see.  </p>  <p>  \t  Yet, it&#039;s so simple you&#039;ll laugh.  </p>  <p>  \t  Only a handful of people in the world really know how it works. And it lets you cut through thugs, gang members and even trained fighters like that &quot;Tasmanian devil&quot; in the Bugs Bunny cartoons—hurting, maiming and killing anyone in your path.  </p>  <p>  \t  Anyway, here&#039;s the bottom line:  </p>  <p>  \t  Scientific Self Defense contains in-depth training on more than 65 advanced Close Combat Training techniques, tactics and methodologies.  </p>  <p>  \t  We cover multiple locations and scenarios ranging from an assault in a freezing parking lot with a crow bar... to having a gun pulled on you in a bar... to someone trying to stab your eyes out for no reason.  </p>  <p>  \t  But here&#039;s the best part about these lessons:  </p>  <p>  \t  Being a trained educator and life-long researcher of how the human mind learns and absorbs information, I created these lessons specifically so you can...  </p>  <p>  \t  Learn Them Just By Watching Them!  </p>  <p>  \t  I&#039;m dead serious about this, too.You need only WATCH the lessons to install these moves into your neural pathways and make them a &quot;part&quot; of you—as attached to your body as your own arms and legs.Which means, you NEVER have to practice.Never have to study boring techniques or roll around on a mat.Heck, you don&#039;t even have to get off your couch.Just kick back and watch these videos and you will automatically absorb the lessons. It&#039;s almost like the movie &quot;The Matrix&quot;—where they &quot;downloaded&quot; advanced fighting skills directly into peoples&#039; brains.This is likely your only chance to learn how to tear into violent attackers without training, exercise or even so much as leaving your sofa.Your only chance to be a badass without physically working for it.It&#039;s as close to a self defense &quot;magic pill&quot; as you can get.’  </p>  <p>  \t  So you dan&#039;t dawdle or put this off.Take this course now, before it slips your mind and before it&#039;s too late.  </p>", 
    "end_date": null, 
    "title": "Advanced Close Combat Training: Scientific Self Defense", 
    "price": "50.00", 
    "instructors": "Captain Chris Pizzo", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/225172_977f_4.jpg", 
    "course_url": "https://www.udemy.com/scientificselfdefense/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-21T14:05:30Z"
}