{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><em><em><em><strong><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></strong></em></em></em></strong></p>\n\n<p><strong>Many supposed experts have got the BULLYING PROBLEM all wrong, and that is why bullying is getting worse and not better .</strong></p>\n\n\n\n\n\n\n\n<p><strong>Have you noticed that there has been an ever increasing number of bullying stories, anti-bullying videos, anti-bullying songs, and even legislation to help with bullying, yet the problem seems to be getting worse?</strong></p>\n\n\n\n\n\n\n\n<p><em>\" In the Unites States More than one-quarter of students between the ages of 12 and 18 reported being bullied at school during the 2014-15 school year — nearly 7 million students.\"</em></p>\n\n\n\n\n\n\n\n<p>Every kid (and even a lot of grownups) gets teased from time to time. This is just part of growing up and being human. Making small jokes to break the tension in awkward situations or to relieve stress or fear is alright.</p>\n\n\n\n\n\n\n\n<p><strong>With this course Parents can Learn Effective Ways To Overcome Bullying In School Permanently</strong></p>\n\n\n\n\n\n\n\n<p> Minor teasing is not designed to hurt emotionally, discourage someone or damage their self-esteem, ruin their psychological well-being, or cause them fear or anxiety. Minor teasing is designed to create a laugh in which individuals are laughing with you rather than at you (although teasing can be taken to the extreme and crossed the line into bullying very easily). </p>\n\n\n\n\n\n\n\n<p>Nothing is kept secret - I reveal all I know ... and as I test even more\n things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>\n\n\n\n\n\n\n\n<p>\n  \t                                                                     \n                                                           As well as \nthe Udemy 30 day guarantee, you have my personal promise that you will \nbe wowed and delighted by what you'll learn in the next 3 to 4 hours.</p>\n\n\n\n\n\n\n\n<p> Just like every kid gets teased for being a geek, (for wearing braces for a variety of other things) they also at some time in their life are more than likely going to have to deal with bullies.  </p>\n\n\n\n\n\n\n\n<p><strong>What you can expect from this course:</strong></p>\n\n\n\n\n\n\n\n<ul><li>Over 38 lectures and 2.5 hours of content !</li><li>The difference between the way boys and girls tend to deal with the stress of being bullied , as well as the difference between the way girls and boys bully (psychological versus physical)</li><li>You will learn a straightforward and easily definable definition of bullying versus teasing and other growing pains</li><li>You will learn just who the bullies are and what makes them act the way they do</li><li>You will learn about the three different types of bullying, and the effects they have on their victims</li><li>You will learn about bullies in the workplace and the proper procedures for dealing with bullying as an adult</li><li>You will learn the myths about bullies and bullying</li><li>You will learn effective strategies for dealing with bullies</li><li>You will learn how to talk to your child if they are the bully and teach them about forgiveness and understanding</li></ul>\n\n\n\n\n\n\n\n<p><strong>Who is this Class For:</strong></p>\n\n\n\n\n\n\n\n<ul><li>This class is for anyone who has children that are either bullying or being bullied is also for educators, who may be dealing with bullying in their classrooms and in the schoolyard and even online.</li><li>For adults who feel that they are being bullied in the workplace and need some guidance as to the proper legal procedures, as well as strategies for dealing with their bully problem on an adult level.</li></ul>\n\n\n\n\n\n\n\n<p><strong>Course Updates:</strong></p>\n\n\n\n\n\n\n\n<ul><li><strong>Over 1000+ Students Enrolled in the first 24 hours!!</strong></li><li><strong>30 Day 100% Risk Free Offer!</strong></li></ul>\n\n\n\n\n\n\n\n<p> Being bullied is worse than teasing because it is designed to damage someone's self-esteem. It can cause them emotional, psychological stress, and even physical pain. It is done with the express purpose of causing harm in one form or another because of social media and all of its various outlet, bullying no longer stops at the end of the school day unfortunately. </p>\n\n\n\n\n\n\n\n<p> <strong>When children are singled out because of a shared characteristic — such as race, sexual orientation, or religion — or a perceived shared characteristic, the issue not only affects that individual but the entire community.</strong> </p>\n\n\n\n\n\n\n\n<p> People can now be victimized 24 hours a day through text messaging, leaving comments on someone's wall on their Facebook page, or even making videos about them on YouTube and other social media outlets. </p>\n\n\n\n\n\n\n\n<p>MOST PARENTS HAVE NO IDEA THAT THEIR CHILD IS BEING BULLIED !!! LEARN TO PROTECT THE ONES THAT NEED YOUR PROTECTION THE MOST ... YOUR CHILD</p>\n\n\n\n\n\n\n\n<p> This of course increases the psychological pressure and stress, as well as fear causing individuals to believe that their bullies and/or tormentors are never going to stop. They also grow the anxiety that things will never get better - which in some instances can lead to very tragic consequences. </p>\n\n\n\n\n\n\n\n<p> <strong>As with all my courses:</strong> </p>\n\n\n\n\n\n\n\n<ul> <li>the initial low price will increase shortly - the course is currently $45, but will next increase to $497</li> <li>you have unlimited lifetime access at no extra costs, ever</li> <li>all future additional lectures, bonuses, etc in this course are always free</li> <li>there's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li> <li>my help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li> </ul>\n\n\n\n\n\n\n\n<p> Bullying, particularly that of the cyber variety has become a virtual epidemic affecting children (and adults) around the world. </p>\n\n\n\n\n\n\n\n<p> This is where the \"Anti Bully\" comes in. This course will give you the tools and strategies for dealing with bullies whether the bullying takes a physical form, a psychological form, or a cyber form. </p>\n\n\n\n\n\n\n\n<p> By the end of this course, you will be able to help your children or yourself to deal with their bullying problems and provide them with the preventative techniques against future bullies.<strong>Parents, school staff, and other caring adults have a role to play in preventing bullying, protect the children you care about the most by enrolling in this course today.</strong> </p>\n\n\n\n\n\n\n\n<p><strong>BONUS: </strong>Get a free PDF copy of my Best Selling The Bully Vaccine Book.</p>\n\n\n\n\n\n\n\n<p> Don't forget to check out the free preview lectures to sample my course. Are you ready to learn? </p>\n\n\n\n\n\n\n\n<p> Click the \"Take This Course\" button, on the top right because every hour you delay is costing you and your child piece of mind. Scroll up and Enroll Now!</p>\n\n\n\n\n\n\n\n<p> P.S. I should also point out that it would cost you hundreds or even thousands of dollars to get these strategies through coaching. The current price was set so low to make it a total <strong>no-brainer for you</strong>. I am passionate about making these advanced Bully management strategies affordable to absolutely everyone who can benefit from them. </p>", 
    "end_date": null, 
    "title": "Anti Bullying Training Course & Bullying Prevention Training", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267458_444e_2.jpg", 
    "course_url": "https://www.udemy.com/dealing-with-bullies/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T17:18:02Z"
}