{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>THE WAIT IS FINALLY OVER!</strong></p><p><strong><em>For the first time in history, one of Mestre Sylvio Behring’s awarded professors has created his own interpretation to the Progressive System for the world to see! </em></strong></p><p>Brazilian Jiu-Jitsu is a martial art that teaches the smaller, weaker individual to defend themselves against larger, stronger opponents. Through the teaching methodology of the Progressive System you will build a strong foundation for the principles and techniques of  Brazilian Jiu-Jitsu. </p><p>The BJJ Progressive System was developed and created by Mestre Sylvio Behring. Mestre Behring created the progressive system as a teaching tool to help develop the foundations of Brazilian Jiu-Jitsu and Self-defence for the beginner to the most advanced. The Progressive System is a world-wide awakening to this one of a kind teaching methodology.  </p><p>Two of the greatest minds in Brazilian Jiu-Jitsu today, both Mestre Sylvio Behring and Professor Shah Franco have passed their knowledge onto one of their top students and teachers, Professor Jesse Richardson.  </p><p>Professor Jesse Richardson, co-founder of Matador Brazilian Jiu-Jitsu has now taken this invaluable knowledge of the Progressive System and has evolved it once again to a new level of understanding and teaching methodology.  </p><p>This teaching methodology of Brazilian Jiu-Jitsu can be used with the traditional gi, no-gi or with normal street clothes. Featured in this course are basic modifications and variations that you can apply to almost every situation in self defense or sport Brazilian Jiu-Jitsu.</p>", 
    "end_date": null, 
    "title": "Brazilian Jiu-Jitsu for Self Defense - Beginners & Advanced", 
    "price": "50.00", 
    "instructors": "BJJ World Champion , Jesse Richardson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750500_3056.jpg", 
    "course_url": "https://www.udemy.com/brazilian-jiu-jitsu-for-self-defense/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T21:00:29Z"
}