{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Have you ever been so scared of your money, your car or your family?<br></p>  <p>No, No, No! Don’t take me wrong! I mean not being afraid of these! but being scared by those threatening your money, car and your family.</p>  <p>Yes, those street robbers and wanderers. </p>  <p>Perhaps, you have experienced or heard about.</p>  <p>But of course a part of this fear in nature is made by these criminals.</p>  <p>That fear is due to lack of self-confidence. </p>  <p>When you think of facing somebody attacking by knife to get your money and you can do nothing about it. You are terrified and even in quarrels you cannot preserve your rights.</p>  <p>Since in most street fights, people are attacked by knives and they are not equipped with any weapons, it is necessary to know how to defend against the most common cold weapon or the knife which is really vital.</p>  <p>In this course you are trained how to defend against knife attacks, off-handed.</p>  <p>The lessons are presented in a way which are really easy to learn without any complexity. Talking about complex technique is avoided so that they are easy to perform in reality. Most of all, we are not going to waste your time by bullshit. However remember that in order to perform these techniques properly in real situations, they have to be practiced at home, as people say, practice makes perfect!</p>  <p>As a result, you are going to know these techniques by heart and if you are attacked, your body reacts automatically and properly.</p>  <p>So never be afraid of anything, and try to do daily routine peacefully.</p>  <p>In this course we begin with introducing several kinds of knives and you are shown to one of the most dangerous kind of knives. In the following sections you can learn one single technique in every lesson which lifts up your ability to defend yourself in different situations, both when the attacker is going to injure you and when you are taken as a hostage or you are forced to do something. You have to watch every sequence several times and afterwards act out each technique step by step. After knowing the technique by heart, exercise it with an unreal opponent.</p>  <p>Remember that never practice with a real knife at home!</p>  <p>The most attractive part of this course is played in several videos outdoors, Where a criminal holding a knife attacks the trainee in this course. As you will see, by acting out the technique learnt in this course he can defeat the attacker. For this training course you don’t need any special devices or clothes. It is just you and us as well as learning how to defend against knife attack.</p>  <p>Once more I repeat that I hope you are never forced to act out these techniques!</p>  <p>However by learning these, you are able to protect your life, properties and your family and live happily ever after.</p>  <p>Enjoy being secured….</p>", 
    "end_date": null, 
    "title": "Defending Against The Knife Attacks And Taken As A Hostage!", 
    "price": "35.00", 
    "instructors": "Hamid Kamali", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700294_f364.jpg", 
    "course_url": "https://www.udemy.com/defending-against-the-knife-attacks-self-defense/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T21:47:32Z"
}