{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Ancient Fighting Secrets Used By Roman Gladiators And Japanese Samurai Lets You Break, Smash And Even KILL Anyone Who Dares Lay A Hand On You...</strong>  </p>  <p>  \t<strong style=\"\">This may be the most hard-core self defense news you have ever heard.  In this course I&#039;m going to show you a new (although it is over 2,000 years old), and different way to have almost &quot;super hero&quot; like abilities in a fight... break another man&#039;s neck with ease... and cause him such unbearable agony he may even black out from the shock...</strong>  </p>  <p>  \t<br style=\"\">  \t       If you would like to know a secret way to make yourself near-invincible in a fight... then here&#039;s how ancient gladiators, Samurai and other deadly warriors in history did it.<br style=\"\">  \t<br style=\"\">  \t       And why you can do the same thing today... with the information in this letter.<br style=\"\">  \t<br style=\"\">  \t       Here&#039;s the story:<br style=\"\">  \t<br style=\"\">  \t       As you know, a couple thousand years ago in the ancient Roman coliseums, people were often tossed to lions -- literally ripped to shreds and eaten in front of hundreds of spectators sadistically cheering it on. It was one of the most gruesome acts of violence ever seen.  And even today, people are shocked at the sheer horror of it.<br style=\"\">  \t<br style=\"\">  \t       But guess what?<br style=\"\">  \t<br style=\"\">  \t       Not everyone who was tossed in the arenas became &quot;lion chow.&quot;  A few (very few) people survived these vicious attacks... and, believe it or not...  </p>  <p>  \t<strong style=\"\">Even KILLED These </strong>  </p>  <p>  \t<strong style=\"\">Blood-Thirsty Lions </strong>  </p>  <p>  \t<strong style=\"\">Barehanded!</strong>  </p>  <p>  \t      How did they do it?  </p>  <p>  \t      By using a special hand-to-hand fighting &quot;trick&quot; that gave them what seemed like super powers.  In fact, some people even say the stories about Hercules and other Roman demi-gods could have been based on these acts of raw fighting barbarism.  </p>  <p>  \t      But these gladiators weren&#039;t the only people to use this fighting secret.  </p>  <p>  \t      &quot;Fast forward&quot; hundreds of years later, and the Japanese Samurai used this same tactic in war, too.  It was their &quot;trump card&quot; for when they were caught unarmed or if their weapons broke on the battlefield.  And they would use this secret to tear apart other trained warriors -- literally popping the tendons in their necks and limbs... tossing them through the air onto their skulls... and causing them unbearable, gut-wrenching pain just by grabbing them.  </p>  <p>  \t      In fact, some of the soldiers in the west were scared to death of fighting Samurai warriors due to the stories of their unbelievably brutal combat tactics.  </p>  <p>  \t      And guess what?  </p>  <p>  \t      Even though almost nobody truly understands this fighting secret today, if you look through history, you will see...  </p>  <p>  \t<strong style=\"\">It Was Used By Almost ALL </strong>  </p>  <p>  \t<strong style=\"\">The Most Violent (And Feared) Warriors </strong>  </p>  <p>  \t<strong style=\"\">Who Walked The Earth!</strong>  </p>  <p>  \t      Like, for example...  </p>  <p>  \t      The soldiers of ancient India... the blood-lusting Spartans... and, today, certain members of our most elite Special Forces.  </p>  <p>  \t      Hell, even some of our kids are using this strange way of fighting now.  </p>  <p>  \t      Last year, for example, a 9-year-old child used a variation of this secret to immobilize a savage, frothing-at-the-mouth pit bull that attacked his friend.  </p>  <p>  \t      Anyway, what is this deadly -- near &quot;magical&quot; -- way of fighting?  </p>  <p>  \t      This &quot;miracle&quot; combat secret that let normal humans kill 400 pound blood-thirsty lions... sent shockwaves of fear through medieval Europe... and that our own military now spends a fortune training our most elite soldiers?  </p>  <p>  \t      It&#039;s called &quot;Guerrilla Grappling.&quot;  </p>  <p>  \t      And while I&#039;m not saying you should go out and start wrestling lions and attacking Samurai with it... it CAN make you extremely dangerous in a fight.  </p>  <p>  \t      Frankly, when you understand how REAL grappling (NOT the crap on TV, or in martial arts schools today) is done... then with just one movement, grab or throw, you can horribly mangle anyone who dares touch you.  </p>  <p>  \t      Squeeze the life out of someone with one hand.  </p>  <p>  \t      And literally toss bigger and stronger men on their faces so hard...  </p>  <p>  \t<strong style=\"\">The Coroner Will Think </strong>  </p>  <p>  \t<strong style=\"\">They Jumped Off </strong>  </p>  <p>  \t<strong style=\"\">A 10 Story Building. </strong>  </p>  <p>  \t      It&#039;s just the most brutal thing you ever saw.  </p>  <p>  \t      I&#039;ve seen big, gnarly looking guys reduced to tears and high-pitched screaming after having just one or two of these secret moves applied to them.  And it gives even normal sized people what seems like &quot;super powers&quot; in a fight.  </p>  <p>  \t      Anyway, would you like to learn this hard-core way of fighting?  </p>  <p>  \t      And would you like to do it without having to leave your home... or even having to pay for it?  </p>  <p>  \t      Then check this out:  </p>  <p>  \t      I&#039;ve spent most of my life studying old school, &quot;battle-tested&quot; grappling techniques.  The kind that let you literally (with just one grab or touch)...  </p>  <p>  \t<strong style=\"\">Turn Bigger And Tougher </strong>  </p>  <p>  \t<strong style=\"\">Men Into Quivering </strong>  </p>  <p>  \t<strong style=\"\">Masses Of Pain!</strong>  </p>  <p>  \t      This is just nasty, nasty stuff, my friend.  </p>  <p>  \t      I learned these secrets as a former Special Forces instructor working with the world&#039;s top fighting geniuses, and while winning my Gold Medal in Grappling.  Then, later, I picked up the REALLY wicked stuff while trekking through Asia studying at the feet of the last remaining Japanese Samurai.  </p>  <p>  \t      And guess what?  </p>  <p>  \t      A few years back, I taught ALL these little-known grappling secrets I&#039;ve learned to a closed-door group of Military Special Ops soldiers and recorded it to video.  </p>  <p>  \t      I call it:  </p>  <p>  \t<strong style=\"\">&quot;Guerrilla Grappling&quot;</strong>  </p>  <p>  \t      This is the most elite grappling training for the &quot;average Joe&quot; ever invented.  </p>  <p>  \t      You cannot learn these &quot;classified&quot; moves at any storefront martial arts school.  In fact, only a handful of people on the planet even know about them.  </p>  <p>  \t      And it&#039;s perfect for guys who want to be able to learn combat-level grappling in a &quot;shortcut&quot; way -- without having to attend any schools, bow to some &quot;master&quot; or screw around practicing for hours, meditating or following any silly rules.  </p>  <p>  \t      Anyway, here&#039;s the bottom line:  </p>  <p>  \t      Guerilla Grappling is 24 solid lectures on the sneakiest (and simplest) ways to put someone in complete agony you&#039;ll ever see.  </p>  <p>  \t      These are the exact same moves used by today&#039;s Olympic grappling champions, world class judo &amp; Brazilian black belts and Special Forces soldiers... as well as the ancient &quot;lion-killing&quot; gladiators... bad-ass Samurai... and battle-obsessed Spartans -- some of who were so dangerous...  </p>  <p>  \t<strong style=\"\">Their Enemies </strong>  </p>  <p>  \t<strong style=\"\">Thought They Were </strong>  </p>  <p>  \t<strong style=\"\">Supernaturally Possessed!</strong>  </p>  <p>  \t      But they weren&#039;t possessed.  </p>  <p>  \t      They simply knew these kinds of &quot;dirty&quot; grappling and fighting tricks.  </p>  <p>  \t      Tricks I have personally taught to cops, soldiers, security pros, even trained mercenaries who cheerfully pay a fortune to learn them.  </p>  <p>  \t      And here&#039;s the best part:  </p>  <p>  \t      Instead of taking years and decades to learn these devastating grappling secrets... or having to roll around on a mat each week with a bunch of hyper teenagers out to prove how tough they are... you can...  </p>  <p>  \t<strong style=\"\">Learn These Moves </strong>  </p>  <p>  \t<strong style=\"\">In Just A Few Short Hours --</strong>  </p>  <p>  \t<strong style=\"\">And Without Even Leaving Home!</strong>  </p>  <p>  \t      You don&#039;t even need to be in good shape, either.  </p>  <p>  \t      Believe it or not, many of the people I learned these moves from were completely OUT of shape and slow.  </p>  <p>  \t<strong style=\"\"> But they were incredibly devious.</strong>  </p>  <p>  \t      And they only used (and taught) these dirty tricks that let you put even the most violent attacker in a world of pain -- breaking his bones, ripping his tendons and throwing him around like a rag doll.  </p>  <p>  \t      That&#039;s why some of the world&#039;s most dangerous men beg me to teach them this.  </p>  <p>  \t      Because it cuts right through the &quot;fluff&quot;.  </p>  <p>  \t      And only shows you the raw, hard core moves that have been....  </p>  <p>  \t<strong style=\"\">Proven To Work </strong>  </p>  <p>  \t<strong style=\"\">In </strong><strong style=\"\">Real</strong><strong style=\"\"> Fights And </strong><strong style=\"\">Real</strong><strong style=\"\"> Battles </strong>  </p>  <p>  \t<strong style=\"\">For Thousands Of Years!</strong>  </p>  <p>  \t    It&#039;s a statistical fact 90% of ALL fights end up on the ground.  </p>  <p>  \t    Unfortunately, the ground is where almost everyone is most vulnerable.  </p>  <p>  \t    Even some of the most experienced fighters I know get their asses handed to them in parking lots and on sticky bar floors because they don&#039;t even know basic grappling (much less the dirty tricks I will teach you), while their attackers do.  </p>  <p>  \t    And here&#039;s another statistic for you:  </p>  <p>  \t    Today&#039;s new crop of violent young criminals, muggers and gang-bangers are learning how to grapple.  It&#039;s &quot;cool&quot; for them to learn since it&#039;s on TV -- like on the Ultimate Fighting Championship shows.  </p>  <p>  \t    And some of these bastards are now dropping trained boxers, martial artists and even armed police officers.  Not because these street punks are tougher than the trained professionals.  But because even the &quot;pros&quot; are out of their element on the ground.  </p>  <p>  \t    But you&#039;ll never have to worry about that.  </p>  <p>  \t    The secret moves in Guerilla Grappling have been used for thousands of years by the toughest men who have ever lived.  And this newer generation of thugs watching UFC have no clue how to defend against it.  </p>  <p>  \t    Give it a try now…  </p>", 
    "end_date": null, 
    "title": "Elite Close Combat Training: Guerrilla Grappling", 
    "price": "50.00", 
    "instructors": "Captain Chris Pizzo", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310084_efbb_3.jpg", 
    "course_url": "https://www.udemy.com/guerrilla-grappling/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-29T15:34:34Z"
}