{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">&quot;How To Disarm, Disfigure And Even Violently Dismember Anyone Stupid Enough To Attack You Or Your Family With A Bat, Blade Or Gun!&quot;</strong>  </p>  <p>  \tLet me ask you something…  </p>  <p>  \tWould you take fighting advice from a criminal scum bag?  </p>  <p>  \tSounds like a silly question, doesn&#039;t it?  </p>  <p>  \tWell, don&#039;t make up your mind too quickly. Because I&#039;ve got a story to tell you that sounds like something right out of a Hollywood &quot;gangsta&quot; flick!  </p>  <p>  \tCheck this out:  </p>  <p>  \tRecently, while training with some cop buddies, I heard about an ex-con named Pancho who was in a vicious L.A. gang full of criminal scumbags who attack, torture and even kill innocent people just for &quot;kicks.&quot; And what happened was, Pancho was arrested by the police and then &quot;turned&quot; into an informant in exchange for not being tossed in prison.  </p>  <p>  \tAnyway, long story short, soon after the cops turned Pancho...  </p>  <p>  \t<strong style=\"\">He Was Caught By The Gang With A &quot;Wire&quot; On Him!</strong>  </p>  <p>  \tThey somehow found out what he was up to.  </p>  <p>  \tAnd they told him in great detail all the sick, perverted things they were going to do not only to him -- but also his girl friend and his 2 young daughters.  </p>  <p>  \tPancho bolted for a nearby exit.  </p>  <p>  \tBut before he could escape, he was surrounded by over a dozen bloodthirsty gang-bangers armed to the teeth with knives, bats and guns!  </p>  <p>  \tWhat did Pancho do?  </p>  <p>  \tWell, luckily for him, while he was a short, pudgy man (and not much of a hand-to-hand fighter) -- he was a wizard when it came to weapons disarmament. In fact, within 30 seconds, he had not only taken down half the gang bangers who attacked him... but...  </p>  <p>  \t<strong style=\"\">He Escaped Without A Scratch!</strong>  </p>  <p>  \tHell... if anything, Pancho committed all the actual violence.  </p>  <p>  \tIncluding leaving some of those gang members permanently crippled, scarred and even dead -- stuck with their own blades, shot with their own guns or beaten with their own bats, crowbars and chains.  </p>  <p>  \tIt was the most incredible thing I ever heard.  </p>  <p>  \tAnd you know what?  </p>  <p>  \tPancho&#039;s story got me to thinking about you.  </p>  <p>  \tWhat would YOU do if you were attacked on the street by a violent criminal (or gang of violent criminals) armed with a bat, knife or gun? Someone who did not just want your money or your watch or your car -- but just enjoys the sick pleasure of causing people pain?  </p>  <p>  \tWhat if your wife and kids were with you?  </p>  <p>  \t<strong style=\"\">What Would YOU Do?</strong>  </p>  <p>  \tIf you don&#039;t know, then you&#039;re simply NOT prepared.  </p>  <p>  \tEspecially since most street attacks are not by unarmed men.  </p>  <p>  \tThey are almost always done by someone ARMED, dangerous and, sometimes, so &quot;mentally unbalanced&quot;, they will...  </p>  <p>  \t<strong style=\"\">Shoot, Stab Or Kill You If You Even So Much As Twitch The Wrong Way!</strong>  </p>  <p>  \tBut here&#039;s the good news:  </p>  <p>  \tRecently, I taught a seminar revealing ALL the tricks I&#039;ve learned about disarming criminals (and putting THEM in a world of hurt) and recorded it to video.  </p>  <p>  \t<strong style=\"\">I call it: Bullets, Bats, &amp; Blades.</strong>  </p>  <p>  \tThis series includes everything from the filthy &quot;street-smart&quot; weapon disarmament tactics I learned from being in real street fights myself... to the sneaky stuff used by SWAT and inner city cops...  </p>  <p>  \tDown to the REALLY brutal techniques I teach my FBI, Secret Service, and Special Forces students who sometimes end up in situations ten times WORSE than what even Pancho was in. (Imagine being surrounded by pissed off terrorists with loaded machine guns, machetes, and 2x4&#039;s. Not fun.)  </p>  <p>  \tHere&#039;s just a taste of what you&#039;ll learn when watching these videos…  </p>  <ul style=\"\">  \t<li>The right (and wrong) way to use your car keys to cause irreparable damage to another man&#039;s body. (Like, for example, permanently disfiguring his face or popping one of his eyeballs like a grape.)</li>  \t<li>How to use your body&#039;s natural armor to &quot;stab proof&quot; yourself. (I doubt if even one in a 1,000 self defense experts on the planet knows how to use this part of the human anatomy.)</li>  \t<li>What to do if you&#039;re taken hostage with a hand on your throat and a gun to your temple. (You can either be a sniveling, crying victim... or do THIS and make the bastard wish he&#039;d never even laid eyes on you.)</li>  \t<li>How to (with one simple movement) temporarily &quot;paralyze&quot; someone who brandishes a weapon on you. (Some criminals have been known to literally shit their pants when you do this!)</li>  \t<li>A scientifically proven way to increase your odds of surviving a gun attack by 96%. (Cops, soldiers and other trained professionals have known about this for years, yet most civilians have never heard of it.)</li>  \t<li>How to stop a sudden &quot;adrenaline dump&quot; from freezing you up when attacked with a gun, knife or other dangerous weapon.</li>  \t<li>3 &quot;psycho babble&quot; words that practically force armed attackers to back off as soon as the words escape your lips. (Don&#039;t ask me why this works so well on criminals, it just does. If you, your wife or your kids are ever caught in a violent situation, these 3 words could save your lives!)</li>  \t<li>A secret way to &quot;violence-proof&quot; your family if attacked at knife or gunpoint.</li>  \t<li>A little-known way of deflecting knife attacks (invented centuries ago by ancient gladiators in coliseum death matches) that, even if you do get cut, it won&#039;t hurt or slow you down.</li>  \t<li>The most dangerous part of a club or bat. (Hit someone with this &quot;sweet spot&quot; in the head and there&#039;s a good chance they won&#039;t be able to feed or dress themselves again without help, much less keep attacking you.)</li>  \t<li>The &quot;ballerina&quot; secret that lets you crush the skeletal structure of someone&#039;s face if they put a knife to your back.</li>  \t<li>The &quot;slap and grab&quot; gun-clearing tactic that&#039;s perfect for when all hell breaks loose and you have no other options. (This vicious move lets you break his arm or cut off his ability to breathe. And the best part is, it works even if you do it wrong!)</li>  \t<li>What to do if someone holds a gun to your wife or child. (Every single husband, boyfriend and father on the face of the planet should know this!)</li>  \t<li>How to put a world of hurt on anyone who tries to brain you &quot;Babe Ruth&quot; style with a club or bat. (Keeps you safe AND even puts you in a position to smash his face, head, balls or kneecap -- it&#039;s your choice.)</li>  \t<li>The exact best time to attack a man lunging at you with a baseball bat, crowbar or other blunt weapon. (Just wait for him to do this, and he&#039;ll be like putty in your hands so you can physically punish him or escape.)</li>  \t<li>How to make yourself immediately threatening to ANYONE who wants to fight you. (I don&#039;t care how big, tough or strung out on drugs he is, either. Do this and he&#039;s almost guaranteed to piss his pants and run away.)</li>  \t<li>The almost unbelievably brutal &quot;shake and bake&quot; stabbing motion used by soldiers, assassins and other professional killers.</li>  \t<li>A special way to block a bat or club attack without feeling any pain. (And then finish him off with one of these two &quot;can&#039;t miss&quot; face smashes.)</li>  \t<li>3 &quot;fool proof&quot; ways to wield a knife, club or other weapon like a seasoned pro. (You&#039;ll become truly dangerous with anything you get your hands on -- a knife, wrench, broken bottle or even a rolled up magazine!)</li>  \t<li>How to &quot;turn the tables&quot; on someone who surprises you with sticking a gun to your back... and get the drop on him instead!</li>  \t<li>How to quickly disarm an attacker who points a gun at your chest.</li>  \t<li>The secret criminal-friendly &quot;loop hole&quot; in the justice system that will...</li>  </ul>  <p>  \tGet YOU Put In Jail Just For Defending Yourself Against An Armed Attacker!  </p>  <p>  \tThis makes every red-blooded man I know furious.  </p>  <p>  \tAnd is just one (of many) idiotic left wing laws that can get you in more trouble than the ruthless killer attacking you.  </p>  <p>  \t<strong style=\"\">Luckily, you won&#039;t have to worry about this.</strong>  </p>  <p>  \tBecause these lessons show you exactly how to keep yourself out of legal &quot;hot water&quot;, while still physically dominating anyone stupid enough to attack you or your family with a weapon.  </p>  <p>  \t<strong style=\"\">Okay, so here&#039;s the deal:</strong>  </p>  <p>  \tThe people I normally teach this insider info to (i.e. private security firms, secret service agents, the military, etc) pay a fortune to learn these moves.  </p>  <p>  \tI&#039;m only giving this hard core instruction away this inexpensively because crime is skyrocketing everywhere in Comrade Obama&#039;s new America.  </p>  <p>  \tI mean let&#039;s face it, people are getting desperate on the streets.  </p>  <p>  \tAnd most violent criminals simply don&#039;t play &quot;nice&quot;, don&#039;t play fair, and sure has hell don&#039;t have a problem using anything they can get their hands on to attack you, your wife or your kids to get what they want.  </p>  <p>  \t<strong style=\"\">In some ways, this is the single most important product I&#039;ve ever created.</strong>  </p>  <p>  \tBut if you want these videos dirt cheap like this, you must act now before it&#039;s too late.  </p>  <p>  \tGive it a try and see what you think!  </p>", 
    "end_date": null, 
    "title": "Elite Close Combat Training: Bullets, Bats & Blades", 
    "price": "50.00", 
    "instructors": "Captain Chris Pizzo", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312464_67b3_2.jpg", 
    "course_url": "https://www.udemy.com/bullets-bats-blades/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T20:59:25Z"
}