{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tWARNING: <em style=\"\">Explicitly </em><em style=\"\">DANGEROUS</em><em style=\"\"> content!</em>  </p>  <p>  \t*   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *   *  </p>  <p>  \t<em style=\"\"><strong style=\"\">9-11-2001</strong></em>  </p>  <p>  \t<em style=\"\">If you’d been on one of those planes, a</em><em style=\"\">nd your knew the highest-level </em><em style=\"\">knife-fight-to-the-death secrets </em><em style=\"\">that I’m about to show you...</em>  </p>  <p>  \t<em style=\"\">You could have changed the course of American history</em><em style=\"\">.</em>  </p>  <p>  \t<em style=\"\">You would be a true American hero.</em>  </p>  <p>  \t<em style=\"\">Schoolchildren would all know your name.</em>  </p>  <p>  \t<em style=\"\">There would be photos of you receiving a medal </em><em style=\"\">from the President of the United States, they’d have made movies </em><em style=\"\">about you, and your autobiography would have sold millions of copies.</em>  </p>  <p>  \tIt’s too late to change 9/11 now, of course, but the chilling reality is that day and night, those bastards <em style=\"\">are</em> planning the next one.  And you CAN intervene this time -- if you know how to kill (rather than be killed), and if you’re willing to make a disgustingly bloody mess of some filthy scum terrorist who’s damn stupid enough to try pulling his crap on your watch.  </p>  <p>  \t<em style=\"\">But you need to be advised:  </em><em style=\"\">“SMASH, STICK, &amp; STAB”</em><em style=\"\"> is my one training course that crosses the line</em><em style=\"\"> from Close Combat Self-DEFENSE . . . to Self-Preservation, to Offense, not just disarming or disabling but </em><em style=\"\">actually killing a terrorist</em><em style=\"\">, or an enemy combatant, or a shooter in a movie theater or an office or a mall . . . when </em><em style=\"\">he’s armed to the teeth</em><em style=\"\">.</em>  </p>  <p>  \t<em style=\"\">If you can’t do that -- for whatever personal reasons -- </em><em style=\"\">I understand</em><em style=\"\">, bro.  And there’s no shame in that; I’m not here to judge you.  But if that’s where you are, I </em><em style=\"\">would</em><em style=\"\"> recommend you just </em><em style=\"\">click away from this page right now, because you might end up PUKING if you keep reading what I’m about to reveal . . . </em>  </p>  <p>  \tFrom: Capt. Chris Pizzo<br style=\"\">  \tWorld’s Leading Close Combat Instructor<br style=\"\">  \tFor The US &amp; UK Special Forces  </p>  <p>  \tDear Close Combat Warrior,  </p>  <p>  \t      I imagine you already know that I don’t scare easily.  </p>  <p>  \t      But I have to admit --  </p>  <p>  \t<em style=\"\">My SMASH, STICK, &amp; STAB training course </em><em style=\"\">scares the HELL out of me</em><em style=\"\">!</em>  </p>  <p>  \t      It scares me because of what might happen if it falls into the wrong hands . . . because it truly demonstrates how you can kill another human being with a knife, a club, or, in some cases, your bare hands.  </p>  <p>  \t      Granted, the whole point is to show GOOD GUYS how to neutralize BAD GUYS who are trying to murder you, your family, your friends, your co-workers, or innocent children . . .  </p>  <p>  \t      . . . but there’s always that chance, however remote, that some scumbag with terrorist ties may get his filth-covered fingers on some of these highest-level, Navy SEAL-style training secrets.  </p>  <p>  \t      So before you read on, I’m going to ask you to agree with me on 4 things:  </p>  <p>  \t1. You’re a &quot;Good Guy&quot; who loves life and freedom, and you pledge to ONLY use these tools when threatened by a terrorist (foreign or domestic) in a kill-or-be-killed situation -- not a normal street fight or common bar brawl with some stupid drunk or low-level crook.  </p>  <p>  \t2. You will NOT share these secrets with ANYONE -- not your wife or girlfriends, not the guys at the gym or the dojo, not your buddies down at the bar, and especially NOT YOUR CHILDREN or ANYONE until they&#039;re over 18.  </p>  <p>  \t3. You understand that these techniques may be used ONLY in extreme situations of violence, involving an assailant armed with weapon(s), where there is NO OTHER OPTION besides kill-or-be-killed, and that these methods are NOT to be used merely as self-defense, when merely subduing or disabling the attacker will suffice  </p>  <p>  \t4. Based on your personal belief system -- morals, faith, personal psychological profile, and frankly whether you’ve got the stomach for it or not -- you must be willing to kill another human being (if we can call the damn desert dogs that), when that scumbag is right in front of you, looking into your eyes  </p>  <p>  \t      So . . .  </p>  <p>  \t      Are we on the same page, soldier?  You see that literally, this information is equivalent to a LOADED GUN, and should be treated with the same level of care, reverence, and respect?  </p>  <p>  \t      Good.  Let’s proceed then.  </p>  <p>  \t      Up until now, your Close Combat Training has ALL been Self-DEFENSE oriented.  But <em style=\"\">SMASH, STICK, &amp; STAB</em> is the ONLY one we’ll ever do that turns the tables and becomes OFFENSE -- self-preservation.  It is the ONLY training we will EVER offer that actually shows you how to kill someone.  And, frankly, it has caused a lot of arguing and introspection inside our company:  <em style=\"\">Should we even offer this at all, ever?</em>  </p>  <p>  \t      But think back to that movie theater in Colorado -- dozens maimed or murdered, including a pregnant mother, permanently disabled, lying in a hospital, her unborn child dead, finding out her 6-year-old little girl died too -- that’s the kind of scenario that confirms for us that IF ONE PERSON LIKE YOU were there, trained in these techniques, we’d sure as hell like you to become the next national hero, rather than seeing that poor lady (and her surviving family) becoming the next VICTIM.  </p>  <p>  \t      And that’s just domestic terror, of course.  Over in Afghanistan and Iraq (and, chillingly, in Detroit and New York and other cities right here in the USA) . . . fanatical extremists are fantasizing about the next 9/11 they can try to cook up.  Shoe bombs, underwear bombs, printer-cartridge bombs -- whatever they can add to their box-cutter arsenal, they’re working it.  Day and night, they’re working it.  </p>  <p>  \t      And maybe, just maybe, next time they sneak about a plane or into a crowded public place on American soil . . .  </p>  <p>  \t<em style=\"\">      . . . Maybe you’ll happen to be there.</em>  </p>  <p>  \t      And if you know these secrets, I tell you what:  <strong style=\"\">You’ll </strong><strong style=\"\">save </strong><strong style=\"\">lives</strong><strong style=\"\">.</strong>  Maybe just one, maybe dozens, maybe a few hundred, maybe even thousands.  You’ll change history, you’ll enjoy the satisfaction of knowing you whipped some very, very evil people, and you’ll be a great American HERO.  </p>  <p>  \t      So here’s as much as I can share with you here . . . about what’s on this truly-unique, truly-DANGEROUS set of dynamite videos:  </p>  <p>  \t<em style=\"\">No rules in a knife fight -- just </em><em style=\"\">nasty, violent, ugly, </em><em style=\"\">horrifying</em><em style=\"\"> split-seconds</em>  </p>  <p>  \t      Well, there is one rule:  You better take him out . . . before he takes you out.  While <em style=\"\">SMASH, STICK, &amp; STAB</em> builds on the foundation you have from your Close Combat Training, it definitely takes things to higher levels.  I’ll show you secrets culled from the world’s deadliest warriors:  </p>  <p>  \t* <em style=\"\">SMASH</em> the freedom-hater’s skull like a Mack truck . . . with the impact weapon of your choice: fist-loads, brass knucks, a blackjack, a sap, or a simple solid club  </p>  <p>  \t* How to leave the other guy with THE SHORT END OF THE <em style=\"\">STICK</em> -- literally -- by shattering his ribs and driving his splintered sternum directly into whatever heart he may actually have  </p>  <p>  \t* <em style=\"\">STAB</em> his brain by avoiding that thick skull of his -- gouge directly through an eye socket with a vicious, targeted knife thrust  </p>  <p>  \t      Okay, I need to pause to let a few of you leave the site and locate your barf bag; like I said, if you ain’t got the stomach for this . . . you may as well just go watch a ballgame instead.  I only need men who are willing to be surgical about this, okay?  It IS about life and death, it IS about defending our freedoms, it IS about ripping another person’s body wide open -- without anesthesia.  And not everybody’s cut out for that.  </p>  <p>  \tStill with me?  Here’s more of what you’ll learn:  </p>  <p>  \t* Back to the Stick:  Use it like a lead pipe to <em style=\"\">shatter</em> the madman’s skull into fragments  </p>  <p>  \t* A dozen different ways to <em style=\"\">choke</em> the life out of the lunatic attacker  </p>  <p>  \t* Use pretty much every type of knife to gut him like a fish -- before he kills you  </p>  <p>  \tHey, look, none of <em style=\"\">us</em> are psychopaths who dream about doing this kind of dirtywork.  But <em style=\"\">they do</em> -- which is exactly why YOU need to know how to . . .  </p>  <p>  \t* Crush his windpipe with a Stick  </p>  <p>  \t* Master different types of chains -- common-link and weighted-end, among others -- both by applying pressure, and using whip force, with precision methods (like the fabled Garroted Choke)  </p>  <p>  \t* Learn the key differences to apply when utilizing either a Frontal Offense Approach . . . or the Rear Offense Approach  </p>  <p>  \t* Master the use of a blunt weapon as simple as the Stick: Two-Handed Bar usage and Grab Releases, with multiple Choke choices (Front Cross,    Front Guillotine, Rear Cross, Rear Jap Strangle/Kill, &amp; Rear Takedown)  </p>  <p>  \t* Dip your Stick down below for a ball-blasting Groin Come-Along, or the painfully bone-splintering Shin Shatter  </p>  <p>  \tA great deal of the coursework involves the Knife.  You’ll be able to filet any enemy with your superior Ginsu-handling skills:  </p>  <p>  \t* Why you ALWAYS Stab, rather than Slash -- with one exception (the Whip Cut, to your choice of the hands, arms, or face), and why that’s SO important  </p>  <p>  \t* Special training on being the victim of a SURPRISE Knife attack  </p>  <p>  \t* Become an expert in Grips, Free Hand Parries, Thrusts (such as the Turned-Hand Lunge and exotic In-Quartata and Passato Soto Moves), plus Knife-on-Knife, Knife-on-Stick, and Knife-on-Gun struggles  </p>  <p>  \t* You’ll learn the crucial SITUATIONAL decisions you may be forced to make:  </p>  <p>  \t   When to use Frontal Kills, Head Kills, Throat Kills, Chest Kills, Stomach Kills, and Groin Kills . . . followed by the most appropriate methods of Sentry Removal  </p>  <p>  \t* Discover what Death Wish Combat means -- and how it can save your skin  </p>  <p>  \t* And take the fear out of situations when you’re UNARMED . . . but he’s not . . . and how to put him away via the base of the skull, throat, clavicle, <em style=\"\">back</em> of his chest, or kidney  </p>  <p>  \tRepulsed . . . yet ready?  </p>  <p>  \tI hope so -- on both counts.  Because honestly, if you aren’t at least a LITTLE repulsed at this, I’d be worried about you.  Heartless is for the terrorists, doing-what-you-gotta-do is for the good guys.  </p>  <p>  \tAnd I have priced this course high -- for two reasons.  First, value:  This is world-class material, not available anywhere else.  Second, since this course is as potent as a loaded gun, it needs to be priced in that range.  </p>  <p>  \tIf this sounds like something you&#039;ve been searching for, GREAT!  </p>  <p>  \tGive it a try as you&#039;re always protected by Udemy&#039;s No-QUIBBLE 30-day money back guarantee. I know you&#039;re going to be impressed.  </p>  <p>  \tFear No Terrorist,  </p>  <p>  \tCapt. Chris Pizzo<br style=\"\">  \tWorld Leader in Self-Defense  </p>  <p>  \tP.S.  Unless you’re willing to see a man’s slimy intestines spill out onto the carpeting . . .  </p>  <p>  \t        Unless you’re able to watch a guy’s brains splatter up against a wall . . .  </p>  <p>  \t        Unless you can stomach seeing blood squirt onto you from another human being’s chest -- until his heart stops beating . . .  </p>  <p>  \t        Unless you are capable of looking into a person’s eyes, while his life literally slips out of them . . .  </p>  <p>  \t        . . . then <em style=\"\">DO </em><em style=\"\">NOT </em><em style=\"\">ORDER </em><em style=\"\">THIS </em><em style=\"\">FREAKIN</em><em style=\"\">’ COURSE</em><em style=\"\">!!</em>  </p>  <p>  \t        But if you are among the few who are hard-wired in such a way that defending your life, your family, perhaps a group of total strangers, our country, and our freedoms may cause violent, disgusting harm to an enemy combatant . . .  </p>  <p>  \t        Then you damn well NEED to get this SMASH, STICK, &amp; STAB course.  </p>  <p>  \tP.P.S.  Look, I know you’d make this investment for the right reasons -- love of family, friends, and freedom -- but let’s face it.  The reality is, if you’re ever in a situation where you take out an armed, dangerous terrorist and save scores of lives . . .  </p>  <p>  \t          You WILL be a national hero.  And, from where I stand, there’s nothing wrong with that.  Nothing at all.  So go for it, Patriot:  Get yourself fully equipped, so you’ll be 100% ready when it’s hero-time.  Give this a try <em style=\"\">RIGHT </em><em style=\"\">NOW</em><em style=\"\">!</em>  </p>", 
    "end_date": null, 
    "title": "Expert Close Combat Training: Smash -Stick - Stab", 
    "price": "50.00", 
    "instructors": "Captain Chris Pizzo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319030_6a9b_3.jpg", 
    "course_url": "https://www.udemy.com/smashstickstab/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T18:35:07Z"
}