{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This is a complete turnkey program for law enforcement, security and the military. It is the fastest growing program on arresting, restraining, weapon retention and controlling complaint, non-compliant and combative subjects. </p><p>Even if you don't have any tactical training whatsoever, the core power techniques of The Guardian System are so effective, that you'll be able to perform them flawlessly on your next shift and turn even the most resistant and aggressive subject compliant and obedient. <br><br>If you're in law enforcement, the military, security, carry a firearm or just want to learn how to control someone who is violent and combative without the use of lethal force then this is the the program you want.  <br><br>We all know that pepper spray and tasers aren't 100% effective and if legislation continues on its current path even those and all other tools of the trade will be deemed \"inhumane\" and outlawed leaving you with only one real option: your wits and your empty hands. And if you continue to rely on your current antiquated, outdated and dare I say useless tactics that degenerate in the street faster than you can say \"see you on YOUTUBE\", then you my friend will be the next cautionary tale the vets tell the rookies their first day on patrol. <br><br>The harsh reality is you need to get a subject under control BEFORE John Q. Public can pull out his cell phone and post your finest moment on Facebook (we're talking seconds here, not minutes) and what is taught as defensive tactics today just doesn't cut it.</p><p><br></p><p>Contrary to popular belief, martial arts are not meant for combat or even real world self defense. Sure, they're technically \"fighting\" but at the end of the day they're sports and activities that train you to meet your opponent on a level playing field. They're bound by rules and regulations which is fine when you're training with friends but when a tweaked out meth-head stands between you going home or going to the morgue it's a whole new brutal ball game. <br><br><em><strong>So while you're trying to remember how to use that wrist lock or pressure point, and struggling to get him to \"tap\", that drug addict is fighting back with NO RULES and NO REGARD for your life! </strong></em>You're sparring with him he's securing a weapon or waiting for one of his buddies to jump in and help. <br><br>Look, every day you're faced with the possibility of confronting your worst nightmare. In a blink of an eye, your next traffic stop, your next suspect interview can become a matter of life and death…YOUR life and death! <br><br><strong>But before we continue, let me ask you some serious questions…</strong></p><ul><li>Do you remember all of your training?</li><li>Do you feel you're training was adequate?</li><li>Do you feel that you're prepared you for any and all situations?</li><li>Can you control any combative subject no matter how big?</li><li>Can you maintain control of your weapon against multiple threats?</li><li>Can you maintain 100% control of your weapon while arresting a violent subject?</li><li>Have you been trained efficiently in weapon retention from all possible positions standing and on the ground?</li><li>Have you been trained in long gun retention?</li><li>Does your team have a tactical takedown plan for single and multiple subjects?</li><li>Do you and your partner have a plan of attack when interviewing subjects?</li></ul><p><strong>If you want to answer a resounding YES!!! to each and every one of these questions then you'll want Guardian Police Combatives. </strong></p>", 
    "end_date": null, 
    "title": "Guardian Police Combatives", 
    "price": "50.00", 
    "instructors": "Damian Ross", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/784436_be16.jpg", 
    "course_url": "https://www.udemy.com/guardian-police-combatives/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-06T23:35:05Z"
}