{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Kickboks öğrenmek hiç bu kara kolay ve sistematik olmamıştı.</p><p>Üst seviye bir kickboks eğitimi aradığınızı ve kickboksta üst seviyenin <em><strong>sağlık, güç</strong></em> ve <strong><em>estetik</em></strong> olduğunu biliyoruz. Bu ihtiyaçlar doğrultusunda bir dizi kurs hazırlamaya başladık. </p><p><strong>Kickboks hakkında ne öğreneceksiniz</strong><br>ISınma ve esnemeler,<br>Gard ve gardı korumak,<br>Direkt yumruk,<br>Arkadan çıkışlı direkt yumruk,<br>Kroşe,<br>Arkadan çıkışlı kroşe,<br>Aparkat,<br>Arkadan çıkışlı aparkat,<br>Ön tekme,<br>Bacağa tekme,<br>Yandan tekme,<br>Balyoz tekme,<br>Yan tekme,<br>Döner tekme,<br>Beslenme ve enerji ihityacı hesabı<br></p><p><strong>Kimler için</strong><br>Kurs yeni başlayanlar için gibi gözükse de tüm seviyelerin faydalanabileceği bir içeriğe sahiptir.<br></p><p><strong>Niye ve nasıl</strong><br>Bedeninizi ısıtmayı, kaslarınızı verimli şekilde esnetmeyi ve teknikleri doğru olarak uygulamayı öğreneceksiniz. Bu sayede sakatlanmaların önüne geçeceksiniz. Kaslar ve eklemler hazır olmadan kum torbasına vurmaya başlayamazsınız. Kas ve eklemler hazır olduktan sonra doğru tekniği öğrenip en son aşamada vuruş yapmaya başlanmalıdır.<br></p><p><strong>Süre</strong><br>Kursun bitirilmesi için tavsiye edilen süre ortalama 1 aydır. Tabii ki her bireyin fiziksel yapısı ve yeterliliği aynı olmayacağı için bu süre biraz daha kısa ya da uzun olabilir.<br></p><p>Bunların yanında sağlıklı bir spor hayatı için beslenme ve dinlenmenin önemi oldukça büyüktür. İdmanlardan en az 3 saat önce yemek yemek antrenman performansını arttıracaktır.</p><p>İlk 5 antrenmanın süresi 1 saati aşmamalıdır. Beşinci antrenmandan sonra ise fiziki kapasitenize göre süreyi yavaş yavaş uzatıp bir buçuk saate kadar yükseltebilirsiniz.</p><p>Her antrenman öncelikle iyi bir ısınma ve esneme süreci ile başlamalı. Antrenman esnasında her tekniği hem sağ hem sol gard ile doğru bir şekilde uygulayıp iki tarafı da güçlendirmek gerekmektedir. Ortalama teknik tekrarı 50 olmalıdır. Eğer çok zorluyorsa tekrar sayısı düşürülmeli ya da tam tersine çok kolay geliyorsa tekrar sayısı arttırılmalıdır.<br>Teknik setleri arasında 30 saniye ile 1 dakika arası dinlenme süresi geçirilmelidir..</p><p>Başlangıç seviyesinde haftada 2 ya da 3 antrenman yapmak yeterli olacaktır.<br>Hollwoood tarzı döner tekme atmak çok havalı gözüküyor fakat ilk başlarda uzun süreler boyunca temel teknik çalışmak bu güzel tekniğin güzel olabilmesini sağlayan en önemli etkendir. Temel teknikler doğru olmadan başarılı olmanız çok zor.<br></p><p>İlk ayın sonunda kas ve eklemleriniz kum torbasına vurmaya başlayacak kadar güçlenmiş olacaktır. Vuruş egzersizleri ise bir sonraki kursumuzun konusu.<br></p>", 
    "end_date": null, 
    "title": "Kickboks", 
    "price": "50.00", 
    "instructors": "Tamer Serbest", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/774040_9783.jpg", 
    "course_url": "https://www.udemy.com/kickboks/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T15:09:42Z"
}