{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn the most effective techniques of Krav Maga Viper to protect yourself and the people around you from a violent attack.</p>\n\n<p><strong>Be able to defend yourself with the powerful Krav Maga Viper.</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Create confidence</li><li>Be always ready for an unexpected attack</li></ul><ul><li>Build a strong and skillful body</li><li>Build a decisive character</li><li>Defend yourself</li><li>Protect the poeple around you</li><li>Protect your family</li><li>Learn how to defend or stop a knife or pistol attack</li><li>Learn the best techniques that will be effective in a realistic street fight</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong><em>A Powerful weapon in your arms</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p>Krav Maga Viper is a very powerful defensive weapon in the right arms.All the realistic techniques presented in this course can be taught to everyone independently from his age or gender. They are pretty simple to learn and use in a case of emergency. Krav Maga Viper is a great method used by V.I.P bodyguards, army, police officers, holywood stars and people in daily life. This self-defense system has been awarded by big organizations, companies and events and the last 2-3 years it became known worldwide. Krav Maga Viper was founded in 2011 by the Master Iskan Selim who is the instructor of this course. What makes these techniques unique is the simplicity and effectiveness, something that makes them easily understandable by everyone. Krav Maga Viper videos from events and exams are going to release on Krav Maga Viper channel on Youtube.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Content and Overview</strong></p>\n\n\n\n\n\n\n\n\n\n<p>This course is designed to instruct some basic techniques of Krav Maga Viper Self-Defense System. It is suitable for everyone and once you take it you have lifetime access to learn these techniques anywhere. This course prepares and offers you skills that will be necessary in danger. Here you will learn three different types of techniques:</p>\n\n\n\n\n\n\n\n\n\n<p>1.  moves against an opponent without weapons,bare hands </p>\n\n\n\n\n\n\n\n\n\n<p> 2. against knife attacks and </p>\n\n\n\n\n\n\n\n\n\n<p> 3. against gun attacks. </p>\n\n\n\n\n\n\n\n\n\n<p>When you learn this, you will be always ready to deal with an unexpected attack. There are total 7 lessons that each one corresponds to 5 KMV  techniques with gradually increasing level. Every technique in the video is divided in 3 parts: </p>\n\n\n\n\n\n\n\n\n\n<p>1. we present you the technique in real speed, </p>\n\n\n\n\n\n\n\n\n\n<p> 2.  focus on the details of the technique in slow motion and </p>\n\n\n\n\n\n\n\n\n\n<p>3.  show you again in normal speed how realistic and effective it can be.\n</p>\n\n\n\n\n\n\n\n\n\n<p>At the end of this course you will be able to defend yourself easily and create confidence, something that will be very often necessary in you life. Once you take this course and learn these techniques, feel free to contact your instructor master Iskal Selim for extra details on the topic of this course. Iskan Selim can also send you a level degree in the end of the course.</p>\n\n\n\n\n\n\n\n\n\n<p>There are some moments in our life that we need to take the right decision in just few seconds. When our lives or the lives of our family are in danger is our duty to protect them. We don't live to fight, we fight to survive.</p>\n\n\n\n\n\n\n\n\n\n<p>-KMV                                                                                                                      </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Εταιρία Κατάρτισης και Πιστοποίησης Ειδικών Μεθόδων Αυτοπροστασίας και Αυτοάμυνας (KRAV MAGA VIPER-SPETSNAZ GRU VOIN-MUAY THAI ) με Ειδίκευση στην Εκπαίδευση και Διάθεση Προσωπικού Προστασίας και Φύλαξης Προσώπων και Πλοίων Μονοπρόσωπη Ιδιωτική Κεφαλαιουχική Εταιρεία.</p>\n\n\n\n\n\n\n\n\n\n<p>Self-defense and self-protect training and certification, Elite V.I.P. bodyguard training, Antipiracy-maritime security personal training and service concessions, Leading special self-defense techniques (KRAV MAGA VIPER-MUAY THAI ) and Spetsnaz GRU-VOIN training Single Member Private Company.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Krav Maga Viper - Self Defense System (volume 1)", 
    "price": "30.00", 
    "instructors": "George Katsilidis, Iskan Selim", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/836990_f631_2.jpg", 
    "course_url": "https://www.udemy.com/krav-maga-viper-self-defense-system-volume-1-c/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-01T21:01:25Z"
}