{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The Krav Maga principles begin with using natural, instinctive reaction whenever possible.  With an instinctive reaction there is really nothing new that a student needs to learn initially, it is simply taking what they will instinctively do and applying it as part of the initial defense.  A great example is the instinctive reaction of reaching out for balance or grab hold of something when off balance and/or falling.  We don’t think of it, we simply do it as an evolutionary development from walking upright.  Now apply this to a defense against choke with a push in which the defender is pushed off balance and will naturally reach up and out in an attempt to stay on their feet.  In Krav Maga we use this reaction as the initial reaction for our defense because under stress and without thinking people will make this motion and by making this motion they have put themselves on the first step of the defense, and that without even the need to think about nor analyze the problem.  By doing this Krav Maga bridges the gap between a training environment, mechanical practice of each technique for motor memory, and use of a technique under realistic conditions.  <br></p><p>This course is designed to bring the training of the Gym to you at home. It is for anyone who wants to be able to walk in peace, with the knowledge that you can defend yourself in any situation. </p><p>This course covers striking, kicking, choking, and ground fighting. We show you how to defend yourself in multiple scenarios agains an attacker. </p><p>Not only are you going to be learning great self defense, you will also be getting into great shape! Krav Maga has amazing cardio benefits that will get your heart and body moving, with the added benefit of improving your self defense skills. </p><p>This course offers high quality videos that can be slowed down so you can see step by step how to execute the specific moves.</p><p>Learn the skills you need to be safe and walk in peace.</p><br>", 
    "end_date": null, 
    "title": "Krav Maga", 
    "price": "20.00", 
    "instructors": "Navanas Institute", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/652044_52c8.jpg", 
    "course_url": "https://www.udemy.com/krav-maga/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T04:50:19Z"
}