{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t   Drop Any \"Bad-Guy\" Who Dares Lay A Finger On You Or Your Loved Ones...Instantly!  </p>  <p>  \t <strong style=\"\">\"World’s Most Natural Hand-To-Hand </strong><strong style=\"\">Combat System Lets You Humiliate Younger, </strong><strong style=\"\">Tougher, and More Experienced Fighters </strong><strong style=\"\">Every Time, Regardless of Your Age, Gender, </strong><strong style=\"\">or Physical Ability...Without Even Trying!\"</strong>  </p>  <p>  \t <strong style=\"\">The World's #1 Self Defense Instructor</strong>, Captain Chris, reveals his amazingly simple system for stopping violent attackers <strong style=\"\"><em style=\"\">dead in their tracks</em></strong>—no matter your age, experience or fitness level.  </p>  <p>  \t <strong style=\"\">• Seen on major TV shows.</strong>  Including <strong style=\"\"><em style=\"\">\"The Today Show</em></strong><em style=\"\">\"</em>, <strong style=\"\"><em style=\"\">\"Eye Witness News</em></strong><em style=\"\">\"</em>, <strong style=\"\"><em style=\"\">\"Good Day New York</em></strong><em style=\"\">\"</em>, and more.  </p>  <p>  \t <strong style=\"\">• Used by The U.S. &amp; U.K. Special Forces,</strong> bounty hunters, mercenaries and even professional <strong style=\"\"><em style=\"\">assassins</em></strong>—who don't have time to learn complex and outdated martial arts moves that don't work in \"real world\" violent attacks.  </p>  <p>  \t <strong style=\"\">• So <em style=\"\">easy</em>, you can master it in just a short <em style=\"\">weekend... </em></strong>even if you've never set <em style=\"\">foot</em> in a self defense class in your life.  </p>  <p>  \t <strong style=\"\">• So <em style=\"\">effective</em>, even guys with no previous experience</strong> are using it to send thugs, gang members and other violent \"street predators\" into emergency rooms around the world.  </p>  <p>  \t <strong style=\"\">COURSE DETAILS:</strong>  </p>  <p>  \t           If you'd like to know how even someone who is slow, out-of-shape and has zero self defense experience can, <strong style=\"\">in one </strong><strong style=\"\">hour</strong><strong style=\"\"> or less</strong>, know more about surviving brutal street attacks than most <em style=\"\">black belt karate masters</em>... then this letter will show you how.  </p>  <p>  \t             Here's the story:  </p>  <p>  \t             My name is Captain Chris... I am an unarmed combat instructor and self defense specialist. I hold black belts in 5 different martial arts, a U.S. Gold Medal in Grappling, and my students include <strong style=\"\">professional assassins</strong>, <strong style=\"\">international mercenaries</strong>, <strong style=\"\">The U.S. &amp; U.K. Special Forces</strong> and hundreds of <em style=\"\">elite</em> military and law enforcement agents at the local, state and federal level.  </p>  <p>  \t             Anyway, you can read more about me and my real life \"adventures\" seeking out the world's most <em style=\"\">deadly</em> self defense tactics in my “bio” section over to the right of this page.  </p>  <p>  \t             But forget about that for now.  </p>  <p>  \t             It's not <em style=\"\">all</em> that important.  </p>  <p>  \t             What is important is that, for the past several years, I have been teaching (and <em style=\"\">perfecting</em>) a secret way of fighting that was invented during World War 2—that lets even \"regular Joe's\" hurt, cripple and even kill violent attackers that threaten you, your wife or your kids:  </p>  <p>  \t <strong style=\"\">•Without needing to be fast, strong or \"in shape.\"</strong>  </p>  <p>  \t <strong style=\"\">•Without long, sweat-drenched hours of practice.</strong>  </p>  <p>  \t <strong style=\"\">•And without needing </strong><strong style=\"\">any</strong><strong style=\"\"> fighting experience whatsoever.</strong>  </p>  <p>  \t             In fact, as strange as it sounds...  </p>  <p>  \t <strong style=\"\">The </strong><strong style=\"\">Less</strong><strong style=\"\"> You Know About Fighting Now... </strong>  </p>  <p>  \t <strong style=\"\">The <em style=\"\">Better</em> This <em style=\"\">Bizarre</em> Self Defense System Works!</strong>  </p>  <p>  \t             How is this possible?  </p>  <p>  \t             To answer that question, I have no choice but to tell you a story the military and most every \"martial arts\" teacher on the planet do NOT want you to know.  </p>  <p>  \t             Frankly, even the U.S. <em style=\"\">government</em> will deny what I'm about to say.  </p>  <p>  \t             Listen:  </p>  <p>  \t             Almost 80 years ago, on the eve of World War 2, there was a meeting within the House of Lords in London. In attendance were some of the world's richest and most <em style=\"\">powerful</em> men: Including billionaires (there were only a few at the time), diplomats, kings, world leaders, presidents, and other powerful \"elites\" who controlled vast sums of money and power.  </p>  <p>  \t             These people were literally <em style=\"\">desperate</em> to discover the answer to one question, and one question <em style=\"\">only</em>:  </p>  <p>  \t <strong style=\"\">\"What REALLY Works In Combat?\"</strong>  </p>  <p>  \t             Why did they need to know the answer to this question?  </p>  <p>  \t             Because these guys were <em style=\"\">scared</em> <em style=\"\">shitless</em> (and rightfully so) that they were about to lose their entire fortunes to the single greatest threat mankind had ever seen:  </p>  <p>  \t <strong style=\"\"><em style=\"\">The</em> <em style=\"\">Nazis</em>.</strong>  </p>  <p>  \t             And so, these European power players teamed up with the British government to commission a small group of \"combat engineers\" to study every single one of the world's most combative fighting styles, martial arts and self defense techniques.  </p>  <p>  \t             Here's what they found:  </p>  <p>  \t             After months of putting <em style=\"\">thousands</em> of moves, methods and strategies under a microscope, these \"combat scientists\" discovered there are really only three core \"truths\" about winning and dominating a violent altercation (whether on the battlefield or on the <em style=\"\">street</em>):  </p>  <p>  \t <strong style=\"\">Core Fighting Truth #1:</strong>  </p>  <p>  \t             In a REAL fight... when your adrenaline and emotions <em style=\"\">rage</em> out of control... it's <em style=\"\">impossible</em> to perform the complicated kicks, strikes and throws taught in 99% of martial arts.  </p>  <p>  \t             In fact...  </p>  <p>  \t <strong style=\"\">The More Self Defense \"Moves\" You Know...The More <em style=\"\">Paralyzed</em> You'll Be! </strong>  </p>  <p>  \t             Which meant all the fancy jumping, kicking and punching the Far East \"gurus\" were teaching was, frankly, <em style=\"\">bullshit</em> when it came to surviving violent altercations.  </p>  <p>  \t             Reason why is because they depend on knowing dozens - even <em style=\"\">hundreds - </em>of \"complex motor\" movements... instead of just a small handful of easy-to-learn (and  </p>  <p>  \t           master) \"gross\" motor movements.  </p>  <p>  \t             Just to be clear....  </p>  <p>  \t             \"Complex\" motor movements are multi-muscle movements such as putting a key in your car door, pointing and shooting a gun, and just about every martial art move taught in today's dojos—like reverse punches, front kicks, wrist locks, arm bars, hip throws, etc.  </p>  <p>  \t             \"Gross\" motor movements, on the other hand, are movements you can do without even <em style=\"\">thinking</em>—like <strong style=\"\">running</strong>, <strong style=\"\">charging</strong>, <strong style=\"\">raising your arm above your head</strong> or <strong style=\"\">lifting your heels off the ground.</strong>  </p>  <p>  \t             This was a HUGE revelation that \"mainstream\" self defense schools—even 80 years later—still have not \"gotten\" yet. (And those who do will NEVER admit it.  Because let's face it, they would be out of business <em style=\"\">tomorrow</em> if their students knew how useless all those \"flashy\" kicks and punches really are.)  </p>  <p>  \t             But this was only one of the undeniable truths they learned in their \"combat labs.\"  </p>  <p>  \t <strong style=\"\">Core Fighting Truth #2:</strong>  </p>  <p>  \t             Everybody (no matter what their size, strength or skill level) has the exact same <em style=\"\">vulnerable</em> spots on their bodies.  </p>  <p>  \t             These areas—long known by ancient Chinese warriors, ninja assassins and elite Samurai—are like \"chinks\" in a suit of armor... where no matter how <em style=\"\">ripped</em> up with muscle or <em style=\"\">strung</em> out on pain-numbing drugs someone is...  </p>  <p>  \t <strong style=\"\">They Can Be Seriously </strong>  </p>  <p>  \t <strong style=\"\">Injured... Crippled... Or Even <em style=\"\">Killed!</em></strong>  </p>  <p>  \t             Some of these spots are obvious (like your eyes and <em style=\"\">testicles</em>).  </p>  <p>  \t             But many of these natural human \"achilles heels\" are NOT obvious—and thus, are rarely defended against, <strong style=\"\">since people don't even realize they have them on their bodies!</strong>  </p>  <p>  \t             Which brings us to the third insight these combat experts discovered:  </p>  <p>  \t <strong style=\"\">Core Fighting Truth #3:</strong>  </p>  <p>  \t             If you simply know where these \"tender\" spots are... and how to attack them (using simple gross motor movements you can do without even <em style=\"\">thinking</em>)... you can win <em style=\"\">any</em> fight, against <em style=\"\">any</em> person (even multiple <em style=\"\">armed</em> people)...  </p>  <p>  \t <strong style=\"\">In Five Seconds Or Less!</strong>  </p>  <p>  \t             Doesn't matter if you're jumped in the dark and can't see or think.  </p>  <p>  \t             If you're injured or immobilized.  </p>  <p>  \t             Or even if you're held at knife or gun point, or attacked by someone stronger, faster and more <em style=\"\">experienced</em> than you.  </p>  <p>  \t             Frankly, none of that matters if you understand the three simple truths above.  </p>  <p>  \t             Which is why the system these WW2 \"combat analysts\" created is unlike <em style=\"\">anything</em> the world had seen <em style=\"\">before</em>... or has seen <em style=\"\">since</em>.  </p>  <p>  \t <strong style=\"\">And the Nazis—as cruel, violent and \"hell bent\" on destruction as they were—never knew what <em style=\"\">hit</em> them!</strong>  </p>  <p>  \t             In fact, the soldiers who used this devastating system were <em style=\"\">legendary</em> for jumping dozens of armed Nazi and elite Japanese commandos...  </p>  <p>  \t <strong style=\"\">And Killing Them </strong>  </p>  <p>  \t <strong style=\"\">With Their </strong><strong style=\"\">Bare</strong><strong style=\"\"> Hands! </strong>  </p>  <p>  \t             Sounds almost <em style=\"\">crazy</em>, doesn't it?  </p>  <p>  \t             I know... but even <em style=\"\">more</em> incredible is... in many cases, these Allied \"Super Soldiers\" did not even bother using their weapons (<strong style=\"\"><em style=\"\">\"too slow and clumsy\"</em></strong>, they reported).  </p>  <p>  \t             Instead, they would just use these extremely effective movements they were taught sometimes the <em style=\"\">night</em> before they were shipped off to battle.  </p>  <p>  \t             It's incredible just <em style=\"\">thinking</em> about it.  </p>  <p>  \t             These Allied soldiers—some of who were in <em style=\"\">horrible</em> physical shape from eating crappy food and smoking like chimneys back in those days—were able to learn (and master) these moves in a short <em style=\"\">weekend</em>, and then be \"set loose\" against the Nazis in WW2 and, later, the commies in Korea and Vietnam. (After which the Washington liberals deemed this system to be too \"brutal\"—and literally <em style=\"\">banned</em> our military from teaching it to our soldiers.)  </p>  <p>  \t             Anyway, they called this deadly self defense system: \"<strong style=\"\">Close Combat Training</strong>.\"  </p>  <p>  \t             And let me tell you something...  </p>  <p>  \t             As the \"go to guy\" for today's most <em style=\"\">advanced</em> and highly trained military soldiers, mercenaries and other professional <em style=\"\">killers</em>... I have learned a lot of cool, useful (and downright <em style=\"\">nasty</em>) self defense tactics.  </p>  <p>  \t             Frankly, some of the insanely violent methods I learned from the Arabian assassins in Egypt, the Israeli soldiers stationed on the West Bank, and the last remaining Samurai (while trekking through Asia) are amongst the most <em style=\"\">lethal</em> fighting techniques ever invented.  </p>  <p>  \t <strong style=\"\">Yet NOTHING I've Seen Even Comes </strong>  </p>  <p>  \t <strong style=\"\"><em style=\"\">Close</em> This Extreme Combat Fighting System!</strong>  </p>  <p>  \t             In fact, Close Combat Training is the world's ONLY truly <em style=\"\">lethal</em> self defense system that:  </p>  <p>  \t <strong style=\"\">•Does NOT require a lot of time to master—</strong>You can learn it, literally, in a couple <em style=\"\">hours</em>—even if you're a total fighting \"green horn\" now.  </p>  <p>  \t <strong style=\"\">•Does NOT require you to be in peak physical condition—</strong>I've actually seen guys with bulging beer bellies and bum kneesuse Close Combat Training to send younger and more <em style=\"\">experienced</em> fighters—<strong style=\"\">even advanced martial artists</strong>—to the <em style=\"\">emergency</em> room.  </p>  <p>  \t <strong style=\"\">•Does NOT require you to be uninjured to work—</strong>Again, these are gross motor movements. And that's why even soldiers with their legs blown off were able to defend themselves against armed enemies closing in on them in trenches and ditches.  </p>  <p>  \t <strong style=\"\">•Does NOT require any practice—</strong>once you learn it, it's \"locked in\" your mind, your neurology and even your <em style=\"\">muscle</em> fibers forever. You cannot forget it even if you <em style=\"\">wanted</em> to. It's like a weapon strapped to your leg 24/7—365 days per year—ready to be drawn and fired at a moment's notice at any time, in any place, and under any <em style=\"\">circumstances</em>.  </p>  <p>  \t             In short, <strong style=\"\">Close Combat Training is the \"Shangri-La\" of self defense</strong> all the martial arts schools, videos and seminars promise but can <em style=\"\">never</em> deliver on.  </p>  <p>  \t             It literally cannot be defended against.  </p>  <p>  \t             It cannot be countered by even the most advanced martial arts blocks and evasions.  </p>  <p>  \t             And it cannot technically even \"fail.\"  </p>  <p>  \t             This is no joke.  </p>  <p>  \t             With Close Combat Training, you can literally paralyze a man twice your size and weight even if you <em style=\"\">miss</em> what you are trying to hit!  </p>  <p>  \t             Which is why it's <em style=\"\">perfect</em> for guys like you who don't want to screw around taking formal self defense classes... don't want to practice dozens of moves and techniques... or who simply want to learn how to fight as fast as humanly <em style=\"\">possible</em>.  </p>  <p>  \t             This is also why <em style=\"\">elite</em> soldiers, law enforcement agents and even cold-blooded <em style=\"\">mercenaries</em> (who make it their <em style=\"\">job</em> to know every single way to kill, maim and injure) travel thousands of miles (and pay me a small <em style=\"\">fortune</em>) to learn at my feet in our New York City facility.  </p>  <p>  \t             And it's what prompted major TV shows (like <strong style=\"\">The Today Show</strong> and <strong style=\"\">Eye Witness News</strong>) to fly me into their studios (at <em style=\"\">their</em> expense) and...  </p>  <p>  \t <strong style=\"\">Teach Close Combat Training </strong>  </p>  <p>  \t <strong style=\"\">To Their Audiences On National TV.</strong>  </p>  <p>  \t             And guess what?  </p>  <p>  \t             Even though it costs $14,987.00 per <em style=\"\">lesson</em> to learn this system privately... I have just \"arranged\" it so <strong style=\"\">you can learn this advanced combat system in the privacy of your own home for a FRACTION of that.</strong>  </p>  <p>  \t             Let me explain:  </p>  <p>  \t             Years ago (right after the 9-11 terrorist attacks), I decided to make this system available to regular civilians who could not afford my $14,987.00 price.  </p>  <p>  \t             It was clear the world was too violent for regular martial arts to defend against. And I felt a duty—an <em style=\"\">obligation</em>—to make it accessible to <em style=\"\">everyone</em>... and not just my high falutin' clients who can drop $14k like other guys drop a quarter in a homeless man's paper cup.  </p>  <p>  \t             And so, I put the entire Close Combat Trainingsystem into a series of videos and offered them for a <em style=\"\">fraction</em> of what my in-person training's cost.  </p>  <p>  \t             Since then,<strong style=\"\">THOUSANDS of people around the globe have bought this course</strong><strong style=\"\"> and learned this system.</strong>  </p>  <p>  \t             It's been featured on national and local TV and radio.  </p>  <p>  \t             It's been seen in big websites and magazines like <strong style=\"\">Fox News, The Blaze, World Net Daily, NewsMax, Black Belt Magazine, Muscle &amp; Fitness, Men's Journal, Soldier Of Fortune, Inside Kung Fu, etc.</strong>  </p>  <p>  \t             And some of the world's most  </p>  <p>  \t           advanced martial artists have praised it as the most cutting edgeway of fighting they've ever <em style=\"\">seen</em> (in fact, many of them buy these lessons so they can teach it to <em style=\"\">their</em> students!)  </p>  <p>  \t             And even though this \"home study\" version of Close Combat Training has fetched as much as $2,000 just a few months ago, for reasons I will explain shortly... and for a VERY limited time... you can...  </p>  <p>  \t <strong style=\"\">Watch These Videos  </strong>  </p>  <p>  \t <strong style=\"\">Without Even <em style=\"\">Paying</em> For Them!</strong>  </p>  <p>  \t             I'll explain this extremely generous deal in a second.  </p>  <p>  \t             But first, here's a \"sneak preview\" of the incredible secrets you'll learn when you watch these DVD’s:  </p>  <ul style=\"\">  \t<li><strong style=\"\">How to toss ANY man right on his head... and break his arm on the way down if you choose to do so. (I don't care if you only weigh 90 pounds <em style=\"\">soaking</em> wet, either—as you'll see, your physical size has <em style=\"\">nothing</em> to do with it.)</strong></li>  \t<li>A 2-hit combination GUARANTEED to <em style=\"\">shatter</em> your attacker's jaw... every single time. (Six months of dental surgery and he MIGHT be able to <em style=\"\">talk</em> and actually stand trial.)</li>  \t<li><strong style=\"\">Incredible “military tricks” that will take you from absolute rookie to a master fighter in just a few short <em style=\"\">hours</em>.</strong></li>  \t<li>Why a simple change in your “mindset” will mean the difference between being the <em style=\"\">prey</em> or being the <em style=\"\">predator</em> when surrounded by thugs, gang members and other scum on the street.</li>  \t<li><strong style=\"\">How to snatch a loaded gun right out of a \"Gangsta's\" hand so damn fast it will literally tear his trigger finger off! (And then immediately—without even <em style=\"\">thinking</em> about it—cave his chest in without skipping a <em style=\"\">beat</em>.)</strong></li>  \t<li>Single escape and takedown moves that require no strength whatsoever. (<em style=\"\">Perfect</em> to teach your kids and wife... or to use when you’re hurt or attacked by bigger guys pumped up with pain-numbing drugs and rage!)</li>  \t<li><strong style=\"\">How to immediately win a fight if you find yourself on the ground with a bigger opponent on top of you. (And without screwing around with that \"tap-out\" B.S. you see on TV.)</strong></li>  \t<li>How to control the “shakes” and super-hot adrenaline dump that occurs during tense, violent situations! (You’ll be cool, smooth and effective no matter how confusing things get... just the <em style=\"\">opposite</em> of how most men react!)</li>  \t<li><strong style=\"\">The one “basic” mistake even cops and soldiers make (despite their expensive training) that <em style=\"\">erases</em> their \"training advantage\" in a street fight. (And how to make sure YOU never fall victim to it yourself.)</strong></li>  \t<li>How to lock “new” combat information into your long-term memory and nervous system.</li>  \t<li><strong style=\"\">How to get away from a larger attacker who surprises you. (It's instantaneous, keeps you safe from any blows, and puts him so \"off-balanced\" he's <em style=\"\">toast</em> for your next move. And the beauty is... the bigger he is, the <em style=\"\">easier</em> it is for you to do this!)</strong></li>  \t<li>Vicious, stomach-churning (but simple) moves that allow you to \"lead\" him by his chin all the way to the ground... <em style=\"\">hard</em>. (His body goes where you lead it, like a lifeless slab of meat—letting you control and humiliate even the biggest and <em style=\"\">toughest</em> street punk on the block with ease.)</li>  \t<li><strong style=\"\">How to take a strong, oversized man down easily... without using any fancy grappling or wrestling moves.</strong></li>  \t<li>The 8 “tactical” combat coordinates you must know to win a violent encounter against any attacker—including the horrendous “Hollywood” mistakes most people make that get them seriously hurt or killed. (Some of the “normal tendencies” you have are 100% <em style=\"\">wrong</em>!)</li>  \t<li><strong style=\"\">How to break up the most common street attacks with a single, simple move. (Instantly \"cancels out\" anything an experienced street fighter can throw at you.)</strong></li>  \t<li>Exactly how to <em style=\"\">instantly</em> put down anyone who walks up to you and grabs your shirt, ready to bash your face in. (This is the single most common attack in bars, parties, and other places where people with lots of \"liquid courage\" inside them cause trouble.)</li>  \t<li><strong style=\"\">How to make someone who tries to choke you literally drown in his own <em style=\"\">spit</em>.  (Frankly, you have to see this one to believe it—it's <em style=\"\">that</em> incredible.)</strong></li>  \t<li>How even a 105 pound <em style=\"\">girl</em> can snap a big guy's wrist or elbow like a stale <em style=\"\">pretzel</em> rod.</li>  \t<li><strong style=\"\">How to spin an attacker around when he grabs, pushes, or reaches—take his back—and LIGHTS OUT!</strong></li>  \t<li>The \"Shake &amp; Bake\" principle of violent aggression. This is how you can <em style=\"\">exponentially</em> multiply the viciousness of ANY choke or joint lock.</li>  \t<li><strong style=\"\">What to do if your attacker is simply TOO BIG.</strong></li>  \t<li>How to inflict unbearable pain to shut off his brain while you end the fight.</li>  \t<li><strong style=\"\">Plus much, MUCH more...</strong></li>  </ul>  <p>  \t             Including... How to control a bigger and stronger attacker's entire body with one <em style=\"\">knuckle</em>... A secret way (unknown to 99% of martial artists) to stop a 70 mph punch without blocking or evading it... and even...  </p>  <p>  \t <strong style=\"\">How To <em style=\"\">Cripple</em> Someone Twice Your Size And Weight...</strong><strong style=\"\">Using Nothing More Than The <em style=\"\">Tips</em> Of Your Fingers!</strong>  </p>  <p>  \t             I know that sounds almost like \"voodoo.\"  </p>  <p>  \t             But it's a proven <em style=\"\">fact</em>:  </p>  <p>  \t             If you simply know the right <em style=\"\">place</em> (and the right <em style=\"\">way</em>) to \"touch\" your enemy, he'll drop like a lead balloon—easily letting you run or finish him off (whichever floats your boat).  </p>  <p>  \t             Anyway, I don't care how old you are, what kind of shape you're in, or if you've never been in a <em style=\"\">real</em> fight in your life.  </p>  <p>  \t             After watching just the first few videos ALONE...  </p>  <p>  \t <strong style=\"\">You'll Know More About </strong><strong style=\"\">Surviving A Life-Or-Death Street Assault </strong><strong style=\"\">Than Most <em style=\"\">Black Belt Karate Masters</em>!</strong>  </p>  <p>  \t             Without long, grueling hours of practice.  </p>  <p>  \t             Without drilling hundreds of boring techniques that are <em style=\"\">useless</em> in a real fight.  </p>  <p>  \t             And without sweating your ass off in some lame martial arts dojo with a bunch of obnoxious kids and teenagers.  </p>  <p>  \t <strong style=\"\">  More:</strong>  </p>  <p>  \t             Since I am first and foremost a professional educator (I spent several years teaching in the New Jersey public school system), I created these videos with a special built in \"quick learning\" mechanism so anyone can absorb the information as <em style=\"\">fast </em>as possible.  (Regardless of your unique learning style.)  </p>  <p>  \t             This is one of the reasons guys like to get this course right before being shipped off to battle or give to their kids before sending them to college:  </p>  <p>  \t <strong style=\"\">  They are </strong><strong style=\"\">specifically</strong><strong style=\"\"> designed to be learned— and <em style=\"\">mastered</em>—in just a few </strong><strong style=\"\">hours</strong><strong style=\"\">.</strong>  </p>  <p>  \t             Finally (and perhaps <em style=\"\">best</em> of all)...  </p>  <p>  \t             Because of the unique gross motor movements Close Combat Training uses, just going through the system ONE time will literally \"clean out\" your <em style=\"\">neural pathways</em>.  </p>  <p>  \t             This basically means the internal \"lines\" that connect your body to your mind will <em style=\"\">automatically</em> start working more efficiently.  </p>  <p>  \t             You'll be able to think faster, clearer and more decisively than ever before. <strong style=\"\">Everything you do—whether at work, in your business, or even on the <em style=\"\">golf course</em>—will be at a much </strong><strong style=\"\">higher</strong><strong style=\"\"> \"level\" than everyone else around you.</strong>  </p>  <p>  \t             This is an awesome \"side effect\" you will notice almost <em style=\"\">immediately</em>.  </p>  <p>  \t             Bottom line?  </p>  <p>  \t             Close Combat Training is the ONLY proven effective \"no sweating, no hard training\" self defense system ever invented.  </p>  <ul style=\"\">  \t<li>You do NOT have to spend a lot of time to master it.</li>  \t<li>You do NOT need a \"live\" instructor to learn it.</li>  \t<li>And you do NOT even need a training partner to practice it.</li>  </ul>  <p>  \t             This is why Close Combat Training has been endorsed and <em style=\"\">used</em> by everyone from elite soldiers in the<strong style=\"\"> U.S. Special Forces</strong>, <strong style=\"\">Marines</strong> and <strong style=\"\">Army Rangers</strong> (who can <em style=\"\">only</em> afford to use what can be mastered extremely fast)... to <strong style=\"\">professional assassins</strong>, <strong style=\"\">bounty hunters</strong>, <strong style=\"\">inner city cops</strong>... and even other <strong style=\"\">self defense teachers and \"gurus\"</strong> from Korea, Japan and Tibet.  </p>  <p>  \t            Now how about when it comes to you?  </p>  <p>  \t             When YOU learn these simple tactics, you'll know—in just a few short <em style=\"\">hours</em>—how to deal with <em style=\"\">any</em> violent situation.  </p>  <p>  \t             Feel completely at <em style=\"\">ease</em> walking down a dark alley on the bad side of town.  </p>  <p>  \t             And NEVER worry about what to do if things go bad on the street—even if you're with your wife and kids.  </p>  <p>  \t             In fact...  </p>  <p>  \t             Don't be surprised if people \"all the suddenly\" react different to you.  </p>  <p>  \t           Start treating you with more respect. And instantly <em style=\"\">know</em> by the way you move and the look in your <em style=\"\">eye</em>...  </p>  <p>  \t <strong style=\"\">You're NOT Someone </strong><strong style=\"\">To Screw Around With!</strong>  </p>  <p>  \t           Seriously.  </p>  <p>  \t <strong style=\"\">Watch and see. </strong>  </p>  <p>  \t             See if people don't move out of YOUR way when walking down a crowded sidewalk. If your friends, neighbors and co-workers don't start coming to you for advice about self defense. If your wife doesn't immediately look at you differently because she <em style=\"\">knows</em> her man can \"take care of business\"—and truly protect her and her children if the <em style=\"\">worst</em> happens.  </p>  <p>  \t <strong style=\"\">Why Am I Basically Giving These Lessons Away?</strong>  </p>  <p>  \t             That's a great question.  </p>  <p>  \t             And I'd certainly be wondering the same thing.  </p>  <p>  \t             Fact is, I have sold these video lessons for as much as $2,000 and <em style=\"\">still</em> had a backlog of orders from people who heard about us from their friends or saw me demonstrate it on national TV.  </p>  <p>  \t             But here's the thing:  </p>  <p>  \t             I meet a LOT of people in this business.  </p>  <p>  \t             Not just students and \"fans\"... but high level military and government <em style=\"\">security</em> analysts (who I literally have to sneak in through the \"back door\", since our government banned our soldiers and agents from learning this after Vietnam).  </p>  <p>  \t             And I KNOW the kind of crazy stuff that's about to hit the fan in our country.  </p>  <p>  \t             I've seen statistics, reports and projections that would quite frankly cause a nation-wide <em style=\"\">panic</em> if everyone knew the truth.  </p>  <p>  \t             Believe me...  </p>  <p>  \t             Whatever you <em style=\"\">think</em> you might know about crime and violence (from reading the newspaper and listening to talk radio) is just a \"watered-down\" version of the REAL story meant to keep the public calm and our politicians' butts covered.  </p>  <p>  \t             The fact is... with the <em style=\"\">explosion</em> of criminal illegal alien gangs allowed to freely roam big cities like LA, Chicago and New York...  </p>  <p>  \t             ... international terrorists basically <em style=\"\">invited</em> in by the Washington liberals...  </p>  <p>  \t             ...and the rising number of left wing <em style=\"\">nuts</em> in Congress passing laws that empower criminals and <em style=\"\">castrate</em> guys like you...  </p>  <p>  \t             ...knowing how to kick someone's ass at the drop of a dime is no longer a luxury.  </p>  <p>  \t <strong style=\"\">It Is <em style=\"\">Crucial</em> To You </strong><strong style=\"\">And Your Family's Survival!</strong>  </p>  <p>  \t             And no disrespect to anyone... but \"old school\" martial arts just won't cut it.  </p>  <p>  \t             Those \"slapped together\" $29 video courses on the Internet and tacky storefront martial arts schools will NOT do you a lick of good in a REAL violent street altercation—where there are no rules, regulations or referees to keep things \"fair.\"  </p>  <p>  \t             And because of this, I just don't think guys like you should have to mortgage your home to get these lessons (which is exactly what one guy recently wanted to do—and what prompted me to test out this deal in the <em style=\"\">first</em> place).  </p>  <p>  \t             Instead, I want you to take the system for a spin —without financial pressure. Which is why the Close Combat Training \"core\" system is priced right for every possible budget.  </p>  <p>  \t <strong style=\"\">  And check <em style=\"\">this</em> out:</strong>  </p>  <p>  \t             To further \"encourage\" you to try Close Combat Training today... I am including a couple of additional bonuses...  </p>  <p>  \t <strong style=\"\">Bonus #1: The \"By-The-Numbers\" Learning Course (Value $97)</strong>  </p>  <p>  \t             My personal favorite part of the whole system... you'll gain instant online access to this video immediately and I'll walk you step-by-step through a secret way (<strong style=\"\">known only to a few top level Special Forces soldiers and myself</strong>) to not only accelerate your learning of Close Combat, but also any <em style=\"\">other</em> subject you want to learn... like <strong style=\"\">foreign languages</strong>,<strong style=\"\"> technical instructions</strong>, or other <strong style=\"\">professional skills</strong>.  </p>  <p>  \t             This is highly advanced (even <em style=\"\">classified</em>, in some countries) information you can use to compete and win at work, in sports and when locked in mortal combat with some freak attacking your family on the <em style=\"\">street</em>.  </p>  <p>  \t <strong style=\"\">Bonus #2 Women's Self Defense Course (Value $97)</strong>  </p>  <p>  \t             When I began to see how many men were using Close Combat to pick-up women... Husbands impressing their wives... and Dads teaching their daughters how to defend themselves... I thought it was high time I created a video specifically to tackle women's greatest <em style=\"\">fears</em> (Rape, forced home entry, car jackings, stalkers, etc.).  </p>  <p>  \t             My women's self defense experience video covers all that and <em style=\"\">more</em>.  </p>  <p>  \t             Because let's face it...  </p>  <p>  \t             You never know who is watching, stalking and <em style=\"\">probing</em> your wife or daughter right now—whether she's walking through the mall parking lot, pushing a cart through the grocery store or working out at the gym.  </p>  <p>  \t             Women are natural \"care takers\" and want to <em style=\"\">help</em> people all the time. And the sociopaths, rapists and serial killers use this fact to lure women into empty, <em style=\"\">isolated</em> places where nobody can hear their screams.  </p>  <p>  \t             But you won't have to worry about that anymore.  </p>  <p>  \t             Because once your wife or daughter watches this instant online video, she will NEVER be \"easy pickings\" for these sick bastards. I get testimonials about this video ALL THE TIME from women who were once afraid of walking to their cars at night or who were being stalked by psychotic ex-boyfriends.  </p>  <p>  \t             In fact...the FIRST thing I recommend doing after you invest in Close Combat Training is to sit your wife or daughter down and show them this video. It could very well save their lives.  </p>  <p>  \t           Anyway, that's about it. <strong style=\"\">Now its up to you...</strong>  </p>  <p>  \t             if you've got the right stuff, I can show you the most sought-after self defense methods ever developed.  </p>  <p>  \t             And while I'm CERTAINLY NOT going to promise you will become a TRAINED KILLER overnight...  </p>  <p>  \t             I CAN guarantee you will have the skills, confidence and <em style=\"\">near-magical</em> ability to protect your family in a violent attack and never fear any man ever again.  </p>  <p>  \t <strong style=\"\"> But time is short, and you must <em style=\"\">hurry</em>.</strong>  </p>  <p>  \t             I reserve the right to end this incredibly generous deal (and insanely <em style=\"\">low</em> price) at any time without warning.  </p>  <p>  \t             So if you're <em style=\"\">serious</em> about learning this, don't put it off or \"file it away\" for later.  </p>  <p>  \t           And don’t forget…  </p>  <p>  \t           With Udemy’s IRON-CLAD, 100% money back guarantee?  </p>  <p>  \t <strong style=\"\">There Is Simply No Way You </strong>  </p>  <p>  \t <strong style=\"\">Can Possibly Lose!</strong>  </p>  <p>  \t           Click the “Take This Course” button above and lets get to work.  </p>  <p>  \t <strong style=\"\">One more thing—it’s important! </strong>  </p>  <p>  \t           I’ve also included my completely “uncensored” STREET SAMURAI videos as well... with information our lawyers have told us we should remove to keep ourselves out of trouble.  </p>  <p>  \t           That means if you order <em style=\"\">today</em>, <strong style=\"\">you’ll get several <em style=\"\">additional</em> advanced “tricks” only a handful of people worldwide possess</strong>. And uncut and “uncensored” lesson are instantly available once you join the course.  </p>  <p>  \t           Click the “Take This Course” button above and lets get to work.  </p>", 
    "end_date": null, 
    "title": "Learn Close Combat Training: Military Hand-To-Hand Combat", 
    "price": "20.00", 
    "instructors": "Captain Chris Pizzo", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208726_966c_4.jpg", 
    "course_url": "https://www.udemy.com/closecombattraining/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-01T14:38:35Z"
}