{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t  The Course is comprised of the most effective self-defense and street fighting techniques that flow with our natural instincts.  </p>  <p>  \t  The course was developed by Matt &quot;Sensei&quot; Bryers - 3rd Degree Kobukai Ju-Jitsu Black Belt, 20+ Years Combatives Experience, Certified Hand-to-Hand Combat Instructor… and more.  Teaches Police Officers, SWAT Team Members, Corrections Officers, Security Professionals and “Every-Day Joes”  </p>  <p>  \t<strong>Here’s what you will learn:</strong>  </p>  <p>  \t  Simple – yet BRUTAL technique that is the Ultimate Fight Changer.  </p>  <p>  \t  This one technique will revolutionize the way you fight. It’s instinctual, natural and utterly brutal.  </p>  <p>  \t<strong>Hardcore Ballistic Striking Techniques </strong>  </p>  <p>  \t  These striking techniques go beyond throwing some lame haymakers that barely work. I’m going to teach you how to make your striking so effective that it’s almost too easy to end the fight  </p>  <p>  \t<strong>Standing Combat Jiu-Jitsu Techniques </strong>  </p>  <p>  \t  We all know that jiu-jitsu is one the most effective martial arts out there. It is the base martial art of military programs, police officer training and Mixed Martial Arts (UFC). If you need to fight and survive, you NEED to know to use Jiu-Jitsu. But don’t worry, I break it down for you and make it simple, effective and easy to learn.  </p>  <p>  \t<strong>Ground Combat Jiu-Jitsu Techniques </strong>  </p>  <p>  \t  In a real fight, going to the ground is dangerous, especially in a multiple opponent scenario. BUT – if you do end up there, you HAVE to know what to do! If not, you’re going to get your ass kicked or your face stomped in. I like my face – I’m sure you like yours too, there’s no reason for a face stomping. Learn how to fight off the ground, get back to your feet, and finish the fight.  </p>", 
    "end_date": null, 
    "title": "Learn a Combat Proven Fighting System: WCA Crash Course", 
    "price": "20.00", 
    "instructors": "Matthew Bryers", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325680_660a_2.jpg", 
    "course_url": "https://www.udemy.com/combat-proven-fighting-system/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T14:06:01Z"
}