{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>We live in uncertain times; where violence may indiscriminately smash into our lives at a minutes notice.  You need to be <em>prepared</em>, you need the <em>skills</em>, you need <em>training</em><em>! </em>The Krav Maga self defense material within this course is easy to learn and retain.  It was developed on the streets and perfected on the battlefield. Krav Maga is a hand to hand combat system that uses your bodies natural reactions as proven defenses, incorporating; common sense, awareness, fighting tactics, and much more.  The first 60 minutes of our course will open your eyes to the importance of using awareness and common objects, as your first line of defense; if you practice these on a regular basis and make them a part of your daily routine, it will save your life!</p>\n\n<p>The Krav Maga techniques and training drills you are about to learn are currently being used by <em>US law enforcement</em><em>, military personnel</em>, and Hollywood's biggest stars including;<em> Brad Pitt, Matt Damon, Angelina Jolie and Leonardo DiCaprio.</em></p>\n\n\n\n\n\n<p><strong>Remember: Once you take our course you can access these techniques anytime, anywhere and train on them for life!</strong></p>\n\n\n\n\n\n\n\n<p>Good luck with your training! </p>\n\n\n\n\n\n\n\n\n\n<p><strong>Course breakdown:</strong></p>\n\n\n\n\n\n\n\n<p>All course material is beginner to intermediate Krav Maga training.</p>\n\n\n\n\n\n\n\n<p>-<strong> Learn Defensive and Offensive Krav Maga techniques</strong> to defeat an attacker. This portion of the lecture teaches you the basics in a way that allows you to retain the information with out losing interest.</p>\n\n\n\n\n\n\n\n<p>- <strong>Learn to increase your level of awareness in every day life</strong> by learning fun drills and exercise that will allow you to identify and avoid a possible threat in any environment.</p>\n\n\n\n\n\n\n\n<p>- <strong>Learn how to use common objects as defensive tools</strong>. See how simple it is to train and use every day objects on your person and in your environment to defeat an attacker.</p>\n\n\n\n\n\n\n\n<p>- <strong>Learn basic Krav Maga striking and kicking</strong> that you can train on by yourself or with a training partner. The strikes and kicks we teach you are not fancy. They are effective and easy to use against any attacker.</p>\n\n\n\n\n\n\n\n<p>- <strong>Learn how to put everything you have learnt into pressure drills</strong> so that you can continue to challenge yourself physically and mentally in any environment.</p>\n\n\n\n\n\n<p><strong>Course Chapters:</strong></p>\n\n\n\n\n\n<p><strong>Your Natural Response to Danger </strong></p>\n\n\n\n\n\n\n\n<p>We will teach you Krav Maga self defense strategies and techniques that are based on the bodies natural reaction to danger. Why is this important? Because as human beings, it is easier to remember techniques based on instinct as apposed to complicated and hard to remember techniques when you experience the stress, shock and fear of an attack. We will also show you how to train on these techniques under extreme pressure.<strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Common Sense Fighting Techniques</strong></p>\n\n\n\n\n\n\n\n<p>We will teach you how to use common sense, instinct based blocks to defend a variety of punches and kicks. We will also show you how to use the striking techniques from the previous chapter  as explosive counter attacks with your self defense techniques. Defend, counter attack and get to a safe area.<br></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Common Sense Ground Fighting Techniques</strong></p>\n\n\n\n\n\n\n\n<p>Fights ALWAYS end up on the ground. Whether someone is attacking you or you trip during an attack, you MUST be able to function effectively on the ground. We will teach you how to fall properly, how to throw the same kicks and strikes from the ground as you learnt standing, how to get to your feet effectively and safely, how to defend common holds and how to deal with the disadvantages of being on your back, side or stomach. </p>\n\n\n\n\n\n\n\n\n\n<p><strong>Surviving Deadly Knife, Stick, and Gun Attacks</strong></p>\n\n\n\n\n\n\n\n<p>There is not a country on the planet that has not seen its fair share of violence from humans using weapons against each other. Guns, knives and clubbing weapons are a serious problem around the world. Although, it is not possible to just train on weapon defenses online, this course will open your eyes to a lot of things you never knew about dealing with and defending weapons.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>BONUS MATERIAL</strong><br></p>\n\n\n\n\n\n\n\n<p><strong>-</strong><strong>Stretching and Injury Prevention: </strong>Learn techniques that will prevent injury by using dynamic and static stretching by industry leading physical therapists.</p>\n\n\n\n\n\n\n\n<p><strong>-Defense Against an AK-47 Machine Gun: </strong>Get a taste of advanced training by learning to defend against a machine gun.</p>\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n<p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Learn how to save your life in 60 minutes using self defense", 
    "price": "45.00", 
    "instructors": "Ultimate Krav Maga", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41403_f4d3_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-save-your-life-in-60-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-13T00:03:25Z"
}