{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t        This course is a complete 101 for learning the art of boxing, we cover all aspects including the basic stance and footwork, punch techniques, defense, counter-attacks and basic to advanced attack combinations.  </p>  <p>  \t        At London Combat Club we train students from all different walks of life - our students want to study boxing for a variety of reasons including;  </p>  <p>  \t        - to learn self defense<br>  \t        - to get fitter and stronger<br>  \t        - to develop discipline and focus  </p>  <p>  \t        In this course we provide a detailed, step by step and progressive series of video tutorials, designed to get you moving like a boxer as quickly as possible - you&#039;ll carry these skills for life and instantly feel more confident knowing you can handle yourself.  </p>  <p>  \t        In each lecture we first explain the purpose of what we are about to show you and then demonstrate it, including multi-angle and slow motion replays so you can see the exact movements. We instruct a live student whilst correcting their technique, so you can see what to look out for when practising.  </p>  <p>  \t        The course is comprised of 14 sessions. You should take your time to really get to grips with each one and practise them over and over until it becomes habit.  </p>  <p>  \t        Go ahead and check out our free to watch introduction lesson - you won&#039;t look back!  </p>", 
    "end_date": null, 
    "title": "Learn the art of Boxing: A step by step and detailed guide", 
    "price": "30.00", 
    "instructors": "London Combat Club", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297750_5024.jpg", 
    "course_url": "https://www.udemy.com/guidetoboxing/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-10T14:52:49Z"
}