{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t      This course will teach you main things that you need to know when starting to learn Martial Arts. I provided an abundance of entertaining and informative videos that will go in detail on each topic that you will need to know. Virtually every lecture is accompanied by an instructional video. I will provide supplemental materials such as Power Point presentation with most of the videos for an easy review when you need it.  </p>  <p style=\"\">  \t  Completion of the course does not mean that you mastered it, I would strongly suggest going through the course multiple times and practicing every technique hundreds of times. As Bruce Lee said, &quot;I fear not the man who has practiced 10,000 kicks once, but I fear the man who has practiced one kick 10,000 times.&quot;  </p>  <p style=\"\">  \t      The structure of the course is fairly simple. I will start by explaining the points of a good stance. I will then show you some basic footwork that you should be practicing. Once you have a stance and the footwork down, we will then move on to basic punches. Once you have that down I will then introduce you to basic kicks. Lastly, I will show you two, in my opinion, most useful self defense techniques that you will be able to use in a street today! I will show you the major different ways of doing each technique so that your practice do not get dull. I will also show you common mistakes that people make and how to avoid them. So grab a pair of comfortable pants and let&#039;s get started!  </p>", 
    "end_date": null, 
    "title": "Martial Arts for Beginners", 
    "price": "20.00", 
    "instructors": "Martynas Karys", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/142014_f363_14.jpg", 
    "course_url": "https://www.udemy.com/martial-arts-basic/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-04T18:47:23Z"
}