{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t          In this course,<strong> I will teach you how to protect yourself</strong> and your loved ones from any empty-handed aggression. </p><p><strong>If you feel insecure in any way</strong>, are not a martial artist ( and are not trying to become one ), would consider yourself at a disadvantage should you need to engage in physical combat with a larger or aggressive opponent, <strong>this is THE self-defense course for you</strong>. It is especially well-fitted for women and kids, as strength is not a primary tool is this course, nor are speed or flexibility. I use <strong>easy to follow instructions</strong> to make everything<strong> very clear</strong>.  </p><p><strong>Included materials include videos and quizzes. </strong></p><p>The course should take about 2-6 months to complete. The course is structured in <strong>progressive topic-centered lessons</strong> at first, then moves into more complex situations to offer more advanced options. Everything is laid out very simply and clearly to <strong>maximize information retention </strong>and<strong> lesson effectiveness</strong>. </p><p>By the end of the course, you will be able to <strong>dodge</strong> any incoming punch or kick, <strong>free yourself</strong> from various grabs, <strong>target weak areas of the human body</strong>, and apply <strong>control techniques on larger and faster opponents, </strong>as well as <strong>punch, kick, apply basic locks </strong>and<strong> joint reversals, </strong>and get your opponent into submission if you have to. You will also have a strong knowledge of <strong>how to ensure maximum awareness at all times and never be taken off-guard</strong>. You will also learn to use everyday, commonly available items to improve your odds in a tricky situation. </p><p><strong>I have been teaching self-defense and martial-arts for over 20 years</strong>, and <strong>practicing for over 38 years</strong>. I rank 4th Dan black belt and above in 9 styles of combat-oriented martial arts schools, and currently teach non-professional, everyday folks from all walks of life, as well as <strong>police, personal security and army people</strong> at all levels of proficiency. </p><p>The content of this course, although<strong> easy to grasp for beginners</strong>, is the foundation to a system <strong>used by extremely result-oriented professionals over the world</strong>. </p><p>The course is<strong> 27 video lectures</strong> <strong>for close to 3 hours of video content </strong>and is <strong>constantly updated with new and revised lectures</strong> for maximum learning efficiency, so this course will never be outdated.</p>", 
    "end_date": null, 
    "title": "Ninja Self Defense for Peaceful People.", 
    "price": "20.00", 
    "instructors": "Chris Martins", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292998_9f44_3.jpg", 
    "course_url": "https://www.udemy.com/ninja-self-defense-for-peaceful-people/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-03T08:13:41Z"
}