{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>If you were attacked in an instance, would you be able to react decisively enough to stop the threat? <strong><em>Would you</em></strong> <em><strong>even know how to use your spray</strong></em><strong>? </strong>Who's to say that you wouldn't spray yourself by accident, hold it incorrectly and have it snatched away from you or knocked from your hand by an attacker? My guess is that you are not well-versed in the mechanics of utilizing pepper spray for self-defense. Otherwise you would not be here.<br><br><em><strong>So many people </strong><span></span></em><strong><em>lack the training necessary</em></strong> to properly deploy their spray, react to and effectively neutralize a threat. They make the mistake of treating their defense spray like a toy, when it is <strong><em>really a weapon</em></strong>. And like any weapon, it requires <strong><em>proper training</em></strong>.</p><p><strong><em>Without that training you might as well be walking around empty-handed</em></strong>, because that spray will not do you any good when you fumble to look for it in your purse, realize that you forgot to bring it with you or become paralyzed with fear when suddenly attacked. Your attacker is <strong>NOT</strong> going to wait for you to put up a defense, build up confidence or give you time to react to his or her predatory advances. You need to be <strong><em>ready for the fight before it even begins. </em></strong>And I will help show you how.<br></p><p>So what can you expect to learn in this class? <strong><em>Everything on pepper spray defense.</em></strong></p><p>I will teach you how to:</p><ul><li>Use the <strong><em>best non-lethal self-defense tool </em></strong>to protect yourself from harm.</li><li>Avoid common mistakes that put you in danger.</li><li>Prepare you for when your defense spray <strong><em>FAILS.</em></strong></li><li>Be cognizant of your surroundings, reaction time and how to escape the threat.</li><li><em>And so much more...</em></li></ul><p>If you use or are considering using pepper spray for self-defense you absolutely <strong>MUST </strong>take this course if you want to be thoroughly prepared. I will guide you through every step and personally answer any questions you may have regarding usage of defense sprays. As a personal safety expert and someone passionate about crime prevention, I will ensure that you are prepared for any future altercation requiring the use of a pepper spray.<br></p>", 
    "end_date": null, 
    "title": "Pepper Spray 101:  How to Protect Yourself at a Distance", 
    "price": "25.00", 
    "instructors": "Ulrich Faircloth", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702626_ac58_2.jpg", 
    "course_url": "https://www.udemy.com/oc-pepper-spray-course-defense-sprays-how-to-use-them/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T05:09:37Z"
}