{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "This is the course that all traditional martial art school owners and training group leaders should take if running a successful Dojo is a goal. This course is designed for those who understand that success is something much deeper than a profit and loss statement.<br style=\"\"><br style=\"\"><br style=\"\">In Running a Dojo, you will be provided with: <br style=\"\"><ul style=\"\"><li style=\"\"><strong style=\"\">First steps and Core Concepts</strong>: You&#039;re only as strong as your basics. In these instructional videos you will discover what sets the traditional martial art school business model from the modern model. This is mind blowing stuff that will change your paradigm!&nbsp; Get ready to build your Dojo without feeling as though you must sell out your integrity to pay the bills.</li><li style=\"\"><strong style=\"\">Crucial Documents</strong>: These are the &#039;<em style=\"\">absolute must have</em>&#039; files for administrative functions of a strong Dojo. As well, every document download has a training video to help you understand how to build and maximize systems into your Dojo program.&nbsp;</li><li style=\"\"><strong style=\"\">Running A Dojo Radio Archives</strong>: Download and listen to hours of training on building your traditional martial arts program. The topics are always new and updated weekly in crystal clear audio. <br style=\"\"></li><li style=\"\"><strong style=\"\">The Keeping it Real Sessions</strong>: 16 video modules taken from Adam Mitchell&#039;s 2010 program Keeping it Real. Hours of video training that will help you build a framework you&#039;ll be proud of for your Dojo and your students.&nbsp;</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">The Running A Dojo course will take roughly 3 months to complete, but new content will be added regularly in tandem with Adam Mitchell&#039;s Running A Dojo podcast and blog. As well, Adam Mitchell will be available to engage in topic discussions and brainstorming for your own initiatives and host a monthly live workshop for all members each month.</p><p style=\"\"><em style=\"\"><br style=\"\"></em></p><p style=\"\"><em style=\"\"></em></p><p style=\"\">OK, I sure didn’t do this to get on any VIP   list at the next martial arts trade show in Las Vegas. Infact, this   program is going to upset a few people. After spending 14 years   listening to business gurus, spending over $250,000 on consulting programs and high-dollar   seminars where I rubbed elbows with the most successful school owners in   the world, I’m convinced .. <strong style=\"\">The great majority of these self-titled martial arts business gurus don’t know the first thing about running a real Dojo</strong>. Period. To serve those trying to do it right, I created Running A Dojo to blow-the-lid off the nonsense the martial arts industry is feeding well intended Instructors hoping to offer the best resources for their students. <br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\">I&#039;m going to show you exactly how I   created a successful Dojo with hundreds of students from all over the   world by simply studying my martial arts more intently and keeping it real! <br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><em style=\"\">“Adam   is one of the most forward-thinking people in the martial arts    industry. I’ve seen with my own eyes as top-billed, big-name advisers in    the biz were influenced by Adam’s actions. While I believe he would do    the same in any business environment, I’m thrilled that he’s been so    helpful to me personally, and to the industry in which I work. I    always enjoy hearing his thoughts about what will happen next … and if    you hear those ideas, pay attention.”<strong style=\"\"> Mr. Peter Steeves, International Training Director of the Guardian Angels, and Martial Arts School Owner. Los Angeles</strong>.</em></p><br style=\"\"><p style=\"\"><img style=\" margin:5px; margin-left:0px; margin:5px;max-width:100%;\" src=\"http://training.runningadojo.com/images/editor_images/Guaranteed-seal.png\" alt=\"Guaranteed Seal\" height=\"134\" width=\"181\" align=\"left\">If you’re not totally   satisfied with everything I’ve created, I’m going to refund your   investment 100% AND you can keep all of the files I’ve provided. That’s a promise. There is absolutely no risk at all.    </p><p style=\"\">I truly look forward to working with you and helping your Dojo meet it’s success.</p>    <p style=\"\">Adam Mitchell</p>    <p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Running A Dojo", 
    "price": "35.00", 
    "instructors": "Adam Mitchell", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33844_a55a_5.jpg", 
    "course_url": "https://www.udemy.com/running-a-dojo/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-29T19:08:33Z"
}