{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you prepared? For The Top 10 Unarmed and Weapon Attacks You Will Encounter On The street...</p>\n\n<p>Discover techniques that work where there are no rules and your attackers never play fair – on the real streets…</p>\n\n<p>Too many variables occur on the street that don’t exist in the ring. Eg. Weapons, ambushes, your surroundings, the time of day etc. Learn how to act quickly and effectively in every situation.</p>\n\n<p>This Military grade jiu jitsu system is created to work in real life situations, unlike MMA, UFC, Mixed Martial Arts, which is entertaining to watch but will get you killed in a street fight.</p>\n\n<p>“While the general public was taught basic self defense and sport style Brazilian Jiu-jitsu, certainelite police and military personel were taught a “military grade” version of the system. Little known outside of the few academies that specialized in it, “Military Grade” BJJ is truly the most complete and effective system of self defense known to man.</p>\n\n<p>This lethal street version of Brazilian jiu-jitsu is hybridized with Combat Sambo (the once closely guarded Russian military hand to hand system of the old Soviet union) This system is used by Robert LeRuyet personally in real life self-defense encounters and is used to train his students who include soldiers of the Afghan war and the Canadian version of the Navy Seals.”</p>", 
    "end_date": null, 
    "title": "Self Defense For Beginners - Jiu Jitsu Martial Arts", 
    "price": "20.00", 
    "instructors": "Wing Chun Kid", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/852548_1485_4.jpg", 
    "course_url": "https://www.udemy.com/wing-chun-for-beginners-level-6-learn-martial-arts-kung-fu/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-18T01:06:18Z"
}