{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Self defense so simple that  anyone can master it in a fraction of the time of learning a martial art.</strong>  </p>  <p>  \t      The <strong style=\"\">Reality Check</strong> Course you’re about to unlock shows you exactly how to defend yourself in 9 common situations using SDTS Combatives.  </p>  <p>  \t<strong style=\"\">The program is a 3-step process:</strong> First we show you the attack, next we give you the solution and finally we show you how to apply that solution to the attack.  </p>  <p>  \t      To some martial arts “experts” the methods might appear crude, sloppy or unpolished. It’s most likely those experts have never had to use their skills outside the gym against a determined, capable enemy.  </p>  <p>  \t      Because in a real fight your adrenaline kicks in and all you can execute are large simple movements. Most of what you learn in a dojo or gym is designed for a controlled environment with rules designed for safety or governed by a style. While class may be demanding you’re not in fear for your life.  </p>  <p>  \t      You should note: the people who appear in <strong style=\"\">Reality Check</strong> are ALL accomplished martial artists in a variety of arts, yet they still choose SDTS Combatives when it comes to self defense.  </p>  <p>  \t<strong style=\"\">If you are willing to do what is necessary to survive and win, <br style=\"\">  \t       then you’ve come to the right place.</strong>  </p>  <p>  \t      Before we continue, I apologize for the drama, but I need to be completely honest with you – this is not a martial art, this is a tactical response to violence. These methods are a result of over a century of research based on actual warfare and are designed to save lives.  </p>  <p>  \t<strong style=\"\">This is not what you would expect to see as “self defense.”</strong>  </p>  <p>  \t      What you’re about to discover is not a sport or an art, it is a system invented out of necessity to save the lives of cops and soldiers in the worst environments in the world. Over the years we have seen these tactics and training work time and time again.  </p>  <p>  \t      This system is not complicated, fancy or even pretty – it’s simple, brutal but above all, it works when you’re in in fight or flight mode. Remember…  </p>  <p>  \t<strong style=\"\">“There’s no Relaxing in Combat!”</strong>  </p>  <p>  \t      Don’t be fooled – there is no “relaxing” in combat. Even the most seasoned operator or cop gets goes into “fight or flight” when they go through that door, or come in contact with the enemy. There’s just no way around it, it’s embedded in your DNA because that’s how evolution designed you to deal with life threatening situations.  </p>  <p>  \t<strong style=\"\">Your instincts tell you: eat when you’re hungry; get shelter when you’re cold, run if you can and fight if you have to. </strong>  </p>  <p>  \t      Your challenge is knowing how to channel your natural instinct to survive and protect into action and that’s exactly what we do.  </p>  <p>  \t<strong style=\"\">We call our program, the Self Defense Training System</strong><strong style=\"\">™ or simply SDTS Combatives.</strong><strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Martial arts are for personal development; SDTS Combatives are for survival.  </strong>  </p>  <p>  \t      We know what works, we have been in some of the worst places on the planet, from Kabul, Afghanistan to Camden, NJ – our business is violence and helping you protect yourself against predators that threaten your way of life is what we do.  </p>  <p>  \t<strong style=\"\">Let’s put it this way, if fancy, complicated moves worked in real life, <br style=\"\">  \t       we would be teaching them.</strong>  </p>  <p>  \t      If the answer was in another system, we would be telling you about it. But the truth is, this type of self defense has the highest percentage of success and it’s the easiest to learn and you can’t find this at your local MMA, Karate or Krav Maga School.  </p>  <p>  \t<strong style=\"\"><em style=\"\">I have a confession to make…</em></strong>  </p>  <p>  \t<strong style=\"\">I didn’t learn SDTS Combatives in a dojo…</strong>  </p>  <p>  \t      In fact I learned it in the basement of an old church through a friend of mine who was on the SWAT team in Paramus, NJ. The only reason I gained access to this training was because I was already an accomplished martial artist who was exposed to real violence when I worked security and body guarding.  </p>  <p>  \t      As a kid I got into a lot of fights, usually defending a smaller friend or standing up to the school bully. It was easy because I had an unfair advantage: I wrestled and my grandfather taught me how to box a little bit.  </p>  <p>  \t<strong style=\"\">A double leg takedown and a few punches was all I needed to win.</strong>  </p>  <p>  \t      I grew up watching Kung Fu and Bruce Lee and like most people, I thought martial arts were going to make me into a “stone cold”, indestructible and supernatural master dispensing thugs with a flick of a wrist.  </p>  <p>  \t      Over the years I studied Tae Kwon Do, learning self defense counters, forms and point fighting. Later I started kickboxing because point sparring wasn’t <em style=\"\">real </em>enough.  </p>  <p>  \t      Next I studied Aiki Jujutsu because Steven Segal (who did Aikido) looked cool as hell in “Above the Law.” I learned joint locks, strangles and all kinds of nasty stuff to twist up my training partner, make him whimper and bring his arm to the brink of snapping like a pencil. It was cool and I felt like a samurai bad ass.  </p>  <p>  \t      In 1990 Krav Maga had started becoming very popular, so I checked a couple of the original schools out, funny thing – they all did the same stuff we were doing in Tae Kwon Do, so I figured I was on the right path…but I wasn’t.  </p>  <p>  \t      In college I was the wrestler “karate guy”, the deadliest man on campus. Truth be told, I didn’t feel that way because every time I got into a fight I would shoot a double leg take down and just start punching until the guy submitted.  </p>  <p>  \t      That was fine until one night I was separated from my friends against more than two or three guys.<strong style=\"\"> I don’t know exactly how many because I blacked out. </strong>  </p>  <p>  \t      The last thing I remember was taking a guy down, climbing on top of him to do the old “ground and pound”. Unfortunately, his friends didn’t like it so they joined in. I got hit in the head with maybe a bottle and I got kicked and stomped. Some how through the grace of God, I got to my feet and made it to my buddies on the other side of the bar.  </p>  <p>  \t      I was lucky; I only suffered a concussion, broken rib and a laceration on my scalp that needed a few stiches.  </p>  <p>  \t<strong style=\"\">At that point I realized that after all of my training, <br style=\"\">  \t       all of those years, all of that hard work and trophies;<br style=\"\">  \t       I was still the kid in the schoolyard!</strong>  </p>  <p>  \t      As fate would have it, a few months later my SWAT buddy arranged for me to meet the man who would turn out to be my self defense mentor and Godfather to my daughter, Carl Cestari, one of Black Belt Magazine’s 20 toughest men of all time.  </p>  <p>  \t      He was teaching “World War II Combatives” only he called it <em style=\"\">Combatu Defendu. </em>  </p>  <p>  \t      Now I have to tell you, this was like nothing I had ever seen before or since.  </p>  <p>  \t      No fighting stances.  </p>  <p>  \t      No hand wraps or gloves.  </p>  <p>  \t      No waiting for him to grab me or flash a weapon.  </p>  <p>  \t      …None of that stuff!  </p>  <p>  \t      Seriously, all the fights I’ve seen outside of the playground never started with two guys putting their hands up.  </p>  <p>  \t<strong style=\"\">In a real fight, the posers push <br style=\"\">  \t       and the real bad asses just start hitting (or worse) <br style=\"\">  \t       –usually right after they tell you “they don’t want to fight.”</strong>  </p>  <p>  \t      Either way, real fights don’t start like a boxing match. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">That was my FIRST revelation.</strong>  </p>  <p>  \t<strong style=\"\">My second revelation was how simple it was.</strong><br style=\"\">  \t       It didn’t require a ton of power, skill or even endurance to execute the techniques.  </p>  <p>  \t<strong style=\"\">My third revelation was how every situation can be broken down into two primary factors of position and distance. Where he is in relation to you and how the two of you are positioned:</strong>  </p>  <ul style=\"\">  \t<strong style=\"\">  \t<p>  \t\t      ·Both Standing: Head up, to the left, to the right or behind.  \t</p>  \t<p>  \t\t      ·Standing and Prone: Either I’m standing; he’s down or vice versa. <br style=\"\">  \t\t       He’s either at kick distance or stomp distance.  \t</p>  \t<p>  \t\t      ·Ground: he’s on top, and I’m in the guard or he’s in the mount or it’s the other way around. I’m on top in his guard or my mount. (the half guard doesn’t apply tactically – you do the same techniques in the SDTS)  \t</p>  \t</strong>  \t<p>  \t\t<strong style=\"\"></strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\"></strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\"></strong>  \t</p>  </ul>  <p>  \t<strong style=\"\"><strong style=\"\">My forth revelation was how you could take a hand full of simple techniques and apply them to any self defense scenario. What we do on our feet, we do on the ground (yes it’s that simple).</strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\"><strong style=\"\">My fifth revelation was how the core skill techniques could be adapted to using an edged weapon, an impact weapon and even a firearm. No need to “relearn” different body mechanics, whether you have a knife, club, gun or nothing at all it your hands, you use the same motor skill set. </strong></strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\"><strong style=\"\"><strong style=\"\">My sixth revelation was how ANYONE (and I mean anyone) could do it.</strong> <br style=\"\">  \t       Trying to teach a middle-aged accountant whose 50 pounds over weight an armbar is impossible, but I can sure as heck teach him a hand yoke that could knock a career criminal to his knees. </strong></strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">I have to tell you, I felt a little embarrassed that I didn’t think of this stuff myself, I mean it was just common sense. This stuff was exactly what I thought martial arts should be…only it was much, much simpler.</strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">From that point on I dedicated my life to the “truth about self defense”. The problem is most people’s experience with real violence happens in the ring, the dojo or on TV.  </strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\"><strong style=\"\">MOST “experts” have NEVER BEEN IN A REAL FIGHT.</strong></strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">I’ve been in the martial arts and self defense world for over 30 years and I have to tell you, most so called experts and black belts couldn’t fight their way out of a paper bag. We call them “paper tigers” hiding behind their paper certificates, belts and sports. You know who you are. </strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">Don’t get me wrong; I have met some very TOUGH (VERY TOUGH) fighters who could apply their skills in the street. But I also met a lot of guys who were hell in the ring and the gym but folded like a cheap tent in the street.</strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\"><strong style=\"\">At the end of the day it’s not about what they can do, <br style=\"\">  \t       it’s about what you can do.</strong></strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">You don’t box to become the next Mike Tyson and you don’t do MMA to try to be the next Chuck Liddell. These are professional athletes who are revered because they are EXCEPTIONAL and SPECIAL. Trying to do what they do is like trying to run like Usain Bolt. </strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">The reason I love teaching SDTS Combatives is because it can make a weak person good, an average person better and an exceptional person incredible in a very short amount of time. </strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\"><strong style=\"\">SDST Combatives also gives the weak person a fighting chance <br style=\"\">  \t       against the exceptional person.</strong></strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">So enjoy the REALITY CHECK program, we’re obviously NOT actors…but I assume you’re not here for the acting. </strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">Train Honestly, </strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">Damian Ross</strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">Founder, The Self Defense Company</strong></strong>  </p>", 
    "end_date": null, 
    "title": "Self Defense for 9 Common Attacks", 
    "price": "20.00", 
    "instructors": "Damian Ross", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417338_826b_4.jpg", 
    "course_url": "https://www.udemy.com/reality-check-sdts-combatives-self-defense/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T14:39:48Z"
}