{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Self Defense Made <em style=\"\"><u style=\"\">REAL</u></em> Easy by Coach David Alexander</strong>  </p>  <p style=\"\">  \t<strong style=\"\">The Fastest to Learn and the Most Effective<br style=\"\">  \t     Self Defense System in the World!</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">“THE ONLY SELF DEFENSE LESSON YOU’LL EVER NEED!”</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\">The best self defense course on the internet.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Easy to Learn and Apply the same day if necessary - Gain Massive Confidence – Protect Your Family</strong>  </p>  <p style=\"\">  \t<em style=\"\">“Very easy to learn.  I am confident that I could defend myself or my family and it only took a couple of hours to learn”  Cindy A.</em>  </p>  <p style=\"\">  \t<em style=\"\">“David thank goodness I found you for your B.E.T. System.  This is the best self defense I have ever seen…”  </em>Michael M.  </p>  <p style=\"\">  \t<em style=\"\">“The information in this system is going to blow you away.  You will never look at self defense the same way ever again!”  Liz W. </em>  </p>  <p style=\"\">  \t<em style=\"\">“I have never seen anything like this!  I have studied martial arts for self defense my entire life and now feel like it was a waste of time.  I learned more in this 1 class about “real self defense” then all my martial arts and military training combined.  All I have to say is “WOW!”  Brian S.</em>  </p>  <p style=\"\">  \t  Hi, my name is Coach David Alexander and I would like to introduce you to my <em style=\"\"><u style=\"\">Self Defense Made “REAL” Easy</u></em>—online training course, the only self defense course you will ever have to take.  In this course you’re going to learn my B.E.T. “Target Based” Self Defense System which is the fastest to learn and most effective self defense system in the world and has been taught to over 60,000 people in 60 countries and counting.  </p>  <p style=\"\">  \t  Every once in a great while there is a leap forward in thinking…a paradigm shift…this is my self defense system.  With this system you will not need years of study and training to learn to defend yourself or your family from violence…I am going to teach you in just this one course.  One of my students said that my system is a “short cut” to a lifetime of self defense instruction.  </p>  <p style=\"\">  \t   In this course you will learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to defeat an attacker in less than 4 seconds, </li>  \t<li style=\"\">How to defeat multiple attackers with “weapons”, </li>  \t<li style=\"\">How to disarm your attacker if they come at you with a knife, gun or bat, </li>  \t<li style=\"\">How to practice what you’ve learned without training partners, </li>  \t<li style=\"\">...and much, much more. </li>  </ul>  <p style=\"\">  \t  I will also bust several martial arts myths and expose some Hollywood self defense B.S. By the way, I use adult language and situations, and graphic video clips throughout the course to make sure you understand the severity of dealing with <u style=\"\">REAL</u> violence.  </p>  <p style=\"\">  \t  Most people don’t have 20 years to learn a martial art in order to defend themselves and their families, I can teach you in just this one course. You’re going to be blown away by what you learn.  </p>  <p style=\"\">  \t<em style=\"\">“I was blown away by what I learned…I could not believe that self defense could be so easy. I learned how to protect myself and family in just a couple hours instead of taking years of typical martial arts classes….not to mention how much money I saved in the process. Thanks Coach!” Mark D.</em>  </p>  <p style=\"\">  \t  I can pretty much guarantee that you have never seen a self defense system like mine. There are only a few people in the world that know and can teach this type of self defense and their programs are very, very expensive because you only have to learn it once. My system is for the busy executive, retiree, parent or young adult that wants to learn how to defend themselves and their families from violence right away and would like to be able to learn it and apply it the same day if necessary. My system is NOT a martial art. There aren&#039;t any colored belts, uniforms or rituals in this system. There aren&#039;t any tournaments or trophies to win. This is just REAL self defense for the REAL world, which is why I named this course <em style=\"\"><u style=\"\">Self Defense Made “REAL” Easy</u></em>.  </p>  <p style=\"\">  \t  It doesn&#039;t matter if you’re young, old or out of shape. My system can help you defend your life or the lives of your family from a violent attack and it can all be learned in just this one course…no other training is necessary. You will not be disappointed.  </p>  <p style=\"\">  \t  My system does not teach you hard to remember techniques, blocks, kicks or punches, it just teaches you simple gross motor movements, anyone can learn and master in a very short period of time, combined with specific targets that will cause your attacker to react in a certain and predictable way. This is so simple even a child could use it, even though this is definitely not for children to watch.  </p>  <p style=\"\">  \t  The overwhelming amount of positive reviews I have received from students just like you is a great feeling. When you start this course, I will now consider you one of my students, I love my students and will do anything in my power to prepare you and your family to survive a violent attack. I am so proud of you for taking charge of your life and purchasing this course. I cannot wait to hear what you think. This is Coach David Alexander your online self defense coach.  </p>", 
    "end_date": null, 
    "title": "Self Defense Made \"Real\" Easy", 
    "price": "45.00", 
    "instructors": "David Alexander", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375070_dd0b_4.jpg", 
    "course_url": "https://www.udemy.com/self-defense-made-real-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-21T17:16:39Z"
}