{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Welcome to <strong style=\"\">Sexual Harassment Prevention for Employees </strong>from LearnSmart.</p><p style=\"\">Sexual harassment is a constant presence in America&#039;s workplaces and is a form of employment discrimination prohibited under Title VII of the Civil Rights Act of 1964. Title VII prohibits employment discrimination based on race, color, religion, sex, and national origin. To prevent harassment, we need to understand it. For many people, “sexual harassment&quot; is an emotionally-charged topic loaded with confusion and uncertainty. </p><p style=\"\">The topics that will be covered in this course will provide any employee a comprehensive explanation of what sexual harassment, how you to recognize sexual harassment in todays work environment, what to do when it happens, and how protect yourself employees from this type of behavior.</p><p style=\"\">This course is designed to meet<strong style=\"\"> California State Compliant Standards (AB1825 &amp; AB2053)</strong>. Whether you live or work in California, or have Business relationships with companies in California this course includes specific references to California laws regarding Sexual Harassment training.</p><p style=\"\"><strong style=\"\">Course Breakdown:</strong></p><p style=\"\"><strong style=\"\">Section 1:</strong> In the pre-assessment quiz you&#039;ll face questions that test your current workplace knowledge, get to know your strengths and weaknesses.</p><p style=\"\"><strong style=\"\">Section 2: </strong>Define sexual harassment and the concepts in sexual harassment and delve into what abusive </p><ul style=\"\"></ul><p style=\"\"><strong style=\"\">Section 3</strong>: Be able to recognize the different types of harassing behaviors and understand the motivations behind these behaviors</p><p style=\"\"><strong style=\"\">Section 4: </strong> Understand harassment in todays workplace by reviewing topics that include the rise in male cases of sexual harassment, and the rise in technology and the workplace and how this can also be applied for sexual harassment. Apply the right steps to take when/if online harassment is experienced and develop a positive work environment.</p><p style=\"\"><strong style=\"\">Section 5:</strong> Final Exam</p><p style=\"\">The content in this course comes from <strong style=\"\">California State Compliant Standards (AB1825 &amp; AB2053)</strong>. </p><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Recommendations:</strong></p><p style=\"\">Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul style=\"\"><li style=\"\"><em style=\"\">Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- I.A.</em></li><li style=\"\"><em style=\"\">This course is of high quality - This course will explain you every concept from scratch. The instructor is highly engaging and highly motivating. Can&#039;t be better. Thank you -- S.T.</em></li><li style=\"\"><em style=\"\">Thanks for LearnSmart LLC. Very clear explanation, easy to understand, delivered in very slow and deliberate manner -- R.B.</em></li></ul>", 
    "end_date": null, 
    "title": "Sexual Harassment Prevention for Employees", 
    "price": "50.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495414_6866_2.jpg", 
    "course_url": "https://www.udemy.com/sexual-harassment-prevention-for-employees-ca/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T20:45:11Z"
}