{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to <strong>Sexual Harassment Prevention for Managers </strong>from LearnSmart.</p><p>Sexual harassment is a constant presence in America's workplaces. To prevent harassment, we need to understand it. For many people, “sexual harassment\" is an emotionally-charged topic loaded with confusion and uncertainty. </p><p>This course is designed to provide a comprehensive explanation of what sexual harassment is, how it can occur in the workplace, current legal positions, and how management can maintain a harassment-free workplace. </p><p>Some of the topics that will be covered in this course include: behaviors that constitute sexual harassment, the different types of harassment including abusive conduct, what constitutes a hostile work environment, and how to handle complaints.  </p><p>This course is designed to meet<strong> California State Compliant Standards (AB1825 &amp; AB2053)</strong>. Whether you live or work in California, or have Business relationships with companies in California this course includes specific references to California laws regarding Sexual Harassment training</p><p><strong><span>Coures Breakdown</span>:</strong></p><p><strong>Section 1</strong>: In the pre-assessment quiz you'll face questions that test your current workplace knowledge, get to know your strengths and weaknesses.</p><p><strong>Sections 2-4</strong>: Introduce yourself to what Workplace Harassment is and start to learn some key indicators of Sexual Harassment. Be able to define Sexual Harassment</p><p><strong>Section 5</strong>: Focus the legal issues implications that Sexual Harassment brings and how to properly react to it. </p><p><strong>Section 6</strong>: Be able to recognize the different types of harassing behaviors and understand the motivations behind these behaviors</p><p><strong>Sections 7</strong>: Prepare yourself with learning what happens after a sexual harassment accusation occurs. Know the best way to handle is and the types of retaliation.</p><p><strong>Sections 8</strong>: Understand how and why discrimination is a huge factor in harassment and see learn by going through case examples.</p><p><strong>Sections 9</strong>: Learn what you can do as a manager to help prevent and discourage harassment. Be able to set a good example and take action as a responsible manager so that your employees can follow your lead.</p><p><strong>Sections 10</strong>: Delve into the negative effects along with other other costs of sexual harassment. Undrestand the present and future impact that harassment can bring.</p><p><strong>Sections 11</strong>: Review the prevention and investigation policies and complaint procedures to ensure that you take the right steps as a manager.</p><p><strong>Section 12</strong>: Final Exam</p><p>The content in this course comes from <strong>California State Compliant Standards (AB1825 &amp; AB2053)</strong>.</p><p><strong>Recommendations</strong>:</p><p>Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- I.A.</em></li><li><em>This course is of high quality - This course will explain you every concept from scratch. The instructor is highly engaging and highly motivating. Can't be better. Thank you -- S.T.</em></li><li><em>Thanks for LearnSmart LLC. Very clear explanation, easy to understand, delivered in very slow and deliberate manner -- R.B.</em></li></ul>", 
    "end_date": null, 
    "title": "Sexual Harassment Prevention for Managers", 
    "price": "50.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494286_3f89_2.jpg", 
    "course_url": "https://www.udemy.com/sexual-harassment-prevention-for-managers-ca/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T15:52:38Z"
}