{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Welcome to “Strike and Block Like a Black Belt\"!</p><p><strong>This course will help take your striking and blocking skills to a whole new level.</strong></p><p><em>Are you a Martial Artist who is interested in improving your traditional blocking and striking abilities?</em></p><p><em>Are you amazed by the incredible power and speed that some Martial Artists have?</em></p><p><em>Do you struggle with the certain striking and blocking techniques in your training?</em></p><p><em>Are you a Martial Arts professional who is looking for an innovative way to help your students?</em></p><p>Well, if you answered <strong><em>YES</em></strong> to any of the above questions this is the course for you!</p><p>As a Taekwondo practitioner for over 30 years and teaching for the majority of that time I love teaching Martial Arts. My name is Master Chris Berlow. I've had my own school for almost two decades and have helped both adults and children reach their full potential in and out of their training. I'm extremely passionate about giving my students a deeper understanding of the techniques. Nothing inspires me more than helping students develop the intricate details of the traditional techniques.</p><p>Taekwondo is known for its dynamic and powerful strikes and blocks and we're going to share those secrets with you!</p><p>By the end of this course you'll definitely be moving like a <strong>Black Belt</strong>! In this program we'll break down foundational strikes and blocks that are practiced by many practitioners of different Martial Arts throughout the world.</p><p>This course will take your kicking to a whole new level. Guaranteed!</p><p><strong>Content and Overview</strong></p><p>First thing you need to know is that there is no \"FLUFF\" here! We get right to the point! All video's are high def and professionally produced to help you \"Strike and Block like a Black Belt\" before you know it.</p><p>By the end of this course you'll learn how to successfully execute and understand the intricate details of the following blocking techniques:<br></p><ul><li>Low Block</li><li>High Block</li><li>Double Arm Block</li><li>Outside to Inside Block</li><li>Side Block </li><li>Open Knife Low Block</li><li>Open Knife Hand Middle Block</li></ul><p> You'll also learn how to successfully execute and understand the intricate details of the following striking techniques:<br></p><ul><li>Middle and High Punch</li><li>Open Knife Chop and Spear</li><li>Hammer Fist and Back Fist</li><li>Palm Heel Strike<span></span></li></ul><p>As well as more advanced Blocking Techniques such as:</p><ul><li>Double handed techniques</li><li>Backing up techniques</li></ul><p>We will also spend time on developing proper execution of:</p><ul><li>Horse Stance</li><li>Front Stance</li><li>Back Stance</li></ul><p>Each technique covered in this course will be broken down <em>lesson by lesson</em> to build upon each other so that you can develop your strikes and blocks in a systematic way. After each lesson there is a synopsis of the key points as well as exercises to practice and tips to remember.</p><p>The program starts with proper hand positioning. In order to execute the techniques effectively you must maintain the tight hand on each  step.</p><p>All the techniques are presented in multiple directions for different perspectives as well as detailed steps in learning the techniques.  There is also special section for practical application at the end of each technique.</p><p><strong>Success Tip:</strong> The most important tip that will help you benefit from this course is to never go on to the next lesson until you feel comfortable and confident with the previous one. All of the lessons build upon each other and the success of your blocks and strikes will depend on your understanding of the previous step.</p><p>All the lessons in “Strike and Block Like a Black Belt\" are instructed by Master Chris Berlow. Master Berlow is an avid Martial Arts practitioner and instructor, an outdoor enthusiast, author, co-author and entrepreneur. All HD videos were filmed and edited by Offir Kilion. Mr. Kilion is a graphic artist, photographer and videographer. In addition, he owns and operates a successful graphic design company that offers the finest services available.</p><p>Together, they teamed up to bring an array of online programs to students all over the world.</p><p>OK. Enough talk and it's time for action!</p><p>Register today and let's get you to <strong>“Strike and Block Like a Black Belt\"!</strong></p>", 
    "end_date": null, 
    "title": "Strike And Block Like A Black Belt", 
    "price": "50.00", 
    "instructors": "Inspired Online Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780098_a0d9.jpg", 
    "course_url": "https://www.udemy.com/strike-and-block-like-a-black-belt/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T16:25:30Z"
}