{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong><em><em><em><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></em></em></em></strong><br></p>\n\n<p><strong>Your Family Isn't Ready For A Terrorist Attack, Hurricane, Flood, or Tornado ! Will They Survive ? If The Government Collapsed Tomorrow Can You Feed &amp; Protect Them?</strong></p>\n\n\n\n\n\n<p><strong>Will They Die Because You're Not Preppered ?</strong></p>\n\n\n\n\n\n<p>More and more people these days are taking an interest in survival, whether it is inspired by one of their favorite TV shows or a genuine desire to be prepared for a wide variety of man-made and natural disasters or emergency situations or simply just want to test your limits as a human being. It doesn't matter, what really matters is that you have a desire to learn the skills of survival and preparedness.. <strong>30 Day 100% Risk Free Offer!</strong></p>\n\n\n\n\n\n<p><strong>Think about these things for a minute ...</strong></p>\n\n\n\n\n\n<ul><li>What would you do if there was a terrorist attack that caused mass chaos and panic, and all the stores and places of food were closed? Do you want to be the one that is begging your neighbors, friends, or family for help? Do you want to be shipped off to a FEMA “camp?\"</li><li>Could you provide for your family if severe weather like hurricanes, snowstorms or a flood caused your area to go into a panic -- buying up everything off of stores and creating shortages? What if the stores were empty for weeks… or months?</li><li>Could you protect your family if there were massive power outages or rolling blackouts or brownouts -- disrupting electricity and making it nearly impossible to get food from stores or provide heat or energy in your home?</li><li>What would happen if the road system was destroyed by floods or other natural disasters in your area? Could you survive without food or other essentials for weeks?</li><li>Could you protect and provide for your family if an earthquake hit and the area was devastated?</li></ul>\n\n\n\n\n\n<p>Thanks  to the recent popularity of survivalist reality shows, many people  receive the mistaken impression that learning how to survive, and having  the proper survival and/or emergency equipment is going to be rather  expensive. </p>\n\n\n\n\n\n<p><strong><em>Give yourself a fresh start by enrolling in this life-changing course now. Every moment you delay, you lose out. Simple as that.</em></strong></p>\n\n\n\n\n\n<p><strong>“WARNING: Your Survival Could Depend On Your Next Choice\"</strong></p>\n\n\n\n\n\n<p>They mistakenly believe that in order to survive. They are  going to need the latest and greatest in technologically advanced gear  such as GPS tracking systems, gourmet dehydrated meals, fancy  spring-loaded tents and portable air conditioning systems (yes, they  have those). </p>\n\n\n\n\n\n<p>However, none of these technologically advanced pieces of  survival equipment are absolutely necessary to survive. Yet they may  look cool in the box, and they may do 1000 things (except for that one  thing. You really needed to do right now) yes they are nice and  convenient, but they are overly priced at overly unnecessary.</p>\n\n\n\n\n\n<p> A survival  situation, should be thought of in terms of a camping trip with your  dad, brother, uncle, grandpa or Boy Scout troop that you took. </p>\n\n\n\n\n\n<p>Nothing is kept secret - I reveal all I know ... and as I test even more\n things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>\n\n\n\n\n\n<p>\n  \t                                                                     \n                                                           As well as \nthe Udemy 30 day guarantee, you have my personal promise that you will \nbe wowed and delighted by what you'll learn in the next 3 to 4 hours ...\n and <strong>you'll be kicking yourself if you already had this Udemy course</strong> </p>\n\n\n\n\n\n<p>When you  were younger, you may not have had all of the latest and greatest  survival and/or camping technology. But with little know-how seminar  will grease and a few special tricks. You not only manage to survive,  but you had fun doing it.</p>\n\n\n\n\n\n<p><strong>Here's Exactly What YOU Get Inside The Thrifty Prepper Survival Course:</strong></p>\n\n\n\n\n\n<ol><li>How to navigate using a magnetic compass and topography<strong> (landmarks and other terrain features)</strong> as well as other old-school survival techniques.</li><li>How to make proper blood budget friendly dietary choices <strong>without breaking the bank</strong> buying name brand dehydrated survival food.</li><li>How a <strong>needle and thread can be worth their weight in gold</strong>. When it comes to making small repairs in clothing, shelter, and even traps and fishing nets.</li><li>How to make and <strong>use simple traps and weapons such as snares, fishing spears and blow guns,</strong> to supplement your existing food supply.</li><li>How to find the best sleeping bag and shelter for your environment while still <strong>saving money.</strong></li><li>How to construct simple, primitive shelters using basic natural and man-made materials to keep you out of the elements.</li><li>How to <strong>purify water, simply, quickly and effectively</strong>.</li><li>How to start a fire using centuries-old tried and true methods when you really need the heat.</li></ol>\n\n\n\n\n\n<p>This  class will bring you back to the days of those long-ago camping trips  and teach you how to survive using analog tools in a digital world. The  things you will learn in this class will be very budget friendly 110%  reliable and effective not to mention easy to learn and remember.</p>\n\n\n\n\n\n<p><strong>Click the \"Take This Course\" button, on the top right because every hour you delay is jeopardizing not only your Safety but the Safety of Those You love!!!...Scroll up and Enroll Now!</strong></p>\n\n\n\n\n\n<p> So  that should you ever need to put these skills to use in a practical  situation. You will have no doubt whatsoever that you will not only deal  to survive but thrive in whatever emergency situation you find yourself  in.  </p>\n\n\n\n\n\n<p>P.S. We're living in some of the craziest times in history and many experts agree that it's not a matter of “if\" but “when\" you will face an emergency that is beyond what you and your family have prepared for. There's a famous truism among instructors getting soldiers ready for war.<em>“When the bullets start flying, you WON'T rise to the occasion. You will perform half as well as you did during your best training.\"</em></p>\n\n\n\n\n\n<p><strong>As With All My Courses:</strong></p>\n\n\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently <strong>$25</strong>, but will next increase to <strong>$497</strong></li><li>You have unlimited lifetime access at no extra costs, ever</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li><li><strong>30 Day 100% Risk Free Offer!</strong></li></ul>", 
    "end_date": null, 
    "title": "Survival Guide: When Shit Hits the Fan (SHTF) Preparedness", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266788_2f0f_2.jpg", 
    "course_url": "https://www.udemy.com/prepping-on-a-budget/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T20:32:36Z"
}