{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t    Jinenkan Dōjōchō, Adam Mitchell and 5th degree Black Belt, details the methods of training and conditioning for how he teaches Jissen Kobudō, the realistic classical fighting arts of Japan. Mr. Mitchell is a personal student of Lt. Col. (ret.) Fumio Manaka, Kanchō of the International <a href=\"http://www.jinenkan.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Jinenkan</a> organization.  </p>  <p style=\"\">  \t    The goal of this course is to help you develop and continually refine your skills in Taijutsu. Whether you are a student of the Koryū, Jūjutsu, Ninjutsu, Karate, Aikido or any style of art, this course introduce you to new techniques and principles.  </p>  <p style=\"\">  \t    All of the video lessons are professionally recorded and edited with high quality narration, multiple angles and slow motion repeats.  </p>  <p style=\"\">  \t    In the first sections, you will learn protocol, posture, conditioning, striking basics, blocking basics, kicking and receiving kicks as well as traditional training patterns  </p>  <p style=\"\">  \t    In the following sections, you will learn methods of receiving takedowns, evading and countering attacks with break-fall and rolling. The characteristic body movements of <em style=\"\">taihenjutsu</em> are covered in detail. Students will then be taken through the takedowns and reversal exercises taught at the Jinenkan Dōjō and in the traditional kata we study.  </p>  <p style=\"\">  \t    The final sections are centered on using the previous lessons studied on the ground including use of grappling, submission and choking. Never before has this material been presented in such a concise and informative way.  </p>  <p style=\"\">  \t    Many of the lessons in the course are from Mr. Mitchell&#039;s Taijutsu Fundamentals DVD set, but there has been added footage that was not included in the DVDs, along with many more video lessons and PDF downloads available only in this course.  </p>", 
    "end_date": null, 
    "title": "Taijutsu Fundamentals", 
    "price": "20.00", 
    "instructors": "Adam Mitchell", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/126156_554b_6.jpg", 
    "course_url": "https://www.udemy.com/taijutsu-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-27T16:56:24Z"
}