{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Brand new course! Just launched now January 2015!</strong>  </p>  <p>  \t                                This is a Brazilian Jiu Jitsu martial arts course that will give you the <strong style=\"\">confidence you need</strong> to enter the mats knowing your basics are solid.  </p>  <p>  \t<strong style=\"\">    Why is this course different than all the other ones out there? The answer is simple: efficiency!</strong> Efficiency is a key element for Jiu Jitsu, and this is what we had in mind when we created this course for you. The average video lasts about 2 minutes!  </p>  <p>  \t              The techniques are detailed yet the videos are quick and to the point. They were made to be watched multiple times according with your need to revisit them. So there is no need to waste time watching a 10 minute video covering a 1 minute technique!  </p>  <p>  \t<strong style=\"\">      If you suffer from gaps on the basics</strong> and do not feel confident with larger, stronger, faster opponents on the mat this course will help solve your doubts and allow you to start getting the success you deserve!  </p>  <p>  \t                  Not only for beginners...  This course will also give any <strong style=\"\">blue belt</strong> who doubts their knowledge or ability added confidence in class or competition, or an advanced student from a school that doesn&#039;t benefit from having an official curriculum.  This course is for you!  </p>  <p>  \t            If you are a <strong style=\"\">parent</strong> who wants their child to have an <strong style=\"\">extra edge in class or competitions</strong> use these videos to take them to the next level! In 2014 Professor Felipe created 5 World Champions in youth divisions in the most dense area for children&#039;s Brazilian Jiu Jitsu in the world: Southern California.  </p>  <p>  \t                  His team of 25 youth competitors has amassed over 200+ podium finishes during the last calendar year! These videos will give you and your child all you need to make sure they know the basics; because as we know the ones who make less mistakes wins.  </p>  <p>  \t                            Professor Felipe Guedes is a Brazilian Jiu Jitsu Black Belt under Prof. Flavio &quot;Cachorrinho&quot; Almeida, and Master Carlos Gracie Jr. He is a Pan American Absolute division champion, a Bronze medalist at the NoGi World Championship, and a 4 time American National Champion.  </p>  <p>  \t                      We are confident you will enjoy watching the <strong style=\"\">high definition videos</strong> from this course and learning techniques that were recorded from<strong style=\"\"> 3 different angles</strong> with <strong style=\"\">professional voice</strong> <strong style=\"\">over technology</strong>. Check out the promo video and see for yourself!  </p>  <p>  \t                                This course covers techniques to be used in daily classes and regular tournaments for all ages and abilities, and is not intended to be a self defense instructional.  </p>", 
    "end_date": null, 
    "title": "The Most Important Techniques of Brazilian Jiu Jitsu", 
    "price": "50.00", 
    "instructors": "Felipe Guedes", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361204_e9e6_2.jpg", 
    "course_url": "https://www.udemy.com/the-most-important-techniques-of-brazilian-jiu-jitsu/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T07:00:34Z"
}