{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The ‘Urban\nCombat JKD Self Defense System’; a system that combines JKD with various\nother styles of martial arts and close quarter unarmed combat\ntechniques resulting in a street self defence system that can be used\nand adapted in real-life situations. \n</p>\n\n<p>This course is relevant to everyone who would like to learn self defence or martial arts but doesn't have time to join a class or dojo. This course is only one hour long, so if you could spare an hour of your time to learn a new skill that will save your life, then enroll now. The techniques in each lectures are easy to understand, direct  and on a reality-based scenarios.  Economy and speed of movement is most important for conserving your energy and catching your attacker off guard. Remember, Be confident, Be direct , Be simple and Be fast. Awareness in your surroundings is as important as learning the self defence techniques.There are many means of protecting yourself like hitting certain pressure points.</p>\n\n\n\n\n\n<p>You do not have to learn martial arts full time for months and years in order to acquire this skills, With this online course you will be able to learn self defense in your own time and train as long as you possible can. Enroll now and you can start your journey.</p>\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "Urban Combat JKD and Street Survival Self Defense", 
    "price": "35.00", 
    "instructors": "Emil Martirossian", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850996_f853.jpg", 
    "course_url": "https://www.udemy.com/urban-combat-jkd-and-street-survival-self-defense/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T18:22:36Z"
}