{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The course is all about giving you the knowledge you need to defend yourself against the most common street attacks with a series of detailed instructional videos. </p><p><br><br>These attacks are: </p><p><br><br>1. An exchange of person pushes, hands to chest, normally followed by one person striking first to the head.</p><p><br><br>2. Swinging punches to the head.</p><p><br><br>3. A front clothing grab, one handed, followed by punch to the head.</p><p><br><br>4. A front clothing grab, two hands, followed by a head butt.</p><p><br><br>5. A front clothing grab, two hands, followed by a knee to the groin.</p><p><br><br>6. A swinging bottle attack to the head.</p><p><br><br>7. A lashing kick to groin/lower legs.</p><p><br><br>8. A broken bottle/glass jabbed to face.</p><p><br><br>9. A slashing attack with a knife, </p><p><br><br>10. A grappling style head lock.</p><p><br><br>We cover how to defend yourself against all these attacks plus bonus material including:<br> <br></p><ul><li>a number of pre-emptive strikes and moves so you can end it before it has begun.<br></li><li>A few quick fight finishers.<br></li><li>How to handle an upward thrusting knife attack to the midriff and what to do if the guy grabs you and starts to stab/slash<br></li><li>How to spot the facial, physical and verbal clues that somebody confronting you is actually about to attack<br></li></ul><br>Martial Arts students often complain about not knowing how the moves they are learning would apply to a real situation. If you stick around long enough you'll get there, but this course gives you the fast track to understanding, you'll learn a range of direct, no-frills techniques and sequences of techniques that will get you out of trouble quickly. <p><br><br>Suitable for everybody, from complete beginners to experienced Martial Artists who want to learn some real-world applications. </p><p><br><br>You'll be able to fire any questions about the videos to me, the Chief Instructor of Urban Krav Maga and I will get back to you with a prompt response with additional video instruction if necessary.   </p><p><br><br>    </p><p><br><br></p>", 
    "end_date": null, 
    "title": "Urban Krav Maga: Defending The Most Common Street Attacks  ", 
    "price": "20.00", 
    "instructors": "Stewart McGill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755886_d530.jpg", 
    "course_url": "https://www.udemy.com/urban-krav-maga-defending-the-most-common-street-attacks/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T11:59:40Z"
}