{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The Master Wong Wing Chun Street Fighting Intermediate training Course is a complete guide to protecting yourself on the street. These <strong>EASY TO UNDERSTAND</strong> training videos are <strong>GUARANTEED</strong> to teach you everything you need to get yourself out of a difficult, maybe even life-threatening situation if you are attacked while you are outside the safety of your home.</p><p>Street Fighting Intermediate training is practical, filmed out on the street, in the <strong>environment</strong> you will encounter and works on applying techniques face to face with your partner. By practicing through a variety of scenarios and using drills to improve your reactions you will be able to act instinctively when you are under threat and do what needs to be done to protect yourself or those you care about.</p><p>Master Wong is your personal guide through the world of Street Fighing and will put himself in dangerous spots and explain how to escape and make sure your attacker can’t continue to bother you and will probably never want to bother anyone ever again.</p><p><strong>The user-friendly style </strong>of this production makes Master Wong your <strong>real life personal trainer! </strong>He will be with you through out each scenario and training exercise to <strong>coach and guide</strong> you, helping you to complete each task. <strong>Not all Street Fighting Intermediate is created equal!</strong> This <strong>modern realistic approach</strong> to training provided in HD brings you the secrets of the ancient Art of War applied to dangers you are likely to face today. This is your interactive step-by-step course, provided by Master Wong, making it easy for anyone, anywhere to learn Street Fighting Intermediate and gain confidence and awareness when the are out on the street.</p><p>Master Wong welcomes comments and questions from students and is constantly working to improve the quality of this instructional material. New videos will be regularly updated. So if there's a scenario you would like Master Wong to cover, contact us. You may well find this scenario included in our up coming content.</p>", 
    "end_date": null, 
    "title": "Wing Chun Street fighting Intermediate", 
    "price": "50.00", 
    "instructors": "SiFu Wong", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248352_90e2_5.jpg", 
    "course_url": "https://www.udemy.com/wing-chun-chum-kiu-module-4-know-your-surroundings/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-22T21:58:36Z"
}