{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul><li>The Master Wong Wing Chun 116 dummy training course is a complete guide through the Dummy training. These <strong>EASY TO UNDERSTAND</strong> training videos are <strong>GUARANTEED</strong> to teach you everything you need to know to further develop your <strong>Strength</strong>, <strong>Power</strong> and sharper Technique. Dummy Training is a practical way of improving your hand to hand skills, this instrument is a useful replacement for a partner when you are unable to train together. By practicing through a variety of movements from the Dummy Form, the student can improve their Reaction Time, Body Positioning and <strong>Body Conditioning</strong>; all these invaluable skills practiced under one roof. </li><li>Mastering the 116 Dummy Training, will naturally improve and reinforce the student's ability, allowing them to transfer these skills into the <strong>Self- Defence</strong> and <strong>Street Fight </strong>Training. Working in the close range with the Dummy, stimulates the real distance in a fight as well as correct Body Positioning and Body Conditioning. </li><li>Master Wong is your personal guide through the world of the 116 Dummy. Directing you, step by step to ensure you reach your full potential. </li><li>The user-friendly style of this production makes Master Wong your real life personal trainer! He will be with you through out each training exercise to coach and guide you, helping you to complete each task. Not all Dummy Training is created equal! This modern realistic approach to training provided in HD brings you the secrets of the ancient art of war applied to 21st Century Training.</li><li>This is your interactive step-by-step course, provided by Master Wong, making it easy for anyone, anywhere to learn 116 Dummy and gain confidence and awareness. Master Wong welcomes comments and questions from students and is constantly working to improve the quality of this Instructional material. New videos will be regularly updated. So if there are any questions you would like Master Wong to cover, contact us. You may well find this question is included in our up coming content.</li></ul>", 
    "end_date": null, 
    "title": "Wing Chun 116 Dummy Training", 
    "price": "50.00", 
    "instructors": "SiFu Wong", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593020_5571_3.jpg", 
    "course_url": "https://www.udemy.com/wing-chun-116-dummy/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T15:30:27Z"
}