{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em><em><em><em><strong class=\"redactor-inline-converted\"><em>LATEST: Course Updated Again for May  2016</em></strong></em></em></em></em></strong><br></p>\n\n<p>Martial arts and self defense are <strong class=\"redactor-inline-converted\">not </strong>the same! Do you Know the Difference?</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Effective techniques and MENTAL concepts, suitable for men and women of all ages</strong></p>\n\n\n\n<p>  \tThe  world has become an increasingly hostile place. It seems like every  time you open a newspaper or turn on the news or surf the web you end up  reading an article about someone being attacked. </p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">\" In a real world situation, an attack is over within a few short seconds. These seconds are filled with panic, chaos and confusion, and you won't have time to think at this point. The application of a few simple principles and techniques will allow you to </strong></em><strong class=\"redactor-inline-converted\"><em><strong class=\"redactor-inline-converted\">instantly stop any attacker! \"</strong></em></strong></p>\n\n\n\n<p>Walking to the car  after a hard day's work or coming home from school or simply all out for  an evening stroll on a warm summer's night, and then you think to  yourself, would I know what to do if I was attacked; I wonder how I  would respond? Well, you don't want to wait until you are in a  real-world situation with no self-defense training under your belt to  find out!!  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Watch your self-confidence (and attractiveness!) sky-rocket!</strong></p>\n\n\n\n<p>  \tThe  woman's tactical personal space defense management course will provide  all the necessary information so that you can survive in and  successfully navigate the dangers of this ever-changing hostile world.  Whether you are an urban setting or a rural area where help might be a  fair distance away you will be confident that you have the skills and  abilities to do what is necessary to survive and you will definitely  make your attacker wish that they'd stayed at home, tucked safely in  their bed surfing the web or watching TV. </p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">Give yourself a fresh start by enrolling in this life-changing course now. Every moment you delay, your jeopardizing your Safety  Simple as that.</strong></em></p>\n\n\n\n<p>Rather than trying to attack a  modern-day Amazon warrior like yourself as you will leave your attacker  with several painful and physically evident reminders as to why they  should never underestimate anyone, because there just might be a fierce  Amazon warrior or urban ninja ready and willing to defend the sanctity  of their personal space by any means necessary, preventing physical harm  or assault to themselves and others without hesitation; to ensure that  their attacker is subdued and no longer a threat to the sanctity of  their personal space .</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Remember these Two Facts:</strong></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Females can become extremely fierce and effective fighters, often more so than males</strong>.</li><li><strong class=\"redactor-inline-converted\">You don't need to be Bruce Lee to defend yourself successfully</strong></li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">As with all my courses:</strong></p>\n\n\n\n<ul><li><strong>The initial low price will increase shortly - the course is currently $ 25, but will next increase to $ 497</strong></li><li>You have unlimited lifetime access at no extra costs ever !!!</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money back in full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy.</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This will be a truly interactive course with additional bonus routines added over the course of the first year, inspired by the  feedback from students.</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...Scroll up and Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "Women's Self Defense :  Refuse to be a Victim Ever!!", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265442_61b3_3.jpg", 
    "course_url": "https://www.udemy.com/women-self-defense-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T03:57:10Z"
}