{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">Leer hoe je jezelf en je geliefden te verdedigen.  </strong></em></p><p style=\"\">Ben je niet sterk, groot, snel of een geoefend vechtsporter? Ik leer je extreem simpele technieken die je gemakkelijk onthoud voor het geval je ze nodig hebt. </p><p style=\"\">Stel je voor dat je nu aangevallen wordt op straat of je betrapt nu een inbreker. Weet je dan wat je moet doen? Waarschijnlijk niet, anders lees je dit niet. Veel mensen leven met een enorm schuldgevoel en hebben een gebrek aan eigenwaarden, doordat zij zich niet konden verdedigen wanneer zij dat nodig hadden. Of nog erger, zij voelen zich schuldig, omdat zij hun geliefden niet konden verdedigen. Als ik dat hoor krijg ik daar de rillingen van over mijn lichaam.</p><p style=\"\">Ik beoefen al 21 jaar diverse vechtsporten en geef daar al acht jaar training in. Ik heb vijf extreem eenvoudige technieken ontdekt die iedereen kan toe passen ongeacht hoe groot, sterk of snel je bent. En er is nog meer!.... Ik heb ook drie extreem smerige technieken ontdekt, waarmee je zelfs geoefende vechtsporters mee verrast. Ik deel graag deze inzichten, omdat ik wil dat iedereen zich kan verdedigen!</p><p style=\"\">De meeste zelfverdedigingstrainingen leren je technieken die veel te complex zijn. Het kost je jaren trainen om ze onder de knie te krijgen. En dan is het de vraag of je ze wel kan toe passen onder hoge mate van stress. Zelfverdediging leren is op een veel eenvoudigere manier mogelijk. Alle technieken die ik je leer begrijp je direct en zijn gelijk toepasbaar. </p>  \t\t\t\t\t\t<p style=\"\">Wil je deze smerige technieken leren? En wil je dat je kinderen deze kunnen toepassen? Je vrouw? Zus? Broer? Vriend?          \t</p><p style=\"\">Er is nog meer...                \t</p><p style=\"\">  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<strong style=\"\">Bonus</strong>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p style=\"\">  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t      De grootste uitdaging is om het geleerde toe te passen in de praktijk wanneer de stress hoog is. Ik heb een speciaal onderdeel ontwikkeld waardoor je sneller leert en meer onthoud. Je hoeft er niet jaren voor te trainen. <br style=\"\"><strong style=\"\"><em style=\"\">Dit vind je niet in andere vergelijkbare trainingen! </em></strong></p><p style=\"\">Ik adviseer je om dit programma te kopen. <em style=\"\">Stel je voor dat je het nodig hebt? Je bent jezelf dankbaar dat je jezelf kan verdedigen. Andere zijn je dankbaar, dat je hen hebt beschermd. </em></p><p style=\"\"><em style=\"\">Ik sta persoonlijk ervoor garant dat je 100% tevreden bent. Wanneer je dat niet bent dan krijg je binnen 30 dagen na aanschaf je geld terug. Je hoeft hiervoor geen verklaring te geven.</em><strong style=\"\">   </strong></p><strong style=\"\">Koop het nu! </strong>", 
    "end_date": null, 
    "title": "Zelfverdediging: Als je niet sterk bent moet je smerig zijn!", 
    "price": "45.00", 
    "instructors": "Sander Gremmen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429170_1b60_3.jpg", 
    "course_url": "https://www.udemy.com/zelfverdediging-als-je-niet-sterk-bent-moet-je-smerig-zijn/", 
    "currency": "USD", 
    "subject_name": [
        "Self Defense"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T16:15:01Z"
}