{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Film &amp; Theatre\n                                                            \n                            \n                                                \n                    \n                    \n                    Screenplays form the starting point for most dramatic films, the essential work from which all other filmmaking flows. All of the tender romance, terrifying action and memorable lines begin at the screenwriter’s desk. This free online course will introduce you to the basic elements and key concepts behind a professional screenplay.\n\nThe University of East Anglia’s School of Literature, Drama and Creative Writing have built this course with instructors and recent alumni from their famed course in Creative Writing.\n\nWhere could this course take me?\nThe course is a must for anyone new to scriptwriting and for more experienced writers who wish to raise their scriptwriting to a professional level. It will establish a common vocabulary for approaching the screenplay and form the basis for upcoming courses in dramatic adaptation, the crime screenplay, and other genres and skills.\n\nWhat and how will I learn?\nYou’ll learn from a mixture of basic theory, script analysis and practical exercises. We will explore key principles as they’re expressed in great films, then immediately apply these concepts. Videos, articles and discussion steps will offer you the opportunity to learn and engage with other learners on key concepts and ideas.\n\nBy the end of the course, you will understand the key concepts necessary to write an effective screenplay and be fluent in the language used to discuss the form.\n\n\n                                    ", 
    "end_date": "2016-09-26T00:00:00Z", 
    "title": "An Introduction to Screenwriting", 
    "price": 0, 
    "instructors": "Michael Lengsfield", 
    "institution_name": [
        "University of East Anglia"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "http://www.futurelearn.com/courses/screenwriting?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-12T00:00:00Z"
}