{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                    \n                    \n                    Whether you’re a budding filmmaker or a film fan who wants to understand more about what happens behind-the-scenes, this free online course from the internationally acclaimed National Film and Television School will have something for you.\n\nOver six weeks, our team of award-winning filmmakers will take you through their approach to telling stories, as well as demystifying their own filmmaking specialisms - from writing and directing to cinematography, editing and composing.\n\nEach week your filmmaker host will use examples from their own work as well as the films that have influenced and inspired them:\n\n1 - Introduction: how does a film get from script to screen?Nik Powell, director of the NFTS and producer of more than 40 films, including The Crying Game, Mona Lisa and Company of Wolves.\n\n2 - Storytelling: what’s the difference between plot and theme? Destiny Ekharaga, director of Gone Too Far.\n\n3 - Decisions: how to choose budget, schedule, location and kit?Mike Figgis, director of Leaving Las Vegas, TimeCode and Internal Affairs.\n\n4 - The scene: how does a director make choices on set? Corin Hardy, director of The Hallow and just announced to direct re-make of The Crow + has directed music videos for artists such as The Prodigy, Olly Murrs and Devlin.\n\n5 - Time and space: how does editing affect meaning?Justine Wright, editor of Touching the Void, The Iron Lady and Locke.\n\n6 - Sound and music: what is the impact of a film’s soundtrack?Danny Hambrook, sound designer of Curse of the Were-Rabbit and Le Weekend, production sound mixer on Rush\n\nThe NFTS has teamed up with the BFI to offer this course, as part of the BFI Film Academy. The Film Academy provides opportunities for people across the UK to learn more about film industry, and working alongside experienced professionals, get hands-on opportunities, making short films themselves.\n\nExplore Filmmaking also features a number of award-winning short films made by recent graduates of the NFTS, and recommended videos from the BAFTA Guru collection, designed to help people taking their first steps into the film industry.\n\nPlease note that some videos in the course contain film clips which you may find offensive or upsetting. Where video material contains violence, sexual references or swearing, you will be given advance warning.\n\nThis course will deepen your understanding of the filmmaking process and show you how to take it further – whether making your own short films, thinking about a career, or simply a deeper appreciation of the films you watch in future.\n\nYou can find out how this course was put together in Jon Wardle and Pete Fraser’s post for the FutureLearn blog: “Why creating an online course is just like making a film.” Or read an in-depth review of the course by a previous learner at Class Central.\n\n\n                                    ", 
    "end_date": "2016-04-04T00:00:00Z", 
    "title": "Explore Filmmaking: from Script to Screen", 
    "price": 0, 
    "instructors": "Pete Fraser and Jon Wardle", 
    "institution_name": [
        "National Film and Television School"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "http://www.futurelearn.com/courses/explore-filmmaking?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-02-22T00:00:00Z"
}