{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                    \n                    \n                    Le théâtre classique du 17e siècle passe pour le sommet de l’art du théâtre en France. Ses trois représentants les plus connus, Corneille et Racine pour la tragédie et Molière pour la comédie comptent parmi les plus grands dramaturges européens de tous les temps, et Molière reste l’un des auteurs les plus joués dans le monde.\n\nPour vous les faire découvrir, nous vous emmènerons dans l’environnement historique, sociologique, culturel et littéraire qui les a vu naître. Nous retracerons ainsi l’histoire du \"théâtre moderne\" depuis sa naissance au milieu du 16e siècle jusqu’aux plus brillantes années du \"siècle de Louis XIV\"(2e moitié du 17e siècle).\n\nNous examinerons ainsi les fondements de l’expression \"théâtre classique,\" les fondements du système qui a vu naître les \"règles classiques,\" les fondements d’un dialogue théâtral qui repose entièrement sur \"l’alexandrin classique.\" Et nous ferons apparaître les tensions créatrices (entre la théorie et la pratique, entre les règles et le refus des règles, entre le texte et le spectacle, entre le classicisme et le baroque, entre la tragédie et l’opéra) qui ont façonné le théâtre de cette période.\n\nEnfin, en vous accompagnant dans la lecture des quelques chefs-d’œuvre qui ont créé une rupture esthétique et marqué les esprits, nous vous ferons pénétrer avec nous dans l’atelier créateur des plus grands dramaturges de l’âge d’or du théâtre français.\n\nPièces de théâtre à lire: Le Cid et Cinna de Corneille / Les Précieuses ridicules, L’École des femmes et Tartuffe de Molière / Andromaque et Phèdre de Racine.\n\nCes textes sont tous disponibles en éditions de poche (choisir de préférence \"Folio classique” et \"Folio Théâtre\" ou \"Le Livre de poche Classique.\") \n\nNous vous invitons à découvrir avec nous d’où viennent ces trois auteurs, comment ils se sont construits, comment ils se sont distingués des plus brillants dramaturges de leur temps. Et nous vous montrerons quels sont les ingrédients qui ont permis à leurs œuvres d’avoir été sans cesse lues et jouées jusqu’à aujourd’hui — et cela, alors même que de nombreux éléments-clés (l’obéissance à des \"règles\" et l’usage du vers dit \"alexandrin,\" en particulier) ont disparu depuis longtemps.\n\n \n\n \n\n                                    ", 
    "end_date": "2015-11-26T00:00:00Z", 
    "title": "LF001.1x: À la découverte du théâtre classique français – Tome 1", 
    "price": 0, 
    "instructors": "Georges Forestier", 
    "institution_name": [
        "Sorbonne Universités"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/la-decouverte-du-theatre-classique-sorbonnex-lf001-1x", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-10-15T00:00:00Z"
}