{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                    \n                    \n                    While Shakespeare’s Othello is studied and read all over the world, it was written to be staged and can only be fully understood as a play in performance.\n\nDiscover how Othello has been performed through time\n\nOn this free online course, designed with A-level learners in mind, you will discover how the performances and interpretations of Othello have evolved from its first performance in 1604 to the present day. You will find out what influenced performance choices then and now, and how specific themes within the text have been addressed at different moments in history.\n\nAfter an introductory week looking at Othello as a whole, we will explore different themes and ideas each week:\n\n\n  The significance of race\n  The role of women\n  The form of tragedy\n\n\nUltimately, you will analyse the Royal Shakespeare Company’s most recent production of Othello, informed by your learning over the four weeks and exploring three specific scenes.\n\nLearn from Othello actors, academics and directors\n\nYou will learn with leading experts, based in Shakespeare’s birthplace, Stratford upon Avon, from the Royal Shakespeare Company (RSC), the University of Birmingham’s Shakespeare Institute and the Shakespeare Birthplace Trust.\n\n\n  \n    Jacqui O’Hanlon, RSC Director of Education, will offer an overview of Othello, with insights from: Professor Michael Dobson of the Shakespeare Institute; RSC Artistic Director Gregory Doran and Director Iqbal Khan; and members of the 2015 RSC Acting Company, including Hugh Quarshie, Lucian Msamati and Joanna Vanderham. As part of this, we will explore what Othello is ultimately about, looking at people, places and perspectives.\n  \n  \n    Dr Nick Walton from the Shakespeare Birthplace Trust will discuss the issue of race in Othello, exploring critical responses to this idea, both in original performance and through its performance history before focussing on Act 1 Scene 1.\n  \n  \n    Dr Abigail Rokison-Woodall from the Shakespeare Institute will look at the role of women in the play, uncovering the treatment of those roles in performance from 1604 to the present day, with an emphasis on Act 4 Scene 3, also known as the “Willow Scene”.\n  \n  \n    Dr Anjna Chouhan from the Shakespeare Birthplace Trust will explore Othello as a tragedy, looking in detail at the tragic journeys of the play’s characters and discussing the conclusion of the drama in Act 5 Scene 2.\n  \n\n\nAlong the way, you’ll be able to debate the questions that the play raises - with both course educators and learners from around the world - and draw your own conclusions.\n\n\n\n                                    ", 
    "end_date": "2016-03-21T00:00:00Z", 
    "title": "Othello: In Performance", 
    "price": 0, 
    "instructors": "Jacqui O'Hanlon", 
    "institution_name": [
        "University of Birmingham"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "http://www.futurelearn.com/courses/othello?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-02-22T00:00:00Z"
}