{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                    \n                    \n                    Los vídeos serán en español o inglés. Se ofrecerán subtítulos en ambos idiomas. Las actividades se realizarán en ambos idiomas.\n\n*Videos will be in English or Spanish. Transcripts in both languages will be provided. The assessments will be in both languages.\n\nEste curso presenta las nuevas tendencias y formatos del documental audiovisual contemporáneo, prestando especial atención a las prácticas más innovadoras en un contexto interactivo, transmedia y multiplataforma. Incluye una aproximación a los géneros y autores fundamentales, y  cuenta con la participación de profesionales del sector, documentalistas y académicos.\n\nA través de vídeos, infografías, animaciones y timelines y un amplio repertorio de recursos y materiales complementarios, se busca ofrecer al  alumno claves creativas y eficaces en el momento actual.\n\nEste MOOC consta de los siguientes módulos:\n\nEl documental está de moda.\n\tFlashback: Introducción a la historia del documental.\n\tDocumental web: Reinvención del documental en Internet.\n\tCiberactivismo y documental político en el ecosistema viral.\n\tF for Fake o falso documental a ritmo de social networking.\n\tDocumental de divulgación: Naturaleza, cultura, historia, ciencia.\n\tDocumental de creación en tiempos de crowdfunding.\n\tBrand-Documental: Nuevas estrategias publicitarias.\nThis course features new trends and formats in contemporary documentary film with a focus on innovative works in an interactive and multi-platform environment. It includes an overview of essential authors and genres, as well as the contribution of national and international scholars, professionals of the field and documentary makers.\n\nThe learning experience is enhanced with videos, slideshows, infographics and timelines, to provide the learner with an interactive, reflective and entertaining experience.\n\nThis MOOC is divided into the following segments:\n\nDocumentary film is in vogue.\n\tFlashback: Introduction to documentary film history.\n\tWeb documentary: Reinventing documentary film on the Internet.\n\tCyberactivism and political documentary in a viral ecosystem.\n\tF for Fake or false documentary moving to the rhythm of social networking.\n\tNews and thematic documentary: Nature, culture, history, science.\n\tCreative documentary film in times of crowdfunding.\n\tBrand-Documentary: New strategies in advertising.\n \n\n                                    ", 
    "end_date": "2015-09-15T00:00:00Z", 
    "title": "PCA.1x: DOCUMENTAL! Nuevas tendencias, nuevos formatos / DOCUMENTARY! New Trends, New Formats", 
    "price": 0, 
    "instructors": "Pilar Carrera, Pedro Valiente, Clara Sainz de Baranda and Eva Herrero", 
    "institution_name": [
        "Universidad Carlos iii de Madrid"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/documental-nuevas-tendencias-nuevos-uc3mx-pca-1x", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-07-21T00:00:00Z"
}