{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                    \n                    \n                    This short three-week course introduces you to world-renowned Russian director Meyerhold’s technique of biomechanics, inviting you to experience first-hand his revolutionary approach to acting – the biomechanical études. You will learn about the techniques and find out more about the history of physical theatre including Meyerhold’s contribution to its development and how, nearly 100 years later, his work is still influencing us today.\n\nThrough a mixture of video, animation, interviews with artists, expert panel discussions with professionals, discussion forums and practical exercises you will explore the range of key players in Russian actor training. Meyerhold’s work will be placed in context as an early collaborator with Stanislavsky and a contemporary of Michael Chekhov. You will be introduced to one of his études – a two minute repeatable exercise used to develop balance, awareness and expression. Responding to video guidance you will be invited to explore your own response to this unique approach to training and will share these with the experts and your fellow students. Together we will reflect on these responses, evaluating the importance of Meyerhold’s work today.\n\nWhat others say\n\nThis is a re-run of this highly successful course. Here are just a few of the comments taken from a longer review written by Claire Warden, author of ‘British Avant-Garde Theatre’ who took the course in March 2014\n\n“…I can honestly say that the past week has been a revelation. Not only has the teaching been clear, it has also attacked such a range of ideas in an intellectually rigorous way…”\n\n“I studied alongside students from across the world…The supportive, cross-cultural community…was wholly unexpected and reflected Meyerhold’s transnational intentions”\n\n“An amazing course that has been thoroughly enjoyable and informative”\n\nThe following comment is one of many similar comments made by other students who joined the course in March.\n\n“My grateful thanks to everyone who has worked so hard to make such an enriching experience possible - first rate!”\n\nAccreditation\n\nThis course has been certified by the CPD Certification Service as conforming to continuing professional development principles. By completing the course you will have achieved 12 hours of CPD time.\n\nThis optional formal exam has been set by the team at the University of Leeds and is based on the contents of the course. You will be able to sit the exam at various test centres across the world after the end of the course. You can choose from exam dates between Monday 9 March and Sunday 29 March.\n\n\n\n                                    ", 
    "end_date": "2015-02-16T00:00:00Z", 
    "title": "Physical Theatre: Meyerhold and Biomechanics", 
    "price": 0, 
    "instructors": "Jonathan Pitches", 
    "institution_name": [
        "University of Leeds"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "http://www.futurelearn.com/courses/physical-theatre?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-01-26T00:00:00Z"
}