{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                    \n                    \n                    In many ways Scandinavian film and television is a global cultural brand, connected with and exporting some of the cultural and social values connected to a liberal and progressive welfare society. This course deals with the social, institutional and cultural background of film and television in Scandinavia and in a broader European and global context.\n\n                                            Syllabus\n                        Contemporary Scandinavian Film and TV Culture and Dreyer's Classical CinemaThis module consists of two lessons. The first lesson offers an introduction to main trends in the contemporary Scandinavian film and television culture, focusing – among other things – on how the national film and television cultures relate to ideas of the welfare state. The module also addresses the international impact of film and television from Scandinavia. The second lesson deals with the early years of cinema in Scandinavia and the work of the Danish director Carl Th. Dreyer, from a silent film classic such as 'The Passion of Joan of Arc' to  the sound film era.istIngmar Bergman and Lars von Trier'The Seventh Seal', 'Persona' and 'Cries and Whispers' are just some of the famous films by the acclaimed Swedish director Ingmar Bergman. The third lesson focuses on issues of influences, themes and style in his films as well as on Bergman's importance for the modern art cinema. The fourth lesson deals with the internationally renowned ideas and films by the Danish director Lars von Trier: 'The Europa-trilogy'; The TV series 'Riget'/'The Kingdom'; 'Breaking the Waves'; 'Dancer in the Dark' and 'Dogville'; The Dogma 95 Manifesto; 'Antichrist', 'Melancholia' and 'Nymphomaniac' ... New Wave, Art Cinema and Social DramaMany people have heard of the French new wave cinema, 'la nouvelle vague'. The fifth lesson deals with the main tendencies of the Scandinavian new wave cinema and some of its 'auteurs'. The sixth lesson focuses on different tendencies in the Scandinavian art film and social drama after 1990, ranging from award-winning heritage films to harsh stories from the contemporary Scandinavian welfare societies.Documentary and Early TV DramaScandinavian cinema has a long history of strong documentary film making. The seventh lesson moves from the early documentary filmmakers to the contemporary – global and digital – scene for Scandinavian documentaries. Television drama is important for the Scandinavian public service broadcasters, but the notions of good television drama have changed remarkably from the early days of television up until today. In the eighth lesson we focus on the main tendencies in these developments from 1960 to 2000.Modern TV Drama and the Digital RevolutionWith 'Nordic Noir' such as 'Wallander' and 'Forbrydelsen/The Killing' becoming a 'brand' in the 2010s, some 'Scandi crime' series were suddenly of interest to international as well as national audiences. The ninth lesson focuses on Scandinavian television drama after the millennium and addresses some of the changes in the production framework that helped the series move from the national to the international realm. The tenth and final lesson discusses how to understand the contemporary Scandinavian film and television culture in a global and digital era. What might the transnational future bring?\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Scandinavian Film and Television", 
    "price": 0, 
    "instructors": "Ib Bondebjerg", 
    "institution_name": [
        "University of Copenhagen"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/scandinavian-movies-tv", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}