{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                    \n                    \n                    Summer is cooler in the shadows.\r\nWe invite movie fans from around the world to join us for a flexible, multimedia investigation and celebration of film noir.\r\nIn this nine-week course, we’ll go back in film history to investigate the \"The Case of Film Noir\"—the means, motives, and opportunities that led Hollywood studios to make these hard-boiled crime dramas, arguably their greatest contribution to American culture.\r\nThis course will run concurrently with the Turner Classic Movies \"Summer of Darkness” programming event, airing 24 hours of films noir every Friday in June and July 2015. This is the deepest catalog of film noir ever presented by the network (and perhaps any network), and provides an unprecedented opportunity for those interested in learning more to watch over 100 classic movies as they investigate “The Case of Film Noir.”\r\nBoth the course and the associated films will enrich your understanding of the film noir phenomenon—from the earliest noir precursors to recent experiments in neo-noir. You will be able to share thoughts online and test your movie knowledge with a worldwide community of film noir students and fans.\r\nCourse Outcomes\r\nStudents will\r\n\r\ngain a deeper appreciation of classic Hollywood movies\r\nbe able to identify the characteristics of a film noir\r\nable to explain the origins and history of film noir\r\nbe able to perform close analyses of films noir\r\n\r\nTopics include\r\n\r\nWhat is Film Noir?\r\nFilm Noir and Its Influences\r\nFilm Noir in the Studio System\r\nFilm Noir Themes and Characters\r\nFilm Noir in the Postwar Period\r\n\n\n                                    ", 
    "end_date": "2015-08-03T00:00:00Z", 
    "title": "TCM Presents Into the Darkness: Investigating Film Noir", 
    "price": 0, 
    "instructors": "Richard L. Edwards, Ph.D.", 
    "institution_name": [
        "Ball State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.canvas.net/browse/bsu/tcm/courses/film-noir", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2015-06-01T00:00:00Z"
}