{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/globaltheatre\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/globaltheatre-001/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    globaltheatre-001\n                                                                    globaltheatre-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    In\nthis course we will discuss how theatre, a European cultural practice, spread\nrapidly around the world in the late 19th and early 20th centuries. The modules\nwill engage with both theoretical and historical perspectives on what is a\nrelatively new area of theatrical research. Globalisation is a highly controversial\nconcept that has provoked extreme reactions. It also tends to be discussed as a\nphenomenon post-dating the end of the Cold War in 1989. In this course we will\nargue that globalization, even as we understand it today, in fact goes back at\nleast to the mid- to late 19th century when the existence of colonial empires\ncreated the conditions for mass migration, the rapid transportation of goods and\npeople, the invention of new technologies such as steam shipping, railways and\ntelegraphy, which all helped to facilitate the spread of theatre. We will\nengage with research that has emerged in the context of global and\ntransnational history and apply these findings to theatre. We will look at how\ncertain plays, operas and ballets quite literally went global. We will look at\ntheatre buildings, at the cosmopolitan audiences that emerged as well as the\nactors, agents and managers who facilitated the movement of theatre around the\nworld. The final two modules will focus on the post-1945 and 1989 developments,\neach of which represent globalisation of different kinds.\n\n                                            Syllabus\n                        Week one: Introductions with definitions of  'theatre' and 'globalization'; cenceptualizing 'global theatre histories'; overview of online resources for researching the history of theatre during the late 19th and 20th centuries. Week two: Theatre on the Move; how we can relate migration and mobility to the dissemination of theatre.Week three:  Actors, Managers, and Theatrical Agents; with a focus on the people who organized the global\nmigration of theatre. Week four: Theatre Buildings as 'Cultural Hubs' and 'Contact Zones'; methodologies and concepts for approaching theatres as places where different people, languages, and cultures met and exchanged. Week five: Theatre and the Cold War; theatre as a site of the rivalry\n  between\n  East and West. Week six: Festivals, Megamusicals, and Livestreaming; how contemporary types of theatre reflect globalization and new technologies. \n \n\n\n\n                                    ", 
    "end_date": "2015-03-30T00:00:00Z", 
    "title": "Theatre and Globalization", 
    "price": 0, 
    "instructors": "Christopher Balme", 
    "institution_name": [
        "Ludwig-Maximilians-Universität München"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/course/globaltheatre", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-02-16T00:00:00Z"
}