{
    "selfpaced": false, 
    "topic_name": [
        "Film & Theatre"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Film &amp; Theatre\n                                                            \n                            \n                                                \n                    \n                    \n                    Visual effects (VFX) has long been a fascinating and mysterious process, but today the technology is available to us all.\nAs an amateur, no-budget or guerrilla filmmaker, you can use VFX to create believable new backgrounds for actors, or new landscapes, scenery or objects to enhance your story. This free online course will show you how.\n\nWith VFX, you can afford to set your film anywhere\nCan’t afford to travel to New York to make your film? Want to shoot a period drama without hiring a stately home? With VFX, you can fool your audience into believing that you have.\n\nVFX isn’t all about explosions and superheroes – we’ll show you how you can use it to tell all sorts of stories better, by adding objects and places to your film that you couldn’t afford before.\n\nGet to grips with free VFX software and techniques\n\nOver four weeks, we’ll supply free software, and show you tips and techniques in a non-technical way. While you might know how to shoot a film on your iPhone, you probably don’t know how to create realistic visual effects to tell better stories.\n\nEach week, we’ll uncover techniques like effective green screen, motion tracking and colour grading. It’s a practical course, designed for the non-professional, which will enable you to try out your own effects with our sample footage or your own.\n\nSo, whether you want to create your own visual effects for a film or just get a bit of background into how this fascinating and fast-moving technology works, join us.\n\nThe course has been designed in partnership with HitFilm, creators of editing and visual effects software, and MPC, one of the global leaders in VFX for over 25 years.\n\n\n                                    ", 
    "end_date": "2016-09-05T00:00:00Z", 
    "title": "Visual Effects for Guerrilla Filmmakers", 
    "price": 0, 
    "instructors": "Simon Jones and Saint John Walker", 
    "institution_name": [
        "Norwich University of the Arts"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "http://www.futurelearn.com/courses/vfx-for-filmmakers?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-08-08T00:00:00Z"
}