{
    "selfpaced": true, 
    "topic_name": [
        "STEM"
    ], 
    "description": "\n\n                    \n                    \n                    Êtes-vous instituteur / professeur des écoles ? Êtes-vous impliqué dans les activités extrascolaires d’un groupe de jeunes ? Alors ce cours est fait pour vous ! Quelle que soit la matière que vous enseignez d’habitude, vos élèves et vous-mêmes êtes cernés par les nouvelles technologies. Il suffit d’observer Facebook, Google ou Youtube pour comprendre que ce sont les jeunes qui sont souvent à l’origine de ces bouleversements technologiques : leur créativité n’a jamais eu autant d’influence qu’aujourd’hui. Quant aux embauches de demain, la plupart se feront dans les technologies de l’information (TI), avec un impact certain sur tous les autres secteurs, de l’agriculture au tourisme en passant par les télécoms et les services financiers.Avec ce cours, vous aurez tous les outils en main pour encourager les jeunes d’aujourd’hui à devenir les acteurs du numérique de demain. Ce cours s’appuie sur le fameux système Scratch, une plateforme ludique qui facilite l’apprentissage continu de la programmation et qui passionne déjà des millions d’enfants à travers le monde en faisant appel à leur créativité. Vous serez surpris par la vitesse à laquelle les petits sont capables de s'approprier les fruits de ce fantastique outil pédagogique, et même si vous n’avez jamais programmé la moindre ligne de code de votre vie, aucun souci ! Ce cours vous expliquera tout, étape par étape !Ce cours s’inscrit dans le cadre de l’initiative Africa Code Week, un puissant vecteur d’alphabétisation numérique visant à mettre entre les mains des jeunes Africains les outils et compétences dont ils ont besoin pour réussir au 21ème siècle et contribuer activement à l’essor économique de l’Afrique. Il vous est proposé en parallèle des centaines d’ateliers présentiels organisés un peu partout en Afrique en préparation des activités d’octobre. Ainsi, que vous vous trouviez en Afrique ou ailleurs, vous pouvez vous aussi apprendre à maîtriser l’un des outils de programmation les plus simples et les plus amusants qui soient !Nous avons le plaisir de vous offrir ce cours également dans le cadre de l’EU Code Week 2015. Alors, où que vous vous trouviez, accompagnez-nous dans le monde du code!\n\n                                            Syllabus\n                            •    Unité 1 : Scratch ou l’art de programmer    •    Unité 2 : Créer un environnement numérique interactif    •    Unité 3 : Programmer des figures géométriques et programmer à main levée    •    Unité 4 : Planifier et concevoir des jeux\n                                    ", 
    "end_date": "2015-12-06T00:00:00Z", 
    "title": "Africa Code Week : Enseigner la programmation aux enfants", 
    "price": 0, 
    "instructors": "Jérôme Monteu Nana", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://open.sap.com/courses/acw1-1-fr", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "openSAP"
    ], 
    "start_date": "2015-11-01T00:00:00Z"
}