{
    "selfpaced": true, 
    "topic_name": [
        "STEM"
    ], 
    "description": "\n\n                    \n                    \n                    Today, we’re surrounded by digital technology. When we think about software, we often think of computers for writing email or surfing the internet. But software is everywhere! It’s in many of our household appliances and is used to manufacture many of our products such as our clothes. Maybe you enjoy using software, but why not start creating it for yourself? This course is part of the Africa Code Week initiative to bring coding skills to young people across the continent, and will show you how to get started with computer programming! You never know where it might lead – you might even end up using your new coding skills in your job one day! And if you’ve never done any programming before – no problem – this is the place to start. All you need is some free time and a bit of curiosity. You’ll be truly astonished at what you can do in next to no time!The course is based around the popular Scratch system that is capturing the imagination of young people around the globe. If you’re aged between 12 and 17, this course is for you. You need to have access to a computer and access to the internet to download Scratch. You can watch the videos online if you have a good internet connection, but if not, you can download them and watch them offline. You will be working with an offline version of Scratch. Ready to get coding? Who knows, maybe you’ll follow in the footsteps of those who created Facebook, Google and Youtube!We are also pleased to offer this course as part of the EU Code Week 2015. So wherever you are, start your coding journey with u\n\n                                            Syllabus\n                            •    Unit 1: SCRATCH from Scratch    •    Unit 2: Bats and Balls: Your First Interactive Game    •    Unit 3: Making Up the Rules    •    Unit 4: Upping the Competition    •    Unit 5: Expect the Unexpected\n                                    ", 
    "end_date": "2015-12-06T00:00:00Z", 
    "title": "Africa Code Week: Teens Get Coding!", 
    "price": 0, 
    "instructors": "Noel Munday and Daniel Munday", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://open.sap.com/courses/acw2", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openSAP"
    ], 
    "start_date": "2015-11-01T00:00:00Z"
}