{
    "selfpaced": false, 
    "topic_name": [
        "STEM"
    ], 
    "description": "\n\n                    \n                    \n                    Assessment for Learning is a term that’s widely used in education, but applied in ways that are variable in their effectiveness. This free online course - designed for STEM teachers in primary and secondary schools, and sixth form and further education (FE) colleges - will help you understand and use it more effectively.\n\nUnderstand Assessment for Learning in theory and practice\n\nThrough this course, you’ll understand:\n\n\n  the theory and science behind effective Assessment for Learning;\n  how to use Assessment for Learning to elicit evidence about what’s going on in your learners’ minds;\n  how to use this evidence formatively with your learners in your laboratory and classroom;\n  how to write, judge and use the hinge questions that are central to Assessment for Learning in STEM.\n\n\nEnjoy your teaching more\n\nAs the course progresses, you’ll be encouraged to try things out in your laboratory and classroom; actively reflect on what you discover in the process; and share your experience as part of the course discussions.\n\nYou’ll also be invited to read some of the scientific literature about Assessment for Learning. Your learners will gain as a result - and you’ll enjoy your teaching more.\n\nLearn with Dylan Wiliam and Christine Harrison\n\nThis course has been developed by the Science Learning Network in partnership with the University of Leeds. It gives you the opportunity to learn with two leading experts in STEM education and assessment:\n\n\n  \n    Dylan Wiliam: Emeritus Professor of Educational Assessment at the Institute of Education and author of Embedded Formative Assessment;\n  \n  \n    Christine Harrison: Senior Lecturer in Science Education at King’s College London, Chair of the Association for Science Education, and former secondary school teacher.\n  \n\n\nAbout the Science Learning Network\n\nThe national network of Science Learning Centres and Partnerships is a joint initiative by the Department for Education and the Wellcome Trust, run under the aegis of the White Rose University Consortium, which comprises Leeds, Sheffield, Sheffield Hallam, and York Universities.\n\n\n                                    ", 
    "end_date": "2015-05-25T00:00:00Z", 
    "title": "Assessment for Learning in STEM Teaching", 
    "price": 0, 
    "instructors": "Dylan Wiliam, Andrea Mapplebeck and Chris Harrison", 
    "institution_name": [
        "University of Leeds"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.futurelearn.com/courses/assessment-for-learning?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-04-13T00:00:00Z"
}