{
    "selfpaced": false, 
    "topic_name": [
        "STEM"
    ], 
    "description": "\n\n                    \n                    \n                    At the core of improving teaching and learning is the need to accurately determine what students have learned as a result of teaching practices. This is a research problem, to which STEM instructors can effectively apply their research skills and knowledge.\n\nIn this course, you will learn about the “teaching as research” framework. This framework is a deliberate, systematic, and reflective use of research methods used to develop and implement teaching practices that advance the learning experiences and outcomes of both students and teachers.\n\nParticipants will learn about effective teaching strategies and the research that supports them, as well as how to collect and analyze evidence of student learning.\n\nThis course is targeted to graduate students and post-doctoral fellows within STEM disciplines (science, technology, engineering, and mathematics) that are seeking faculty careers at college and university.\n\nThe “Teaching as Research” framework is a core idea of The Center for the Integration of Research, Teaching, and Learning (CIRTL), which is a National Science Foundation (NSF) funded network of research universities committed to preparing outstanding future faculty in STEM disciplines, with the ultimate goal of improving undergraduate STEM education in the U.S.\n\n                                    ", 
    "end_date": "2016-07-27T00:00:00Z", 
    "title": "CIRTL.2x: Advancing Learning Through Evidence-Based STEM Teaching\n", 
    "price": 0, 
    "instructors": "Derek Bruff, Trina McMahon, Bennett Goldberg and Henry (Rique) Campa III", 
    "institution_name": [
        "Boston University"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.edx.org/course/advancing-learning-through-evidence-bux-cirtl-2x", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-01T00:00:00Z"
}