{
    "selfpaced": false, 
    "topic_name": [
        "STEM"
    ], 
    "description": "\n\n                    \n                    \n                    L’objectif du MOOC Enseigner et Former Avec le Numérique en Mathématiques (eFAN Maths) est de se former à construire des situations d’apprentissage des mathématiques tirant profit de supports numériques. Par rapport à la première saison de eFAN Maths (novembre-décembre 2014), de nouvelles ressources ont été développées, en relation avec les évolutions des programmes d’enseignement (introduction d’éléments d’algorithmique, développement de dispositifs interdisciplinaires).\r\neFAN Maths s’inscrit ainsi dans les programmes stratégiques de nombreuses institutions éducatives (en particulier la Stratégie mathématiques du ministère français de l’éducation) situant, comme une priorité pour l’école, la maîtrise de savoirs et de compétences mathématiques par tous les élèves, comprenant les mathématiques vivantes dans leurs relations avec les sciences et avec le monde, et visant un renouvellement de la formation des enseignants dans cette perspective.\r\neFAN Maths repose sur l’engagement actif des participants. Pour cela, il développe un répertoire de projets, construit grâce aux apports initiaux des acteurs. Il propose des outils pour concevoir et analyser des tâches mathématiques, des mises en œuvre en classe et des productions d'élèves.\n\n                                            Syllabus\n                        Semaine 0 : identification et structuration des équipes autour de projetsSemaine 1 : sélection raisonnée des ressources numériques nécessaires au développement des projetsSemaine 2 : scénarisation des projets du point de vue de l’activité des élèvesSemaine 3 : scénarisation des projets du point de vue de la responsabilité des professeursSemaine 4 : évaluation collaborative des projets\n                                    ", 
    "end_date": "2016-04-05T00:00:00Z", 
    "title": "Enseigner et former avec le numérique en mathématiques", 
    "price": 0, 
    "instructors": "Pascal Bellanca-Penel and Gilles Aldon", 
    "institution_name": [
        "Université Paris-Saclay"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/ENSDeLyon/14003S02/session02/about", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-03-08T00:00:00Z"
}