{
    "selfpaced": false, 
    "topic_name": [
        "STEM"
    ], 
    "description": "\n\n                    \n                    \n                    The “Innovative Practices for Engaging STEM teaching” course aims to provide teachers, school counsellors and career advisors with resources and ideas to increase students’ interest for STEM (Science, Technology, Engineering and Mathematics) subjects and careers. The course is designed in response to the worrying disengagement of young people from STEM subjects in school, and their decreasing interest in related careers.\r\nThe course is structured into 8 modules which develop a learning path from the analysis of the reasons behind students’ disaffection for STEM to the development and experimentations with innovative practices to overcome it.\r\nThe first 5 modules focus on motivating and engaging students in the STEM area through different approaches such as taking part in virtual visits to research centres and the use of virtual and remote labs and other innovative tools in the classroom. The last 3 modules explore career counselling aspects, providing guidance on how to inform students on STEM careers prospects and to support them in their choice. Modules are composed of video lectures of about 10 to 15 min., an activity to carry out, a section of optional materials that you can counsult to deepen your knowledge and a quiz to evaluate what you have learnt at the end of each module.\r\nThe “Innovative Practices for Engaging STEM teaching” course will last 8 weeks and will be animated by a panel of experts who will contribute to it with their specific expertise and will engage participants through collaborative activities.\r\nAt the end of the course you will receive an electronic certificate of participation.\r\nFollow anouncements on the STEM course via the course Announcements section and do not hesitate to start sharing your expectations, thoughts and ideas for the course via Twitter using #stemcourse, our Facebook page or our Facebook group!\n\n                                    ", 
    "end_date": "2014-10-13T00:00:00Z", 
    "title": "Innovative Practices for Engaging STEM Teaching", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "European Schoolnet Academy"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.europeanschoolnetacademy.eu/web/innovative-practices-for-engaging-stem-teaching-ii", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2014-08-18T00:00:00Z"
}