{
    "selfpaced": false, 
    "topic_name": [
        "STEM"
    ], 
    "description": "\n\n                    \n                    \n                    L'approccio didattico Tinkidoo vi servirà proprio ad avere una metodologia per diventare EDUCATORI DIGITALI e trasferire le competenze digitali e le soft skills necessarie. Un framework didattico ispirato alla pedagogia montessoriana del learning by doing e disegnato secondo i principi del Design Thinking.\r\nGli smart toys diventano lo strumento di coinvolgimento per insegnare: coding, robotica, matematica, scienze e tutte le discipline STEAM attraverso un approccio di apprendimento innovativo e divertente.\r\n*Dimmi e dimenticherò, mostrami e forse ricorderò, coinvolgimi e comprenderò.*\r\nConfucio\r\nStruttura del corso #ToysMOOC\r\n6 lezioni in cui impareremo cosa vuol dire, con i linguaggi complessi a cui sono eposti i bambini, reinterpretare i valori della pedagogia montessoriana e di quella del gioco alla luce delle nuove esigenze di apprendimento.\r\nUtilizzeremo alcuni degli smart toys più esemplificativi per la didattica di Tinkidoo, tra i quali il Cubetto di PrimoToys, Dash and Dot e Mbot non sono per aiutare gli educatori a disegnare attività, ma soprattutto per scoprire quale strumento si adatti meglio alle esisgenze didattiche di ciascun gruppo.\r\nPersonalizzare e rendere più efficaci i percorsi di educazione formale ed informale, utilizzando i giocattoli digitali come tools.\n\n                                            Syllabus\n                        Lezione 1: Tinkidoo framework: presentazione del corso e della metodologia Lezione 2: L'approccio al gioco a tutte le età Lezione 3: Sensorialità ed esperienza: la maker education Lezione 4: Diventare Educatore Digitale: approcci, competenze e skills Lezione 5: Storytelling e competenze digitale Lezione 6: Design thinking (for educators) Lezione 7: DESIGN THINKING: a case history Lezione 8: INTERNET OF TOYS\n                                    ", 
    "end_date": "2016-06-09T00:00:00Z", 
    "title": "Smart toys for smarter kids. Diventa educatore digitale!", 
    "price": 0, 
    "instructors": "Sonia China", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://platform.europeanmoocs.eu/course_smart_toys_for_smarter_kids_di", 
    "duration": "10 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "EMMA"
    ], 
    "start_date": "2016-03-31T00:00:00Z"
}