{
    "selfpaced": false, 
    "topic_name": [
        "STEM"
    ], 
    "description": "\n\n                    \n                    \n                    This free online course aims to help teachers in primary schools and at Key Stage 3, who are delivering the Computing curriculum, which was introduced to schools in England in September 2014.\n\nGet the latest information, to teach great Computing lessons\n\nWith a mixture of subject knowledge and pedagogical advice, the course is aimed at both subject specialists and primary teaching non-specialists.\n\nExpert Master Teachers from Computing at School have helped to design it, to make sure you have the latest information to take into your classroom and teach great Computing lessons.\n\nUnderstand the new Computing curriculum and how to deliver it\n\nComputing encompasses many of the skills that used to be taught under the old subject, ICT, but the new curriculum is also enhanced with computer science skills, as well as digital literacy, digital citizenship and digital scholarship.\n\nOver six weeks, you’ll develop the skills you need to teach the new curriculum, getting both subject knowledge guidance, as well as advice about planning, teaching and assessing pupil learning.\n\nThe course will link to materials in the BBC’s Make it Digital initiative, enabling teachers to include these exciting new materials in their teaching.\n\nAt the end, you’ll also consider what’s next, with advice on subject leadership and developing a computing policy for your school.\n\nThroughout, you will have the chance to work with other teachers and experts in a flexible, self-paced learning environment.\n\n\n                                    ", 
    "end_date": "2015-10-12T00:00:00Z", 
    "title": "Teaching Computing", 
    "price": 0, 
    "instructors": "Helena Gillespie", 
    "institution_name": [
        "University of East Anglia"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.futurelearn.com/courses/teaching-computing?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}