{"selfpaced": true, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    One of the most fundamental types of apps you can create is one with a hierarchical data model and style of navigation. In this course we're going to learn exactly how to do that by building an interactive story app. We'll cover a lot of ground by exploring navigation controllers, hierarchical data models and custom view controllers.\r\nWe'll go over how to accept user input, how to create and layout views programmatically, how to play sound effects and much more. At the end of this course, you will have the knowledge to build many of the basic apps you see in the app store.\r\nWhat you'll learn\r\n\r\nUINavigationController\r\nNotifications\r\nLayout anchors and constraints\r\nAudio APIs\r\n\n\n                                            Syllabus\n                        Navigating Through An Adventure \r\nOne of the most fundamental types of apps you can create is one with a hierarchical data model and style of navigation. In this course we're going to learn exactly how to do that by building an interactive story app. In the next set of videos we'll start by exploring what a navigation controller is, how to add one to our app and how to transition to different views.\r\nCreating a Story\r\nAll apps need a model to work with and over the next set of videos we're going to build the model layer to power our story. Since the model involves many moving parts, we'll break things up by building a Story object to represent the narrative, a Page object to represent a page in a story and a wrapper object to create an adventure with the two components.\r\nCreating the User Interface Programmatically\r\nSo far we've only created and laid out views using a Storyboard scene but you can do every single thing that's possible in a Storyboard in code as well. Over the next few videos, we're going to create, position and size the entire user interface for the PageController in code. We'll learn how to use layout anchors and create constraints programmatically as well as how to add views to the navigation stack.\r\nRefactoring the Model Layer\r\nOur app is essentially complete, but we'd like to offer users the ability to customize the story by inserting their name at certain points. For this we need to both refactor the model and add a new UI element. Over the next set of videos, we'll modify the Story enum to allow this and add a text field to the first page in our app. This won't be simple though and as you'll see we'll have to move the text field around to accommodate this new design.\r\nAdding Sound Effects\r\nTo round this course off let's add a fun feature where we play a sound every time a user selects a choice. We'll keep this short and simple and figure out how we can use the simplest (but not the safest!) audio API to play a system sound.\n                                    ", "end_date": null, "title": "Build an Interactive Story App with Swift 2", "price": 25.0, "instructors": "", "institution_name": [], "commitment": "3 hours", "subject_name": ["Programming"], "course_url": "http://treehouse.7eer.net/c/259799/289771/3944", "duration": null, "language_name": ["English"], "provider_name": ["Treehouse"], "start_date": "2016-06-07T00:00:00Z"}