{"selfpaced": false, "topic_name": ["Mobile Development"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Programming\n                                                                                                    &gt; Mobile Development\n                                                            \n                            \n                                                \n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/androidapps101\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/androidapps101-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    androidapps101-001\n                                                                    androidapps101-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    \nThis course is a novice-friendly and delightful introduction to computer science and to programming Android apps for smartphones and tablets. No prior programming knowledge is necessary. In this course you will have fun learning to create an app for modern Android devices, such as the Nexus tablet.\nYou will use the programming tools that Android software developers use to build your own useful app during this course. Along the way, we will introduce fundamental computer science principles and programming ideas that power today’s smartphone and tablet apps.\nWe will also peek beyond the borders of Android programming to the world of computer science. Meet computer science undergraduates, see one of the first vacuum tube computers, the first transistor, and now-modern scientific research on the Blue Waters supercomputer—all at Illinois.\n\nAndroid Developer Track: Weeks 1–5 (required for passing the course):\nThis portion of the course is intended to give you a slow and gentle introduction to the basics of Android application development such as downloading, installing, and setting up the tools you will use in this course. You will also create your first Android app and share the results of your experience with your classmates—all while writing hardly any code at all! \nComputer Science and Programming Track: Weeks 6–8 (optional):\nDuring this latter portion of the course, you can delve deeper into computer science fundamentals and beginner programming techniques. Together we will explore this content while developing another really cool project to share.\n\n                                            Syllabus\n                        This course is composed of 2 tracks organized into 8 distinct weekly topics:\n\nAndroid Developer Track\nWeek 1: An App for Hello World\nWeek 2: A Simple App for ILLIAC\nWeek 3: A Working App for ILLIAC\nWeek 4: An App for Emily\nWeek 5: A Simple Web App and Debugging Code in 0g\nComputer Science and Programming Track\nWeek 6: An App to Share My Views\nWeek 7: An App for Bitmaps and Images\nWeek 8: An App for Moving Pixels\n\n \n                                    ", "end_date": "2014-12-15T00:00:00Z", "title": "Creative, Serious and Playful Science of Android Apps", "price": 0, "instructors": "Lawrence Angrave", "institution_name": ["University of Illinois at Urbana-Champaign"], "commitment": "5-10 hours", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/course/androidapps101", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-10-20T00:00:00Z"}