{"selfpaced": false, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    Este curso te permitirá construir tu primer aplicación móvil profesional. Serás capaz de crear y controlar la vida de tus Activities y aprovechar el espacio en pantalla de los diferentes dispositivos Android implementando Fragments en tus aplicaciones. \n\nDale persistencia a tu información utilizando todas las formas de almacenamiento que hay en Android desde un único archivo hasta una Base de Datos.\n\nPodrás evaluar lo aprendido por medio de ejercicios prácticos que te permitirán ir desarrollando tu aplicación.\n\n                                            Syllabus\n                        Integrando Material Design a nuestro proyectoEn este módulo reconocerás cómo funciona Material Design en Android a nivel código. También, lo integrarás a tus proyectos para personalizar tus aplicaciones tanto como tu marca personal lo requiera.ActivitiesAquí descubrirás por completo el concepto de Activity. No es sólo una pantalla más de nuestra aplicación, también aprenderemos a controlarla desde su ciclo de vida, podremos producir todos los eventos posibles con los botones de acción back y home.RecyclerViewEn este módulo dominarás por completo este nuevo elemento de Material Design. Aprenderás  a implementarlo a detalle para hacer tus aplicaciones más eficientes.AppBar / Action Bar En este módulo podrás estilizar el App Bar de una aplicación y darle un estilo homogéneo en todas las versiones de Android. Manipularás todas los botones de acción, desde el botón de subir hasta views propios insertados en el AppBar.MenúsEn este módulo implementarás en tus proyectos los diferentes tipos de menús que existen en Android. FragmentsEn este módulo profundizaremos en los Fragments para entender por qué existen. A través de ejemplos prácticos, descubrirás la importancia de tenerlos presentes en nuestras aplicaciones.Sistema de permisos Aprende todo sobre la nueva forma de gestionar permisos en Android practicando cómo funciona  internamente todo este mecanismo para crear, así, aplicaciones confiables para tus usuarios.Almacenamiento En este modulo conocerás todas las formas de almacenamiento interno que puedes utilizar en Android, es muy importante que las aprendas pues así lograrás que tus aplicaciones trabajen en modo off-line la mayor cantidad de tiempo posible, es decir, que estas puedan seguir funcionando sin necesidad de estar conectadas a internet.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Desarrollo de aplicaciones con Android", "price": 0, "instructors": "Anahi Salgado", "institution_name": ["Universidad Nacional Autónoma de México"], "commitment": "", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/learn/desarrollo-de-aplicaciones", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}