{"selfpaced": true, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    Do you have some experience building apps for the iPhone or iPad and want to build an app from the ground up, but don't know where to begin? Look no further! In this course, you'll learn the process of building an iOS app, from brainstorming ideas to publishing on the App Store.Why Take This Course?Building an app from scratch is a time-consuming, but rewarding process. Don't let the length of the lessons fool you!\n\nThis course is unique in that you'll spend most of your time outside of the classroom, working on your app. We'll point you in the right direction to find resources and make progress, but it will be up to you to implement.\n\nBy the end of the course, you'll have built you very own custom iOS app, and have the confidence to do it all again.\n\n                                            Syllabus\n                        ###Lesson 1: Research\nIn this first lesson, you'll brainstorm and vet multiple app ideas. You'll begin to think about the UI elements used in each, get user feedback on the designs, as well as start thinking about relevant web APIs and libraries to use.\n\n###Lesson 2: Build\nIn this lesson, you'll choose an idea to pursue and build it! We'll share tips for getting started, dealing with code that doesn't work, and how to submit to the App Store.\n\n###Lesson 3: Reflect\nIn this last lesson, you'll reflect on the process: what went well, and what you might do differently next time. Recognizing and learning from mistakes is what makes you a better developer!\n                                    ", "end_date": "2015-07-23T00:00:00Z", "title": "How to Make an iOS App", "price": 0, "instructors": "Jessica Uelmen", "institution_name": [], "commitment": "6 hours", "subject_name": ["Programming"], "course_url": "https://www.udacity.com/course/how-to-make-an-ios-app--ud607?utm_medium=referral&utm_campaign=api", "duration": "12 weeks", "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2015-04-30T00:00:00Z"}