{"selfpaced": true, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    In this course, you’ll learn how to incorporate networking into your apps, so they can access data from around the world. You’ll learn how to harness the power of APIs to display images and retrieve movie data. At the end of the course, you’ll build the “On the Map” app which allows you to share interesting links, projects, or other information with fellow Udacity students.Why Take This Course?Without networking, mobile apps can only perceive, process, and present the data that is local to the host device. This greatly restricts the scope of problems which apps can solve and limits their overall utility. By incorporating networking, apps truly become “mobile” -- they can interact with interesting data using popular web services, coordinate multi-user activities, and build experiences that bring users together.\n\nThis course will cover concepts fundamental to communication over the network like HTTP, JSON, and authentication. These concepts are also highly transferrable to other platforms, languages, and applications. Additionally, it will mold your understanding of app design, especially when networking constraints are involved.\n\n                                            Syllabus\n                        ###Lesson 1: Networking and Web Services\nIn this lesson, you’ll learn all about networks and how they work. You’ll also build your first app that utilizes a web service: “Sleeping in the Library.” This app uses the Flickr API to pull pictures of people sleeping in libraries.\n###Lesson 2: Building “Flick Finder”\nIn this lesson, you’ll learn how to parse JSON data and display it to a user. You’ll demonstrate these new skills by building the “Flick Finder” app, which displays Flickr images based on a phrase or location.\n###Lesson 3: The MovieDB and Authentication\nIn this lesson, you’ll learn the difference between user and anonymously accessed data. You’ll do so by building the “My Favorite Movies” app that utilizes the Movie Database API.\n###Lesson 4: Improving Networking with MVC\nIn this lesson, you’ll improve on your “My Favorite Movies” app to build the “Movie Manager” app. For this app, we’ll be sure to use good MVC design, and learn what this means from a networking perspective.\n###Lesson 5: Preparing for “On the Map”\nIn this lesson, you’ll start on your final project app, “On the Map.” You’ll also learn about network reliability, and how your app should behave if a network can’t be reached.\n                                    ", "end_date": "2015-06-12T00:00:00Z", "title": "iOS Networking with Swift", "price": 0, "instructors": "Jarrod Parkes", "institution_name": [], "commitment": "6 hours", "subject_name": ["Programming"], "course_url": "https://www.udacity.com/course/ios-networking-with-swift--ud421?utm_medium=referral&utm_campaign=api", "duration": "12 weeks", "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2015-03-20T00:00:00Z"}