{"selfpaced": false, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    En este curso aprenderás todas las bases del lenguaje de programación Swift. Revisarás temas básicos, desde variables hasta el desarrollo de un par de aplicaciones.\n\nSi eres un programador consolidado en Objective - C / iOS o eres un programador nuevo para la familia de dispositivos de Apple, ¡este curso es para ti! Repasarás temas muy básicos, como constantes y variables, revisarás los fundamentos del lenguaje y conceptos importantes, como opcionales, closures, funciones y muchos otros temas. Estarás trabajando con la versión 2.0 de Swift y aprenderás los cambios que han ocurrido y cómo aplicarlos en el desarrollo de una mejor aplicación móvil para iOS. \n\n¡Bienvenido al curso: Swift, programar para iOS!\n\n                                            Syllabus\n                        Programación en Swift¡Bienvenido al asombroso mundo del desarrollo de aplicaciones móviles en iOS! Durante este módulo conocerás al instructor, instalarás Xcode, conocerás las bases de Swift, y aprenderás cómo definir variables y constantes, tipos de datos y playgrounds.Decisiones, ciclos y... ¡datos, datos y más datos!Esta semana tomemos decisiones, repitamos cosas, experimentemos las colecciones de Swift y ¡corramos pruebas de tu código!Creación de bloques de código... ¡funciones y opcionales!Esta semana dominarás el concepto de funciones, parámetros, valores de retorno, tuplas y opcionales. Programación orientada a objetosEsta semana aprenderás a utilizar enumeraciones y estructuras que son elementos básicos para entender la programación orientada a objetos de Swift.¡Crea tu primera app!Para concluir este curso, revisaremos los temas vistos, tales como las clases, objetos, inicializadores, valores por defecto y todo lo necesario para que domines la programación orientada a objetos de Swift. \n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Swift: programar para iOS", "price": 0, "instructors": "Dr. David Alejandro Escárcega Centeno, Dr. José Martín Molina Espinosa, Dr. Víctor Manuel de la Cueva Hernández and Dr. Rafael Lozano Espinosa", "institution_name": ["Tecnológico de Monterrey"], "commitment": "", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/learn/swift", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}