{"selfpaced": false, "topic_name": ["Grammar & Writing"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Humanities\n                                                                                                    &gt; Grammar &amp; Writing\n                                                            \n                            \n                                                \n                    \n                    \n                    Course 1: Grammar and Punctuation\n\nDo you need to review English grammar? Have you forgotten the grammar you once studied? If so, this course is perfect for you.\n\nThe first course in this specialization is a refresher on some tools needed for good writing. It will help prepare you for the other courses. You will need about 10 hours to complete this first course. Writing is a skill and to learn a skill well, you need to practice. In this course, you will watch short video lectures and then practice and discuss what you have learned. Make sure you take good notes and use the peer discussions to ask questions. Then you'll be able to remember the rules you learn in this course when you start writing essays in the next course.\n\nAfter completing this course, you will be able to:\n - identify the correct verb tenses to use\n - use commas effectively\n - utilize several different sentence types\n - write more effectively in English\n\n                                            Syllabus\n                        Course IntroductionThis is the first course in the Academic English: Writing specialization, which will help prepare you for studying in an American college or university. This first course will go over some of the basics of grammar and punctuation that you'll need to do good writing. It is not intended to review all aspects of English grammar, only the few topics chosen for this class. In this short module, to get started, introduce yourself and get to know the other learners a little bit. In the following lessons, you will watch video lectures, do readings, do practice exercises, and take quizzes. To pass the course, just pass all three quizzes. When you finish one activity, then go on to the next one. Enjoy the class!Verb Tenses and ConjunctionsIn this module, you will watch video lectures, do readings, do practice exercises, and take quizzes. You can re-watch the videos or redo the exercises as many times as you need to to help you understand the material. This module will help you review verb tenses and how to use them correctly. You probably already studied these in your other English classes, so this will just be a quick reminder. Then you'll begin learning about how to use conjunctions in your sentences. This will help you write different kinds of sentences and make your writing more interesting.Compound and Complex SentencesNow that you've learned about conjunctions, you're ready to learn about different types of sentences. In English, there are four types of sentences that you can use--and should use--to make your writing more interesting to read. In this module, you'll learn about two of the advanced sentence types.More Commas, Parallel Structure, and Sentence VarietyIn this module, you'll learn some other uses for commas. After studying this module, you'll know about 95% of the ways commas can be used. That means you'll be able to write confidently, knowing that you are using commas correctly and not just guessing. In addition to learning about commas, you'll learn about creating parallel structure and sentence variety. When you add these to your writing tools, your writing will be even more effective.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Grammar and Punctuation", "price": 0, "instructors": "Tamy Chapman", "institution_name": ["University of California, Irvine"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/grammar-punctuation", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}