{"selfpaced": false, "topic_name": ["Grammar & Writing"], "description": "\n\n                    \n                    \n                    This is the first course in the Learn English: Intermediate Grammar specialization. In this course, you will learn about important intermediate verb tenses, including present perfect, present perfect progressive, past perfect, and past perfect progressive. You will also learn about common modal verbs used in English. This course is designed for learners who have a basic understanding of English grammar but who want to learn more and improve their skills for everyday speaking or writing, as well as for academics. It will be a fun class with lots of entertaining and informative video lectures.\n\n                                            Syllabus\n                        WelcomeWelcome to the first course in the Learn English: Intermediate Grammar specialization. This course will cover the perfect verb tenses and modals. You will watch fun videos and do practice activities to help you learn this important grammar. If you have paid for the certificate for this course, you will also be able to participate in discussions and peer reviews to help you learn. To earn a certificate, you must pass several quizzes and assignments.Present Perfect TenseThis week, you will learn about the present perfect verb tense. You will learn how to use it to form questions, answers, and statements, and you will learn when to use present perfect tense.Present Perfect ProgressiveNow that you've learned about the present perfect tense, you're going to learn about the present perfect progressive. To start, you'll review when to use progressive tenses in English. Then you'll learn how to form the present perfect progressive and how it is different from present perfect.Past Perfect and Past Perfect ProgressiveThis week, you'll learn what the past perfect is and when to use it. You'll practice using the correct form, and you'll also learn the difference between present perfect and past perfect.Modals--Ability, Possibility, Preference, and ImpossibilityIn this last week, you are going to learn a lot. This module is all about modal verbs. English has a lot of these, and here you're going to learn about many of them. They will help you talk about abilities, possibilities, impossibilities, and preferences.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Perfect Tenses and Modals", "price": 0, "instructors": "Tamy Chapman and Emily Wong", "institution_name": ["University of California, Irvine"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/perfect-tenses-modals", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}