{"selfpaced": false, "topic_name": ["Grammar & Writing"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Humanities\n                                                                                                    &gt; Grammar &amp; Writing\n                                                            \n                            \n                                                \n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    sciwrite-2012-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This course trains scientists to become more effective, efficient, and confident writers. This is a hands-on course that emphasizes interactive examples and practice. In the first four weeks, we will review principles of effective writing, examples of good and bad writing, and tips for making the writing process easier. In the second four weeks, we will examine issues specific to scientific writing, including: authorship, peer review, the format of an original manuscript, and communicating science for lay audiences. Students will complete editing exercises, write two short papers, and edit each others’ work. The primary audience is undergraduate science majors, graduate students in scientific disciplines, and professional scientists. Students from non-science disciplines can also benefit from the training provided in the first four weeks (on general principles of effective writing).Subtitles for all video lectures available in: English, Portuguese (provided by Lemann Foundation).\n\n                                            Syllabus\n                        Week 1 (September 24-30): Introduction; principles of effective writing (cutting unnecessary clutter)Week 2 (October 1-7): Principles of effective writing (verbs)Week 3 (October 8-14): Crafting better sentences and paragraphsWeek 4 (October 15-21): Organization; and streamlining the writing processWeek 5 (October 22-28): The format of an original manuscriptWeek 6 (October 29-Nov. 4): Reviews, commentaries, and opinion pieces; and the publication processWeek 7 (November 5-11): Issues in scientific writing (plagiarism, authorship, ghostwriting, reproducible research) Week 8 (November 12-18): How to do a peer review; and how to communicate with the lay public\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Writing in the Sciences", "price": 0, "instructors": "Kristin Sainani", "institution_name": ["Stanford University"], "commitment": "4-8 hours", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/course/sciwrite", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2012-09-24T00:00:00Z"}