{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    This 4-week course will feature a new season each week through short lectures and activities covering Great Lakes weather, observed changes in the climate, and societal impacts of climate change. Learn how the mid-latitude location of the Great Lakes Region and the influence of five massive and stunning fresh-water lakes combine to create exhilarating weather systems each season. Winters are cold and snowy; spring brings thunderstorms, heavy rains and tornadoes; summers are hot and humid and the transition to autumn paves the way for especially windy storms like the one that sunk the Edmund Fitzgerald (a massive iron ore freighter that sank in Lake Superior in 1975). On top of all this, climate change is adding to the complexity. Numerous observations demonstrate that the climate of the Great Lakes Region is changing. Average temperatures are getting warmer and extreme heat events are occurring more frequently. Total precipitation is increasing and heavy precipitation events are becoming more common. Winters are getting shorter and duration of lake ice cover is decreasing.  We’ll share the data with you before focusing on people and communities adjusting to these changes. And to slow the rate of future climate change, we’ll share actions you can take that benefit you and everyone who loves the weather and climate of the Great Lakes Region. \n\n                                            Syllabus\n                        Each week of the course examines the weather of each season, observed climate change and expert interviews exploring relevant issues and changes that are underway. Week 1: Winter: (Dec-Jan-Feb) You will learn about classic storm tracks, lake effect snow, extreme winter events and weather safety as well as changes in snow cover, temperature and lake ice.  Week 2: Spring: (Mar-Apr-May) This week will focus on the water cycle in the Great Lakes Region and how heavy precipitation events affect urban areas. Week 3: Summer: (Jun-Jul-Aug) Week three will feature content on air quality, heat waves and severe summer storms. Week 4: Fall/Autumn: (Sept-Oct-Nov) The final week of the course examines the sometimes turbulent weather of the Great Lakes region in autumn. We will also learn about agriculture in the region and some ways individuals can mitigate and adapt to changing climate conditions.\n                                    ", "end_date": "2015-03-23T00:00:00Z", "title": "Changing Weather and Climate in the Great Lakes Region", "price": 0, "instructors": "Steven Ackerman and Margaret Mooney", "institution_name": ["University of Wisconsin–Madison"], "commitment": "1-3 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/course/greatlakesclimate", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-02-23T00:00:00Z"}