{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    Conçu conjointement par le think-tank Ecolo-Ethik et ESCP Europe, ce MOOC se propose de vous aider à dépasser les idées reçues sur l’écologie, dans le souci d’une démarche ouverte et multiple.\n\nA ce titre, de grands experts reconnus interviendront pour illustrer, approfondir et enrichir les différentes thématiques.\n\nNotre ambition est triple :  \n- Éclairer l’écologie, vous montrer en quoi et pourquoi elle est le fondement de notre monde, de notre existence même, et de celle de nos descendants. \n- Vous montrer que l'écologie ouvre à une nouvelle culture, de nouveaux modèles de développement et de nouvelles organisations de la société. \n- Vous montrer qu'elle est le socle indispensable à une économie innovante, durable, dans une société ouverte et créative. \n\nCe MOOC s’adresse à toutes et à tous, quels que soient votre situation, votre lieu de vie, vos projets. \n\nCe cours est organisé en 5 modules traitant du climat, de l'énergie, de la biodiversité, de l'économie et des enjeux de société. Chaque module donnera lieu à une évaluation des connaissances acquises.\n\nVoir la présentation vidéo du cours : https://www.youtube.com/watch?v=uXXx3MWvhpA\nPremier lancement le 1er février 2016, ensuite une session débute chaque mois.\n\n                                            Syllabus\n                        Module 1 : Les changements climatiques sont-ils théoriques ?Comment fonctionnent les gaz à effet de serre ? Quelles en sont les conséquences pour l'environnement, pour les hommes ? Que sont les climato-sceptiques ? Quelles implications juridiques ?                  Suivez ce module pour tout savoir sur les changements climatiques...et bien plus encore !                   Module 2 : L’énergie peut-elle être infinie ?L'objectif est de comprendre les enjeux écologiques, économiques et stratégiques de l'énergie. Pourquoi la controverse sur l'épuisement des énergies fossiles ? Quels liens entre développement économique et énergie ? Quelles sont les voies d'innovation ? En suivant ce module, vous aurez toutes les réponses !Module 3 : La biodiversité est-elle nostalgique ?Cette semaine, nous allons aborder la biodiversité sous toutes ses formes. Qu'est-ce que la biodiversité ? Quels sont ses enjeux ? Quelle est la place de l'océan ? Module 4 : Enjeu économique, l’écologie se résout-elle dans la décroissance ou les inégalités ?Cette semaine, plongez au cœur de la dimension économique pour comprendre les enjeux de l'écologie. Quels sont les enjeux économiques ? Ceux liés à la consommation ? Existe-t-il des nouveaux modèles ?Module 5 : Enjeux sociétaux - approches transversales Cette semaine, vous comprendrez les liens entre les grandes pathologies et l'environnement, et  l'inadaptation du système sanitaire face à ce défi.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Comprendre l'écologie, pour une économie innovante", "price": 0, "instructors": "Professeur Olivier Delbard and Chantal Jouanno", "institution_name": ["ESCP Europe"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/ecologie", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}