{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    This MOOC enhances knowledge and skills for tackling complex issues such as resilience and transformation, sustainable development, ecosystem management, disaster risk reduction, climate change adaptation and how they can be operationalized. It will benefit disaster managers and practitioners, climate change adaptation professionals, development planners, project implementers and policy makers. The course will be delivered through a series of lectures and case studies, quizzes, peer-reviewed exercises, along with additional study materials provided to the students. Lectures will be available through videos as well as online documents and will be geared for students who may not have access to high speed internet so they can follow the course. Students will be provided the opportunity to enhance their critical thinking through real life and fictitious problem solving exercises. Each week will feature an international expert who will be available to respond to questions and interact with students.\r\nWhat will I learn?\r\nAfter completion of the course, the participant will be able to:\r\n\r\nDefine basic concepts of disasters, disaster risk reduction, climate change adaptation and resilience.\r\nRecognize key linkages between ecosystems, disaster risk reduction and climate change adaptation.\r\nRecognize the linkages and overlaps between ecosystem based disaster risk reduction and ecosystem based adaptation.\r\nIdentify various ecosystem based tools in reducing disaster risk and climate change adaptation.\r\nIdentify key international agreements, organizations and initiatives related to disaster risk reduction, and climate change adaptation.\r\nApply concepts and tools of ecosystem-based disaster risk reduction (Eco-DRR) and ecosystem based adaptation (EbA).\r\nEvaluate costs and benefits of different type of measures for reducing disaster risks.\r\nDesign your own ecosystem-based project for increasing resilience and reducing climate risks.\r\n\n\n                                            Syllabus\n                        The course is structured in two parts:\r\nThe leadership track, which is tailored for busy professionals or students curious about the topic. The leadership track will run three weeks.\r\nThe expert track is for professionals and students who seek more in-depth learning and skill development in applying ecosystem-based tools for disaster risk reduction and adaptation. The expert track will run 12 weeks with 3 weeks for the final assignment, peer review process and course wrap-up. Each unit has several quizzes, a concise background document for further reading, a discussion forum, supplementary videos with interviews with international experts and short documentary videos from around the world. In addition, world leaders were interviewed for our MOOC.\n                                    ", "end_date": "2015-02-02T00:00:00Z", "title": "Disasters and Ecosystems: Resilience in a Changing Climate", "price": 0, "instructors": "Dr. Karen Sudmeier-Rieux", "institution_name": [], "commitment": "3 hours", "subject_name": ["Science"], "course_url": "https://iversity.org/en/courses/disasters-and-ecosystems-resilience-in-a-changing-climate", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2015-01-12T00:00:00Z"}