{"selfpaced": true, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    This course is designed to introduce students to the issues of energy in the 21st century – including food and fuels – which are inseparably linked – and will discuss energy production and utilization from the biology, engineering, economics, climate science, and social science perspectives. \n\nThis course will cover the current production and utilization of energy, as well as the consequences of this use, examining finite fossil energy reserves, how food and energy are linked, impacts on the environment and climate, and the social and economic impacts of our present energy and food production and use. After the introductory lectures, we will examine the emerging field of sustainable energy, fuel and food production, emphasizing the importance of developing energy efficient and sustainable methods of production, and how these new technologies can contribute to replacing the diminishing supplies of fossil fuels, and reduce the consequences of carbon dioxide release into the environment. This course will also cover the importance of creating a sustainable energy future for all societies including those of the developing world.  Lectures will be prepared and delivered by leading UC San Diego and Scripps Institution of Oceanography faculty and industry professionals across these areas of expertise.\n\n                                            Syllabus\n                        General Course MaterialsCourse overview materials, including syllabus, lecturer information, grading criteria, and external notices and resources.Introduction to EnergyIntroduces the basics of energy, covers finite energy sources like petroleum, looks at how energy and food are related, and examines the scale of current and future energy consumption and what renewable energy options can meet that demand.Physical Energy SourcesLooks at some of the alternative energy options from the physical sciences domain, including wind energy, photovoltaic and photothermal energy, and nuclear energy. It also covers energy storage and electric vehicles, and energy efficiency and smart grid technologies.Introduction to Biological Energy SourcesProvides an overview of the different biological energy sources including plants and algae. It explains what biofuels are, how they are produced, and the pros and cons of different biological sources. Plant BiofuelDiscusses various plant-based fuels including corn ethanol, cellulosic ethanol, and jatropha biodiesel. It will cover the different technologies used, the pros and cons of each source, and current production around the world.Algae BiofuelExamines different algae used for biofuel production including cyanobacteria, diatoms, and green algae. It looks at how these organisms are different and why they are used to produce biofuels and bio-products.  Additionally, the module covers the different tools and technologies used in research and production including bio-prospecting, genetics, synthetic biology, and metabolic engineering. Biofuel Production and Downstream ProcessingCovers the chemistry of biodiesel, looks at the different thermochemical processes used to convert biomass to fuel, and examines renewable biogas. It also looks at the production process of algae biofuel, how and why nutrient utilization and recycling is important in biofuel production, and the relationship between biofuel and water. Social Issues, Economics, and PoliticsExamines how energy production and use affects the economy, our wellbeing, and our heath. It will also look at how energy impacts the poorest communities, the external costs of traditional energy, and how we can regulate energy and incentivize renewable energy. Additionally, this section identifies what a Life Cyle Assessment is and how it is used with renewable and non-renewable fuels. Lastly, it looks at the United States’ past and present energy policies, and the current state of international policy on climate change. Climate ChangeLooks at the history of research on how carbon dioxide causes climate change, the key points of the Intergovernmental Panel on Climate Change’s reporting, and how climate change is portrayed in the media. Also, it discusses the importance of decreasing Short-lived Climate Pollutants (SLCPs) to mitigate climate change and some possible solutions to reduce these pollutants produced by the poorest communities. Additionally, this section looks at how climate change has affected California’s water and energy use, and how climate change threatens global food security. Office HoursRecordings of live office hours from Dr. Mayfield and other course lecturers. \n                                    ", "end_date": "2014-11-24T00:00:00Z", "title": "Our Energy Future", "price": 0, "instructors": "Stephen Mayfield", "institution_name": ["University of California, San Diego "], "commitment": "4-5 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/future-of-energy", "duration": "9 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-09-22T00:00:00Z"}