{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    In this MOOC, you will make the most of the new possibilities offered by MOOC technology. You will experiment with a new interactive way to learn while applying your knowledge to real case studies in a “serious game”, designed specifically for this MOOC!You will get a glimpse of the life of a new employee in the “MOOC Energy Company”, test an engine at a realistic test bench, optimize gasoline and diesel fuel production in a refinery,…”\r\nAfter successfully completing this course, participants will be able to:\r\n      Identify the different energies sources, the importance of oil and how it is used in transport and its consequences regarding the environment\r\n      Explain the operation of a 4-stroke engine\r\n      Explain the specifications of gasoline and diesel and the objectives of each unit during the crude refining process\r\n      Explain the engine’s efficiency, the power and the torque\r\n      Explain the formation of pollutant emissions, identify the techniques used to reduce emissions and consumption and finally identify the different after treatment systems\r\n      List the pros and the cons of hybrids and explain how they work; list the various alternative fuels used, and finally describe possible solutions for reducing dependency on petroleum products –e.g. car sharing or ecodriving.\n\n                                            Syllabus\n                        Week 1:\r\nYou will explore the international energy scene and the global economic environment, so as to better understand the major energy issues. \r\nYou will also discover the environmental regulations which work to improve efficiency in the automotive sector.\r\nWeek 2:\r\nAfter a technical introduction to engines, we will study the basic concepts of fuels and refining.\r\nWe will take a look at how diesel and gasoline are produced respecting the technical specifications of different countries.\r\nWeek 3:\r\nYou will first discover engine design and powertrain components.You will then study the formation of pollutants in engines and the technology used to reduce these emissions such as after-treatment systems\r\nWeek 4:\r\nThis final week will be the opportunity to draw up a panorama of technologies being developed at present.\r\nWe will interview experts from IFP Energies nouvelles and ask them to identify technologies worth exploring such as hybrids, biofuels or hydrogen.\r\nWe will also cover new initiatives that are being developed such as car sharing, carpooling and smart driving.\n                                    ", "end_date": "2015-11-30T00:00:00Z", "title": "Sustainable Mobility", "price": 0, "instructors": "Nadine Bret-Rouzaut", "institution_name": ["IFP School"], "commitment": "2-3 hours", "subject_name": ["Science"], "course_url": "http://mooc.sustainable-mobility.ifp-school.com/", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Independent"], "start_date": "2015-11-02T00:00:00Z"}