{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    \r\n“The Age of Sustainable Development” gives students an understanding of the key challenges and pathways to sustainable development – that is, economic development that is also socially inclusive and environmentally sustainable.\r\n\r\nBy joining the global student community that makes up the Age of Sustainable Development, you are also becoming part of a global movement of practitioners committed to achieving sustainable paths to development. The success of the course depends on an active student base representing a diversity of experiences, geographies, and perspectives, so add your voice to the global discussion by registering today.\r\nThis course provides an introduction to the interdisciplinary field of sustainable development, drawing on the most recent developments in the social, policy, and physical sciences. Sustainable development is the most urgent challenge facing humanity. The fundamental question is how the world economy can continue to develop in a way that is socially inclusive and environmentally sustainable. The course describes the complex interactions between the world economy and the Earth’s physical environment. Ecological processes and constraints (climate, disease ecology, physical resources such as soils and energy sources, topography and transport conditions) significantly shape the patterns of economic development, demography, and wealth and poverty. At the same time, human activities (farming, land use, urbanization, demographic change, and energy use) change the physical environments, increasingly in dangerous ways. The course offers a broad overview of the key challenges and potential solutions to achieve sustainable development in the 21st century.\r\nThroughout the course, Professor Sachs will hold live google hangouts to answer all your questions about the course and sustainable development issues, in addition to discussion forums where you can engage with fellow students and course staff. And this Fall there will be a special bonus for students – all registered students will receive access to a free e-Book that Prof. Sachs written for the course, The Age of Sustainable Development, which will be published by the Columbia University Press. The book will be available for purchase in bookstores and online in early 2015, but will be available to view for all students who register for the Fall Semester; those students who complete the course will be able to keep the book free of charge.\r\nWe have indeed entered the Age of Sustainable Development, and this coming year and a half, till the end of 2015, will be a pivotal year in the history of sustainable development. The world has undertaken to conclude negotiations on three great topics by the end of 2015: the new Sustainable Development Goals (SDGs), a new framework for global sustainable development financing, and a new climate change agreement! During the Fall course, we will discuss all of these major negotiations, and have several opportunities for live web chat interactions, including Q&amp;A.\n\n                                            Syllabus\n                        Lecture 1: What is Sustainable Development?\r\n\r\nChapter 1: Introduction to Sustainable development\r\nChapter 2: Economic growth and progress\r\nChapter 3: Continuing poverty\r\nChapter 4: Environmental threats hitting the rich and poor alike\r\nChapter 5: The business as usual path versus the sustainable development path\r\n\r\nLecture 2: Economic Development – How we measure it, how it varies around the world\r\n\r\nChapter 1: Incomes around the World\r\nChapter 2: Urban/rural inequality\r\nChapter 3: Income inequality within countries\r\nChapter 4: Measuring wellbeing\r\nChapter 5: Convergence or divergence?\r\n\r\nLecture 3: A Short History of Economic Development\r\n\r\nChapter 1: Economic development is new, starting around 1750\r\nChapter 2: The industrial revolution starts in England\r\nChapter 3: The great waves of technological change\r\nChapter 4: The diffusion of economic growth\r\nChapter 5: Economic Development Since World War II: The Making of Globalization\r\n\r\nLecture 4: Why Did Some Countries Advance While Others Remained in Poverty?\r\n\r\nChapter 1: The Idea of Clinical Economics\r\nChapter 2: The role of physical geography: transport, energy, disease, crops\r\nChapter 3: The role of culture: demography, education, gender\r\nChapter 4: The role of politics\r\nChapter 5: Which countries are still stuck in poverty?\r\n\r\nLecture 5: The MDGs and the End of Extreme Poverty\r\n\r\nChapter 1: The Reasons to Believe that Extreme Poverty Can Be Ended\r\nChapter 2: A Strategy to End Extreme Poverty in Africa\r\nChapter 3: South Asia: The Continuing Challenge of the Food Supply\r\nChapter 4: A Closer Look at Official Development Assistance\r\nChapter 5:  Designing Practical Interventions: The Case of Millennium Villages\r\n\r\nLecture 6: Growth within Planetary Boundaries\r\n\r\nChapter 1: The Planetary Boundaries\r\nChapter 2: Growth Dynamics\r\nChapter 3: Growth and Planetary Boundaries: The Case of Energy\r\nChapter 4: Growth and Planetary Boundaries: The Case of Food\r\nChapter 5: Growth and Planetary Boundaries: The Case of Population\r\n\r\nLecture 7: Human Rights and Gender Equality\r\n\r\nChapter 1: The Ethics of Wealth, Poverty, and Inequality\r\nChapter 2: Major UN Covenants and Declarations\r\nChapter 3: Divided societies\r\nChapter 4: Forces of Widening Inequalities\r\nChapter 5: Gender Inequality and Solutions\r\n\r\nLecture 8:  Education\r\n\r\nChapter 1: Life-cycle approach to human development\r\nChapter 2: Early Childhood Development\r\nChapter 3: The rising returns to education and the supply response\r\nChapter 4: Social mobility\r\nChapter 5: The role of higher education in sustainable development\r\n\r\nLecture 9: Universal Health Coverage\r\n\r\nChapter 1: The human right to health\r\nChapter 2: Poverty and disease\r\nChapter 3: Designing and Financing a Primary Health System in Low-Income Settings\r\nChapter 4: Ten Recommended Steps to Health for All in the Poorest Countries\r\nChapter 5: The Challenges of Health Coverage in High-Income Countries\r\n\r\nLecture 10: Sustainable Food Supply and the End of Hunger\r\n\r\nChapter 1: Malnutrition\r\nChapter 2: Farm systems, ecology, and food security\r\nChapter 3: How environmental change threatens the food system\r\nChapter 4: How the food system threatens the environment\r\nChapter 5: Towards a sustainable global food supply\r\n\r\nLecture 11: Sustainable Cities\r\n\r\nChapter 1: The patterns of urbanization around the world\r\nChapter 2: What makes a city sustainable?\r\nChapter 3: Smart Infrastructure\r\nChapter 4: Urban Resilience\r\nChapter 5: Planning for Sustainable Development\r\n\r\nLecture 12: Curbing Climate Change\r\n\r\nChapter 1: The basic science of climate change\r\nChapter 2: Consequences\r\nChapter 3: Mitigation\r\nChapter 4: Mitigation Policies\r\nChapter 5: Policies and Global Cooperation for Climate Change\r\n\r\nLecture 13: Saving Biodiversity\r\n\r\nChapter 1: What is biodiversity?\r\nChapter 2: Biodiversity under threat\r\nChapter 3: Oceans and fisheries\r\nChapter 4: Deforestation\r\nChapter 5: International dynamics\r\n\r\nLecture 14: The Sustainable Development Goals\r\n\r\nChapter 1: The proposal for SDGs at Rio+20\r\nChapter 2: Illustrative SDGs\r\nChapter 3: Goal-Based Development\r\nChapter 4: Financing for Sustainable Development\r\nChapter 5: Principles of Good Governance\r\n\n                                    ", "end_date": "2015-04-21T00:00:00Z", "title": "The Age of Sustainable Development", "price": 0, "instructors": "Jeffrey Sachs", "institution_name": ["SDSN.Edu"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.sdsnedu.org/learn/the-age-of-sustainable-development-january-2015", "duration": "13 weeks", "language_name": ["English"], "provider_name": ["EdCast"], "start_date": "2015-01-20T00:00:00Z"}