{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    Each part of the world faces specific vulnerabilities to climate change and has different opportunities to mitigate the effects and build resilience in the 21st century. With the Paris Agreement at COP 21, the global community has signaled its intent to act. Indeed, without climate action, decades of development progress are threatened, meaning that we are at a ‘make it or break it’ point in time. This course presents the most recent scientific evidence, explains the different regional impacts and divulge climate action strategies, and some opportunities for you to take action on climate change.\n\nAbout the Course\n\nThis action-oriented MOOC gives you the opportunity to learn about regional climate change impacts and sector-specific strategies to increase resilience and move towards a low-carbon future. You will have the opportunity to explore these issues in depth and tailor your learning experience for one or more of the following regions:\n\n•  Latin America and Caribbean\n•  Sub-Saharan Africa\n•  Middle East and North Africa\n•  Eastern Europe and Central Asia\n•  East Asia and Pacific\n•  South Asia\n\nTo do this, the MOOC brings together renowned scientists and policymakers to provide a synthesis of the most recent scientific evidence on climate change, regional low emissions and climate resilient development strategies across sectors, and an overview of the Paris Agreement and other outcomes of COP 21.\n\nCourse Syllabus\n\nOverview \n\nTurn Down the Heat: From Climate Science to Action is divided into four weeks. The first two weeks will provide a comprehensive overview of the scientific evidence for climate change, followed by region-specific insights on the impacts of a warmer world in the 21st century. The last two weeks will focus on action strategies that are being undertaken in different regions and countries to meet the climate challenge, and on how individuals can take action.\n\nWeek 1:  Climate Change in the 21st Century\n\n•  Historical and projected observed changes in the climate system, leading up to the end of the 21st century\n•  The potential of Intended Nationally Determined Contributions (INDCs) submitted at COP 21 from 187 countries to induce climate action\n•  Trends in climate change impacts, including loss of Arctic sea ice, melting glaciers, increased heat waves and extreme temperatures, and drought and aridity \n•  Possible responses from natural systems, explaining how warming could result in sea-level rise, heat waves and extreme temperatures, and ocean acidification\n\nWeek 2: Sectoral and Regional Impacts\n\n•  Impacts on key development sectors—from warming above pre-industrial temperatures and projected climate trends—across each of the world’s regions\n•  Sectoral impacts focusing on agricultural production, water resources, ecosystem services, and coastal vulnerability for affected populations \n•  Importance of risks with the potential to reverse hard-won development gains and potentially trap millions in poverty, illustrating the need for urgent action now\n\nWeek 3: From Science to Action on Climate Change\n\n•  Region-specific discussions on mitigation actions needed to reduce emissions while decreasing vulnerability to climate change impacts through adaptation and by building climate resilience\n•  Perspectives from regional experts on their experiences in strategies and actions proposed in each region to help transition towards a low-emissions, climate-resilient development path \n\nWeek 4: What You Can Do\n\n•  Transformative impact of day-to-day changes when brought to a global scale\n•  The rationale for acting now, acting together and acting differently\n•  Examples and expected benefits of mitigation and adaptation policies, considering both contributions to global emission reductions and local development opportunities\n\nCourse Format\n\nThis MOOC has a week-by-week structure, with resources, activities and exercises for you to engage in during each of the four weeks of the course. Each week, you will find a variety of course material, including: \n\n•  Interactive video talks by renowned climate scientists and practitioners \n•  Resources: Core, optional (deep dive) and fun interactives on the week’s theme\n•  Quizzes that check your knowledge, reinforce the lesson’s material and provide immediate feedback\n•  Assignments that will sharpen your skills of analysis, reflection and communication\n•  Discussion forums and social media that enable collaboration with others from around the world, enriching interaction among participants\n•  A live interactive Google Hangouts on air with international experts, who will engage in a Q&amp;A session on climate change\n•  As a final project, you will create a digital artifact\n\n                                            Syllabus\n                        Climate Change in the 21st Century Week 1 will introduce you to the growing and well-documented body of evidence regarding observed changes in the climate system. Week 1 will also provide an overview of the projected changes in climate up until the end of the 21st century. Sectoral and Regional ImpactsWeek 2 will introduce you to the climate impacts across different regions of the planet. If warming goes beyond 2˚C, multiple threats associated with a warming planet such as extreme heat waves, sea–level rise, more intense storms, droughts and floods, will be more frequent and will have severe negative implications for the poorest and most vulnerable.From Science to Action on Climate ChangeWeek 3 will introduce you to a region-specific understanding of challenges on what mitigation and adaptation actions are needed to reduce emissions, at the same time decreasing vulnerability to climate change impacts and building climate resilience. The module will draw on key regional experts involved in the implementation of different policy instruments. What You Can DoThis week will introduce you to the types of actions not just by your country, but by different actors including yourself, to embark on a low-emissions development trajectory that would help limit warming to below 2°C.\n                                    ", "end_date": "2016-06-06T00:00:00Z", "title": "Turn Down the Heat: From Climate Science to Action", "price": 0, "instructors": "Kanta Kumari Rigaud  and Pablo  Benitez", "institution_name": ["The World Bank"], "commitment": "3-5 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/climate-science", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-09T00:00:00Z"}