{"selfpaced": false, "topic_name": ["Environmental Science"], "description": "\n\n                    \n                    \n                    Water management today is faced with new challenges such as climate change or the effects of human activity. Public and private stakeholders who are active in this field must develop new ways to better manage the water cycle \"as a whole\".\n\nThe objective of this MOOC is to develop an understanding of the problems related to water management. Firstly, this course will define a resource and, more specifically, the resource of water. It will look at how water is used and the activities associated with it as well as any potential conflicts. The course will look at water management in detail through the analysis of the different types of rights and obligations associated with, for example, the development of a multi-sectorial regulation system or a watershed management approach.\n\nBy the end of this course, our aim is to enable you to:\n1) Identify the main issues and strategies linked to water resource management\n2) Acquire the key reading material needed to understand the many variables (environmental, institutional and political) which affect water and which, in terms of management, may require adjustment.\n\nThis course was developed by the Geneva Water Hub and is financed by the Swiss Agency for Development and Cooperation (SDC). Alongside researchers from the University of Geneva from a range of faculties, researchers from other universities and research centres will be involved in this course. Practitioners who deal daily with the political dimension of water management will also input into the course.\n\nThis MOOC is designed for all those interested in the water sector. Prior training is not necessary to follow our program. The findings presented in this course can be easily reapplied to different contexts and to different scales of analysis.\n\nThis course is also available in French : https://www.coursera.org/learn/gestion-eau/\n\n                                            Syllabus\n                        Module 1: From Resource Definition to the Ideals of Community Management Welcome to this MOOC in Water Resources Management and Policy! We look forward to supporting you throughout the duration of the course. In this first module, we will define the concept of a resource. This will help you to understand the various uses and demands that are placed on water. Next, we will address the issues linked to the management of a common good such as water. Here, we will draw on the work of Elinor Ostrom. We will examine several examples of how the commodity is managed: by the state, by industry or by the community.  Two cases studies of community water management in Latin America will be presented. The module is concluded by a quiz worth 20% of the final grade. You must have at least 80% of the responses correct to pass the module.Module 2: The Rules of the Resource, their Uses and their Circumvention Businesses that manage water are guided by property law and public policy designed to define and coordinate all the demands on the resource. This second module aims to better understand the complexity of these two bodies of law through the framework of the Institutional Resource Regime (IRR). This framework is presented and then applied to two case studies (Swiss and European) to understand the rules governing water management in these territories. Finally, we will go beyond this framework to address the implementation of these rules by looking at examples of how the law is applied and examples of localised regulation. The module is concluded by a quiz worth 20% of the final grade. You must have at least 80% of the responses correct to pass the moduleModule 3: From Integrated Water Resource Management to the Water-Food-Energy and Ecosystem NexusHaving discussed the rules governing water management and their implementation, this third module deals with the issues associated inter-sectorial water resources. It focuses on two existing concepts. Firstly, we look at the Integrated Water Resources Management (IWRM) focusing on the coordinated management of water and any associated resources. Secondly, we look at the approach known as the Nexus Water-Energy-Food and Ecosystems. This approach is examined in light of the water users but also how they interact with other sectors. The Mekong River and the Columbia River (USA) are used as case studies to bring to life the difficulties of reconciling different uses of a river, such as hydropower, food security and the protection of ecosystems. The module is concluded by a quiz worth 20% of the final grade. You must have at least 80% of the responses correct to pass the module.\n\nModule 4: The Integrated Watershed Management (IWM)In this module, we further examine water management but this time we look specifically at how watersheds are managed. We see how stakeholders in Switzerland, in Europe (with the case of the Rhine) and internationally have promoted this concept as a reference for water management. These case studies allow us to identify the benefits and limitations (both practical and institutional) that are presented by the Integrated Watershed Management approach. The module is concluded by a quiz worth 20% of the final grade. You must have at least 80% of the responses correct to pass the module.Module 5: Water as a Source of Conflict and Cooperation We have reached the final module. Module 5 is dedicated to the issues of conflict and cooperation associated with water resources. We will present the framework of hydro-hegemony with the aim of understanding transboundary interactions. This will be illustrated with the case of the Nile River Basin. Here we examine the relationship between Egypt (as the country furthest downstream) and the other riparian countries. The various institutional mechanisms for cooperation among states will be detailed. This will include an examination of how international river basins are managed using the Senegal River Development Organisation and the Mekong River Commission as case studies. The role of international water law in cooperation forms the final part of this module. The module is concluded by a quiz worth 20% of the final grade. You must have at least 80% of the responses correct to pass the module.\n\nWe hope that this course has presented you with some interesting new perspectives and has encouraged you to want to explore the field of water management further. Thank you for participating!\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Water Resources Management and Policy", "price": 0, "instructors": "Géraldine Pflieger and Christian Bréthaut", "institution_name": ["University of Geneva"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.coursera.org/learn/water-management", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}