{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<ul style=\"\">  \t<li style=\"\">This course teaches you how to master the nuances of your voice, whether you are a beginning or professional singer.</li>  \t<li style=\"\">It teaches how to sing in a way that promotes the longevity of the singing voice.</li>  \t<li style=\"\">Revise your learnings with handy PDFs</li>  \t<li style=\"\">Participate in the videos at the provided opportunities. Make sure you watch somewhere you can sing!</li>  \t<li style=\"\">The lessons in this course can take anywhere from weeks to years to master, but getting through the content will not be that long! You can watch again and again whenever you want a singing lesson with Marion.</li>  </ul>  <p style=\"\">  \t    Based on research from training thousands of singers, founder of Voiceology, Marion Rouvas has developed this course to start students on a fast and effective beginning to mastering voice production.  </p>  <p style=\"\">  \t    Using <strong style=\"\">The 10 Essential Lessons for Easy Singing</strong> students are able to improve their vocal range, tonal quality and power of the voice with astounding speed. <em style=\"\">&quot;All they have to do is follow the lessons - and the vocal exercises will do the rest&quot;</em>, says Marion.  </p>  <p style=\"\">  \t A unique program where you not only sing, but you have someone to guide you through the lessons vocally, so you can&#039;t go wrong!  </p>  <p style=\"\">  \t    Many students have tried and tested these exercises and one of the most exciting benefits they have discovered is their ability to connect registers - a technique which is sadly neglected in modern-day singers and teachers of today.  Marion&#039;s technique, when mastered, will truly blend the voice into one and enable students to sing pop songs of today with astounding ease as well as many other styles available to them. This is not a style of teaching. it is a foundation for the voice to provide years of producing great and consistent performances!  </p>", 
    "end_date": null, 
    "title": "10 Essential Lessons for Easy Singing", 
    "price": "20.00", 
    "instructors": "Marion Rouvas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160366_bc5a_3.jpg", 
    "course_url": "https://www.udemy.com/10-essential-lessons-for-easy-singing/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-09T00:39:07Z"
}