{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Du möchtest richtig toll singen können und das Beste aus deiner Stimme holen?</strong> <br><strong>Du möchtest endlich die Songs singen können, welche dir am besten gefallen? <br>Du möchtest alle technischen Hürden verstehen und lernen, wie du diese überwindest? <br>Du möchtest deine Lieblingssongs so interpretieren, dass dein Publikum eine Gänsehaut bekommt? <br><em><br>All dies und noch viel mehr lernst du in meinem Kurs und hast dabei noch jede Menge Spaß beim Üben!</em><br></strong></p><p>Der Kurs entspricht in etwa den Inhalten, die meine Schüler während des ersten Jahres in meinem Unterricht lernen! Die Kursgebühr ist dabei niedriger als eine Privatstunde.</p><p>Lerne deine Stimme selbständig zu trainieren. Übe, wann und wo du möchtest!</p><p>Der Kursinhalt wird dir mit Erklärvideos näher gebracht. Zudem findest du zu den einzelnen Themen schriftliche Zusammenfassungen.</p><p>Neben den Erklärvideos gibt es Videos, in denen du neue Gesangsübungen kennenlernst. <br><strong>Damit du individuell üben kannst, habe ich für alle Stimmlagen die passenden Übungsfiles bereit gestellt.</strong></p><p><strong>Für Anfänger gibt es eine vereinfachte Version und für Fortgeschrittene eine schwierigere Version der Übungen! </strong></p><p><strong><em>Wähle in meinem Kurs die Übungen aus, deren Schwierigkeitsgrad für dich am besten passt!</em></strong></p><p><strong></strong></p><p>Kernthemen:</p><p>Lerne das Instrument Stimme kennen<br>Optimiere deine Atemtechnik beim Singen<br>Hol das Beste aus deinem Stimmklang<br>Verbessere deine Artikulation<br>Singe bruchlos durch alle Stimmregister<br>Finde deinen Weg Songs emotional zu interpretieren</p><p>Unterrichtsmaterial:</p><p>Zwei Stunden Videomaterial in From von Erklärvideos und Gesangsübungen<br>Übungsfiles für alle Stimmlagen<br>Schriftliche Zusammenfassungen der einzelnen Themen</p><p><br></p>", 
    "end_date": null, 
    "title": "Befreie deine Stimme! Gesangsunterricht für alle Level", 
    "price": "35.00", 
    "instructors": "Vocal Coach Carina Offergeld", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639240_b7a6_2.jpg", 
    "course_url": "https://www.udemy.com/befreie-deine-stimme-gesangstechnik-fuer-alle-level/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-13T13:13:59Z"
}