{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t        Als Julius Hey um 1900 sein dreiteiliges Werk  &quot;Deutscher Gesangsunterricht&quot; herausgab, konnte er kaum ahnen, daß  dieses Lehrbuch einen beispiellosen Siegeszug antreten sollte. Hey hatte  seine Lehrweise ursprünglich nur für seinen Schülerkreis und zudem als  reine Gesangslehre entwickelt. Erst die Verantwortung gegenüber der oft  fehlerhaften Aussprache bei Schauspielern und Sängern veranlaßte ihn,  seinem Hauptwerk einen &quot;Sprachlichen Teil&quot; anzufügen. Es bezeugt die  Richtigkeit dieses Lehrweges, daß gerade dieser Teil unter dem Namen  &quot;Der kleine Hey&quot; das Standardwerk für die Sprecherziehung geworden und  dies in größter Auflage bis heute geblieben ist.   \t         Julius Heys Lehrwerk über die elementaren Grundlagen der &quot;Kunst des  Sprechens&quot; ist das fundamentale Lehrbuch für die sprechtechnische  Ausbildung der Schauspieler, Redner und Sänger wie aller weiteren mit  dem gesprochenen Wort verbundenen Berufe und nicht zuletzt eine  wertvolle Hilfe für den Schulunterricht und das private Studium.  </p>  <p style=\"\">  \t    Für alle, die mit dem Medium Sprache umgehen wollen und müssen, bieten die praxiserprobten Sprachübungen dieses Kurses zu den Themen Stimmführung, Lautlehre und Artikulation eine ideale Möglichkeit, die eigene Aussprache zu vervollkommnen. Alle Übungen sind als Filmdokumente enthalten. Zusätzlich enthält der Kurs 15 Tipps zum Thema &quot;Sprechen mit dem Mikrofon“  </p>", 
    "end_date": null, 
    "title": "Der kleine Hey", 
    "price": "20.00", 
    "instructors": "SCHOTT MUSIC GmbH  & Co. KG", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337484_3edb_5.jpg", 
    "course_url": "https://www.udemy.com/der-kleine-hey/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T13:44:50Z"
}