{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Learn the basic practices and techniques that you will need to start singing with confidence right away.</p><p><strong style=\"\">Easily incorporate Singing into your everyday life with this simple, 6 step course designed entirely for Adult Beginners just like you.</strong></p><ol style=\"\"><li>How To Warm Up Your Voice Before Singing</li><li>How To Use Correct Posture When Singing</li><li>How To Breathe When Singing &amp; Using The Diaphragm</li><li>How To Open Your Mouth Correctly When Singing</li><li>Why Vowels Are Important When Singing</li><li>How To Eliminate Nasal Sounds When Singing</li></ol><strong style=\"\">Everything you need to know to get started immediately! </strong>Have you ever wondered why some singers have amazing, natural talent and others don&#039;t? In this course together, <strong style=\"\">we&#039;ll </strong><strong style=\"\">fix those underlying imperfections</strong> that have been stopping you from sounding your absolute best. Now, you have always wanted to take singing lessons but you are a busy person and may never have had the time, money or even the right opportunity to do so. If that little voice inside your head has been bugging you to do something you love, this course will help you <strong style=\"\">decide if singing is really right for you. </strong>So if you have never had singing lessons before or you have dabbled in singing in the past but never pursued your true passion, this course will take you step by step through the basics that are essential to creating a life you deserve. <strong style=\"\">Let&#039;s explore your creative side together and see what your voice can really do! </strong>At the end of this course you will be able to incorporate singing into your everyday life with confidence... and who knows where it will lead you next!", 
    "end_date": null, 
    "title": "Easy Singing Techniques for Adult Beginners", 
    "price": 0, 
    "instructors": "Deanna Kangas", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499694_b87d_3.jpg", 
    "course_url": "https://www.udemy.com/easy-singing-techniques/", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T06:00:46Z"
}