{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t  Would You Like to Eliminate Every Struggle That You Are Faced With When Singing?  </p>  <p>  \t  This course is your &quot;Professional Training&quot; for singing.  It is the most <em style=\"\">direct and to the point</em> complete online singing course.  </p>  <p>  \t  Follow the Videos in the Exact Same Order and You Will See a Huge Positive Change in Your Playing  </p>  <ul style=\"\">  \t<li>86 Lectures/Videos with PDF Attchaments</li>  \t<li>Over 4.5 hours of hard hitting video training</li>  \t<li>It&#039;s available on a PC or MAC and there is a iPad and iPhone app ready to go! (Android app is coming soon).</li>  \t<li>Keeping track of which videos(lectures) you have already watched is a breeze.  Udemy has a great way of keeping track of your completed lessons(lectures).</li>  \t<li>The entire course is organized in step-by-step easy to follow layout</li>  </ul>  <p>  \t  The more you practice the better you will get.  With the <em style=\"\">Right Practice</em> style you will be able to witness fast results!  </p>  <p>  \t  Eric&#039;s teachings are different than all of the other online teachers.  He has made it super easy to be successful at singing.  All you have to do is follow the videos in order and put together some good practice habits.  </p>  <hr style=\"\">  <p>  \t  Who is this Singing Course For?  </p>  <ul style=\"\">  \t<li>If you are a beginner then this course is perfect for YOU!</li>  \t<li>If you have tried to play sing before and quit.. then this course is perfect for YOU!</li>  \t<li>If you have or do take personal one-on-one singing lessons with a vocal instructor and feel like you are not getting the results you feel like you deserve than this course is perfect for YOU!</li>  </ul>  <p>  \t  Eric&#039;s Singing Videos and Online Vocal Courses and Have Reached Millions of People All Around the World.  </p>  <ul style=\"\">  \t<li>With More Than 20 Million Views on Youtube alone</li>  \t<li>Nearly 20 Years Experience in Teaching and Playing</li>  \t<li>Over 125k Youtube Subscribers</li>  </ul>  <p>  \t  We all know you have to practice to become a better singer.  </p>  <p>  \t  Most teachers don&#039;t have a &quot;plan&quot; for beginners to follow for them to see actual results.  </p>  <p>  \t  This course, and all of Eric&#039;s courses on Udemy, are laid out in a &quot;no fail&quot; order. So all you have to do is follow the videos in order and put your practice to good use.  </p>  <p>  \t  Eric will teach you the correct techniques and exercises to incorporate into your practice so you begin to establish the <em style=\"\">Right Practice</em> habits.  </p>  <hr style=\"\">  <p>  \t  Phase I - Vocal Foundations  </p>  <p>  \t  Vocal foundations is all about focusing on key areas of the voice, rounding out the trouble spots in your voice, and setting a vocal foundation that we can build upon. This starts with taking an honest evaluation of the voice and then giving you the best techniques to start improving immediately.  </p>  <p>  \t  A lot of singers get frustrated because they want their voice to perform in ways it&#039;s not strong enough to do yet, so we start by strengthening key areas so that we can free your voice of vocal pressure and allow you to access high notes easier.  </p>  <p>  \t  All of the vocal exercises in Phase I will get you the foundation to hit higher notes, singer with more clarity, stop going hoarse, and have a polished brilliant tone.  </p>  <p>  \t  **Free Bonus Singing Course** - The AApproach Advanced Warm Up!  </p>  <p>  \t  Going beyond what is covered in the free professional warm up, the advanced warm up gives you the best exercises to warm up your voice…not matter your voice time. These bonus audio mp3s will ensure that when you sing, you will have the best possible chance of sounding amazing.  </p>  <p>  \t  **Free Bonus Singing Course** - Amazing Singing From The Diaphragm!  </p>  <p>  \t  Master your diaphragm and its surrounding muscles, and you will certainly unearth your true vocal potential. Developing a great singing voice is about more than just your vocal cords; your whole body can be a source of power. In particular, the muscles of your torso (back, abdomen, ribs, chest, pelvis) are of great value. These muscles surround the diaphragm and aid it in functioning efficiently. This is the knowledge that singers like Carrie Underwood, Pavorotti, Renee Fleming, Celine Dione, David Phelps, and Christina Aguilera have taken full advantage of.  </p>  <hr style=\"\">  <p>  \t  There&#039;s a 30 Day Money Back Guarantee  </p>  <p>  \t  Is this course for you?  </p>  <p>  \t  Honestly, I have know idea.  And that&#039;s why we are offering a 30 day money back guarantee.  </p>  <p>  \t<em style=\"\">Scroll up and click the </em>&quot;Take This Course&quot;<em style=\"\"> button now.</em>  </p>  <p>  \t  WARNING:  This course is NOT for the person who thinks by purchasing this course it will then magically allow them to sound like Mariah Carey, Whitney Houston or [insert  your favorite singer]. It does take practice if you want to see results. My team and I are here to help.  </p>", 
    "end_date": null, 
    "title": "Elite Singing Techniques - Phase I", 
    "price": "50.00", 
    "instructors": "Eric Arceneaux", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/70030_c4e7_8.jpg", 
    "course_url": "https://www.udemy.com/elite-singing-techniques-phase-1/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-26T10:06:31Z"
}