{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Learn to sing from professional vocal coach Roma Waterman.</strong></p><p><strong>Over 4000 Students in Jan 2015!</strong></p><p><strong>Heres some reviews from students:</strong></p><p><strong><em>The Best course I ever taken!!</em></strong></p><p><strong><em></em></strong><em>\"I love taking this singing lesson course. It helped me to sing better. I can also take the lessons with me on the road. I'm glad I purchased this\".Tiffany </em></p><p><strong><em>Awesome vocal training</em></strong></p><p><strong><em></em></strong><em>\"Roma manages to cover complex and in-depth vocal techniques in a clear and simple way. Besides being a great singer herself, Roma is clearly a gifted teacher which shines through in these vocal lessons. I highly recommend this course\". Amberley </em></p><p><em><br></em></p><p><strong><em>Well structured course</em></strong></p><p><em>\"I've been a rock singer in a band for the past 3 years and lately I have been performing more solo acoustic gigs. Roma's course is so helpful. It's well structured and leads you by the hand to higher levels. Highly recommended!!\" Ibrahim</em></p><p><br></p><p>Do you struggle with finding the time to learn to sing?</p><p>Or maybe you can't afford the luxury of weekly lessons?  </p><p>Whether you are a beginner, intermediate or advanced vocalist, this course will provide you with an excellent framework to be the best singer you can be.</p><p><strong>For the cost of 2 one hour vocal lessons, you can have a whole course on singing at your fingertips that you can watch over and over again.  </strong></p><p>I'm Roma Waterman, vocal coach, author, speaker and professional singer/songwriter. After recording 9 albums, touring Internationally and being a vocal coach for TV Shows and for professional and amateur students, I know what it takes to sing well. It would be a privilege to help you achieve that goal too.</p><p>This course includes:</p><p>42 bite size, easy to digest lectures;</p><p>Almost 2 hours of live video, power point presentations and MP3's;</p><p>Diagrams and explanations on voice anatomy - from vocal folds to breathing;</p><p>A study of the 3 pillars of the voice - Posture, Breathing and Resonance - with exercises for you to try at home;</p><p>Printable PDF's with exercises and notes at the end of each section;</p><p>5 quizzes;</p><p>A lesson with me in my private studio where I show you how to do certain exercises;</p><p>A 25 minute downloadable vocal warm up CD with full backing tracks;</p><p>Sheet music for all the scales;</p><p>A 20 page ebook of all the notes with diagrams for you to print out and keep;</p><p>A recomended resource list so you can keep on learning.</p><p>Complete the course at your own leisure - take your time for a thorough learning experience, or complete it in a few days and have a resource you can go back to over and over again! </p><p><strong>The best vocalists are not only those who DO, but those who KNOW why they DO. </strong></p><p>This course will not just show you how to warm up and use your voice effectively, but will also explain why.  With easy to understand lectures with videos, diagrams and presentations, you will achieve all your goals to have singing success!</p><p>This is also a great course for church singers, church choirs, vocal groups. </p>", 
    "end_date": null, 
    "title": "How To Sing - Singing Lessons Online", 
    "price": "20.00", 
    "instructors": "Roma Waterman", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450918_4af0_3.jpg", 
    "course_url": "https://www.udemy.com/singing-lessons-online/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T04:19:45Z"
}