{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>If you are a singer who has ever thought of quitting your day job and earning a living by taking your talent to the next level, this course is for you. The Karaoke 2 Pro Udemy Course is a treasure chest of information you won't find anywhere else about how to build a successful career as a part time or full time solo performer.</p><p><strong>Attention:</strong> This course is still in the launch phase with lots more content being added daily, which means you can get in now at a discounted \"Early Bird\" price of just $197. The price will go up to $297 in the near future, and then probably go up again because the insider information in this course is so valuable. </p><p>My name is \"Rockin\" Rick Bell and I can teach you everything you need to know to have a long and successful career as a solo singer and entertainer. This course teaches you what it took me 20 years to figure out the hard way! </p><p>I am a full time successful solo entertainer and I've won multiple awards for everything from songwriting to \"Best Band of the Year\" so I know exactly what I'm talking about.</p><p>In 1999 I began developing a solo music career instead of the \"band thing\" I had always done because frankly, I was tired of all the drama and sobriety issues that come with a band! I began studying the top solo performers in Las Vegas and soon discovered they all performed with \"track\" music instead of a live band. This one revelation changed my performance career forever, and I'm going to teach you EXACTLY how to build a library of track songs so you'll never again need a band to perform.</p><p>I know what I'm talking about because as I am writing this, I am actually sitting in my dressing room at the State Fair of Texas, where I have been a featured daily solo music performer for the entire 24 days of the State Fair of Texas every year since 2012. The State Fair is a BIG time paid gig, and I have been hired here 4 years in a row for one reason only; because my act - singing and playing guitar along with prerecorded track music -  is one of the best in the business!</p><p>I have learned how to \"break in\" to the big gigs and what you must have in order to do so. This course will give you backstage access to secrets I've never shared before, and show you how to do exactly what I've done in your own way, using your own talents.</p><p>As someone who had to learn this the hard way, I can tell you without reservation that the information inside this course is potentially worth more than 100 times what you will pay for it! If you believe in yourself and your talent, I encourage to dive in. Remember, it's not a lack of talent that holds most people back, it's a lack of knowledge.</p><p><br></p>", 
    "end_date": null, 
    "title": "How to Start a Successful Business as a Professional Singer", 
    "price": "35.00", 
    "instructors": "Rick Bell", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/52967_7377_9.jpg", 
    "course_url": "https://www.udemy.com/karaoke2pro/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-08T19:00:00Z"
}