{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t                           *** Course has been updated as of 7/28/2015 with new content for version 10.1 (Older versions are covered as well ***  </p>  <p>  \t           Updates:  </p>  <p>  \t      How to Mix Rap Vocals has been adding in Section 12! Broken down into 4 parts!  </p>  <p>  \t           Voice Over Lecture has been adding in Section 10!  </p>  <p>  \t           GarageBand 10.0.3 Update Video have been uploaded to explain what has changed and why this update is so AMAZING!  </p>  <p>  \t                           This course has been live for only 1 week and 939 students has already enrolled!!!! You are probably wondering why so many people are purchasing this Udemy course?  </p>  <p>  \t                                       Will first let me ask you a question. Wouldn't it be great if you knew how to make your vocals to sound more professional using an <strong>easy to learn software</strong>? What if you could bypass that huge learning curve and start making your vocals sound amazing as soon as you finish this course! <strong>Garageband is already very easy to learn</strong> and this course will start with an overview of Garageband 10 in case you are unfamiliar with the software altogether. Then we are going to get right into the steps of getting your vocals sounding remarkable. This curriculum will be a jam packed with lectures covering everything from the EQ, Reverb, Echo and Pan to the Compression, third party audio units (That come with this course), how to install them and even what EQ frequency ranges that each instrument should set in as well as the pan percentage per instrument type! I know your time is important so I made certain <strong>I used the least amount of time</strong> to show you each step without sacrificing the learning experience. If this is what you're looking to do then this course is for you.  </p>  <p>  \t                                       I have decided to <strong>include 15 free Audio Units</strong> that you can use with Garageband10, Reason (Mac), Cakewalk (Mac), Pro Tools, Logic Pro X and other audio mixing software for free just for purchasing this course! How awesome is that!? With this type of Audio Unit bundle (Not to mention the unlimited access to new courses and a Facebook group community) you are looking at a <strong>$500 savings</strong>!  </p>  <p>  \t                                       So come learn the guarded secrets behind making a raw vocal into a professional sounding master piece using a free software; Garageband 10. With all the benefits mentioned above and more that I couldn't include because I have a 300 word limit :-) you have no reason not to enroll today!  </p>  <p>  \t                                       Music Artist Vocalist that was used in the course are:  </p>  <p>  \t                                       Lui C Acoustic (You can check him out on YouTube by doing a search for <strong>LuiCAcoustic</strong>)  </p>", 
    "end_date": null, 
    "title": "Learn how to use GarageBand when mixing vocals", 
    "price": "50.00", 
    "instructors": "Malachi Staples", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273856_59a3_5.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-mix-vocals-like-a-professional-in-garageband-10/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-03T13:32:20Z"
}