{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>About this course: </strong></p>  <ul>  \t<li><strong>Latest Update:</strong> I added another bonus lecture at the end of the course. This time, I used a small clip-mic that can be used for talking head videos, compared it to my condenser mic and showed a quick treatment to handle the flaws. </li><li><strong>3 hours of content</strong> available! </li><li><strong>2000+ students</strong> already joined the course! </li><li><strong>Free preview lectures</strong> available! </li>  </ul>  <p>  \t<strong></strong><strong>Get enrolled today and improve the quality of your vocal recordings! </strong></p>    <p>  \t<strong><em>Quality substance comes in quality wrappings! </em></strong></p>  <p>  \t                                                                                                                       Lots of <strong>e-learning courses</strong>, <strong>podcasts</strong> and other vocal recordings have superb content, but suffer from poor recordings and audio treatment! The same can be said about some vocal artists: <strong>Rappers</strong> with great skill and <strong>singers</strong> with touching lyrics sometimes sound like they recorded the vocals in a bucket and loose lots of the emotional appeal and power they could have! </p>  <p>  \t<strong>However</strong>: Often, it's <strong>NOT</strong> the expensive microphone, a high-end preamp or renting a studio for loads of money, <strong>BUT</strong> room treatment, proper recording technique and some simple tricks to improve the character of your vocal material drastically. This course teaches you how to set up your room, the microphone and shows how to use software solutions to help you to get loud and clear voice tracks! </p>    <p>  \t<em><strong>Lifetime access and a 30 day money back guarantee in case you're not satisfied with the content!</strong>* </em></p>  <p><em>*May not be available for app-in purchases, please check conditions before buying. </em><strong></strong></p><p><em><br></em></p>", 
    "end_date": null, 
    "title": "Loud And Clear: Make Better Voice Recordings Now", 
    "price": "30.00", 
    "instructors": "Marc \"Selec\" Zimmermann", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385182_cf47_2.jpg", 
    "course_url": "https://www.udemy.com/make-better-voice-recordings/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T23:01:12Z"
}