{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">You&#039;ve mastered the techniques in Phase 1, and you&#039;ve decided that you want to be more than just a “good&quot; singer. You want the advanced skills necessary to be downright impressive - a dynamic voice that feels truly effortless. In Phase 2 “Becoming A Natural Singer&quot;, you will discover a whole new dimension of vocal freedom!</p><p style=\"\"> Fact: Your body is designed to sing. The idea that amazing voices are reserved only for a chosen few has no scientific basis whatsoever. What I&#039;ve discovered through years of research and experience is that most struggling vocalists (and even many “trained&quot; singers) suffer from one major problem - a collapsed throat; this places excess pressure on the vocal folds, making the voice feel heavier that it really is. Sadly, I meet vocalists every day who have never had the incredible experience of singing with a truly released throat. </p><p style=\"\"> Most commonly taught classical techniques attempt to force the throat open, ironically making the problem even worse by causing more tightness. Other so-called “modern&quot; methods hardly reference the problem of throat release at all, instead focusing exclusively on mixing techniques. But, in Phase 2, we combine time-tested ancient wisdom with modern science and years of professional industry experience. The result is an advanced technique that is proven to be effective in restoring full freedom to the folds. </p><p style=\"\"> How long this course takes to complete is entirely up to you, though we strongly recommend spending at least one week on each section. Every lesson is broken down into three basic parts: (1) Ebook guide, (2) The video lessons (3) your MP3 practice warmups (which you can listen to online or download for your own convenience). Of course, you still have the option of asking questions in the Phase 2 forum and receiving help from trained Approach instructors. </p>", 
    "end_date": null, 
    "title": "Phase 2 - Becoming A Natural Singer ", 
    "price": "50.00", 
    "instructors": "Eric Arceneaux, Jared Latchford, Mike Bryant, LEORA NOSKO", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437148_7668.jpg", 
    "course_url": "https://www.udemy.com/phase-2-becoming-a-natural-singer/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T01:58:01Z"
}