{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><em><strong>New and improved video and audio! </strong></em>Last updated 6/21/2016<br></p><p><em>Last updated: 5/16/2016</em></p>\n\n<p><strong><em>New and improved video quality!</em></strong></p>\n\n<ul><li>Do you want to learn to sing but you're too busy to fit yet one more thing in your schedule?</li><li>Are you unsatisfied with the sound of your voice?</li><li>Do you want to develop your voice to its full potential, so you can use it in a natural, relaxed way?</li><li>Were you told that singing is not for you, and therefore are feeling shy about it?</li></ul>\n\n\n\n<p>Now you can learn the fundamentals of singing technique while driving your car, as you commute to and from work, turning the unpleasant experience of driving in traffic into a time to look forward to. The audio files offer guided, step-by-step voice training through various simple but effective vocal warm-ups, which will develop the voice, increase the range, and improve the sound. The most common vocal issues are addressed throughout the course. Most importantly, this can all be done using the boring commuting time to and from work, without having to worry about finding extra time for voice lessons and individual practice.</p>\n\n\n\n<p>If your dream is to learn to sing, but you feel that you couldn't possibly fit voice training into your busy schedule, this course is for you!</p>\n\n\n\n<p>You will receive simple, yet effective, step-by step vocal instruction by an experienced voice teacher, with over twenty years of experience teaching voice lessons in person and online, both in Europe and US. What I've found is that a lot of people don't sing, don't even <em>try </em>to sing even, because they say they don't have time. But in fact, some of my own students say the very same thing: “I don't have time to practice\". So that's why I created this program, <em>Singing for Busy People</em>. Because you can learn to sing while you're commuting to work, while you're walking to work, while you're doing other things around the house; it doesn't have to take hours and hours of time sitting in one place. Based on my years of experience I wanted to simplify the process and make this more widely available to people who really want to learn to express themselves, and who want to feel the joy of what it is to sing from their hearts, without effort.</p>\n\n\n\n<p>The course consists of downloadable video/audio files with a different vocal exercise for every day of the week. The recording will guide you through the practice of the exercises, giving you special instructions, reminders, and addressing the most common issues students often run into.</p>\n\n\n\n<p>There are two tracks for each day (except for Day #3, which has three): one is for your commute to work, the other is for your commute from work. If you don't use the course on your commute, I suggest you still use the two tracks at two different times of the day.</p>\n\n\n\n<p>After the first week, it's recommended that you continue your practice for at least a month, starting again with track #1 the following Monday.</p>\n\n\n\n<p>Have fun!</p>", 
    "end_date": null, 
    "title": "Singing for Busy People", 
    "price": "30.00", 
    "instructors": "Ramesha Nani", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451640_ec22_4.jpg", 
    "course_url": "https://www.udemy.com/singing-course-for-busy-people/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T21:16:34Z"
}