{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Über:</p><li>Veröffentlichung des Kurses im November 2015</li><li>Letztes Update am 27.11.15, Beispiel-Bearbeitung mit der neuen Version von Audacity</li><p><br></p><p>Inhalt:<br></p><p>Wer kennt das nicht: Ein E-Learning Kurs besticht durch hervorragende Inhalte, ein Podcast ist in jeder Ausgabe interessant, aber mangelhafte Aufnahmen und falsches Audio-Editing schmälern den Genuss des Hörers. Amateur-Rapper und Nachwuchssänger verbringen Tage und Wochen damit, ihre Gedanken in einem Song zum Ausdruck zu bringen, und erreichen die Musikfans doch nicht, weil die Stimme in wenigen Minuten unter ungünstigen Bedingungen aufgenommen wird und das Ergebnis Kraft und Gefühl vermissen lässt.</p><p>Dabei sind keine teuren Mikrofone und Vorverstärker oder Investitionen in Studio-Miete notwendig, um gute Aufnahmen zu produzieren! In den meisten Fällen genügen ein gutes Mikrofon, u. U. eine günstige Soundkarte, ein paar Überlegungen zum Raum und einige freie Software-Plugins um die eigenen Stimme so in Szene zu setzen, dass die Aufnahme selbst den Inhalt stützt und nicht verdirbt!</p><p>In diesem Kurs zeige ich in kleinen Schritten, welche Stufen der Aufnahme besonders betrachtet werden sollte und wie an den jeweiligen Stellen im Signalweg Verbesserungen erzielt werden können, ohne dafür viel Geld zu investieren! Dabei ist der Kurs grob in zwei Hälften geteilt: Im ersten Teil bespreche ich den Signalweg, den Raum, Mikrofone, Verkabelung und das Setup bis zur ersten Aufnahme, im zweiten Teil geht es um die Nachbearbeitung der Aufnahme inklusive Reduzierung von Geräuschen, Klangbearbeitung und Kompression. <br><br>Einsteiger können sich mit diesem Kurs einen Überblick über ihre Möglichkeiten verschaffen und lernen die Schritte einer guten Aufnahme kennen, Fortgeschrittene lernen, wie sie mit ihrem vorhandenen Equipment besser arbeiten und an welchen Stellen Investitionen lohnenswert sind. </p><strong>Aufnahmen im Heimstudio können gut, laut und deutlich sein!</strong>", 
    "end_date": null, 
    "title": "Sprach- und Gesangsaufnahmen in bester Qualität produzieren", 
    "price": "30.00", 
    "instructors": "Marc \"Selec\" Zimmermann", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615344_f303_4.jpg", 
    "course_url": "https://www.udemy.com/sprach-und-gesangsaufnahmen/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T23:27:12Z"
}