{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong style=\"\"></strong>  </p>  <p>  \tIncreasing numbers of people are finding themselves drawn to the ethereal and intriguing sounds that have travelled into Europe and America, primarily from Mongolia and Tuva in the former Soviet Union. Most recently popularised in the West by the touring musicians Huun Huur Tu, Yat Kha, and Sainkho Namatchlyak this fascinating style of singing allows the simultaneous production of two or more notes by the same singer. This astounding feat is accomplished by deliberate enhancement of the natural harmonics found in our voices. The voice, mouth, lips, teeth, jaw, throat, tongue, lungs and diaphragm can all be used in a subtle and complex concert that will allow you to produce these wonderful sounds.  </p>  <p>  \t  Overtone and throat singing can be safely and easily learnt by men and women of all ages.  </p>  <p>  \t  A few simple exercises will quickly unlock the wonderful healing and meditational qualities of these unique sounds.  </p>  <p>  \t  These techniques:  </p>  <ul style=\"\">  \t<p>  \t\t  ·Need no prior experience and no musical ‘ability’  \t</p>  \t<p>  \t\t  ·Can allow musical expression free from judgment  \t</p>  \t<p>  \t\t  ·Can allow singer and listener alike to enter deep states of meditative calm and connectedness to their higher selves  \t</p>  \t<p>  \t\t  ·Can release energy blockages and balance the energies of the chakras  \t</p>  \t<p>  \t\t  ·Can facilitate personal journeying and transformation  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Throat singing / overtone singing", 
    "price": "40.00", 
    "instructors": "Jonathan Cope", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343126_d43e_2.jpg", 
    "course_url": "https://www.udemy.com/throat-singing-overtone-singing/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T10:52:37Z"
}