{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<ul>  \t<ul>  \t\t<ul>  \t\t\t<p><strong>Do you think you have what it takes to win The Voice, X Factor, Idol or Got Talent? Do you have a lifelong dream to have enough courage to audition for TV talent shows?</strong></p><p><strong>Have you ever wondered what it REALLY takes to make it on these TV shows? </strong></p><p><em><strong>L</strong><strong><em>et me show you from my experience of working as a voice coach with many of these TV contestants for over ten years, what REALLY counts when you turn up to that first </em></strong></em><strong><em><em>audition!</em></em></strong></p><p><strong><em></em></strong><strong><em>Be a step ahead of your competitors with inside information from someone who knows. </em></strong></p></ul><ul>  \t\t\t<ul>  \t\t\t\t<p>  \t\t\t\t\t<em><strong>What is the course about?</strong></em></p><p><em><strong></strong></em>I reveal the secret lessons that make the difference between being left out and taken to the next round - I'll guide you through the exact process so you know \"What comes next\" and can use this to beat your competitors - The secrets to dressing like a rockstar so the judges can't ignore you.</p><p>This course is a great introduction on how to prepare for your: The Voice, X Factor, Idol or Got Talent audition.  Learn about how the process works, what is expected from you, and how to prepare to have the best advantage possible of making it through to subsequent rounds, and hopefully be a winner!</p>  \t\t\t\t<p>  \t\t\t\t\t<strong><em>Who is this course for?</em></strong>  \t\t\t\t</p>  \t\t\t</ul>  \t\t\t<p>  \t\t\t\t<strong></strong>This course is for new contestants who have never done an audition for a talent TV show such as The Voice, X Factor, Idol or Got Talent Shows. It is suitable for performers of any age and talent level who are beginning their journey on TV.  \t\t\t</p>  \t\t\t<p>  \t\t\t\t      This course is not for students who have already been through their first round of auditions and through to the second series of auditions (the second series of auditions are usually the televised ones).  \t\t\t</p>  \t\t\t<p>  \t\t\t\t<strong><em>What can you expect from this course?</em></strong>  \t\t\t</p>  \t\t\t<p>  \t\t\t\t        The course is a series of short videos with a power point presentation - a quick overview to help students prepare for the audition process.  \t\t\t</p>  \t\t\t<p>  \t\t\t\t        It should take around 35 minutes to complete.  \t\t\t</p>  \t\t\t<p>  \t\t\t\t  I will share with you from my experience as a vocal coach and judge on these shows what goes on behind the scenes so that you can have the advantage.  \t\t\t</p>  \t\t\t<p>  \t\t\t\t<strong><em>Why take this course</em></strong>?  \t\t\t</p>  \t\t\t<p>  \t\t\t\tIf you have never experienced what it's like to audition for a TV talent show, then this is the course for you!  You will be able to walk in with confidence, understanding the whole process.  You will therefore be able to perform at your best, and also notice moments of opportunities as they come.  \t\t\t</p>  \t\t\t<p>  \t\t\t\tAt the end of this course, students will:</p>  \t\t\t* Have more confidence throughout the audition process;</ul><ul><br>* Be more aware of opportunities as they arise, helping them to grasp them quickly and efficiently;</ul><ul><br>* Have an advantage over competitors by understanding the process of 'what comes next';</ul><ul><br>* Understand appropriate dress and responses to make it through the next level of auditions. </ul><ul><br></ul><ul>I would love to help you take that step with confidence. I look forward to being your teacher and seeing you have TV Audition success!</ul>  \t</ul>  </ul>", 
    "end_date": null, 
    "title": "TV Singing Auditions - How to Audition to Win", 
    "price": "20.00", 
    "instructors": "Roma Waterman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430378_331e_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-prepare-for-you-x-factor-idol-or-got-talent-audition/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T22:19:09Z"
}