{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><em>A course that focuses on the Vocal Fundamentals needed to build a strong foundation for the voice to work at it's best for singing, and also in applying effective vocal technique healthily. Students are first taken through a study of the Vocal Anatomy to understand how the voice works and then how to engage in make full use of their voices through the Vocal Trinity™. Thereafter, you will be walked through the three important pillars for preparing the body for optimum singing performance - posture (and physical warm-ups), breath control exercises and vocal warm-ups.</em></p><p><em>This course is a recommended entry-level for singers who are new to the Unlock Your Voice™ vocal technique; a prerequisite to building a strong voice.</em></p><p style=\"\"><em>________________________________________________</em></p><p><em></em>The first step in unlocking your voice is to understand what the voice is. This will affect how we treat, regard, train and use our voices. This course helps maximise your vocal capacity through your understanding of the vocal system - your Vocal Anatomy.</p><p>Familiarise yourself with the Vocal Trinity™ that makes up your voice:</p><p> 1 The Power Source</p><p> 2 The Vibrator</p><p> 3 The Resonator</p><p>Build a strong foundation for your voice to perform at its best by understanding and practising the Vocal Fundamentals. Learn how to condition the Vocal Trinity™ to cooperate at its best with you whenever you sing.</p><p>Find out how stage fright affects your body and your voice, and more importantly, what you can do to prevent or lessen the effects of stage fright upon your voice. Follow a routine of physical warm-ups to help relax and prepare your body for singing. Identify the most effective source you have to test if you are singing unhealthily.</p><p>Understand why having good posture is important in singing; get a clear idea on what makes an ideal posture for singing and how to maintain that posture to assist you in good breath control and breath support.</p><p>Learn how to warm-up your vocal cords and vocal mask properly before you sing. These exercises when included in your regular vocal warm-up routine, encourages good phonation as you sing. They also give you better idea on how to approach higher notes in an easy &amp; relaxed manner.</p><p>This course will address common questions singers normally have as they embark on a journey to improve their voices, such as:</p> <ul> <li>Is there a right or wrong way to sing?</li> <li>Is there a particular 'correct' way a singer should sound like when singing?</li> <li>How should I practice?</li> <li>Why and what is Vocal Training all about?</li> <li>How soon will I see the changes in my voice?</li> <li>What is the diaphragm? Why should I care about it?</li> <li>What are vocal cords? Vocal folds? Larynx and the voice box, are they the same thing?</li> <li>Why do males have deeper voices than women?</li> <li>I am not happy with the sound of my voice right now. Can it possibly change? Or is this the sound I'm stuck with?</li> <li>What is the vocal mask?</li> <li>How is it that some singers have that amazing amplified/projected sound?</li> <li>Why do we all sound different?</li> </ul> <p>Tests, notes, graphics &amp; audio tracks are provided along side the videos in this course to facilitate your learning.<br></p>", 
    "end_date": null, 
    "title": "Unlock Your Voice - The Secrets to Singing (Level 1)", 
    "price": "50.00", 
    "instructors": "Janice Yap", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568896_9e9f.jpg", 
    "course_url": "https://www.udemy.com/uyvlevel1/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T04:37:41Z"
}