{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Have you ever wondered what professional singers do to improve their vocal range, and how they learn to sing with consistent power and confidence?  Do you struggle with the &quot;break&quot; in your voice, or experience tension in the throat while singing?   Are you looking for a simple step-by-step set of warm-up exercises that will help to strengthen and free your voice and develop a solid vocal technique?</strong>  </p>  <p style=\"\">  \t                        This course features a series of simple basic warmups for the singing voice, explained in detail by voice teacher and professional singer Robert Lischetti. The warmups also serve as exercises to strengthen the voice and encourage the development of a solid and healthy vocal technique over time. The information contained in these instructional videos is drawn from common sense knowledge of the basic fundamentals of good singing. These are principles which have been used by voice teachers and vocal coaches through decades of vocal pedagogy, to build and develop great voices and help to maintain strength and power and a steady tone well into the years of vocal maturity.  </p>  <p style=\"\">  \t                        The exercises themselves are based on simple scale patterns and are designed to be learned quickly by beginning or advanced students, regardless of the singer’s level of musical training. Mr. Lischetti carefully explains the purpose and proper execution of each warmup, focusing on the specific benefits of that particular exercise, so as to encourage the singer to experience the maximum advantage when using that exercise.  </p>  <p style=\"\">  \t                        The course is laid out in such a way as to begin with the simplest and most basic ideas, and then progresses in a stepwise fashion, each video building on the information in the previous one, promoting the development of good vocal habits through repetition, as new information is introduced.  </p>  <p style=\"\">  \t<strong style=\"\">  The goal of this course is to present a wealth of vocal knowledge and know-how in a simple and straight forward way to anyone who loves to sing and wants to be a better singer.</strong> Robert Lischetti has developed a simple approach to the basic mechanics of good singing through 16 years of experience teaching primarily non-professional and beginning voice students, and some of his students have gone on to professional singing careers. The warmups featured in this course are also the very same warmups that have been the most effective in serving Mr. Lischetti himself throughout his long career as a professional classical singer.  </p>  <p style=\"\">  \t            Here is what some of Robert&#039;s students have said regarding his teaching abilities:  </p>  <blockquote style=\"\">  \t            &quot;My nephew Sam has made consistent and impressive progress while studying with Robert.  His range has increased on both top and bottom, and his voice sounds more natural and effortless with each lesson.  I also appreciate him adapting his teaching to Sam&#039;s personal style.  Bravo!&quot;<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">~ Randall Woolf, composer</strong>  </blockquote>  <blockquote style=\"\">  \t            &quot;Robert Lischetti is an inspiring singer, and as a teacher he demonstrates a rare and unique ability to show his students how to achieve their full vocal potential, regardless of their singing style, age, or previous experience.  His patience and attention to detail are truly amazing.&quot;<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">~ Virginia Hale, student</strong><br style=\"\">  </blockquote>  <blockquote style=\"\">  \t            &quot;I always look forward to my lessons with Mr. Lischetti.  I came to him to improve the range and sound of my voice, and I have seen nothing but positive results.  He always considers what is best for my voice, and I cannot imagine a better voice instructor!&quot;<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">~ Jennifer Carlson, student</strong><br style=\"\">  </blockquote>", 
    "end_date": null, 
    "title": "Vocal Warmups for Great Technique", 
    "price": "30.00", 
    "instructors": "Robert Lischetti", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/146528_0278_2.jpg", 
    "course_url": "https://www.udemy.com/vocal-warmups-for-great-technique/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-13T23:39:25Z"
}