{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t      All sound comes from Vibrations or waves transmitted and heard within our body..  I believe if we approach our vocal instrument in that manner we can allow our instincts to come forth. Learning to feel the sound throughout our bodies or be the sound. All humans have music instincts from the heart and the brain. For example we are born with the rhythm of our heartbeat and then the imagination from the brain can stimulate our emotions in song. The Audio keyboard as well as the vibrations of our body can help us find exactly where those vibrations of sound are coming from then with the physical, mental and  technical information we are able to  put that knowledge together and go back to that place within our bodies always to repeat a wonderful vocal sound and gain more confidence. Practice and self motivation will allow you to remember exactly where that physical, emotional and audio point of sound was placed in you vocal cavity. I have included vocal exercises for you to help tap into that physical space. The videos take you step by step into the physical and mental side of singing. .After I learned the technical side I started to rely more on what I was feeling the vibrations of sound and how the breath and the shapes I was making with my vocal cavity, lips, tongue and jaw affected the sound I was producing. Also my state of mind. Music changes your state of mind. I then began to measure the sound vibrations diagnosing where it came from. I learned to balance the breath stream with the point of contact in my vocal cavity, hard palate  to repeat the sound  over and over again.  These sound vibrations began to tell me who I was as a singer, all the colors of my voice and how I could adjust them as needed.  I feel the student who takes this course will want to sing technically and instinctively to become more intelligent as a singer and begin to rely more on their own body instincts and emotions. I believe they can discover more of their own voice and bring more of the inner voice out.  </p>", 
    "end_date": null, 
    "title": "Vocal Vibrations from the Heart ", 
    "price": "35.00", 
    "instructors": "Kathleen Perry", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319100_621a_6.jpg", 
    "course_url": "https://www.udemy.com/vocal-vibrations-from-the-heart/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T20:28:05Z"
}