{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>ANYONE at any age </strong>can become a more masterful singer with the right information and mindful practice! </p><p><strong>Voice From the Inside out</strong> can help you: extend your range and improve your projection, understand and develop breath support,sing with ease, joy and expression, and, most importantly, <strong>learn how good singing feels in your spirit, mind, body, and heart!</strong></p><p>This course consists of seven lessons covering <strong>the One Big Key, Three Core Principals and Five Core Skills of vocal technique.</strong> </p><ul><li>t<strong>he three core principals of vocal technique</strong>, including the importance of musical and emotional intention (the yum yum exercise)</li><li> <strong>sensory awareness, listening to your body, posture and relaxation from the shoulders up </strong>(the \"duh\" exercise)</li><li> <strong>demystifying </strong><strong>breath support</strong> (onions) </li><li> <strong>how to project with ease and where resonance comes from </strong>(zee slide and 2-4-6-2-6-4-2)</li><li> <strong>tips for high notes</strong> (zeeyamoo) and</li><li><span></span> <strong>how to negotiate register changes</strong> (chest voice to head voice and mixed voice).(zee-va) and finally</li><li><strong>(bonus track) putting it all together- </strong>tips for applying all this to a popular folk song (The Water is Wide)</li></ul><p>Each lesson comes with a vocal exercise that is tailored to help you <strong>experience first hand </strong><strong>what each of these core skills feels like to do successfully.  </strong>Students are encouraged to take as long as they need to master each skill.  Voice from the Inside out is often taught as a one-day crash course, but one or two weeks per skill would still be considered rapid progress. Put together, the seven exercises make an excellent warm-up and exercise regimine.</p><p><br></p><p><strong> </strong></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Voice from the Inside Out: Fun, Holistic Singing Technique", 
    "price": "20.00", 
    "instructors": "Cathleen Wilder", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628552_e674_6.jpg", 
    "course_url": "https://www.udemy.com/voice-from-the-inside-out/", 
    "currency": "USD", 
    "subject_name": [
        "Vocal"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T04:38:08Z"
}