{"selfpaced": true, "topic_name": ["Data Science and Big Data"], "description": "\n\n                    \n                    \n                    \r\nIn this course you will learn Big Data using the Hadoop Ecosystem. Why Hadoop? It is one of the most sought after skills in the IT industry. The average salary in the US is $112,000 per year, up to an average of $160,000 in San Fransisco (source: Indeed).\r\nThe course is aimed at Software Engineers, Database Administrators, and System Administrators that want to learn about Big Data. Other IT professionals can also take this course, but might have to do some extra research to understand some of the concepts.\r\nYou will learn how to use the most popular software in the Big Data industry at moment, using batch processing as well as realtime processing. This course will give you enough background to be able to talk about real problems and solutions with experts in the industry. Updating your LinkedIn profile with these technologies will make recruiters want you to get interviews at the most prestigious companies in the world.\r\nThe course is very practical, with more than 6 hours of lectures. You want to try out everything yourself, adding multiple hours of learning. If you get stuck with the technology while trying, there is support available. I will answer your messages on the message boards and we have a Facebook group where you can post questions.\r\n\r\nWhat are the requirements?\r\n\r\nYou will need to have a background in IT. The course is aimed at Software Engineers, System Administrators, DBAs who want to learn about Big Data\r\nKnowing any programming language will enhance your course experience\r\nThe course contains demos you can try out on your own machine. To run the Hadoop cluster on your own machine, you will need to run a virtual server. 8 GB or more RAM is recommended.\r\n\r\n\r\n\r\nWhat am I going to get from this course?\r\n\r\nOver 97 lectures and 6 hours of content!\r\nProcess Big Data using batch\r\nProcess Big Data using realtime data\r\nBe familiar with the technologies in the Hadoop Stack\r\nBe able to install and configure the Hortonworks Data Platform (HDP)\r\n\r\n\r\n\r\nWhat is the target audience?\r\n\r\nThis course is for anyone that wants to know how Big Data works, and what technologies are involved\r\nThe main focus is on the Hadoop ecosystem. We don't cover any technologies not on the Hortonworks Data Platform Stack\r\nThe course compares MapR, Cloudera, and Hortonworks, but we only use the Hortonworks Data Platform (HDP) in the demos\r\n\r\n\r\n \r\n\n\n                                    ", "end_date": null, "title": "Learn Big Data: The Hadoop Ecosystem Masterclass", "price": 20.0, "instructors": "Edward Viaene", "institution_name": [], "commitment": "6 hours", "subject_name": ["Computer Science"], "course_url": "https://www.udemy.com/learn-big-data-the-hadoop-ecosystem-masterclass/?couponCode=BIGDATA_CC_20", "duration": null, "language_name": ["English"], "provider_name": ["Udemy"], "start_date": "2016-04-30T00:00:00Z"}