{"selfpaced": false, "topic_name": ["Data Science and Big Data"], "description": "\n\n                    \n                    \n                    In this course you will be introduced to the basic ideas behind the qualitative research in social science. You will learn about data collection, description, analysis and interpretation in qualitative research. Qualitative research often involves an iterative process. We will focus on the ingredients required for this process: data collection and analysis.\nYou won't learn how to use qualitative methods by just watching video's, so we put much stress on collecting data through observation and interviewing and on analysing and interpreting the collected data in other assignments.\nObviously, the most important concepts in qualitative research will be discussed, just as we will discuss quality criteria, good practices, ethics, writing some methods of analysis, and mixing methods.\nWe hope to take away some prejudice, and enthuse many students for qualitative research.\n\n                                            Syllabus\n                        Philosophy of Qualitative ResearchWelcome to the first week of the course. We start with an introduction, followed by two lessons on the  Philosophy of Qualitative Research.ObservationIn the first module we discussed the philosophy of qualitative research, explaining some basic notions and general philosophical approaches. In this second module we'll discuss observation as an important method within qualitative research. What types of observation are there? How do we observe? And how do we analyse and describe our data? Good Practices &amp; CriteriaWhat makes qualitative research 'good' is a rather difficult question. Different criteria are suggested, but within the field of qualitative research there is not much agreement on these criteria. However, there is quite some agreement on what good practices of qualitative research are. In this module we will start in lesson 1 with a  discussion of  good practices of qualitative research.Qualitative InterviewingIn this module we'll look at what a qualitative interview entails by trying to define it and by discussing different forms of interviewing behaviour. Qualitative AnalysisIn previous modules we discussed how you should observe a social situation or conduct a qualitative interview. Now we will focus on what to do with your data, by discussing qualitative analysis. In this module you will try to do a qualitative analysis by interpreting your observed data and try to code it. Writing, mixing &amp; ethicsIn this module I will discuss ideas on writing in qualitative research, I will discuss mixing methods  and talk about the ethical issues you should consider. Catch up weekIn this module there's no new material. The only requirement in this module is that you finish up the final peer review assignment.Exam weekThis is the final module, where you can apply everything you've learned up until now in the final exam. Please note that you can only take the final exam once every day, so make sure you are fully prepared to take the test. Please follow the honor code and do not communicate or confer with others taking this exam. Good luck! Once you've taken the exam, please consider doing the other courses in our specialisation track. I hope it was an enjoyable experience. If it was, please consider joining in with the Massive Open Online Research by my colleague Christian Bröer. Thanks for all your hard work, feedback and interpretations, the course team and your fellow learners really appreciate it!\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Qualitative Research Methods", "price": 0, "instructors": "Annemarie Zand Scholten", "institution_name": ["University of Amsterdam"], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/qualitative-methods", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}