{"selfpaced": false, "topic_name": ["Data Science and Big Data"], "description": "\n\n                    \n                    \n                    Con frecuencia, en tu actividad profesional te enfrentas con la necesidad de analizar una gran cantidad de datos con el propósito de identificar si existe alguna relación entre ellos y de esta forma contar con información valiosa que te permita poder tomar una decisión.\n\nLos datos con los cuales se genera la información, además de requerir de un apropiado tratamiento, demandan también de una adecuada técnica para su análisis. \n\nEn este curso serás capaz de conocer y utilizar distintas técnicas basadas en el análisis estadístico con un enfoque hacia la inteligencia de negocios (Business Intelligence), los cuales te permitirán crear modelos para mejorar la comprensión de cómo los datos se relacionan con la población subyacente, validar el modelo  y emplear el análisis predictivo para evaluar escenarios factibles encaminados a orientar tus decisiones futuras.\n\nAl finalizar este curso habrás desarrollado la capacidad de utilizar distintas técnicas para la construcción y evaluación de modelos  que con base en criterios de desempeño preestablecidos te permitirán aprovechar el valor de los datos.\n\nAgradecemos a Fundación Televisa por su participación en la producción de este curso; con lo cual colabora a inspirar y desarrollar el potencial de las personas, a través de su compromiso con la educación y la cultura.\n\n                                            Syllabus\n                        ¿Cómo confiar en los datos?Con frecuencia, en tu actividad profesional te enfrentas con la necesidad de analizar una gran cantidad de datos con el propósito de identificar si existe alguna relación entre ellos y de esta forma contar con información valiosa que te permita poder tomar una decisión. Los datos con los cuales se genera la información además de requerir de un apropiado tratamiento también demandan de una adecuada técnica para su análisis. En este curso serás capaz de conocer y utilizar distintas técnicas basadas en el análisis estadístico con un enfoque hacia la inteligencia de negocios (BI),  los cuales te permitirán crear modelos para mejorar la comprensión de cómo los datos se relacionan con la población subyacente, validar el modelo  y emplear el análisis predictivo para evaluar escenarios factibles encaminados a  orientar tus decisiones futuras. Al finalizar este curso, habrás desarrollado la capacidad de utilizar distintas técnicas para la construcción y evaluación de modelos  que con base en criterios de desempeño preestablecidos te permitirán aprovechar el valor de los datos.     ¿Son válidas las suposiciones sobre mis datos?En diversas problemáticas profesionales relacionadas con el análisis de un gran número de datos,  seguramente  te has encontrado en la disyuntiva de aceptar o rechazar una proposición y seguramente te gustaría tener más información para tomar tu decisión acertada; la forma de lograrlo  es formular el problema a través de una prueba de hipótesis.\n\n¿Cómo saber si una hipótesis estadística está correctamente planteada? ¿La verdad o falsedad de una hipótesis en particular se conoce con certeza sin tener que analizar a toda la población? \n\nAl finalizar este módulo serás capaz de desarrollar un procedimiento de prueba de hipótesis teniendo en cuenta el tipo de información contenida en la muestra aleatoria de la población de interés y evitar la posibilidad de llegar a una conclusión equivocada.Modelos de regresiónEn este módulo conocerás la aplicación de uno de los modelos más populares para la toma de decisiones ya que te permite estimar el valor promedio de una variable dependiente tomando en cuenta una o más variables explicativas o bien hacer inferencias acerca de algún fenómeno del cual no conozcas aún su resultado. Los modelos de regresión pueden ser adaptados a un sinfín de aplicaciones ejecutivas. Hoy en día es mucho más fácil realizar el análisis de un gran volumen de datos gracias a que muchos paquetes estadísticos han desarrollado interfaces amigables con el usuario que le evitan realizar cálculos matemáticos y así el usuario centre su interés en el análisis.  Finalmente, este módulo te ayudará a identificar elementos básicos que integran un modelo de regresión pero sobre todo te permitirán el valor de los datos para una adecuada tomar de decisiones dentro de tu organización.Teoría de filas  Las \"filas\" son un aspecto típico de la vida moderna que nos encontramos continuamente en nuestras actividades cotidianas, en un banco, en un centro comercial, al abordar un avión, en un call center, etc. Este fenómeno se origina cuando tenemos la necesidad de compartir uno o más recursos, los cuales son utilizados para dar atención a un gran número de trabajadores. Las organizaciones frecuentemente deben tomar decisiones respecto a la capacidad de servicios que debe ofrecer. Sin embargo, muchas veces es imposible predecir con exactitud cuándo llegarán los clientes que demandan el servicio y/o cuánto tiempo será necesario para dar ese servicio; es por eso que esas decisiones implican dilemas que se deben de resolver con información escasa. Los modelos de filas no resuelven  directamente el problema, pero generan información que se necesita para tomar las decisiones adecuadas prediciendo algunas características sobre la línea de espera: Al finalizar este módulo serás capaz de entender cómo se estructura un sistema de filas de espera y analizar el costo que implica para las organizaciones operar con recursos ociosos cuando no se analiza adecuadamente la información del número de clientes que demandan un servicio y la duración de éste.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Uso de técnicas estadísticas para el análisis de datos", "price": 0, "instructors": "Dr. José Rodolfo Torres Matus", "institution_name": ["Tecnológico de Monterrey"], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/datos-tecnicas", "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}