{"selfpaced": false, "topic_name": ["Data Science and Big Data"], "description": "\n\n                    \n                    \n                    In this first part of a two part course, we’ll walk through the basics of statistical thinking – starting with an interesting question. Then, we’ll learn the correct statistical tool to help answer our question of interest – using R and hands-on Labs. Finally, we’ll learn how to interpret our findings and develop a meaningful conclusion.\n\nThis course will consist of:\n\nInstructional videos for statistical concepts broken down into manageable topics.\n\tGuided questions to help your understanding of the topic.\n\tWeekly tutorial videos for using R Scaffolded learning with Pre-Labs (using R), followed by Labs where we will answer specific questions using real-world datasets.\n\tWeekly wrap-up questions challenging both topic and application knowledge.\nIn this first of a two part course, we will cover basic Descriptive Statistics – learning about visualizing and summarizing data, followed by a “Modeling” investigation where we’ll learn about linear, exponential, and logistic functions. We will learn how to interpret and use those functions with basic Pre-Calculus. These two “units” will set the learner up nicely for the second part of the course- Inferential Statistics with a multiple regression cap.\n\nBoth parts of the course are intended to cover the same material as a typical introductory undergraduate statistics course, with an added twist of modeling. This course is also intentionally devised to be sequential, with each new piece building on the previous topics. Once completed, students should feel comfortable using basic statistical techniques to answer their own questions about their own data, using a widely available statistical software package (R).\n\nJoin us in learning how to look at the world around us. What are the questions? How can we answer them? And what do those answers tell us about the world we live in?\n\nWant to learn more? Be sure to enroll in Foundations of Data Analysis - Part 2, starting March 22, 2016.\n\n                                    ", "end_date": "2016-03-15T00:00:00Z", "title": "UT.7.10x: Foundations of Data Analysis - Part 1: Statistics Using R", "price": 0, "instructors": "Michael J. Mahometa", "institution_name": ["The University of Texas at Austin"], "commitment": "3-6 hours", "subject_name": ["Computer Science"], "course_url": "https://www.edx.org/course/foundations-data-analysis-part-1-utaustinx-ut-7-10x", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-02-02T00:00:00Z"}