{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Course updated december 2015!</strong></p><p><em><em><em>\"</em></em> The calling card - a video:</em><em> I wanted a fast, professional piece of software. This course gives you a balanced review. It is practical and gives a viewpoint from a practitioner. The area of presentation is the key to getting you idea across. What is in your head needs to be conveyed and who better than you. The course covers the tools that are needed. Some software is good at text, video green screen, etc. This course sorts it out. Bravo.\" </em><strong>Bruce Williams</strong> <em></em></p><p>----------------------------------------------------------------------------</p><p><strong><em>Make Animation Work For You!</em></strong></p><p>After this course you are on your way to make an income with animation!</p><p><strong>Step by step</strong>, over the shoulder videos how to use animation software for marketing and promoting.</p><p>You learn to make <strong>intro videos </strong>for<strong> Udemy courses </strong>and<strong> Fiverr Gigs</strong>.</p><p>How to market your animation service on the <strong>Warrior Forum and Fiverr.</strong><strong></strong></p><ol><li>Promote your animation service in the Warriors For Hire section of the Warrior Forum</li><li>Essential tips for standing out in the animation section on Fiverr</li><li>How to deal with the competition on Fiverr</li><li>The fastest way to become an experienced animation freelancer</li><li>How to use Facebook groups and forums to get clients for your animation</li></ol><p>Whether you have started in Explaindio 2 Pro, VideoMakerFX, Easy Sketch Pro or software like Powtoon<strong>, </strong>Sparkol Video Scribe Whiteboard Animation, in this course you will find the inspiration, examples and practical tips for your animations to get started and make money doing what you love.</p><p><strong>Different kinds of animation for different purposes:</strong></p><ul><li>Kinetic text animation: swinging text with music for your message</li> <li>Whiteboard animation: tell a story in pictures, draw along the storyline</li> <li>Animated Characters: reach your audience through make characters voice their problems</li> <li>HD Video Background combined with Whiteboard animation: all comes together!</li> <li>Talking Head presentation with animation in the background, unique! Only used by higher end animation firms.</li></ul><p><strong><em><em>\"</em>An Ideal Course To Monetise Your New Found Expertise.</em></strong><em>This is my second course with Anneke and I found it useful to discover channels to sell the videos you make. I did enjoy the course, especially Anneke's straight-forward teaching style which suited me. If you are looking to find ways to sell videos this course would be a good investment for you. I am about to purchase my third course from Anneke Camstra on Udemy.<em>\"</em> <em><strong>Les Fletcher</strong></em><span><strong></strong></span></em></p><p><strong>Animation can be used for </strong></p><ol><li>Explainer Videos,</li><li>YouTube Marketing,</li><li>Product Launches,</li><li>Blog Post Openings,</li><li>Kickstarter Projects,</li><li>Local Business Marketing,</li></ol><p>By becoming a specialist in one of the new animation software<strong> you are ready for the new Internet</strong>, where video will be the most used medium of communication.</p><p><em><em>\"</em>Great explained and so easy to follow along: Anneke </em><em>Camstra's Course is very easy to follow along and </em><strong>if you apply what she is teaching you, you will earn some money. </strong></p><p><strong>I know I did. </strong></p><p><em>Thanks for that great course Anneke :)\"  </em><strong>Petra</strong></p>", 
    "end_date": null, 
    "title": "Animation Freelancer: Sell Animation Clickbank, WarriorForum", 
    "price": "20.00", 
    "instructors": "Anneke Camstra", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475722_8d01_15.jpg", 
    "course_url": "https://www.udemy.com/explaindio-cash/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T06:36:41Z"
}