{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tEl curso te enseña:  </p>  <p style=\"\">  \t*Crear vídeos animados con un valor de mercado de 400-1700€  </p>  <p style=\"\">  \t*Hacer vídeos impresionantes: sin editar, sin perder el tiempo con softwares (usando el “método KAMPRAD”)  </p>  <p style=\"\">  \t*Generar miles de reproducciones en Youtube, GARANTIZADAS  </p>  <p style=\"\">  \t*Cómo escribir para atraer clientes  </p>  <p style=\"\">  \t*Los 5 pasos para crear un vídeo viral  </p>  <p style=\"\">  \tAdemás, si eres un emprendedor que todavía no sabe en que lanzarse dentro de este mundo de internet, no es mala idea que pruebes a ofrecer vídeos de tan alta calidad con nuestro <strong style=\"\">“Método Kamprad”</strong>. Aprende a crear tus propios vídeos animados y ofréceselos a otras empresas. Nosotros tenemos muchos clientes que nos piden a diario este tipo de vídeos y hemos llegado a facturar mucho gracias a este método.  </p>  <p style=\"\">  \tEs el momento en que tu empresa empiece a brillar en internet gracias al vídeo. Ahora vas a destacar entre los competidores gracias al <strong style=\"\">“Método Kamprad”</strong>, te voy a enseñar mi truco para que puedas crear vídeos para tu empresa. Tus vídeos, que van a ser compartidos en las redes sociales, los vas a poder poner en la Home de tu página web y subir a tu canal de Youtube, también los vas a optimizar para que indexen en los buscadores. A llegado la hora de que puedas crear vídeos de la más alta calidad y profesionalidad de una manera fácil y económica.  </p>  <p style=\"\">  \t¿Comenzamos?  </p>", 
    "end_date": null, 
    "title": "Aprende a crear vídeos animados sin utilizar softwares", 
    "price": "20.00", 
    "instructors": "Jimmy Heino", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393908_4c21_3.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-crear-un-impresionante-video-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T12:41:41Z"
}