{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Este curso ha sido diseñado para cualquiera que esté interesado en crear vídeos de calidad para sus acciones de marketing en Internet. </p><p>El contenido del curso se centra en aprender a utilizar Explandio, el software de animación Nº 1 para el marketing en Internet. Con este software serás capaz de crear vídeos de todo tipo:</p><ul><li>Vídeos con <strong>animaciones</strong></li><li>Vídeos de <strong>pizarra blanca</strong></li><li>Efectos de <strong>fondo verde</strong>.</li><li>Objetos en <strong>movimiento, transiciones</strong>...</li></ul><p><br></p><p>En este curso aprenderás cómo crear fácilmente vídeos de calidad profesional para:</p><ol><li>Realizar <strong>presentaciones</strong> en vídeo.</li><li>Acciones en <strong>Youtube</strong>: promoción de empresas y productos, o crear contenido para tu propio canal.</li><li>Acciones de <strong>vídeo marketing</strong> en Internet.</li><li>Crear y <strong>vender vídeos</strong> para clientes.</li></ol><p><br></p><p>Se trata de un curso que te enseña <strong>paso a paso</strong> cómo utilizar este software, desde la primera animación hasta la producción final. Los vídeos están grabados en pantalla, de forma que verás cómo lo hago para hacerlo después tú mismo. </p><p>Explaindio es una herramienta <strong>sencilla y de fácil manejo</strong>, a la vez que potente y eficaz. Después de hacer este curso serás capaz de crear <strong>vídeos espectaculares</strong> ¡en cuestión de minutos!</p><p>Se incluyen además <strong>enlaces al software y a recursos extras</strong>.<br></p><p>Los vídeos animados y de pizarra blanca se han hecho muy populares por su capacidad de <strong>atraer la atención, conectar con la audiencia y retenerla</strong>. Frecuentemente son creados por <em>empresas de vídeo marketing</em>. </p><p><strong>Requisitos:</strong></p><ul><li>Deseo de aprender</li><li>Tener el software de Explaindio (si no se tiene se puede acceder a una versión de prueba por 1$ dentro del curso)</li><li>Tener algún contenido que quieras usar en un vídeo</li></ul><p><br></p><p><strong>¿Qué voy a aprender en este curso?</strong></p><ul><li>Acceso a 17 vídeos y 1 hora de contenido</li><li>Acceso a la versión de prueba de Explaindio y a un pack recursos extras gratuitos</li><li>Aprenderás a crear vídeos profesionales</li><li>Conoce cómo hacer vídeos en sólo unos pocos minutos.</li><li>Aprende técnicas y atajos para usar Explaindio más eficientemente.</li><li>Aprende a crear presentaciones con diapositivas que sorprenderán y atraparán a tu audiencia</li><li>Conoce las posibilidades que ofrece Explaindio para hacer revisiones de productos</li></ul><p><br></p><p><strong>¿A quién está dirigido este curso?</strong></p><ul><li>A todo el que quiera aprender a crear vídeos fácilmente.</li><li>Profesionales que quieran impulsar su negocio</li><li>Emprendedores que quieran hacer dinero en Internet</li><li>Youtubers que quieran promocionar y agregar y mejorar contenido dentro de su canal.</li><li>Creadores de tutoriales</li><li>Cualquiera que necesite del vídeo</li><li>Personas que hacen marketing con vídeos</li><li>Cualquiera que quiera ganar dinero produciendo y vendiendo vídeos.</li><li>Todo el que quiera conseguir más visionados en sus vídeos</li></ul>", 
    "end_date": null, 
    "title": "Aprende a Crear Videos Animados con Explaindio", 
    "price": 0, 
    "instructors": "Pau Rodrigo Millan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235062_a436_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-crear-videos-animados-con-explaindio/", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-01T15:22:07Z"
}