{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \tWelcome to the <strong style=\"\">Video For Business </strong>course!  </p>  <p>  \t                  Don&#039;t be put off by the inclusion of the word <em style=\"\">business</em> - it just means that this is a <strong style=\"\">video production</strong> and <strong style=\"\">video marketing</strong> course designed to help you make money with the skills and expertise that you&#039;ll learn. Yes, that might be through effectively marketing your business, but it can also mean this course sets you on a new career path.  </p>  <p>  \t<strong style=\"\">Video for Business</strong> is not a niche course, instead it covers the day to day requirements of a professional video producer and online marketer. You&#039;ll learn about the online video landscape, the details of pre-production, how to shoot and edit professional video, the methods available to get your videos seen, ranked, clicked on and shared and finally, how to measure your results and your successes.  </p>  <p>  \t                  The course is structured in a way to allow complete beginners to start right at the beginning and learn the entire professional pathway, while more experienced students can pick and choose a variety of chapters and lectures to suit their current needs.  </p>  <p>  \t                  I can only reiterate again that this is a full, actionable course. Once complete, you should be able to apply it to your own projects without the need for further guidance. Furthermore, as the video production and marketing profession evolves, so to will this course, with frequent updates and additions to keep you on the right track.  </p>", 
    "end_date": null, 
    "title": "Be A Video Production & Video Marketing Master! ", 
    "price": "50.00", 
    "instructors": "Ryan Stone", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145548_94d8_3.jpg", 
    "course_url": "https://www.udemy.com/videoforbusiness/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-11T14:15:57Z"
}