{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I firmly believe in teaching people how to<strong> create strategy that work</strong>s for them, and not only teaching some basic ideas that may or may not work. <strong>Every channel is different</strong>, <strong>every video is different</strong> so your <strong>strategy needs to be customized for your needs</strong> and what you are delivering!!!!<br></p><p>The <strong>YouTube algorithm is MASSIVE</strong>, and takes thousands of factors in consideration when ranking and featuring content.  We show you the difference between featured videos and search and different way that you might be getting traffic.   We help you understand the reasons behind WHY you should focus in certain areas more than others.  </p><p>In this course we will be showing you stats from our channels, discussing what works and why.  Also showing you some advanced techniques, providing tips and tweaks to help optimize your YouTube Content.</p><p>This is the latest and most advanced YouTube Course, where we help teach you to create Video Marketing Strategies and how to better work with content you have.  Using your analytic's you should be able to read the data, and create data driven decisions to improve your YouTube channel.</p><p>There are many tips on the internet we discuss what works and why.  We also debunk common myths for video marketing on YouTube.</p><p>The best thing about YouTube is you don't need a big budget, its easy to get started and even easy to make extra income.  Creating a regular content plan, having a good video strategy and working inline with what YouTube wants will lead to success over time.   </p><p>Learn to get more subscribers and most importantly viewer retention, what it is, how to use your own analytic's to improve performance.  What to look for in the stats that will lead you to make better decisions and have greater success.</p>", 
    "end_date": null, 
    "title": "Beginners Guide YouTube Video Marketing Techniques", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539378_1b41_2.jpg", 
    "course_url": "https://www.udemy.com/youtube-advanced-video-marketing-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T17:35:59Z"
}