{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t    LATEST: Course Uploaded to Udemy February 2015  </p>  <p>  \t    Please Note: All students to my &quot;<strong style=\"\">Broadcast Yourself - Get First Page Rankings With YouTube</strong>&quot; course here on Udemy get full access to this course for free!  </p>  <p>  \t    WHO ELSE WANTS TO MASSIVELY INCREASE THEIR YOUTUBE <em style=\"\">VIEWS</em>, <em style=\"\">SUBSCRIBERS</em> AND GET <strong style=\"\">FIRST PAGE RANKINGS</strong> IN THE PROCESS?  </p>  <p>  \t<strong style=\"\">- AND DO IT EASILY AND INSTANTLY?</strong>  </p>  <p>  \t<strong style=\"\">- AND FOR FREE OR PAID IF YOU DECIDE TO?</strong>  </p>  <p>  \t<strong style=\"\">- AND WITH NO PRIOR EXPERIENCE OR KNOWLEDGE IS NEEDED!</strong>  </p>  <p>  \t    You are failing at YouTube, by missing the number 1 secret okay let&#039;s face it many secrets ... and yet you probably don&#039;t even know that you are failing!  </p>  <p>  \t    YouTube is owned by Google and when you understand how to effectively set up your YouTube Channel, Descriptions the you distinguish your videos from everybody else&#039;s and TAKE OVER the First Page in the Search Engines.  </p>  <p>  \t    Unfortunately more then 90% of YouTubers fail to get more views and easy ranking because they just don&#039;t know or realize how to achieve these types of results and WHY?  </p>  <p>  \t<em style=\"\">They fail to attract attention.</em>  </p>  <p>  \t<em style=\"\">They fail to get views.</em>  </p>  <p>  \t<em style=\"\">They fail to get subscribers.</em>  </p>  <p>  \t<em style=\"\">They fail to make money.</em>  </p>  <p>  \t<em style=\"\">They fail to get organic rankings by simply incorporating very basic strategies.</em>  </p>  <p>  \t    Unless you do the video creation 100% correctly, you will be failing, too!  </p>  <p>  \t    But how do you achieve these <strong style=\"\">First Page Rankings</strong> quickly, cheaply, above all effectively - and preferably for free get more attention, views, rankings, subscribers while taking over the first page?  </p>  <p>  \t    Well, I am Lee Beattie and I easily get <strong style=\"\">First Page Rankings with YouTube</strong> and I want to show you how I do it especially if you looking for a <em style=\"\"><strong style=\"\">Broadcast Yourself</strong></em> approach that just works.  </p>  <p>  \t    In this <strong style=\"\">beginner friendly</strong> comprehensive YouTube video course, with full accompanying over the shoulder videos, examples, notes. I will lead you down the path by the hand as I demonstrate and easily show you how to make videos, craft expert descriptions, video thumbnails and professional based graphics correctly for your YouTube channel.  BUT I also show you how to do it for <strong style=\"\">FREE</strong> just like I show in my lectures.  </p>  <p>  \t    You do not need to be a expert or even have prior knowledge, SEO expert, graphic artist,designer for that matter.  The best part is that you do not need expensive programs like Photoshop, backlinking softwares or anything like that because I reveal <em style=\"\">FREE</em> resources that will help you achieve these results. Everything, even including my secret copy and paste templates, all supplied for free  in this <strong style=\"\">Broadcast Yourself Get First Page Rankings</strong> course.  </p>  <p>  \t    Your Channel <em style=\"\">setup</em>, <em style=\"\">keywords</em>,<em style=\"\">thumbnails</em>,<em style=\"\">resources</em> help to make your video stand out from all of the hundreds of thousands of other articles, websites and of course the other handful of videos when people search <em style=\"\">Google</em> and <strong style=\"\">YouTube</strong>.  </p>  <p>  \t    If you properly <strong style=\"\">set up your channel</strong>, <strong style=\"\">header images</strong>, <strong style=\"\">profile</strong> and <strong style=\"\">video descriptions</strong>, <strong style=\"\">keywords</strong>, <strong style=\"\">thumbnails</strong>, the correct way, all the while following YouTube&#039;s extensive rules and guidelines.  Your video will stand out on the <em style=\"\"><strong style=\"\">first page of the search engines</strong></em> and of course within YouTube easily while others are looking to achieve the same results and you do it effortlessly.  The best part is you will get the organic views, subscribers and if you monetize your efforts then potentially an income from these <strong style=\"\">Broadcast Yourself Get First Page Rankings With YouTube</strong> course strategies.  </p>  <p>  \t    Unfortunately so many people don&#039;t understand YouTube which can put strain on them and potentially be an absolute nightmare and they just stop trying to follow and understand what works, RIGHT?  </p>  <p>  \t    The question is - Do you wanna leverage my experience, my knowledge of YouTube (I <strong style=\"\">get more First Page Rankings organically</strong> that helps my main channel grows and achieve views every month but stay on the first page without any additional effort and easily get subscribers every month on average from the same effort I outline), follow my videos and written lectures - and be as successful at ranking your videos on the first page just like I do (or even more if you are motivated!).  </p>  <p>  \t    What&#039;s even better, however, is that these simple and easy to follow methods are infinite - for example. use YouTube to easily drive more traffic to your offers, squeeze pages, websites and get more views and subscribers in the process, these same people will send you other organic traffic which helps to increase your views, income and subscribers and more while achieving <strong style=\"\">First Page Rankings ORGANICALLY</strong>.  </p>  <p>  \t    The best part is that these one time set it and forget it efforts will continue to send you viewers, hour by hour, day by day ... every day without having to babysit or stress how you keep your videos ranking on the the first page.  </p>  <p>  \t    &gt;&gt;~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~&lt;&lt;  </p>  <p>  \t    Keep in mind YouTube will always send targeted traffic to your videos that are set up effectively which helps you to be successful and you can only be successful if your foundation within your <strong style=\"\">YouTube channel</strong>, <strong style=\"\">description</strong>, <strong style=\"\">thumbnail</strong> and so much more stands out from the busy online space and video crowd that is out there.  </p>  <p>  \t    &gt;&gt;~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~+~&lt;&lt;  </p>  <p>  \t    With over 100 hours of video being uploaded every minute and billions of the videos being uploaded onto YouTube each day by knowing how to stand out from the crowd and distinguish yourself and feature your content to the search engines and potential viewers is a skill that is necessary.  </p>  <p>  \t<strong style=\"\">If you want to get organic first page rankings then this course is for you.</strong>  </p>  <p>  \t<strong style=\"\">If you want more views on YouTube, this course is for you.</strong>  </p>  <p>  \t<strong style=\"\">If you want more subscribers on YouTube, this course is for you.</strong>  </p>  <p>  \t<strong style=\"\">If you want to make more money on YouTube, this course is for you.</strong>  </p>  <p>  \t    It doesn&#039;t matter whether you&#039;re monetizing your efforts with backlinks, or redirect these links to your clients&#039; websites or products – you must catch the eyes of viewers and stand out from the crowd on Google before anything else happens ... and I show you how to do all of this for free, and it only takes minutes to do.  </p>  <p>  \t    As with all my courses:  </p>  <p>  \t    the initial low price will increase shortly - the course is currently $97, but will next increase to $197  </p>  <p>  \t    you have <strong style=\"\"><em style=\"\">UNLIMITED LIFETIME</em></strong> access at no extra costs, EVER  </p>  <p>  \t    all future additional lectures, bonuses, etc in this YouTube course are always free  </p>  <p>  \t    there is an unconditional, no questions asked full 30 day money-back-in-full guarantee back by Udemy  </p>  <p>  \t    Keep in mind my one on one question and answer help is always available to you if you get stuck or have a question - my support is my priority in Udemy and my students and their success is very important to me.  </p>  <p>  \t    Remember: All students to my &quot;Broadcast Yourself Get First Page Rankings With YouTube&quot; course here on Udemy get full access to this course for free to include all future updates and additional strategies at no additional cost to you!  </p>  <p>  \t    Are you going to be my next success story?  </p>  <p>  \t<strong style=\"\">Educate A Macro Community That Funds A Micro Community That Feeds A COMMUNITY</strong> - <em style=\"\">Lee Beattie</em>  </p>", 
    "end_date": null, 
    "title": "Broadcast Yourself - Get First Page Rankings With YouTube", 
    "price": "20.00", 
    "instructors": "Lee Beattie", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284562_a397_5.jpg", 
    "course_url": "https://www.udemy.com/youtube-broadcast-yourself-get-first-page-rankings-with-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-20T15:54:28Z"
}