{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will not only show you how to build a Youtube channel, but the keys and strategies to keeping your Youtube channel successful.</p><p><strong style=\"\">Millions of people are making money off of their Youtube channels, so why not you? </strong></p><p><strong style=\"\"><em style=\"\">We take you through building our own successful Youtube channel and show you the tricks that we used to gain over 500 subscribers and almost 100,000 views in little over two months.</em></strong> This course is very unique in that it won&#039;t just show you how to build Youtube Channels, but it gives you a <strong style=\"\">REAL-LIFE</strong> example of a successful Youtube channel. Also, this channel is not targeted in the marketing niche. It&#039;s in a completely different niche that we found that can help you to see where you should be working to exploit your own interests.</p><p>The course can take as little as an hour to go through. Each video is about 3-5 minutes long with helpful details that you&#039;ll be able to easily understand.</p><p>To get started, all you&#039;ll need is a Youtube login, a way to take videos (ie. smartphone, camera, etc) and that&#039;s it! It&#039;s as simple as that to get started.</p><p><strong style=\"\">Why should you take this course? </strong></p><p>Because we won&#039;t only show you how to build your channel, but give you a real-life example of a Youtube Channel that you can visit and follow on a daily basis.</p><p><strong style=\"\">How is this course different from others? </strong></p><p>I promise <strong style=\"\"><em style=\"\">not to put you to sleep</em></strong>!! There are a million videos out there that make you feel like you&#039;re in a boring lecture hall and the speaker is monotone and boring. Not me! Watch our preview video to see that you&#039;ll actually see my face the entire time and you&#039;ll find <strong style=\"\"><em style=\"\">a little humor </em></strong>throughout the video to keep learning fun and interesting.</p><p><strong style=\"\">I&#039;m consistently adding new lectures to this course. Lectures I&#039;ll be adding this week are: </strong></p><ul style=\"\"><li><strong style=\"\">Copyright Restrictions - How to Tell If Your Content is Violating Copyright Laws</strong></li><li><strong style=\"\">Strikes - What they are, how you get them and how to avoid them </strong></li><li><strong style=\"\">Where to NOT buy traffic from </strong></li><li><strong style=\"\">Where to buy traffic from </strong></li></ul><div style=\"\"><span><br style=\"\"></span></div>", 
    "end_date": null, 
    "title": "Build Your Youtube Channel to 500 Subscribers in Two Months", 
    "price": "30.00", 
    "instructors": "Jackie Parkinson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424514_cee7_8.jpg", 
    "course_url": "https://www.udemy.com/build-your-youtube-channel-to-500-subscribers-in-two-months/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T02:10:26Z"
}