{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Facebook Live video can be an invaluable tool in your marketing quiver!  This is a fairly new marketing platform, and along with other popular live video apps, it is quickly becoming a marketing tool you won't be able to ignore any longer.</p>\n\n<p>It's the perfect medium to establish authentic and more intimate relationships with your audience.  In addition, there's no better way to continue nurturing those relationships than by email.  </p>\n\n<p>This course will show you the easiest way to convert live broadcast viewers into dedicated and engaged email subscribers. </p>\n\n<p>Inside, I will discuss many of the reasons why you should use Facebook Live video and the different types of video you can choose from.  In addition, you'll learn some of the best practices of broadcasting live video using Facebook, so that you'll feel like a pro in no time.</p>\n\n<p>You will also learn the exact components of the webpages you can use to capture the email addresses of your audience.  If you want to become an authority in your niche and grow your list of subscribers in the process, this course is your logical next step.</p>\n\n<p>Did you know that there is a superpower Facebook has given you if you own a Facebook Page?  That's right, and you'll learn step-by-step how to use this superpower using free software for your computer.</p>\n\n<p>As a bonus, you'll receive my highest converting landing pages you can use to make quick use of the concepts you'll learn in this course.  Of course, I show you how to customize these pages so that you can use them instantly.</p>\n\n<p>Don't get left out of cashing in on the live video revolution!  Let me teach you all I know about building your email list using Facebook Live video.</p>", 
    "end_date": null, 
    "title": "Build Your Email List Using Facebook Live Video!", 
    "price": "20.00", 
    "instructors": "Phil Benham", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26112_03f0_4.jpg", 
    "course_url": "https://www.udemy.com/build-your-email-list-using-facebook-live-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-05T21:11:51Z"
}