{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">If you have been struggling to create your svg image files without those double lines then you have come to the right place to learn a better way of creating them. You have probably been taught how to convert a .png file to .svg to use with your whiteboard videos, but those crazy double lines keeping showing up. Converting those .png file to .svg&#039;s just don&#039;t seem to work that well but I am going to help you change that. Here is what you will learn to do in this course.</p><ul style=\"\"><li>Create svg files with the real line by line drawing effect.</li><li>Never have the double lines in your svg files.</li><li>Learn how to set your brush mode to make it happen.</li><li>Learn the best tools for clean line drawing effects.</li><li>I&#039;ll show you examples of what not to do.</li><li>Show you everything to do the right way.</li><li>How to use the pen tool</li></ul><p style=\"\">All you will need is access to Adobe Illustrator or any other software such as Inkscape, or any other that is like Illustrator. Some of these alternatives are free to download.</p><p style=\"\">The videos in this course has been structured in order of importance to help you get the most out of it. This course is about an hour long and gets straight to the point with all of the fluff left out so you can focus on the topics at hand.</p><p style=\"\">Video marketing is huge and isn&#039;t going anywhere so jump on board and learn how to create your very own svg images the right way for yourself, or to offer this new talent as a service to others. If you have any question along the way just send me a message and I will respond as quickly as possible to help you.</p><p style=\"\">Get in now while the price is right because there are time I will add new content as new technology evolves and once you are in, you never pay another cent no matter how large this course gets.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Creating SVG for Whiteboard Videos", 
    "price": "20.00", 
    "instructors": "Bryant Dodd", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487958_9fc8_6.jpg", 
    "course_url": "https://www.udemy.com/creating-svg-for-whiteboard-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T21:56:47Z"
}