{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>---- Course lectures updated and bonus lectures added on 9th March 2016 ----</strong></p>    <p>  \t<em>Would you like to increase your sales by using promo videos? How about an animated video where you don't even need to be on camera?</em>  </p>  <p>  \t                        ....  </p>  <p>  \t                        Video has a huge impact on your brand credibility, and on sales. They produce substantially higher conversion rates (where customers go from browsing to buying) and you'd be crazy not to use them in your business.  </p>  <p>  \t                        The problem is they are either expensive or hard to make.  </p>  <p>  \t                        Not today.  </p>  <p>  \t<strong>This course is a major shortcut </strong>to your first animated promotional video. We'll be working together in each lecture creating <strong>your</strong> video as you learn. No 'learning for learning sake' here, just actionable and productive lectures.  </p>    <p>  \t                        Hear what my students have to say about this course:  </p>  <p><em>'This was BRILLIANT! After going through this course I felt like I was using it like a pro, I already knew all the tricks to work around the limitations of the system and was able to produce my first, very professional looking video is a really short amount of time, THANK YOU!!' -Paul</em></p><p>  \t<em>'Pure information - no clutter! Enjoyed this course so much, you'll save about $104 thanks to lecture 5. This course is a shortcut to mastery.' - Brandon</em>  </p>  <p>  \t<em>'I didn't know what I was looking for till I found you. The course was great, no really, its fantabulous.' - April</em>  </p>  <p>  \t<em>'Powerful course here! Powerful, engaging and so easy to follow. All instructors need this course!' - Rosa</em>  </p>  <p>  \t<em>'Well done this course was amazing...I am now a convert, loved the style and engaging voice over.' - Leap Training Institute</em>  </p>    <p>  \t                    By the end of this course you will have your own promo video, all:  </p>  <ul>  \t<li>without appearing on camera</li>  \t<li>without having to buy anything more than a microphone and a Powtoon account</li>  \t<li>without wasting time learning to master complex programs like Adobe After Effects.</li>  </ul>  <p>  \t                    Plus you'll have my proven workflow (PDF) that produces quality videos in the fastest time possible.  </p>  <p>  \t<strong>30 Day Money Back Guarantee.</strong> You are backed by Udemy's 30 day refund policy. No sweat.  </p>", 
    "end_date": null, 
    "title": "Create Animated Explainer Videos - Complete Walkthrough", 
    "price": "20.00", 
    "instructors": "Matt Wong", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367778_b21f.jpg", 
    "course_url": "https://www.udemy.com/usingpowtoon/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T03:31:46Z"
}