{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>Tools</em> <em>work best when (they are) in able hands </em>~ Anonymous</p><p>In this course you'll <strong>learn making marketing videos even professionals envy!!</strong> Just watch the video above to see <em>what this course offers you..</em><span></span></p><p>You will know <strong>powerful techniques of using PowerPoint and Camtasia Studio</strong> to create marketing videos people love to watch. You'll create amazing animations in PowerPoint which you can then convert to marketing videos that are simply awesome.<br></p><p>Now, seeing is believing. So, <em><strong>scroll down this page and </strong></em><em><strong>p</strong></em><em><strong>review the marketing videos you'll learn making in my course.</strong></em><strong> </strong></p><p><strong></strong><em>No fluff, no trick, just solid skills to learn and master that no one would tell you.</em></p><p>At the outset, you'll learn the secret techniques to write video sales scripts that immediately draws viewers' attention. You'll be writing powerful video marketing scripts even if you never wrote any.</p><p>The stage will now be ready for you to <em>master the skills</em> of making animation videos in both PowerPoint and Camtasia Studio. The words to note here: <strong>master the skills</strong>. </p><p>That's right. </p><p>Master special video making techniques that only experts know. In no time you'll start making sleek professional marketing videos as under (see the preview videos below):</p><ol><li>animated text video after converting a text file,</li><li>kinetic typography video in PowerPoint,</li><li>explainer video with animated text and animated clip art, </li><li>whiteboard animation video with scribbling hand, and</li><li>parallax video with animated texts.</li></ol><p>There is a lot more you'll learn in my course, like sourcing free images, fonts, clip arts, music, etc. And you'll also learn how to create noiseless audio for use in your videos.</p><p>What's great about this course is that you can <strong>download all the marketing video templates I use in PowerPoint for free and use them for your needs</strong>. </p><p>So why wait! Enroll in my course now and avail the <em>No-Questions-Asked 30-Day Moneyback Guarantee!</em></p>", 
    "end_date": null, 
    "title": "Create Engaging Marketing Video Like A Pro ", 
    "price": "40.00", 
    "instructors": "Partha Bhattacharya", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632228_4ecf_2.jpg", 
    "course_url": "https://www.udemy.com/create-engaging-e-learning-video-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T10:10:28Z"
}