{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Not long ago, I was a beginner just like you. I tried to learn how to make videos on my own but it cost me months and <em style=\"\">hundreds</em> of wasted dollars (seriously, almost $1k down the drain) because I had no idea what I was doing! Now, I actually get paid to make animated landing page videos (seriously, about $1k per video) for others and in this course I&#039;ll pass that knowledge on to you.<br style=\"\"></p><ul style=\"\"><li>Step by step walkthroughs</li><li><strong style=\"\">Complete video created</strong>, from scratch, during the course</li><li>Detailed instruction every step of the way</li><li>Create your own video by following along</li><li>By the end, you&#039;ll have an awesome animated video!</li></ul><p><br style=\"\"></p><p style=\"\">These types of videos are often called explainer videos, we&#039;ll look at some great animated explainer videos and learn how to make amazing videos of our own.<br style=\"\"></p><p>From nailing the script to hiring a professional voice actor, I&#039;ll go over everything you need to know to make a landing page video that actually converts visitors into customers. We will primarily cover animated videos, but you can easily use my format to create any type of landing page or explainer video that you want.</p><p>This is a step by step course that will walk you through planning and creating a video that will really hit home with your visitors and customers. I even create a video from start to finish during the course!</p>", 
    "end_date": null, 
    "title": "Create Landing Page Videos that convert - for beginners", 
    "price": "50.00", 
    "instructors": "Jack Dean", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/488614_a575_3.jpg", 
    "course_url": "https://www.udemy.com/landing-page-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-28T15:54:34Z"
}