{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Want to learn the basics of creating real 3d commercial in After Effects? </strong></p><p style=\"\"><strong style=\"\">Have you ever seen a commercial on TV and wanted to know how to create it?</strong></p><p style=\"\"><strong style=\"\">Want to learn how to create a Professional looking Commercial for your YouTube channel? </strong></p><p style=\"\"><strong style=\"\">Want to make Professional looking Commercial or Intro for your Courses? For your products? </strong></p><p style=\"\"><strong style=\"\">Or just start your own Motion Graphics Business?</strong></p><p style=\"\">This is way this course is for you.</p><p style=\"\">In this course I take you with me in the process of creating a real life commercial that I used on Youtube channel for my paid courses.</p><p style=\"\">In this course I will be using various softwares to get everything done:</p><ul style=\"\"><li style=\"\">We will be using Photoshop for the cover design, </li><li style=\"\">Cinema 4d for the 3D Object design, </li><li style=\"\">After Effects and Elements 3D for the animation</li><li style=\"\">and <span style=\"\"></span>Optical Flares for the lens flares.</li></ul><p style=\"\">You can use other softwares to do the same thing, or you can just follow along and see the techniques I use.</p><p style=\"\"><strong style=\"\">Once you get through the course you will have all the tools you need to have to start creating your own motion graphics business and earn money.</strong></p><p style=\"\">We will cover everything you need to know to create this commercial, </p><ul style=\"\"><li style=\"\">Using photoshop to create the design, </li><li style=\"\"><span style=\"\"></span>Using cinema 4d for the 3d objects, </li><li style=\"\"><span style=\"\"></span>Loading the cover design into Cinema 4D and applying the materials, </li><li style=\"\"><span style=\"\"></span>Baking and exporting objects from cinema 4D, </li><li style=\"\"><span style=\"\"></span>Using After Effects and Element 3D for the animation, </li><li style=\"\"><span style=\"\"></span>Using pre-comps with text for easy editing, </li><li style=\"\"><span style=\"\"></span>Animating cameras with nulls, </li><li style=\"\"><span style=\"\"></span>Creating fake shadows and rigging options, </li><li style=\"\">Using null objects to control animations, </li><li style=\"\">Creating dynamic transitions, </li><li style=\"\">Adding live footage, </li><li style=\"\">Using basic expressions to control 3d objects, </li><li style=\"\">Texturing in elements 3d, </li><li style=\"\">Using custom text and masks, </li><li style=\"\">Assigning objects to groups, </li><li style=\"\">Using optical flares and real 3d lights, </li><li style=\"\">Creating lens flare transitions, </li><li style=\"\">Controlling transparency with blending modes and much more.</li></ul><p style=\"\">For those of you that did not see any one of my other courses let me explain how this course is built:</p><p style=\"\">The course was shoot in real time. that means that I actually shoot the course while working on the commercial, nothing was scripted and everything you will see happened in real time. </p><p style=\"\">Why do i mention this? because <strong style=\"\">t</strong><strong style=\"\">his course is Super Practical, and no time is wasted on showing you things you will not use.</strong> that means no un-needed explanations on windows and tools you will not use. it is just you and me working together and building the commercial.</p><p style=\"\">On top of all that, you will have open access to all the files I used and created during the work on the project, my Photoshop files, Cinema 4D files, After Effects files. so you can work along with me and actually do the things I am showing you as if you are sitting there next to me.</p><p style=\"\"><strong style=\"\">This course will teach you the techniques and methods to use if you want to create a commercial</strong>, so once you are done with the course you can use my files to create a similar version of the commercial for your own use or use the techniques I teach to create a any type of commercials you want. but whatever you choose, let me just say this - what I teach you here can either generate thousands of dollar for you from selling this type of work or it can save you thousands of dollars from buying this type of work.</p><p style=\"\">The bottom line is:</p><p style=\"\"><strong style=\"\">If you would have wanted to learn all I cover in this course you would need to take a course in photoshop, cinema 4d, after effects and elements 3d and that could cost some money.</strong></p><p style=\"\"><strong style=\"\">In this course you get all that, but you also get the ability to start generating money by creating your own commercials and selling them, selling your online courses, or even selling your project files on sites like Videohive, Pond 5, Template Monster and more.</strong></p>So get the course now and i&#039;ll see you in the course.", 
    "end_date": null, 
    "title": "Create 3D Commercial in After Effects & Element 3D", 
    "price": "20.00", 
    "instructors": "Uri Soglowek", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543054_4f4a.jpg", 
    "course_url": "https://www.udemy.com/create-3d-commercial-in-after-effects-element-3d/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T12:01:01Z"
}