{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is designed for anyone who is interested in creating high quality videos, with Explaindio video creation software.  We show you how easy it is to create and develop high quality videos for any purpose like below.</p><ol style=\"\"><li><strong style=\"\">video marketing</strong></li><li><strong style=\"\">Youtube Promotions</strong></li><li><strong style=\"\">Presentations</strong></li><li><strong style=\"\">Sell videos to clients</strong></li></ol><p>Step by step instructions how to use the software.</p><p>This course is designed for any level of user who is interested in making videos.</p><p>Links to the software are included as well as step by step how to create a video.</p><p>The course is a screenshot video, showing you how to use the software.</p><p>If you want to learn to create videos, this software is highly effective in producing slide type videos.</p><p>Create <strong style=\"\">Attention-Grabbing Professional-Looking Marketing, Explainer &amp; Training Videos</strong> in Just Minutes!</p><p>Now with the new version of Explaindio there is so much more you can do</p><p>promotional videos for products - product reviews - business presentations - sales videos - YouTube videos - marketing videos and much more</p><p>Whiteboard and Animation videos are quickly become some of the most popular and most often created videos by video marketing firms.  The reason is that Whiteboard and Animation videos get attention.  More views and longer audience view times are what every video creator wants.   This course will teach you how to use one of the premiere Whiteboard and animation video Creation software products available.  </p>", 
    "end_date": null, 
    "title": "Easy Video Making Explaindio Video Creator Tutorial", 
    "price": 0, 
    "instructors": "Laurence Svekis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540824_6a8a.jpg", 
    "course_url": "https://www.udemy.com/easy-video-making-explaindio-video-creator-tutorial/", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T02:24:33Z"
}