{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong>2.6K+ Students Enrolled!</strong></p><p style=\"\">Startups have made upwards of $50M in a few days from the simple act of adding a homepage explainer video.  </p><p style=\"\">But not all product videos are created equal.  As companies discover the potential of this medium, it's more important than ever to stand out and leave a lasting impression on your audience.  </p><p style=\"\">You might be a founder, entrepreneur, marketer, or another role. Regardless, sinking time and money into a mediocre explainer in unthinkable. All the same, too many companies put out costly vids that fail to produce results. </p><p style=\"\">So how do you create something memorable?</p><p style=\"\">How do you make sure your video will convert? </p><p style=\"\">How do you find the right balance between quality and cost? </p><p style=\"\">How do you pick the right technique?</p><p style=\"\">How do you select the right producer? </p><p style=\"\">We'll answer all these questions and many more.</p><p style=\"\"><strong>Learn the video creation strategy provided to my former clients, including Venmo, Electronic Arts, and 16 Fortune 500s</strong>.  As the first employee and Senior Account Manager at IdeaRocket, a New York-based animation studio, I got the opportunity to work on 100+ projects for a variety of companies.  Throughout this course, you'll learn the production strategy I extended to our high-paying clients.</p><p style=\"\">Some benefits:</p><p style=\"\"><strong>Hire the right producer.  </strong>Get the best end product and save time and money.  Your outcome hinges on your producer, and there are many considerations most companies don't know about when they enter the video marketplace.  Get help from our <em>Producer Database </em>of 100+ companies, and our <em>Studio Comparison Chart</em>.</p><p style=\"\"><strong>Find the right quality level for your budget. </strong>Many producers tout comparable quality levels for dramatically different pricing, ranging from $300 to $30,000 for a 90-second video.  Don't get fooled - learn how to assess quality and get the best video for your investment.</p><p style=\"\"><strong>Develop your message BEFORE you write your script.  </strong>By going through the discovery process IdeaRocket uses for every single project, you'll build the foundation for a high-converting script.</p><p style=\"\"><strong>Write a persuasive video script.  </strong>As any director will tell you, it's almost impossible to make a great finished product from a lousy script.  To make sure your video will convert, you'll learn the Restriction Method for Writing and you'll get help from templates, samples, and specific strategies.</p><p style=\"\"><strong>Learn how to make an awesome whiteboard video.  </strong>Know when and when NOT to use this style.</p><p style=\"\"><strong>Cast a quality, low-cost voice over. </strong>Your chosen voice will make or break your video. Learn how to get it right by posting a descriptive casting call and using the top artist networks. </p><p style=\"\"><strong>Distribute your video for maximum results. </strong>You'll learn strategies, tools, &amp; hacks for driving conversions, sales, and viewership.  This course is one of a two part series, and it comes with Free Access to <strong><em>V</em>ideo Marketing for Startups &amp; Tech Companies </strong>(for a limited time).</p><p style=\"\"><strong>Get These Added Bonuses When You Sign Up Today:</strong></p><ul><li>Free Extra Course<em>:</em><em> </em>Video Marketing for Startups &amp; Tech Companies ($189 Value)</li><li>Producer Database: hundreds of studios organized by pricing, style, service, and other factors. Find the best provider for your needs.</li><li>Studio Comparison Chart: stack up producers and make an informed decision. </li><li>Voice Over Casting Cheat Sheet: streamline casting and recording.</li></ul><p style=\"\"><strong>This is NOT a DIY Course.  </strong>If you're a startup, entrepreneur, etc., your time is valuable.  Producing an awesome <em>homemade</em> explainer is probably not realistic.  Settling for a low-quality stick figure animation will most likely do more harm than good.  So instead of spinning your wheels and hurting your brand, you'll learn how to (A) build the foundation for your video (your message, script, &amp; voice over) and (B) outsource to the pros in a highly cost-effective way.</p><p style=\"\">As a friendly reminder, this is a no-risk course: it comes with a 30-day, no-questions-asked, money-back guarantee.  </p><p style=\"\">See you inside,</p><p style=\"\">Dan</p>", 
    "end_date": null, 
    "title": "Explainer Videos - Tell Your Story. Win More Customers.", 
    "price": "25.00", 
    "instructors": "Dan Englander", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523298_7a27_2.jpg", 
    "course_url": "https://www.udemy.com/explainer-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T13:24:42Z"
}