{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are you looking for an untapped method to market your business?</strong></p><p><strong>Consider WhatsApp!</strong></p><p>WhatsApp is an instant messaging application for the next generation mobile platform, which enables text messaging between users. It is similar to computer messaging programs that commonly exist in the web, with the difference that this one works in mobile phones.</p><p>It is said to be multiplatform because it is available in different mobile operating systems that currently exist such as IOS, Android, Windows Phone, and Nokia.</p><p>People can use WhatsApp for making calls, chat, or web features. Facebook purchased WattsApp opening it up for its millions of users.</p><p>WhatsApp can also provide great applications to marketing your business. Consider these figures:</p><p>In April 2014, WhatsApp crossed half-a-billion user mark</p><p>70% of users are active on a daily basis. </p><p>The app is the 5th most downloaded app on Android</p><p>This course will show you the basics of how to use WhatsApp to market your business</p><p>Section One looks at the basics of WhatsApp: what it is and its uses.</p><p>Section Two is about the elements of WhatsApp from developing your settings to using chat, call, and web features.</p><p>Section Three delves into how to adapt the characteristics of WhatsApp to market your business.</p><p>Section Four examines ways to apply the app and what to be aware of. </p><p>As you develop your business there are different methods of how to market it to your audience. Can WhatsApp work for you? This course will show you how.</p>", 
    "end_date": null, 
    "title": "Getting Started With WhatsApp Marketing For Business", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702240_7405.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-whatsapp-marketing-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T16:47:32Z"
}