{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Do you want to grow a successful Youtube channel or is it that you want to become a Perfect Youtuber. For Both the reasons, this course is the best and suitable for you. In this course we would talk About 7 Powerful and effective tips that is going to change your Youtube Life for ever.</p><p style=\"\"><strong style=\"\">In this course, we start by going through all of the 7 Tips, one by one in each lectures and after learning about the 7 effective Tips, we would get into action and learn to design some really cool assets in photoshop for our Youtube Channel.</strong></p><p style=\"\">We would be learning to design -</p><ul style=\"\"><li style=\"\">Custom Youtube Profile Picture</li><li style=\"\">A Youtube Channel Art</li><li style=\"\">A Youtube Video Thumbnail</li><li style=\"\">An Amazing Watermark For Branding</li></ul><p style=\"\">This doesn&#039;t end here. For making the course more exciting, We have added a <strong style=\"\">BONUS LECTURE</strong> in which we are going to tell &amp; teach you about an awesome way to make money through your youtube videos, that is &#039;Monetizing&#039; your youtube videos.</p><p style=\"\">With this course, you would also get all the assets that we used for <strong style=\"\">FREE. </strong><span class=\"redactor-invisible-space\" style=\"\">Plus, you would get <strong style=\"\">FAST</strong> reply to your doubts or Questions that you post on the Udemy Question Forum.</span></p><p style=\"\"><span class=\"redactor-invisible-space\" style=\"\">After Watching This Course, your Youtube Channel would improve double times than it was before, We Guarantee You. Hope you like this course and be sure to rate our course and also provide feedbacks about our course and how can we improve ourselves in our Future Courses.</span></p><ol style=\"\"></ol>", 
    "end_date": null, 
    "title": "Grow Your Youtube Channel With 7 Effective Tips", 
    "price": "20.00", 
    "instructors": "Alex Wilson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440254_3ce0_7.jpg", 
    "course_url": "https://www.udemy.com/grow-your-youtube-channel-with-7-effective-tips/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T09:02:36Z"
}