{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t     Video marketing is a simple but powerful SKILL you can use to leverage your business, products and services.  </p>  <p style=\"\">  \t     Efficient marketing videos are simple and can be done by virtually anyone with the right guidance.  </p>  <p style=\"\">  \t <strong style=\"\">We understand the impact that video marketing has over the selling process. </strong>That's why we created this course, to help people like you get the skills you need to produce your very own marketing videos.  </p>  <p style=\"\">  \t           Every product can be explained through <strong style=\"\">VIDEO</strong>, and it's scientifically proven that they have a much<strong style=\"\"> higher influence over regular marketing methods</strong>.  </p>  <p style=\"\">  \tIn this course you'll learn:  </p>  <ul style=\"\">  \t<li style=\"\">the basics behind video production</li>  \t<li style=\"\">how to write a good sales script</li>  \t<li style=\"\">how to mix audio, video and text </li>  \t<li style=\"\">how to deliver a message in an audiovisual fashion. </li>  </ul>  <p style=\"\">  \t  We got our guy Max to record himself creating a simple marketing video for a fictitious product and to go through all of the production process.  </p>  <p style=\"\">  \t           He's going to tell you exactly what you need to know to be able to start creating videos by yourself.  </p>  <p style=\"\">  \tIn the promo video we included the sample video that you will be able to create when you enroll in this course.  </p>", 
    "end_date": null, 
    "title": "How to Create a Marketing Video for Your Business or Product", 
    "price": "20.00", 
    "instructors": "iMarket XL", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255784_5b6e_3.jpg", 
    "course_url": "https://www.udemy.com/marketing-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-04T19:22:07Z"
}