{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Wouldn’t you like to know how to produce video with your iPhone?</p><p>This course will teach you the methods that produce professional-looking video packages every time. </p><p>Michael Choke writes: <strong>\"Another Brilliant Course by Robb Montgomery. Having enjoyed Robb's clarity of instruction and step-by-step guidance in his previous course \"Make iPhone video like a pro in 10 steps,\" I was expecting nothing less than another high quality course from him. In this next course, his instructions are just as clear as ever, and his attention to detail yet again simply amazing. This time round, we still get the direct \"how to\" actionable lessons, coupled with \"secret sauce\" insights derived from years of experience and topped with sharing of working files whenever practical. And boy, I'm impressed! Looking to learn how to film and edit a video story on iPhone? This is it!\"</strong><strong></strong></p><p><span style=\"\">This step-by-step class teaches all aspects of video production: From interviewing to editing.</span><br></p><p>You will learn how to produce professional video in this course.</p><p>No previous video production experience is required.</p><p>First we’ll go over the shots and setups before moving onto scripts and camera standups.</p><p>There are more than 7,700 happy students enrolled in Smart Film School courses including field reporters from Reuters video, CNN and the New York Times.</p><p>I encourage you to read the five-star reviews from real people, just like you. </p><p>Enroll today.</p><p>There is no risk. This course has a 30 day money back guarantee.</p><ul> <li><strong>40 lessons, 2.5 hours of content</strong></li></ul><ul><li>This course features easy-to-follow lessons that will dramatically improve your video production and video storytelling.</li></ul><ul><li>Course updated: November 2015</li></ul><ul><li><strong><strong>T</strong>he instructor has more than 130 </strong><strong>★★★★★</strong><strong> reviews on his Smart Film School courses.</strong></li></ul><p><span></span>Learn to make short videos with an iPhone or iPad in 10 steps:</p>  <ol>  \t<li>Gear, apps and camera settings</li>  \t<li>Shot sizes and filming patterns</li>  \t<li>Interview techniques</li>  \t<li>Filming sequences</li>  \t<li>Writing scripts</li>  \t<li>Recording voice over narration </li>  \t<li>Producing a stand up clip (Piece to Camera)</li>  \t<li>Editing soundbites in iMovie</li>  \t<li>Titles and lower thirds graphics</li>  \t<li>Sharing and analytics</li></ol><p>The lessons in this course were developed from the experiences of training thousands of broadcast journalists how to tell stories with their mobile phones. Get the same training that professional broadcasters use.</p>", 
    "end_date": null, 
    "title": "How to produce a news package video story with an iPhone", 
    "price": "30.00", 
    "instructors": "Robb Montgomery", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418268_f988_5.jpg", 
    "course_url": "https://www.udemy.com/10-steps-to-creating-a-news-video-story-package-with-an-iphone/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T13:12:55Z"
}