{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Video marketing.</p><p style=\"\">It's everywhere. From marketers to entertainers, virtually everybody who's anybody online is on YouTube these days, creating hour after hour of video content to get the attention of the world.</p><p style=\"\">And with good reason, too. </p><p style=\"\">Whether you know it or not, your favorite businesses and entertainers are already using video marketing to reach out to a wider audience. Video is <em style=\"\">engaging</em>. Video is <em style=\"\">personal</em>. And moreso than any other platform, video opens up a two way communication stream between you and the people you want to communicate with, making it the <em style=\"\">perfect</em> platform for sales.</p><p style=\"\"><em style=\"\">Introducing </em><em style=\"\">Video Marketing Profits 2015</em>.</p><p style=\"\">This course will take you from being a complete beginner at making videos, to being an expert in video marketing, including YouTube marketing, video sales letters and video-based product launches. You will learn all the tools of the trade, including:</p> <ul style=\"\"><li style=\"\">Screencasting.</li> <li style=\"\">Writing mind-melting copy for videos that maximize conversions.</li> <li style=\"\">Creating gorgeous “professional quality\" videos on a shoestring budget.</li> <li style=\"\">Sales funnel mastery.</li> <li style=\"\">The 3 most effective video formats.</li><li style=\"\">Launching to your list.</li> <li style=\"\">How to generate a torrent of sales with “the magic buy button\"</li> <li style=\"\">Using video to power instantly-profitable product launches.</li> <li style=\"\">And much, much more.</li></ul> <p style=\"\">Video marketing is one of the most effective ways to make money online.</p><p style=\"\">Everybody has articles—but with videos, you stand out. </p><p style=\"\">And with the videos you learn how to make in <em style=\"\">Video Marketing Profits 2015</em>, you will not only gain a following, but also push your sales and product launches into overdrive. </p><p style=\"\">You will discover the “tricks of the trade\" that other top video marketing experts—not just top internet marketers but also YouTube celebrities—use to build their audiences and sell their products. These are the exact same strategies your favorite YouTube stars are using, and once you have finished the program, you'll have all the tools you need to put them into practice.</p><p style=\"\">=====================================================================================</p><p style=\"\">Your purchase of this course is fully backed up by Udemy's ironclad 100% money back guarantee, so you have nothing to lose. Click the \"Take This Course\" button on the top right of the screen and start learning now! You are free to test drive the course for up to 30 days with no strings attached. If you decide it's just not working out? No problem. Simply contact Udemy support and you'll get 100% of your money back. </p><p style=\"\">This is also a personal promise to you that you'll be blown away by what you'll learn in the next 3 hours. If you don't get a massive return on your investment in this course, I don't want your money and you can return the course, no questions asked. </p><p style=\"\">=====================================================================================</p>", 
    "end_date": null, 
    "title": "How to Produce Promotional Videos to Market Any Business", 
    "price": "20.00", 
    "instructors": "Michael Battle, William Austin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466970_ec4d_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-produce-promotional-videos-to-any-market-any-business/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T21:39:50Z"
}