{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>          This course provides detailed knowledge about <strong style=\"\">applications</strong> you can use to harness the power of Instagram to market your business.  Instagram has <strong style=\"\">over 150 million users on the platform, 16 billion photos shared, and 1 billion likes happening each day</strong>, the photo-sharing and editing platform is one of the most engaging channels on social media. With over 150 million active users on Instagram make sure you are one of them! </p> <p>          In this course I will show you specifically how to: </p> <p>          1.  Create custom text in Instagram for your pictures for business use. These are strategies and tips you have never seen before. </p> <p>          2. Creative ways to use video in Instagram for your business. </p> <p>       3. Use Instagram for business </p> <p>       4. Cultivate a following </p> <p>       5. Leverage Instagram video for promotion and create videos that show client appreciation. </p> <p>       Includes a list of 10 apps that will enhance your photo-sharing experiences. </p> <p>       Please note: This is<strong style=\"\"> NOT</strong> a step-by-step beginner course that will teach you how to take pictures for Instagram. In this course you will learn how to harness the power of Instagram Video for your business. </p>", 
    "end_date": null, 
    "title": "How to Use Instagram Video for Business and Building a Brand", 
    "price": "20.00", 
    "instructors": "Montina Young Portis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118322_9860_5.jpg", 
    "course_url": "https://www.udemy.com/instagramvideoforbusiness/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-11T19:18:50Z"
}