{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Creating videos doesn't have to be difficult or expensive. Using a few little-known capabilities of Microsoft PowerPoint, you can start cranking out YouTube-ready videos to promote your business, to pitch your online course, or just for fun!</p><p><strong>Join over 2,500 students who have discovered how easy it is to create animated, promotional videos with this to-the-point tutorial for all PowerPoint users.</strong></p><p>You'll learn how to:</p><ul><li>Animate and automate text, images, and objects</li><li>Incorporate sound effects and background music</li><li>And, record voice-over narrations…all in PowerPoint!</li></ul><p><strong>Here's what a few of my <em>favorite</em> students had to say:</strong></p><ul><li>\"[By] far the most immediately useful course I have invested in on \nUdemy.\" - B. Williford</li><li>\"[By] far one of the best courses on Udemy.\" - A. Pazeto</li><li>\"I didn't know PowerPoint was this versatile and will absolutely use what I learned when I have to give a presentation again!\" - R. Andel</li><li>“Evan really uncovered some great tips. Easy to follow. Beautifully presented. Thank you.\" - B. Gordon</li><li>“This is a solid course. It delivers on all promises made. Satisfied.\" - J. Smith</li></ul><p>(These are quotes from four of the 45 five-star reviews this course has earned!)</p><p><strong>A Clever Way to Create Awesome, Animated Videos</strong></p><p>Modern, promotional videos are a great way to capture attention and endorse your business, product, or online course. Traditionally, producing an animated video required a fat wallet, specialized skills, and expensive equipment. Animated videos were great but not realistic for entrepreneurs, small business owners, or anyone on a tight deadline.</p><p>Being able to produce animated videos quickly, easily, and independently is a powerful and useful skill for anyone seeking to build or grow an online business or course. Learning how to do this in an easy-to-use program you likely already have is almost too good to be true. <em>Almost.</em></p><p><strong>Course Overview</strong></p><p>Suitable for all PowerPoint users, this course is straightforward and to the point. Unlike many online courses, my lectures include no tangents, no spiraling, and no bloat. This course consists of 14 concise lectures, and in less than an hour you'll learn to make awesome, animated videos.</p><p>Starting with an empty PowerPoint template, this course will break down the steps required to prepare your presentation for high definition (HD) video creation. With these basics mastered, the course will teach you how to add, animate, and automate text, graphics, and objects.</p><p>The next stage will be audio, where you'll work with sound effects, background music, and voice-over narrations. Though all of these elements <em>can</em> be managed in PowerPoint, some people find it easier to pull them into a video-editing software. (Just to be safe, this course will teach both!)</p><p>The last step to the process is exporting your video—optimal settings and a few considerations before wrapping up your video.</p><p>Complete with project files and <strong>a free 15-slide video template, </strong>this course will fully prepare students who complete it with the skills and knowledge to start creating (and even selling) animated videos.</p><p>If you are unsatisfied for any reason, I'll provide a 100% refund.</p>", 
    "end_date": null, 
    "title": "How to Make Animated Videos in PowerPoint", 
    "price": "20.00", 
    "instructors": "Evan VanDerwerker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303948_02f3_11.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T00:06:12Z"
}