{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">*** IN ONLY 3 MONTHS, OVER 230 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE!! *** </strong>  </p>  <p style=\"\">  \t      Start making quality videos, with very little outlay and no experience whatsoever is required to get started!  </p>  <p style=\"\">  \t      If you don’t have any equipment right now, no problem, I will show you exactly what you need to get underway, for all budgets. And the cool thing is, most of you will already have access to the most major piece of equipment to get you underway – I GUARANTEE IT!  </p>  <p style=\"\">  \t<strong style=\"\">Check out our free previews below to get an even better idea on the type of content you can expect.</strong>  </p>  <p style=\"\">  \t      With over <strong style=\"\">230 students (in only 3 months!) </strong>now on their way to making amazing marketing video, product video, business video, blog videos (or video blogging), demo video and information video for their YouTube channel and/or their websites - you too could be creating your own knock out quality video production that will leave your competitors speechless - learning video marketing has never been easier!  </p>  <p style=\"\">  \t      About this course:  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">Join over 230 very happy students </em></li>  \t<li style=\"\"><em style=\"\">No highly expensive cameras &amp; equipment or      years of experience required</em></li>  \t<li style=\"\"><em style=\"\">5 Star Reviews from VERY satisfied students (see      below)</em></li>  \t<li style=\"\"><em style=\"\">Full, free lifetime access</em></li>  \t<li style=\"\"><em style=\"\">All future extra lectures and upgrades are always      included for free</em></li>  \t<li style=\"\"><em style=\"\">Unconditional Udemy 30 day money-back guarantee –      a personal promise of your success!</em></li>  \t<li style=\"\"><em style=\"\">Free updates</em></li>  </ul>  <p style=\"\">  \t      Today, you can start to make good quality videos, easily and affordably with absolutely no previous experience!  </p>  <p style=\"\">  \t      You&#039;ll learn  </p>  <ol style=\"\">  \t<li style=\"\">What camera options you have that will suit your      budget (including using devices you may already own).</li>  \t<li style=\"\">How to easily light your video properly, with      little to no outlay. </li>  \t<li style=\"\">The $60 audio secret that will have you      producing outstanding audio “gold”, every time.</li>  \t<li style=\"\">What single piece of equipment that will transform      you to look like an absolute pro in front of the camera (and which you can      make yourself).</li>  \t<li style=\"\">Which camera settings you need to know about to      take your videos simply to a whole new level.</li>  \t<li style=\"\">Where most people go wrong with their studio      setup.</li>  \t<li style=\"\">How to use even the smallest of spaces to create      an amazing video (and which simple pitfalls to avoid).</li>  \t<li style=\"\">Simple and effective techniques to make your      videos more interesting to watch. </li>  \t<li style=\"\">Easy-to-follow editing tutorials that show you      only what you need to know.</li>  \t<li style=\"\">How to plan your shoot, learn what to wear (and      what not to wear), and how to put a script together to get past writers      block.  \t<p style=\"\">  \t\t  11. How to save a load of time and save literally thousands of dollars on expensive video &amp; lighting equipment you never needed in the first place.  \t</p>  \t</li>  </ol>  <p style=\"\">  \t      ... and much, much more!  </p>  <p style=\"\">  \t      You don’t need any previous experience at all – I will take you through everything you need to know, so you too can be producing not only amazing looking YouTube and/or website videos, but amazing sounding videos too, easily, affordably &amp; in no time at all!  </p>  <p style=\"\">  \t      Whether you have already done some of your own videos, or you have never picked up a video camera before in your life, you can be quickly producing knockout videos ... just like me!  </p>  <p style=\"\">  \t      Click the &quot;take this course&quot; button, top right, now ... <em style=\"\">every hour you delay is costing you money </em>...  </p>", 
    "end_date": null, 
    "title": "How To Make Great Online Videos That Attract More Customers", 
    "price": "20.00", 
    "instructors": "Darryn Aldridge", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240476_efb9_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-quality-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-10T03:04:52Z"
}