{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Review by Ken Katz</strong>  </p>  <p>  \t<strong style=\"\">An Excellent Course Taught By An Excellent Teacher </strong>  </p>  <p>  \t<em style=\"\">This is an excellent course.   John is a great instructor and really knows how to break down what he is trying to convey in small simple to follow steps.   He makes it look easy and after watching him to the steps I found it easy to duplicate it too.  The course covers basic through advanced video creation with Powerpoint.  His animation techniques are superb.  I give a full 100% recommendation to those looking to become proficient with animating in Powerpoint.</em>  </p>  <p>  \t        ==============================================================  </p>  <p>  \t<strong style=\"\">Good Marketing Videos Can Help Any Business</strong>  </p>  <p>  \t                         As a business owner, I’m sure you know you need video to promote your business, but you’re busy and you probably don’t have the time or desire to become a professional video producer.   I mean do you really want to spend all of your time learning a complicated program like After Effects?   And outsourcing is outrageous as far as price goes.  Just one 2 minute video can cost several thousand dollars.  Well, I’ve developed an alternative method specifically designed for small business owners who are on a limited budget, have limited time and would rather not appear in their videos.  </p>  <p>  \t<strong style=\"\">Create Promo Videos the Easy Way</strong>  </p>  <p>  \t                         This course will show you how to create various types of marketing, promo and explainer videos for your business using simple and affordable software (PowerPoint).  Learning how to make promo videos in PowerPoint is much faster and easier than learning how to do it in After Effects or other motion graphics software.  </p>  <p>  \t<strong style=\"\">Here’s How it Works…</strong>  </p>  <p>  \t                         We’ll begin with a fast-start mini-course that shows you how to make a very simple explainer video from start to finish.  This will show you how to make your first marketing video in just a couple of hours.  After that you’ll be ready for the more advanced training included in the course.  </p>  <p>  \t                         The next section of the course will show you how to plan out the various types of marketing videos that you’ll want to make.  It will also show you how to write a powerful marketing script.   Don’t worry this training makes it fast and easy.  All you do is answer six questions and I tell you exactly how to find the answers.  </p>  <p>  \t                         The next section will show you how to make a visually engaging presentation with text and shape effects, custom backgrounds, lower thirds, 3D effects, images and video clips.  I also show you my very best resources for awesome audio and video elements.  </p>  <p>  \t                         Then the course really starts to become fun as we get into the basic, intermediate and advanced animations.   After that I’ll show you how to record, edit and produce a finished video in Camtasia screen recording software.   If you don’t own Camtasia you can get a free 30 day trial and this should be enough to create a few videos for your business.  </p>  <p>  \t                         If you would rather not use Camtasia I also show you how to record, edit and produce your videos in a little known, but very powerful, free recording software.  Finally we go over free and paid hosting solutions for your finished videos.  </p>  <p>  \t<strong style=\"\">Anyone Can Do It</strong>  </p>  <p>  \t                         After going through this training you’ll be able to make engaging videos that people will want to watch.  The more time that people spend watching your videos the more likely they will be to take the action that you want them to take.  This means more traffic to your offers, more leads opting in to your lists, and more sales.  </p>  <p>  \t<strong style=\"\">Who is this training for…</strong>  </p>  <ul style=\"\">  \t<li>Online business owners who want to use video for various marketing efforts</li>  \t<li>Offline business owners who want to use video to increase business</li>  \t<li>People that have a product to sell and need a sales video</li>  \t<li>Anyone who provides marketing services for online or offline businesses</li>  \t<li>People that would like to start a business making videos for other people</li>  \t<li>Virtual assistants who would like to add video production to their list of skills</li>  \t<li>Writers who have a book or ebook that they would like to promote</li>  \t<li>People who sell products as affiliate marketers</li>  </ul>  <p>  \t                This is a self-study course that doesn&#039;t include coaching or consulting; however, if you see something in one of the lessons that you don’t quite understand I would be happy to clarify it for you.  </p>  <p>  \t                The course is extremely detailed, step by step and video based.  Just watch what I do on screen and do it yourself.  It’s designed to be easy even for complete beginners.  The class is ready, so let’s get started.  </p>", 
    "end_date": null, 
    "title": "How to Create Promo Videos in PowerPoint", 
    "price": "30.00", 
    "instructors": "John Piteo", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104692_ccaf_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-explainer-videos-in-powerpoint/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-11T17:09:38Z"
}