{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">I'll give you Skype support for each student who requests it. If you have a question / problem, please send me a message and we will receive an hour of call.</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t       This course is designed for students of all grades. In this step in the training step that will show you how to make money online regularly. That is the secret to finally be independent of their level of experience successfully. This system was used to generate huge profits year after year, while working part-time.  </p>  <p>  \t       Want to know how to create the<strong style=\"\"> video</strong> quality of content?  </p>  <p>  \t       Would you finally start to get involved with<strong style=\"\"> Udemy</strong>, Inc., YouTube or other video sharing network?  </p>  <p>  \t       You can follow the simple instructions, which I set for you to master the art of making animation in no time?  </p>  <p>  \t<strong style=\"\">    That's what I thought!  </strong>  </p>  <p>  \t       You learn to use digital <em style=\"\">video</em> and YouTube to communicate more effectively with your customers and prospects.<strong style=\"\"> Video</strong> may be the ultimate tool \"Sales\", if it is allowed, concerns customers / potential customers fully meet. In this course, practical guidance, advise how to make simple information packed<strong style=\"\"> videos</strong> for your website, YouTube channel, business ideas, the communication between client tools and training.  </p>  <p style=\"\">  \t     The best part? You can register courses at a fraction of the cost of comparable <strong style=\"\">Udemy, </strong>Inc. not only for this course, but that is of course completely risk: If you are not satisfied for any reason, I offer a <strong style=\"\">100%</strong> refund.  </p>  <p style=\"\">  \t     Learn how to make videos of themselves and <strong style=\"\">Business.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t   Hands down the quickest way to <strong style=\"\">make money online</strong> (well, without breaking the law). Lots of students have genuinely made <strong style=\"\">$</strong><strong style=\"\">100+</strong> a day from this technique. It’s completely legal, risk free, <em style=\"\">tax free</em>, and anyone can do it.  </p>  <p style=\"\">  \t<br style=\"\">  </p>  <p style=\"\">  \t   These <em style=\"\">videos</em> is created for one purpose. So that you can learn what you need as quickly as possible, with as little hassle as possible, and get on with your life, so...  </p>  <h5 style=\"\"><strong style=\"\">Jump on it!</strong></h5>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "How to Create Videos Within Hours – All Levels Course", 
    "price": "30.00", 
    "instructors": "Zeeshan Haider", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405290_9411_3.jpg", 
    "course_url": "https://www.udemy.com/create-animate-videos-within-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T14:17:54Z"
}