{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course, you'll learn an easy method to create high quality professional looking videos, without needing to get in front of a camera and without needing any expensive equipment!</p><p><em><strong>This course will teach you how to easily create videos that can be used in video marketing, sales videos, instructional videos (great for Udemy instructors), informational videos, presentation videos and many other types of videos.</strong></em></p><p>If you've struggled with creating videos and wanted high quality videos for your business, product or website, then this course is for you!</p><p> It is no secret that online video has a huge impact. It's huge for building brands and products, it's huge for generating traffic, it's huge for creating high-converting sales-pages. </p><p> If you aren't using video for your business, product or website than you are missing out. </p><p>  \t              Video has taken over marketing in a big away and  this is really just the start of the video revolution. YouTube and other  video sharing sites are immensely popular. Facebook encourages anyone to share videos.  </p>  <p>  \t<strong>Video will increase your brand and credibility.</strong> Video marketing is going to get bigger, no matter what your  position is or what you are promoting. If you need to reach an audience,  especially in large number and via online methods, then using video  is the right marketing campaign to adopt.  </p>  <p>  \t              If you aren't using video for your business than you are missing out greatly. Video gets results. Videos improve consumer engagement, click-throughs, and traffic. Videos also help to bring in search traffic since the major search engines started ranking videos in their results pages.  </p>  <p>  \t              You don't need to be a technical wiz behind the camera, or an Academy  Award-Winning actor in front of the camera to get amazing results.  </p>  <p>  \t          In this course you will learn how easy it is to create videos and discover my simple process  for creating videos that can generate traffic for your website for years to come.  </p>  <p>  \t          When you see these simple, yet powerful, techniques you'll wonder why everyone isn't using them.  </p>  <p>  \t        In this course you'll learn:  </p>  <ul>  \t<li>the basics behind video and audio production.</li>  \t<li>Uncover the best software, hardware and other tools that help make your videos a reality and your life a little easy.</li>  \t<li>best hosting solutions for your videos.</li>  \t<li>Discover how to create videos WITHOUT getting in front of a camera.</li>  \t<li>Making screencast videos and using Powerpoint for your videos.</li>  \t<li>easy to implement design for your videos.</li>  \t<li>best ways to script your videos.</li>  \t<li>and so much more!</li>  </ul>", 
    "end_date": null, 
    "title": "How to Easily Create Awesome Videos", 
    "price": "25.00", 
    "instructors": "Shane M.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356782_c028_5.jpg", 
    "course_url": "https://www.udemy.com/create-awesome-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T06:27:02Z"
}