{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>With Over 2,700 Students and 4.5 Star Rating this is one of the Best Courses on Making Animated Promo Videos!</strong></p><p>Getting a demo video produced professionally can costs thousands of dollars which unfortunately many startups cannot afford to spend.<br></p><p>Professional animation software like After Effects, Flash, or Maya is expensive and too complex to learn.</p><p>In this course I’m going to teach you how to create an awesome animated demo video with just PowToons for FREE!</p><p>PowToons is cheap, and offers a Free Trail Version you can use to create your Animated Videos. You can unlimited Free Videos using this software.</p><p><strong>This Course is a Step by Step Guide that Will Show You have to make an Animated Demo Video in 1 Hr. We will do this by remaking a popular, Master Card Commercial. You know the ones, \"Hotdog $5, 2 Seats near the dugout $150, Spending an afternoon with your son, Priceless\"</strong></p><p>We will cover:</p><p>1. Overview of using PowToons: This includes 2 Comprehensive Section covering everything you need to know in about 20 minutes.</p><p>2. Creating MasterCard Animated Video: We will dive right in and start creating MasterCard Animated Commercial. The audio track is provided in the Resources.</p><p>3. Mastering the Nuances of Animation: Learn how to create a Finished product and getting to perfect.</p><p><strong>In 1 hour you will learn everything you need know to produce an animated promo video that will save you thousands of dollars. Best of all, by the end of the class you will have created your first video!</strong><br></p><p>What Makes this Class Special?</p><ul><li><strong>We Dive Right Into the Animation</strong></li><li><strong>Hand On Class. You will be Animating Right Away</strong></li><li><strong>Quick and to the Point! You will master this in 1hr.</strong></li><li><strong>Very Detailed: Regardless of your background you will be able to follow along and make videos</strong></li><li><strong>Very Simple, Easy and Fun to Learn</strong></li></ul><p>You can chose the speed you want to go. This course is designed so everyone can follow. Even if you have a hard time with computers, you will be able to animate by the end of this course.<br></p><p><strong>What are the requirements:<br></strong></p><ul><li>Mac or PC</li><li>No Software to Download</li><li>Great Attitude!</li></ul><p><strong><em>What am I going to get from this course?</em></strong></p><ul><li>Over 12 lectures and 1 hour of Video Content!</li><li>Practice Making your Promo Video throughout the Class</li><li>A Finished, Pro-Quality Animated Video which you Created!</li></ul><p><strong>What is the target audience?</strong></p><ul><li>First Timers to Animation</li><li>Small Business owners</li><li>Anyone interested in Animating</li></ul>", 
    "end_date": null, 
    "title": "How to Make a Cool Animated Demo Video for Free           ", 
    "price": 0, 
    "instructors": "Stefan Kojouharov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654390_448a_2.jpg", 
    "course_url": "https://www.udemy.com/demo-video-animation-course-how-to-make-promo-videos/", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T10:31:13Z"
}