{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<span><strong style=\"\">You don't need to spend $10K in order to have a professional video produced. Learn to make one yourself the easy way!</strong></span>  </p>  <p style=\"\">  \t<span></span><strong style=\"\">Everything You Need To Know About Creating Killer Explainer Videos</strong>  </p>  <p style=\"\">  \t  You’ve likely already heard that explainer videos can boost conversions anywhere between ten and ten bazillion percent. You’re probably even toying with the idea of doing one for your company.  </p>  <p style=\"\">  \t  The question is… Can you make it any good?  </p>  <p style=\"\">  \t  I teach you how to use my EXACT system to create a professional storyboard explainer video in 1 day. I use this system to create professional promotion videos I change a minimum of $500 per video.. Simpler videos can cost over $5000 to create.  </p>  <p style=\"\">  \t  I’ll walk you the my exact formula to create explainer video for yourself or your clients.  </p>  <p style=\"\">  \t  If you’re a B2B company, you’ll be happy to know a Forbes study titled “Video in the C-Suite” revealed that 59% of C-Suite executives would prefer to watch video over reading text if both are presented on a page.  </p>  <p style=\"\">  \t  The same study showed that 39% of executives called a vendor after seeing an online video.  </p>  <p style=\"\">  \t  On the eCommerce side, a 2012 report by invodo showed that over half of eCommerce buyers report feeling more confident in a purchase decision after watching a product video, and high quality videos can increase cart sizes by an impressive 174%  </p>  <p style=\"\">  \t  According to this research by iStockPhoto, overall online video consumption has risen by 800% in the last 5 years, doesn’t appear to be slowing down any time soon.  </p>  <p style=\"\">  \t<strong style=\"\">In This video you’ll learn:</strong>  </p>  <p style=\"\">  \t  How to Select A Style That Best Communicates Your Brand &amp; Offer  </p>  <p style=\"\">  \t  How to Nail The Script and write your own storyboard  </p>  <p style=\"\">  \t  How to use online services at your finger tips to promote your video  </p>", 
    "end_date": null, 
    "title": "Learn How to Produce Online Explainer Videos That Convert", 
    "price": "50.00", 
    "instructors": "Lucius Kern", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429386_89e5.jpg", 
    "course_url": "https://www.udemy.com/learn-my-exact-system-i-use-to-create-500-explainer-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T22:43:47Z"
}