{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t      The mobile web is here to stay, and smart marketers know that they need to be prepared to stay competitive  </p>  <p style=\"\">  \t      But what does that really mean for your business?  </p>  <p style=\"\">  \t      The first thing you need to know is that people use mobile devices differently than they use desktop computers. Mobile device users know what they want, and they are more likely to act once they find what they are seeking.  </p>  <p style=\"\">  \t      This means different things to different types of businesses.  </p>  <p style=\"\">  \t      For local businesses, it means making sure your business can be found in the places mobile users are looking for local deals.  </p>  <p style=\"\">  \t      Mobile and Location-Based Marketing explores these places, including sites like Foursquare and Yelp, as well as social media location options within Facebook, Twitter, and Google Plus.  </p>  <p style=\"\">  \t      The course also looks into micro-location tactics like geo-tagging, augmented reality, and geo-fencing.  </p>  <p style=\"\">  \t      And if you rely on a website for sales, leads, or brand exposure, preparing your website for the mobile web is imperative.  </p>  <p style=\"\">  \t      Mobile and Location-Based Marketing helps you plan the best mobile solution for your website.  </p>  <p style=\"\">  \t      The course also explores mobile website solutions like responsive web design, mobile website templates, and reputable services.  </p>  <p style=\"\">  \t      And what about mobile apps you ask? Good question.  </p>  <p style=\"\">  \t      The course outlines how to plan the right type of app for your business, and introduces solutions such as coding from scratch, using a framework, or finding a good service.  </p>  <p style=\"\">  \t      But mobile marketing is more than just websites and apps. Mobile and Location-Based Marketing also covers other mobile and location-based marketing topics.  </p>  <p style=\"\">  \t      Topics like marketing using QR codes, mobile advertising, rich media ads, SMS marketing, and creating mobile-ready landing pages for all your mobile marketing efforts.  </p>  <p style=\"\">  \t      The course also includes a number of worksheets to help you create location-based marketing plans, plan your mobile website, plan your mobile app, or create a QR code marketing plan.  </p>", 
    "end_date": null, 
    "title": "Mobile and Location Based Marketing", 
    "price": "20.00", 
    "instructors": "Deltina Hay", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429492_ee63.jpg", 
    "course_url": "https://www.udemy.com/mobile-local-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T02:12:42Z"
}