{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>As seen on: AppTweak, AppLift, SplitMetrics.</p><p>Are you interested in increasing app rankings and app downloads at no cost? Then this course is definitely for you!</p><p>This course contains step-by-step tutorials. I do not use tons of tools and services, instead, I explain an approach to use certain tools and services in order to get straight to the final result.</p><p>This course is appropriate for those who implement everything by themselves, from keyword investigation to Photoshop.</p><p>You will find out two Growth Hacks at the end of the course. The first - how to use 200 letters in the keywords field for one location instead of 100 by default. The second - how to test an app icon before app submission and save time.</p><p>In total the course includes 4 hours of content. Here you will find 2 hours of unique content that is available only on Udemy. You will also get the episodes of my podcast which is available on iTunes, SoundCloud and Stitcher Radio. In addition to that I've included my guest post on AppTweak. The podcast and guest post are available in preview mode, so you can access them for free.</p><p>At the end of the course you will be able to:</p><ul><li>investigate keywords and choose the most appropriate ones;</li><li>create an awesome app icon and screenshots in no time using ready-to-use templates;</li><li>write a description that sells;</li><li>use tools and services that will make your ASO process faster and easier.</li></ul><p>In order to improve, optimize and speed up the ASO process I cover very useful services and templates:</p><ul><li>SensorTower - ASO tool (free plan);</li><li>PixelResort - free icon and screenshots templates;</li><li>Appcrawlr - free service.</li></ul><p>This course is based on iOS App Store optimization, but it is also applicable to the Android platform, because I cover the key aspects of keyword investigation and on-page optimization which are similar for both platforms.</p>", 
    "end_date": null, 
    "title": "Mobile App Marketing at No Cost - Growth Hacking Approach", 
    "price": "50.00", 
    "instructors": "Timur Taepov", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382070_e845_12.jpg", 
    "course_url": "https://www.udemy.com/app-store-optimization-aso-sensortower-mobile-seo-app-ranking/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T10:16:52Z"
}