{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>O curso Monetização em Games e Aplicativos Mobile aborda detalhadamente os estágios do funil de monetização e ensina “como fazer dinheiro com seu app/game”, uma preocupação comum quando o projeto chega à fase de lançamento e todos os esforços são direcionados a transformá-lo em uma fonte de renda, em um verdadeiro negócio.</p>\n\n<p>A definição clássica de monetização é: o ato ou efeito de “transformar” produtos e serviços em dinheiro. Nos dias atuais, esse conceito é aplicado a sites, blogs, canais de vídeos e conteúdo na internet para a geração de receita através da inserção de anúncios, links ou qualquer outro tipo de parceria, com objetivo de lucro compartilhado entre canal e anunciante.</p>\n\n\n\n\n\n<p>Quando bem aplicados, os conceitos e regras fundamentais da monetização propiciam engajamento e conversão em vendas, todos os jogadores conseguem perceber o valor agregado e o game alcança patamares muito relevantes do que em modelos tradicionais. Não só grandes empresas, mas desenvolvedores iniciantes agora têm a chance de criar novos e inovadores modelos de negócios.</p><p>** Este curso será atualizado constantemente pelo professor através de adição de novas aulas, atualização informações, aulas comentadas por outros especialistas da EBG, inserção de estudos de casos e exercícios práticos. <br></p>", 
    "end_date": null, 
    "title": "Monetização em Games e Aplicativos Mobile", 
    "price": 0, 
    "instructors": "Escola Brasileira de Games EBG Online", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/839656_8d1c_5.jpg", 
    "course_url": "https://www.udemy.com/monetizacao-em-games-e-aplicativos-mobile/", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-04T18:04:09Z"
}