{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course gives <strong>a running start</strong> for anyone looking to capitalize on the Periscope phenomenon.  With over 10 Million users, Periscope is a tool <strong>every serious marketer should be using. </strong></p><p>In this course, <strong><em>The One Button Solution To Get Your Message Seen</em></strong>, Communications Veteran Jeff Whitaker strips away the fluff of this app and cuts to the chase.  Through a 12 part video presentation, Jeff lays out an easy to follow, step by step guide to installing Periscope, setting up a profile, finding your way around the app and using this tool to begin broadcasting live in no time.  He also provides supplemental exercises and summary sheets to guide you through the process of personalizing your Periscope experience.</p><p><strong>You’ll Learn -</strong></p><ol>\n<li>How to install the Periscope App</li>\n<li>Setting up a personal profile</li>\n<li>Understanding each function on the App</li>\n<li>How to follow other people on Periscope</li>\n<li>How to attract your own followers</li>\n<li>Step by Step guide to setting up your own LIVE broadcast</li>\n<li>The types and styles of broadcasts you can do on Periscope</li>\n<li>How to find material to use to grow your business and influence online</li>\n<li>Tools and techniques to have your Periscope stand out from others</li>\n</ol><p>… and so much more.</p><p><strong>Less Than ONE Hour</strong></p><p>Inside of one hour, you’ll be on-air broadcasting to the world through your smartphone. With the Periscope App, which is totally free, you’ll easily connect with potential customers as well as current clients.  </p><p>This course will teach you how to use Periscope to:</p><ul>\n<li>Build a following online.</li>\n<li>Stay connected with current clients and customers.</li>\n<li>Increase credibility in your area of expertise.</li>\n</ul><p>Take this course and be up and running communicating with the world in less than an hour.</p>", 
    "end_date": null, 
    "title": "Periscope - The One Button Solution To Get Your Message Seen", 
    "price": "20.00", 
    "instructors": "Jeff Whitaker", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662112_7b26_2.jpg", 
    "course_url": "https://www.udemy.com/periscope-the-one-button-solution-to-get-your-message-seen/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T15:49:18Z"
}