{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Coursed UPDATED 30th Dec 2015</p><p><strong>Periscope\nis great...</strong></p><p>If you looking to make the most of Periscope and stand out from your completion then this course will show you how to do things just not possible with the standard Periscope app from split screens, to green screen, graphic overlays to Skype interviews and more.</p><p><strong>However there is problem…</strong><br></p><p>It’s not all plain sailing and while the developers of the app have gone to\ngreat lengths to make as simple as possible to use, this has lead to some built\nin limitations.</p><p>Probably the biggest is that app was designed to work on a\nmobile device only like an iPhone, iPad or Android phone, it does not broadcast\non a standard PC or MAC.<br></p><p>This might not seem like a problem if you’re someone that doesn’t\nventure far from the ideas of the Periscope team but if you can see the\npotential of Periscope and its huge growth curve in just 9 months, then you’ll\nrealise that you could do much more with it given the chance.</p><p>The biggest problem is that because Periscope only uses the\ncamera of the mobile device, the vast majority of Periscope broadcasts look\nvery similar, namely a person doing a face to camera presentation about two\nfeet away but that is if you don’t use the techniques I’ll show you in this\ncourse.</p><p>Periscope like YouTube is one of those mediums that people will\njudge very quickly. </p><p>Firstly, there is the title and the thumbnail image which may or\nmay not be accurate and secondly when viewers do jump in they will look at the\nscene, maybe hang around for a 10-15 seconds, then if it doesn't get their interest\nthey are off on to the next ‘scope.</p><p>Just like YouTube, you have just a few seconds to get people’s\nattention and the biggest way to do that is to look different and more\ninteresting than your fellow Periscopers.</p><p>Anyone that has used YouTube over the years will have noticed\nthat the quality of many of the top ranking shows, broadcasts, hangouts etc has\ngradually become much more professional over time even though they are in most\ncases still amateur productions. </p><p>Technology has advanced to such a degree that with the right\nequipment, almost anyone can look like a pro whilst working from a room in their\nown home or business.</p><p>The same will happen with Periscope, whilst amateur live streaming\nstill very much like the wild west, it’s only a matter of time before the\nquality of the broadcasts will become better and better leaving the unprepared\nusers behind.</p><p><strong>But here\nis the fix…</strong></p><p>This is where this course comes in, it will teach you how to do\nthings that many think are impossible on Periscope. </p><p>You’ll learn how, using what I like to call the projector method\nyou can get any video content in to Periscope with a quality that is just as\ngood as if it was being brought in directly in to the mobile device.</p><p>I’ll show\nyou how, using low cost video switching software which is available for the MAC\nand PC how you can bring in any video from one or more cameras like a webcams,\nDLSR’s, camcorders, GoPro’s etc.</p><p>Using\nthis software, you’ll be able to position the camera video, resize it, layer it\nwith text or graphics. You can bring in video from other mobile devices such as\nSkype, Blab and even other Periscope shows.</p><p>You'll see\nhow to do live green screen and place yourself on any type of background with\nother video and or graphics which can ultimately lead you to complete virtual\nstudios just like a professional TV studio would use. </p><p>You will\nalso learn how to choose the best type of microphone for your situation and use\na mixer for multiple microphone set-ups.</p><p>By the end of this course you should know how to set-up much\nmore professional looking Periscope shows which will have much more impact on\nyour potential audience with the implications that you will not only boost your viewers but\nalso look much more professional with greater authority\nthan just another person talking in to thier phone in a bedroom.</p>", 
    "end_date": null, 
    "title": "Periscope - Make 'Scopes that people talk about & remember", 
    "price": "50.00", 
    "instructors": "Paul Shillito", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610322_7ebf_4.jpg", 
    "course_url": "https://www.udemy.com/turning-periscope-into-a-live-tv-studio/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T23:36:45Z"
}