{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>THIS IS A GENUINE SKILLS TRAINING TO CREATE SLEEK PROFESSIONAL MOTION GRAPHICS VIDEO IN POWERPOINT. AFTER STUDYING IT YOU'LL EASILY SAVE MONEY MAKING VIDEOS YOUR VIEWERS WILL LOVE TO WATCH! YOU ALSO GET 60+ FREE TEMPLATES WITH THIS COURSE.</strong></p><p>-0-0-0-0-0-0-</p>  <p>  \tVideo making is a HOT business today. But know what, <strong>you have to make video that people love to watch. </strong></p><p><em>It's a sad reality many video makers face on the web every day.</em> Today the videos not only need good contents, <strong>but also VISUAL PLEASURE to impress people</strong>.</p>  <p>In this course you are going to learn the skills to create exciting motion graphics videos with PowerPoint that your viewers would love to watch. You WILL learn making eye-catching animations, record and add audio, and put everything together to make videos that will impress your viewers. <strong>That's my guarantee.</strong></p><p><strong>-0-0-0-</strong></p><p><em>The highlight of my course is that I give you all the PowerPoint animation templates used in the course for free, plus ALL THOSE I ADD IN FUTURE. </em><strong>Right now you get a whopping 46 ANIMATED TEMPLATES for FREE (watch the previews). I aim to give you 100+ templates in the future. </strong><em>This means you can immediately start using them and create videos for your needs. </em></p><p><strong>-0-0-0-</strong></p>  <p>There are more than 60 video lessons in the course that take you through the different stages of making video with PowerPoint.</p>  <p>  \t        If you are an existing PowerPoint user, you will find my lessons easy to understand, and exciting as well. <strong>Check out the course previews below.</strong></p>  \t  <p>  \t        What better way could there be to hit the ground running! <em>I bet you will like this.</em>  </p>  <p>  \t        Btw, do you know you have <strong>30-day money-back guarantee</strong> if you don't like my course? That's right, you have nothing to lose.  </p>  <p>  \t<strong>So why don't you try my course today?</strong>  </p>  <p>  \t        I'll briefly outline the main benefits of my course, but before that I can't resist a recent testimonial from a student:  </p>  <p>  \t<em>\"Fantastic! I already know a great deal about PowerPoint but I learned so much I never thought I could do. This is a great course so worth taking. Thank you for such an educational course.\"</em> <em>– June Hollister</em>  </p>  <p>  \t        If you wish you can go through other testimonials down this page.  </p>  <p>  \t        Okay, so here are the main learning points for you in my course:  </p>  <ul>  \t<li>How to create animations that are simple but leave lasting impression – with texts, shapes, charts, images, clip arts, lines, and smart arts.</li>  \t<li>How to record, edit, merge (2 or more tracks), and embed audio into PowerPoint, and synchronize it perfectly with the slides</li>  \t<li>How to embed, format, trim, and edit external video from YouTube and Vimeo</li>  \t<li>How to create video on another video, and why to do this</li>  \t<li>How to convert PowerPoint slides/video to MP4 video and embed/upload to anywhere</li>  \t<li>How to create interactive dropdown and popup menu, and interactive quiz in PowerPoint (BONUS tutorials)</li>  </ul>  <p>  \t        So what do you think? Isn't the course beneficial for you?  </p>  <p>  \t        Remember, when you enroll, you have <strong>lifetime access</strong> to all the course lessons. You can always come back to the lessons for any reference for ever. <strong>Plus (this is important) you get all my future lessons and templates for FREE, for EVER. </strong></p>  <p>  \t        So no more guessing! No waiting any longer!  </p>  <p>Let this course empower your wants, your ambition.</p>  <p>  \t<strong>Buy this course now, and let me get you started.</strong>  </p>  <p>  \t<em>All the best to you!</em>  </p>", 
    "end_date": null, 
    "title": "PowerPoint Video Magic – Top Video Making Tips", 
    "price": "45.00", 
    "instructors": "Partha Bhattacharya", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54197_6a55_22.jpg", 
    "course_url": "https://www.udemy.com/powerpoint-video-training/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-15T10:05:17Z"
}