{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t                        Finding the courage to get on video and live stream can be hard, but it's so important to get on camera now!  This is a great course for anyone in business, entrepreneurs, MLM marketers, anyone that wants to increase revenue and business through by creating dynamic videos and live stream,  sales videos, webinars, tele-courses, Facebook video ads  or other videos.  </p><p>The time has come!  With platforms like Blab and Periscope as well as Facebook video ads converting far better than picture ads, You Tube top marketing funnel videos and beyond.  If you don't get on video now, your business might get left behind!<br></p>  <p>  \t  Join the other students who are making a big impact with their new \"on camera and live streaming\" skills and techniques.  </p>  <p>  \t  What others are saying:  </p>  <ul>  \t<li>  \t  \t\t                                                                                by                                            Nathan Kamusher,  \t  \t  \t\t<strong>Captivating course</strong>  \t  \t  \t\t  Clearly structured, Easy to follow, Many \"real life\" examples.  \t  \t  \t\t  Lecture 4 provides a useful QuickList to follow when organizing lectures.  \t  \t</li>  \t<li>  \t  \t\t<br>  \t  \t  \t\t  by                                            Rod Adkins,  \t  \t  \t\t<strong>Confidently connecting, captivating, engaging &amp; building the relationship</strong>  \t  \t  \t\t  As you progress  through the course you realize that Tracey grows on you, in terms of the  way she interacts onscreen, you see her character and attitude show  through as she teaches with encouragement how to win in front of the  video camera for any purpose. She has a warm and caring approach and  engages with her audience, demonstrating to show us how to perform. This  works well and completing this course means you have no excuse but to  get in front of a video camera and go for it, with confidence, knowing  that you have a step by step process behind you to cover the vocal,  delivery and presentation aspects as well as many other points that  could make or break your presentation. Recommended.  \t  \t</li>  \t<li>  \t  \t  \t\t                                                                                by                                            Anneke Camstra,  \t  \t  \t\t<strong>excellent course!</strong>  \t  \t</li>  </ul>  <p>  \t                        Want to make your videos stronger, more dynamic?  </p><p>First, we have to get you past your fear and give you some concrete technique that will give you the anchors you need to get started in front of the lens.  Once you've got the anchors, the confidence will come and you'll be well on your way.<br></p>  <p>  \t  If you are falling flat with your voice or sounding artificial rather than engaging, then this is a great course for you.  </p>  <p>  \t  Unsure about what to do with your hands?  Where to look?  What about a script and where to put that?  I will teach you the exact steps to follow to have a flawless video that will keep your audience engaged to the end, which is really want you want!  </p>  <p>  \t  This course is comprised of video, audio and pdf documents that will cover numerous ways to deliver more captivating videos in the areas of content, movement, voice.  For a variety of legitimate reasons far to many people don't execute their best in front of the camera.  It's actually easy to fix some of the most common mistakes that can be found in few key techniques in writing-by truly guiding the listener in a clear and dynamic way, with vocal technique that will enhance and create a dynamic delivery that is fully engaging and will help your sales and in movement and camera technique, because, what your doing in front of the camera can make a dramatic difference videos.  </p>  <p>  \t                  Become a Dynamic and Engaging Presenter in Video will give you the foundation of  technique you need to be more engaging and dynamic than every before.  </p>  <p>  \t                        Many people are nervous when they film their videos, that is a natural response, others struggle with a flat voice, not knowing what to do with their hands or their scripts.  Many individuals that have never filmed before or had any on camera training, don't know how to deliver content with notes and end up reading their scripts which is not engaging.  Captivate the Room on Camera will teach you everything you need to be engaging from start to finish.  This course covers content, creating it and making it dynamic and easy to follow as well as incredible voice techniques, movement techniques and delivery musts.  </p>  <p>  \t                            The course curriculum includes:  </p>  <p>  \t                            Overall Look, which covers your videos look and feel according to your brand and how no matter what your look, confidence is key.  </p>  <p>  \t                            Content is a section that is chock full of fantastic information to help you structure content that is appropriate in length, makes sense, has a great flow and is easy for your audience to not only understand but to connect to, which is key for engagement.  </p>  <p>  \t                            The presentation section covers key technique for writing a script that works for you, dealing with nerves, and breathing for starters.  </p>  <p>  \t                            The on camera section is all about how you move in front of the camera, your face, gestures, where to look and how to present like the expert you are.  </p>  <p>  \t                            The voice section is where you will learn powerful techniques that are invaluable to create an engaging voice that not only captivates your audience but teaches and persuades.  </p>  <p>  \t                            All of the sections are delivered with teaching videos that are easy to follow and many sections include written supporting documents with very valuable content for your success.  Some sections include exercises to help you process the material for your best delivery in front of the camera.  </p>  <p>  \t      I update this course on a regular basis.  I have already updated in November and December with a number of new videos and will continue to add more on a regular basis.  </p>  <p>  \t      I also offer to review your work.  As a part of this course you may submit a video of your work and I will give you a critique on the areas you should improve. I am more than happy to give you direct specifics on what you need to focus on to make your videos go from flat to fabulous!  (And money makers too!)  </p>  <p>  \t  Current price will be going up soon.  </p>  <p>  \t                  I offer a 30 day money back guarantee on this course.  While I have had many years of experience coaching voice, speaking and on camera technique, I realize that everyone has a learning style that they prefer.  I have no doubt that you will benefit from this introductory course and because of that I will gladly offer a 30 day guarantee.  </p>", 
    "end_date": null, 
    "title": "Presenting Success on Camera in Videos and Live Streaming", 
    "price": "45.00", 
    "instructors": "Tracy Goodwin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/222272_a22d_5.jpg", 
    "course_url": "https://www.udemy.com/captivate-your-audience-in-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-18T22:56:18Z"
}