{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Do You Want to Learn how to Make a <em>'Sticky'</em> Animated Video that Gets Your Customers Excited and Ready to Buy? </strong>I will teach you how to create a super sticky animated video that is fun and will get your customers excited. Plus you'll get Feedback along the way. <strong>Students Are Loving this Class:</strong></p><ul><li><strong>Over 500 Sign Ups on the 1st Day alone!</strong></li><li><strong>3,000+ Animation Students </strong>(Full Version &amp; Lite Version)</li><li><strong>5 Star Rating</strong></li></ul><p>&gt;&gt;&gt;By the time this class is over, you will have a killer demo video.&lt;&lt;&lt;</p><p>&gt;&gt;&gt;Please Take Advantage of This Pricing as prices have been increasing and another increase is coming.&lt;&lt;&lt;</p><p><strong>This Course Will Focus on Helping you Create a Kick Ass, Pro-Quality Animated Video in a few Short Hours without having to learn Complicated Software or Spend Hundreds or even Thousands.</strong> </p><p> I will teach you how to make Pro-Quality videos in 1 day using TWO Types of Pro-Quality Software one of which has a Free Version.</p><p>You will Also Learn:</p><ul><li><em>The Single Most Difficult part to creating a 'Great Video' which is, learning how to Tell a Story that <strong>moves your audience to Action!</strong></em></li><li>...And You Will Know when Your Story is on the right track by Getting Constant Feedback from the Class!</li></ul><p>&gt;&gt;&gt;By the time this class is over, you will have a killer demo video.&lt;&lt;&lt;</p><p><strong>I’m going to teach you how to create a Kick-Ass Animated Promo Video using 2 Different types of Software, one of which has a Free Version!</strong></p><p>Doing it yourself often requires learning professional animation software like After Effects, Flash, or Maya which is expensive and too complex to learn.</p><p>Instead, I am going to train you in using 2 Different Types of Professional Grade Animation Software which will cost you less than $80 or even Free with the non-paid version. </p><p><strong>A Great Video is all about the Story it Tells. I will teach you the 5 Elements that will help you create a 'Sticky' Story that Moves your Audience to Action!</strong><br></p><p>Have you noticed how sticky 'gossip' is? For some reason a juicy story just goes viral almost without effort. In this course, we will cover the 5 elements that make stories really sticky and apply them in our videos.</p><p><strong>In this Class, I will show you how to<em> Tell a Story that Moves your Audience to Action using Animation</em>. Best of All You will Get Feedback from the Class on the Quality of Your Story &amp; Video and be able to Product Pro-Quality Videos in 1 Day!</strong><br></p><p>This Class is a Step by Step, interactive guide that will take you from 'Concept' to 'Story' To 'Animated Video' in 1 Day.</p><p><strong>Most Importantly, this is an Interactive Class in which You Will Get Feedback from the Class!</strong></p><p>Imagine if you could have instant feedback each step of the way? Now you can! This is one of the best ways to 'Test' your ideas, stories, and videos and make sure that you are building something people will love.</p><p><strong>We will cover:</strong></p><ul><li>How to Create Killer Content that is Interesting, that Connects with your Audience and Moves them to action!</li><li>Learn how to write an Awesome Story and Dialogue and get Feedback from the Class.</li><li>The Secrets of Pacing, the 6 Second Rule and the Power of 2minutes.</li><li>How to Animate Using 2 Types of Software</li><li>Practice Animating a popular 30 Second Commercial</li><li>Staging 101, Do's and Don'ts as well as the 'Salutes Test'</li><li>AIDA and a few tricks to get your audience to do just anything you want...</li></ul><p>In a few short hours you will learn everything you need know to produce a kick-ass demo video that will save thousands of dollars. Best of all, you will get Feedback and Exposure from sharing your video with the Class.</p><p>-----------------------------------------------------------------------------------------------------------------------</p><p><strong>Students Are Loving this Class</strong></p><ul><li><strong>Over 500 Sign Ups on the 1st Day alone!</strong></li><li><strong>3,000 Animation Students</strong></li><li><strong>5 Star Rating</strong></li></ul><p>-----------------------------------------------------------------------------------------------------------------------</p><p><strong>See What Some of the Students are Saying</strong><strong>:</strong><br></p><p>\"This is 1 of the better course on creating promo video. Stefan show us various tools to make thing easy. Follow the step in the course I am able to create a simple promo in under a few mins. I will play around with it more and create some kiss ass video. I will look forward to more course and hopefully stefan will keep adding lecture to this course. I rate this as a 5 star course\"  Marc Kenny </p><p>\"This is a superb course on creating a killer promo video. the instructor is very knowledgeable in this area. Able to demonstrate how to use various character and sync your story line. With this course I am confident to create my next killer promo video. I highly recommend this course to anyone who want bring their video to the next level.\" Sam Choo</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Promo Video: Create a 'Sticky' Kick-Ass Viral Video in 1 Day", 
    "price": "20.00", 
    "instructors": "Stefan Kojouharov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611314_f342_2.jpg", 
    "course_url": "https://www.udemy.com/promo-video-animation-course-make-demo-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T04:42:34Z"
}