{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>WHAT DO YOU GET IN THIS COURSE?</strong></p><ul><li><strong> No fluff, short and to the point video training</strong></li><li><strong>700+ Students and 5 Star Ratings</strong></li>  \t<li><strong>30 day no question money back guarantee</strong></li>  \t<li><strong>Easy to follow and implement in your own videos</strong></li>  \t<li><strong>Live on camera training, walking the walk, not just talking the talk ;)</strong></li>  \t<li><strong>Become confident on screen and in marketing in general</strong></li>  \t<li><strong>Instructor support right in the course</strong></li>  \t<li><strong>More videos/check-lists/quizzes to be added based on actual customer feedback</strong></li>  </ul>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>But what is this all about?.... </strong>  </p>  <p>  \t<strong>Well... you can check out the video at the top of this page to get an overview, or if you prefer to read then carry on down the page...</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>    <p>  \t<strong>FACT: Celebrity Sells</strong>  </p>  <p>  \t         Now we all know that celebrity status sells.  </p>  <p>  \t         If you could become a 'celebrity' in your field…  </p>  <p>  \t         You'd sell more.  </p>  <p>  \t<strong>FACT: Up to 19% of American adverts are endorsed by celebrities.</strong>  </p>  <p>  \t         And this is NOT a new concept…  </p>  <p>  \t         …Bob Hope signed his name on American Express in the 1950's…  </p>  <p>  \t         …Bill Crosby jiggled for Jell-O for three decades…  </p>  <p>  \t         …Michael Jordan and Tiger Woods have revolutionized the popularity of sports clothing to the masses…  </p>  <p>  \t         …And an endorsement from Totes for's Rihanna's Grammy award winning song 'Umbrella' turned their sales upside down…  </p>  <p>  \t         Just have a think over how many products you've bought that have been sold on the power of celebrity endorsement…  </p>  <p>  \t<strong>FACT: Video Sells</strong>  </p>  <p>  \t         Why? Because it appeals to everyone.  </p>  <p>  \t         Video attacks not just one of the senses - but TWO…  </p>  <p>  \t         (Meaning, that it appeals to people who take in information in both a visual and auditory way)…  </p>  <p>  \t         Giving you far greater appeal…  </p>  <p>  \t         A far greater chance of being understood…  </p>  <p>  \t         And, most importantly, a far greater chance of conversions.  </p>  <p>  \t<strong>FACT: Celebrity PLUS Video = A Money Printing Cash Machine!</strong>  </p>  <p>  \t         Just Imagine…  </p>  <p>  \t         If you could combine the pure undisputed selling power of 'celebrity'…  </p>  <p>  \t         With the mass sensory appeal of quality video…  </p>  <p>  \t         You'd sell more. Full stop.  </p>  <p>  \t         And I'm going to show you step-by-step exactly how.  </p>  <p>  \t<strong>INTRODUCING</strong>  </p>  <p>  \t<strong>The Celebrity Effect - Developing &amp; Demonstrating Trust, Appeal and Influence</strong>  </p>  <p>  \t       I'll teach you how to become the go to person in your market, including:  </p>  <p>  \t<strong><em>Be Exactly Who You Want To Be On Screen</em></strong>  </p>  <p>  \t         No matter who you are or what you think about yourself (you marketers can be well too humble about yourselves!), I will show you how to be EXACTLY who do you want to be on screen. Learn how to create and portray your perfect on screen persona and present with confidence, authority and like-ability.  </p>  <p>  \t<strong><em>         Turn All Your Viewers Into Action Takers  </em></strong>  </p>  <p>  \t         Engagement is the key to turning watchers into action takers and I will show you how to get people to care about you personally AND your products - If you can build eye-gluing engagement from your audience, you WILL sell more more. It really is that simple.  </p>  <p>  \t<strong><em>         Once Upon a Time…  </em></strong>  </p>  <p>  \t         Suck your viewers in and take them on a journey with some superior storytelling and they will be putty in your hands. After 20 years of writing song lyrics which do just that - I will show you how to develop maximum engagement and impact and most importantly maximum sales, with your words.  </p>  <p>  \t<strong><em>         Getting to know you…  </em></strong>  </p>  <p>  \t         Familiarity sells. Why do all these celebrities have instant appeal, trust and influence? Because they are consistent with how they appear on screen. You want every single one of your prospects to be able to instantly recognise you on screen - every time. Being consistent with what you put out there will surge your trust levels and help all of your viewers feel like they know you better. In fact, they'll almost feel like you their friend!…  </p>  <p>  \t<strong><em>         Hello Friend!  </em></strong>  </p>  <p>  \t         If you can learn how to talk to the lens, address a vast audience and still make every single one of your viewers feel like you are only talking to them…you are almost guaranteeing yourself sales. Addressing every single one of your viewers like they are your best friend will make them feel special and much more willing to buy from you. If you can learn to consistently come across like you genuinely care, you'll dramatically surge your trust, appeal influence.  </p>      <p>  \t       Plus much more all delivered to you in person, by me, over a series of no fluff videos sharing what I have learned in over 20 years as a performer and marketer.  </p>  <p>  \t       Within the hour you will have taken on board the knowledge that has taken me years of trial and error to find out, ready to go out there and be the next big thing, the next 'celebrity' in your market.  </p>  <p>  \t       So if you have always wanted to know how to develop yourself into someone that others look up to, follow, and ultimately trust, then this is the course for you!  </p>  <p>  \t       And the fact that more authority = charging higher prices can't hurt either ;)  </p>  <p>  \t       I look forward to seeing you enrol in the course and I'll be on hand to answer any questions you've got so don't think you'll be left alone after you start.  </p>  <p>  \t       To your success,  </p>  <p>  \t       Alex Copeland  </p>", 
    "end_date": null, 
    "title": "Promote Your Personal Brand or Business with Quality Videos", 
    "price": "20.00", 
    "instructors": "Alex Copeland", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411032_133a_2.jpg", 
    "course_url": "https://www.udemy.com/promote-your-personal-brand-or-business-with-quality-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T16:11:34Z"
}