{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>With our course you'll learn the skills\nneeded to:</p><ul>\n\t<li>Earn from $2,000 to $10,000 per\n\tminute of animation at the high end or several hundred dollars per\n\thour of your time on sites such as Upwork; and</li><li>Animate your own amazing\n\tpromotional explainer videos.</li></ul><p>Your product is responsible for turning\ncustomers into customers for life.  Your marketing is responsible for\nturning people into customers.  The problem is most people have very\nshort attention spans, especially when using the Internet.  Promo\nvideos have the power to both explain and improve engagement.</p><p>Having a high quality video such as the\none you'll learn how to make in this course can dramatically increase\nyour Kickstarter donations, Udemy students, startup customers and\nfunding, and nonprofit donations.</p><ul>\n\t<li>Learn how to get people excited\n\tabout your product and the experience that you're offering.</li><li>With your new skill set you will\n\tlearn how to create videos rapidly which means you can sell your\n\tanimations to other people at a substantial profit.</li><li>The easy to edit software can turn\n\tpreviously made promotional videos into new videos in a snap.  Don't\n\tstart from scratch every time – make new videos in minutes.</li></ul><p>Available\non mobile devices such as iOS and Android.</p><p>You\nspent an enormous amount of energy making your product the best it\ncan be.  Click enroll now to kickstart your future and succeed now.</p>", 
    "end_date": null, 
    "title": "Promo Video Mastery: For Startups, Kickstarter, Upwork, etc.", 
    "price": "20.00", 
    "instructors": "Alexander Stern", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639990_678a_2.jpg", 
    "course_url": "https://www.udemy.com/promo-video-mastery-for-startups-kickstarter-upwork-etc/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T04:00:54Z"
}