{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p><em><strong>People\nwho view a web video are 64% more likely to purchase than other site visitors!</strong></em></p><p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p><p>You can increase sales with a great promo video! If you want to drive traffic and<strong> </strong>increase conversion rates<strong></strong> for your product or service, there is no better way than with a promotional video. </p><p><strong>In this course you will go step by step through the process of creating a promo video that your audience will love. </strong></p><p>You will learn effective sales and script writing techniques, what equipment to use and how to save money when choosing it, and how to film and edit to create a final product that is sure to keep your audience engaged and boost your sales numbers. </p><p>The course is geared towards anyone who wants to increase their sales through the use of promotional videos.</p><p><strong>There are currently more than 25 lectures and quizzes designed to take you step by step through making your first video. </strong>There are a total of four sections designed to completed at your own pace. Take as long as you like. You are in control of your learning experience.</p><p>Once the course is completed you will have the skills necessary to create an outstanding video that you can place wherever you see fit. </p><p><strong>Students get lifetime access to the course!</strong> Enroll now and start creating your video today. <em>Every second you wait is costing you money!</em><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Promo Videos: Increase Sales with a Quality Promo Video", 
    "price": "20.00", 
    "instructors": "Rob Molloy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632808_0ef0_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-money-with-promo-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T19:48:00Z"
}