{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Imagine thousands of people watching your sales presentation every day, through the power of online video. You can spread your sales message, with emotion and confidence, using the force of online video. Selling through talking head video used to be reserved for Fortune 500 CEOs, US Presidents and Hollywood celebrities. Now, thanks to low-cost video production and distribution, you can sell your products and services to a worldwide market on the web.</p><p style=\"\">And you can look and sound great, confident and memorable!</p><p style=\"\">You will learn how to use digital video and YouTube to communicate more effectively to your customers and prospects. Video can be the ultimate &quot;sales&quot; tool when it allows you to be fully responsive to customer/prospect concerns. This course will give you practical how-to tips on how to make simple, information packed videos for your website, YouTube channel, sales proposals, client communication and training tools.</p><p style=\"\">Why waste one more day giving average sales presentations when you could be delivering outstanding, video-based, sales presentatons?</p><p style=\"\">Course updated on July 21, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p>", 
    "end_date": null, 
    "title": "Sales Training: You Can Explode Your Sales with Online Video", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285342_ade3_6.jpg", 
    "course_url": "https://www.udemy.com/selling-with-online-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-21T18:04:07Z"
}