{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t          Video marketing is a highly effective business tool that you can use to show off your expertise, share knowledge, market your products, and connect with customers in a relatively easy and inexpensive way. YouTube is not only a search engine, it is also an advertising platform, a social network, and a community site, all rolled into one.  </p>  <p style=\"\">  \t          This condensed program will provide you with all the necessary information to making video marketing work for your business. In &ldquo;Video Marketing Best Practices: Lights, Camera, Action&hellip;Now What?&rdquo; Our experts will share with you the ins and outs that will aid you in maximizing the potential of this powerful audience building tool.  </p>  <p style=\"\">  \t          This course is a must for any business or marketing professional who is looking to leverage video marketing as part of their overall marketing strategy.  Whether you are just starting to create videos or are a &quot;seasoned pro&quot; this session will provide you with key takeaways so that you can ensure your video marketing efforts measurably contribute to your business&#039; brand image.  </p>  <p style=\"\">  \t          In addition, by attending this course, you&#039;ll also receive the complimentary video marketing guide that is designed to help keep your video marketing efforts interactive and effective.  </p>", 
    "end_date": null, 
    "title": "Video Marketing Best Practices for Your Business", 
    "price": "20.00", 
    "instructors": "Digital Marketing Simplified - WSI Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/132998_865d_6.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-best-practices/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-13T02:20:23Z"
}