{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Are you a business owner trying to reach your targeted audience?</p>  <p> Are you trying to find a way for new customers to learn about you and what you offer?</p>  <p>There is a way that you can get a steady stream of local customers and get your message across the world wide web. What is this magical method? Video marketing.</p>  <p>Video marketing refers to incorporating videos into your marketing campaigns so you can promote your company, product or service. A business using this type of internet advertisement creates short videos about specific topics they want to promote, using content from its own articles and other text sources.  </p>  <p>Video is powerful in that it can make an immediate impact. People resonate instantly with what they learn from video. It is the feeling that they are being spoken to and the visual perception helps understand what the message is.</p>  <p>As a new business owner you should be looking into video for your business. Video marketing has taken off in recent years. It is now more accessible and effective than ever before. It is also financially shrewd as in many cases it costs little to nothing. This course can get you started as a business owner in creating the foundation of your video marketing strategy. </p>  <p>Section one looks at the basics of video marketing.</p>  <p>Section two examines outlining your video marketing strategy.</p>  <p>Section three shows the benefits of integrating Youtube, the third largest search engine.</p>  <p>Section four help you understand best practices for continued success.</p>  <p>And section five details sample script blueprints you can follow with your videos.</p>  <p>Video marketing can be a great asset to any new business owner. This course can show you how. </p>", 
    "end_date": null, 
    "title": "Video Marketing For New Business Owners", 
    "price": "20.00", 
    "instructors": "Matt Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750016_b30b.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-for-new-business-owners/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T12:14:14Z"
}