{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Video-Marketing -now you are the director</strong>  </p>  <p>  \t      If you browse through the internet, you will find a wide variety of videos. There are videos with people, there are animated videos, there are videos with music only, or videos with music and voice.  </p>  <p>  \t      As you can see, the video medium offers you many diverse possibilities to display your content.  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t      And there&#039;s no doubt about it: videos will be an essential part of the internet in the future. But unfortunately it&#039;s not that easy to create good and simple videos.  </p>  <p>  \t      This training will show you different possibilities for the creation of videos, which will enable you to easily create your own videos in the future and thus enhance your internet business.  </p>  <p>  \t      You will learn how the content of a video should be like, how to create a video, how to present the video on the internet, how to best publish the video on YouTube, how to drive YouTube traffic directly to your website and many other things.  </p>  <p>  \t      Don&#039;t miss out all the useful tips and tricks, that will help you to get the best out of your video marketing efforts.  </p>  <p>  \t      But the most important thing of all: get things started by creating your first video or optimizing your existing videos!  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Enjoy the feeling of getting things done right</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Video-Marketing - now you are the director", 
    "price": "20.00", 
    "instructors": "Henning Glaser", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296598_aaf4_3.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-business/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T21:17:46Z"
}