{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>2.6K+ Students Enrolled!</strong></p><p><strong></strong>1/3 of all online activity is spent watching video.  </p><p>You might be tempted rush into production or to launch a hasty campaign - but not so fast!  You probably have limited budget, and the stakes are too high to overspend or create mediocre content.  </p><p>So if you're a founder, a marketer, or another startup employee, how much of your budget should you invest?</p><p><span></span>What ROI should you expect? </p><p><span></span>Should you go for animation or live action? </p><p>How should you distribute your video? </p><p>What host should you choose?  (psst... throwing it up on YouTube probably won't be enough)</p><p>We'll answer all of these questions and many more.</p><p><strong>Learn the video marketing strategy provided to my former clients, including Venmo, Electronic Arts, and 16 Fortune 500s</strong>. As the first employee and Senior Account Manager at IdeaRocket, a New York-based business animation studio, I got the opportunity to work with a variety of companies on 100+ productions. Throughout this course, you'll learn the strategies I extended to our high-paying clients.</p><p>Some benefits:</p><p>-<strong>Find your target ROI</strong>.  Use a simple 5-step process, in conjunction with a calculator tool.  Know what you can invest BEFORE you fork over money to a producer. </p><p><strong>-Model your results.  </strong>From our <strong>Video Case Study Database</strong>, you'll find the most relevant examples for your industry.  This will let you plan for success.  </p><p>-<strong>Fit video marketing into your customer funnel</strong>.  Avoid squandering this medium's power.  Show your video to the right audience at the right time.</p><p><strong>-Distribution Strategies, Tools, &amp; Hacks.  </strong>This is an ever-growing library of specific methods for increasing your conversions, sales, and audience.  </p><p>-<strong>Create the foundation for a powerful script</strong>.  Go through IdeaRocket's 20-question Creative Interview.  It's the discovery process we used on every project.</p><p><strong>-Discover interactive video.</strong> Leverage this cutting-edge, underused technology.</p><p><strong><strong>-Get Extra Course for Free </strong></strong>(for a limited time) - <strong>Explainer Video Creation for Startups &amp; Tech Companies<em>.</em></strong>  Find the right producer, technique, and production strategy.  Write a powerful script.</p><p><em><strong></strong></em><strong>Get These Added Bonuses When You Sign Up Today:</strong></p><ul><li>Extra Free Course: Explainer Video Creation for Startups &amp; Tech Companies</li><li>Video Case Study Database</li><li>Video ROI Calculator</li><li>Video Launch Plan</li><li>Lifetime Access to Both Courses</li></ul><p><strong></strong>Multi-million dollar results are achievable - just talk to the newly-launched startups that have made upwards of $50M in days from the simple act of  adding a homepage video (we'll cover these examples).  </p><p>But you have to showcase your video effectively.  This medium can be your most lucrative marketing asset or a headache-inducing money pit.  It just depends on the strength of your strategy. </p><p>The lessons in this course will show you a straightforward growth path, and you'll avoid stress and overspending throughout your production process.  </p><p>As a friendly reminder, this is a no-risk course.  It comes with a 30-day, no-questions-asked, money-back guarantee.  So you have nothing to lose and everything to gain. </p><p>See you inside,</p><p>Dan</p>", 
    "end_date": null, 
    "title": "Video Marketing - Crush Your Campaign. Drive Leads and Sales", 
    "price": "25.00", 
    "instructors": "Dan Englander", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494606_e83d_3.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T22:50:23Z"
}