{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Video Marketing for Professional Coaches will teach you how to use the power of online video to market your coaching practice. The connection you create with clients, your personality and your communication style are important factors that clients look at when choosing a coach.  Referrals are great ways for your existing clients to share these aspects with new potential clients.  But online video can help your clients refer you to their friends, and online video can expose your personality and style to thousands of potential clients over the Internet.  </p><p>If you coach clients by phone or Skype - then using online video is a perfect tool for attracting clients around the globe.  Online video can also work to attract local clients.</p><p>This is a comprehensive course covering everything from the basics to advanced, including selecting a camera, editing your videos, looking good on camera and most importantly, choosing your topics and structuring your videos for maximum impact.</p><p>Every lesson in this course includes videos and pdfs to guide you through the lessons.  There are templates, checklists and sample videos to download.</p><p>The course is broken into short lessons, typically one to five minutes long. Each lesson will guide you through a discrete process such as filming with a webcam, editing with inexpensive software or recording a practice video. We recommend that you watch the videos once, then start the video over and press pause while you take each step. You also have PDF documents that you can print, follow along and take notes.</p><p>This is a self-paced course.  It can be completed in as short as one week, or it can be done one section per week for eight weeks.  You are free to take the lessons in any order you want, but we recommend watching each lesson in order as they build on the prior lessons.</p><p>If you have never recorded a video, this course is a great place to start. We start with equipment you probably already own, and build skills one at a time.</p><p>If you are already publishing videos, this course will help you grow your influence online. You will learn about new equipment options and formulas for creating the types of content your audience wants to view.</p><p>If you want to grow your professional coaching practice and share your talents and skills with the world, online video is a great option. Sharing your knowledge and personality with potential clients is easy when you know how to use online video. Blogging and podcasting are similar options, but online video is superior for coaches who want to create strong connections to potential clients.</p><p><br></p>", 
    "end_date": null, 
    "title": "Video Marketing for Professional Coaches", 
    "price": "50.00", 
    "instructors": "Elizabeth Wisch, Brighton West", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557508_c043.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-for-professional-coaches/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T20:38:38Z"
}