{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">To celebrate our first released course on Udemy we are offering this as a free course that would <strong style=\"\">normally be priced at least $97 or more</strong> given the extreme value that this course offers. <br style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">We may not offer this course as FREE for too long so take advantage of the introductory offer today.</strong></p><em style=\"\"><strong style=\"\">&quot;If you&#039;ve NEVER made a Video with a Computer before, </strong></em><br style=\"\"><em style=\"\"><strong style=\"\">then this course is Perfect for you&quot; <p style=\"\"><br style=\"\"></p></strong></em><p style=\"\"><strong style=\"\"><em style=\"\">&quot;If you want to get a headstart on your YouTube channel </em></strong></p><p style=\"\"><strong style=\"\"><em style=\"\">with lots of new subscribers </em></strong></p><p style=\"\"><strong style=\"\"><em style=\"\">and video views from a network of people just like you,</em></strong> <em style=\"\"></em></p><p style=\"\"><em style=\"\"><strong style=\"\">then this challenge is Perfect for you&quot; </strong></em></p><p style=\"\"><br style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">This course is designed for someone without much knowledge</strong> about computers and who has <strong style=\"\">never made a video on a computer before</strong>, right <strong style=\"\">up to advanced</strong> simple methods of producing<strong style=\"\"> videos you can sell and profit from</strong> or <strong style=\"\">make your own video courses for Udemy</strong>.</p><p style=\"\"> We start from where to get software for a brand new computer and then challenge action takers for an advanced training webinar.</p><p style=\"\">I show you everything that I use to make videos and <strong style=\"\">wherever possible I use free software</strong> programs or refer you to where you can get free programs, so that if you are just starting off your expenses can be kept to a minimum.</p><p style=\"\"><strong style=\"\">Video making for beginners</strong> doesn&#039;t have to be overly complicated to get a good response. In fact many of the videos that have gone on <strong style=\"\"></strong>to become viral videos with hundreds of thousands or even millions of views are raw<strong style=\"\"></strong> and do not have a lot of production or technical skills about them.</p><p style=\"\">The course is <strong style=\"\">a little over 2 hours of videos</strong> and also <strong style=\"\">includes valuable PDF handouts</strong> with <strong style=\"\">how to get free stuff </strong>and online tools to assist you in your video making.</p><p style=\"\">To add value to the course and so that students can interact with me in a webinar with more useful enhancements to your videos like intros and logo animations has been included for those that complete the course and take the challenge in the final video.</p><p style=\"\">If you want to <strong style=\"\">get traffic to your website</strong>, your store or any offers, making a video is the best way to start driving traffic that will last for a very long time. <strong style=\"\">Videos have longevity</strong> in marketing and that&#039;s why <strong style=\"\">your time invested in this course is so worthwhile</strong>.</p><p style=\"\">People love watching videos and it is proven that <strong style=\"\">video engages your audience much more than any other medium.</strong></p><p style=\"\">Making videos is an <strong style=\"\">essential part of any modern marketing strategy</strong> and is a skill you must learn to <strong style=\"\">become successful on the internet.</strong></p><p style=\"\">Many of you have skills that you <em style=\"\"><strong style=\"\">can teach others and by learning to making simple videos </strong></em>that engage your audience or teach them what you know or are passionate about and will be <strong style=\"\">a skill that will serve you well for life</strong>.</p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Video Making for Beginners and YouTube Social Networking", 
    "price": 0, 
    "instructors": "The Info Files", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436416_4cd4_4.jpg", 
    "course_url": "https://www.udemy.com/video-making-for-beginners-and-youtube-secrets-for-traffic/", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T11:02:00Z"
}