{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">----Introductory Price ONLY - Increasing to $297 Soon---</strong></p><p style=\"\"><strong style=\"\">Over $3 Million Dollars of Direct Sales from Our Videos Including Videos Personally Created or Managed via Outsourcing for 12x $100,000+ Products</strong></p><p style=\"\">Want to use Video Hacks resulting in $135,060 of sales? The art of video creation takes time but Video Hacks can be learned quickly even if you have no video creation experience. And video is a MUST if you are serious about selling your products online as it is a major driver of sales.</p><p style=\"\"><strong style=\"\">Guarantee: By the end of this course you'll be able to create videos for yourself that result in $1,000+ of product sales or sell video as a service for $1,000+.</strong></p><p style=\"\"><strong style=\"\">Who is the DigiStrats Team?</strong></p><p style=\"\">DigiStrats has been involved with 50+ product launches, 12 of which have grossed over $100,000. We have created videos that drive sales, outsourced video creation and taught students to create videos. Today video is the #1 drive of online product sales because it engages your audience leading them to make their buying decision right then and there.</p><p style=\"\">When strategizing the $135,060 launch, we carefully created each and every video in the sales funnel resulting in super high conversions and $10+ EPCs - meaning each human visitor was worth over $10 on average.</p><p style=\"\">In this 7-Day Course I'm going to teach you Video Hacks that take you from novice to creating engaging &amp; high-converting videos.</p><p style=\"\">We'll pull the cape off secret tactics that can be used to easily create videos without spending hours learning super complicated video softwares that only the pros know how to use. We're all about \"Video Hacks.\"</p><p style=\"\">You'll learn the following ninja video creation secrets:</p><p style=\"\">-How to be a <strong style=\"\">Video Strategist</strong> creating high-converting video sales scripts hitting all <strong style=\"\">4 Emotional Triggers</strong></p><p style=\"\">-How to use a dead simple tool that created a <strong style=\"\">$47,743 Video Campaign</strong></p><p style=\"\">-How to use <strong style=\"\">VideoMakerFX, Explaindio &amp; EasySketchPro</strong> done-for-you video templates for <strong style=\"\">explainer &amp; whiteboard vids</strong> that normally cost as much as $799 per minute</p><p style=\"\">-How we use <strong style=\"\">voiceovers from Fiverr</strong> for videos that generate <strong style=\"\">$56,245</strong></p><p style=\"\">We'll even walk you through building videos in <strong style=\"\">Animoto, Camtasia &amp; PowerPoint</strong> live during the course and by the end you'll even have completed your first video.</p><p style=\"\">Plus you'll get <strong style=\"\">3 Bonuses</strong>…</p><p style=\"\"><strong style=\"\">-Bonus #1:</strong> Our <strong style=\"\">10-Min Sales Scripts</strong> or Voiceovers \"Fill-in-the-Blank\" Template</p><p style=\"\"><strong style=\"\">-Bonus #2</strong>: Our <strong style=\"\">Top 4 Secret Resources for Done-for-You Video Assets</strong></p><p style=\"\"><strong style=\"\">-Bonus #3: </strong>Our <strong style=\"\">Video Sales Letter (VSL) Insta-Creator Tool</strong></p><p style=\"\"><strong style=\"\">The Better than Money Back Guarantee</strong></p><p style=\"\">We're giving you a double your money back guarantee. Take action, get in our Private Facebook mastermind and if you don't succeed I'm going to give you double the money out of my own pocket for investing your time into our course.</p><p style=\"\"><strong style=\"\">Special Introductory Price - Rising Soon</strong></p><p style=\"\">Even though we've done over $4 million in sales ($1 million+ in the past 4.5 months alone) and we normally charge $697 and $997 for our life changing courses, we will keep this introductory price before raising it as a special for the Udemy community.</p><p style=\"\"><strong style=\"\">Take Action &amp; Enroll</strong></p><p style=\"\">Enroll now, make the commitment and jump straight into the course right now. I know this course will revolutionize the way you do business and create videos.</p><p style=\"\">See you on the inside and check out the preview videos to see what value you'll be getting!</p><p style=\"\">Talk soon,</p><p style=\"\">Eric</p>", 
    "end_date": null, 
    "title": "Video Alchemy: Sales Video Creation Hacking", 
    "price": "40.00", 
    "instructors": "Digi Strats", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465038_c847_3.jpg", 
    "course_url": "https://www.udemy.com/video-alchemy-sales-video-creation-powerpoint-camtasia-animoto-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T14:49:10Z"
}