{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>Join us on a journey to online long term success!</em><br></strong></p><p><em><strong>* Updated on 14 November 2015 *</strong></em></p><p><em><strong>***Over 1330 Happy Students with more than 15 Reviews and 5 Star Ratings***</strong></em></p><p><strong>Did you know that already more than 55% of all the online traffic comes from video? Just imagine having the power to fully control such a massive traffic source! That would really skyrocket your business to a whole new level.</strong></p><p>The truth is that we all saw the transition to video marketing in the last couple of years but some of us also decided to implement video in their businesses and marketing, an amazing decision!</p><p>There are already tons of statistics out there that prove us the benefits of using video marketing and the fact that we will be left behind if we don't. We all see video online everywhere right now and it's almost like we are not willing to buy something anymore if we don't see a video promo or movie. <strong><em>Yes, it's a fact, your chances to sell your product increases with up to 64% when you have a video there on you sales page!</em></strong></p><p><strong>So, my proposal for you today is to enroll in this course right now and learn:</strong></p><ol><li><strong>What are the challenges that most marketers do when using video</strong></li><li><strong>How to avoid this mistakes to optimize results</strong></li><li><strong>What tips to implement to instantly get better results and maximize your revenue</strong></li><li><strong>How to approach with ease your video production for marketing videos</strong></li><li><strong>What simple principles to implement for a succcessful Video Marketing Strategy</strong></li></ol><p><em><strong>and Other Benefits</strong></em></p><ul><li><strong>Lifetime Access to all other updates!</strong></li><li><strong>Surprise Bonuses!</strong></li><li><strong>New Methods and Systems introduced in the course!</strong></li><li><strong>FULL Support through the discussion area of the course!</strong></li><li><strong>30 Day Money Back GUARANTEE if you feel this course didn't help you at all and you can't apply anything...that is how dedicated we are to your success!</strong></li></ul><p>All of this in less than 3 hour <strong>(out of your busy schedule) </strong>of simple to follow lectures that <strong>YOU CAN APPLY from TODAY in YOUR BUSINESS for BETTER RESULTS</strong>!</p><p><em><strong>Time to take action!</strong></em></p><p><em><br></em></p><p><em>To Your Massive Online Success,</em></p><p><em>Sorin Constantin</em></p>", 
    "end_date": null, 
    "title": "Video Marketing Hacking: How to Fire Up Your Online Presence", 
    "price": "20.00", 
    "instructors": "Sorin Constantin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626886_b59d_2.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-how-to-increase-sales-with-up-to-64/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T10:38:36Z"
}