{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tDieser Kurs ist für alle gemacht, die auch ganz einfach ein Video erstellen möchten. Die die Möglichkeiten kennen lernen möchten und welche Fehler unbedingt vermieden werden soll.  </p>  <p style=\"\">  \tEs gibt Videos mit Personen, es gibt animierte Videos, es gibt Videos nur mit Musik oder mit Musik und Stimme. Es gibt also eine ganze Reihe von Möglichkeiten seinen Inhalt mit einem Video darzustellen.  </p>  <p style=\"\">  \tOhne Video wird es in Zukunft im Internet nicht mehr gehen. Das Wissen in der Zwischenzeit alle. Aber gute und einfache Videos zu erstellen, ist leider gar nicht so einfach. Dieses Training hilft Ihnen, verschiedenste Möglichkeiten der Videoerstellung kennen zu lernen. So dass Sie in Zukunft selber ganz einfach Videos erstellen können und damit Ihr Internet Business vorantreiben können.  </p>  <p style=\"\">  \tEs geht dabei natürlich darum, wie der Inhalt eines Videos sein sollte, wie ein Video erstellt wird, wie es im Internet präsentiert wird, wie es am besten bei YouTube veröffentlicht wird, wie Sie den YouTube Traffic auf Ihre Webseite leiten und vieles mehr.  </p>  <p style=\"\">  \tDabei sind natürlich viele Tipps und Tricks, die Sie unbedingt beachten sollten. Wichtig bei Videos ist, dass sie ins Handeln kommen und ihr erstes Video erstellen bzw. ihre Videos optimieren.  </p>  <p style=\"\">  \tFreuen Sie sich darauf, dass es jetzt voran geht  </p>", 
    "end_date": null, 
    "title": "Video-Marketing - den Dreh kriegen", 
    "price": "50.00", 
    "instructors": "Henning Glaser", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278256_e8cf_3.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-online/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-10T17:27:50Z"
}