{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>This video creation course will teach you how to develop a targeted script and then create an effective video using videomaker FX</strong></p><p>This course is targeted at people who understand the power of online video marketing and want to create effective videos but are not confident in how they start and need a structure to work with. Whilst many people confirm benefit of using videos in their online marketing is hard to find a comprehensive course that takes you from identifying your target customer to creating a powerful video script and subsequently developing the video.</p><p><strong>Think like a master videomaker and develop a video aimed at your target customers</strong></p><ul><li>Understand who you are targeting and what problems concern them</li><li>Be certain about what you want to achieve</li><li>Learn a process to communicate with your target customers</li><li>Communicate in a way that turns your viewers into buyers</li></ul><p><strong>This course includes an entire section on how to develop videos in videomaker FX</strong></p><ul><li>Create a project</li><li>Understand the types of templates available</li><li>Select and organise slides</li><li>Add background and shapes</li><li>Insert and edit text</li><li>Add soundtrack or voice-over</li><li>Export your video</li></ul><p><br><strong>If you want to learn how to develop effective videos quickly then this is the course for you</strong></p><p>Enrolled today and start to create your first video quickly</p>", 
    "end_date": null, 
    "title": "Video Marketing : Make Effective Videos Fast", 
    "price": "20.00", 
    "instructors": "Alan Higginson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699142_1812_2.jpg", 
    "course_url": "https://www.udemy.com/video-marketing-make-effective-videos-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-16T15:04:20Z"
}