{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Welcome to <strong style=\"\">Webinars: How To Host a Profitable Webinar</strong> course which is one of our new series of <strong style=\"\">Kick-Starter Courses</strong> created to help you grow your business or help you make a great income from home.</p><p><strong style=\"\">Learn How To </strong><span><strong style=\"\">How To Host a Profitable Webinars.</strong></span></p><p><em style=\"\">Who else wants to know... How To Host a Profitable and High Converting Webinar to get Leads for their business and more sales?</em></p><p><em style=\"\"></em>Webinars can be a great way to get more leads and more sales for your business and if done right can be a tremdous suscess. </p><p>This course is designed to help you host a very profitable and high converting webinar giving your the tricks and trips you need to make a massive success from Webinars</p><p>If you&#039;re looking to improve your lifestyle, if you want to improve your business, if you want to make a better life for your family, <em style=\"\"><strong style=\"\">this course is definitely for you.</strong></em></p><p>Simply listen to the secrets of how ordinary people became successful in this exciting fact filled course.</p><p><strong style=\"\">No shortcuts, no &quot;get rich quick&quot; scams, no nonsense.</strong></p><p>Just simple, proven steps to wealth and success, easily, quickly and simply.</p><p><em style=\"\">Give yourself a fresh start by enrolling in this life-changing course now.</em></p><p><em style=\"\">Every moment you delay, you lose out. Simple as that.</em></p><p>We will be adding lots more new and up-to-date modules to this course as time goes by, new modules, new techniques, new strategies <em style=\"\"><strong style=\"\">AND </strong></em>the good news is, all the ongoing updates to this course are <strong style=\"\">FREE</strong>, always, for ever. So whatever you pay for this course <strong style=\"\">TODAY</strong>, you won&#039;t pay a penny more for all the great value we will add over time.</p><p><em style=\"\"><strong style=\"\">And there&#039;s a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really have nothing to lose and everything to Gain!</strong></em></p><p><em style=\"\"><strong style=\"\">Make sure you check out our other Kick-Starter courses and special student bonuses and discounts once you get started with this course.</strong></em></p>", 
    "end_date": null, 
    "title": "Webinars: How to host a Profitable Webinar", 
    "price": "20.00", 
    "instructors": "The Covert Formula", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564130_0444_3.jpg", 
    "course_url": "https://www.udemy.com/webinars-how-to-host-a-profitable-webinar/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T01:33:05Z"
}