{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tAnnouncing the Brand New,  Step-by-Step Video Course  <br style=\"\">  \tFinallyLearn How to Build High Converting Sales Webinars From Start to Finish… Starting today!  <br style=\"\">  \tIn this video series you will learn how to set up a webinar from start to finish using a step-by-step blueprint. We will cover all the processes that you need to complete to achieve this and create compelling webinars that will bring you sales when done correctly.  <br style=\"\">  \tHave you noticed that a lot of businesses and nonprofits have started using webinars to generate leads?  <br style=\"\">  \tIt is known that Webinars have a better conversion rate than most sales communication mediums simply because of the live social element and social proof.  <br style=\"\">  \tQuestions that could be potential objections can be answered in real time.  <br style=\"\">  \tAverage conversions can range from 10 to 35 percent or even higher.  <br style=\"\">  \tOf course automated webinars convert really well, too.  <br style=\"\">  \tBut numbers aside, webinars can do much more than just sell products and services. In fact, webinars can be used to build great relationships with customers and prospects...  <br style=\"\">  \t... Which often times is most overlooked.  <br style=\"\">  \tMost people make the mistake of thinking about making the sale first instead of gaining trust and providing value.  <br style=\"\">  \tNow, of course webinars can be used in many different ways depending on your ultimate business goals.  <br style=\"\">  \tSome webinars are purely educational, and some webinars are ultimately aimed at getting people through your business door.  <br style=\"\">  \tSo often times, not all webinars are created equal.  <br style=\"\">  \tNow the type of webinar that we will be aiming for is sales webinars, which are used to sell your product or get more leads.  <br style=\"\">  \tBut the ultimate goal is to convince your customers to engage and interact with you, which equals higher sales conversions.  <br style=\"\">  \tSo the big question is, how do you create high converting webinars that have high engagement that will yield higher sales conversions?  </p>", 
    "end_date": null, 
    "title": "Webinar Secrets: How I create high converting webinars", 
    "price": "20.00", 
    "instructors": "Fred Owen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359788_9aa6_3.jpg", 
    "course_url": "https://www.udemy.com/webinar-secrets-how-i-create-high-converting-webinars/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T15:59:24Z"
}