{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    I ran an email campaign to a tiny list of prospects and it resulted in 256 prequalified webinar sign-ups.  These customers were located all over the US, there is no way I would  have been able to visit them all and make a sales presentation.  Leveraging the power of a properly planned webinar I was able to do in  one month what many of my competitors won&#039;t accomplish this entire year!  </p>  <p style=\"\">  \tIn the last year THOUSANDS of people have bought training on how to setup, conduct, and succeed with Webinars, THOUSANDS!  </p>  <p style=\"\">  \t          There was just one critical element missing that everybody needed...  </p>  <p style=\"\">  \t        A<strong style=\"\"> &quot;WEBINAR GAME PLAN&quot; </strong>IN TEMPLATE FORM.  </p>  <p style=\"\">  \t          &quot;<em style=\"\"><strong style=\"\">Webinar Success Templates</strong></em>&quot; is a step-by-step set of time saving templates that you can print out and slap in a binder, that tells you what to do and when to do it. This is the missing link to Webinar success.  </p>  <p style=\"\">  \t        My name is Anthony Flatt and my friend Jerry Roberts and I have put together an awesome product called &quot;<em style=\"\"><strong style=\"\">Webinar Success Templates</strong></em>&quot;. In a nut shell &quot;Webinar Success Templates&quot; is a complete series of fill-in-the-blank- time saving templates, agendas, and checklists we use for hosting webinars.  </p>  <p style=\"\">  \t        The &quot;<em style=\"\"><strong style=\"\">Webinar Success Templates</strong></em>&quot; includes an eBook and Video training on how to use each of the more than 25 individual fill-in-the-blank templates, agendas, and checklist.  </p>  <p style=\"\">  \t    Webinars are one of the most powerful and cost-effective ways to quickly get your message across. They allow you to reach a large group of people all at once, ensuring your message reaches a maximum amount of people.  </p>  <p style=\"\">  \t    Webinars are great relationship builders. They allow the host to connect and interact live with their followers so there&#039;s no guessing at what topics to cover.  </p>  <p style=\"\">  \t    Webinars most importantly are a great way to have a large number of potential customers hear your sales message and take action to purchase your products and services.  </p>", 
    "end_date": null, 
    "title": "Webinar Success Templates", 
    "price": "45.00", 
    "instructors": "Anthony Flatt, Jerry Roberts", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386418_bc2d_3.jpg", 
    "course_url": "https://www.udemy.com/webinar-success-templates/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T06:21:37Z"
}