{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><em style=\"\">Deciding which camera to pick for your project is hard especially if you&#039;ve never purchased a camera before!</em></p><p style=\"\">There are so many hundreds (if not thousands) of cameras to choose from. How can one person possibly know all that you need to know to pick one? That&#039;s why I&#039;m here!</p><p style=\"\">I&#039;m going to share with you all of the knowledge you&#039;ll need to make these decisions because you need to be an informed consumer. Some instructors will just tell you to use camera x for everything, but that&#039;s just not appropriate. In many cases, camera x isn&#039;t the right choice, you should be using camera y. But if you don&#039;t know WHY camera x isn&#039;t right for you, then you won&#039;t be getting the professional look you&#039;re after. After taking the Camera Conundrum, you&#039;ll know why you&#039;re choosing the camera you need.</p><p style=\"\">Why waste all of your time looking for &#039;free&#039; resources on the &#039;net when you don&#039;t know the right questions to ask in the first place? Let me share my 6+ years of experience running the best DSLR video site on the planet and knowledge gained from interviewing over 50 industry experts and over 200 podcasts in this <strong style=\"\">3+ hour all video lecture course!</strong></p><p style=\"\"><strong style=\"\">Inside, we&#039;ll cover:</strong></p><ul style=\"\"><li style=\"\">Some basic camera knowledge and terminology - things like how aperture, and shutter speed impact the look and feel of your image</li><li style=\"\">A little history of why DSLRs became popular for creating video</li><li style=\"\">How the size of the sensor on your camera changes your video look</li><li style=\"\">What kinds of cameras you have to pick from in today&#039;s market</li><li style=\"\">Whether you should be shooting in 4k (and even what<span style=\"\"> 4k means)</span></li></ul><strong style=\"\">Why go thru all this? </strong><ol style=\"\"><li style=\"\">you want to save money by buying the right camera for your needs. </li><li style=\"\">knowledge is power and owning the right camera will save you time and energy</li><li style=\"\">you&#039;ll save time surfing thru hundreds of youtube videos that supposedly help you pick a camera when they only give you 5 minutes worth of info - which isn&#039;t enough for any beginner to understand WHY the camera is &quot;right&quot; for them.</li></ol><span style=\"\"></span><p style=\"\">Testimonials:</p><p style=\"\"><strong style=\"\">&quot;This course is an absolutely &#039;must see&#039;&quot; </strong>Wendy Predestin - Original Print Films</p><p style=\"\"><strong style=\"\">&quot;I would not hesitate to recommend this course to anyone considering a camera purchase for their next project.&quot; </strong>Nicholas Chase -- Nicholas Chase is a broadcast media, broadcast TV production and post-production systems design engineer and integration consultant</p><p style=\"\"><strong style=\"\">&quot;Fantastic! I really never 100% understood about sensor sizes and the difference it makes to your shots - but I do now! Brilliant!&quot; </strong>Mark Ramet - CEO Small Business Video</p><p style=\"\"><strong style=\"\">“It was fantastic! Incredibly thorough!&quot; </strong>Richard Botto CEO Stage 32</p><p style=\"\"><strong style=\"\">&quot;highly informative, interesting, and humorous approach&quot; </strong>William Holoday</p>", 
    "end_date": null, 
    "title": "Which video camera should you buy?", 
    "price": "50.00", 
    "instructors": "Mitch Aunger", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524696_140c_4.jpg", 
    "course_url": "https://www.udemy.com/the-camera-conundrum-which-video-camera-to-buy/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T01:18:47Z"
}