{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><p>This is the most comprehensive Web Video Production course to follow up with the  free overview. WIN &#039;EM OVER WITH WEB VIDEO PART 2: Stand Out and Move Up in  Search Engine Results with Effective Web Video (HOW TO PREVENT A RAIN OUT ON  YOUR FIELD OF DREAMS WITH WEB VIDEO):&nbsp; This is a beginner-friendly course  for busy professionals who want to learn how to create effective web video AND  boost their search engine optimization efforts. Students will learn the basics  of web video production and search engine  optimization. This course provides video, screen records, and sample files for  busy professionals who want the most essential information presented to them in  a manner that can be quickly and easily digested and applied in under a half  day (4 hours). After successful completion, students will learn video  production and SEO for Video basics.</p>    <p>The course instructor is Kamala Appel, aka  &quot;the key&quot; in KEA Productions. She has produced numerous  documentary-style web videos for small business owners and non-profit  organizations since 2002. Ms. Appel worked in Hollywood in licensing at  Universal Studios and Business Affairs at International Creative Management  (ICM) and in programming at the Sundance Film Festival. She is a graduate of  Yale University and where earned a BA in American Studies with a concentration  in Film Studies and USC&#039;s School of Cinema-Television, now Cinematic Arts,  where she earned her Master&#039;s degree. &nbsp;She is also a certified SEO  Practitioner.</p>    <p>&quot;What I love most about producing videos  for small business owners and nonprofits is the opportunity to work with  passionate professionals who are experts in their field. I feel very fortunate  to be able to use my skills as a visual storyteller to help others.  Unfortunately, I am not able to help every worthy business owner out there  because not everyone can afford to hire a professional like myself to produce a  video for them. &nbsp;That is why I decided to develop a course that could  empower more businesses, start ups, and nonprofits compete and share their  passion with the world.&quot;</p>    <p>Ms. Appel has been a faculty member at a  number of accredited offline colleges throughout the State of California.  &nbsp;As an experienced film and multimedia instructor, she takes into  consideration the three main learning styles: aural (listening- you can listen  to the modules), visual (you can watch the videos with images that will  hopefully stay with you), and kinetic (movement- you can exercise your kinetic  learning style by taking notes and doing the quizzes). In addition to the  modules or short training videos, there are samples and screen recordings * (Including  FinalCut Pro and After FX demos) for all three stages: pre-production or  planning, production or shooting, and post-production or editing; so that you  can follow along throughout the process. </p>    <p>To further your learning experience, there is  an interactive coaching program that complements the e-learning course and  supplementary materials. During the coaching calls we will delve more deeply  into the materials with scenarios and go over the quizzes. Questions can be  answered live and students can participate in interviews with other industry  experts. As someone who has purchased this Web Video  Production course, you get your first month&#039;s membership for free.</p>    <p>So if you are a busy professional and you  want to be able to have access to the information you need to take your  business or organization to the next level with web video and SEO for video basics, then this is the course for  you. If you want to positively persuade your target audience, your bottom line,  and boost your SEO efforts, then again, this course is for you. Again, this is  an accelerated course so that you can get through the materials in a manageable  way while trying to stay sane throughout your busy life.</p>    <p>Please note: The first several video modules  are free to allow you to preview the style. These opening videos give students  a chance to learn some history and the general philosophy that will influence  the core content. The &quot;meat&quot; of the course is only available to paid  subscribers who want to invest further in their online marketing efforts.</p>    <p>TEMPORARY PRICE CUT in honor of 49ers winning  season- sign up now and save over $100.&nbsp;</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Win Them Over with Web Video Part 2", 
    "price": "35.00", 
    "instructors": "Kamala Appel", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21037_f46f_6.jpg", 
    "course_url": "https://www.udemy.com/standout-and-move-up-with-effective-web-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-11T22:41:10Z"
}