{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Youtube Secrets Revealed!!!  Supercharge your YouTube experience! </strong></p><p><strong>Bootcamp to better YouTube Results!!!</strong><br></p><p><strong>Keywords are more important than ever before, in SEO and in YouTube Marketing.</strong></p><p><strong>Keywords </strong>are something many marketers struggle with, the <strong>importance</strong> of having good keywords makes a <strong>MASSIVE difference</strong>.</p><p>YouTube Creators often do not optimize their videos, this holds them back and they are often left wondering why videos are not showing up in <strong>high within search results</strong>. Search Engine Optimize (SEO) is important in all stages from <strong>video planning</strong>, video production to video metadata copy.  YouTube as with Google is a search Engine!  You have to do <strong>SEO for your YouTube videos</strong> as you would for a website.   If you want to get found in organic results then you need to optimize.  Keywords are the foundation for SEO.  This is why keywords are ever so important.</p><p><strong>Creating videos</strong> is hard work, but sometimes an even tougher job is the marketing of that content.  If you create <strong>great videos</strong> and there nobody sees them..... :(</p><p>This course is designed for anyone who wants to <strong>accelerate their marketing strategy</strong> to a new level.</p><p>In this course you will learn <strong>everything about Keywords</strong>.  Become more confident and <strong>efficient in your Keyword Research</strong>.  </p><p>Google is making it harder to get those <strong>elusive keywords!!! </strong> We list out some great ways to find keywords.</p><p>We also discuss the benefits of having a <strong>proper KEYWORD Strategy</strong></p><p><strong>We help internet marketers and video content producers with smart effective ways to become more successful.  </strong></p>", 
    "end_date": null, 
    "title": "YouTube Keywords Bootcamp Learn about YouTube Video SEO", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508866_8e09_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-seo-keywords-bootcamp-secrets-to-youtube-video-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-22T12:59:14Z"
}