{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Video Optimierung für YouTube und Google </strong></p><p><strong><em>So erzielen mit Ihren Videos Top10 Platzierungen und gewinnen massenweise neue Besucher und Kunden..</em>.</strong></p><p>Das YouTube, eine 100% Google Tochter, aktuell die zweitstärkste Suchmaschine der Welt ist brauche ich ihnen sicherlich nicht zu sagen. Ebensowenig wie, dass tausende Minuten Videomaterial pro Tag von deutschen Nutzern konsumiert werden, die hauptsächlich, wenn von den Spaßsuchenden abgesehen wird, auf der Suche nach nützlichen Erklärungen, Anleitungen und Wissen sind.</p><p>Und genau dies ist die Chance für Sie als Unternehmer(in) Sich und Ihre Dienstleistungen und Produkte an prominenter Stelle zu vermarkten.</p><p>Was ist einfacher als einem potentiellen Kunden, der nach einer Lösung für sein Problem ist, diese Lösung mit eigenen Anwendungen oder Angeboten zu demonstrieren?</p><p>In diesem Kurs werden Sie deshalb lernen, wie Sie sich sowohl bei YouTube als auch in der Videosuche von Google und - ich betone und - in der organischen Suche von google mit Ihren Videos präsentieren und damit fast zwangsweise neue Kunden gewinne werden.</p><p>Der Kurs ist in zwei, eigentlich in drei Teile untergliedert:</p><p>1.) Werden Sie Lernen wie Ihre Videos auf die erste Seite von Google und YouTube gelangt. Dafür Lernen Sie wie sie dieses optimal \"Onpage\" und \"Offage\" Optimieren.</p><p>2.) Werde ich Ihnen zeigen, wie Sie anständig Traffic bzw. Views über Google Adwords (YouTube Adwords) erhalten.</p><p>Beide, ich betone beide Methoden sind wichtig und notwendig wenn Sie mit YouTube und Videomarketing durchstarten wollen.</p><p>Lassen Sie sich also in einfachen Worten und immer, wie sie es von mir gewohnt sind, mit praktischen Beispielen anleiten Ihre Videos prominent bei Google und YouTube zu präsentieren.</p>", 
    "end_date": null, 
    "title": "YouTube SEO & Video SEO: So wird Ihr Video zur Nummer eins", 
    "price": "20.00", 
    "instructors": "Norbert Weber", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747656_b6d4_4.jpg", 
    "course_url": "https://www.udemy.com/youtube-video-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-31T08:48:58Z"
}