{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<span style=\" color:rgb(53, 53, 53);\"><strong style=\"\"></strong></span><strong style=\"\">YouTube Video Ranking Success:</strong> Hi and welcome to my YouTube Video Ranking Success course! Did you know YouTube is now the #2 search engine in the world to Google? This is why more and more businesses are putting up videos on YouTube hoping to get more clients! The problem is, most of these YouTube videos are not properly optimized for the search results and they wind up never being found by potential customers! Well, before you run off and pay a “video SEO specialist” hundreds of dollars – let me show you the secrets of getting you video ranked on the first page of YouTube!  </p>  <p style=\"\">  \t<p style=\"\">  \t\t<p style=\"\">  \t\t\t    Simply follow the steps in this course and you will be well on your way to having your company’s video ranked VERY high in the YouTube search results! How high you ask? In most cases, the techniques you’ll learn here in the YouTube Video Ranking Success course will help you get in the top 3 results in less than a month!  BUT it does depend on your search term. The tips and tricks in this course are meant for local businesses and niche markets who want to outrank their competition – some examples would be terms like: Tallahassee Plumber, Denver Cleaning Service or Raleigh Printing Company.  \t\t</p>  \t\t<p style=\"\">  \t\t\t<p style=\"\">  \t\t\t\t  Is this course going to help you get ranked for the term &quot;New York City Lawyer&quot; or &quot;Hollywood Video Production&quot; – umm, NO! But I don’t think any video SEO course can promise that!  BUT--if you have attainable keywords and you want to dominate your local competition – then take this course today!  \t\t\t</p>  \t\t\t<p style=\"\">  \t\t\t\t<p style=\"\">", 
    "end_date": null, 
    "title": "YouTube SEO Video Ranking Success", 
    "price": "20.00", 
    "instructors": "Mr. Michael-John Wolfe", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369802_26c6_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-video-ranking-success/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-14T06:40:06Z"
}