{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Over $3 Million Dollars of Direct Sales from Our Videos for our 12x $100,000+ Products Led Us to Create this YouTube Outro Funnel Package &amp; System</strong></p><p>Want to use YouTube Outros aka End Slates to drive product sales, email leads or YouTube subscriptions? The art of YouTube Outro Funnels is a MUST if you are serious about Video or have any assets on YouTube.</p><p><strong>Guarantee</strong>: By the end of this course you'll be able to drive sales, email leads &amp; subscriptions using YouTube traffic.</p><p><strong>Who is the DigiStrats Team?</strong></p><p>DigiStrats has been involved with 50+ product launches, 12 of which have grossed over $100,000. We have created multiple YouTube channels and have become funnel masters. Today YouTube is an immense source of traffic that cannot be ignored &amp; if you are misusing it you are leaving $1,000's on the table. </p><p><strong>Introducing YouTube Outro Funnel Alchemy</strong></p><p>Welcome to <strong>YouTube Outro Funnel Alchemy</strong> where we'll take you from A to Z and show you how to become a <strong>YouTube Funnel Expert </strong>utilizing our secret never before revealed YouTube strategies including:</p><ol><li>The <strong>YouTube Lead Machine</strong> that turns simple YouTube videos into email list builders</li><li>The <strong>YouTube Subscriptions &amp; Viral Social Media Traffic</strong> module so you can create a viral YouTube channel or direct your traffic to Facebook</li><li>The <strong>YouTube Sales Machine</strong> showing you how to turn viewers into buyers of your products</li></ol><p><strong>YouTube Outro Funnel Alchemy</strong> is absolutely required if you have any videos to help you boost your <strong>YouTube SEO</strong>, drive your viewers to your other video assets, increase engagement &amp; multiply your subscribers through the use of interactive YouTube annotations.</p><p>You'll activate all of your channels and new vids with a 20-second YouTube Outro that will funnel viewers to opt-in via squeeze pages for you to exponentially build a list of hungry leads or to your sales pages to drive profits with viral YouTube traffic on autopilot.</p><p>Plus we don't just give you the course but you'll get our <strong>Bonus YouTube Funnel Creator Tool</strong> that features:</p><ol><li>The power to <strong>Drag &amp; Drop Videos</strong> into the templates</li><li>Social media interactive icons including <strong>Facebook, Twitter &amp; YouTube \"Subscribe\" Buttons</strong></li><li><strong>Email Optin Buttons</strong> to build your email list</li><li>Ability to integrate <strong>Multiple Videos</strong> into your Outro Funnel</li></ol><p>Plus you'll get <strong>3 Bonuses</strong>…</p><p><strong>-Bonus #1</strong>: Our <strong>Proprietary YouTube Monetization &amp; Funnel Sales Script</strong> if you decide to capitalize on the opportunity to build funnels for other YouTube marketers</p><p><strong>-Bonus #2</strong>: Our <strong>3x Done-for-You Templates</strong> with slick graphics for increased sales &amp; opt-in funnel conversions</p><p><strong>-Bonus #3</strong>: Our <strong>YouTube Outro Funnel 5-Step Quick Start Videos</strong> to get setup in a couple of minutes</p><p><strong>The Better than Money Back Guarantee</strong></p><p>We're giving you a double your money back guarantee. Take action, get in our Private Facebook mastermind and if you don't succeed I'm going to give you double the money out of my own pocket for investing your time into our course.</p><p><strong>Special Introductory Price - Rising Soon</strong></p><p>Even though we've done over $4 million in sales ($1 million+ in the past 4.5 months alone) and we normally charge $697 and $997 for our life changing courses, we will keep this introductory price before raising it as a special for the Udemy community.</p><p><strong>Take Action &amp; Enroll</strong></p><p>Enroll now - make the commitment and jump straight into the course. I know this course will revolutionize the way you do video &amp; YouTube marketing.</p><p>See you on the inside and check out the preview videos to see what value you'll be getting!</p><p>Talk soon,</p><p>Eric</p>", 
    "end_date": null, 
    "title": "YouTube Outro Video Alchemy: YouTube Sales & Lead Machine", 
    "price": "50.00", 
    "instructors": "Digi Strats", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487558_4b90_2.jpg", 
    "course_url": "https://www.udemy.com/youtube-outro-funnel-video-alchemy-end-slate-tail-slate-end-screen/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T14:54:47Z"
}