{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li><em></em>Do you want to be ahead of the competition?</li></ul><ul><li>Do you want to be found on the second largest search engine in the world?</li></ul><ul><li>You <strong>need</strong> to be on youtube</li></ul><span></span><p><strong>Youtube has more than 1 billion users – some of them are YOUR potential customers and fans just waiting to connect with you.</strong></p><p>I don't want you to miss out on this massive opportunity so have created </p><p>'The Ultimate Youtube course for Beginners'</p><p>I'm here to walk you through the step by step process of creating your new youtube channel &amp; very first video.</p><p><strong>LEARN HOW TO </strong></p><p><strong>- CREATE &amp; OPTIMIZE A YOUTUBE CHANNEL</strong></p><p><strong>- FILM, EDIT AND PUBLISH  PROFESSIONAL VIDEOS </strong></p><p>And that's just the start.</p><p>You will also learn the quickest way to film and edit your first youtube video, how to create channel art for free, why you need a Google+ page, what is SEO, how to properly light your videos PLUS much more.</p><p><strong>My aim is to get you up and running on youtube in no time - but we don't rush through anything. Each lecture is packed full of tips to help you build your brand online and create a successful youtube channel.</strong></p><p>My name is Veena V - I have over a decade of experience working in the media industry as a presenter, producer and blogger. I've also racked up over <strong>100,000 views on youtube</strong> and will share with you all my presenting, filming and editing tips.</p><p><strong>This is a comprehensive and in depth course and by the end you will feel confident in front of a camera.</strong></p><p><em>This course is different to any other you have taken as I'm very honest and realistic. I can't promise you millions of views but I can promise you a youtube channel that will</em></p><ul><li><em>Build your brand</em></li><li><em>Increase revenue </em></li><li><em>Gain trust &amp; loyalty from customers</em></li><li><em>Establish you as an authority &amp; expert in your niche</em></li></ul><p><strong></strong></p><p><strong>2015 is the year of VIDEO so what are you waiting for?</strong></p><p><strong>YOU CAN DO IT</strong></p>", 
    "end_date": null, 
    "title": "Youtube for Beginners - Learn how to film, edit & optimize ", 
    "price": "50.00", 
    "instructors": "Veena V", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483026_c3fa_2.jpg", 
    "course_url": "https://www.udemy.com/youtube-course-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T09:00:16Z"
}