{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">YouTube 101 is a short but in-depth class taking you through the steps to record, upload and share your first YouTube video.  </p><p style=\"\">Online video is a powerful tool to share your message, market your business or product, or promote your cat. YouTube is the second most powerful search engine, and uploading video is just slightly technical.  Most teenagers were born with the ability to upload video, but many of the rest of us need a step-by-step guide.  This is that guide for the rest of us.</p><p style=\"\"><strong style=\"\">A YouTube Guide for the True Beginner.</strong></p><p style=\"\">The course is broken down into bite-size lectures where you can follow along creating your first video.  It is a collection of videos of me sharing how it works, then showing you on my computer screen, where you can follow along and create your first video.</p><ul style=\"\"><li>Create a YouTube Account and Channel</li><li>Record a video with your webcam or iPhone</li><li>Basic editing using YouTube&#039;s free software</li><li>Set the Title, Tags, Descriptions and Thumbnail</li><li>Share your video with your friends or the world</li></ul><p style=\"\">You should be able to complete this course, and upload / share your first video in a couple hours.</p><p style=\"\"><strong style=\"\">Why YouTube?</strong></p><p style=\"\">Video Content Marketing is a great tool for promoting your business or idea.  Think of it as a blog or podcast, but where they audience bonds with the speaker, not just the message. Online Video is great for coaches, small businesses, sales people and entrepreneurs - any profession where your personality is part of your product.</p><p style=\"\">If you want to leverage the power of online video for your marketing, idea promotion, or just want to join the online video revolution, this course will get you started.</p>", 
    "end_date": null, 
    "title": "YouTube 101: Create your first online video", 
    "price": "20.00", 
    "instructors": "Brighton West", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429212_f6d6_3.jpg", 
    "course_url": "https://www.udemy.com/create-your-first-youtube-video/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T17:37:28Z"
}