{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong style=\"\">CREATED FOR 2015</strong></p><p style=\"\"><strong style=\"\">These are the exact methods I use to add thousands of new subscribers to my lists every month as well as converting sales for a yearly 6 figure income. I do it primarily via video marketing and YouTube is my vessel of success!!!</strong></p><p style=\"\"><strong style=\"\">Follow step-for-step the methods in this course and I guarantee you will also reap huge rewards.</strong></p><p style=\"\">Welcome to the course! By investing in this course, you&#039;ve taken a bold step towards becoming financially independent and improving your future. You are going to learn how to drive massive traffic from YouTube to whatever it is you want to promote, including:</p> <ul style=\"\"> <li style=\"\">Affiliate Offers</li> <li style=\"\">CPA Offers</li> <li style=\"\">Offline Clients</li> <li style=\"\">Your Own Products for Sale</li> </ul> <p style=\"\">With the HUGE amount of Free Traffic on YouTube, you can make a ton of money in a very short amount of time. You can do this even if you&#039;ve never made a video before. You&#039;re going to learn how to be a successful video marketer in no time at all. By the end of this course, you&#039;re going to be a real pro at YouTube Marketing, and you&#039;ll be able to drive lots of traffic and make great money online.</p><p style=\"\"><strong style=\"\">WHAT DO YOU GET WITH THIS COURSE?</strong></p><p style=\"\">1. The Core Training: 21 Training Videos</p><p style=\"\">2. 17 More Ways to make money with YouTube: 19 Training Videos</p><p style=\"\">3. Making money offline with YouTube: 3 Training Videos</p><p style=\"\">4. How to rank on the 1st page in Google with YouTube videos: 8 Training Videos</p><p style=\"\">5. Creating videos for YouTube: 14 Training Videos</p><p style=\"\"><strong style=\"\">Content has always been king on the internet, </strong><strong style=\"\">and now video content is really the king.</strong></p><p style=\"\"><strong style=\"\"><strong style=\"\">Not only will you get step-by-step training on how to exactly generate 1,000&#039;s of view BUT more importantly hits to your website(s) or online sources. This is the only real way to generate FREE TRAFFIC that work consistently without the constant hassle of Google&#039;s ever changing rules.</strong></strong></p><p style=\"\">(I would like to give special thanks to Vik Chabra and Lucio Blanco who were instrumental in the research and technical support of this course.)</p>", 
    "end_date": null, 
    "title": "YouTube Marketing For Huge Traffic and Sales Conversions", 
    "price": "20.00", 
    "instructors": "Peter Lamelas", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513458_a2e5_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-marketing-for-huge-traffic-and-sales-conversions/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T06:57:02Z"
}