{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><strong class=\"redactor-inline-converted\">Ignite your profits</strong> - Turn Google into your marketing partner - with simple YouTube videos ... the most powerful marketing tool on the internet!</em></p><p><em>Do you want to know how people get those YouTube videos to <strong class=\"redactor-inline-converted\">JUMP OUT</strong> at you at the top of your most profitable Google searches? </em><em>This course shows you how to quickly and easily get your product videos to <strong class=\"redactor-inline-converted\">reach Page 1 of Google</strong> … <strong class=\"redactor-inline-converted\"><em>over night</em></strong><em><strong class=\"redactor-inline-converted\">! #</strong><strong class=\"redactor-inline-converted\">ChaChing! #IncreasedSales!</strong></em></em><br></p>\n\n\n\n<p><strong>&gt;Updated April 2016. Check out the newest lecture, available for FREE PREVIEW!&lt;</strong></p><p><em><strong class=\"redactor-inline-converted\">&gt;&gt;Nearly 9,000 students accelerating their success with this bestselling course&lt;&lt;</strong></em></p>\n\n\n\n<p><em>Many others have tried to impersonate this course, but Robert Scot IS Dr. YouTube, and there is no better Udemy course to get you killer sales from your YouTube videos.</em></p>\n\n<p>Warning - there is NO fluff in this course. While some instructors like to wax on about the weather and social issues, as well as ways to waste your money, Mr. Scot is straight to the point with detailed, actionable lectures that will help you drive new, highly targeted traffic and increased sales.</p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\"><em><em>Mr. Scot (aka Dr. YouTube) has pwned Google since 2008 - Learn how he's gotten his clients to Page 1 of Google with simple YouTube videos!</em></em><br></strong></em></p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\"><em><strong class=\"redactor-inline-converted\">The Guarantee: Follow this course and you WILL rank at the top of Google!</strong></em></strong></em></p>\n\n<p><em><strong class=\"redactor-inline-converted\"><em><strong class=\"redactor-inline-converted\"><em><em><em><em>-+--+- Constantly Updated and Enriched with New Lectures and Data <em>-+--+-</em></em></em></em></em></strong></em></strong></em></p>\n\n\n\n<p>  \t                                * * * * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * * * * * * *</p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; 91 FIVE-STAR REVIEWS CAN'T BE WRONG! &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Recent Reviews:</strong></p>\n\n\n\n<p>  \t<em><strong class=\"redactor-inline-converted\">\"The Best YouTube Optimization Course on Udemy!!</strong></em></p>\n\n\n\n<p><em><br></em></p>\n\n<ul><li><em><em><em>I've taken quite a few YouTube courses on Udemy. None others compare. Robert is to the point, with actionable, proven tips and techniques - taught in a NO BS manner. It has helped my Google rankings immensely.!!\"</em></em></em></li></ul>\n\n<p><br></p><p><em><strong class=\"redactor-inline-converted\">\"Wow!</strong></em><br></p>\n\n<ul><li><em>I had a video I was preparing for upload and followed the course instructions as I did. The video is at rank 8 on Google within 12 hours of uploading with no other work than what was outlined on the course. Great course, thank you!\"</em></li></ul>\n\n\n\n<p><em>* * * * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * * * * * * *</em> <br></p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">Did You Know?</strong> Studies show that it's a full <strong class=\"redactor-inline-converted\">50x easier</strong> to get Page 1 Google results for your YouTube video than for your website – for the same keyword search! What a find for those interested in social media marketing.  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                           And just think about how valuable, how engaging, that a product video, a service walk-through, or a select interview is for your brand…proven by the fact that MOST of you will never actually read this sentence even though it's underlined. Most people just skim this then watch the intro <strong class=\"redactor-inline-converted\">VIDEO</strong> above ;-)  </p>\n\n\n\n<p>  \t                                              * * * * * ** * * ** * * ** * * ** * * * * * ** * * ** * * ** * * * * *  </p>\n\n\n\n<p>  \t<em>Just listen to the results other students have gotten with this course:</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">  \t                                                                                                                                                                                                                                                                  Dr. Richard Feldhake </strong>had ZERO experience with Youtube, and couldn't even get his site ranked in Google….then he used my strategies to <strong class=\"redactor-inline-converted\">rank Page 1 of Google</strong><strong class=\"redactor-inline-converted\"> 11 hours after posting his first video</strong>. Literally, overnight!  \t  \t<strong class=\"redactor-inline-converted\">Mark Levy </strong>\"quit the internet … it was a waste of money,\" until he took this course. Within days, the YouTube videos about his business popped up on the top of Page 1 on Google.  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                  ----------------------------------------------------------------------  </p>\n\n\n\n<p>  \tThe Truth: YouTube marketing is the next generation of content marketing.  </p>\n\n\n\n<p>  \tIn this course I will teach you the <em>exact </em>methods that have:  </p>\n\n\n\n<ul>  \t<li>Ranked videos for companies in industries ranging from dentistry to jewelry to pool cleaning</li>  \t<li>Allowed individuals and businesses to generate thousands from these quick easy youtube videos</li>  \t<li>Gotten countless people to start from SCRATCH on YouTube</li>  \t<li>Generated my OWN income and lead-gen from youtube</li>  </ul>\n\n\n\n<p>  \t                                                                                                                ----------------------------------------------------------------------  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">This Course</strong> is an A-to-Z course detailing every element of the process to rank #1. Even if you've never uploaded a single video to YouTube, or never even heard the words “video marketing\" we will get you online and successful <em>fast.</em>  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">  \t                                                                                                                                                                                                                                                                  You Will Learn…</strong>  </p>\n\n\n\n<ul>  \t<li>Advanced keyword research techniques</li>  \t<li>Exactly how to create each video, down to picking the topic and what to say</li>  \t<li>How to optimize your videos to get Page 1 Google search results <em>literally </em>overnight</li>  \t<li>How to turn these videos and rankings into pure profit</li>  </ul>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Who This Course Is For:</strong>  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                           Doctors, lawyers, realtors, painters, landscapers, consultants, entrepreneurs … any business attempting to market a product or service online <strong class=\"redactor-inline-converted\">must</strong> take advantage now to get an edge on your competition, before they beat you to it!  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                              ----------------------------------------------------------------------  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Today, only about 25% of businesses that have a website use video marketing in their online campaigns</strong>. YouTube marketing is one of the best kept secrets in the in tire internet marketing world. But the word is starting to leak out, so you want to act fast.  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                           RIGHT NOW: You can currently rank overnight, but as YouTube grows this will not always be the case. YouTube has grown to 50 BILLION VIEWS per day…and it's still just getting started!  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                           This course gives you a clear, actionable process to get started NOW. So enroll today and let's start getting you some results. Become a social media marketing expert.  </p>\n\n\n\n<p>  \t                                                                                                                                                                                                                                                                           - Robert Scot  </p>", 
    "end_date": null, 
    "title": "YOUTUBE MasterClass: Use YouTube Rank #1 on Google OverNight", 
    "price": "30.00", 
    "instructors": "Robert Scot", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/265678_380d_36.jpg", 
    "course_url": "https://www.udemy.com/web-video-means-business-the-playbook/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-21T13:58:50Z"
}