{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em>Do you really want to make money from home?</em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><em>Are you looking for a passive income using youtube marketing?</em></strong></p>\n\n<p>If your answer is YES for any of the above questions, you are at the right place. In this course i am going to reveal my Youtube secret blueprint that can bring you a passive income using youtube marketing. You can easily make mony from either adsense, amazon, clickbank or any other affiliate marketing easily by simply following the system.</p>\n\n<p>Youtube commenting is one of the best ways to bring in instant laser targeted traffic and this course is going to provide you everything from A to Z to get you started with the Youtube commenting system.</p>\n\n<p><strong>-------------------------------------------------------------------------------<br>My Secret Youtube Commenting Money Making Blueprint</strong></p>\n\n<p><strong>+</strong></p>\n\n<p><strong>Tube PRO Commenting Software (100% FREE WITH THE COURSE) Worth $67<br>-------------------------------------------------------------------------------</strong></p>\n\n<p>I can 100% guarantee you that after completely watching all the lectures of the course and implementing the system, you will be an advanced youtube marketer.</p>\n\n<p>And the best part is it works for any kind of category or niche you are in. You can get started with this system even if you are a complete newbie, there is no specific requirements with the method.</p>\n\n<p>Enroll to the course today and get you complete youtube blueprint and Tube PRO Commenting Software today.</p>", 
    "end_date": null, 
    "title": "Youtube Marketing Mastery", 
    "price": "20.00", 
    "instructors": "Hema Chandiran", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/803450_cdbb_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-money-on-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-25T04:07:54Z"
}