{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>There are tons and tons of different marketing strategies out there online, but if you want to know how to get targeted video traffic - then video marketing is one of the easiest ways to get set up fast.</p><p>Video marketing is also one of the easiest ways to get highly targeted traffic, but you have to do it right. If you do it wrong and simply upload a video to YouTube in the hopes that it will get a ranked on YouTube and on Google then you won&#039;t be as effective.</p><p>Google owns YouTube, so one of the keys here is if you can get it ranked on YouTube, then that will likely help you improve your ranking on Google as well.</p><p>Before you create your video you might want to take this training course to understand how to properly embed the keyword phrases that will help your video rank better on the search engines by better optimizing it.</p><p>In order for a search engine, or in other words a robot to understand what your video is really about, it has to look at the words that are used and compare them to its database to figure out what your video is actually all about. </p><p>So that brings us to keyword research as well as LSI keyword research. </p><p>How do you find the right keywords? </p><p>Or more specifically, how do you find keywords that people are actually typing into Google? </p><p>Well the biggest mistake that you could make is to jump on a keyword that you think will work. However, in reality that specific keyword may not be getting traffic or worse it might be getting traffic but the people that are typing that in are looking for free stuff, so they&#039;re not really looking to take action or buy a product. </p><p>After you&#039;ve created your video and done the proper keyword research, then how do you get it uploaded to YouTube and begin increasing the rank against the other keyword phrases? </p><p>Truth be told you&#039;re not the only one out there who is trying to rank on a specific keyword phrase - there are other competitors. </p><p>That brings us to social signals. If you&#039;re not aware of what social signals are they are basically a measure that Google and YouTube looks at to see how many social backlinks you have. Or in other words, how many people are talking about you. </p><p>So the more targeted social backlinks you have that are real, the better. </p><p>And that&#039;s just the tip of the iceberg. </p><p>How would you like to learn how to do everything above and more?</p><p>In this specific video training course, you will get to watch over my shoulder – step-by-step, click by click – and learn how to take your video, find the right keywords, get your video onto YouTube, and most importantly get top page ranking in Google, which gets you massive targeted traffic and leads. </p><p><em style=\"\"></em>So grab this training course today and begin generating targeted video traffic for your products the right way. <em style=\"\"></em></p>", 
    "end_date": null, 
    "title": "YouTube & Google Traffic Secrets: How to Get 1000s of Views ", 
    "price": "45.00", 
    "instructors": "Fred Kang", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/547286_6e98_3.jpg", 
    "course_url": "https://www.udemy.com/dominate-youtube-the-ultimate-youtube-traffic-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T22:53:04Z"
}