{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">What does this course teach?</strong>  </p>  <p>  \t    This course focuses on using video as part of an overall marketing strategy. Specifically, this course teaches students how to use <em style=\"\">video content</em> to <em style=\"\">rank higher</em> in the major search engines for specific keyword pertinent to the businesses products and services.  </p>  <p>  \t<strong style=\"\">Why take this course? </strong>  </p>  <p>  \t    Consumer are consuming video content in record volumes and the trend is continuing to grow. Research shows that a higher ranking on Google, for example, can significantly increase traffic to a website. Research also shows that video content on a website can increase sales, foot traffic to stores, and reduce the number of product returns.  </p>  <p>  \t<strong style=\"\">Who should take this course? </strong>  </p>  <p>  \t    Small business owners and entrepreneurs will gain tremendous value from this course.  </p>  <p>  \t<strong style=\"\">What&#039;s the format of the course?</strong>  </p>  <p>  \t  The course is broken into seven modules with over 20 high-quality videos. The course also contain downloadable content to help implement what&#039;s taught in the class.  </p>  <p>  \t<strong style=\"\">Who teaches the course?</strong>  </p>  <p>  \t  The course is taught by Ron Desi. He has ten years of video, video content creation, and video marketing. He also has over over fifteen years of graduate level teaching experience and eight years of online teaching experience.  </p>", 
    "end_date": null, 
    "title": "YouTube Marketing: Rank in Google & YouTube", 
    "price": "20.00", 
    "instructors": "Ron Desi", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/279454_c50c_4.jpg", 
    "course_url": "https://www.udemy.com/using-video-to-rank-higher-in-google/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-12T14:34:11Z"
}