{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course, you’re going to be able to “look over my shoulder” as I show you the steps I take to get my YouTube videos ranked on the 1<sup>st</sup> page of Google.Not only will I show you <em>how</em> I achieve these results, I will <em>show</em> you proof of videos getting ranked while I get them ranked.</p><p><br>I will also show you proof of how it's possible to get multiple videos ranked on the 1st page of Google. When I say \"multiple\"  I mean when you type in a keyword phrase into Google and you see your videos ranked several times so that you have more chances of getting the click thru from the end user who is searching for your keyword phrase. Imagine taking up 1 to 5 of the first 10 spots on Google. <br></p><p>I like to profit from video rankings and I am sure you do as well. I will take you through the various ways I use video rankings to make money on the internet.</p><p>Don't worry if you don't know how to create a video,      I’ll show you how I do it and I’m definitely no video creation guru.</p><p>Not all keywords are created equal...     for those really competitive keyword phrases I will be sharing some advanced tactics I use to get the harder to rank videos onto the 1<sup>st</sup> page of Google.</p><p><strong>In this course on how to rank YouTube videos on Google, I will also be covering topics such as</strong>:</p><ul><li>Building your YouTube channel authority</li><li>How to create a YouTube playlist</li><li>Demonstration of software that makes instant videos rankings possible</li><li>SEO resources that I use for targeting tougher keyword phrases</li><li>The website that I use to find local niche marketing clients</li><li>100 local niche marketing ideas to get you started</li></ul><p>I have also included 20 scripts you can use for creating videos that will also come in handy if you are struggling with where to start and what niches would be profitable to go after.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "YouTube 1st Page Google Video Rankings", 
    "price": "45.00", 
    "instructors": "Greg Ryan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758780_9958_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-1st-page-google-video-rankings/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T19:23:23Z"
}