{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em><em>Nearly 12,000 Enrolled! Many go on to Enroll in my other courses!</em></em><em><em>!</em></em></p><p><strong>Did you know that video marketing - especially YouTube optimization - is your best chance at reaching the top of Google than ANY other marketing you can do to sell your product or get exposure for your website.</strong></p>  <p>  \t<strong>Learn about the Video Marketing Secrets</strong> from this INTRODUCTORY COURSE, which can easily help you turn simple videos into a <strong>life-changing cash-flow. </strong>  </p>  <p>  \t<strong>ANYBODY CAN DO IT on ANY SIZE BUDGET! </strong>No previous video experience required to become a video marketing expert.</p><p>  \t<em>_____________________</em>__________________________________________________________<strong>  \t</strong>  </p>      <p>  \t<em><strong><span></span>*** 75 FIVE-STAR reviews can't be wrong! ***</strong>  \t</em>  </p>  <p>  \t<em><strong>RECENT REVIEW:</strong></em>  </p>    \"<strong>Practical and inspirational  </strong>Excellent course with wonderful practical tips to get your videos right on the first spot on google. Great expert instructors. A course every business owner should take. Congratulations!\"    <p>  \t<em><strong></strong></em><em>_____________________</em>__________________________________________________________  </p>      <p>  \t<span></span>Take advantage of my experience, having achieved Page 1 Google search results for video marketing campaigns in a variety of completely different industries - doctors, lawyers, pool cleaners, videographers - with simple YouTube videos.  </p>  <p>  \t<strong>                  Get ahead of your competition by starting now,</strong> using simple YouTube videos to get your product or service (or someone else's) to the top of Google search results!  </p>  <p>  \t<strong><em>                                                Special Note: Enrollment includes a can't-miss DISCOUNT COUPON to the BLOCKBUSTER advanced course, \"</em>Use YouTube to Rank #1 Google Overnite: YouTube for Business\"!</strong>  </p>      <p>  \t<em>_____________________</em>__________________________________________________________  </p>    <p>  \t                                                                                                                                                                                          Find out what simple YouTube strategy took Scottsdale dentist, Dr. Richard Feldhake to the top of Google. Search for \"Scottsdale dentist sports injury\" - and there's Dr. Feldhake's Sports Injury video … at the top of Page 1.  </p>  <p>  \t                                                                                                                                                                                It's no fluke. And, by the time you finish this step-by-step course, you'll know why the strategy works!  \t<em>_____________________</em>__________________________________________________________  </p>  <p>  \t<strong>\"</strong>Use Video to sell any product online: YouTube for Business\" will introduce you to the basic building blocks of every successful video marketing campaign. Learn how to find the most profitable keywords and keyword phrases for your product or service - and <strong>WHY KEYWORDS MATTER</strong>.  </p>  <p>  \t                                                                                                                                                                                    The course serves as a perfect primer to <strong>\"</strong><strong>Use YouTube to Rank #1 Google Overnite: YouTube for Business</strong><strong>,\"</strong> also available on Udemy. When you enroll in this course, you receive a substantial DISCOUNT COUPON to upgrade to \"Use YouTube to Rank #1 Google Overnite: YouTube for Business.\"  </p>  <p>  \t                                                                                                                                                                                          The marriage of <strong>YouTube</strong> and <strong>Google</strong> created a unique and immense opportunity for small and medium-sized businesses! Doctors, lawyers, realtors, painters, landscapers … any business attempting to market a product or service online must take advantage now - or your competition will beat you to it.  </p>  <ul>  \t<li>YouTube is a world-wide phenomenon – with 5 BILLION views a day – and growing!</li>  \t<li>Study: It's 50x easier to get Page 1 Google results for your YouTube video than for your website – for the same keyword search!</li>  </ul>  Luckily, there's still time.  <p>  \t                                                                                                                                                                                          Want to learn the secret to getting your product or service to the top of Google - using simple YouTube videos? … And NO CHANCE of penalties or Google Time-Outs?  </p>    <p>  \t                                                                                                                                                                                          This course strikes at the heart of the Google/YouTube relationship, providing detailed instruction on why video works, what types of video fare best on Google, what to say in your videos - and when to say it!  </p>  <ul>  \t<li>You'll learn about Keywords, Scripting, video production and post-production, and how they all help in Search Engine Optimization.</li>  \t<li>Whether you're just starting out, or trying to breath new life into your video marketing campaign, Robert Scot guides you through the 9-part tutorial in plain language, and with clear descriptions of what to do next, and why.</li>  </ul>  <p>  \t                                                                                                                                                                                          When you see the results, you're going to wonder what took you so long to get started with video marketing, in general, and YouTube marketing, specifically!  </p>  <p>  \t                                                                                                                                                                                          Above and beyond Udemy's 30-Day Guarantee is my personal promise that you are about to purchase the most effective and most profitable YouTube marketing tutorial available on the market - with clear, actionable solutions to your web video concerns.  </p>  <p>  \t                                                                                                                                                                                          Full Disclosure: Robert Scot is NOT a doctor. He just plays one on YouTube. His nickname, Dr. YouTube is a moniker that stuck, as Robert talks clinically about YouTube 24 hours a day.  \t                                                                                                                                                                                          Neither Robert Scot nor this course are associated with YouTube or Google in any way. This course has not been endorsed nor recognized in any way with YouTube or Google, and is solely based on the experience of Robert Scot and his video marketing colleagues and affiliates.  </p>", 
    "end_date": null, 
    "title": "YOUTUBE 101 - Video Marketing for FREE: YouTube & Google SEO", 
    "price": "20.00", 
    "instructors": "Robert Scot", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/281692_daef_14.jpg", 
    "course_url": "https://www.udemy.com/youtubeforbusiness101/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-15T19:58:18Z"
}