{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Whether you're just starting out on Youtube,  an Internet marketer, entreprenuer or a business owner, this system will provide you the step by step instructions to create videos that will help you generate new leads and sales to your online or bricks and mortar business. </p><p>You will get access to a system that has been <em><strong>tested on over  26 businesses</strong></em> (anywhere from 100k - $100 million revenue) with great success. This is your formula for creating online videos to get the results you desire.</p><p>The core of the Social Video Blueprint course involves 3 \"powerful modules\": </p><ul><li><strong>Module 1 </strong>is all about planning your videos. You will learn how to write action driven scripts that will get you lead conversions as high as 80% and help you convert them into sales.</li><li><strong>Module 2</strong> will take you through on what video equipment you will need, how to set it up quickly and start recording so it saves you time.</li><li>And finally in <strong>Module 3 </strong>you will walk through step by step on how to get someone else to edit your videos. This will save you hours of headaches and you will have professional videos by the end of the process.</li></ul><p><br></p><p>Also I throw in a few extra bonuses because I believe it will help you generate results faster:</p><ul><li><strong>Bonus #1</strong> is the Youtube Income Series: Discover how to optimize your Youtube videos to rank on the top of searches to generate thousands of dollars and get over 45,301 views just from one video.</li><li><strong>Bonus #2</strong> is how to find camera operators that will film your videos for FREE. Inside this video you will learn where I find camera operators and how I offer something of value that allows them to record all my videos for free.</li><li><strong>Bonus #3</strong> Zero to a Million Views Youtube Case Study. Inside this interview with Burt Lao I find out how he got over a million views to his Youtube channel in less than 5 months.</li><li><strong>Bonus #4</strong> is the Online Video Process Map. This is the exact process I use with my virtual team to create videos. It will save you a lot of time and provides you a step by step blueprint for you to follow.</li></ul><p><br></p><p>I've designed a course based heavily on video-lectures and a great deal at-home exercises. <em>The lecture components are only a small part of this video course - you will be practicing various exercises and taking action steps to create your videos.</em> Each lesson should take no longer than 10 minutes to complete. It won't be easy - but if you put in the work, you are guaranteed to succeed. </p>Finally, there are additional resources included such as royalty free music and videos, templates, sample scripts, action step guides to save you time and money.", 
    "end_date": null, 
    "title": "Youtube Video Marketing Blueprint", 
    "price": "20.00", 
    "instructors": "Tyrone Shum", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628496_ed2a_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-video-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T02:47:00Z"
}