{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Are you interested in making money from youtube? Are you struggling to rank your videos in youtube search engines.</strong></p>\n\n<p>In this course, i am going to share my secret blueprint and Tube SEO PRO Software which can rank any youtube video very easily.</p>\n\n\n\n<p>You get the Tube SEO PRO software 100% FREE with the course. </p>\n\n\n\n<p>Youtube is one of the best traffic generation and money making platform, if you watch and implement the system that i explain in the course you can make a stable online passive income.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What We Are Going To Learn From This Course:</strong></p>\n\n\n\n<p>1. The easiest way to do a proper keyword research for youtube search engine. You will find super easy keywords to rank in youtube using this method.</p>\n\n\n\n<p>2. The best Youtube Onsite Optimization techniques and secrets.</p>\n\n\n\n<p>3. How to use the Tube SEO PRO Software and do a easy SEO Ranking Process.</p>\n\n\n\n<p>4. How to make a passive income from youtube marketing.</p>\n\n\n\n<p>I can guarantee, after watching the course you will completely understand how youtube marketing works and how to bring in a passive income from youtube.</p>\n\n\n\n<p>And the best part is, this system works for any category or product. You can use this system for any website.</p>\n\n\n\n<p><strong>Click \"Take This Course\" And Enroll To The Course Today.</strong></p>", 
    "end_date": null, 
    "title": "Youtube Secrets", 
    "price": "20.00", 
    "instructors": "Hema Chandiran", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/825290_d6f3_3.jpg", 
    "course_url": "https://www.udemy.com/ranking-youtube-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-18T18:30:23Z"
}