{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>YouTube Marketing</strong></p>\n\n<p>YouTube Video Marketing is an extremely powerful way to find new customers for your business!</p>\n\n<p>But how do you create a powerful YouTube Video?</p>\n\n<p>How can you create good quality video marketing?</p>\n\n<p>Learn From A Professional Online Marketing Company</p>\n\n<p>Everything we teach you is drawn from our vast commercial video production experience, so you are getting commercial quality training.</p>\n\n<p>We also show you how to create your promotional video on a very low budget!</p>\n\n<p><strong>YouTube Marketing Video Production For You?</strong></p>\n\n<ul><li>Do you need a guide on equipment and how to create a video on a budget from as little as £500 or $500 dollars?</li><li>Do you want to learn how to drive traffic to your business with that video?</li><li>Do you want to learn how to use YouTube to increase your audience?</li><li>Do you want to learn how to get your video found in YouTube and Google search using good SEO techniques?</li></ul>\n\n<p>----------------------------------------------------------</p>\n\n<p><strong><em>Fantastic and Informative Course</em></strong><strong><em></em></strong></p>\n\n<p><em>Mark has put together and delivered a fantastic course. He is clearly very knowledgeable in knowing how to create and market a YouTube video. The information is all useful and is delivered in a very clear, organized and easy to understand manner. Mark is very articulate and engaging. The course has the perfect blend of talking head and information/pictures on the screen. Highly recommend and can't wait to put the many tools I learned into practice. Thank you Mark.</em></p>\n\n<p><em>~ Tracy Goodwin</em></p>\n\n<p><em>----------------------------------------------------------</em></p>\n\n<p><strong>Who This Course Is For:</strong></p>\n\n<p>This course is designed to take someone completely new to the video production process and get you up and running as quickly as possible.</p>\n\n<p>So if you are a business and want to produce your own marketing videos in house, then this is designed for you.</p>\n\n<p>It is also suitable for Udemy instructors and online educators who want to learn how to film talking heads promotional videos for their courses.</p>\n\n<p><strong>Why You Should Take The Course:</strong></p>\n\n<p>It is concise, focuses on achieving great results on a low budget and getting you filming fast, it also helps you learn the core basics of YouTube video SEO and how to setup your YouTube channel.</p>\n\n<p>In this training course, we will take you through the whole process from start to finish.</p>\n\n<p><strong>You Will Learn How To:</strong></p>\n\n<ul><li>Plan and structure a marketing video</li><li>Figure out what type of video you need to create</li><li>Learn the basics of AIDA scripting techniques</li><li>What is the basic equipment you need</li><li>Set your equipment up and get filming</li><li>Identify the core simple editing techniques you need to learn</li><li>Set up your YouTube Channel</li><li>Optimise your videos for the greatest impact in search</li><li>Track what is working and not working in your video campaign</li></ul>\n\n<p><strong></strong><strong>Plan And Structure A Marketing Video:</strong></p>\n\n<p>When it comes to marketing your video, we help you take a step back and plan and explore your marketing strategy so that you can take advantage of the Golden Triangle of digital marketing and how an AIDA marketing funnel works.</p>\n\n<p>These are important elements for getting success and are time proven to work, so understanding this strategically will help you plan your video upon a sound marketing basis.</p>\n\n<p>We also discuss why building an email list for your marketing is important and how a YouTube video can drive this list.</p>\n\n<p><strong>What Type Of Video Do You Need To Create:</strong></p>\n\n<p>We will help you focus on your core audience and explain some of the things you need to think about to target a niche audience.</p>\n\n<p>You will explore what the video should look like, how long it should be and what it should do for the audience.</p>\n\n<p><strong>Aida Scripting:</strong></p>\n\n<p>There is a psychological flow that is a basic component of marketing that needs to be included in a scripting process, learning this will dramatically increase the engagement of your videos.</p>\n\n<p>You will learn how to create an AIDA marketing script that takes your potential client to a specific objective.</p>\n\n<p><strong>Basic Equipment On A Budget:</strong></p>\n\n<p>Creating videos on a budget has never been easier, but which equipment do you need to prioritise?</p>\n\n<p>We help you through that buying process showing you budget solutions that won't break the bank.</p>\n\n<p><strong>Setting your equipment up and filming techniques:</strong></p>\n\n<p>Getting your camera, lights and sound in the right positions is a key fundamental to video production success.</p>\n\n<p>We will guide you through the core basics you need to be able to get straight to filming.</p>\n\n<p><strong>Editing Techniques:</strong></p>\n\n<p>A lot of people find the idea of video editing daunting, in this training, we will share what the core basic skills you need for any editing software are. This means you will be able to use your video editing software of choice and quickly identify the key techniques and how to use them.</p>\n\n<p><strong>Setting Up Your Youtube Channel:</strong></p>\n\n<p>This does not need to be complicated and we give you some simple tips to get you started.</p>\n\n<p><strong>Youtube Video Seo:</strong></p>\n\n<p>Most peoples videos do not do well on YouTube because they do not know the basics of YouTube video SEO.</p>\n\n<p>The basic techniques will drive 90% of your success, so you will learn how to apply and use these in a no nonsense approach that will help you get results fast.</p>\n\n<p>You will also learn how to figure out which video content is working for you and what video content isn't.</p>\n\n<p><strong>Support:</strong></p>\n\n<p>Not only do you get access to the course, but you get our support on your video projects, we aim to answer all questions within 24 hours during normal business hours.</p>\n\n<p><strong>Join Us:</strong></p>\n\n<p>So join us on the other side and start your YouTube Video Marketing journey today!</p>", 
    "end_date": null, 
    "title": "YouTube - YouTube Video Marketing & SEO For Business", 
    "price": "30.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442142_2d25_6.jpg", 
    "course_url": "https://www.udemy.com/create-and-market-a-youtube-marketing-video-video-production-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T19:28:38Z"
}