{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is all about designing and animating YouTube Outros using PowerPoint 2016</p>\n\n<p><u><strong class=\"redactor-inline-converted\">Is this the right course for me?</strong> </u><br></p>\n\n<p>I designed this course for YouTubers, either a true beginner, who haven’t started a YouTube channel yet, or a more experienced YouTuber who wants to increase the views of his/her YouTube videos.  </p>\n\n\n\n\n\n<p>You’re someone who’s creative, interested in creating YouTube videos, and, most of all, you love to grow your audience.  So now that we’ve covered who you are, let’s get into what we’ll be covering in this course.</p>\n\n\n\n\n\n<p>This is <strong class=\"redactor-inline-converted\">a short</strong> and <strong class=\"redactor-inline-converted\">to the point</strong> course. It will be highly engaging and you won’t be bored at all.</p>\n\n\n\n\n\n<p>&gt; If you want to improve the watch time and number of views of your YouTube videos.</p>\n\n\n\n\n\n<p>&gt; If you want to grow your YouTube subscribers quickly</p>\n\n\n\n\n\n\n\n<p>&gt; If you want to funnel your YouTube traffic to your website or to sell your products</p>\n\n\n\n\n\n\n\n<p> Then this is the right course for you</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><u>What will you get from this course?</u></strong></p>\n\n\n\n\n\n<p>You will create 2 simple YouTube Outros and 3 awesome YouTube outros using Microsoft PowerPoint 2016. Not only that you will also learn to add these YouTube outros to your existing and new YouTube videos along with annotations</p>\n\n\n\n\n\n<p>PowerPoint is a very powerful and simple software; with which you can do much more than creating animated presentations or drawing cartoons</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><u>Why Me?</u></strong></p>\n\n\n\n\n\n<p>I have been creating countless mind-blowing PowerPoint presentations since my 8th grade. </p>\n\n\n\n\n\n\n\n<p> So What’re you waiting for, take this course now. I will meet you inside the course!</p>", 
    "end_date": null, 
    "title": "YouTube Marketing Secrets: Animated YouTube Outros Video", 
    "price": "50.00", 
    "instructors": "Arun Nagarathanam, Sharomena Aarthi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802782_3480_6.jpg", 
    "course_url": "https://www.udemy.com/youtube-outro-powerpoint-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T11:57:45Z"
}