{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  *** PRICE REDUCTION - SPECIAL OFFER NEXT FEW DAYS ONLY - COURSE ONLY $19 - START COURSE NOW ***  </p>  <p>  \tOnce finished this <strong>YouTube </strong><strong>Video Marketing Course</strong> students will be able to quickly and easily make a quality video that will help get leads for your business or sales of your online product. <strong>No filming is needed</strong> and it can all be done with free software or Microsoft Powerpoint if you already have it.  </p>  <p>  \t           The emphasis is on simplicity and speed and being able to do this task with very little technological skill. <br>  \t<br>  \t           This course is meant for students who:  </p>  <ul>  \t<li>Want to make a YouTube Video to sell their online product</li>  \t<li>Anyone who wants to use YouTube Videos for affiliate marketing<br>  \t</li>  \t<li>Operate their own business (of any size) who wish to get more sales leads</li>  \t<li>Who want to make a YouTube Video and learn how to advertise your business<br>  \t</li>  </ul>  <p>  \t          Students will be able to complete the course using only free, easy to use software and resources. The course shows where to download the free software and resources.<br>  \t<br>  \t<strong>Major Course Update 10 November 2014 - Video Template added</strong><br>  \t<br>  \t           I have now added a template that you can quickly and easily edit in order to make your own Internet marketing video. The template can be used in either OpenOffice Impress or Microsoft Powerpoint. Students who buy the course now will, of course, also receive the additional templates that are added later, without further charge.<br>  \t<br>  \t           Over 450 happy students have joined the course in less than three weeks - students have started leaving reviews - 10 students have given this course 5 Star ecstatic reviews.<br>  \t<br>  \t<strong>Course Update 6 November 2014 - added lecture &quot;How To Add Royalty Free Music To Your Video Legally&quot;</strong><br>  \t<br>  \t<strong>Course Update 23rd of October 2014 – added lecture &quot;Printing Your Story Board&quot;</strong><br>  \t<br>  \t           You will also be shown where to upload your sales videos so that you can advertise for free and how you can use the videos to take advantage of social media for business. Video adverts can also help you with your web advertising on your own website, if you have one.<br>  \t<br>  \t           Business owners who would benefit include one-person businesses to global companies. Online advertising for free is possible for all businesses now, even one person firms, and this course shows you how to create a promotional video to help you with your marketing strategies. Affiliate marketers will be able to quickly make videos to promote their affiliate offers.<br>  \t<br>  \t           To take this Video Marketing Course, students need to own a PC or Mac, and have a microphone if they wish to record their own voice to the video. Students may use background music instead, if they prefer not to use a microphone.<br>  \t<br>  \t<strong>     Go to the top right and click Take This Course now.  </strong>  </p>", 
    "end_date": null, 
    "title": "YouTube Video Marketing. Easily Make Videos That Make Sales.", 
    "price": "20.00", 
    "instructors": "John Higgins", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306344_5b3e_4.jpg", 
    "course_url": "https://www.udemy.com/online-advertising/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-23T19:35:48Z"
}