{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t         On January 24, 2013, I launched the Video Creators channel with 0 subscribers. Twelve months and 12 days later the channel crossed 10,000 subscribers.  </p>  <p>  \t         Today the channel is growing at twice that rate and continues to increase month over month! Why?  </p>  <p>  \t         Some of it is due to what you&#039;d expect: solid content, optimizing the videos to rank well in search results, engaging an audience, things like that.  </p>  <p>  \t         But there&#039;s so much more that I implemented behind the scenes that really contributed to the channel&#039;s growth, things that are mostly invisible to viewers.  </p>  <p>  \t<strong>This online course is about how Video Creators went from 0 to 10,000 subscribers in 12 months and how you can do it better!</strong>  </p>  <p>  \t         In this online course I share all my behind the scenes tactics so you can implement them and to see even better results than I did!  </p>  <p>  \t         These tactics aren&#039;t just good ideas that might theoretically work. These are tactics have proven themselves to grow my channel and the channels of many of my clients. They&#039;re tried, true, and tested. And best of all, none of them require spending a dime for promotion!  </p>  <p>  \t         Now I&#039;m sharing these tactics with you so your channel can grow more quickly and reach the people who need to hear the message you&#039;re spreading on YouTube.  </p>", 
    "end_date": null, 
    "title": "Zero to 10,000 YouTube Subscribers in 12 Months", 
    "price": "20.00", 
    "instructors": "Tim Schmoyer", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297926_28cc_3.jpg", 
    "course_url": "https://www.udemy.com/0-to-10000-youtube-subscribers-in-12-months/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-10T19:09:02Z"
}