{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t            Вы создаёте свой авторский канал на Youtube и хотите наполнить его качественным контентом быстро?  </p>  <p>  \t            У вас нет своей камеры или она такого качества, что стыдно показывать?  </p>  <p>  \t            Может вам необходимо красиво представить на видео  продукты  из Вашего интернет-магазина, а возможности (финансовой или по  времени)  снимать полноценное видео с оператором и консультантом нет?  </p>  <p>  \t            Или вы тот, кто любит собирать интересную информацию, но не любите показывать себя и свой голос другим?  </p>  <p>  \t            В любом случае этот практический видеокурс для Вас - он   поможет вам создавать уникальные авторские видео быстро и качественно.  </p>  <p>  \t            По-серьезному - вы посмотрите 1 урок и уже сможете   создавать уникальные авторские видео буквально за 15 минут. Никаких   проблем с копирайтами, высокое качество, высокая монетизация. Выполняйте   инструкцию и получайте быстрый результат: уникальное авторское видео   буквально за 15 минут.  </p>  <p>  \t            Остальные видео расскажут о том, как:  </p>  <ul>  \t<li>подготовить ресурсы, чтобы создавать видео в потоковом режиме</li>  \t<li>где найти исходные материалы (музыку, картинки, видео), если у вас нет своего и так, чтобы это было и качественно, и легально</li>  \t<li>как настроить текст, звук и прочие элементы вашего авторского видео</li>  </ul>  <p>  \t            Технология проверена на нескольких Youtube-каналах,  причем  видео создавалось как для личных нужд и теперь приносит  пассивный доход  в десятки и сотни евро ежемесячно, так и на заказ для  других каналов,  позволяя получить денежную отдачу быстро.  </p>  <p>  \t            Основы можно освоить за 30-40 минут, дополнительные  уроки  расширять ваш кругозор и навыки и потребуют ещё 40 минут. В итоге  за  полтора часа вы получите все необходимые знания, чтобы быстро и   качественно создавать видео: без камеры, без нарушения копирайтов,   абсолютно уникальное.  </p>  <p>  \t          Так же в комплекте идет файл с полезными ссылками, которые можно использовать при создании вашего видео.  </p>  <p>  \t        Создавая уникальные видео в потоковом режиме (т.е. очень   быстро и без потери качества) вы сможете тратить меньше времени на  достижение лучшего результата. Кому-то понравится заполнять собственный   Ютуб-канал, а кому-то будет интереснее продавать свои услуги другим.  </p>  <p>  \t        Навык создания видео сегодня - очень востребованный. И если  вы  сможете делать это быстрее других и с тем же, а то и лучшим  качеством,  будете востребованы как специалист всегда.  </p>  <p>  \t  This course language: Russian.  </p>  <p>  \t  Great for thouse who create Youtube channels with unique videos, want to create video for goods in the shop or to show some interesting information.  </p>  <p>  \t  You no need camera. You can speak or not to speak in the video - you will get, smooth video and without this things.  </p>  <p>  \t  You can watch just one video and get basic skills. But another videos will increase your expertise: how to work with a text, sound, where to get cool materials for videos.  </p>", 
    "end_date": null, 
    "title": "Создай уникальное авторское видео сам и без спец навыков", 
    "price": "50.00", 
    "instructors": "Yuriy Okunev", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/377050_36b7.jpg", 
    "course_url": "https://www.udemy.com/unique-videos-in-15-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-24T15:20:28Z"
}