{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">למד כיצד להכין סרטוני שיווק מעולים שיביאו לך לקוחות חדשים, בלי הוצאות יקרות על ציוד צילום ובלי הוצאות מיותרות על תוכנות עריכת וידאו מסובכות - רק באמצעות האייפון שלך.</strong>  </p>  <p style=\"\">  \t  חלק גדול מהעסקים הותיקים מגלים שהפעולות השיווקיות של פעם כבר לא עובדות יותר:  </p>  <p style=\"\">  \t  המחירים המיוחדים של ימי המכירות של פעם, הם המחירים הרגילים של היום.  </p>  <p style=\"\">  \t  הסוכנים נתקלים היום בהמון סוכנים מתחרים שרעבים יותר ומייצגים בעלי חברות שמוכנות להרוויח פחות  </p>  <p style=\"\">  \t  וברוב המקרים פרסום ברדיו או בעיתונות אפילו לא מכסה את עלות המודעה.  </p>  <p style=\"\">  \t<strong style=\"\">ברוך הבא לעולם הדיגטלי</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>העולם הופך לדיגיטאלי, אינטרנטי והוא מתקדם בקצב מהיר. יותר ויותר לקוחות מבצעים יותר ויותר שלבים מקדימים לרכישה במדיה דיגיטאלית. למעשה, חלקים נרחבים יותר ויותר מהתהליך המכירתי והשיווקי - מצד הלקוח - נעשים באינטרנט במכשירים ניידים שונים - מהטלפון החכם, מהטאבלט, וגם מהמחשב.  </p>  <p style=\"\">  \t  הטכנולוגיה שועטת קדימה בקצב. פעולות ופרוייקטים שפעם דרשו תקציבי עתק יכולים להתבצע בקלות על ידי ילדים בני שבע. התהליך הזה רלוונטי לתקשורת השיווקית שלך יותר מאי פעם. אם בגלל השינוי הקודם אנשים גילו שהם יכולים לפתוח חנות באינטרנט, ולחסוך בסיס עלויות עצום, היום, קל וזול יותר לשוחח, לתקשר ולהעביר מסרים שיווקיים, כמו גם להסביר מי אתה ומה היתרונות שלך - יותר מאי פעם.  </p>  <p style=\"\">  \t<strong style=\"\">שיווק באמצעות וידאו מאפשר לך להגיע ולפתוח ערוץ תקשורת ישירות עם הלקוח, בלי סוכנים, בלי מודעות בעיתון, בלי בולים, ובלי עלויות שיווק יקרות פשוט תקשורת ישירה ואיכותית ללקוח.</strong>  </p>  <p style=\"\">  \t  בעבר הפקה של סרטוני וידאו באיכות גבוהה דרשה ציוד צילום יקר וניסיון וידע בתחום הצילום ועריכת הוידאו.  </p>  <p style=\"\">  \t  למזלנו, היום אתה לא צריך מחשבים יקרים או מצלמות משוכללות על מנת לצלם ולערוך סרטוני וידאו איכותיים - אתה יכול לעשות את זה כל זה באמצעות מכשיר האייפון שלך.  </p>  <p style=\"\">  \t  בהתבסס על 13 שנים של ניסיון בצילום ועריכת וידאו מקצועיים, אני מזמין אותך לצפות וללמוד כיצד אני עורך את הסרטונים שאני מצלם רק באמצעות האייפון.  </p>  <p style=\"\">  \t  אני אראה לך את כל הטיפים והשיטות שאני משתמש בעבודה שלי כדי לגרום לצופים לצפות יותר זמן בסרטונים ולגרום להם להפוך בסופו של דבר ללקוחות מתעניינים.  </p>  <p style=\"\">  \t  סרטוני וידאו יכולים להשפיע על הרגשות של הצופים שלך ולהקל עלייך להפוך אותם ללקוחות משלמים. סרטוני וידאו כאלה נוצרים בעזרת שימוש בכלים מדויקים שהצלם והעורך משתמשים בהם. בקורס זה אני אסביר על חלק מהשיטות האלה כדי שאתה תוכל להטמיע אותם בסרטונים שלך.  </p>  <p style=\"\">  \t  בקורס הזה אתה תלמד:  </p>  <ul style=\"\">  \t<li style=\"\">כיצד לערוך את הסרטונים שלך</li>  \t<li style=\"\">כיצד להוסיף כתוביות</li>  \t<li style=\"\">איך להוסיף מעברים</li>  \t<li style=\"\">איך להוסיף מוזיקה לסרטון</li>  \t<li style=\"\">הוספת פילטרים ואפקטים</li>  \t<li style=\"\">הקלטה של סאונד ווידאו</li>  \t<li style=\"\">כיצד לבנות את הסרטון בצורה נכונה כדי להשפיע על הרגש של הצופה ולהשיג יותר לקוחות</li>  \t<li style=\"\">ועוד…</li>  </ul>  <p style=\"\">  \t  בסיום הקורס אתה תדע את כל מה שצריך על מנת להתחיל להכין סרטוני שיווק מקצועיים ויעילים.  </p>  <p style=\"\">  \t  לחץ עכשיו על הכפתור<br style=\"\">  \t<strong style=\"\">&quot;Strart Learning Now&quot;<br style=\"\">  \t</strong>ותתחיל ליצור סרטוני שיווק מדהימים לעסק שלך!  </p>  <p style=\"\">  \t  נתראה בקורס,<br style=\"\">  \t  אורי  </p>", 
    "end_date": null, 
    "title": "יצירת סרטוני שיווק לעסק בעזרת האייפון", 
    "price": "35.00", 
    "instructors": "אורי זוגלובק", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370048_b9c5_2.jpg", 
    "course_url": "https://www.udemy.com/professional-shooting-editing-video-on-the-iphone-basics-hebrew/", 
    "currency": "USD", 
    "subject_name": [
        "Video & Mobile Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-14T12:14:35Z"
}