{"selfpaced": false, "topic_name": ["Film & Theatre"], "description": "\n\n                    \n                    \n                    What you’ll achieve: \n\nIn this project-centered course*, you will design a series bible and write a complete pilot episode for your own unique television or web series, be it drama or comedy or something in between. You’ll learn to break down the creative process into components, and you’ll discover a structured process that allows you to produce a polished and pitch-ready script in just a few weeks. Completing this project will increase your confidence in your ideas and abilities, and you’ll feel prepared to pitch your first script and get started on your next. \n\nThis is a course designed to tap into your creativity and is based in \"Active Learning\". Most of the actual learning takes place within your own activities - that is, writing! You will learn by doing.\n\n\"Thank you so much for your direct way of teaching this course. It was encouraging for us all to creatively flow and find our own voice in writing and developing our scripts. This aspect was very important to me.\" Ingrid\n\nThe course curriculum is simple: you’ll write, revise your work, and share feedback with your peers. \n\nI am a proponent of Experiential Learning (active learning). My lectures are short (sometimes just two minutes long) and to the point, designed in a step-by-step process essential to your success as a script writer. I will guide you but I won’t \"show\" you how to write. I firmly believe that the only way to become a writer is to write, write, write.\n\n“David's lecture style for this course is inspired. The videos are succinct and engaging. When I watch the lectures I feel David’s sincere desire for me to create something truly amazing. He is teaching us how to write a script, and he is providing wisdom and tools that will help us do so in a compelling way - by writing; not by watching him talk at us.” - A R Adamson\n\nWhat you’ll need to get started:\n\nTo begin with, any basic word processor will do. During week two, you can choose to download some free scriptwriting software such as Celtx or Trelby or you may choose to purchase Final Draft, or you can continue to use your word processor and do your own script formatting.\n\nLearner Review: \"I am in love with this course. Having never written a script before, or any substantive fiction since college (15 years ago) I had a small idea in my head that has now exploded into something I really believe in. David's guidance is spot on, he's his own compelling story teller, he gives you enough, and then you have to figure it out, make it happen, WRITE! WRITE! WRITE! \"\n\n*About Project-Centered Courses: This is a ‘project-centered course’, which means it is designed specifically to help you complete a personally meaningful real-world project, with your instructor and a community of learners with similar goals providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share. \n\nTime: 1-2 hours of study,  30+ hours of active project work\n\n                                            Syllabus\n                        Develop your TV series conceptIn Module 1 you will: 1. create a  brief outline of your pilot episode, 2.  revise your outline following peer review, 3. create a bible for the series: that is, you will develop your original idea for a series into a document that defines the concept, the major characters and brief descriptions of the episodes for season one.Write Act One of your pilot episodeIn Module 2 you will complete the 1st act of your episode (or the 1st installment of your Web Series) You will: 1. create a brief outline of your pilot episode. 2. revise your episode outline following peer review, 3. create a detailed outline of your first act, 4. revise your Act One outline following peer review, 5. write your first act in screenplay format, 6. revise your Act One script after peer review. Write Act TwoIn this module you will complete the second act of your episode (or the 2nd installment of your Web Series). \n\nYou will: 1. write a detailed outline of the second act, 2. revise your outline following peer review, 3. write the second act in screenplay format, 4. revise your second act following peer review.Act ThreeIn module 4 you will complete the 3rd act of your episode (or the third installment of your Web Series). You will: 1. write a detailed outline of Act Three, 2. revise your outline following peer review, 3. Write Act Three in screenplay format, 4. Revise your act following peer review\nPolish your script, create a Cold Open and finish the Season One BibleIn Module 5 you will 1. polish the completed script of your episode (or your three Webisodes), 2. create a Cold Open, 3. revise the Series Bible based on your finished script, 4 submit the Final Script and Series Bible for final review. The top 10 highest reviewed projects will be personally reviewed by well regarded professional writers and individual feedback will be provided.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Script Writing: Write a Pilot Episode for a TV or Web Series (Project-Centered Course)", "price": 0, "instructors": "David Wheeler", "institution_name": ["Michigan State University"], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://www.coursera.org/learn/script-writing", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}