{"selfpaced": false, "topic_name": ["Film & Theatre"], "description": "\n\n                    \n                    \n                    Are you interested in the mechanics of current fiction formats? Do you want to know how stories are told? Do you want to analyze, understand, contextualize and create stories and narratives? Then join our MOOC and share our passion for storytelling!\r\nWhat to Expect\r\nTogether with a whole network of media researchers, creators and students we will:- learn storytelling basics such as antagonist/protagonist relationships, narrative/narrated time, ...- have a look at exciting current media projects- analyze how they are designed and executed based on aforementioned basics- and discuss how (and if) new online tools and formats change the way stories are told and perceived.\r\nThe 8-chapter course starts on October 25th, 2013 and ends on December 20th, 2013.\r\n(Please review the updated FAQ below in case you have questions.)\r\nIt offers weekly video material, lessons, interviews and tasks on the following topics (not necessarily in this order):- storytelling basics- serial formats (on the TV, web and beyond)- storytelling in role-playing games- interactive storytelling in video games- transmedia storytelling- alternate-reality gaming- augmented reality and location-based storytelling- the role of tools, interfaces and information architectures in current storytelling.\r\nOur first Storytelling-MOOC will focus on fictional formats.\r\nInspire and Help Understand\r\nOur goal is to inspire and help understand. To broaden our horizon of what is and might be possible and what has already been attempted, and what has succeeded or even failed - and why.In several little tasks you'll analyze and practice storytelling on your own and in teams.\r\nWhy this MOOC is Interdisciplinary\r\nBased at the Design Department at the University of Applied Sciences Potsdam, this MOOC is not only interdisciplinary, but also includes guest lectures and project presentations by game designers, writers, transmedia producers, TV makers, executives and theorists from many different fields of study. We will thus be able to discuss content, structures and technologies from various perspectives.\r\nLearning Outcomes\r\nOur MOOC will help you answer the following questions:1. How do fictional stories work? Which structures and mechanics are used?2. How do new technologies influence the ways stories are told and perceived - and which new media formats have been developed during the last years?3. How can technologies, interfaces and visuals engage an audience fast and continuously?4. How can I develop and implement my own story-ideas - on my own or in teams?\r\nPrior Knowledge\r\nNo prior knowledge of storytelling mechanics is needed, but can be helpful.Interest in creative processes and new technologies is welcome and encouraged.- You don't know what an alternate-reality game, RPG or transmedia storytelling is? - Great, you'll learn it here.- You are a storytelling professional? - Great, we hope to inspire you. Please feel free to help us inspire others by sharing interesting links, events and projects on our Facebook page.\n\n                                    ", "end_date": "2013-12-20T00:00:00Z", "title": "The Future Of Storytelling", "price": 0, "instructors": "Julian van Dieken, Winfried Gerling, Constanze Langer and Christina Maria Schollerer", "institution_name": [], "commitment": "", "subject_name": ["Art & Design"], "course_url": "https://iversity.org/courses/the-future-of-storytelling", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2013-10-25T00:00:00Z"}