{"selfpaced": false, "topic_name": ["Artificial Intelligence"], "description": "\n\n                    \n                    \n                    Want to learn the basics of large-scale data processing? Need to make predictive models but don’t know the right tools? This course will introduce you to open source tools you can use for parallel, distributed and scalable machine learning.  After completing this course’s hands-on projects with KNIME and Spark, you will be able to train, evaluate, and validate basic predictive models. You will be able to describe and apply common clustering techniques and classification algorithms.\n\n                                            Syllabus\n                        Machine Learning FoundationsWelcome to the Machine learning for Big Data course, and specifically the Machine Learning module.  This week, we’re going to look for insights in large data by utilizing Big Data Mining and Machine Learning techniques.Classification Tools and TechniquesClassification is a supervised machine learning technique used to predict group membership for data instances.  This type of learning assumes that a training data set of labeled observations is available for the training of the algorithm.  Classification learning algorithm’s goal is to identify/predict which of a set of categories/classes a new observation belongs.  In this module we will examine two different Classification approaches - Naive Bayes and Decision Trees Learning.Associaton Rule LearningAssociation rule learning is a method for discovering interesting relations between variables in large data sets.  Often called Market Basket Analysis,  association rules are employed today in many application areas including  promotional pricing, product placement, Web usage mining, intrusion detection and bioinformatics.Clustering AnalysisClustering is a machine learning technique used to cluster observations into related groups without any prior knowledge of those relationships or advance knowledge of the group definitions.  The k-means algorithm is one of the simplest and most popular clustering techniques that is commonly used in many applications.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Machine Learning With Big Data", "price": 0, "instructors": "Paul Rodriguez, Natasha Balac and Andrea Zonca", "institution_name": ["University of California, San Diego "], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/big-data-machine-learning", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}