{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><em style=\"\">----------Review from a previous Udemy course----------------</em></p><p style=\"\"><em style=\"\">Excellent Course with Superb Instructor - Thank you for making this great course as well as for all the personalized feedback...It&#039;s greatly appreciated-- jonathan chapman</em></p><p style=\"\">--------------------------------------------------------------------------</p><p style=\"\"><strong style=\"\">Why You Need These WordPress Plugins Now!</strong><strong style=\"\">Plus, how to get the plugins installed and set up today!</strong><em style=\"\"></em></p><p style=\"\"><em style=\"\">(Special Limited Time Bonus Just Added - see below)</em></p><p style=\"\"><strong style=\"\">Do you really need these 27 plugins?</strong></p><p style=\"\"><strong style=\"\"></strong>YES!</p><p style=\"\">Sure. There may have been a time when some of these plugins didn&#039;t matter. </p><p style=\"\">But now, without these plugins, your WordPress site is at a huge disadvantage.</p><p style=\"\">Your website is an asset in your business. Maybe it&#039;s the most important asset. It&#039;s the place where people decide to do business with you (or not).</p><p style=\"\"><strong style=\"\">&gt;&gt;</strong>Can you afford to have your site blacklisted by Google because it was hacked?</p><p style=\"\"><strong style=\"\">&gt;&gt;</strong>Are you getting all the traffic from search engines you should be?</p><p style=\"\"><strong style=\"\">&gt;&gt;</strong>Struggling to find quality images to use on your site? (images are huge in today&#039;s social sharing world!)</p><p style=\"\"><strong style=\"\">&gt;&gt;</strong>Have you ever done without a key feature or “worked around&quot; some issue just because you don&#039;t have time to deal with it (or to hire someone to deal with it)?</p><p style=\"\">Well, you are not alone.</p><p style=\"\">In fact, millions of businesses using WordPress work at a disadvantage because they are exposed to one or all of these issues. </p><p style=\"\"><strong style=\"\"></strong>But it does not have to be that way.<strong style=\"\"></strong></p><p style=\"\">With these 27 plugins, you can rise above the rest of these businesses.</p><p style=\"\"><strong style=\"\">Introducing “The 27 Best Free WordPress Plugins for Business &amp; Entrepreneurs&quot;</strong></p><p style=\"\"><strong style=\"\"></strong>If you are worried that your WordPress site is not as professional as it could be…</p><p style=\"\">Then I want to help you!</p><p style=\"\">I will show you everything you need to start benefiting from these crucial plugins!</p><p style=\"\">And, you should know: this is not some “theory&quot; course or a “here&#039;s the list - now you go and figure it out&quot; course…</p><p style=\"\">No.</p><p style=\"\">Every lecture goes into detail about the plugin including how to find it (some of these are rather unknown plugins!), how to install it, and exactly what settings to use.</p><p style=\"\">In fact, you will get the most out of this course if you login to WordPress and follow along with me! In four hours, you will have every plugin installed and configured. </p><p style=\"\"><strong style=\"\">&gt;&gt;</strong>Want to add an email newsletter opt in form to your site? No problem, I&#039;ll show you the plugin to use and how to set it up.</p><p style=\"\"><strong style=\"\">&gt;&gt;</strong>Need a hand writing blog posts that get search engine traffic? Great! I&#039;ll show you a plugin that helps you write posts search engines love!</p><p style=\"\"><strong style=\"\">&gt;&gt;</strong>Wish you had better images for your blog? No problem! I&#039;m going to show you a plugin that works like magic to find high-quality FREE images you can use - and the best part is you won&#039;t even have to format the images or any of that technical stuff!</p><p style=\"\">And that is just part of what I&#039;ll be showing you in this course. </p><p style=\"\">Now, </p><p style=\"\"><strong style=\"\">Meet the Expert Who Will Help Find, Install and Set Up These Plugins</strong></p><p style=\"\">My name is Jim Shirley and I run a web design firm called Resultspress.</p><p style=\"\">Over the last decade, I have personally put together well over 100 websites for my clients and for my own use. </p><p style=\"\">I&#039;ve taught hundreds of freelancers and entrepreneurs how to build their own websites with WordPress. </p><p style=\"\">I work with a major multi-national media company and I consult with small “mom and pop&quot; businesses alike to show them ways to squeeze the most profit from their WordPress websites.</p><p style=\"\">One of my favorite things is putting together hands-on training videos. I have a knack for taking something technical and making it simple and easy to do.</p><p style=\"\">————————————-<strong style=\"\">Reviews From Previous Courses</strong>:——————<em style=\"\"></em></p><p style=\"\"><em style=\"\">“Excellent Course with Superb Instructor&quot;--jonathan chapman</em></p><p style=\"\"><em style=\"\">“Splendid course&quot;--Giles Ensor</em></p><p style=\"\"><em style=\"\">“Great info!!!&quot;--Rune Flækøy</em>——————————————————————————————————————————</p><p style=\"\"><strong style=\"\">Step-By-Step Lectures In A Language You Can Understand</strong></p><p style=\"\">Worried that this course will move too fast or be filled with technical jargon? </p><p style=\"\">Let me put your worries to rest. Every lecture is delivered in a non-technical, friendly manner. </p><p style=\"\">I walk you through every step - from finding the plugin, to installing it, to setting it up. We follow the same process in every video. Plus I take a few moments to show you “why&quot; we set things up the way we do. So that way you know exactly what each plugin does to help your business.</p><p style=\"\"><strong style=\"\">35+ Lectures Lasting 4+ Hours</strong></p><p style=\"\"><strong style=\"\"></strong>The course presently has 35 lectures lasting a total time of about 4 hours and 15 minutes. That will change, I am notorious for adding more to my courses and keeping students up to date with the best information.</p><p style=\"\">I&#039;ve also included lectures showing you how to find, keep, and delete plugins so you have every instruction you need to be a WordPress plugin expert.</p><p style=\"\"><strong style=\"\">Money Back Guarantee</strong></p><p style=\"\"><strong style=\"\"></strong>I guarantee you will be happy with this course and the results you get from it. You have a full 30 days to go through the lectures. Install the plugins. Follow along as I show you how to set them up. </p><p style=\"\">See how you like them. </p><p style=\"\">And if for any reason you are not happy with the course - simply ask for your money back. </p><p style=\"\"><strong style=\"\">Watch the Free Previews</strong></p><p style=\"\"><strong style=\"\"></strong>You have read this far - and I appreciate that. Now, why not watch the free previews below? </p><p style=\"\">Certain lectures have a &#039;Preview&#039; button next to them - you can watch them free and without having to enroll.</p><p style=\"\">And if you like what you see, then go ahead and click the blue button at the top of this page that says Take This Course and enroll today.</p><p style=\"\">I look forward to seeing you in class.</p><p style=\"\"><strong style=\"\">SPECIAL BONUS</strong></p><p style=\"\">Enroll now and get my Make Money Online: Build Your Own Information Products course for only $5 (90% off!). This is a limited time offer. </p>", 
    "end_date": null, 
    "title": "27 Best Free WordPress Plugins For Business & Entrepreneurs ", 
    "price": "20.00", 
    "instructors": "Jim Shirley", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542462_1e94_2.jpg", 
    "course_url": "https://www.udemy.com/27-best-free-wordpress-plugins-for-business-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T18:52:58Z"
}