{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course is intended for those of you who want an effective website that helps grow your business. Through videos and worksheets, you’ll learn how to dissect your business so that you clearly understand what you have to offer and why people should do business with you and not someone else.</p><p>There are many inexpensive and useful web design tools for do it yourselfers. They offer attractive templates to give you a visually pleasing starting point for your website. The templates provide basic page structures and layouts. Most of the templates can be modified to conform more closely to your business.</p><p>But, here is the real caveat. They don’t tell you what things about your business should be included in the design. Things like:</p><ul><li>How the products you offer help your customers with their needs and problems.</li><li>Properly identifying your real customers so you don’t waste energy on capturing folks who really aren’t a good target for your business.</li><li>Knowing who you are competing with so you can present compelling arguments for your business in a proactive manner.</li><li>Understanding why choosing you is a better choice than others who offer competing products or services.</li></ul><p>In the end you will be well informed about the real reasons a website can help your business succeed and why doing this preparatory work will pay great dividends as you actually construct your website.</p><p>As you move through the course you will be asked to undertake exercises that directly relate to the course material just covered. If you follow this regime, you will have useful input for your website construction as you complete the course.</p><p>There are no shortcuts to good design. At some point in time you will need to know this information if you expect your website to positively affect the success of your business.  Why not do it now and start out with the best possible website.<br></p><p>The website tool builder suppliers tell you it is easy to build a website. Yes, it is if you don’t care about how the website actually presents your business to your potential customers.</p><p>If you do care then the task is much more challenging and this course is designed to help you meet that challenge.</p><p>Plan to spend about 3 hours learning and doing.</p>", 
    "end_date": null, 
    "title": "5 Steps to a Better Website", 
    "price": "20.00", 
    "instructors": "Terry Fitzgerald", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450264_50f6_2.jpg", 
    "course_url": "https://www.udemy.com/5-steps-to-a-better-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T12:58:12Z"
}