{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Web design can often be taught in a way that doesn't engage the student, it's often the case that the student is following along building a website that they have no interest in, and although they want to learn, they find it difficult to find motivation knowing the end result is going to be something they're likely to forget all about and never try to improve on. It was apparent to me that there needed to be a project that has a twist, an exciting outcome, a potential for prosperity and student improvement and that's how I came to write this course on how to make money at the same time.</p><p>By following this project you will learn the fundamentals of Web Design, skills that are constantly improved throughout the course and skills that you can reproduce time and time again on both new and existing projects. We will be learning from a blank page, no fancy software, not relying on content management systems, everything from the ground up. Giving you the power to build your own websites from scratch. </p><p>In the beginning of the course you will start by picking up the basics of HTML and CSS, we'll then go on to implement these skills in a modern and stylish manner, eventually building a complete bespoke, responsive and quite frankly very nice website. </p><p>The project that we'll be working on is an information based site for the city of Orlando, we'll be advising tourists on what to do, where to go and how to travel, providing them with a great place to sit view what Orlando has to offer. Here's the bit you've been waiting to hear, how do we make money online? well we will be  linking up to major Airlines, ticket distributors and more to provide them with customers from our website. If those customers go on to purchase say a flight or a set of tickets we'll be in for a tasty commission that will land straight in our bank account. How will we know if anyone has bought tickets/flights/more?? We'll be tracking it all from our 3rd party dashboard! </p><p>A double whammy! Web design and how to make money online, of course you can also make even more money from your new found web design skills by building other peoples websites, you could even start your own business building websites that make money... for other people. The possibilities are endless. </p><p>I look forward to seeing you on the course!</p>", 
    "end_date": null, 
    "title": "A Unique And Fun Way To Build Websites From Scratch", 
    "price": "20.00", 
    "instructors": "Webmark Academy", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541728_08a7.jpg", 
    "course_url": "https://www.udemy.com/new-learn-web-design-by-building-a-money-making-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T23:48:56Z"
}