{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t                Adobe Flash is an excellent tool to learn animation &amp; multimedia, but to make these animation more interactive and interesting you require programming/scripting. This can be done with the help of Action Script 3.0, which is in-built in Adobe Flash Software. Web development and Presentations in Flash use Action Script programming to a great extent to control the animation on-screen. In this tutorial, you will get an overview of Adobe® Action Script® 3.0, the latest revolutionary version of Action Script.  </p>  <p>  \t          Course includes intro to AS 3.0 to making bit complex scripting programs as we move on. At the end of this course you will be able to make calculator on your own. Its 10-15 days course. Hope you will find this very helpful.  </p>  <p>  \t      This course gives good basic knowledge to students who would want or wish to get in to intermediate and advance learning of action script 3.0 with adobe flash.  </p>  <p>  \t  In our other courses we covered animation part e.g. character animations, visual effects animations, text animation, image animations. Once these animations are ready you can add interactivity to these with the help of Action Script 3.0. Interactivity means involving user in to animation/topic by giving him control on certain movements in animation. You can create simple games using AS 3.0.  </p>", 
    "end_date": null, 
    "title": "Action Script 3.0 with Adobe Flash", 
    "price": "20.00", 
    "instructors": "Aroha Media  Pvt Ltd.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336334_f551_7.jpg", 
    "course_url": "https://www.udemy.com/action-script-30-with-adobe-flash/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T06:47:49Z"
}