{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Sie möchten professionelle und attraktive Websites mit Dreamweaver erstellen? Die erfahrene Webdesignerin und Trainerin Andrea Kuhne zeigt Ihnen, wie es geht, und erklärt die Grundlagen von HTML5, CSS3 und jQuery gleich mit. Sie erfahren außerdem, wie Sie Ihre Websites für Tablets und Smartphones optimieren und dafür sorgen, dass Ihre Angebote auch von Suchmaschinen gefunden werden. Auch die neuen Adobe Edge Tools und die Zusammenarbeit mit Photoshop, Illustrator und Co. werden anschaulich erklärt. Das gesamte Beispielmaterial ist auf der DVD enthalten, so dass Sie jeden Schritt direkt selbst nachvollziehen können.</p><ul><li><strong>Alle Werkzeuge und Funktionen von Dreamweaver einsetzen</strong></li><li><strong>Mobile Websites und Responsive Webdesign</strong></li><li><strong>HTML5, CSS3 und JQuery verstehen und gezielt einsetzen</strong></li></ul>Andrea Kuhne studierte in Freiburg Grafikdesign. Seit dem Erscheinen der ersten HTML-Spezifikation begeistert sie sich für Webdesign, sowohl für das Coden als auch das Gestalten. Sie ist Leiterin der FSG in Hamburg, einer Berufsfachschule für Kommunikationsdesign, und arbeitet freiberuflich als Trainerin in den Bereichen digitale und grafische Gestaltung. Seit vielen Jahren begleitet sie sachverständig Kunden aus der Verlags- und Agenturlandschaft.", 
    "end_date": null, 
    "title": "Adobe Dreamweaver CC – Das umfassende Training", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589530_088a.jpg", 
    "course_url": "https://www.udemy.com/adobe-dreamweaver-cc-das-umfassende-training/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T15:50:34Z"
}