{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Hello, my name is Pablo Stanley and I want to teach you how to design beautiful and functional apps for the Apple Watch.</p>  <p>The Apple Watch is the most hyped product of the year and it&#039;s on track to be in the hands of more than 25 million people. Take this course to prepare yourself to <strong style=\"\">design smooth experiences and beautiful interfaces</strong> in less than a couple of hours.</p>  <p>In this course, we&#039;ll go through the <em style=\"\">Apple Watch Human Interface Guidelines</em> so we can understand the themes, anatomy, actionable notifications, glances, animations, and general interface principles.</p><p>I&#039;ll teach you how to think for the Apple Watch using simplicity and functionality. Stripping down an app to its core benefits and write user stories around it. After that, we&#039;ll <strong style=\"\">design three different apps</strong>: a music player, a messaging platform, and a Udemy app for the apple watch.</p>  <p>And that&#039;s not all. Once our designs are ready, we&#039;ll create <strong style=\"\">interactive prototypes</strong> to test our creations.</p><p><strong style=\"\">What makes me a good teacher?</strong></p><ul style=\"\"><li>Over 2,000 other students have already enjoyed two highly rated Udemy courses</li><li>Keeping the course engaging and relevant so you can have fun taking it is my main priority.</li><li>More than 15 years of experience in Design.</li><li>I just freaking love Design. It&#039;s my passion and I want to pass along my love for it.</li></ul><p><strong style=\"\">Who is this class for?</strong></p><ul style=\"\"><li><strong style=\"\">Beginners welcome! </strong>No programming experience required. I want you to quickly understand the basics and get practicing.</li><li><strong style=\"\">Creators. Makers.</strong> People who want to design apps. I will be teaching you how to design and prototype apps that you can share and play with.</li><li><strong style=\"\">UX and Mobile Designers</strong> who are new to Apple Watch and want to design for the Apple Watch like a boss.</li><li><strong style=\"\">Freelancers</strong> and career development professionals who want to earn money  via contract work, consulting or full-time employment.</li><li><strong style=\"\">Entrepreneurs </strong>who have the next big idea for an app but want to first see how it feels and show it to potential partners</li></ul><p style=\"\">Roadmap:</p><ul style=\"\"><li><strong style=\"\">Music App Design </strong>section available in May 2015</li><li><strong style=\"\">Messaging App Design </strong>section available in May 2015</li></ul>  <p>So, are you excited? Let&#039;s do this.</p>", 
    "end_date": null, 
    "title": "Apple Watch UX: Design Beautiful UI and User Experiences", 
    "price": 0, 
    "instructors": "Pablo Stanley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/484990_bf95_6.jpg", 
    "course_url": "https://www.udemy.com/apple-watch-user-experience/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T07:18:36Z"
}