{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>¿DE QUÉ SE TRATA EL CURSO?</p>\n\n<p>Hoy en día todo diseñador gráfico que se oriente hacia la web debe conocer los lenguajes de marcado y de estilo HTML y CSS. Conocer dichos lenguajes les permite transformar diseños en experiencias interactivas, fundamental para un buen desarrollo web.</p>\n\n\n\n<p>El HTML en su versión 5 nos permite maquetar sitios web a través de etiquetas y dichas etiquetas las podemos convertir en objetos visuales gracias al CSS en su versión 3.</p>\n\n\n\n<p>En este curso aprenderás a escribir etiquetas HTML5, cómo se clasifican y cuáles son sus funciones. Además las propiedades CSS necesarias para dar una apariencia estética a nuestros sitios web.</p>\n\n\n\n\n\n<p>¿CÓMO ES EL CURSO?</p>\n\n\n\n\n\n<p>Comenzaremos a conocer las etiquetas más importantes de HTML5, desde la cabecera hasta el cuerpo del sitio web, pasando por las etiquetas de meta-datos, enlaces, estilos, cabezote, barra de navegación, columnas, secciones, artículos, imágenes, video, audio y pie de página.</p>\n\n\n\n<p>Luego conoceremos la clasificación de las propiedades CSS para dar la mejor apariencia a cada una de esas etiquetas que creamos en HTML5.</p>\n\n\n\n\n\n<p>En este curso podrás descargar una carpeta donde está todo el material necesario para la elaboración del mismo.</p>\n\n\n\n\n\n<p>¿CUÁNTO SE TARDA EN COMPLETAR EL CURSO?\n</p>\n\n\n\n\n\n<p>Depende de ti. Estimo que menos de una semana puedes completar el curso, pero dependerá de tu ritmo de trabajo y de tu disponibilidad.</p>\n\n\n\n\n\n<p>¿CUÁLES SON LOS REQUISITOS?\n</p>\n\n\n\n\n\n<p>Descargar el material que se encuentra en los recursos de la clase 1.\n</p>\n\n\n\n\n\n<p>¿A QUIÉN VA DIRIGIDO ESTE CURSO?</p>\n\n\n\n\n\n<p>Diseñadores gráficos, visuales, artistas, desarrolladores</p>\n\n\n\n\n\n<p>Empresas y emprendedores</p>\n\n\n\n\n\n<p>Cualquier persona que quiera tener una página web</p>", 
    "end_date": null, 
    "title": "Aprende HTML5 y CSS3 desde cero", 
    "price": 0, 
    "instructors": "Docente Juan Fernando Urrego", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814594_15eb_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-html5-y-css3-desde-cero/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T15:41:24Z"
}