{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>¿DE QUÉ SE TRATA EL CURSO?</p>\n\n<p>La construcción de un sitio web no termina en la maquetación. Pensar en una mejor experiencia para el usuario es pensar en recursos interactivos y efectos visuales que se mezclen con el diseño. Hoy en día trabajamos el lenguaje de programación Javascript y sus librerías para lograr dicha experiencia, pero en este curso vamos a profundizar más en las bondades que trae las Hojas de Estilo CSS en su versión 3. Construiremos recursos utilizando sólamente CSS3, que nos permitan pasar de diseños estáticos a diseños enriquecidos en movimiento.</p>\n\n\n\n<p>¿CÓMO ES EL CURSO?</p>\n\n\n\n<p>El curso se divide en varias secciones. En una primera sección aprenderemos a utilizar la línea de tiempo que trae CSS3 para crear animaciones. En la siguiente sección aprenderemos a crear botoneras con menú desplegable. Luego comenzaremos a crear varios recursos que nos permiten llevar a una mejor experiencia de usuario cuando se trata de dispositivos touch (phones y tablets). Finalmente integraremos en un sitio web un slideshow y una galería de imágenes interactiva y un fondo animado.</p>\n\n\n\n<p>¿CUÁNTO SE TARDA EN COMPLETAR EL CURSO?</p>\n\n\n\n<p>Depende de ti. Estimo que menos de una semana puedes completar el curso, pero dependerá de tu ritmo de trabajo y de tu disponibilidad.</p>\n\n\n\n<p>¿CUÁLES SON LOS REQUISITOS?</p>\n\n\n\n<p>Descargar el material que se encuentra en los recursos de la clase 1. Tener principios en HTML5 y CSS3, curso gratuito que puede realizar en UDEMY: \"Aprende HTML5 y CSS3 desde cero\".</p>\n\n\n\n<p>¿A QUIÉN VA DIRIGIDO ESTE CURSO?</p>\n\n\n\n<p>Diseñadores gráficos, visuales, artistas, desarrolladores</p>\n\n\n\n<p>Empresas y emprendedores</p>\n\n\n\n<p>Cualquier persona que quiera enriquecer una página web</p>", 
    "end_date": null, 
    "title": "Aprende a crear animaciones y efectos interactivos con CSS3", 
    "price": "20.00", 
    "instructors": "Docente Juan Fernando Urrego", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831442_f51a.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-crear-animaciones-y-efectos-interactivos-con-css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T15:21:36Z"
}