{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em><strong>UPDATED: October 2015 with over 700+ happy students.</strong></em></p><p><em><strong>The Ultimate Online Blogging Course for beginners.</strong></em></p><p>Mitch here, and first things first…  I wanted to thank you for checking out:  </p><p><strong><em>- NEW MASSIVE BONUS - Buy 1, Get 1 Free ($598 Value in Total)<br>I have decided that I wanted to provide massive value to your design career. So buy this course and get access to \"Easily Learn Web Development with Drop &amp; Drag - OptimizePress\" course. Enjoy!  </em></strong></p><p>  \t<strong>Bottom Up Blogging </strong>  </p>  This blog and web development product has turned into quite the beast…  …I'm extremely proud of what it's become and the impact it's having on so many people's lives…  Anyway, let me ask you a question:  Is Your Life Where You Imagined It Would Be?   <ul>  \t<li>Do you have the career you dream of?</li>  \t<li>Are you making enough money to do the things you love more often?</li>  \t<li>Would making a few thousand extra dollars on the side each month change your life?</li>  \t<li>Do you have the freedom and passive income you would like? Or are you chained to the desk for the next 20 years?</li>  </ul>  <em>BEEN THERE!!</em>  <em>I've talked the talk</em>  <em>And walked the walk</em>  <p>  \t                     The number one reason I've been able to get such explosive results quite recently is from “years\" of trial and error blogging. As well as investing tens of thousands of dollars into many businesses, blogs and personal development!</p>  <p>  \t                     I love living each day to the extreme. Pushing boundaries and getting out of my comfort zone……….  </p>  That Is Where The Real Magic Happens…….  But life hasn't always been like this for me…….  <p>  \t                     There were times when I felt lost……  </p>  <p>  \t                     Stuck in my comfort zone.  </p>  <p>  \t                     Chained to a 9-5……..wondering if there was any light at the end of the tunnel.  </p>  <p>  \t                     Not making the money I knew I was worth. Like I could have been with a blog.</p>  <p>  \t                     Having no freedom to travel the world as I pleased. Like I can have blogging.</p>  <p>  \t                     Lying to myself about what my life was really like. </p>  <p>  \t                     When you wake up in the morning, look at yourself in the mirror and you realise that you are not happy with the person you see staring back at you. You feel like you are living somebody else's life……and that is a sad existence.  </p>  But then I stumbled upon mentors…….  <p>  \t                     They travel the world luxuriously staying in 5-star hotels and flying business class.  </p>  <p>  \t                     And the whole time they run their businesses, blogs and other blogging websites from their laptops. Some of which are making $xxx,xxx per month.  </p>  <p>  \t                     I had the pleasure of being able to live with these guys, study them and learn the secrets they used to create hugely successful blogs and online businesses…..  </p>  <p>  \t                     I learnt how to balance a blogging business with having true freedom to do what you want.  </p>  <p>  \t                     Things I never knew could be in balance……..  </p>  You actually really can have it all at the same time!!  I now use their secrets in my own life and have boiled down the process into small actionable steps that you can learn!  INTRODUCING:  <p>  \t<strong>Bottom Up Blogging </strong>  </p>  <p>  \t                    So here's the deal….  </p>  <p>  \t                    Now I want to pay it forward and show you how to build an Authority Blog from start to monetisation that's genuine and authentic to your vision. I am going to help you build an online blog and design your website that could make all your dreams and life goals come true  </p>  <p>  \t                    I'm extremely passionate about blogging, helping aspiring lifestyle entrepreneurs and people just like YOU to be successful in blogging!  </p>  <p>  \t                    Here's An Inside Look At What I Will Be Helping You With…  </p>  <ol>  \t<li><strong>Initial Online Website Design</strong> - Become a pro at setting up a domain name and hosting</li>  \t<li><strong>WordPress Technicalities</strong> - You will be a WordPress blog expert by the time you have finished. All you need to do, is follow each step in the video, it couldn't be any simpler</li>  \t<li><strong>Market Validation - </strong>You will know what blogging markets work and what do not. A good idea comes from deep within, I will show you how to find it (if you don't already know)</li>  \t<li><strong>The Nitty Gritty Stuff - </strong>No one tells you about the little housekeeping things that cause you hours of headaches. I DO. And I will save you hours of headaches with my informative blogging videos.</li>  \t<li><strong>Creativity Customisation</strong> - You will know how to customise your blog so that it looks like nobody else's. It will be professional and help convert visitors in to leads.</li>  \t<li><strong>Monetisation</strong> - There are many ways to make money blogging online and monetise a blog. I will show you the top 3 ways that you should concentrate on first.</li>  \t<li><strong>Networking and Outreach</strong> - Your blog's success will depend on the relationships you build. I will give you an \"all-done\" for you template to attract the people you want to build the relationship with.</li>  \t<li><strong>OptimizePress</strong> - Highly customised websites, landing pages and sales pages are built with this plugin. Learn how to navigate the backend of Optimizepress so that you can stand out from the crowd with highly customised and professionally designed authority blog pages.</li>  </ol><p><em>The 100% Money Back Guarantee</em> - <em>This course comes with a 100%, no questions asked, money back guarantee. I am so confident in the course that if for whatever reason you are not fully satisfied, you will receive a full refund direct from Udemy. </em>So there is no risk on your part.</p>  <p>  \t              Here's what others have had to say:  </p>    <p>  \t<em>by Tea Zhi Hao, 6 days ago</em>  </p>  <p>  \t<em>\"The course cut short my learning curve and saved me time and money</em>  </p>  <p>  \t<em>For the past 6 months I've been painstakingly building my own website / blog to little or no success. I've spent time and money making my own mistakes until I came across this course. The ideas that Mitch presents helps me cut short my learning curve and also cut out most of the uncertainties that I face. The course also gives me practical and applicable action steps which I can follow easily.</em>  </p>  <p>  \t<em>A great course and a steal at its current price. Thanks Mitch!\"</em>  </p>  <p>  \t              by John Mitchell, a day ago  </p>  <p>  \t<em>\"Keeps getting better</em>  </p>  <p>  \t<em>I am 50% of the way through the course already and it just keeps getting better and better. There are so many things I would not have known if someone didn't tell me about it. I think this has saved me a lot of time and well worth the investment\"</em>  </p>    <p>  \t            by Jake Gerter, 9 days ago  </p>  <p>  \t<em>\"Amazing Ideas</em>  </p>  <p>  \t<em>Wow, what an awesome idea. I love the fact I don't have to be an expert but instead I can get experts to provide my content. I never though of that before. I am definitely going to pursue this angle further. The instructor Mitch had a nice voice to listen to, it wasn't boring like many of the others I have taken. I would recommend this program to anyone wanting to start a blog. I also liked the live demonstrations of setting up a blog because I have no experince with that so it helped a lot to follow step by step.\"</em></p>  <p>  \t                    If you've read this far you KNOW there's something VERY beneficial here for you.  </p>  <ul>  \t<li>If you want to start your own personal blog just to begin writing a message to yourself or to the world</li>  \t<li>If you want to create an online personal branding business and make 6 or 7 figures per year blogging</li>  \t<li>If you want to start a lifestyle blogging business designed to make you money from anywhere in the world while you travel</li>  \t<li>If you want to create your own online blog and create your own products to bring your message out into the world and package it up at a high price to make you money</li>  \t<li>If you want to be an Author, Speaker, Coach, Consultant or Industry Expert</li>  </ul>    <p>If you have read this far then It's highly likely this cutting edge blogging information is just what you need to give you an unfair advantage over everyone else…  </p><p>This blogging coaching is designed to get the ball rolling for you, do the heavy lifting, give you the inspiration you need to take the first few steps which are always the hardest. This blogging training won't finish after these videos, in fact it will be just beginning.  </p><p><strong>The Longer You Wait, The Longer It Will Take You To Be Earning Serious Money. Take Action Now And Click \"Take This Course\"! - see you on the inside.</strong></p>    <p>  \t                       Frequently Asked Questions &amp; Answers  </p>  <ul>  \t<li>How quickly will I reach my first 1,000 subscribers blogging?   \t  \t                       This is completely dependent upon you. You could reach 1000 in a week, or you may never reach that number of subscribers. It comes down to your ability to put the effort in, as well as the methods you employ to generate subscribers. Just know that something magical happens when you reach that number, so do whatever you can to push through and get them!</li>  \t<li>     How much will it cost to set up &amp; launch my blog?   \t  \t                       You can get your blog online and launched for the cost of a domain name (around $10) and web hosting (as little as $5 per month)! I recommend paid themes in the training, but none of them are more than $50, and there are lots of free options available as well. Any other costs associated will depend on the methods you use to promote and grow your blog. There are also free ways to do every step (which I will cover in the training) if you choose to bootstrap your growth.   \t  \t</li>  \t<li>How much money can I make with my blog?   \t  \t                       Unfortunately there is no way I can answer that realistically. Every person is different, has different skills and work ethic, etc, so it's impossible to answer. How much you make will be completely up to you and your skills and effort.   \t  \t</li>  \t<li>How long do I have access to the blogging course?   \t  \t                       The course is available online with unlimited access 24/7.   \t  \t</li>  \t<li>Can't I just figure blogging out on my own?   \t  \t                       Probably…but why would you want to? Wouldn't you rather just take a short-cut and learn what has already been proven to work? Look, I've made every mistake you can make so that you don't have to. But hey, if you want to spend your valuable time and hard-earned money trying to figure this out on your own, you certainly can.   \t  \t</li>  \t<li>Is there a guarantee?   \t  \t                       Udemy have a 30 Day, 100% Money-Back Guarantee. So, YES, your purchase is 100% guaranteed.  If you're not happy with Bottom Up Blogging for any reason, we'll happily refund every penny. No hard feelings.</li>  </ul>", 
    "end_date": null, 
    "title": "Authority Blogging: A Step By Step Blogging Video Course", 
    "price": "20.00", 
    "instructors": "Mitch Asser", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334694_1df5_6.jpg", 
    "course_url": "https://www.udemy.com/bottom-up-blogging/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T10:35:42Z"
}