{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong></strong><strong>Look at Graphic &amp; Web Design in a Different Way.</strong> <em>See Design from a New Perspective.</em> I&#039;m opening my data driven design playbook and sharing my perspective through the art of storytelling. <em>Remember, you are learning a mindset! This new mindset will help strengthen things you learn in other courses.</em>  </p>  <p>  \t        Did you know Dolphins use tools and transmit cultural knowledge across generations? And their considerable intelligence has driven interaction with humans! Be the Dolphin in today&#039;s internet sea of noise.  </p>  <p>  \t        Dive deep and QUICKLY learn how to:  </p>  <ul>  \t<li>Design websites and graphics differently</li>  \t<li>Spend less money on a new website or design project</li>  \t<li>Gather website data ... then customer and client leads</li>  \t<li>Intrigue &amp; engage your client with real-time website analytics</li>  \t<li>Easily build and manage an effective web presence without coding skills</li>  \t<li>Know more about your client&#039;s website audience than they do</li>  \t<li>Find untapped niche markets in your area</li>  </ul>  <p>  \t<em>You don&#039;t have to be gifted with creativity to design or manage an effective website! Need proof?</em> In this course, I&#039;ll provide Real World examples that are worth the course fee alone.  </p>  <p>  \t        The design knowledge you gain can be used to start your own web business, help people and businesses with an existing website or simply use as a checklist to give your current &quot;designer&quot;.  </p>  <p>  \t        There are many courses out there where you can learn to do &quot;cool&quot; &amp; &quot;creative&quot; things. This is not one of those courses. Although fancy fonts, pretty pics, and vivid videos have their place, this course focuses only on the details and eye-opening analytics behind the design. Plus I&#039;m taking a non-stuffy, fun approach to learning this material. Let&#039;s laugh and learn! Ready?  </p>", 
    "end_date": null, 
    "title": "Be the \"Dolphin\" of Designers", 
    "price": "20.00", 
    "instructors": "Ricky Russ Jr", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351242_8125.jpg", 
    "course_url": "https://www.udemy.com/dolphin-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T20:34:55Z"
}