{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>The Internet is everyone's go-to source of information in today's world. Businesses, public figures, publications and everything in between all have a presence on the web; and the more professional their website looks, the more successful they tend to be. Web designers are more in demand than ever before, and the profession is constantly changing along with the web itself. This course aims to teach the most up to date fundamentals of web design from scratch.</p><p><strong>Learn Web Design from Scratch</strong></p><ul><li>Understand the basics of CSS and HTML</li><li>Learn about current web designing trends and developments</li><li>Gain an insight into web development, debugging, etc. as well as design</li><li>Build your own portfolio website</li></ul><p><strong>Web Designing for Beginners</strong></p><p>This course has been developed for both complete beginners and those who already have a limited knowledge of web design. Aspiring web designers, web developers who want to understand the design side of the business, and graphic designers - as well as those from completely unrelated disciplines - will all be more than capable of handling the content of this course.</p><p>This course will take you through the fundamentals of web design from scratch. That means getting to grips with HTML, CSS and Foundation Grid Framework; working with images, webfonts and sprite sheets among other elements; understanding grids and responsive design; and achieving flawless layouts, eradicating bugs, and more.</p><p>Throughout the course you will work towards designing and developing a colorful, modern and responsive portfolio website. By the end of the course you will have this website completed, and can use it when starting out on your career in web design.</p><p><strong>About HTML and CSS</strong></p><p>HTML, or Hyper Text Markup Language, is the code used to define colors, graphics, hyperlinks, paragraphs, and other simple elements of a website. It was developed by the founder of the web, Tim Berners Lee, back in 1990.</p><p>CSS, or Cascading Style Sheets, define the more advanced aspects of websites like fonts, background images, positioning and much more. It is a style language that defines HTML layout, so the two are intrinsically linked. Both form the basic frameworks for all websites on the internet.</p>", 
    "end_date": null, 
    "title": "Become a Professional Web Designer", 
    "price": "35.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "36.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641544_9e6c_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-professional-web-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T16:44:53Z"
}