{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tFinally! A course designed for the absolute beginner. I will virtually take you by the hand and show you how to get a WordPress site up and running without overloading you with too much mind-numbing technical information.  \t  \tWhether you need a professional-looking, mobile-friendly site for your business or non-profit but do not have the money to hire a web developer, work for a small business and have been put in charge of creating your company&#039;s website, are an 80 year old great-grandmother wanting to start a web development business on the side or just want to take advantage of the FREE tools available...this course is for YOU. </p><p style=\"\">That&#039;s right! This course includes some FREE tools valued at approx. $100 dollars that will make your website look awesome. You get a FREE domain name to start. I&#039;ve included a FREE premium theme (layout &amp; design template) and a FREE powerful social media plugin (adds more features to promote your website).</p>    <p style=\"\">  \t<strong style=\"\">About the course</strong>  \tDuring the course, you will learn how to build a WordPress website from scratch even if you are a complete beginner. Over the duration of this course you will build a full website by following step-by-step instructions. NO CODING ALLOWED.</p>  <p style=\"\">  \t<strong style=\"\">Who should take this course?</strong>  \tThis WordPress course is designed for anyone who wants to build and maintain websites and blogs using WordPress. If you have a dream of being your own boss, need a source to earn extra income, would like to gain a promotion at your job, need to market a product, or just have the desire to learn something fun and new then you will definitely benefit from this course.</p>  <p style=\"\">  \t<strong style=\"\">Prerequisites</strong>  \tThere are no prerequisites for this WordPress course. However, you should have general computer skills and access to the Internet.</p>", 
    "end_date": null, 
    "title": "Beginner's Guide to Creating an Awesome Website in WordPress", 
    "price": "40.00", 
    "instructors": "Robert Renaud", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436558_ada5_3.jpg", 
    "course_url": "https://www.udemy.com/beginnercourse/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T14:28:17Z"
}