{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t   If you want to learn Wordpress, want a proper Wordpress tutorial, and want to get the best Wordpress training around, you have come to the right place.  </p>  <p style=\"\">  \t   What is Wordpress?  </p>  <p style=\"\">  \t   Wordpress is a free website software that allows you create fantastic looking blogs and websites. This is Wordpress for beginners and we have some great Wordpress video tutorials.  </p>  <p style=\"\">  \t   In the Wordpress video tutorials I show you:  </p>  <ul style=\"\">  \t<li style=\"\">How      to do Wordpress website design</li>  \t<li style=\"\">How      to create your own beautiful Wordpress sites</li>  \t<li style=\"\">How      to install a Wordpress theme to create your Wordpress website</li>  \t<li style=\"\">How      to  login as a Wordpress admin</li>  \t<li style=\"\">The      best ways of installing Wordpress</li>  \t<li style=\"\">Show      you one of the best Wordpress hosting providers</li>  \t<li style=\"\">How      to use the Wordpress dashboard</li>  \t<li style=\"\">How      to use the Wordpress editor</li>  \t<li style=\"\">How      to install simple Wordpress themes</li>  \t<li style=\"\">How      to update Wordpress</li>  \t<li style=\"\">How      to install plugins</li>  </ul>  <p style=\"\">  \t   And lots more……  </p>  <p style=\"\">  \t   Learning Wordpress and using Wordpress is quite easy, once you get inside you will see that it is quite similar to Microsoft Word in the back end, but alt more powerful.  </p>  <p style=\"\">  \t   There are Wordpress alternatives, but they tend to be a lot less versatile and are a lot harder to customize to the way you want your site to look.  </p>  <p style=\"\">  \t   Website design has come a long way and nowadays there is no need to do it the hard way and spend months learning website coding.  </p>  <p style=\"\">  \t     In this 86 video WordPress training course from you&#039;ll learn everything you need to know to create a fantastic looking custom site and finding products to make money; from installation to design, from customisation to finding products to promote on your site, from installing videos to capturing your customers email details, from adding Paypal order buttons to your website to creating a Facebook ad. This is much more than website creation course; this is a website business in a box solution.  </p>  <p style=\"\">  \t     Once you know what you are doing, and you have got everything you need to setup your site, it shouldn&#039;t take you more than a couple of days to setup a site.  </p>  <p style=\"\">  \t     This course is for anyone who wants to setup a website business or blog and would lke to try their hand at making money online from their site.  </p>", 
    "end_date": null, 
    "title": "Best Video Training To Create Wordpress Blogs and Websites", 
    "price": "20.00", 
    "instructors": "Al Hemmings", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107078_3c2b_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-wordpress-business-website-in-2-days/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-17T11:10:56Z"
}