{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">No Coding Required!</strong>  </p>  <p style=\"\">  \t                Yes, you read that right. Have you ever wanted to develop a website, but just haven&#039;t had the <em style=\"\">time</em> to learn HTML, CSS and Javascript? Are you a web designer who needs to quickly build prototypes to share with clients and colleagues? Or are you just wanting to learn something really cool to share with your friends?  </p>  <p style=\"\">  \t                There are many tools out there that allow you to do this, like Macaw, Adobe Edge Reflow and Webflow. However, only one provides you a way to do this without downloading software.  </p>  <p style=\"\">  \t                In this course from Bloc, we&#039;ll take you through how to use Webflow to build a simple prototype website — in this case, a music web player called Bloc Jams — that features a home page, a browse page with cool album cover art, and some pretty spectacular interactions like a slide-out search panel. You&#039;ll build this site throughout the course, but you&#039;ll be learning how to use Webflow for future projects to help you success in your web design and development career!  </p>  <p style=\"\">  \t<strong style=\"\">Things you&#039;ll need to remember and do in this course:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Forget HTML and CSS</li>  \t<li style=\"\">No need to understand Javascript</li>  \t<li style=\"\">Photoshop? Nah.</li>  \t<li style=\"\">Responsive design is easier than you think.</li>  \t<li style=\"\">Publish and deploy with the click of a button</li>  \t<li style=\"\">Prototyping doesn&#039;t require tons of time and heartache</li>  \t<li style=\"\">Build a website from scratch — without code</li>  </ul>", 
    "end_date": null, 
    "title": "Bloc: Design & Build a Website without Code", 
    "price": 0, 
    "instructors": "Joey Kirk", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/283080_4f81_4.jpg", 
    "course_url": "https://www.udemy.com/bloc-design-without-code/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-18T13:47:12Z"
}