{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>NEW November 2015 Course! - Create your own Responsive website in under 5 minutes!!</strong></p><p><strong>This course will introduce you to Bootstrap.  Teach you how to use Bootstrap to create amazing web content. </strong> Bootstrap <strong>saves you time </strong>and this course is optimized to cover most commonly used aspects of Bootstrap.  This course is packed with awesome resources to utilize for better quicker and more effective Bootstrap development. <strong> Everything is included.....</strong></p><p><strong>Each lecture covers different sections of Bootstrap, the structure, how to apply CSS to Bootstrap, Bootstrap\nLayout Components and more...</strong></p><p><strong>Bootstrap</strong> is the <strong>most popular </strong>HTML, CSS, and JS framework for developing responsive, mobile first projects on the web. Designed for everyone, everywhere.  Bootstrap makes front-end web development faster and easier. It's made for folks of all skill levels, devices of all shapes, and projects of all sizes.</p><p>One framework, every device. Bootstrap easily and efficiently scales your websites and applications with a single code base, from phones to tablets to desktops with CSS media queries.<strong> </strong><strong>Full of features</strong></p><p><strong>EXAMPLES - SOURCE CODE - RESOURCES - HOW TO - STEP BY STEP</strong></p><p>Learn Bootstrap with our Step by Step training, we show you how to create dynamic interaction on your web pages. Learn to use Bootstrap to create better user interaction experiences on web pages. Understand the structure of Bootstrap and how to apply it. Learn at your own pace resources are included, source code and everything you need to practice and learn Bootstrap. We show you useful examples of Bootstrap and explain the development process.</p><p>Knowing how to apply Bootstrap is an excellent skill to have. Bootstrap is everywhere and by the end of this course you will have what you need to use it on your own webpages.<br></p><p>We walk you through step by step with detailed explanations of code and more. We add and update a webpage from scratch adding Bootstrap to bring it to life.</p><ul><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>source files downloadable to work along</li><li>challenges and lessons and code samples</li><li>Links to top resources to save time</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul><p>We teach you the latest techniques and tools to use in order to create amazing web content. Everything you need to know is included in this course. Learn at your own pace, lifetime access to this course.</p><p>Our tutorials are easy to follow and effective in teaching Bootstrap.</p><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Bootstrap Projects Responsive Design Essential Training", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674644_1180.jpg", 
    "course_url": "https://www.udemy.com/bootstrap-projects-responsive-design-essential-training/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T16:20:01Z"
}