{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><p>Building\r\na website with Wordpress from scratch for your business can seem\r\ndaunting -- it doesn&#039;t need to be. </p>\r\n\r\n<p>With a brand-new WordPress theme, <strong>Twentytwelve</strong>, you can make a completely unique, branded website, <strong>without using Photoshop, hiring a designer,\r\nor spending hours of sweat and toil on your site.</strong> </p>\r\n\r\n<p>This “How\r\nto Build A Website With Wordpress From Scratch” course is for the\r\nentrepreneur, small business owner or creative who wants to know *just enough*\r\nabout WordPress to create a killer website all their own. </p>\r\n\r\n<p><strong>Because it&#039;s\r\ncompletely up to date on all the features of WordPress 3+, and the brand-new\r\ndefault theme Twentytwelve</strong>, it&#039;s a great course for those who have some\r\nfamiliarity with WordPress but want to take their skills to the next level. </p>\r\n\r\n<p>By focusing not only on building you a great site but also\r\non branding<strong>, it will further help you\r\nlaunch a site well positioned stand out and get surfaced in search</strong>. </p>\r\n<p>In this “how\r\nto build a website with Wordpress from scratch “course, you&#039;ll follow\r\nalong a set of short lectures while building your own website. You&#039;ll learn how\r\nto make a child theme (but you&#039;ll also be able to download a sample).</p>\r\n<p>What you&#039;ll have at the end of the course: </p>\r\n<p>A cool-looking, mobile-responsive website that has custom\r\nweb fonts and a strong, branded positioning without a lot of muss or fuss.&nbsp;</p>&lt;/p&gt;<p></p><p>What you <em>won&#039;t</em> get:&nbsp;</p><p></p><ul><li><span>A cookie-cutter site based on a theme that looks like everyone else&#039;s</span><br></li><li><span>A better understanding of Adobe products like Photoshop and Illustrator (though they are helpful, you don&#039;t need them and they aren&#039;t covered)</span><br></li><li><span>A deep look at theme functions in PHP (because all the customizations we&#039;re doing can be done in CSS)</span><br></li></ul><div><p>Take this ultimate course right now and learn how to build a website with Wordpress\r\nfrom scratch.</p></div><p></p><p></p>\r\n", 
    "end_date": null, 
    "title": "Brand Yourself with a Custom WordPress Site", 
    "price": "45.00", 
    "instructors": "Amanda McCormick", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37379_2cd6_10.jpg", 
    "course_url": "https://www.udemy.com/brand-yourself-with-a-custom-wordpress-site/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-21T23:01:07Z"
}