{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>The number #1 question I get asked by the hundreds of students I teach on a daily basis is...<br>How do I build a website I can be proud of, without breaking the bank?  </em></p><p>And because we're all in the Fashion Industry, its really important for our websites to look professional and chic, but we don't want to learn code nor spend a lot of money.   </p><p>Before you spend $1000's of dollars on your first website or blog and before you shed countless hours of blood, sweat and tears learning crazy computing code, you should probably do this easy Video Course.</p><p>It will take you about an hour to set it all up, and I will hold your hand through this whole process - breaking your CPanel, URL and Web hosting down into non-techy terms (it's actually pretty easy once you know how to do it!)</p><p>Then you oversee the design process over the next 7 days, and while this program is very affordable, you will need to spend about $300 (not thousands!) hiring a brilliant web designer to complete your site or blog! </p><p>Leaving you time to focus on what you're awesome at, which I'm gonna bet is NOT coding websites!</p><p>I actually created this to <em>effortlessly</em> build my Mum her very first website.  She's a retiree and has always wanted to be an Interior Stylist, so check out her site at Sunshine Coast Interior Design dot com dot au.  It took 7 days and cost $260. </p><p>Create a functional website that showcases your talents beautifully, whilst engaging customers and clients...without getting stuck in a big ol' techy-mess!<em><br></em></p>", 
    "end_date": null, 
    "title": "Build Your Website In 7 Days Without Coding", 
    "price": "20.00", 
    "instructors": "Amber Renae", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708208_7f93_2.jpg", 
    "course_url": "https://www.udemy.com/build-your-own-website-without-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T04:37:03Z"
}