{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course you will learn to build a professional website from scratch. Anyone can follow this course. However, the ideal student will need to have basic computer knowledge and be comfortable navigating websites. Also, you will have to be willing to interact with others using email and social media. I spent a lot of time and money learning this on my own. I want to spare you of this and give you the short cuts. I will take you through simple steps to purchase a domain and hosting account. These are both very inexpensive and I will show you ways to save money on both. I will also show you how to install word press and to custom design your website. Also, I will show you to professionally add your content and add pictures. I will cover the basics of search engine optimization and tools you can use to improve your seo efforts and track them. Once your site is fully functional you will see my technique to apply to all social media networks to build traffic to your website. Anybody is qualified to take this course and not very much overhead is required. You will receive an action plan to follow for 1 week after the course to ensure your success. Consistent action is what will determine your success. I think you should take this course because you will have a road map on how to share your business, product, or idea. I wish I had this starting out and I am glad to share my knowledge. It is a relatively short course and you will have your own website up and running in no time! My goal is to give back to those looking for guidance on building their own site. So, you will have access to my email and will be able to contact me for further questions or feedback. I will also personally connect with you on social media to help grow your website I look forward to teaching you. See you in the course!</p>", 
    "end_date": null, 
    "title": "Build and Grow A Website Effectively From Nothing", 
    "price": "20.00", 
    "instructors": "John Waller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506790_62bc_2.jpg", 
    "course_url": "https://www.udemy.com/build-and-grow-a-website-effectively-from-nothing/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T03:30:16Z"
}