{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This <strong><em class=\"redactor-inline-converted\">FREE</em></strong> web design course has been designed to walk you step-by-step, through the entire process of building your own WordPress website in ONE AFTERNOON!</p>\n\n<p>Following this course will show you how to set up a website (or blog) using ANY THEME on WordPress.</p>\n\n<p><em class=\"redactor-inline-converted\">\"I easily could have charged money for this, but I actually LOVE teaching WordPress, and I also love the whole Udemy experience\".</em></p>\n\n<p>You do not need to know any HTML, or CSS,coding, or anything like that. This course will have you up and running with WordPress in next to no time, regardless of your skill level!</p>\n\n<p><em class=\"redactor-inline-converted\">Learn how to set up your own WordPress website without any experience or coding required.</em></p>\n\n<p>I will also show you how to get started with your first months web hosting for only 1 penny, which means you basically have nothing to lose! (this course is free to enrol).</p>\n\n<p><em>(don't worry if you aren't sure what this means yet, I explain all of this inside the course).</em></p><p><strong class=\"redactor-inline-converted\">Why WordPress?</strong></p>\n\n<ul><li><em class=\"redactor-inline-converted\">Over 74 million websites use WordPress.</em></li><li><em class=\"redactor-inline-converted\">Alm</em>ost 50% of the top blogs are built on WordPress.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">“Learn How To Use WordPress for FREE in 1 Afternoon!”</em></strong></p>\n\n<p>I have been using WordPress to build websites now for over 5 years, and I can't wait to start helping you get started with your own.</p>\n\n<p>If you have any questions about using WordPress, or if you just want to say “hi”. Don't hesitate to send me a message.</p><p>I will see you on the inside,<br>@MartieDread</p>\n\n<p>PS</p>\n\n<p><em class=\"redactor-inline-converted\">I also included a bonus video with this course, which will show you how to create a simple logo online for free. I thought you might like it!</em></p><p><strong class=\"redactor-inline-converted\">What are the requirements to build a website you ask?</strong></p>\n\n<ul><li>A Computer with an Internet connection</li><li>About $13 (for web hosting and a domain name)</li><li>That's it! (nothing else… serious!)</li></ul><p><strong class=\"redactor-inline-converted\">What am I going to get from this course?</strong></p>\n\n<ul><li>Over 15 Lectures! (everything you need to know, without information OVERLOAD)</li><li>Learn How To Get 1 Months Web Hosting for ONLY 1 PENNY!</li><li>Build A WordPress Website in One Afternoon</li><li>Use ANY WordPress THEME You Like</li><li>Learn The Skills Needed to Update Your New WordPress Website</li><li>Create A FREE Logo and Add it On WordPress</li><li>A List of My 14 favourite FREE WordPress Plugins (from 5+ years experience)</li><li>A Certificate of Completion</li></ul><p><strong class=\"redactor-inline-converted\">Who is this course for?</strong></p>\n\n<ul><li>Business Owners</li><li>Entrepreneurs</li><li>Students</li><li>Basically… ANYONE who wants a <strong class=\"redactor-inline-converted\">PROFESSIONAL Website</strong> without spending a fortune on web design or training!</li></ul>", 
    "end_date": null, 
    "title": "Build A WordPress Website in One Afternoon! (A Step by Step", 
    "price": 0, 
    "instructors": "Martie Dread", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831888_cd02_2.jpg", 
    "course_url": "https://www.udemy.com/build-a-wordpress-website-in-one-afternoon/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-26T00:41:09Z"
}