{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t   This is a two hour video course showing you exactly how to create a custom author website that will allow you to sell more books, reach new readers, and simplify your marketing. If you want to take a look at what the finished website could look like visit &quot;JohnDoeAuthor.com.&quot; Of course, this sample site can be customized with your own background, header image, and colors - have a look at the introduction video to see how amazing this can look.  </p>  <p style=\"\">  \tIf you are an author who doesn&#039;t currently have a website (or has a blog hosted on Blogger or Wordpress.com), then this is the perfect tutorial for you. Owning your own web presence means that you&#039;ll always have a direct way to reach your fans, which can never be guaranteed when you don&#039;t own the space on which your website is hosted. For a minimal cost (less than $10 a month) and an afternoon of your time, you can create a safe and secure place for interacting with your fans and selling more books.  </p>  <p style=\"\">  \tThis course is entirely video (screencast) based, you just need to follow along with exactly what I am doing on the screen and you&#039;ll have a stunning website in under a day. In fact, I&#039;d recommend that you just set aside a full afternoon to complete the course, as it is best done in one sitting!  </p>  <p style=\"\">  \tIf you are still unsure of whether you should take this course, have a quick watch of the introduction video and you&#039;ll hear some of today&#039;s top self published authors talk about the value of having an author website. You will also learn how to start a mailing list (also for free) which allows you direct access to your fans and is regarded as the most powerful marketing tool in any authors arsenal.  </p>  <p style=\"\">  \tGet started with creating your site today by taking this comprehensive video course!  </p>", 
    "end_date": null, 
    "title": "Build a Stunning Author Website with No Web Skills", 
    "price": 0, 
    "instructors": "Simon Whistler", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/204632_6b1c_2.jpg", 
    "course_url": "https://www.udemy.com/build-a-stunning-author-website-with-no-web-skills/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-24T17:39:47Z"
}