{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Have you always wanted to build dazzling and responsive Websites from the ideas you have imagined but didn't have or want to devote the time to dig into HTML and CSS code? Or maybe you are a designer that is tired of paying a coder to mock up your designs to present to your customers. Or perhaps you are a seasoned coder who wants to be able to mock up a design quickly and then manipulate the code later on.<br></p><p>If any of this sounds familiar to you, then Macaw may be the answer. In this course, I will lead you through the tools and user interface of Macaw and show you how to build a real world Web design that could actually be put into production with very little extra effort.</p><p>Did you know that mobile devices have outpaced the desktop market. This means that you have to make your Web presence responsive to these smaller screens. This course will teach you how to take your design and make it \"Responsive\" to all sizes including the mobile market which as of July of 2015 represents over 51% of all Internet users.</p><p><br></p><p><strong>Build a strong foundation in Web Design using Macaw</strong></p><ul><li>Learn about the Macaw tool</li><li>Learn the basics of the interface</li><li>Create some real-world examples</li></ul><p><strong><br></strong></p><p><strong>Content and Overview</strong><br></p><p>The good folks that built Macaw have delivered a wonderful tool that allows you to draw your Web ideas instead of coding them but as with all new tools, there is a learning curve. I help you navigate the uncharted waters and get you up to speed quickly so you can enjoy bringing your design ideas to life.<span></span></p><p>This course will give you the necessary skills to start designing Web content today and realize the dream of turning ideas into reality.</p>", 
    "end_date": null, 
    "title": "Build Responsive Web Designs With No Code Using Macaw", 
    "price": "25.00", 
    "instructors": "Bob Creigh", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711406_3e1f_2.jpg", 
    "course_url": "https://www.udemy.com/no-code-responsive-web-design-with-macaw/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T01:29:20Z"
}