{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">You&#039;re about to learn how to create your own custom business website and blog in a day.</strong>  </p>  <p style=\"\">  \t        Hi, I&#039;m Tom Corson-Knowles, #1 Bestselling author of over 20 books including <em style=\"\">Guest Blogging Goldmine</em> and <em style=\"\">Destroy Your Distractions</em>. I&#039;ve spent the last 10 years building profitable online businesses and have sold several million dollars of products and services online in the last few years.  </p>  <p style=\"\">  \t        But I have a confession to make. I started out as a complete failure.  </p>  <p style=\"\">  \t        I wasted $8,000 paying for a custom website, and almost went broke before I figured out how to create a website <em style=\"\">that actually makes money instead of burns it</em>.  </p>  <p style=\"\">  \t        If I only knew back then what you&#039;re about to learn in this course, I could have done a better job creating a new custom profitable website in just a few hours with less than $100!  </p>  <p style=\"\">  \t                                    This is the course I WISH someone had given to me when I first started blogging 9 years ago.  </p>  <p style=\"\">  \t                                    Since then, I&#039;ve created dozens of successful blogs and websites. I&#039;ve taken a new blog from 0 to over 100,000 visitors a month in just 9 months for free - without spending a single dime on marketing, paid traffic or advertising.  </p>  <p style=\"\">  \t                                    In this course, I&#039;m going to teach you how I did it and how you can, too.  </p>  <p style=\"\">  \t                                    Just do me a favor. Save yourself the $8,000 and do something nice for your family, friends and loved ones. Or save it for your retirement.  </p>  <p style=\"\">  \t<strong style=\"\">Follow Along as We Build Your Brand New Custom Website Together in Just 2 Hours!</strong>  </p>  <p style=\"\">  \t        In this step-by-step video training course, you&#039;re about to learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to design your very own custom website and blog for personal or business use using Wordpress</li>  \t<li style=\"\">How to avoid the 4 biggest mistakes business owners and new bloggers make when creating a new website (Avoiding these common mistakes could save you over $10,000 and months of wasted time and effort)</li>  \t<li style=\"\">How to set up your blog or website to attract new leads and customer for your business on autopilot</li>  \t<li style=\"\">How to get up to 100,000 visitors a month or more for your website using one simple 100% free marketing strategy</li>  \t<li style=\"\">How to connect with the most influential bloggers and entrepreneurs in your market to take your business to a whole new level of success and profitability (again, no cost involved with this life-changing marketing strategy)</li>  \t<li style=\"\">and much more!</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Learn How to Build a Sustainable, Profitable, and Meaningful Online Business and Steady Internet Profits</strong>  </p>  <p style=\"\">  \t        Starting a business online is easier than it&#039;s ever been before. Yet millions of would-be entrepreneurs try and fail to start a profitable online business every year. Why?  </p>  <p style=\"\">  \t        Because they don&#039;t have the <em style=\"\">proven tools, systems and strategies for success.</em>  </p>  <p style=\"\">  \t        This course is a complete &quot;success recipe&quot; for anyone looking to build an online business.  </p>  <p style=\"\">  \t<em style=\"\">When you design your website the right way from the beginning and set up these systems to bring in new leads and customers on autopilot, you&#039;ll be years ahead of your competition (and you&#039;ll save thousands of dollars in the process).</em>  </p>  <p style=\"\">  \t<strong style=\"\">Forget Everything You Think You Know About Building Websites and Making Money Online</strong>  </p>  <p style=\"\">  \t        When I first started my online business 10 years ago, I thought the key to success was using the latest, cutting-edge technology and gadgets. Boy, was I wrong!  </p>  <p style=\"\">  \t<em style=\"\">The key to building a successful online business is to have a highly functional and profitable online website that attracts leads, builds your email list, and converts visitors into paying customers.</em> Period.  </p>  <p style=\"\">  \t        Everything else is just gravy.  </p>  <p style=\"\">  \t        Your website is the backbone of your online business. Sure, you can make a few dollars publishing eBooks on Kindle, selling used stuff on eBay, and following the latest &quot;hot new thing,&quot; but real, lasting success (aka big monthly profits) come from having a business website that makes you money 24/7.  </p>  <p style=\"\">  \t        If you have a website that makes you money, everything else just adds to your online success and profits. But if you have no website and do everything else under the sun, you&#039;ll never reach even a fraction of your potential for profitability, success and influence.  </p>  <p style=\"\">  \t<strong style=\"\">If you&#039;re ready to take your online success to a whole new level and build your custom business website in just 2 hours, scroll up and click &quot;Take This Course&quot; now!</strong>  </p>  <p style=\"\">  \t        You can start watching the video training right away and have your website live and ready to go before the day is over.  </p>  <p style=\"\">  \t        Here&#039;s to your success,  </p>  <p style=\"\">  \t        Tom Corson-Knowles  </p>", 
    "end_date": null, 
    "title": "Build Your Own Custom Wordpress Website and Blog In a Day", 
    "price": "25.00", 
    "instructors": "Tom Corson-Knowles", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378014_c000_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-26T14:38:15Z"
}