{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Design your own Wordpress themes from scratch for fun and profit. </p><p>Have you ever noticed that web designers make money by developing their own themes for Wordpress and selling them on marketplaces like Envato? Well, now you can too! Learn Wordpress theme design from the ground up in this massive Stone River eLearning course. </p><p>Join award-winning veteran trainer Geoff Blake as he takes you through the entire workflow process of scratch-building a WordPress theme using Photoshop! </p><p><strong>About the Course</strong></p><p>The training begins in Photoshop, where you'll be introduced to some setup options and settings to optimize Photoshop for web design. Then, learn about building and using various grid systems, which will serve as the template for the theme layout. Next, it's on to the next phase in the workflow process, wireframing and UI design in Photoshop. Learn how to stay organized and work quickly and efficiently. </p><p>Once the wireframe structure is complete, you'll see how to apply design to the wireframe, and then move the entire layout from Photoshop into the world of code. </p><p>You'll discover how to construct a WordPress theme from the ground up, starting with a completely blank canvas! You'll see a variety of techniques for working between Photoshop, WordPress's architecture, and the HTML, PHP, and CSS code that pulls it all together. </p>", 
    "end_date": null, 
    "title": "Building Wordpress Themes From Scratch with Photoshop", 
    "price": "20.00", 
    "instructors": "Ten Ton  Online", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530600_b5b7_2.jpg", 
    "course_url": "https://www.udemy.com/scratch-building-wordpress-themes-with-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T18:58:52Z"
}