{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<span style=\" color:inherit;\">Discover How to Build Your Own FREE </span><span style=\" color:inherit;\">Money-Making Websites and Squeeze </span><span style=\" color:inherit;\">Pages and Eliminate all the Technical </span><span style=\" color:inherit;\">Obstacles, So You Can Start Seeing </span><span style=\" color:inherit;\">RESULTS in Your Online Marketing!</span>  </p>  <p style=\"\">  \t        If you have been looking to kick start your work-from-home-business and develop an online niche marketing website but are struggling because of technical issues, this course is for you!  </p>  <p style=\"\">  \t        If you&#039;ve bought all the products, followed the courses, have the hard drive full of manuals, Affiliate´s links and PLR products but you are still struggling to make any money online then this course will help you.  </p>  <p style=\"\">  \t        Discovering these simple steps will get your business working and get you back on track to making money. I want to show you how you build the website, the email system and the sign up forms and all the techie stuff. And it&#039;s easier than you might think...In the Online Marketer&#039;s Toolbox, I am going to show you the FREE tools available, so you can put them to use in your business process immediately! THIS IS THE &quot;TOOLBOX&quot; THAT OPERATES THE SYSTEM!  </p>  <p style=\"\">  \t        THE COURSE: What&#039;s waiting here for you is the following:  </p>  <p style=\"\">  \t        You´ll get a pdf manual with step-by-step instructions and an outline of the process of how to set up your own system.  </p>  <p style=\"\">  \t        THE VIDEOS: There are TEN videos in the course, altogether about 90 minutes worth. These are specific to each part of the system; I walk and talk you through the process as well as show you in videos how to actually do these steps. You´ll be looking over my shoulder as we go through everything.  </p>  <p style=\"\">  \t        CHEAT SHEET RESOURCES: I have also included some cheat-sheets, so you have a to-do list, that reminds you of all the steps you need. You can tick them off as you go and build your own blueprint. I show you all the resources you need to get yourself up and running within a couple of hours.  </p>  <p style=\"\">  \t        This really is the simplest way of getting going online. I will show you how to get your website or blog, online, quickly, for free!  </p>  <p style=\"\">  \t        I will show you how to get that site laid out for maximum benefit, how to get your system tools in place and your business strategy in place. I´ll explain in the videos how I do this with simple screen shots that you can just watch and copy. You´ll be looking over my shoulder!  </p>  <p style=\"\">  \t        I´ll give you everything you need to put your system in place and start making sense of all the knowledge you have accumulated. You´ll be able to get your campaigns up and online quickly and start structuring your online business to finally start moving in the right direction.  </p>", 
    "end_date": null, 
    "title": "Build Niche Websites without Techie Hassles!", 
    "price": "20.00", 
    "instructors": "Mark Fea", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251064_8217_4.jpg", 
    "course_url": "https://www.udemy.com/build-niche-websites-using-free-tools-no-techie-hassles/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T18:09:42Z"
}