{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">This course will go up to $129 on January 7th.  Don&#039;t miss out on one of Udemy&#039;s most popular courses.</strong>  </p>  <p>  \t    Over 2000 successful students have taken this course! Sign up today with no risk: 30 day money back guarantee, my promise to you that you will be satisfied with this course.  </p>  <hr style=\"\">  <p>  \t  My friend Stuart wanted to set up a website to sell a face-to-face course he was running.  He&#039;s a bright guy but he&#039;s never really done website and asked me if I could help.  Of course I said yes, and the next day he&#039;d already made several hundred dollars in sales.  </p>  <p>  \t  Nothing involved in making the site was difficult or complicated.  It looks great and takes payments using Paypal, is easy to maintain and we can use Google Analytics to see how many people are visiting and where they&#039;ve come from.  </p>  <p>  \t<strong style=\"\">I challenge you to make your first sale today.</strong>  </p>  <p>  \t  If you have a couple of hours to work through this course you will have your website up and running.  A little bit of promotion on Facebook or Reddit and you can have the cost of this course paid off by the end of the day.  </p>  <p>  \t<strong style=\"\">No coding knowledge or skills needed; just the ability to copy and paste.</strong>  </p>  <p>  \t<em style=\"\">About this course:</em>  </p>  <ul style=\"\">  \t<li style=\"\"><em style=\"\">Over 2,000 very happy students</em></li>  \t<li style=\"\"><em style=\"\"><em style=\"\"><em style=\"\">Tons of </em><em style=\"\">5 Star Reviews from satisfied students</em></em></em></li>  \t<li style=\"\"><em style=\"\">Full, free lifetime access</em></li>  \t<li style=\"\"><em style=\"\">All future extra lectures and upgrades are always included for free</em></li>  \t<li style=\"\"><em style=\"\">Unconditional Udemy 30 day money-back guarantee</em></li>  \t<li style=\"\"><em style=\"\">Direct support; if you have any problems you can contact me direct</em></li>  </ul>  <hr style=\"\">  <p>  \t      In this course you will learn how to make a <strong style=\"\">complete web presence without writing code</strong>.  Your site will include  </p>  <ul style=\"\">  \t<li style=\"\">A completely customised sales landing page with images, texts, feature bubbles and image carousel to <strong style=\"\">entice buyers</strong></li>  \t<li style=\"\">eCommerce through Paypal to <strong style=\"\">accept payment for your product or service straight away</strong></li>  \t<li style=\"\">Google Analytics to know exactly<strong style=\"\"> who is visiting and converting</strong></li>  \t<li style=\"\">Mailchimp for mailing lists to <strong style=\"\">build your brand following</strong> and increase future purchases</li>  \t<li style=\"\">Google apps for business or Zoho mail for <strong style=\"\">professional email</strong> and app solution</li>  \t<li style=\"\">Wordpress blog to provide fresh material to your customers and <strong style=\"\">increase backlinks/SEO</strong></li>  </ul>  <p>  \t<strong style=\"\">And you will have all of this up in less than 3 hours!</strong>  </p>  <hr style=\"\">  <p>  \t  This course is built for entrepreneurs <strong style=\"\">who aren&#039;t developers. </strong>Maybe you&#039;ve just had a great idea you want to test out, or you want to sell your first eBook. Maybe you&#039;ve got an event coming up you want to promote.  I will give you the skills to<strong style=\"\"> experiment with product/service ideas quickly </strong>by being able to throw websites up in less than an hour.<br style=\"\">  </p>  <hr style=\"\">  <p>  \t<em style=\"\">            &quot;Sam has a knack for boiling things down to their simplest levels. He makes the whole process, which could be very daunting, simple. The step by step instructions make it easy to set up a really professional looking website with its own domain and corresponding email addresses and ecommerce ability in no time. It really gives your business, hobby, club or just family online presence a polished look that a me@gmail.com address or service based website can&#039;t. For the price this course is a steal and will be the best money you have spent in a long time.&quot;</em>  </p>  <p>  \t                  5*  </p>  <hr style=\"\">  <p>  \t                                                   &quot;<em style=\"\">Sam makes it all super easy to understand with clear walkthroughs. Perfectly suited to beginner website developer enthusiasts, and a few good tips for more intermediate people (like myself) as well!</em>&quot;  </p>  <p>  \t                  5 *  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">You have a 30 day money back guarantee when you buy this course. </strong>In that time you can go through the entire course and earn the cost back several times over.<strong style=\"\"> If you aren&#039;t satisfied, get a full refund: no questions asked.</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t  Hit the &quot;buy&quot; button now!  </p>", 
    "end_date": null, 
    "title": "Business Website for Beginners and Solopreneurs", 
    "price": "20.00", 
    "instructors": "Sam Atkinson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/221150_00a6_13.jpg", 
    "course_url": "https://www.udemy.com/the-complete-business-or-startup-website-with-almost-no-code/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-17T06:17:17Z"
}