{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t           &quot;Design in the browser&quot;  </p>  <p style=\"\">  \t          &quot;Responsive web design&quot;  </p>  <p style=\"\">  \t          &quot;Mobile first&quot;  </p>  <p style=\"\">  \t          These are all the latest rage in web development and design, but what do they mean? This course will cover these concepts, as well as provide a base knowledge of useful web code. There is much more demand for designers to know how to code. By the end of this course, you will be able to do just that. Even if you are starting from scratch!  </p>  <p style=\"\">  \t      The first part of this course covers basic HTML and CSS. We break down the concepts of this code as well as provide useful code examples to get you started, and have several resources for further research and practice.  </p>  <p style=\"\">  \t      The second portion we will dive into helpful tools to speed up development, how to jumpstart our web code with grids and frameworks, and look into how to make our website mobile friendly--covering both code and concept of responsive design.  </p>  <p style=\"\">  \t    Even if you are not a designer, but want to learn front-end web development, or want to improve your web code skills, you will benefit from this course.  </p>  <p style=\"\">  \t<strong style=\"\">SPECIAL</strong>  </p>  <p style=\"\">  \t          Advanced topic videos are in progress and will be published in March of 2015. While you are waiting, you can purchase this course at 50% off, AND you will get the advanced topics FOR FREE! The price has already been adjusted here. Once the advanced topic videos are added, the price will return to the full amount.  </p>", 
    "end_date": null, 
    "title": "Code for Designers", 
    "price": "50.00", 
    "instructors": "tracy apps", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/345898_f1ba_4.jpg", 
    "course_url": "https://www.udemy.com/code-for-designers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-16T05:00:18Z"
}