{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  Questa è la prima di tre lezioni in cui vi mostrerò la creazione del sito  TUTTO IN MENO DI UN&#039;ORA!  </p>  <p>  \t    Le lezioni che imparerete qui vi permetteranno di fare un sito web o un blog professionale di qualsiasi tipo con qualsiasi aspetto desiderato.  </p>  <p>  \t    In questo video imparerete come acquistare un dominio, come acquistare un account di hosting, come collegare i due, e ad installare WordPress.  </p>  <p>  \t        COME CREARE UN SITO WEB O BLOG: con WordPress, SENZA codifica, sul proprio dominio, in meno di due ore!<br style=\"\">  \t<br style=\"\">  \t        In collaborazione con Make Money from Home LIONS CLUB e Come Creare un Blog o Sito Web.  </p>  <p>  \t<br style=\"\">  \t        NECESSARIO AVERE NESSUNA ESPERIENZA. TUTTE LE ISTRUZIONI SONO DETTAGLIATE AL MASSIMO E PASSO-PASSO, IN MODO CHE CHIUNQUE POSSA CAPIRLE FACILMENTE<br style=\"\">  \t<br style=\"\">  \t        Imparate a fare un sito web professionale o un blog sul vostro dominio in meno di un paio d&#039;ore, usando il Sistema di Gestione di Contenuti più popolare su internet: WordPress.<br style=\"\">  \t<br style=\"\">  \t        Non è necessaria nessuna conoscenza di programmazione per utilizzare WordPress ... se siete in grado di utilizzare Microsoft Word, sarete in grado di creare un sito web professionale con WordPress (WordPress è un software completamente gratuito).<br style=\"\">  \t        Il tutto viene insegnato, passo-passo, in lezioni di questo libro (con link di video lezioni di sostegno per maggiore chiarezza - le video lezioni che mostrano la costruzione di mikeomarwebsites dall&#039;inizio alla fine).<br style=\"\">  \t<br style=\"\">  \t        Con le lezioni insegnate nel mio libro, sarete in grado di creare qualsiasi tipo di sito web che desiderate con qualsiasi tipo di look che si desidera, da blog personali, a siti web aziendali professionali, a siti e-commerce.<br style=\"\">  \t<br style=\"\">  \t        Inoltre, incluso come un capitolo bonus, un&#039;introduzione su come costruire siti web di reddito passivo con WordPress, e come fare soldi online funziona veramente!<br style=\"\">  \t<br style=\"\">  \t        Ecco gli argomenti trattati nel mio libro:<br style=\"\">  \t<br style=\"\">  \t        TECNICO / IMPOSTAZIONE:<br style=\"\">  \t<br style=\"\">  \t        * Il modo più INTELLIGENTE ed ECONOMICO per acquistare un dominio.<br style=\"\">  \t        * Il modo più INTELLIGENTE ed ECONOMICO per comprare un pacchetto di hosting.<br style=\"\">  \t        * Collegare il vostro dominio al vostro account di hosting e l&#039;installare WordPress.<br style=\"\">  \t<br style=\"\">  \t        NOZIONI DI BASE:<br style=\"\">  \t<br style=\"\">  \t        * Introduzione a WordPress e le migliori impostazioni di Search Engine Optimization (SEO), per il vostro sito.<br style=\"\">  \t        * Come aggiungere pagine per i siti web regolari.<br style=\"\">  \t        * Come aggiungere post per i blog.<br style=\"\">  \t        * Come aggiungere immagini e link.<br style=\"\">  \t        * Come impostare una barra laterale con i widget.<br style=\"\">  \t        * Come modificare l&#039;aspetto del vostro sito web con temi diversi.<br style=\"\">  \t        * Come aggiungere un modulo di contatto, plugin e pulsanti di social media.<br style=\"\">  \t<br style=\"\">  \t        NOZIONI AVANZATE:<br style=\"\">  \t<br style=\"\">  \t        * Come installare Google Analytics per il monitoraggio.<br style=\"\">  \t        * Come aggiungere pulsanti &quot;acquista ora&quot; di PayPal.<br style=\"\">  \t        * Come aggiungere un &quot;Google Maps&quot; nel vostro sito web.<br style=\"\">  \t        * Come impostare una mailing list / newsletter (e le migliori pratiche per farlo).<br style=\"\">  \t        * Come proteggere il vostro sito web da parte da hacker, malware ed altri virus.<br style=\"\">  \t        * Risorse per siti e-commerce, ricerca di parole chiave, costruzione di link ed SEO, marketing di affiliazione, siti di appartenenza, esternalizzazione, registrazione video, e molto altro!<br style=\"\">  \t<br style=\"\">  \t        INTRODUZIONE SU COME FARE SOLDI ONLINE:<br style=\"\">  \t<br style=\"\">  \t        * Quali sono alcuni dei metodi più comuni per fare soldi online?<br style=\"\">  \t        * Qual è il modo più semplice per fare reddito passivo online?<br style=\"\">  \t        * Se voglio fare soldi online, come comincio?<br style=\"\">  \t        * La struttura di un sito web di reddito passivo che fa $ 1.000 al mese.  </p>  <p>  \t        Questo libro vi permetterà di costruire un sito web professionale sul proprio dominio in meno di un paio d&#039;ore e vi insegnerà un&#039;insieme di abilità che farà esplodere le possibilità per l&#039;imprenditoria!  </p>  <p>  \t       Mike Omar  </p>", 
    "end_date": null, 
    "title": "Come Creare un Sito Web o Blog con WordPress in Due Ore. ", 
    "price": 0, 
    "instructors": "Mike Omar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/97006_f8d4_4.jpg", 
    "course_url": "https://www.udemy.com/come-creare-un-sito-web-o-blog-con-wordpress/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-25T04:51:24Z"
}