{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  C'est la première de trois leçons où je vous montrerai le processus complet de la contruction du site: Comment Faire un Site Web ou un Blog TOUT EN MOINS D'UNE HEURE!  </p>  <p>  \t    Les leçons apprises ici vous permettra de créer un site web professionnel d'aucune sorte.<br style=\"\">  \t<br style=\"\">  \t    Dans cette vidéo vous apprendrez à acheter un domaine, vous pouvez acheter un compte d'hébergement, connecter les deux comptes, et installer WordPress.  </p>  <p>  \t            COMMENT CRÉER UN SITE WEB OU UN BLOG: avec WordPress, sans codage, sur votre propre nom de domaine, le tout en moins de 2 heures!  </p>  <p>  \t            En association avec Make Money from Home LIONS CLUB et Comment Creer un Site Web ou un Blog.  </p>  <p>  \t            AUCUNE EXPÉRIENCE PRÉALABLE OBLIGATOIRE. ALL YA DES INSTRUCTIONS DÉTAILLÉES ET PLEINEMENT ÉTAPE PAR ÉTAPE DONC N'IMPORTE QUI PEUT SUIVRE FACILEMENT.  </p>  <p>  \t            Apprenez à faire un site professionnel ou un blog sur votre propre nom de domaine en moins de deux heures, et apprenez à faire à l'aide de tout le système de gestion de contenu le plus populaire de l'Internet: le WordPress.  </p>  <p>  \t            Aucune connaissance de codage est nécessaire pour utiliser WordPress ... si vous pouvez utiliser Microsoft Word, vous pouvez faire un site web professionnel avec WordPress (WordPress est un logiciel qui est complètement gratuit).  </p>  <p>  \t            Il est tout appris dans les leçons étape par étape dans ce livre (avec des liens vers des leçons vidéo pour clarté supplémentaire - les leçons vidéo vous montrent toute la constrution de mikeomarwebsites du début à la fin).  </p>  <p>  \t            Avec les leçons enseignées dans mon livre, vous serez en mesure de créer n'importe quel type de site que vous voulez, n'importe quel type de look que vous voulez, à partir de blogs personnels aux sites Web professionnels aux entreprises vers des sites e-commerce.  </p>  <p>  \t            Sont également inclus un chapitre bonus, une introduction à la façon de construire des sites Web de revenus passifs utilisant WordPress, et comment faire l'argent en ligne fonctionne réellement!  </p>  <p>  \t            Voici les sujets abordés dans mon livre:  </p>  <p>  \t            TECHNIQUE / MONTAGE:  </p>  <p>  \t           * La façon la plus INTELLIGENT et MOINS CHER d'acheter le domaine.  </p>  <p>  \t           * La façon la plus INTELLIGENT et MOINS CHER d'acheter un forfait d'hébergement.  </p>  <p>  \t           * Lier votre domaine à votre compte d'hébergement et l'installation de WordPress.  </p>  <p>  \t            BASICS:  </p>  <p>  \t           * Une introduction à WordPress et le meilleur paramètres Search Engine Optimization (SEO) pour votre site web.  </p>  <p>  \t           * Comment ajouter des pages pour les sites Web régulières.  </p>  <p>  \t           * Comment ajouter des messages pour les blogs.  </p>  <p>  \t           * Comment ajouter des photos et des liens.  </p>  <p>  \t           * Comment mettre en place le panneau latéral en utilisant les widgets.  </p>  <p>  \t           * Comment changer l'apparence de votre site web avec des thèmes différents.  </p>  <p>  \t           * Comment ajouter un formulaire de contact, plugins, et les boutons de médias sociaux.  </p>  <p>  \t            ADVANCED:  </p>  <p>  \t           * Comment installer Google Analytics pour le suivi.  </p>  <p>  \t           * Comment ajouter \"acheter maintenant\" boutons de PayPal.  </p>  <p>  \t           * Comment ajouter un carte interactive \"Google Maps\" pour votre site web.  </p>  <p>  \t           * Comment mettre en place une liste de diffusion / newsletter (et les meilleures pratiques pour le faire).  </p>  <p>  \t           * Comment protéger votre site contre les pirates, les logiciels malveillants et autres virus.  </p>  <p>  \t           * Ressources pour les sites e-commerce, faire des recherches de mots clés, le renforcement des liens et de faire SEO, le marketing d'affiliation, sites d'adhésion, l'externalisation, l'enregistrement vidéo, et plus!  </p>  <p>  \t            INTRODUCTION À FAIRE DE L'ARGENT EN LIGNE:  </p>  <p>  \t           * Quelles sont les méthodes les plus courantes pour gagner de l'argent en ligne?  </p>  <p>  \t           * Quelle est la façon la plus simple de faire un revenu passif en ligne?  </p>  <p>  \t           * Si je veux faire de l'argent en ligne, où dois-je commencer?  </p>  <p>  \t           * La structure de un Site de revenu passif du 1000 $ par mois.  </p>  <p>  \t            Ce livre va vous permettre de créer un site web professionnel sur votre propre nom de domaine en moins de deux heures et vous enseigner des compétences qui vos possibilités de Réussir!  </p>  <p>  \t            Vous pouvez également apprendre à construire un portefeuille de sites qui gagnent 5,000.00 $ par mois en revenu passif avec mon plan qui vous montre le processus point par point, à mon Livre électronique LIONS CLUB: COMMENT GAGNER DE L'ARGENT SUR INTERNET.  </p>  <p>  \t<br style=\"\">  \t            Pour apprendre à gagner sa vie avec les blogs, écrire sur un sujet que vous aimez et développer un lectorat fidèle, à mon Livre électronique: COMMENT CRÉER UN BLOG QUE LES GENS LISENT  </p>  <p>  \t            Mike Omar  </p>", 
    "end_date": null, 
    "title": "Comment Creer un Site Web ou Blog avec WordPress en 2 heures", 
    "price": 0, 
    "instructors": "Mike Omar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/92102_10c1_9.jpg", 
    "course_url": "https://www.udemy.com/comment-creer-un-site-web-ou-blog-avec-wordpress/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-13T19:04:15Z"
}