{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  Esta é a primeira de três lições em que lhe mostrarei a criação do site Como Criar Um Blog ou Site tudo em menos de uma hora!  </p>  <p>  \t    As lições que aprenderemos aqui irão permitir-lhe criar um site ou um blog profissional de qualquer tipo com o aspecto que deseje.<br style=\"\">  \t<br style=\"\">  \t    Neste vídeo irá aprender como comprar um nome de domínio, uma conta de hospedagem, como conectar os dois, e instalar o WordPress.  </p>  <p>  \t           COMO CRIAR UM SITE OU BLOG: com WordPress, SEM codificação, em seu próprio domínio, em menos de 2 horas!  </p>  <p>  \t      Em assocation com: Como Criar Um Site ou Blog e Make Money from Home LIONS CLUB and How to Create a Website or Blog.  </p>  <p>  \t      NÃO É NECESSÁRIA NENHUMA EXPERIÊNCIA PRÉVIA . TODAS AS INSTRUÇÕES SÃO TOTALMENTE DETALHADAS E PASSO A PASSO PARA QUE QUALQUER PESSOA POSSA SEGUI-LOS FACILMENTE.<br style=\"\">  \t<br style=\"\">  \t      Aprenda a fazer um site profissional ou blog em seu próprio domínio em menos de um par de horas, usando o Sistema de Gestão de Conteúdo mais popular da Internet: WordPress.<br style=\"\">  \t<br style=\"\">  \t      Não é necessário nenhum conhecimento de codificação para usar o WordPress ... se você consegue usar o Microsoft Word, pode fazer um site profissional com WordPress (WordPress é um software que é totalmente gratuito).<br style=\"\">  \t<br style=\"\">  \t      É tudo ensinado passo-a-passo em lições neste livro (com links para suporte vídeo aulas para maior clareza- as vídeo lições mostram a criação da inteira mikeomarwebsites, do começo ao fim).<br style=\"\">  \t<br style=\"\">  \t      Com as lições ensinadas no meu livro, você será capaz de criar qualquer tipo de site desejado com qualquer tipo de aspeto que você queira, desde blogs pessoais, a sites de negócios profissionais, a sites de comércio eletrônico.<br style=\"\">  \t<br style=\"\">  \t      Also, included as a bonus chapter, an introduction to how to build passive income websites using WordPress, and how making money online actuallyworks! <br style=\"\">  \t      Também, incluído como um capítulo bônus, está uma introdução sobre como construir sites de renda passiva usando o WordPress, e como fazer dinheiro online funciona mesmo!<br style=\"\">  \t<br style=\"\">  \t      Aqui estão os temas abordados no meu livro:<br style=\"\">  \t<br style=\"\">  \t      TÉCNICO / CRIAR:<br style=\"\">  \t<br style=\"\">  \t      * A forma mais INTELIGENTE e BARATA de comprar um domínio.<br style=\"\">  \t      * A forma mais INTELIGENTE e BARATA de comprar um pacote de hospedagem.<br style=\"\">  \t      * Ligar o seu domínio à sua conta de hospedagem e instalar WordPress.<br style=\"\">  \t<br style=\"\">  \t      NOÇÕES BÁSICAS:<br style=\"\">  \t<br style=\"\">  \t      * Uma introdução ao WordPress e melhores configurações de Otimização de motor de busca (SEO) para seu site.<br style=\"\">  \t      * Como adicionar páginas para sites regulares.<br style=\"\">  \t      * Como adicionar postagens para blogs.<br style=\"\">  \t      * Como adicionar imagens e links.<br style=\"\">  \t      * Como configurar uma barra lateral com widgets.<br style=\"\">  \t      * Como mudar o visual do seu site com temas diferentes.<br style=\"\">  \t      * Como adicionar um formulário de contato, plugins, e os botões de mídia social.<br style=\"\">  \t<br style=\"\">  \t      AVANÇADO:<br style=\"\">  \t<br style=\"\">  \t      * Como instalar o Google Analytics para acompanhamento.<br style=\"\">  \t      * Como adicionar botões &quot;comprar agora&quot; de PayPal.<br style=\"\">  \t      * Como adicionar um &quot;Google Maps&quot; interativo para o seu site.<br style=\"\">  \t      * Como configurar uma lista de discussão / newsletter (e melhores práticas para fazê-lo).<br style=\"\">  \t      * Como proteger seu site de hackers, malwares e outros vírus.<br style=\"\">  \t      * Recursos para sites de comércio eletrônico, fazer pesquisa de palavras-chave, fazer construção de link e SEO, marketing de afiliados, sites de adesão, terceirização, gravação de vídeo, e muito mais!<br style=\"\">  \t<br style=\"\">  \t      UMA INTRODUÇÃO PARA FAZER DINHEIRO ONLINE:<br style=\"\">  \t<br style=\"\">  \t      * Quais são alguns dos métodos mais comuns para fazer dinheiro online?<br style=\"\">  \t      * Qual é a maneira mais simples de fazer uma renda passiva online?<br style=\"\">  \t      * Se eu quiser fazer dinheiro online, por onde começo?<br style=\"\">  \t      * A estrutura de um site de renda passiva que produza $ 1.000 por mês.<br style=\"\">  \t<br style=\"\">  \t      Este livro permitir-lhe-á construir um site profissional em seu próprio domínio em menos de um par de horas E ensinar-lhe- á um conjunto de habilidades que irão abrir completamente as suas possibilidades para o empreendedorismo!  </p>  <p>  \t       Você também pode aprender meu Plano de Acção, Make Money from Home LIONS CLUB, em formato ebook! Para aprender a construir passo-a-passo um portfolio de sites de renda passiva em formato ebook que renda pelo menos $ 5.000 por mês, clique aqui: Como Ganhar Dinheiro na Internet  </p>  <p>  \t<br style=\"\">  \t       Meu outro ebook: COMO CRIAR UM BLOG QUE AS PESSOAS QUEIRAM LER: Como criar uma website, escrever sobre o que você gosta, desenvolver uma rede de leitores fiéis, e ganhar muito dinheiro: Como Criar um Blog  </p>  <p>  \t       Mike Omar  </p>", 
    "end_date": null, 
    "title": "Como Criar um Site ou Blog com WordPress em 2 horas.", 
    "price": 0, 
    "instructors": "Mike Omar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/91252_9683_6.jpg", 
    "course_url": "https://www.udemy.com/como-criar-um-site-ou-blog-com-wordpress/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-11T22:16:57Z"
}