{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Newly updated Feb/2015!  Early-launch pricing won&#039;t last long!</strong> The <u style=\"\">Complete WordPress Mastery Course</u> is Udemy&#039;s most popular guide to creating, promoting and monetizing an attractive, money-making WordPress website. It consists of 11 Udemy short courses which, combined, have attracted 27,000 students who have left  150+ four- and five-star reviews.  </p>  <p>  \t                      The reason our training is so popular is that it proceeds briskly and logically from simple to more advanced topics, always with a focus on practical results.  Our videos show you what you need to know, and no more.  They are also very comprehensive, with in-depth coverage of many topics that are usually only covered in specialized courses -- topics such as the best commercial themes, SEO, shopping carts and membership systems, newsletter management and auto-responder systems, simple graphics creation and editing, and much more.  Our courses are designed for small-business owners, entrepreneurs, virtual assistants, even web designers who want to make the leap to designing professional WordPress websites as quickly as possible.  </p>  <p>  \t                       Here are the mini-courses included (you can purchase some of these separately as well -- search Udemy by course name):  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">WordPress Essentials for Business</strong>: Udemy&#039;s most popular WordPress fast-start beginner training sequence.  We build an attractive website for a client of ours, covering all key concepts and 95% of the WordPress user-interface -- all in 90 minutes!</li>  \t<li style=\"\"><strong style=\"\">WordPress Theme Selection &amp; Customization</strong>: Commercial themes are critical to the creation of a professional-looking website.  We build sample sites using 6 of the web&#039;s most popular commercial theme families.</li>  \t<li style=\"\"><strong style=\"\">WordPress eCommerce Part 1: WooCommerce</strong>:Learn how to collect money for your products or services, including digital downloads (ebooks and videos).  This is also a comprehensive tutorial to the most popular WordPress shopping cart plugin, WooCommerce</li>  \t<li style=\"\"><strong style=\"\">WordPress Backup, Performance and Security</strong>: Keep your site backed-up, secure, and functioning at peak performance</li>  \t<li style=\"\"><strong style=\"\">Images &amp; Graphic Editing</strong>: Learn how to design and modify attractive graphic headers and other elements using free tools</li>  \t<li style=\"\"><strong style=\"\">Advanced Content Creation</strong>: Learn some powerful content editing tools such as Windows Live Writer, master the WordPress visual editor, and more</li>  \t<li style=\"\"><strong style=\"\">WordPress SEO</strong>: Learn about Meta-tags, search-engine algorithms, Google Places, Google Analytics, and more through an actual case-study</li>  \t<li style=\"\"><strong style=\"\">WordPress eCommerce Part 2: Payment Systems, Shopping Carts, Membership Systems</strong>: Learn about merchant accounts (other than PayPal), other WordPress shopping cart systems, and WordPress membership systems such as the powerful and popular commercial WishList Member plugin</li>  \t<li style=\"\"><strong style=\"\">Newsletters, Auto-responders, RSS-to-email systems</strong>: Various ways to add a newsletter / auto-responder system to your website</li>  \t<li style=\"\"><strong style=\"\">Online Video Production, Editing and Distribution</strong>: Latest tools and technologies to make online video for your website</li>  \t<li style=\"\"><strong style=\"\">WordPress Social Media Integration</strong>: Add share buttons, follow-me, Facebook comments, etc.</li>  </ul>  <p>  \t      As an added bonus, find out how to get high-performance managed WordPress hosting at 1/3 of the going rate by watching the free-preview &quot;Hosting WordPress&quot; Video #6 (in Section 1) below.  </p>  <ul style=\"\">  </ul>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "Complete WordPress Mastery Course (eCommerce, Marketing...)", 
    "price": "50.00", 
    "instructors": "Marc Beneteau", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/52821_e7a0_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-07T22:44:07Z"
}