{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>¿DE QUÉ SE TRATA EL CURSO?</p><p>Cuando diseñas páginas web, debes crear tus diseños en programas gráficos como photoshop o illustrator. La pregunta es ¿Cómo paso mis diseños a un lenguaje de marcado HTML y a hojas de estilo CSS?. Si te has hecho esta pregunta, este curso es para ti. En este curso aprenderás a pasar tus diseños hechos en photoshop a lenguajes de maquetación web HTML5 y CSS3 de una manera fácil y efectiva.</p><p>¿CÓMO ES EL CURSO?</p><p>Utilizando el método de las ayudas visuales, la maquetación de cajas principales e internas para elaborar un correcto wireframe, y finalmente integrando los elementos gráficos realizaremos así la estructura del sitio web para internet en el lenguaje de marcado HTML5 y hojas de estilo CSS3.<br></p><p>En este curso podrás descargar una carpeta donde está todo el material necesario para la elaboración del mismo. </p><p>¿CUÁNTO SE TARDA EN COMPLETAR EL CURSO?<br></p><p>Depende de ti. Estimo que menos de una semana puedes completar el curso, pero dependerá de tu ritmo de trabajo y de tu disponibilidad.</p><p>¿CUÁLES SON LOS REQUISITOS?<br></p><p>Descargar el material que se encuentra en los recursos de la clase 1.<br></p><p>¿A QUIÉN VA DIRIGIDO ESTE CURSO?</p><p>Diseñadores gráficos, visuales, artistas, desarrolladores</p><p>Empresas y emprendedores</p><p>Cualquier persona que quiera tener una página web</p>", 
    "end_date": null, 
    "title": "Convierte diseños hechos en Photoshop a HTML5 y CSS3", 
    "price": "20.00", 
    "instructors": "Docente Juan Fernando Urrego", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749262_08d8_2.jpg", 
    "course_url": "https://www.udemy.com/convierte-disenos-hechos-en-photoshop-a-html5-y-css3/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T19:36:14Z"
}