{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Course Objectives</strong></p><p style=\"\">To take a static HTML website that fails Google&#039;s &quot;mobile-friendly&quot; test and convert it into a slick, responsive, mobile-friendly website that looks great on desktop, tablet and mobile phone browsers.  You can watch the entire conversion process &quot;over-my-shoulder&quot; and see how this type of conversion is possible without losing current rankings, and with zero site downtime.</p><p style=\"\"><strong style=\"\">Who is the course for?</strong></p><p style=\"\">This course is for anyone that needs to convert an HTML site into a mobile-friendly Wordpress site to be compliant with Google&#039;s upcoming algorithm change. </p><p style=\"\">The course does not require any previous knowledge of HTML or Wordpress.</p><p style=\"\"><strong style=\"\">Why is this important?</strong></p><p style=\"\">In April 2015, Google is going to introduce an algorithm update that effectively penalizes sites that do not display well in mobile browsers (that&#039;s mobile phones and tablets).  Older HTML sites are not typically optimized for mobile devices, so they will suffer in the search engines.<br style=\"\"></p><p style=\"\">If you have old HTML sites that you want to keep, now is the time to think about converting them to Wordpress.  This course can take you step-by-step through the entire process.</p><p style=\"\"><strong style=\"\">So why Wordpress?</strong></p><p style=\"\">Wordpress offers a platform that is easy to set up and offers responsive site themes out of the box. If you convert your site to Wordpress, you&#039;ll not only have a great looking website, you&#039;ll also have one that is responsive!  That means the site looks great in any browser on any device - mobile phone, tablet or desktop computer.  The beauty of Wordpress is that it takes care of the technical stuff, you just concentrate on your site content.  Now you don&#039;t need to be a designer.</p><p style=\"\">If you are concerned about the upcoming changes to Google&#039;s algorithm and how they will affect your HTML site, then this course is for you.  Within a few hours, you&#039;ll have a beautiful, responsive site that Google will reward.</p><p style=\"\"><strong style=\"\">What&#039;s in this course?</strong></p><ol style=\"\"><li>This course starts off with an introduction, telling you why it is important to make the switch to a responsive theme.  </li><li>I&#039;ll then introduce you to one of my old HTML websites, built a long time ago when SEO had very different rules. During this upgrade to Wordpress, I&#039;ll also be cleaning it up and bringing the SEO up to date.</li><li>You&#039;ll then see an easy way of collecting a list of URLs on the site, and using a spreadsheet, organize them to help the conversion go smoothly.</li><li>After installing Wordpress, you&#039;ll learn how to make it invisible to the search engines until you are ready to switch it on.  </li><li>You&#039;ll also learn the simple strategy to make sure your site has ZERO downtime during the conversion.</li><li>Once the site has been ported over to Wordpress, you&#039;ll learn how to make the switch, and test the new site to make sure everything is as it should be.  You&#039;ll even be able to go to Google, search for your pages and click on the old HTML pages and be redirected to the new version of that page on the Wordpress site.</li></ol><p>So, what are you waiting for?  Let&#039;s start to convert your site.</p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Convert an HTML Site to Wordpress for Better Search Rankings", 
    "price": "20.00", 
    "instructors": "Andrew Williams", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443748_be6e_5.jpg", 
    "course_url": "https://www.udemy.com/convert-html-site-to-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T13:36:03Z"
}