{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>You have a website. People arrive, get information, and leave. That's not what you want.</p><p>WishList Member is a cheap, well-supported and long-established WordPress plug-in that protects your premium content within an easy-to-set-up membership structure.</p><p>There are many reasons why you may want to consider starting a membership site:</p><ul><li>Make money from your content – you can charge monthly, a one-off fee or a pay per post basis</li><li>Protect your content – maybe there is sensitive information on your business or clients you need to hide</li><li>Collect email addresses – to turn a “visitor” into a “subscriber”</li></ul><p>A membership site puts a “wall” around content that people have to register to access it.</p><p>A membership site can create communities. It can also provide a simple, but robust, payment gateway for the sale of digital products such as software, e-books or courses.</p><p>In this course you will learn how to:</p><ul><li>Set up WishList Member (you can have your membership site up and running by watching the firs 10 minutes of video)</li><li>How to protect content – both pages and parts of pages</li><li>How to integrate with email marketing platforms (such as Aweber)</li><li>Integrates with shopping cart systems (such as PayPal)</li><li>How to optionally add a premium widget (WishList Registration Widget) to streamline the registration process on free sites</li></ul><p>Learn how to set up a membership site and start earning passive income quickly and easily!</p>", 
    "end_date": null, 
    "title": "Create a Membership Site with WishList Member and WordPress", 
    "price": "20.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/129830_2610_8.jpg", 
    "course_url": "https://www.udemy.com/create-membership-site-wishlist-member-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-06T01:26:39Z"
}