{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t                               Welcome to <strong>\"Create a Free, Professional Website in Minutes with Weebly</strong><strong>\"</strong>, a comprehensive course that will teach you how to build an attractive website that you can use to promote your business, event, yourself, or even your own Udemy course!  </p><p><strong>100% 5/5 Star Reviews</strong></p>  <p>  \t<strong>***June 2015 Update: Over 1000 Students Currently Enrolled!*** </strong></p>  <p>  \t<strong>How is the course structured?</strong>  </p>  <p>  \t                               This course will start with a basic introduction to Weebly, where I will explain what Weebly is and what it can be used for. Next, the course will take an interactive approach to teaching as you will follow along while I create a website using all of Weebly's various elements. After watching a short lesson on each element, I encourage you to add that element to your own website and experiment with the settings. Together we will create our websites. The course will then look at adding/removing pages and changing your website's styling. The course will conclude with an exploration of Weebly's additional features including e-commerce (if you want to add a store to your page), blogging, and a variety of Weebly's premium features including custom domain names.  </p>  <p>  \t<strong>  How long will the course take?  </strong>  </p>  <p>  \t                             Following this course, your website will be published in less than 10 minutes. If you watch every lesson and then try it for yourself, this course should take you no longer than one day to complete. However, this is an introductory-level course. It can take significantly longer to master the concepts presented.  </p>  <p>  \t<strong>Is this course for me?</strong>  </p>  <p>  \t                             Do you have a business, course, event, or whatever that doesn't have a website and you don't know where to start? <strong>This is the course for you. </strong>At the conclusion of the course, you will have a <strong>functional </strong>and<strong> friendly</strong> website with <strong>NO CODING REQUIRED. </strong>I strongly encourage you to at least try it!  </p>  <p>  \t                             If you find that it's not for you, there is a 30-day money back guarantee.  </p>  <p>  \t<strong>Enroll now and have your new website online TONIGHT!</strong>  </p>  <p>  \t       Thanks for looking and I can't wait to have you in class!  </p>  <p>  \t<strong>-Chase Miller</strong>  </p>", 
    "end_date": null, 
    "title": "Create Professional Websites in Minutes with No Coding", 
    "price": "20.00", 
    "instructors": "Chase Miller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375686_c4bc_5.jpg", 
    "course_url": "https://www.udemy.com/create-a-free-professional-website-in-minutes-with-weebly/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T17:02:12Z"
}