{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<span style=\" color:rgb(0, 0, 0);\">Are you an artist who falls into one or more of the following categories?</span>  </p>  <ul style=\"\">  </ul>  <ol style=\"\">  \t<li style=\"\">You don&#039;t have a website for your artwork, and you know you need one  in order to get your work out into the world, but feel overwhelmed and  don&#039;t know where to start.</li>  \t<li style=\"\">Maybe you already have a website but you know that it doesn&#039;t represent you or your work as well as it could.</li>  \t<li style=\"\">You are looking to boost your income by selling your work  online. You don&#039;t want a &quot;store&quot; per se but something integrated into  your online portfolio.</li>  </ol>  <h5 style=\"\">  <p style=\"\">  \t   These days creating a website doesn’t have to be expensive or time consuming. Learn how to photograph your artwork, carefully select and register a website domain name, set up hosting and work with Wordpress to make and maintain your own website. Designing web pages, setting up a blog, creating an online portfolio, and even adding the ability to sell online will also be covered. With the help of a professional designer and artist, participants will gain the confidence and knowledge needed for producing and nurturing an engaging, visually appealing website that enhances their brand!  </p>  </h5>", 
    "end_date": null, 
    "title": "Create a portfolio website for your artwork", 
    "price": "20.00", 
    "instructors": "Warren Croce", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170052_2158_2.jpg", 
    "course_url": "https://www.udemy.com/portfoliowebsite/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T15:31:01Z"
}