{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Impara a <strong>creare un e-commerce professionale</strong> e perfettamente funzionante con Wordpress e WooCommerce. Scopri <strong>come scegliere e personalizzare la grafica </strong>del tuo negozio e <strong>aggiungere nuove funzionalità e dettagli senza l'uso di plugin</strong> esterni. </p><p>Impara a far <strong>interagire i tuo negozio con i social network </strong>e a sfruttare la loro potenzialità <strong>per le tue strategie di marketing</strong>. </p><p><strong>A CHI E' RIVOLTO IL CORSO:</strong></p><ul><li><strong><em>Imprenditore:</em></strong> se sei un imprenditore e vuoi ampliare i confini del tuo business questo è il corso che fa per te. Impara come vendere online correttamente, creare il tuo shop online e iniziare a guadagnare e a proporre il tuo prodotto a miliardi di persone;</li><li><strong><em>Web Developer: </em></strong>se sei uno sviluppatore web, un freelance o una web agency e vuoi scoprire come creare e-commerce da offrire ai tuoi clienti, grazie a questo corso potrai capire come sfruttare WooCommerce e Wordpress e personalizzare le loro funzionalità per creare negozi dalle infinite possibilità;<strong><em></em></strong></li><li><strong><em>Privato: </em></strong><span>se sei un privatoo uno studente e vuoi conoscere, apprendere e scoprire il mondo della creazione degli e-commerce per magari, iniziare un nuovo business online o intraprendere una nuova carriera lavorativa, grazie a questo corso, che parte dalla basi e tocca anche gli argomenti più complessi, potrai scoprire come realizzare uno shop online;</span></li></ul>", 
    "end_date": null, 
    "title": "Creare un e-commerce con Wordpress: la guida completa", 
    "price": "50.00", 
    "instructors": "Federica Canton", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650360_6642_2.jpg", 
    "course_url": "https://www.udemy.com/guida-woocommerce-creare-ecommerce-con-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-25T13:05:05Z"
}