{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<em>\"I've already started setting up my site while I'm learning because I'm new to wordpress but it's easier than I expected! Thank you!\"</em> - Chris Livingston  </p>    <p>  \t<strong>Have you ever wanted to create your own website but don't know how to code?  \t</strong>  </p>  <p>  \t      Good news, you're in the right place!  </p>  <p>  \t      This course is designed to walk you step-by-step through setting up your own <strong>WordPress website without any experience or coding required</strong>.  </p>  <p>  \t      Specific action steps are included to walk you through setting up your website so <strong>by the end of this course you will have launched your very own WordPress website!</strong></p><p><em><strong>Over 74 million websites use WordPress. And almost 50% of the top blogs are built on WordPress. Do you know how to use WordPress to get ahead?</strong></em></p>  <p>  \t      As a web designer for over 10 years, I'm here to help you get your website online. I'm here to show you exactly how everything in WordPress works. No fancy terminology or complex methods used here. Just exactly what you need to know to set-up a fully functioning website.  </p>    <p>  \t<em>\"I have gone through a number of basic WordPress courses on Udemy and this is my favorite so far. I liked the included term definitions and resources as well as practical examples such as setting up email list. Good site example.\" - </em>Christopher Kearney  </p>    <p>  \t<strong>  Get Ready to Cover:</strong>  </p>  <ul>  \t<li>How to set-up a nicely designed site so <strong>you will save thousands of $</strong> on hiring a designer.</li>  \t<li>How to add new functionality to your website so <strong>you will save even more $</strong> on not having to hire a developer.</li>  \t<li>How to quickly and easily update and manage your own website without having to hire someone to do it for you.</li>  \t<li>How you can <strong>start earning money tomorrow</strong> by setting up websites for others.</li>  \t<li>And lots more!</li>  </ul>    <p>  \t<em> \"Excellent training course, one of the best around, if not the best.\"</em> - Brad  </p>    <p>  \t<strong>My Guarantee</strong>  </p>  <p>  \t                                                                                                            I personally guarantee you will be able to set-up your own WordPress website today without ever touching any code.  </p>  <p>I make myself available so you will have access to me if you have questions or need feedback along the way. You're not in this alone!  </p>  <p>  \t<strong>  Click the 'Take This Course Now' button </strong>in the top right of your screen to  get your website online today.  </p>", 
    "end_date": null, 
    "title": "Create a WordPress Website for Your Web Design Business", 
    "price": 0, 
    "instructors": "Christine Maisel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/149006_b92e_8.jpg", 
    "course_url": "https://www.udemy.com/create-wordpress-website-for-your-web-design-business/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-19T03:20:54Z"
}