{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\"><span style=\"\">Student Reviews :</span></span>  </p>  <p style=\"\">  \t<em style=\"\"><span style=\"\">&quot;Perfect! </span></em><em style=\"\">This just what I was looking for. </em><em style=\"\">Thanks for the very practical and clear instruction. Am looking forward to implement it.&quot;</em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;I am not finished with this course yet and I already like it. Great course for creating multilingual sites using WordPress...&quot;</em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;Braulio made a quite advanced and well documented course. Lessons are clear and easy to follow. Valuable tips and info for anyone building a website. I strongly recommend.&quot;</em>  </p>  <p style=\"\">  \t<strong style=\"\">Learn how to build websites in multiple languages and get the following skills under your belt :</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Configure Wordpress and activate the Multisite feature</li>  \t<li style=\"\">Create a network of sites using either sub-domains or subfolders</li>  \t<li style=\"\">Master the ’Network Administration’ dashboard</li>  \t<li style=\"\">Install language files and change a site to any language</li>  \t<li style=\"\">Associate posts written in different languages (plugin)</li>  \t<li style=\"\">Show a list of available languages (widget)</li>  </ul>  <p style=\"\">  \t             In this course you will learn how to setup and configure a network of language sites using the Wordpress content management system.  </p>  <p style=\"\">  \t                      I’ll walk you thru the process of installing and activating the Wordpress multisite feature. We’ll connect the sites using plugins and associate the posts written in different languages and we’ll look at the settings and configurations that give you complete control over your Multilingual network of sites.  </p>  <p style=\"\">  \t                      In the end you will know the step-by-step process of how you can have your content seamlessly connected between all your preferred languages.  </p>", 
    "end_date": null, 
    "title": "Create Multilingual Websites using Wordpress and Multisite", 
    "price": "20.00", 
    "instructors": "Braulio Patricio", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138536_7924_9.jpg", 
    "course_url": "https://www.udemy.com/multilingual-website-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-27T15:28:40Z"
}