{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">  Learn how to create websites that adjust to any screen size while optimizing download speeds.  </strong>  </p>  <ul style=\"\">  \t<li style=\"\">HTML5, CSS3, and Media Queries</li>  \t<li style=\"\">HTML5Shiv for Internet Explorer</li>  \t<li style=\"\">Photoshop Image Optimization and Slicing</li>  \t<li style=\"\">Design Adaptations for Various Screens</li>  </ul>  <p style=\"\">  \t<strong style=\"\">  Create Websites that are Optimized for All Screens  </strong><br style=\"\">  \t  Because people use a variety of devices to access the Internet, it&#039;s important that, as a website designer, you know how to create a site that will conform to any screen size. Today&#039;s websites should be able to resize and rearrange elements and content automatically so that any user on any device from anywhere in the world can access your site and browse it with ease. And building a website that&#039;s compatible with the many browsers available from both the past and the present is also an integral part of launching a strong site.  </p>  <p style=\"\">  \t  Not every website designer knows how to create these &quot;intelligent&quot; websites. With the right training, you can differentiate yourself from the competition and potentially expand your client base.  </p>  <p style=\"\">  \t<strong style=\"\">  Contents and Overview  </strong><br style=\"\">  \t  In just 1.5 hours and through 11 lectures, you&#039;ll learn all that you need to know to create a dazzling website using CSS3 and HTML5. You&#039;ll understand how to make your site backwards compatible with old browsers, and how to set it up using CSS rules so that it will adjust itself to any screen size while optimizing download speeds. This course, which is ideal for web developers, graphic designers, usability experts, and interaction designers, will even provide you with CSS, HTML, and Photoshop templates that you can use to design your own sites.  </p>  <p style=\"\">  \t  Upon successful completion of this course, you&#039;ll be confident in your abilities to design a customized website that&#039;s optimized to work on any computer or mobile device. From the creation of CSS files to the design of a site&#039;s layout, text, and graphics, you&#039;ll be fully versed in launching a site that&#039;s going to appear just as you intended, regardless of what screen your visitors will be using.  </p>", 
    "end_date": null, 
    "title": "Creating Responsive Web Design", 
    "price": "20.00", 
    "instructors": "Chris Converse", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8814_0329_5.jpg", 
    "course_url": "https://www.udemy.com/creating-responsive-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-07-29T09:19:39Z"
}