{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">**********************************************************************************</strong>  </p>  <p>  \t<strong style=\"\">Over </strong><strong style=\"\">5849</strong><strong style=\"\"> Students Registered - Don&#039;t Be Left Out!</strong>  </p>  <p>  \t        **********************************************************************************  </p>  <p>  \t<strong style=\"\">Create Your First Website Using Wordpress</strong> is a course for people who want to learn how to create their own website from scratch. <strong style=\"\">My approach is designed for people who never created a website in the past. </strong>  </p>  <ul style=\"\">  \t<li>You will learn how to select your domain name</li>  \t<li>You will register your discounted hostgator coupon code (udemyleaders)</li>  \t<li>You will effortlessly install Wordpress</li>  \t<li>You will learn how to write posts, format, add pictures, links and access an unlimited amount of free template</li>  </ul>  <p>  \t            Whether you want to create a personal blog or a professional website, this course will teach you how to create your own website so you don&#039;t have to be dependent on web designers and programmers.  </p>  <p>  \t            By following the <strong style=\"\">step by step videos</strong>, you will be able to complete your website in no time.  </p>  <p>  \t            You can follow at your own paced but the faster you go the faster you&#039;ll have a website in your hands. Become a website owner by the end of this course by following a simple 3 step process.  </p>  <ol style=\"\">  \t<li>Domain Name</li>  \t<li>Hosting</li>  \t<li>Website Creation</li>  \t<li><strong style=\"\">(Bonus) Customization Module</strong></li>  </ol>  <p>  \t            Take this course if you are serious about learning and taking actions to reach your goal. I&#039;m offering you value and actionable action steps that you can follow at your own pace. You do not need to know how to do programming, design or anything like that.  </p>  <p>  \t            In <strong style=\"\">Create Your First Website Using Wordpress</strong>, we focus on teaching you everything that you need to know to get started online and create your first website. Action is this key phrase and if you are willing to take action you will have an amazing time with our community and together we are going to <strong style=\"\">create some amazing websites</strong> in this lifetime.  </p>  <p>  \t<strong style=\"\">Disclaimer</strong><br style=\"\">  \t            We cannot guarantee results because they are based on your actions but I can guaranteed that if you take no actions, you will see no results. I do also guaranteed that this information is accurate, valuable and professional at the time of publishing. By the end of the course you should have the basic knowledge needed to <strong style=\"\">create your first website using Wordpress</strong>.<br style=\"\">  \t<br style=\"\">  \t         There is no risk to you since the course is free. Go ahead and give it a try.  </p>", 
    "end_date": null, 
    "title": "Create Your First Website Using Wordpress", 
    "price": "20.00", 
    "instructors": "Steven Leconte", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/152460_fdb7_3.jpg", 
    "course_url": "https://www.udemy.com/create-your-first-website-using-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-25T04:12:01Z"
}