{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  This course will teach you how to make your own website layout. You will use web design principles, learn about colors and creating your own buttons and  icons. All this with an amazing free design program called Inkscape! <br style=\"\">  \t<br style=\"\">  \t               If you take part in the course, <strong style=\"\">you will also receive the source file of both of the templates</strong> and the fonts used, so you can experiment and modify it!*<br style=\"\">  \t        During the course I am creating the website layout for a florist shop,  but I encourage you to create a site design straight  for your own  business, or own hobby! Because what I show you is not about flowers! It  is about creating, learning design principles and learning to use  Inkscape!  </p>  <p>  \t              This course is about designing a graphical layout for a website.<br style=\"\">  \t              So the course is NOT about creating CSS and HTML templates!  <br style=\"\">  \t<br style=\"\">  \t            The course starts with 13 videos and it takes about 90 minutes to complete! Of course, as with my other courses, I will be here to answer your questions and add more videos if you need it!<br style=\"\">  \t<br style=\"\">  \t            Go on, download Inkscape for free now, and start to create your own design!  </p>  <p>  \t      *Sadly, I can not give you the photo, as I don&#039;t own the rights. Find a good photo that is matching your design idea instead!<br style=\"\">  \t<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Create your graphics for a responsive website with Inkscape!", 
    "price": "25.00", 
    "instructors": "István Szép", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339686_c31e.jpg", 
    "course_url": "https://www.udemy.com/web-design-with-inkscape/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T07:45:35Z"
}