{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Last Updated: December 3rd</strong>  </p>  <p>  \t<strong style=\"\">JOIN 950+ STUDENTS ALREADY LEARNING HOW TO CREATE THEIR OWN YOUTUBE LIKE WEBSITE!</strong>  </p>  <p>  \t<br style=\"\">  \t<span style=\" text-decoration:underline;\"><strong style=\"\"></strong></span><strong style=\"\">UPDATE: Premium template is provided for you create your website.</strong>  </p>  <p>  \t                                   When YouTube launched in 2005, no one could have imagined that it would become such a successful website. Today, Youtube is the #3 website in the world pulling in over 1 billion visitors each month...that&#039;s a lot of people. One of the biggest reasons why YouTube became so popular is because video is the most powerful way to present anything.  </p>  <p>  \t                                   Here are some amazing stats about Youtube:  </p>  <ul style=\"\">  \t<li>More than 1 billion unique users visit YouTube each month</li>  \t<li>Over 6 billion hours of video are watched each month on YouTube—that&#039;s almost an hour for every person on Earth</li>  \t<li>100 hours of video are uploaded to YouTube every minute</li>  \t<li>80% of YouTube traffic comes from outside the US</li>  \t<li>YouTube is localized in 61 countries and across 61 languages</li>  \t<li>According to Nielsen, YouTube reaches more US adults ages 18-34 than any cable network</li>  \t<li>Millions of subscriptions happen each day. The number of people subscribing daily is up more than 3x since last year, and the number of daily subscriptions is up more than 4x since last year</li>  </ul>  <p>  \t<strong style=\"\">What is this course about?</strong>  </p>  <p>  \t                                   This course will teach you step by step how to create a website similar to YouTube. So if you&#039;ve ever wanted to launch a YouTube like site, you will be able to at the end of the course.  </p>  <p>  \t<strong style=\"\">Who is this course for?</strong>  </p>  <p>  \t                                   This course is for people, organizations agencies or companies that want to build their brand by presenting amazing video content. Users will be able to upload or import their videos through their admin panel, create playlists, give thumbs up or down for videos, embed videos, and so much more.  </p>  <p>  \t                                   While it&#039;s a good idea to post your videos on YouTube, it would be just as good to drive a ton of traffic by having people visit your website and watching the videos without having to go somewhere else. This is great for SEO and brand visibility.  </p>  <p>  \t<strong style=\"\">Monetizing Your Site</strong>  </p>  <p>  \t                                   You will learn how to monetize your site with Google Adsense or banners simply by inserting your codes in whatever position you want to show ads. This will give you complete control over what ads show on your website.  </p>  <p>  \t<strong style=\"\">Website and Video Optimization</strong>  </p>  <p>  \t                                   This course will teach you how to optimize your site, menus, vidoes, and content pages. This will increase your visibility on search engines like Google, Bing and Yahoo!.  </p>  <p>  \t<strong style=\"\"><strong style=\"\">Your website will have the following features:</strong></strong>  </p>  <ul style=\"\">  \t<li>Drag &amp; Drop and remote video upload</li>  \t<li>Frames preview for local videos</li>  \t<li>User channels and multi-channel support</li>  \t<li>Video and playlist like/dislike voting</li>  \t<li>Playlist embedded into the player</li>  \t<li>Multi-category and Joomla 3 Tags component</li>  \t<li>Custom fields for videos and channels</li>  \t<li>Responsive design</li>  \t<li>Easy-to-use interface inspired by YouTube</li>  \t<li>Front-end management for user and admin</li>  \t<li>Social media sharing (Facebook, Twitter, Google+, Email)</li>  </ul>  <p>  \t<strong style=\"\">What&#039;s Next?</strong><br style=\"\">  \t                               Click &quot;take this course&quot; button, top right, now...that&#039;s it!  </p>", 
    "end_date": null, 
    "title": "Create a Video Sharing Website Like Youtube With Joomla", 
    "price": "20.00", 
    "instructors": "Mathew Tamin", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/299464_febd_2.jpg", 
    "course_url": "https://www.udemy.com/create-a-video-sharing-website-like-youtube-with-joomla/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-13T05:00:16Z"
}