{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Curso de Wordpress</strong><br></p><p>Este curso te permitirá, <strong>sin conocimientos previos</strong>, <strong>crear una web, (y en desarrollo un foro o una tienda online) con Wordpress</strong> para tu organización o para ti. Esto lo hago con una metodología paso a paso para que puedas hacerlo todo a la vez que yo.</p><p>El curso está en constante crecimiento, con nuevos vídeos y nuevas secciones. Por lo que si algo cambia o se añade a Wordpress en el futuro, pretendo seguir manteniendo el curso al día.</p><p><strong>¿Qué es lo que vas a aprender en este curso?</strong></p><ul><li>Configuración inicial. <strong>Nivel básico</strong><span></span><ul><li>Registro de un dominio y un hosting explicando paso a paso todo el proceso.</li><li><span></span>Instalación desde cero de Wordpress paso a paso.</li><li><span></span>Modificación del aspecto y configuración inicial.</li></ul></li><li>Puesta a punto de plugins fundamentales. (en desarrollo)</li></ul><p><strong><strong></strong></strong></p><p><strong><strong></strong></strong></p><p><strong><strong></strong></strong></p><p><strong><strong>Duración del curso</strong></strong></p><p>El curso está en constante crecimiento, por lo que cada vez durará más, pero por ahora en tan sólo <strong>3 horas,</strong> con <strong>acceso de por vida</strong> a los vídeos y con <strong>garantía de devolución</strong> serás capaz de comprender y ejecutar la creación de una web e iniciarte en el mundo del desarrollo web.<br></p><p>El curso enseña con un lenguaje cercano cómo crear una web desde la elección del nombre de la web hasta su publicación en internet sin necesidad de conocimientos previos.</p><p>\"<strong>¡Creacion de una web desde cero con Wordpress!</strong>\" te dará una visión clara sobre cómo funciona la creación de una web. Después de haber completado el curso, tendrás los conocimientos que te permitirán ser capaz de crear tus propias páginas con Wordpress, el CMS utilizado en el 23,4% de los sitios webs de internet (datos de diciembre de 2015).</p>", 
    "end_date": null, 
    "title": "Creacion de una web desde cero con Wordpress sin requisitos", 
    "price": "20.00", 
    "instructors": "Miguel Angel Terron", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685880_52ec_6.jpg", 
    "course_url": "https://www.udemy.com/puesta-en-marcha-de-una-web-desde-cero-con-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-01T09:06:32Z"
}