{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn how to use WordPress to build your own flexible and dynamic website in this comprehensive introductory course. No prior experience necessary!    </p><ul>  \t<li><em>WordPress is web software you can use to create a beautiful website or blog. It's the largest self-hosted blogging tool in the world, used on millions of sites and seen by tens of millions of people every day.</em></li></ul><p>  \t                                  Whether you plan to build your own WordPress website or hire a WordPress developer to help you, understanding the basics of how WordPress works will help you build and maintain a better website!  </p><p><strong>HOW IS THIS COURSE DIFFERENT?</strong>    </p><p>  \t                                  My name is Kathleen, and I've been teaching technology to beginners under the moniker <strong><em>Robobunnyattack!</em></strong> since 2009. I believe that with the right approach, anyone can learn anything.  </p>  <p>  \t<strong>My goal in this course is to help you develop an intuitive understanding of how to use WordPress to build your own website.</strong>  </p>  <p>  \t                                  In this course, we'll explore the many configuration options, functions and features available in the self-hosted version of WordPress. As we work together, I'll explain WHY and HOW things work in WordPress, so you can <strong>learn more quickly and with more confidence.</strong>  </p>  <p>  \t                                  As we discover WordPress together, we'll cover:  </p>  <ul>  \t<li>How to handle basic WordPress site administration</li>  \t<li>Adding and formatting content the RIGHT way</li>  \t<li>Using images, video and audio smartly</li>  \t<li>How WordPress can help you better organize your website's content</li>  \t<li>When, why and how to apply important updates in WordPress</li>  \t<li>How to select and install WordPress themes and plugins</li>  \t<li>And so much more...!</li>  </ul>  <p>  \t<strong>By the end of this course, you'll be able to configure, edit and update a WordPress site with confidence, following best practices every step of the way!</strong>  </p>  <p>  \t                                  Here's just a sample of what my (awesome!) students have to say about this course:  </p>  <p>  \t<em>\"This course is perfect if you are totally new to Wordpress as it will give you a very firm foundation on the key skills required to make Wordpress work for you.\" —Kieran</em>  </p>  <p>  \t<em>\"I've worked a bit with WordPress here and there over the years, but RoboBunny certainly has filled in many of the missing parts and I have a much better understanding.\" —Kimberly M.</em>  </p>  <p>  \t<em>\"I love how the tutorials are divided into such specific sections. I can watch the ones I need to learn and simply skip the things I already know... perfect set up and clear, detailed explanations.\" —Steve L.</em>  </p>  <p>  \t<em>\"I really feel like I understand Wordpress now, and I got through it in a night!\" —Sean B.</em></p><p><em></em><strong>WHAT'S INCLUDED?</strong>    </p><ul>  \t<li>This course includes lifetime access to over 4½ hours of step-by-step videos.</li>  \t<li>You'll also get supplementary text lectures and links to helpful resources.</li></ul>  <p>  \t<em>    BONUS: I've also included a FREE bonus section (\"SECTION 13: Publishing your website\") explaining how web publishing works. If you don't already have webhosting where you can install WordPress, you can start there!  </em></p><p><em></em><strong>HOW LONG WILL IT TAKE ME?  </strong>    </p><ul>  \t<li>This completely depends on your availability and learning preference. You can work through all the video lectures in one afternoon, or pace yourself over several days or weeks — it's up to you!</li></ul><p><strong>  WHAT IF THIS COURSE ISN'T FOR ME?  </strong>  </p>  <ul>  \t<li>This course comes with an <strong>unconditional 30-day Udemy-backed guarantee</strong>. Try out this course for 30 days and see for yourself if my approach to learning how to use WordPress is right for you. If you're not 100% satisfied with this course, simply request a full refund within 30 days — no conditions, no questions asked!</li>  </ul>  <p>  \t                                  I'm confident you'll LOVE this course, and I'm excited to help you learn. <strong>Enrol now and you can start building your very own WordPress website today!</strong>  </p>  <p>  \t<em>—Kathleen Farley (aka Robobunnyattack!)</em>  </p>  <hr>", 
    "end_date": null, 
    "title": "Create, Update and Manage Your Own Website Using WordPress", 
    "price": "40.00", 
    "instructors": "Kathleen Farley", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/106168_4dd4_5.jpg", 
    "course_url": "https://www.udemy.com/getting-to-know-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-15T14:37:12Z"
}