{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t         + + + + + + ++ + <em><strong>Join Over 800 other students TODAY!!</strong></em> +  + + + + + + + + +  </p>    <p>  \t                                                                                                                      Learn from scratch how to create <strong>Modern</strong>, <strong>Professional</strong>, and in <strong>Demand</strong> websites using HTML and CSS. These two languages are the foundation of <em>\"every\" </em>website.  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>\"Learn Step by Step How to Create a Modern, Professional, In Demand, and Real World Website that a Business Owner wanted to Pay $3,500 for.\"</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <ul>  \t<li>Build a fully functional 4 page website with HTML and CSS</li>  \t<li>Learn HTML (HTML5) and CSS (CSS3) the easy way</li>  \t<li>Learn how to use and implement CSS style sheets</li>  \t<li>Learn how to validate your HTML and CSS</li>  \t<li>Write clear, clean, efficient, and standard compliance code</li>  \t<li>Quizzes to reinforce understanding of each section</li>  \t<li>BONUS lectures</li>  \t<li>Start your very own Portfolio</li>  </ul>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>The Power of HTML and CSS</strong>  </p>  <p>  \t                                                                                                    Gain the knowledge, skills, and experience to dominate the competition by creating Modern and Professional websites. Step by step you will create a real world website that a business owner wanted to pay $3,500 for. HTML and CSS are the two most important languages when it comes to web development. Having a solid knowledge of both opens many other doors for you. Even if someone else builds your websites, you should have a basic knowledge of HTML and CSS so that you can update / modify your existing pages if need be.  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>        Content and Overview  </strong>  </p>  <p>  \t                                                                                                  This course has over 9 hours of hands on content that will teach you a solid foundation of writing clean,efficient, and standard compliant HTML and CSS. We first understand the foundation of HTML before moving into the presentation of CSS.  </p>  <p>  \t                                                                                                  We begin working on our course project (Dental Doctors) as early as <em>S</em><em>ection 3</em>. This is a modern and professional website you will learn how to create throughout the course. As we learn new concepts, we'll immediately apply them to our project website updating it as we move along. By the end of the course you will have a modern, profession, and complete website in which you can edit and use as the first project in your portfolio.  </p>  <p>  \t                                                                                                If you're thinking about becoming a freelance web developer, seeking a job as a web developer, taking a web development certification test, etc. HTML and CSS are fundamental skills that are required, and you WILL LEARN those skills in this course. You'll make your money back in just a single project. <strong>NOTHING to lose, EVERYTHING to GAIN!</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>Join Today and Receive:</strong>  </p>  <ul>  \t<li><strong></strong>unlimited access </li>  \t<li>bonus lectures and updates at no additional costs</li>  \t<li>my personal help, recommendations, and advice (usually respond within 24hrs)</li>  \t<li>30-day money back guarantee, No Questions Asked!!</li>  </ul>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>ENROLL NOW</strong>, and start dominating the competition. The longer you wait, The more clients you will lose. Get started NOW!!</p>", 
    "end_date": null, 
    "title": "Creating Modern Websites from Scratch using HTML & CSS", 
    "price": "45.00", 
    "instructors": "Thas R. Eagans", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267608_12f6_3.jpg", 
    "course_url": "https://www.udemy.com/creating-modern-websites-from-scratch-using-html-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T21:21:03Z"
}