{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><p style=\"\"><ul style=\"\"><li style=\"\"><span style=\"\">Are you a  Lawyer, Doctor, Consultant, Trainer, Charted Accountant, Surgeon, Chef,  Photographer, Designer, Musician, Counselor, Choreographer and you need a website  for showcasing your work!!</span><br style=\"\"></li><li style=\"\"><span style=\"\">OR Are you  Running a Salon, Dance Studio, Gym, Creche, Bakery, Boutique, School,  Institute, Law firm, Restaurant, NGO, Jewellery business, Handicraft Business  and you need a website for promoting your business!!</span><br style=\"\"></li><li style=\"\"><span style=\"\">OR Are you  hosting any Event, Function or Party and you need a website for inviting &amp;  reaching out to more people!!</span><br style=\"\"></li><li style=\"\"><span style=\"\">OR Is it  your Marriage, Birthday or Anniversary of someone close in your family &amp;  friends and want to create a website as a surprise gift or for your own  marriage as an invitation card!!</span><br style=\"\"></li><li style=\"\"><span style=\"\">OR Are you  planning to start your Online Video Blogs, Comics Strip or Magazine  subscription and you want to do this via the website!!</span><br style=\"\"></li><li style=\"\"><span style=\"\">OR Are you a  college student and you want to create a website for your Class, Department,  Project work or College Fest!!</span><br style=\"\"></li></ul></p>                        <p style=\"\">And have you  been looking for web programmer!! Who can make an awesome website for your  work, business, event, or any other thing!! You need not find anyone now  because you can create a great looking website on your own in just 1 day  without writing any code.</p>    <p style=\"\">The biggest  advantage to create it on your own is that, you never have to be dependent on  any programmer and you can save loads of money. You can update your website  anytime you want. This course is specially designed for Nontechnical people who  knows nothing about website creation &amp; programming, So each step is  explained in very simple &amp; clear way. You can build your websites in  numerous designs, I will show you a few of them:</p>    <p style=\"\">In this “Making a Website in A Few Hours  without Any Coding” course you will learn:</p>    <p style=\"\"><ul style=\"\"><li style=\"\"><span style=\"\">How to book  a domain</span><br style=\"\"></li><li style=\"\"><span style=\"\">How to  create a website with customized content</span><br style=\"\"></li><li style=\"\"><span style=\"\">How to add  videos, photos, forms, Documents, presentations, slide shows, Social Networking  buttons and various other elements.</span><br style=\"\"></li><li style=\"\"><span style=\"\">How to make  your website look attractive, And</span><br style=\"\"></li><li style=\"\"><span style=\"\">A brief info  about how to make a quick demo video about your business, work, event or for  any other thing.</span><br style=\"\"></li></ul></p>                    <p style=\"\">You can also  take this course if you want to make some decent money in your free time.  Create beautiful websites for small scale vendors &amp; make money.</p>    <p style=\"\">So take this Making a Website class and  create a beautiful website on your own in just 1 day without any coding.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Create a beautiful website in a few hours without any coding", 
    "price": "20.00", 
    "instructors": "Pratik Soni", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/24866_4f69_8.jpg", 
    "course_url": "https://www.udemy.com/create-beautiful-website-in-few-hours-without-any-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-16T15:46:43Z"
}