{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t    Create your own website for your small business using WordPress! This course focuses on creating a simple website--from the ground up. Before we even get started designing the site, we&#039;ll go over the details of your business, content creation, and basic branding. After that, we&#039;ll set up hosting, a domain name, and install WordPress--then we&#039;ll get to designing, installing plugins, and getting everything up and running! Oh, and there&#039;s NO coding!  </p>  <p style=\"\">  \t<strong style=\"\">Note:</strong> This course is very NON-technical and focuses more on the &quot;why&quot; behind making a website than the &quot;how&quot; of the technical aspects. This way you create a website that is geared toward your <em style=\"\">dream</em> client and that sells your products and services--not just a pretty website that does nothing for you. <strong style=\"\">If you&#039;re looking for a technical course on how to create a website, this course is NOT for you.</strong> If you&#039;re looking for an easy-to-follow course on how to create a simple website that sells your products and services, sign up!  </p>  <p style=\"\">  \t<strong style=\"\">This course includes:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">A resource list of websites, products, and services that I use and love</li>  \t<li style=\"\">Worksheets to help keep your website and business on track and focused around your goal--selling products and services</li>  \t<li style=\"\">Short videos that cover one topic at a time--so you can find exactly what you need and work at your own pace</li>  </ul>  <p style=\"\">  \t<strong style=\"\">This course is designed for:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Busy entrepreneurs and indie business owners who can&#039;t afford to hire out website design and development--or who just want to learn to do it themselves without investing a huge amount of time or money</li>  \t<li style=\"\">Small business owners who already have a website, but find it&#039;s not selling their products or services as well as it could be</li>  \t<li style=\"\">And it&#039;s mostly geared towards ladies, as there&#039;s a lot of pink, but men will find the content useful too!</li>  </ul>  <p style=\"\">  \t <em style=\"\">Note: This course relies heavily on the Genesis Framework and the Gravity Forms plugin. These are premium WordPress themes and plugins. Other options are mentioned, but the videos and instructions will feature these premium options. While it&#039;s possible to get a lot out of this course without making these investments, I highly recommend them if you want to create a professional website. Links to these resources are included in the course material.</em>  </p>", 
    "end_date": null, 
    "title": "Create a WordPress website for your creative business", 
    "price": "20.00", 
    "instructors": "Erin Flynn", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62885_244f_3.jpg", 
    "course_url": "https://www.udemy.com/creative-business-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-28T22:43:24Z"
}