{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Ce cours va vous permettre de maitriser parfaitement Wordpress. Il est destiné aux débutants en la matière ; je vous expliquerai donc tout, pas à pas ! </p><p>Vous saurez mettre en ligne, gérer et développer votre site internet de façon complètement autonome et en ne payant quasiment rien (il existe des méthodes pour ne rien payer [en terme d'hébergement et de nom de domaine], je les explique aussi). </p><p><strong>Pourquoi suivre ce cours ?</strong><br></p><ol><li>Vous <strong>deviendrez autonome</strong> et pourrez<strong> créer et développer un site internet facilement </strong>sans connaissances techniques.</li><li>Vous allez <strong>gagner énormément de temps</strong> : je vais vous donner toutes mes techniques, et vous faire partager toutes mes connaissances sur Wordpress. <em>Ce que j'ai appris en plusieurs années, vous l'apprendrez en quelques heures.</em></li><li>Vous allez suivre un <strong>cours dynamique et vidéo</strong>. Je ferai mon possible pour que vous ayez sans cesse envie d'apprendre (<em>j'ai investi dans du</em><em> matériel vidéo et audio, rien que pour vous !)</em></li><li>Vous allez créer <strong>5 sites internet</strong> très différents durant nos TP, de façon à ce que vous mettiez en pratique ce que nous viendrons d'apprendre.</li><li><strong>Vous ne risquez rien</strong> : s'il ne vous plait pas, faites-le-vous rembourser dans les 30 jours.</li><li><strong>J</strong><strong>e reste à votre entière disposition</strong> sur le forum si vous avez des questions ou des remarques : je suis très réactif !</li><li>Vous allez souscrire à un <strong>cours susceptible d'évoluer</strong> avec encore plus de contenu !</li></ol><p><br></p><p>Arrêtez de vous poser des questions, et <strong>faites un choix que vous ne regretterez pas</strong> lorsque vous saurez (enfin !) créer des sites internet ! </p><p><strong>Rejoignez-nous dans ce cours</strong> !</p><p>À tout de suite ! :-)</p><p>Étienne<br></p>", 
    "end_date": null, 
    "title": "Créez des sites avec WordPress ! - Débutants", 
    "price": "35.00", 
    "instructors": "Etienne de Saint Victor", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/714364_8a78_2.jpg", 
    "course_url": "https://www.udemy.com/creer-un-site-professionnel-en-15-minutes-avec-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-03T13:00:11Z"
}