{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>CSS is one of the main foundation languages for much of the content on the internet today. Along with HTML and JavaScript, CSS is used to form what we see on the internet. </p><p>Perfect for beginners, and people who want to refresh their skills to learn more about CSS is and how to use it.</p><p>Knowing how to apply CSS is an excellent skill to have. CSS is everywhere and by the end of this course you will have what you need to use it on your own webpages.</p><p>We walk you through step by step with detailed explanations of code and more. We add and update a webpage from scratch adding CSS to bring it to life and completely change the way it looks.</p><ul><li>no wasted time watching someone type</li><li>practice with coding exercises</li><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>source files downloadable to work along</li><li>challenges and lessons and code samples</li><li>code snippets</li><li>Links to top resources to save time</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul><p>We teach you the latest techniques and tools to use in order to create amazing web content.</p><p>Everything you need to know is included in this course.</p><p>Learn at your own pace, lifetime access to this course.</p><p>We show you how to write CSS code, easy to learn. Our tutorials are easy to follow and effective in teaching CSS.</p>", 
    "end_date": null, 
    "title": "CSS beginner Easy way to Get started with better web design ", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629084_2639.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-css-beginners-guide-to-css-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T19:13:59Z"
}