{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Here is a sobering fact.</strong><span> According to a Forbes article </span><em style=\"\">more than half of SMB owners (52%) in the US do not have a website.</em>  </p>  <p>  \t          The main reason for that is…they find it difficult to absorb and use the readily available free technology like WordPress to make them work for their business.  </p>  <p>  \t<em style=\"\">This course seeks to end that. </em>  </p>  <p>  \t<strong style=\"\">I have modelled this course in such a way that anyone wanting to start a WordPress website right from scratch will find it easy to do.</strong>  </p>  <p>  \t          It is a complete guide for you if you wish to customize a WordPress theme to create your own design. I have shown how you can customize the Twenty Thirteen theme to create different theme designs for your or your clients’ needs.  </p>  <p>  \t          There is a lot more to gain from my course.  </p>  <p>  \t          Specifically you will be able to:  </p>  <ol style=\"\">  \t<li>Redesign and customize any WordPress theme to create own unique theme<br style=\"\">  \t</li>  \t<li>Create child theme and add duplicate theme files without touching code<br style=\"\">  \t</li>  \t<li>Apply advanced CSS techniques to easily alter design parameters like colors, background, fonts, images, etc.</li>  \t<li>Use highly relevant and useful free plugins for enhancing website performance</li>  \t<li>Source great-looking images and fonts for free</li>  \t<li>Create posts and pages, and design navigation menu, and so much more.</li>  </ol>  <p>  \t<strong style=\"\">In short, my course is your first hand-held guide to start your own website with WordPress. </strong>  </p>  <p>  \t          Step in now, and learn my course.  </p>  <p>  \t<em style=\"\">Boost your business online. </em>  </p>", 
    "end_date": null, 
    "title": "Customize WordPress Theme Like A Pro - A Complete Guide", 
    "price": "20.00", 
    "instructors": "Partha Bhattacharya", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327856_2017_3.jpg", 
    "course_url": "https://www.udemy.com/customize-wordpress-theme-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T03:55:24Z"
}