{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t¿Estás considerando la idea de crear un blog, pero no tienes idea de cómo hacerlo? ¿Temes que sea muy costoso o muy complicado?  </p>  <p style=\"\">  \t¿Sabías que hay una manera sencilla y gratis de crear un blog?  </p>  <p style=\"\">  \tEl curso <em style=\"\">Cómo </em><em style=\"\">C</em><em style=\"\">rear un Blog </em><em style=\"\">Gratis </em><em style=\"\">en </em><em style=\"\">Google </em><em style=\"\">Blogger</em> te explica cómo hacerlo.  En este curso—basado en el libro que lleva el mismo nombre—aprenderás, paso a paso y de forma estructurada, como puedes hacer tu propio blog utilizando la excelente plataforma provista por Google.  </p>  <p style=\"\">  \tHace varios años atrás, el crear y mantener un blog requería bastante conocimiento técnico y una gran inversión de dinero.  Pero eso quedó en el pasado.  Las herramientas tecnológicas disponibles en la actualidad permiten que cualquier persona con conocimientos básicos del manejo de la computadora y el Internet pueda crear su propio blog y tener presencia en línea.  Y lo mejor de todo es que se puede hacer todo esto con cero inversión de dinero.  </p>  <p style=\"\">  \tExiste mucha información gratuita en el Internet sobre cómo crear blogs utilizando Blogger.  No obstante, esta información en la mayoría de los casos está incompleta, fragmentada, o simplemente es difícil de entender para un principiante debido a que carece de una estructura organizada y lógica.  </p>  <p style=\"\">  \tEl curso <em style=\"\">Cómo </em><em style=\"\">C</em><em style=\"\">rear un Blog </em><em style=\"\">Gratis </em><em style=\"\">en </em><em style=\"\">Google </em><em style=\"\">Blogger</em> está estructurado como si fuera un taller práctico.  Las lecciones han sido ordenadas cuidadosamente siguiendo una secuencia lógica, y el lenguaje utilizado para transmitir las mismas es sencillo de entender.  En su exposición, el autor va creando un blog junto contigo y explicando cada paso realizado frente a tus ojos, de manera que puedas tener una idea mas clara de cómo ejecutar el procedimiento demostrado en cada lección.  </p>  <p style=\"\">  \tA medida que vayas realizando las lecciones y completando las tareas, aprenderás:  </p>  <ul style=\"\">  \t<li style=\"\">Cómo crear una cuenta en Blogger.</li>  \t<li style=\"\">Cómo realizar la configuración básica del blog.</li>  \t<li style=\"\">Cómo crear entradas sencillas, con foto y con vídeo.</li>  \t<li style=\"\">Cómo utilizar las etiquetas para clasificar las entradas por tema.</li>  \t<li style=\"\">Cuál es la diferencia entre una entrada y una página, y para qué se usa cada una.</li>  \t<li style=\"\">Cómo seleccionar una plantilla para tu blog y personalizarla a tu gusto.</li>  \t<li style=\"\">Cómo realizar ajustes al diseño de tu blog.</li>  \t<li style=\"\">Cómo añadir gadgets a diversas áreas del blog.</li>  \t<li style=\"\">Cómo vincular tu blog a la red de Google+.</li>  \t<li style=\"\">Cómo utilizar el sistema de comentarios de Google+ en tu blog..</li>  </ul>  <p style=\"\">  \tSi sigues paso a paso las lecciones del curso <em style=\"\">Cómo </em><em style=\"\">C</em><em style=\"\">rear un Blog </em><em style=\"\">Gratis </em><em style=\"\">en </em><em style=\"\">Google </em><em style=\"\">Blogger</em>, al finalizar el mismo habrás creado tu propio blog y tendrás el conocimiento básico necesario para explorar temas mas avanzados en cuanto al desarrollo de blogs en Blogger, e incluso otros sistemas mas avanzados como Wordpress.  </p>  <p style=\"\">  \t<span style=\"\">¿Qué esperas?  ¡Adquiere este curso y comienza a crear tu blog hoy mismo!</span>  </p>", 
    "end_date": null, 
    "title": "Cómo Crear un Blog Gratis en Google Blogger", 
    "price": "30.00", 
    "instructors": "Ángel Candelaria", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421062_7976_3.jpg", 
    "course_url": "https://www.udemy.com/curso-blogger/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T14:22:11Z"
}