{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Entre un <strong>20%</strong> y un <strong>30%</strong> de <strong>todos los sitios del mundo</strong> utilizan <strong>Wordpress</strong> como plataforma gracias a su facilidad de uso y versatilidad.</p><p>Una de las razones del éxito de Wordpress se debe a su <strong>sistema de Plugins</strong>, que le permite a los desarrolladores agregar funcionalidades adicionales a un sitio web <strong>sin tener que modificar el código fuente de Wordpress</strong>.</p><p>En este curso aprenderás <strong>paso a paso</strong> cómo crear <strong>tus propios plugins</strong> para Wordpress, para que puedas darle \"super poderes\" cualquier sitio web que utilice esta plataforma.</p><p>En el curso desarrollaremos <strong>8 plugins</strong> distintos desde cero para que vayas consolidando tu aprendizaje con diversos ejemplos y código para descargar.<br></p><p>Algunas de las temáticas que veremos:</p><ul><li>Estructura básica de un plugin.</li><li>Utilizar <strong>filtros</strong> y <strong>acciones</strong> para que nuestro código se ejecute en el momento correcto.</li><li>Cómo cargar artículos de la base de datos.</li><li>Utilizar <strong>Shortcodes</strong> para darle superpoderes a nuestro blog.<br></li><li>Cómo agregar <strong>atributos adicionales</strong> a los artículos y a las cuentas de usuarios.</li><li>Creación de <strong>widgets</strong> interactivas desde cero.</li><li>Cómo crear nuestras propias pantallas de opciones administrativas.</li><li>Uso de <strong>Ajax</strong> y librerías JavaScript externas incluyendo <strong>JQuery</strong>.</li><li>Widgets del panel de administración.</li><li>Cómo programar tareas con <strong>Cron</strong>.</li><li>Cómo crear y trabajar con <strong>nuevas tablas</strong> en nuestro sitio.</li><li><strong>Ciclo de vida de un plugin</strong>: activación, desactivación y desinstalación.</li></ul><p>Para este curso <strong>no se requiere experiencia previa utilizando ni programando en Wordpress</strong>, en ese sentido partimos 100% desde cero! Lo que sí requerimos son conocimientos básicos de <strong>PHP</strong> y <strong>MySQL</strong>.</p><p>Este curso es impartido por <strong>Pablo Farías Navarro</strong>, founder de Zenva y Super Colegio. Al igual que todos los cursos de Zenva, se sigue la ya exitosa metodología de <strong>aprender haciendo</strong>, la cual ha posicionado nuestros cursos como todo un referente en el mundo del E-Learning.</p><p>No esperes más para liberar el potencial creativo que llevas dentro, <strong>COMIENZA HOY :)</strong><br></p>", 
    "end_date": null, 
    "title": "Desarrollo de Plugins para Wordpress para Principiantes", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50529_840a_5.jpg", 
    "course_url": "https://www.udemy.com/plugins-de-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-19T13:22:35Z"
}