{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Este curso trata acerca del desarrollo web <strong>Responsive</strong>, es una guía paso a paso, con palabras simples y desde el principio para enseñar a los estudiantes del mismo, todo lo que se puede realizar con <strong>HTML5</strong> y <strong>CSS3</strong>, además con el uso de <strong>Bootstrap</strong> y <strong>JQuery</strong>. Es decir, <strong>TODO EN UN MISMO CURSO SIN FRAGMENTAR LOS CONOCIMIENTOS.</strong><br></p><p>No es necesario que los estudiantes tengan bases sobre <strong>HTML</strong> y <strong>CSS</strong>, ya que a su propio ritmo irán desarrollando las habilidades, mediante los ejemplos planteados en cada video-clase, además se plantea una referencia para que el estudiante lea la aplicación técnica de cada elemento estudiado si así lo deseara.</p><p>Algo <strong>Importante </strong>a mencionar es que, este curso plantea un currículo que yo lo llamo empaquetado, es decir, quita todo contenido innecesario, que se suele encontrar en otros cursos, y solo enseña de una manera eficaz <strong><em>TODO</em></strong> lo mismo sin la necesidad de tantas vueltas, la idea es simple, en vez de dedicarme a redundar y repetir las mismas cosas en todos los vídeos, me dedico a avanzar en las clases, porque es lógico, <strong>¡si tienes el contenido en vídeo, lo puedes repetir la veces que sea!</strong>... Y te soy sincero, he revisado varios cursos que enseñan lo mismo, y son tan largos que en vez de enseñar, aburren y aturden al estudiante con tanto tema, en vez de simplificar el problema del aprendizaje lo amplifican. Además este curso en particular plantea una manera de enseñar partiendo desde las bases técnicas y prácticas del código HTML y CSS, hasta el desarrollo de tu propio sitio web siguiendo los ejemplos planteados, este curso no te dejará tan solo con los conocimientos generales, sino que te enseñará a desarrollar un sitio web por tu misma cuenta. <strong>¿Necesitas más razones para inscribirte?</strong>... Ahí te van.</p><p>La duración del curso depende prácticamente del estudiante, ya que a su propio ritmo podrá ir entendiendo la aplicación práctica de cada lección del curso, pero se espera que cada estudiante culmine el curso en un mes o mes y medio teniendo ya desarrollada su propia web y ésta subida a un servidor.</p><p>El curso empieza enseñando las bases de <strong>HTML</strong>, y dando ejemplos de cada elemento <strong>HTML</strong> que se puede utilizar, luego se pasa al código <strong>CSS</strong> en el cual se establecen las propiedades que el alumno podrá aplicar para generar sus propios estilos, por consiguiente se enseña lo que es la <strong>Web Responsive</strong> usando el <strong>Framework Bootstrap</strong> para luego ya pasar a la aplicación práctica de todos estos conocimientos generando una web propia, al finalizar la web se enseña a insertar contenido dinámico <strong>JavaScript</strong> con <strong>JQuery</strong>, y una vez teniendo la web lista, se enseña a subir esta web en un Servidor o Hosting usando dos métodos. El curso finaliza con el tema de <strong>Posicionamiento SEO</strong> en el cual se enseñará las bases de éste, para que nuestra web se indexe en los buscadores.</p><p>Este es un curso completo con vídeos en los cuales se enseña por pasos y de forma práctica cada uno de los elementos, propiedades, atributos, valores y su uso para el desarrollo de una web, además de todos los conocimientos técnicos que se debe tener para que nuestra web esté correctamente realizada, así que <strong><em>¿POR QUÉ NO INSCRIBIRSE EN ESTE CURSO?.</em></strong></p>", 
    "end_date": null, 
    "title": "Desarrollo Web Responsive para principiantes", 
    "price": "20.00", 
    "instructors": "Alfredo Alejandro Zaldumbide Garcia", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717664_266c_4.jpg", 
    "course_url": "https://www.udemy.com/html-responsive-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T22:07:39Z"
}