{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Why design your own website template when you can just purchase a theme or template right??.......WRONG!</strong>  </p>  <p>  \t      The problem with purchasing a website template is that often dozens,100s, or even 1000s of others can purchase the exact same website template as you and use the duplicate design for their website.  </p>  <p>  \t      I personally have come across several occasions when I recognise a template that 1 website is using from other websites I have visited and even some of my own!  </p>  <p>  \t<strong style=\"\">Enter Adobe Photoshop......</strong>  </p>  <p>  \t      The beauty of using photoshop to design and create your own website template or sales page is that you can now be as creative as you wish to be. No longer are you tied to what is available to sale to everyone else.  </p>  <p>  \t      You can create you own page designs for your own HTML website, clickbank sales letter page or even for wordpress or any other platform ( although we will not be covering wordpress and the like within this course)  </p>  <p>  \t    Now you can be as creative as your imagination allows and rest in the knowledge that your design is © Copyright to you!  </p>  <p>  \t    Here is just some of what this cool course will teach you:  </p>  <ul style=\"\">  \t<li>How to design any web page you can think of within Photoshop</li>  \t<li>Preparing photoshop for the page design process</li>  \t<li>Sectioning and diving your web page into web ready images</li>  \t<li>Exporting your website into HTML ready to Upload to the internet.</li>  </ul>  <hr style=\"\">  Remember that there is absolutely NO risk to you. You are covered by the Udemy No quibble Money Back Guarantee for a full 30 days. If the course does not teach you exactly what it promises to then simply request a refund, It&#039;s as simple as that.  <p>  \t<span>Enroll Now! .... and I will see you on the inside......</span>  </p>", 
    "end_date": null, 
    "title": "Design a Kick-Butt HTML Web Page or Mini Site With Photoshop", 
    "price": "20.00", 
    "instructors": "LearnCadia - Learning Unlimited!", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394180_9b10_3.jpg", 
    "course_url": "https://www.udemy.com/design-your-own-html-website-or-salesletter-with-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T18:20:20Z"
}