{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t      In this course I will show you how to design a pixel-perfect, beautiful website design using the Adobe photo editing (Photoshop) and vector editing (Illustrator) applications  – I will also show you how to do most of the same with the free tool GIMP.  </p>  <p style=\"\">  \t      This course would be extremely useful for <strong style=\"\">graphic designers</strong> and <strong style=\"\">web designers</strong> who want to show their clients exactly what they&#039;ll get before they start developing the website  </p>  <p style=\"\">  \t      By creating and amending any web page to look exactly the way the client wants, you can start charging in excess of <em style=\"\">$3000 and much more</em> for every website you produce  </p>  <p style=\"\">  \t      Because clients <strong style=\"\">will pay extra</strong> for the custom  feel that you will give their websites  </p>  <p style=\"\">  \t      Are you worried that you won&#039;t be able to deliver on the development of this website afterwards? <strong style=\"\">Well, don&#039;t worry! </strong>  </p>  <p style=\"\">  \t      Because I will show you the tricks to change beautiful WordPress themes (we use the Genesis sample child theme) in a browser using Developer Tools that will be then be easy to develop after client has passed the design.  </p>  <p style=\"\">  \t      You will also learn  loads of extra tricks in Photoshop, Illustrator and GIMP:  </p>  <ul style=\"\">  \t<li>I will teach you how to keep the Photoshop layers and elements in order and label them correctly</li>  \t<li>I will teach you how to group layers to further organise your layers in the layer palette</li>  \t<li>I will teach you how to use vectors (live text, shape layers and vector smart object) where ever possible – as resizing them won&#039;t lose you any quality or resolution</li>  \t<li>I will teach you how to use vector smart objects because they won&#039;t lose you any quality after resizing either and you have the added advantage of editing one and all the others changing accordingly</li>  \t<li>I will teach you how to select multiple layers in the layer palette</li>  \t<li>And I will teach you how, with multiple layers selected with the Move tool (V), you can distribute and align the objects by using the buttons in the option bar at the top</li>  </ul>  <p style=\"\">  \t      And by the time the course is finished you will be able to work up an exact visual replica of any website, mobile app, tablet app or any sort of digital interface that you care to imagine  </p>  <p style=\"\">  \t      Join me on my new course Designing a Website using Photoshop, Illustrator and GIMP.  </p>  <p style=\"\">  \t       My name is Rob and I have been running a design business since 2006. If you have any questions, please get in touch.  </p>", 
    "end_date": null, 
    "title": "Designing A Website in Photoshop, Illustrator (& GIMP)", 
    "price": "20.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156520_fa04_7.jpg", 
    "course_url": "https://www.udemy.com/designing-a-website-in-photoshop-illustrator-gimp/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-01T21:57:56Z"
}