{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t <strong style=\"\"><em style=\"\">Purpose - &quot;Whether you just can&rsquo;t find the perfect theme for your own business or if you&#039;d like to generate big profits by selling themes to others we&#039;ll show you how to design, develop and sell WordPress Themes. <br style=\"\">  \t </em></strong>  </p>  <p>  \t <strong style=\"\"><em style=\"\">While other courses might train you how to do-it-yourself, to get a JOB, (Just Over Broke)  WE show you how to use outsourcing to create amazing WordPress themes and build a complete successful online business around them! <br style=\"\">  \t <br style=\"\">  \t   B</em>est of all - you don&#039;t have to write one single line of programming code.</strong>  </p>  <p>  \t <em style=\"\">Inside </em><strong style=\"\">&ldquo;How  to Design, Develop, &amp; Sell Premium WordPress Themes&quot;</strong>, you will  learn everything from start to finish. We&#039;ll begin with the initial preparation and research required to create a great first WordPress Theme. We&#039;ll also discuss how to  layout a design that is perfect for your specific niche market, and follow through with two separate creation and  development strategies. Finally we&#039;ll conclude with techniques that will help you market your themes profitably!  </p>  <p>  \t   This course is taught in a step-by-step sequential manner - simply  watch over my shoulder and follow me.  In addition to the main video course you will also receive some  supplemental materials to help you along the way, including...  </p>  <ol style=\"\">  \t<li>Video Transcripts</li>  \t<li>Audio</li>  \t<li>A PowerPoint Presentation</li>  \t<li>&quot;Mock-Up&quot; Design Images</li>  </ol>  <p>  \t <strong style=\"\">You have over 2.5 hours of video content before you. </strong>  </p>  <p>  \t   However, on average, we believe users following the course&#039;s step-by-step system with a desire to apply what they have learned immediately will generally benefit from watching the course through once, and then using a &quot;Pause &amp; Do&quot; strategy on their second time through.  </p>  <p>  \t   Therefore, we recommend devoting at least a solid day&#039;s worth of time to this course to achieve the maximum benefits!  </p>  <p>  \t <strong style=\"\">SHOULD YOU TAKE THIS COURSE? </strong>The answer is yes if...  </p>  <ol style=\"\">  \t<li>If you can&rsquo;t find the perfect theme for your business and want to make it yourself without learning code! </li>  \t<li>If you want to build a premium WordPress theme to sell! </li>  </ol>  <p>  \t   We&rsquo;ll show  you how to make premium WordPress themes with control  panels to sell &amp; use! <br style=\"\">  \t <br style=\"\">  \t   While providing support for your Wordpress Themes, is beyond the scope of this Udemy course... WE WILL BE DELIGHTED TO ANSWER ANY QUESTION THAT YOU HAVE RELATED TO THIS TRAINING COURSE AND IT&#039;S MATERIAL!  </p>", 
    "end_date": null, 
    "title": "Design, Develop & Sell WordPress Themes", 
    "price": "20.00", 
    "instructors": "Promote Labs, Inc Team, Stephen Luc", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50687_229c_4.jpg", 
    "course_url": "https://www.udemy.com/design-develop-sell-wordpress-themes/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-21T02:57:03Z"
}