{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>¡Hola!</strong></p>  <p><strong>Bienvenido.</strong></p>  <p>Mi nombre es <strong>Filemón Casillas Téllez </strong>y soy Instructor certificado por Adobe, Android ATC y especialista certificado en tecnologías web.</p>  <p>En este curso aprenderás a crear una página web atractiva con efectos de scroll usando HTML y CSS, con Adobe Dreamweaver CC 2015, la herramienta profesional para creación de sitios web de Adobe.</p>  <p>Crearás un proyecto que podrás lucir en tu portafolio profesional con orgullo y que te hará resaltar de entre otros candidatos para conseguir un cliente o al buscar un empleo.</p>  <p>Este curso en video es tuyo para toda la vida, puedes verlo las veces que quieras, pausarlo, avanzar, regresar y repetir las lecciones hasta que hayas asimilado todo el conocimiento.</p>  <p>Te invito también a que tomes mi curso:</p>  <p><strong>Sitios web multimedia con HTML5 video\nbackground, CSS3 y JS</strong><br></p><p><strong>¡Buscalo aqui en UDEMY!</strong></p>  <p>Donde aprenderás técnicas más avanzadas, usaras HTML5, CSS3  y JavaScript para crear de forma fácil y rápida  un sitio multimedia de alto impacto visual para tu portafolio profesional.</p>  <p><strong>¿Porque tomar este cursos conmigo?</strong></p>  <p>Puedes ver mi biografía, soy un instructor profesional y certificado con más de 18 años de experiencia capacitando empresas de renombre. Se dice que un experto es: “<em>Alguien que ha cometido todos los errores posibles en un ámbito específico del conocimiento y los ha solucionado</em>”. Te puedo decir que he estado ahí, en su momento, me he enfrentado a varios problemas y los he solucionado, son esas soluciones las que voy a enseñarte en este curso, de una manera entretenida, rápida, eficiente y práctica.</p>  <p>Todo el conocimiento que he aprendido de durante estos años con la retroalimentación de mis estudiantes en empresas exigentes del mundo real esta sintetizado de forma sencilla en el curso que tomaras, aprendiendo solo lo realmente necesario.</p>  <p>Este curso es inspirador y practico.</p>  <p>Pienso que la mejor manera de no tener que trabajar en la vida es… “<em>Dedicarte a hacer lo que te gusta</em>”. Me apasiona enseñar y creo firmemente que cuando uno cruza la vida de un alumno, para enseñarle algo nuevo, uno trasciende en la vida.</p>  <p><strong>Saludos y ¡Muchas gracias por considerar mi curso!</strong></p>", 
    "end_date": null, 
    "title": "Diseño de un sitio web profesional con HTML y efectos CSS", 
    "price": 0, 
    "instructors": "ACI - Filemón Casillas Téllez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419730_c3d3.jpg", 
    "course_url": "https://www.udemy.com/diseno-de-un-sitio-web-profesional-con-html-y-efectos-css/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T23:50:39Z"
}