{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tAprende a diseñar una web profesional en menos de dos horas con Wordpress y Visual Composer (un plugin fácil e intuitivo para diseñar webs sin código y sin conocimiento )  </p>  <p style=\"\">  \tQuieres crear tu propia idea online? trabajar y ganar dinero extra creando páginas web? o aprender sobre diseño? En este curso aprenderás desde cero, fácil y rápido:  </p>  <ol style=\"\">  \t<li style=\"\">Como comprar un hosting,</li>  \t<li style=\"\">Como instalar Wordpress en un servidor con Cpanel y Cloud</li>  \t<li style=\"\">Como instalar una plantilla premium de wordpress</li>  \t<li style=\"\">Instalar Visual Composer</li>  \t<li style=\"\">Diseñar una página web con visual Composer</li>  \t<li style=\"\">Agregar menus, formularios y banners animados en wordpress</li>  \t<li style=\"\">SEO en Wordpress para posicionamiento.</li>  \t<li style=\"\">Crear un Blog</li>  </ol>  <p style=\"\">  \tTodos los conceptos básicos sobre diseño y administración Web para que pongas en marcha todos tus proyectos e ideas.  </p>  <p style=\"\">  \tNo es necesario conocimiento, a partir de videos, textos, ejemplos y practicas construiremos desde cero nuestro demo Web.  </p><p style=\"\"></p><p style=\"\"><strong style=\"\">Reviews</strong></p><p style=\"\">Jorgelina Chapartegui, </p><p style=\"\">Genial!!!!</p><p style=\"\">Yo me sentía un dinosaurio antes de empezar el curso y ahora me encanta entender los contenidos y aprender cosas nuevas. Muy grosso el profe!</p>by Luis C <p style=\"\">Buen Curso de Visual Composer!!</p><p style=\"\">Explicacioines Claras, se aprende mucho, espero más cursos de Camilo Barbosa!!!</p>by Paula Purriños Cabarcos<p style=\"\">Muy bueno</p><p style=\"\">Todo muy bien explicado para quien no tiene conocimientos en este ámbito. Se hace llevadero y fácil de seguir, totalmente recomendable.</p>by Armando Pineda, <p style=\"\">Un curso genial de un instructor genial!!</p><p style=\"\">Excelente curso, cubre todos los aspectos básicos para empezar una página web desde cero, con todo el soporte de Wordpress.</p><p style=\"\">Videos claros y concretos, sin pérdida de tiempo.</p><p style=\"\">¡Muy recomendado!</p>", 
    "end_date": null, 
    "title": "Diseña tu web desde 0 con Wordpress y Visual Composer", 
    "price": "20.00", 
    "instructors": "Camilo Barbosa TV", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367984_29f4_2.jpg", 
    "course_url": "https://www.udemy.com/diseno-web-en-wordpress-con-visual-composer/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T10:48:00Z"
}