{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><em>Dreamweaver CS5.5 Digital Classroom</em></strong><span><span class=\"Apple-converted-space\">&nbsp;</span>covers Dreamweaver CS5 and Dreamweaver CS5.5. </span></p> <p><span>Adobe Dreamweaver allows you to easily create robust Web sites without needing extensive programming knowledge or skills. The latest version of Dreamweaver boasts enhanced capabilities and this exciting video training package makes learning the new features of Dreamweaver less intimidating. 67 video lectures within 16 chapters explain how to design, develop, and maintain a fully functioning site. Over 8 hours of total video content!</span></p> <p></p> <p>About the presentor:</p> <p>Jeremy Osborn is director of content at American Graphics Institute (<a href=\"http://www.agitraining.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">www.agitraining.com</a>). He is the co-author of the HTML5 Digital Classroom, and has contributed to several books on web technology, including the Dreamweaver Digital Classroom. He brings more than 15 years of experience in web and graphic design, filmmaking for both print and digital media to his work at American Graphics Institute (AGI). At AGI, Jeremy also provides professional development training for corporate clients. Jeremy holds an MS in Management from the Marlboro College Graduate Center, and a BFA in Film/TV from Tisch School of the Arts at NYU. <span><br /></span></p>", 
    "end_date": null, 
    "title": "Dreamweaver CS5.5 & CS5 Comprehensive ", 
    "price": "50.00", 
    "instructors": "Digital Classroom", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/12348_5dbe_12.jpg", 
    "course_url": "https://www.udemy.com/dreamweaver-cs55/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-01-04T03:19:27Z"
}