{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Let&#039;s Work Side by Side To Create Your Website Right Now.</p><p style=\"\"><strong style=\"\">Ever have a great idea and then see someone doing YOUR idea?</strong></p><p style=\"\"><strong style=\"\"></strong>Same here!</p><p style=\"\">This happens to all of us.</p><p style=\"\">I have had plenty of ideas… and do you know what happened to most of them? Nada.</p><p style=\"\">My ideas stayed in dream world. That is because I never took action. Someone else did and I set back and watched. Then I asked myself these questions.</p><p style=\"\">Were they smarter than you. <em style=\"\">No.</em></p><p style=\"\">Were they better than you. <em style=\"\">No.</em></p><p style=\"\">They just decided to take action.</p><p style=\"\">It seemed that most of my ideas needed <strong style=\"\">one special key</strong>: creating my own website. </p><p style=\"\">After seeing people time and time again doing my ideas, I finally decided to learn how to create a website.</p><p style=\"\">Benefits of A Website: </p><ul style=\"\"><li style=\"\"><strong style=\"\"><em style=\"\">24 / 7 digital marketing and sales team working for you</em></strong></li><li style=\"\"><em style=\"\">Expands your visibility by helping customers easily find you</em></li><li style=\"\"><strong style=\"\"><em style=\"\">Saves you time with a create once distribute everywhere model</em></strong></li><li style=\"\"><em style=\"\">Creates mores opportunities to increase your client list</em></li></ul><p style=\"\">We live in an era where there are over 3 billion web users. These web users are looking to buy your products and your services…if you are on the web. You can&#039;t afford to miss this opportunity.</p><p style=\"\">Take this course if either of these apply to you:</p><p style=\"\"><strong style=\"\"><em style=\"\">Ready to take action on your idea and bring it to the web</em></strong></p><p style=\"\">Have a product or service that you want to share with the world</p><p style=\"\"><strong style=\"\"><em style=\"\">Are an entrepreneur and want to add tremendous value online</em></strong></p><p style=\"\">Own a business with a physical location and want to gain a web presence</p><p style=\"\">Never build a website before? <strong style=\"\">Great.</strong></p><p style=\"\">This course was created just <em style=\"\">for you.</em></p><p style=\"\">Business Owners, Entrepreneurs, and Creative people such as you are passionate about helping people. Every where you go, new and fresh ideas pop in your mind that will make an impact in people&#039;s lives. But at times…technology can get in the way.</p><p style=\"\">I personally taught myself how to create websites in WordPress and have gone through the struggles of learning the ins and outs so you won&#039;t have to. You are not alone. I will be with you every step of the way showing you how to take your website from idea to reality.</p><p style=\"\"><strong style=\"\">I&#039;ll walk you through each and every step to show you how to use WordPress.</strong> I have also included a helpful website checklist and useful resource documents for you to refer to during the course.</p><p style=\"\">Think creating a great website is too expensive, too time consuming, or just plain too hard? </p><p style=\"\">I know, I&#039;ve felt that way before.</p><p style=\"\">I know where you are coming from.</p><p style=\"\">That is because <strong style=\"\"><em style=\"\">I have walked in your shoes</em>.</strong></p><p style=\"\">I understand how busy life can be and how just having <strong style=\"\">a person there to help you create your website can make things so much easier.</strong> Someone there to show you how. That is why I created this course.</p><p style=\"\">How is that possible? - It&#039;s possible with an instructor who understands and a great web software to craft your website.</p><p style=\"\">You will know exactly what I mean once you starting watching the videos.</p><p style=\"\"><strong style=\"\">These next few hours could really change your life…if you let it. <em style=\"\">It is up to you.</em></strong></p><p style=\"\">All the best and start building the website you have been dreaming about right now. </p><p style=\"\"><em style=\"\">Don&#039;t wait. </em><strong style=\"\">Start now.</strong></p>", 
    "end_date": null, 
    "title": "Easily Create WordPress Website - Fast!", 
    "price": "50.00", 
    "instructors": "Jay Crutchfield", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503712_b01a_4.jpg", 
    "course_url": "https://www.udemy.com/easily-create-wordpress-website-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-16T10:49:32Z"
}