{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p></p><p>Easy Wordpress Installation</p><p></p><p>If you&#039;ve never installed WordPress before it can be quite intimidating, but it doesn&#039;t have to be - Watch the videos to discover how to get WordPress setup and running in less then 1 hour!</p><p>Two videos include: Installing and Updating WordPress Automatically Using cPanel and Installing WordPress Manually via FTP</p><p>Getting To Grips With Your New WordPress Dashboard.</p><p>Watch as I reveal just how simple it is to organize WordPress according to your preferences.</p><p>This video makes customizing your WordPress Dashboard as easy as 1-2-3!</p><p>Adding New Posts To WordPress.</p><p>Discover how easy it is to add, format and publish new posts to your site using the built-in WYSIWYG editor inside WordPress.</p><p>Everything is covered including: Choosing categories, setting tags and more - You&#039;re first post will be ready for the World to read in next to no time!</p><p>Permalinks For Search Engines.</p><p>Out of the box, WordPress permalinks structure isn&#039;t very search engine friendly by any means. But if you want to rank well in Google, Yahoo, MSN, etc. you&#039;ll need to know how to optimize them properly.</p><p>In this video we cover the best practices and how to optimize your permalinks in a way that virtually guarantees you more free traffic!</p><p>Creating And Adding New Pages.</p><p>Want to create multiple pages or add pages separate from your main content? No problem!</p><p>Discover how easy this is to do, how to organize pages in any order you wish and everything else related to pages you&#039;ll need to know...</p><p>Includes how to create a quick and simple &#039;About Us&#039; or &#039;Contact Us&#039; page.</p><p>Customizing WordPress Themes.</p><p>In this video you&#039;ll discover how to quickly change the appearance of your site using WordPress themes.</p><p>There are thousands of free and paid themes available online and I&#039;ll show you how to download, unzip and activate them easily.</p><p>Two videos cover theme installs automatically via the dashboard and manually via FTP</p><p>Working With Widgets</p><p>WordPress Widgets allow you to add really cool features and lots of extra functionality to your new website.</p><p>We cover everything you need and ever wanted to know in order to get the most out of using widgets successfully on your site.</p><p>The Power Of Plugins</p><p>Plugins are the blogger&#039;s shortcut to many exciting site tweaks, extra features and enhancements (both for you and site visitors)</p><p>In these videos we&#039;ll reveal some of the best plugins to use, where to get them, how to install them automatically and more importantly, how to use them correctly.</p><p>How To Add Gravatars</p><p>Discover how to use cool looking Gravatars to automatically add faces to names, build branding and relationships with your readers.</p><p>How To Control and Eliminate Spam</p><p>Everyone hates spam and the amount of spammers waiting to invade your site can be downright frustrating.</p><p>However, In this important video we&#039;ll cover how to block virtually all spammers automatically to keep your blog discussions and posts clean and spam free without ever having to lift a finger!</p><p>Adding Contact Forms To Your Site</p><p>Once you have your site up and running you&#039;ll want to give your visitors and readers an easy way to contact you.</p><p>In this video we&#039;ll go over several options available to you and then cover everything step by step so you can add a &quot;contact us&quot; form to your site.</p><p>How To Add Images, Audio and Video To Your Blog</p><p>It&#039;s true. Pictures really are worth a thousand words! Discover how to import and access your images in WordPress.</p><p>You&#039;ll also learn how to format your pictures, add captions, audio, video and much more...</p><p><br></p><p></p><p></p>  ", 
    "end_date": null, 
    "title": "Easy Wordpress Installation ", 
    "price": "20.00", 
    "instructors": "Clifton Pugh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47935_b796_6.jpg", 
    "course_url": "https://www.udemy.com/wordpress-basics-video-series/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-30T12:37:49Z"
}