{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tHave you ever tried to build or enhance a website to grow your business? Have you spent lots of time learning WordPress, how to work with plug-ins, and how to tweak your website to boost traffic and sales, only to have it produce lackluster results? Have web designers quoted you a price tag of several thousand dollars just to build it for you?  </p>  <p style=\"\">  \tWith this Wordpress Tips and Tricks course you can learn How to Increase Website Traffic, which tips, tweaks, and tools you can use, without complicated programming, to boost your WordPress website and transform it into a traffic magnet -- in less time, with less money, and with a <em style=\"\">lot less effort</em>.  </p>  <ul style=\"\">  \t<li style=\"\">Which      plug-ins create the best results</li>  \t<li style=\"\">How      to tweak your plug-ins to maximize your      site&#039;s selling power</li>  \t<li style=\"\">How      to work with themes and templates to optimize your site&#039;s attraction      potential</li>  \t<li style=\"\">And      how to avoid common errors committed by WordPress designers.</li>  </ul>  <p style=\"\">  \tThis Wordpress Tips and Tricks course will take you through top essential and nice-to-have plug-ins, including admin, SEO, security, layout, usability, social, and even multimedia plug-ins. It will also dive into how to work with themes and templates, and how to tweak them a lot more efficiently.  </p>  <p style=\"\">  \tAlso, this course will show you how to tweak the look-and-feel of your website using styles, graphics, and design &quot;tricks.&quot; It will reveal some shortcuts using copy-and-paste-simple snippets of code, as well as a number of quick-and-dirty online tools and resources -- <em style=\"\">many of which are free</em>.  </p>  <p style=\"\">  \t<strong style=\"\">This course is for</strong>:  </p>  <ul style=\"\">  \t<li style=\"\">Do-it-yourselfers      who know the basics of WordPress and want to know how to take it to the      next level.</li>  \t<li style=\"\">Hired      webmasters or web designers who want to improve their skills to bring much      greater value to their clients.</li>  \t<li style=\"\">Web      site owners who don&#039;t know the technical stuff but want to be sure their      web people make the right decisions.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">This course is not for:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Uber-Geeks      who are looking for advanced coding skills. <em style=\"\">(You can certainly      learn a lot from this course, but you may get bored.)</em></li>  \t<li style=\"\">Complete      newbie who don&#039;t have any knowledge of      WordPress. <em style=\"\">(You would get more out of this course if you first      took a WordPress Basics course, then came back to upgrade your education.)</em></li>  </ul>  <p style=\"\">  \tThis course is meant for people who don&#039;t want to get involved with heavy programming, but want to learn How to Increase Website Traffic, tweak their WordPress websites and discover powerful shortcuts to enhance their online business or blog.  </p>  <p style=\"\">  \tThis Wordpress Tips and Tricks course by developer Michel Fortin will give you a new perspective on how to optimize and ramp up your website for maximum traffic, stickiness, and conversion.  </p>  <p style=\"\">  \t<span id=\"pastemarkerend2628\" style=\"\"></span>  </p>", 
    "end_date": null, 
    "title": "Enhanced WordPress Strategies For Business", 
    "price": "50.00", 
    "instructors": "Michel Fortin, Licorice Group", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21440_02cd_3.jpg", 
    "course_url": "https://www.udemy.com/enhanced-wordpress-strategies-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-19T01:07:01Z"
}