{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">&quot;Good design is good business.&quot;</em><span style=\"\"> - Thomas J. Watson</span>  </p>  <p style=\"\">  \t<strong style=\"\">Why?</strong>  </p>  <p style=\"\">  \t                    Just sit down one weekend and earn a skill that you can profit from for a long time, it&#039;s easy as that and thats what is seperating YOU from other people. You are here to gain a new skill and go further with your life. This course isn&#039;t about coding a website template, it&#039;s just about the designing process! You&#039;re going to see an in-depth course on how to create TWO flat design and one-page layout websites with Photoshop and Illustrator. Flat design is really the top-notch trend right now, everyone wants to master it and big companies are using it for their products for example Apple with iOS8 and OSX Yosemite, as well as Microsoft with their Metro UI. Combining flat design and one-page layouts is really setting a new trend right now. It looks great, modern and fresh, but it&#039;s also simplistic which is why people are going to stay on your website.  </p>  <p style=\"\">  \t<strong style=\"\">What you&#039;ll earn</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Master modern flat design</li>  \t<li style=\"\">Master one-page layouts</li>  \t<li style=\"\">Create vector icons</li>  \t<li style=\"\">Design TWO stunning websites</li>  \t<li style=\"\">Sell your own templates</li>  \t<li style=\"\">Be up to date in webdesigning</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Content and Short Overview</strong>  </p>  <p style=\"\">  \t                    28 lectures and over 5 hours of material, as well as source files are going to show you, how to do successful webdesign with Photoshop and Illustrator, especially with modern styles. If you are having troubles or want more content, just write a post in the Udemy course-forum and I&#039;ll try to do my best to record a new video and add it to this course so you&#039;ll have the best experience while studying your new skill.  </p>  <p style=\"\">  \t<strong style=\"\">Be the next generation of web designers</strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;Hard work beats talent when talent doesnt work.&quot;</em> - Kevin Durant.<br style=\"\">  \t              This quote of Kevin Durant was always my strongest motivation when starting to earn a new skill. Working on yourself on a daily basis is the key to success, you invest in YOURSELF and profit from it for a long time. Start with this course on flat design and one-page websites, continue with HTML/CSS and coding in another course and start adding skills to your skillset every month and trust me, you will be successful!  </p>", 
    "end_date": null, 
    "title": "Flat Design One Page Website with Photoshop and Illustrator", 
    "price": "25.00", 
    "instructors": "Ferdi Armagan", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332930_3031_14.jpg", 
    "course_url": "https://www.udemy.com/flat-design-one-page-website-with-photoshop-and-illustrator/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T20:03:02Z"
}