{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  Wordpress is a website platform often used for blogs but now powers websites for companies and organizations. Wordpress is a simple platform and is easy to use but knowing what options to use when can often lead to confusion.  </p>  <p>  \t  I am a website designer with over 13 years of experience. I have been designing websites with Wordpress for over 5 years. In 2013, I deployed over 62 customized Wordpress websites for Small Businesses and Organizations in my area. With each deployment, came the training. I provided recorded tutorials for each of my clients so they could have something to reference. That is where this course comes into play.  </p>  <p>  \t  I want you to completely understand how to use your Wordpress Website so you can get the most out of it. You either spent a lot of time setting up your website or paid somebody else to do it, so it needs to provide you value. In this course, I will walk through Wordpress section by section describing how and when to use each feature.  </p>  <p>  \t  By the end of this course you will know everything that Wordpress is capable of doing on it&#039;s own. I want your website to be a successful website and that starts with understanding how to use it.  </p>  <p>  \t  This course is free because I believe that having a good understanding of how to manage your website will result in a better internet experience for all of us.  </p>  <p>  \t  This course is for anybody who has either just setup Wordpress or was just handed login access to a website they had designed by a website designer. If you have had your Wordpress Website for a while and never got the hang of using it, this course will refresh and renew your desire to create good content and share your story with the world.  </p>  <p>  \t  Sign up today! It&#039;s free. You can use the Udemy.Com app to view the content on your smart phone or tablet which makes it easy to follow along with your browser as you watch me describe Wordpress features and best practices.  </p>  <p>  \t Some say I am a little long winded with my explanations, however I am that way because I want all to understand. Some aspects of Wordpress are very apparent to some while others struggle with understanding how a certain feature works. Fast learners may want to cruise through the video at a faster pace.  </p>", 
    "end_date": null, 
    "title": "Getting Started With Wordpress - A Beginners Guide", 
    "price": 0, 
    "instructors": "Jerad Hill", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/132112_dd6f_5.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-wordpress-a-beginners-guide/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-11T00:52:07Z"
}