{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>\"</em><em>I am so thankful this course was available as it saved me hours and hours of working out the Divi way of doing things. Clear explanations and examples meant I started and got it all to work in less than a day, quite an achievement for a technophobe like me. I have copied the fonts, colours etc as this is this bit I really struggle with. MANY THANKS!\"<br></em> -Julie Quinn, LTI.</p>\n\n<p><strong><br></strong></p>\n\n<p><strong>Are you ready to breathe some new life into your old website?</strong></p>\n\n<p>This step-by-step, clear, and easy to follow course will show you how to take your current or old website and give it a complete makeover, regardless of which tools, platform, or theme you plan to use to build it.</p>\n\n<p>We'll talk about how to best plan your beautiful new website so it works hard for you while you are off doing other things, so it can best promote you, your work, and your brand. I'll also walk you through the process of changing to a new theme in WordPress, and in particular the <strong>powerful and stunning e-commerce WordPress theme Divi from Elegant Themes</strong>.</p>\n\n<p>I created this course while I myself was redesigning my own online artist's portfolio. You'll see my old website go through a complete transformation as I show you the exact process I used to plan, create, and launch my new and improved website as an actual case study. </p>\n\n<p><strong>Let me help you set up a new website that can do the online heavy lifting for you by showing you how to include features that:</strong></p>\n\n<ul><li>Effectively showcase your latest projects, designs, or products</li><li>Better feature your services </li><li>Sell more of your products</li><li>Collect new subscribers for your mailing list</li><li>Generate more social media shares (and more traffic) for your blog posts and other content.</li><li>Get more followers for your linked social media pages.</li><li>(NEW) Diagnose, tune-up, and supercharge your website so it performs better, generating more clicks, engagement, followers, subscribers, and sales 24 hours a day while you are off doing other things. All students in this course get access to my follow-up course, <em>WordPress Website Challenge: Easy Ways to Boost Impact</em> FREE.</li></ul>\n\n<p>These powerful, bite-sized lessons come directly from my comprehensive (8+ hours long) <strong>Web Snax: Super Simple Recipes for Easy Website Design</strong> course which is a full web design foundations class that not only gets into the very basics of using WordPress, but also how to plan and organize websites, create online graphics and animations, HTML and CSS, adding Javascript, and making beautiful websites from scratch in a variety of ways using an intuitive right-brained method that requires little to no coding ability.</p>\n\n<p>I'm a tenured Associate Professor of Digital Media and the Program Director of Film &amp; Digital Media at <em>The American University of Rome</em> and a practicing award-winning multimedia artist.</p>\n\n<p>I have over 15 years of experience teaching students all over the world using my tried and true custom approach (turning complex information into something simple, memorable, easy-to-understand in as short amount of time as possible) to ensure that <strong>you get the most important, relevant, and useful information that can be applied immediately to your art, work, and everyday life.</strong></p>\n\n<p>New bonus lectures and resources will continue to be added and timely design advice will be provided in the discussion forum. I love to help and always respond to inquiries and discussions ASAP.</p>\n\n<p><strong>Please Note: All students who enroll in this course also will receive periodic free and discounted access to my other top-rated current and upcoming courses.</strong></p>\n\n<p>You have a 30-day, 100% money-back guarantee with no questions asked so you have nothing to lose. I make myself available so you will have access to me if you have questions or need specific feedback along the way.</p>\n\n<p>Empower yourself now by enrolling in this easy to follow WordPress Website Makeover with <em>Divi</em> course and join our growing learning community! Click the \"Take This Course\" button in the upper right corner and <strong>let's get started creating your DREAM website today.</strong></p>", 
    "end_date": null, 
    "title": "Give Your WordPress Website a Makeover: Divi WordPress Theme", 
    "price": "25.00", 
    "instructors": "Kristen Palana", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593808_996f_6.jpg", 
    "course_url": "https://www.udemy.com/wordpress-website-makeover-divi-theme-redesign/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T08:47:41Z"
}