{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<ul style=\"\">  \t<li style=\"\">Are you getting married abroad?</li>  \t<li style=\"\">Would you like to<strong style=\"\"> impress your guests with something different</strong>?</li>  \t<li style=\"\">How great would it be if your guests thought <strong style=\"\">your wedding is going to be the most fun event of the year</strong>?</li>  </ul>  <p>  \t    Planning your wedding can be fun but also a bit frustrating sometimes, when you have many things to do and organise: wedding dress, church, venue, flowers, groom suit, guests list, invitations, honey moon,.., when on top of that you also have your relatives, friends and other guests calling you and emailing you asking you questions about the wedding such as: how they can get there, where exactly the ceremony is, where they can find accommodation, etc,.. Your wedding planning can turn into a nightmare.  </p>  <p>  \t    As everybody does, you want your big day to be the most special day of your life, and you also want your guests to enjoy and have a great time on your wedding day, and you want to enjoy the wedding planning process as much as possible. That&#039;s why this course is for you.  </p>  <p>  \t    Imagine having all your wedding information and everything you want your guests to know in a beautiful website. Imagine having your own wedding website where you can add pictures and videos of your wedding and honey moon, and all the memories of your wedding day.  </p>  <p>  \t    Imagine hearing your guests saying that they are so excited to go to your wedding and can&#039;t wait for your big day.  </p>  <p>  \t    In this course you are going to learn how to <strong style=\"\">create your own wedding or family website completely FREE</strong> very easy and in just a few hours!  </p>  <p>  \t<strong style=\"\">Special bonuses:</strong>  </p>  <p>  \t    ·<strong style=\"\">Wedding budget planner</strong>  </p>  <p>  \t    ·<strong style=\"\">Wedding Planning Tips</strong>  </p>  <p>  \t    If you are getting married or have a family, you will love having your own personal website!  </p>  <p>  \t<strong style=\"\">Enrol this course now.</strong> Click the <em style=\"\">&quot;take this course&quot;</em> button, <em style=\"\">so that you can start creating your own website straight away.</em>  </p>  <p>  \t<strong style=\"\">30 days money back guarantee</strong>. Take the course for 30 days and if you are not happy, we will give you the money back, no questions asked.  </p>", 
    "end_date": null, 
    "title": "How To Create Your Own Wedding or Family Website ", 
    "price": "20.00", 
    "instructors": "Carmen Fernandez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416540_07fd_3.jpg", 
    "course_url": "https://www.udemy.com/create-your-wedding-or-family-website-completely-free/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T15:42:24Z"
}