{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Actual reviews by students of this course:</p><p>\"After the historical introduction of SEO this has turned into a goldmine of information. I was basically stuck on new content ideas for my niche that I promote. But after seeing all of the components of new content ideas from the ranking websites, I no longer have headaches. I know where to go and this information is priceless for me.\"</p><p>\"This is a great course for bloggers and for people who are wantint to rank with great content published on their blog. It's difficult to find a course that describes the writing methods and tools so in depth like this one. Many good recommendations in this and a good way of looking at writting. Be better, write better than the competition, don't just copy the same article. Analyze and plan your own post but make it better, more personal, more technical or whatever way but make it different. I honestly think this is a good investment for those who want to stand out with their great and original content.\"</p><p>\"As always the good doctor under promises and over delivers,comprehensive and easy to understand course i wish i would have had this information 10 years ago.\"</p><p>\"Author gets right to the practical without a lot of fluff. Course moves quickly and is a constant waterfall of info that you can, and want, to use right away. Author knows his stuff and appreciate the recommendations on resources to help. Recommend it highly.\"</p><p>\"I wanted to take this course because I want to see what else Andy knows about creating great content. Andy always overdelivers on his courses. His voice is easy to understand. And if you do what Andy says about writing content you will have a successful website. Mine is. Most of my content is on the first page of Google. That's because of Andy's teaching.\"</p><p>Do you own a website?  Are you having trouble ranking your content in Google?  Has your site been penalized by Google?  </p><p>With so much bad or outdated information around on the internet, is it any wonder that website owners are struggling to rank their content in Google?  </p><p>This course is aimed at anyone that owns a website, needs to get content ranked in Google, or just wants to better understand the types of content that Google want to rank. Taught by an SEO with over a decade of experience, you'll learn the strategies that I've been using since 2005, to consistently rank my content without ever having to worry about the next Google update.<br></p><p>The course will begin with a little history lesson, looking at how we used to write web content and why things changed with the introduction of Panda and Penguin.  I'll describe the main Google algorithm updates you need to know about, and why Google introduced them.  We'll then go through the important guidelines when it comes to creating content - and these guidelines come from Google!</p><p>With a solid understanding of what Google wants, we'll then look at a number of ways you can come up with innovative, exciting content ideas that you know, even before you create them, will be popular with your visitors.</p><p>Armed with lots of content ideas, we'll then look at a number of different types of content/media you can use to entertain and inform your visitors.  We'll discuss the importance of \"niche vocabulary\".  Not only will I prove to you that this is vital to ranking in Google, but you will learn how to find niche vocabulary for any piece of content you want to write.  Take the practical exercises to see how easy it is to gather appropriate niche vocabulary.</p><p>I'll introduce you to the term \"link bait\" and why you need to create some for your website. We'll talk about \"share bait\" too - which is the foundation of visitor retention and sharing of your content on social media channels.</p><p>With all the theory covered, it's then time to get busy and write your first piece of content. I'll take you through every step, from title and description, to headlines and themed content.  We'll look at a few important on-page factors you need to get right, but to make sure, I'll give you an checklist to use to evaluate your own content.</p><p>This course covers everything you need to know about writing the type of content that Google rewards with top rankings.  </p><p>With the majority of lectures being video, you can watch over-my-shoulder as I teach you the secrets to creating the type of content that your visitors will love, share and rave about. </p><p>By the end of the course you will be creating content for your site that visitors want to share and webmasters want to link to.  You will be creating the type of content that will propel your site to new levels of traffic, click-through rates and profitability.</p>", 
    "end_date": null, 
    "title": "How to Write Great Web Content - Better Search Rankings!", 
    "price": "30.00", 
    "instructors": "Andrew Williams", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501882_bc03.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-great-web-content/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T12:45:18Z"
}