{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<ul><li>Learn How To Make a Stunning Website using WordPress - No Coding Needed!</li><li>Easy &amp; Quick Tutorial for Beginners &amp; Intermediate Students</li></ul>\n\n<p>++++++++++++</p>\n\n<p>Course Fully Up To Date With The Latest Version of WordPress</p>\n\n\n\n<p>++++++++++++</p>\n\n<p><strong class=\"redactor-inline-converted\">Why Take This Course?</strong></p>\n\n<ul><li>Learn How To Quickly &amp; Easily Make a Professional Website in under 2 hours!</li><li>Your Website Will Be 100% Mobile Friendly (Responsive) and Display Perfectly on Any Screen Size.</li><li><span></span>I Show You How To Get Your First Month of Web Hosting for Only 1 Cent!</li><li><span></span>You Can Get Access To Our FREE Customizable Website Logos to Use On Your Own Sites!</li><li><span></span>We Create The Site Using the Same Technology as large Organizations and Celebrities including CNN, Forbes, Jay-Z and Katy Perry.</li><li><span></span>I Have A Wealth of Experience Building Professional WordPress Sites for Almost A Decade</li><li><span></span><strong class=\"redactor-inline-converted\">100% Newbie Friendly</strong> - You Don't Need Any Previous Experience or Knowledge To Take This Course!</li><li><span></span><strong class=\"redactor-inline-converted\">You Won't Need To Write a Single Line of Code</strong> in This Course!</li><li><span></span>The Course is <strong>100% FREE</strong> and Always Will Be!</li><li><span></span>I Always Respond To Any Follow Up Questions Related to the Course</li></ul><p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Content and Overview</strong><br></p>\n\n\n\n<p>Suitable for complete beginners, this course has 23 lectures of content and will literally take you by the hand and show you step by step how to make a website with WordPress from start to finish!</p>\n\n\n\n<p>Starting out with the installation of WordPress on the web server, this course will walk you through everything you need to do to build a stunning and compelling website in order to establish your online presence.</p>\n\n\n\n<p>With the basics mastered through the process of learning by doing, by the end of the course students will have the knowledge to make a website with wordpress and update and edit it as needed.</p>\n\n\n\n<p>You need no coding knowledge to take the course and do not need to write a single line of code to create your website, making this course perfect for complete beginners and those new to WordPress</p>", 
    "end_date": null, 
    "title": "How To Make a Beautiful WordPress Website Without Coding!", 
    "price": 0, 
    "instructors": "WebsiteWizard.tv .", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815726_55b6_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-website-without-coding/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T17:58:07Z"
}