{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5 style=\"\"></h5>  <h5 style=\"\">You&rsquo;re sick of being scared.</h5>  <h5 style=\"\">You&rsquo;re tired of feeling overwhelmed.</h5>  <h5 style=\"\">You&rsquo;re dying to finish something.</h5>  <p style=\"\">  \tBut you can&rsquo;t expect to finish something if don&rsquo;t know what&rsquo;s keeping you from doing so.  </p>  <p style=\"\">  \tI&rsquo;d like to share with you the psychological foundations and the tested methods of those people who get stuff done. Because if you can&rsquo;t finish, it doesn&rsquo;t count.  </p>  <p style=\"\">  \tWhat would you get done if nothing could stop you?  </p>  <p style=\"\">  \tWelcome to <strong style=\"\">Ready. Set. Finish.</strong> &ndash; The Course Your Excuses Don&rsquo;t Want You To Take.  </p>  <h5 style=\"\">Hi. I&#039;m Bassam Tarazi</h5>  <p style=\"\">  \tI created Colipera, am author of <em style=\"\">The Accountability Effect</em>, co-founded The Nomading Film Festival &amp; The Ignition Lab and was recently the Director of Operations of Omnibuild.  </p>  <p style=\"\">  \tI have a mechanical engineering degree and a green MBA. I&rsquo;ve been fortunate enough to have visited 47 countries.  </p>  <p style=\"\">  \tIn short, I&rsquo;m not afraid to try and I&rsquo;m hell bent on finishing.  </p>  <h5 style=\"\">Why Some People Finish And Others Don&#039;t</h5>  <p style=\"\">  \tHistory talks about the people who finished.  </p>  <p style=\"\">  \tAll-time greats are defined on how they close games out.  </p>  <p style=\"\">  \tDevelopers and inventors are judged on what they produce.  </p>  <p style=\"\">  \tBullet points on a resume are completion&rsquo;s currency.  </p>  <p style=\"\">  \tFramed degrees on a wall prove to the world that you finished something you started.  </p>  <p style=\"\">  \tThe people you admire, finish.  </p>  <p style=\"\">  \tYou have food on your table, clothes on your back and toothpaste in the tube because someone somewhere finished something.  </p>  <p style=\"\">  \tIdeas and projects are easy to start but it&rsquo;s the finishing that counts. The shoes are either tied or they are untied. The ship either floats or it doesn&rsquo;t. Your website is either completed or it&rsquo;s not.  </p>  <p style=\"\">  \tSo many of us sit in the unfinished business part of life. Unfinished conversations destroy relationships. Unfinished projects take up space on your computer or in your garage. Unfinished dreams lie wasting away, marooned on Shoulda-Coulda Beach as we wonder what might have been.  </p>  <p style=\"\">  \tSo why do some people finish and others don&rsquo;t? Why are some goals reached, while others aren&rsquo;t? Why do some projects persevere while others fizzle out?  </p>  <p style=\"\">  \tWhat I&rsquo;ve found out in my own life and in my research of others is that:  </p>  <p style=\"\">  \t<strong style=\"\">It&rsquo;s mindsets, not tactics.</strong>  </p>  <p style=\"\">  \tFinishing something is all about completing the circle. Most of us get lost along the journey towards our goals because excuses and impediments suffocate us, we start feeling overwhelmed before we can finish.  </p>  <p style=\"\">  \tWe say we want to do something, we say we should do something but we&rsquo;re still not doing it.  </p>  <p style=\"\">  \tWe&rsquo;ve read enough books and how-to&rsquo;s when it comes to getting things done. We&rsquo;ve read the top 10 lists, we&rsquo;ve done the research and yet, we&rsquo;re still sitting there, idling.  </p>  <p style=\"\">  \tBelieve me, I know. I still deal with excuses everyday.  </p>  <p style=\"\">  \tWe have to understand that our excuses are savvy. They don&rsquo;t want us to finish. They are betting against us.  </p>  <p style=\"\">  \tIf we don&rsquo;t know how they work, if we don&rsquo;t know their tendencies, they are going to continue to defeat us.  </p>  <p style=\"\">  \tIt&rsquo;s time to finish.  </p>  <h5 style=\"\">What Exactly IS Ready. Set. Finish.?</h5>  <p style=\"\">  \t<strong style=\"\">Ready. Set. Finish.</strong> is the <strong style=\"\">private, 4-week, 4-module </strong>course that was created for you so you can prepare for, plan for and react to the inevitable psychological roadblocks that will appear along your path to reaching your goals so that before you even start, you can be quite certain that you&rsquo;ll finish <em style=\"\">what</em> you start.  </p>  <p style=\"\">  \tIt is a course focused on the mindset and behavior needed to finish.  </p>  <p style=\"\">  \t<strong style=\"\">This course insight is brought to you through:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">- 2 hours of video lessons from me</strong>  </p>  <p style=\"\">  \t<strong style=\"\">- Over 3 hours of interviews with 4 extremely successful professionals all who are adept at overcoming excuses in their lives and careers</strong>  </p>  <p style=\"\">  \t- <strong style=\"\">10 game-changing worksheets which will fortify your goal-setting strategy</strong>  </p>  <p style=\"\">  \tThis course is not just about tested productivity tactics, because a tactic on its own is worthless if you don&rsquo;t understand the strategy it rests upon.  </p>  <p style=\"\">  \tRest assured, your excuses <em style=\"\">will</em> come out to derail you, in the beginning, the middle or right at the end of whatever it is you&rsquo;re reaching for.  </p>  <p style=\"\">  \tBut you can&rsquo;t navigate the hurdles in front of you if you don&rsquo;t understand the excuses your brain transforms them into.  </p>", 
    "end_date": null, 
    "title": "How To Conquer The Excuses That Keep You From Finishing", 
    "price": "25.00", 
    "instructors": "Bassam Tarazi", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29495_107c_3.jpg", 
    "course_url": "https://www.udemy.com/readysetfinish/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-13T13:34:49Z"
}