{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Looking to build a blog for your business or Internet marketing? Maybe you want to create a small website about your favorite hobby. </p><p>This course is for anyone that wants to learn how to build a website. The focus is on creating a WordPress site with your own domain and Web hosting and doing it the right way. While it is possible to use free online hosted blog solutions, the goal here is to build something that you control, manage, and can grow at your own pace. Not only will I teach you how to build a WordPress site from the ground up but will give you the knowledge and tools to make money through internet marketing. </p><p>If you are new to building websites or don't think you are very computer literate have no fear! I have made the lessons easy to understand and follow and you should have no problems going through the material. The nice thing about this course is that with unlimited access you can watch the videos over and over again if something is not clear. Consider me to be your personal coach as I show you step by step how to do become a blogging master!</p><p>You should have experience with computers and have a general understanding of the Internet. If you can browse the Web, check e-mail, use Facebook, or use any other computer software and can follow directions then you can definitely build a blog and we are going to teach you how. </p><p>I've been building Websites for many years as a full-time job, as a freelancer, and Internet marketer and I switched to using WordPress some time ago after I discovered the power, flexibility, and speed at which you can build from the ground up. </p><p>I created this course to share my knowledge and offer you my full help and attention at reaching your goals and creating the website that you deserve. So what are you waiting for? Get started now and with my money back guarantee you have nothing to lose…and only knowledge to gain!</p>", 
    "end_date": null, 
    "title": "How to Build a Website with WordPress For Fun and Profit", 
    "price": 0, 
    "instructors": "Steve's Profit Secrets", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585916_03d9_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-website-with-wordpress-for-fun-and-profit/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T00:39:03Z"
}