{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>LATEST: Course Fully Updated For January 2016</em></p><p>Are you a website owner using Weebly as your host? Do you wish there was a way to better to collect leads and email addresses? If you've been considering a subscription with LeadPages but were not sure whether or not it could be integrated seamlessly with your Weebly site, I'm here to tell you it can be!</p><p>I've been a Weebly website owner for years and underwent the process of integrating my LeadPages and LeadBoxes into my site to help generate higher conversions, and it's working amazingly well! Providing my website visitors with a seamless experience by adding my custom domain to my LeadPages as well as LeadBoxes has made all the difference. </p><p>This course will show you how! </p><p><em>No coding knowledge is required!</em></p><p>+++++++++++++++++++++++</p><p>What You Get:</p><ul><li><em>Step-by-step videos which show the process as I go through it using my own website and LeadPages/LeadBoxes as examples</em></li><li><em>24/7 lifetime access to course content and materials.</em></li><li><em>All future extra lectures and upgrades are always included for free.</em></li><li><em>Unconditional Udemy 30 day money-back guarantee.</em></li></ul><p>What You'll Learn:</p><ol><li>How to direct website visitors to your LeadPage using the LeadPages-assigned URL as an external link.</li><li>How to embed your LeadPage inside Weebly so that the LeadPage shows your custom domain when visitors view it. </li><li>How to add Standard LeadBoxes to any page on your Weebly site.</li><li>How to add Pop-up LeadBoxes across your entire site at once, or how to add them to specific pages on your site one at a time. </li><li>How to customize certain elements of LeadBox buttons on your Weebly site including padding, font size and width. </li></ol><p><em>A final very important point:</em></p><ul><li>This course assumes prior knowledge of both the Weebly and LeadPages platforms. You do not need to now how to code, but you do need to be familiar with the drag-and-drop Weebly website editor as well as how to make a LeadPage and LeadBox within Leadpages. If you do not know how to do this in LeadPages, they offer free courses explaining how to use their product. This course is about the integration of the two systems! </li></ul><p>Click the \"take this course\" button, top right, <em>now </em>... and start collecting more leads today by integrating your LeadPages account with your Weebly website!<em></em></p><p><strong>Bailey Richert</strong>, Business Coach for Beginning + Budding Infopreneurs</p>", 
    "end_date": null, 
    "title": "How to Integrate LeadPages and LeadBoxes with a Weebly Site", 
    "price": "20.00", 
    "instructors": "Bailey Richert", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531666_4321_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-integrate-leadpages-and-leadboxes-with-a-weebly-site/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T21:54:06Z"
}