{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Aren’t you tired of spending days watching courses and tutorials on Illustrator, that get you nowhere?</p>  <p>That’s because they mainly talk about the tools, not showing practical examples and how to get things done. </p>  <p><strong>And I am like you: I like to learn only the important skills.</strong></p>  <p>So if you want to:</p>  <ul><li>learn practical Illustrator techniques</li><li>design flat icons immediately</li><li>and use Illustrator independently</li></ul>      <p>…then you are in for a treat.</p>  <p>Because this course will easily build your confidence in Illustrator and flat design. </p><p>Each lecture is a 15 minute piece of practical Illustrator and flat design skillset, that will make you a flat design superhero.<br></p>  <p>And it’s real.</p>  <p>It’s happening to other students in the course:</p>  <p><strong>Wonderful!</strong></p>  <p><em>Only finished the first icon so far and I already feel a huge amount more confident in Illustrator and the overall flat design. The quality of the videos are great, clear voice and easy to follow.</em></p>  <p><strong>Matthew Inglis</strong></p>    <p>Take a look at just a small fraction of flat design magic, that’s waiting for you inside:</p>  <ul><li>Powerful and simplistic techniques like long shadow effect, pathfinder, pen tool and so much more</li><li>Flat design fundamentals to feed you with all the crucial information you need</li><li>Clear, concise and practical videos, that get you straight to the point</li></ul>        <p><strong>Picture yourself opening up Adobe Illustrator and looking at your wonderful flat design creation, that you did independently in just 15 minutes.</strong> </p>  <p>It doesn’t matter if you are a complete beginner. </p>  <p>It doesn’t matter if you don’t feel confident to design independently.</p>  <p>It doesn’t even matter if you think, that your skillset is not enough.</p>  <p>Because, as one of my students, Sharon Yeo, put it:</p>  <p><em>As a complete beginner to Illustrator, this was a great course to help me quickly get started learning useful techniques in Illustrator and designing flat icons immediately. Builds confidence in being able to design flat icons independently!</em></p>  <p>There is no risk in just trying this course out. It’s completely refundable. </p>  <p>You are totally covered by an unconditional 30-day 100% money back guarantee.</p>  <p>So it’s up to you now.</p>  <p>Enroll in the course and become a flat design superstar.</p>  <p>Thanks,<br> Dawid</p>  <p>PS. This is what one of my students, Ioannis Tsiakos, had to say about this course:</p>  <p><strong>Easiest way to learn flat icon design</strong></p>  <p><em>I learnt more in one hour watching this course, than i would have if i had spent days reading online tutorials. Super easy to follow and great examples/ cases that illustrate how illustrator works and how designers think when approaching a flat icon design :) Recommended!</em></p>", 
    "end_date": null, 
    "title": "How to create flat design icons in 15 minutes", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518870_fb46_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-flat-design-interface-icons-in-illustrator/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T08:21:15Z"
}