{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">The world has moved.</p><p style=\"\">We no longer take our information and ideas from newspapers and television.</p><p style=\"\">People like you and I use the internet and do our own research. We form our own opinions.</p><p style=\"\">This course will show you in the most detailed way how you can build a website in your chosen field that will, over time, allow you to <strong>become an authority</strong>.</p><p style=\"\"><strong>People will search for you and form opinions on what you write and say. </strong></p><p style=\"\">They will seek you out and know your name.</p><p style=\"\">How do I know it is possible?</p><p style=\"\">Because<strong> I have done it.</strong></p><p style=\"\">Two years ago, I was just another random guy with an opinion on the sport of cricket. </p><p style=\"\">I now have one of the world's most read independent cricket authority sites, a leading cricket podcast and over 45,000 subscribers (at time of writing and growing) across multiple social media platforms. </p><p style=\"\">Over 250,000 people visited my site in its first year.</p><p style=\"\">In less than 2 years, I went from a complete nobody in my niche to someone who gets paid consistently to write for other publications globally.</p><p style=\"\"><strong>This is not one of those spammy courses full of fluff, slogans and get rich quick messages.</strong></p><p style=\"\">This is a course for those that want to build something solid and desire the <strong>TRUTH</strong><strong> </strong>on how it really works.</p><p style=\"\">This course uses step by step <strong>videos </strong>to show you how I did it. </p><p style=\"\"><strong>Together in this course, we will build a website from scratch.</strong> </p><p style=\"\">From setting up a website, making it look awesome, through to using social media to grow your personal brand, engage with the famous people in your niche and finally, get your name printed along with your writing while receiving payment.</p><p style=\"\"><strong>Don't fall for the \"more minutes &amp; lectures = more value\" trap.</strong></p><p style=\"\"><strong>Also, don't fall the \"that course costs more so must be better trap.\"</strong></p><p style=\"\">This course is on point, snappy, full of personality and if it was a human, would make you breakfast in bed every morning. It is that good!</p><p style=\"\">Want to have a renowned blog in your niche? </p><p style=\"\">Want to know how to promote it.</p><p style=\"\">You should, because that's how it all starts.<br style=\"\"></p><p style=\"\">Oh, I nearly forgot!</p><p style=\"\">I'm also throwing in my eBook \"<strong><em>So You Want To Be A [anything but fiction] Writer</em></strong>\" in as well. It is 45 pages of techniques and ideas on how to write compelling and shareable content.</p><p style=\"\"><strong>So you get:</strong></p><p style=\"\">1) A snappy course on how to build a great website;</p><p style=\"\">2) Insights on how to promote your site via social media;</p><p style=\"\">3) Tips of how to get editors of other publications to want to pay you for your writing; and</p><p style=\"\">4) My eBook on how to write great stuff that people want to pay you for!</p><p style=\"\">So, what are you waiting for.</p><p>Enroll :)</p><p style=\"\"><br></p>", 
    "end_date": null, 
    "title": "How to Create and Run Your Own Authority Blog", 
    "price": "20.00", 
    "instructors": "Dennis Freedman", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486598_adb1_3.jpg", 
    "course_url": "https://www.udemy.com/how-i-built-an-authority-blog-using-wordpress-and-so-can-you/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-26T09:39:10Z"
}