{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    In association with the Make Money from Home LIONS CLUB.  </p>  <p>  \t            NO PRIOR EXPERIENCE REQUIRED. ALL INSTRUCTIONS ARE FULLY DETAILED AND STEP-BY-STEP SO ANYONE CAN FOLLOW THEM EASILY.  </p>  <p>  \t                                        Learn how to make a professional website or blog on your own domain in less than a couple of hours, and learn how to do it all using the Internet&#039;s most popular Content Management System: WordPress.  </p>  <p>  \t                                      Today I’m going to show you how to make a website (or blog) on its own domain, without coding, using WordPress (it’s a surprisingly simple process). These are professional websites with any look that you want (and can incorporate anything that you want, including social media buttons, “buy now” buttons, mailing list forms, Google maps, etc.).  </p>  <p>  \t<strong style=\"\">Note</strong>: When I say we will be creating a website using WordPress, I don&#039;t mean creating one through the WordPress website. Websites created through the WordPress website are severely limited in what you can do with them and offer very little flexibility overall. The method I teach enables you to create truly professional websites by installing the WordPress software and you won&#039;t be limited in any way.  </p>  <p>  \t                                      Not only is WordPress very easy to use, it is 100% free and makes your website completely customizable. Over 15% of websites online have been created with WordPress; if you can use Microsoft Word, you can make a website using WordPress (this website was made using WordPress…and I don’t even know any code!).  </p>  <p>  \t<strong style=\"\">Set aside one hour and make your first website TODAY!</strong>  </p>  <p>  \t                                      The point of today’s exercise is simply for you to get your feet wet and to get a website online that you can play and experiment with. Don’t worry too much about what this first website is going to be about (unless you already know for sure what you want to do); just <em style=\"\">get something online</em>. After you complete this first project and feel comfortable with the process of putting together a professional looking website, then you can start developing any kinds of websites you want.  </p>  <p>  \t                                      Note: If you don’t know what to make your first website about, a fun first project could be building a website for your new side business: freelancing websites for others. After all, once you’re done with the first four lessons, you’ll be qualified to build fairly basic, but professional looking websites. Then start charging people $500 per website to make yourself some extra money! When I first learned how to make a website with WordPress, I used to post my services on Craigslist daily, and I would get at least two to three gigs per month. You could simply make your website YourName dot com or YourNameWebsiteCreationServices dot com. :)  </p>  <p>  \t                                      You can also make yourself a blog about your favorite hobby or one that follows your experiences with building an online business – personal blogs that develop a regular readership make A LOT of money.  </p>  <p>  \t                                      If you do have any trouble with building your first website today, simply send me an email through my page and I’ll be happy to help out.  </p>  <p>  \t                                      What will be the total cost of your website? About $15 / year for the domain and $10 / month for hosting (the hosting can be used for as many domains as you want, so the price never goes up).  </p>  <p>  \t                                      You can watch the entire process of me creating a basic blog on its own domain on the video on this page in less than 15 minutes.  </p>  <p>  \t                                      This is the first of four video lessons where I will show you the entire completion of the website <a href=\"http://mikeomarphotography.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Mike Omar Websites</a> ALL IN UNDER ONE HOUR TOTAL! Follow along in the video lessons and you’ll see just how easy it is to build a website. :)  </p>  <p>  \t                                      Also, included as a bonus chapter, an introduction to how to build passive income websites using WordPress, and how making money online <em style=\"\">actually </em>works!  </p>  <p>  \t                                               Here are the specific topics covered in this course:<br style=\"\">  \t<br style=\"\">  \t                                               TECHNICAL / SETTING UP:  </p>  <ul style=\"\">  \t<li>The SMARTEST and CHEAPEST way to buy a domain.</li>  \t<li>The SMARTEST and CHEAPEST way to buy a hosting package.</li>  \t<li>Linking your domain to your hosting account and installing WordPress.</li>  </ul>  <p>  \t<br style=\"\">  \t                                               BASICS:  </p>  <ul style=\"\">  \t<li>An introduction to WordPress and best Search Engine Optimization (SEO) settings for your website.</li>  \t<li>How to add pages for regular websites.</li>  \t<li>How to add posts for blogs. </li>  \t<li>How to add pictures and links. </li>  \t<li>How to set up a sidebar using widgets.</li>  \t<li>How to change the look of your website with different themes. </li>  \t<li>How to add a contact form, plugins, and social media buttons.</li>  </ul>  <p>  \t<br style=\"\">  \t                                               ADVANCED:  </p>  <ul style=\"\">  \t<li>How to install Google Analytics for tracking.</li>  \t<li>How to add &quot;buy now&quot; PayPal buttons.</li>  \t<li>How to add an interactive &quot;Google Maps&quot; map to your website.</li>  \t<li>How to set up a mailing list / newsletter (and best practices for doing so).</li>  \t<li>How to protect your website from hackers, malware, and other viruses. </li>  \t<li>Resources for e-commerce websites, doing keyword research, doing link building and SEO, affiliate marketing, membership websites, outsourcing, video recording, and more!</li>  </ul>  <p>  \t<br style=\"\">  \t                                               AN INTRODUCTION TO MAKING MONEY ONLINE:  </p>  <ul style=\"\">  \t<li>What are some of the most common methods for making money online? </li>  \t<li>What is the simplest way to make passive income online? </li>  \t<li>If I want to make money online, where do I start? </li>  \t<li>The Structure of a $1,000 per Month Passive Income Website.</li>  </ul>  <p>  \t                                               This course will enable you to build a professional website on your own domain in less than a couple of hours AND teach you a skill set that will blow open your possibilities for entrepreneurship!  </p>  <p>  \t<strong style=\"\">NOTE</strong>: Throughout my course you will be referred to video lessons. While everything in video lessons are as up to date as possible (I frequently update the video lessons), the place to check for the most up-to-date information is in the <em style=\"\">video descriptions</em> (on the same page you watch the videos). This can be the video descriptions on the pages of the LIONS CLUB website, or the video description of the Udemy or YouTube pages. Be sure to read the video descriptions of each video <em style=\"\">before </em>watching the video itself.  </p>", 
    "end_date": null, 
    "title": "How to Make a Website / Start a Blog w/ WordPress in 2 hours", 
    "price": 0, 
    "instructors": "Mike Omar", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/97392_ebfd_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-website-or-start-a-blog-with-wordpress/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-25T20:00:34Z"
}