{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Follow along step by step and learn exactly <strong style=\"\">H</strong><strong style=\"\">ow to start your own Fashion Blog. Using the worlds leading blogging platform WordPress, go through the process of creating for yourself an amazing, clean and minimalistic fashion blog from scratch in under 2 hours!</strong></p><p style=\"\"><strong style=\"\"><em style=\"\">Try the course today risk free with a 30 day money back guarantee</em><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">_________________________________________________</strong></p><p style=\"\">Over the course of <strong style=\"\">13 lectures </strong>you&#039;ll learn:</p><ul style=\"\"><li style=\"\">How to find and purchase a domain for your fashion blog</li><li style=\"\">How to select a hosting provider to keep your blog online 24/7</li><li style=\"\">How to find the best fashion blog themes to make your site look amazing</li><li style=\"\">How to <strong style=\"\">save yourself 1000s</strong> by using a premium WordPress theme</li><li style=\"\">How to set up a WordPress website (it&#039;s easier than you think)</li><li style=\"\">How to add pages to your fashion blog</li><li style=\"\">How to add a menu to your fashion blog</li><li style=\"\">How to create a blog carousel to display your posts</li><li style=\"\">How to add images to your blog posts and sidebar</li><li style=\"\"><em style=\"\">And so much more. <br style=\"\"><br style=\"\"></em><em style=\"\"><em style=\"\">When you&#039;ve finished the course you&#039;ll have a fully set up, online Fashion Blog ready for you to embark on your own fashion blogging journey. You&#039;ll know how to create blog posts, add pages, upload images and work with your menu, select featured posts and know the basics of WordPress.</em></em></li></ul><p style=\"\">__________________________________________________</p><p style=\"\">With over 6+ years of website building experience and having worked on countless blogs I can guide you step by step through creating your own fashion blog and <strong style=\"\">answer any and all of your questions.</strong></p><p style=\"\"><strong style=\"\">__________________________________________________</strong></p><p style=\"\">The lectures in this training series are all from a <strong style=\"\">live recording session where over a 2 hour period where I built a fashion blog from scratch live on the internet</strong>. What you&#039;re watching in these lectures is the recording of myself going through each element of building a fashion blog one part at a time. </p><p style=\"\">In fact if you want to see what you&#039;ll be creating you can view it live on the internet right now. Just Google<strong style=\"\"> &quot;Fashion Summit HQ&quot; </strong>and you can see the website we create in this training. </p><p style=\"\">If you are an:</p><ul style=\"\"><li style=\"\">aspiring fashion blogger looking to create your own fashion blog</li><li style=\"\">enthusiastic individual that just wants to build a blog of any type</li><li style=\"\">simply interested in learning how to build a fashion blog</li></ul><p style=\"\"><em style=\"\">Then this course is totally for you.</em></p><p style=\"\">__________________________________________________</p><p style=\"\"><strong style=\"\">Bonus Section</strong></p><p style=\"\">Learn how to build a great looking fashion blog logo in under 10 minutes. From choosing a type face to finding a icon for the logo by the end of the section you&#039;ll have a logo perfect for your blog. <br style=\"\"></p>", 
    "end_date": null, 
    "title": "How To Create Your Own Fashion Blog From Scratch ", 
    "price": "20.00", 
    "instructors": "Sam Mayell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438030_ca58.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-your-own-fashion-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T23:13:05Z"
}