{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn How To Build A Website Using WordPress...</p>\n\n<p>A Step by Step Tutorial for Beginners!</p>\n\n<p>I have been using WordPress to build SUCCESSFUL websites for over 6 years and been teaching people to do it for over 4!</p>\n\n<p><strong>Why Should You Take This Course?</strong></p>\n\n<ul><li>Learn To Build A WordPress Website in Less Than 2 Hours</li><li>The Website Will Be Fully Responsive (Mobile Friendly)</li><li>I Will Share A Coupon Which Gets Your First Month Hosting For 1 Penny!</li><li>Learn To Create A Logo For Free!</li><li>Using Most Up To Date Version of WordPress</li><li>Get A Certificate of Completion</li><li>All Lectures Are Downloadable</li><li>I have got 6+ Years experience of working with WordPress</li><li>I own 2 different websites which combined have taught thousands of people how to create websites with WordPress</li><li>This course is 100% FREE to enroll and always will be!</li><li>I always respond to my students questions!</li></ul>\n\n<p>There are a total of 21 Lectures (plus an intro and an outro) over a total of 105 Minutes. </p>\n\n<p>This may seem like very little time, but believe me when I say that its MORE than enough time to build an AWESOME website using WordPress!!</p>\n\n<p>Don't worry if all you have you used your computer for so far is sending and receiving emails... by following this course I can almost guarantee that you will be able to build a website using WordPress... and an AMAZING website at that!!</p>\n\n<p>Not only will you learn to build a website, step by step but I have also included a link to another video of mine which will show you how to make a logo for FREE!</p>\n\n<p>So go ahead and enroll today and let's build a WordPress Website... TOGETHER!</p>\n\n<p>MartieDread.</p>", 
    "end_date": null, 
    "title": "How To Build A Website Using WordPress - AMAZING", 
    "price": 0, 
    "instructors": "Martie Dread", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685162_0a6e_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-website-using-wordpress/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T17:24:01Z"
}