{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Here's what some students are saying about this course:</strong></p><p><em>\"Really the best course for the money! I'm just about done building my website, and I'm very happy with how it's all coming together.\" - </em>Sam McLaurin</p><p><span></span><em>\"Excellent course! Saad pulls no punches. He dives right in and starts building a great website. I don't think that I need to elaborate on how amazing the end result website looks, but the clear, step by step approach and the high definition resolution are things I wish were standard for all other Udemy courses\". - </em>Alex Fisher</p><p><em>\"Saad, this is an excellent course and I am using it to get my own website designed and then up and running once I finish all the copy for the pages\"</em><em>.</em> - Mike Hulme<br></p><p>___________________________________________________________________________________________________</p><p>This course teaches you how to build a professional website, using the popular WordPress platform. The website you'll be building incorporates design elements that are inspired by websites belonging to some multi-Billion dollar companies, such as Apple, Uber, AirBnB, and other big companies.</p><p>Just start this course, and in about 3 hours you will be able to create the same awesome website we are going to be creating together. Everything is FREE, except for the domain name and the hosting plan, which are needed by every website, but they are also fairly inexpensive. The website will cost less than $12.96 to start, and this price includes the domain registration for an entire year, as well as the first month of hosting. After that, there will be a recurring monthly fee for hosting. And depending on your plan, the monthly hosting fee starts at around $5/month).<br></p><p>Take advantage of what I think is one of the best WordPrss courses on Udemy. This website will be built using the most up to date (2016) versions of popular plugins, and it will use one of the most popular themes on WordPress. </p><p>In this course, you will not only build an amazing website, but you will optimize it even before it is launched, so that by the time the site is ready to go live, your site will be off to a great launch. The course consists of 7 sections, containing over 33 lectures. Lectures are easy to follow and the screen-cast was conducted using a high definition resolution.</p><p>You should take this course if you want to create an awesome website for yourself or your business, but also if you want to get started with search engine optimization, since building the website is only half the battle. By the time you get done, you will have a website that rivals those of well respected companies.</p><p>This course will be updated regularly to make sure that every bit of information remains relevant, because the digital world is fast moving. </p>", 
    "end_date": null, 
    "title": "How to Make a WordPress Website 2016", 
    "price": "20.00", 
    "instructors": "Saad Hamadi, MBA", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/768334_c077_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-wordpress-website-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-20T03:36:58Z"
}