{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">How to Build a Form?</strong></em></p>  <p style=\"\">This is the exact question we get asked almost daily by our WordPress website clients. Our answer has always been “…get the <a title=\"Don&#039;t Own the Gravity Forms Plugin? Get Your Copy Here!\" href=\"http://wpprobusiness.com/go/gravity-forms/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Gravity Forms</a> plugin.”</p>  <p style=\"\"><em style=\"\"><strong style=\"\">Why?</strong></em></p>  <p style=\"\">Before the <em style=\"\">Gravity Forms</em> plugin existed we used a variety of freely available plugins for WordPress that allowed us to <em style=\"\">build web forms</em>   but we quickly reverted to creating our own custom web forms as soon as   something more robust than a simple “Contact Us” form was needed.</p>  <p style=\"\"><em style=\"\"><strong style=\"\">Then Gravity Forms was Released by Rocketgenius.</strong></em></p><p style=\"\">When we first became aware of <a href=\"#Don&#039;t own the Gravity Forms plugin yet? Get it now then take our video course.\" style=\"\">Gravity Forms</a>  back in 2010,   our first thought was “why do we need to buy a plugin to build website   forms when we already have free ones available, and if needed, we could   simply code our own?”</p>  <p style=\"\">But that thought quickly faded as we took a closer look at the features and capabilities of the <em style=\"\">Gravity Forms plugin</em> for WordPress. Not only does it provide a simple interface for <em style=\"\">building web forms</em>, but it also provides incredible tools for creating very advanced web forms, all with a simple point and click interface.</p>  <p style=\"\"><em style=\"\"><strong style=\"\">Why We Created This How to Build a Form Video Tutorial Course.</strong></em></p>  <p style=\"\">Since purchasing the <a title=\"Don&#039;t Own the Gravity Forms Plugin? Get Your Copy Here!\" href=\"http://wpprobusiness.com/go/gravity-forms/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">developer license</a>   of the Gravity Forms plugin and using it on our sites and those of our   clients, we have have been nothing but impressed with both the ease of   use and also the support that the folks at Rocketgenius provide. Not   only that, but they are continually developing this plugin and adding   new features requested by customers.</p>  <p style=\"\">However, although there is a lot of written documentation provided to   purchasers of this plugin, we are visual learners and do much better   when seeing something in action rather than reading through a “how to   build a form” series of web pages.</p>  <p style=\"\">It wasn’t just us. Because we own the developer license and we use   this on many clients sites, there were numerous times when site owners   wanted to use the plugin to create an additional web form for their   business and didn’t know how to use Gravity Forms. It was then that we   started including “how to build a web form” videos for our clients, and   it turned out that they were visual learners too. Seeing it in action   allowed them to “just get it”.</p>  <p style=\"\">Maybe you’re a developer or site owner with the same set of problems? Then this course is for you.</p>", 
    "end_date": null, 
    "title": "How to Build a WordPress Form Using the Gravity Forms Plugin", 
    "price": "20.00", 
    "instructors": "Adam W. Warner", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29197_f1a1_5.jpg", 
    "course_url": "https://www.udemy.com/gravity-forms-wordpress-plugin-video-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-09T21:54:51Z"
}