{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><p>Ok,  so want to promote your business online but first you need to get a nice  looking website up and running.</p>    <p>Problem  is that you have no clue even where to start and no money to hire one of those  web designer gurus to do it for you for a zillion dollars.</p>    <p>Luckily  there is a great solution out there to create websites for free!</p>    <p>It&#039;s  called WordPress but you have no idea how to get WordPress up and running and  don&#039;t have the time to go out there and doing a bunch of research to just get a  basic site up.</p>    <p>In  this cool online wordpress course I will teach you the wordpress basics on how to get a  WordPress site up and running in no time, but most importantly, <strong>I&#039;ll teach you how to attract visitors so  you can become profitable as soon as possible.</strong></p>    <h5><strong>What  will you learn?</strong></h5>    <p>The basic wordpress course will cover:</p>    <p>●&nbsp; <strong>How to get a domain:</strong> 3 tricks to find great available domain  names for your website and 1 cool trick to always pay less for them than anyone  else.</p>    <p>●&nbsp; <strong>How to get web hosting:</strong> find affordable web hosting providers  and learn your way around their admin panels.</p>    <p>●&nbsp; <strong>How to install WordPress:</strong> how to install  WordPress via FTP or with 1-Click Installs from your webhost.</p>    <p>●&nbsp; <strong>How to make your first post:</strong> Give it a title,  HTML vs Visual view.</p>    <p>●&nbsp; <strong>Categories vs Tags:</strong> what are they and how to use them to  best organize your content.</p>    <p>●&nbsp; <strong>Learn to use Pages vs Posts:</strong> Learn to use wordpress pages and posts the  right way.</p>    <p>●&nbsp; <strong>How to upload a picture:</strong> Learn to resize and upload  pictures to your blog.</p>    <p>●&nbsp; <strong>How to insert a video:</strong> Uploading and embedding videos using  YouTube and Vimeo.</p>    <p>●&nbsp; <strong>How to change the look with themes:</strong> where to find great  free themes for free and install them.</p>    <p>●&nbsp; <strong>Best places to hire an affordable designer:</strong> a couple of places  to hire the best designers for peanuts.</p>    <p>●&nbsp; <strong>How to enhance your site using free plugins:</strong> learn to install an  manage plugins to make your site faster and more reliable.</p>    <p>●&nbsp; <strong>How to track traffic to your site:</strong> Use JetPack and  Google Analytics to track everything about your visitors.</p>    <p>●&nbsp; <strong>How rank high on search results:</strong> Learn basic search  engine optimization and social media techniques to increase those juicy visits  really fast.</p>    <h5><strong>You  will learn how to drive valuable traffic to your new site</strong></h5>    <p>Getting  your site online is the first step to benefiting from the great wonders the  Internet can offer you.</p>    <p>However..</p>    <p>It  really doesn&#039;t matter how pretty your site is if no one gets to see it.</p>    <p>Success  on the Internet is really a numbers game, the more visitors you get the more  sales you get, plain simple.</p>    <p><strong>So in this course I devote 8 whole  chapters to teach you how to get your site noticed, promoted, and loved by the  world</strong>  so you can get those coveted eyeballs looking your way and help your online  business thrive.</p>    <h5><strong>But  Wait! there is more..</strong></h5>    <p>As  a bonus I&#039;ll:</p>    <p>-  Let you peak inside my own website&#039;s traffic stats and explain them.</p>    <p>-  How to install a live chat to talk to visitors in real time.</p>    <p>-  How to install a cool rotating ad banner to showcase your main products.</p>    <p>-  How to create a good looking Facebook page widget for your site to increase  your followers.</p>    <p>-  How to set up a free Newsletter to keep in touch with your audience and  generate more leads.</p>    <p>-  and to top it all! just to make sure have a good time learning..</p>    <p><strong>I&#039;ll even serenade you with the first  WordPress song ever</strong>, composed and horribly sang from me to you.. with  luuuvvvv</p>    <p>(PS:  If you sit through the whole song you&#039;ll get bonus points <img width=\"13\" height=\"13\" src=\"file://localhost/Users/cozengokce/Library/Caches/TemporaryItems/msoclip/0/clip_image002.gif\">&nbsp;)</p>    <p><strong>This course has 51 chapters shot in HD  video amounting to over 4 hours of instruction</strong> where I pour all my  knowledge accumulated over the years.</p>    <p>My  own company, Grumo Media runs on WordPress and I am happy to say than I run a  very profitable online business using this awesome free platform.</p>    <p>Now  I want to share all I have learned with you so you can become successful online  too!</p>    <p>Ready?  let&#039;s do it!</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "How to Create a Successful WordPress Site", 
    "price": "25.00", 
    "instructors": "Miguel Hernandez", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/11922_2eba_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-profitable-wordpress-site-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-12-17T12:10:47Z"
}