{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>If you&#039;ve always wanted to build a personal or business website , this course is going to teach you exactly what you need to know.&nbsp;</p>    <p>The Quick Start Website&nbsp;is a step-by-step video tutorial course to help you get your first&nbsp;<em style=\"\">WordPress website&nbsp;</em>up and running. It is a<span>&nbsp;thorough overview of the WordPress interface and is designed for small business owners, self-employed professions and any other individuals who want to build their attractive, high quality websites, quickly.</span><strong style=\"\"><strong style=\"\"></strong></strong></p>    <p><span>In order to create a self-hosted WordPress website, under your own domain name, you will need to purchase a domain name and web hosting, though we will show you exactly what you need to do to set that up.</span></p>    <p><span>Typically domains will cost you $10 per year and web hosting will cost between $7-10 per month (though I can get you 25%%%% off!). You will be able to use the same hosting account for all your websites, both business and personal.</span></p>    <p>I will show you how to install WordPress onto your web hosting account. How to customize WordPress by changing the theme/ colours to match your business brand or mood, adding extra functions with plugins and widgets and add custom images and logos.<strong style=\"\"><strong style=\"\"></strong></strong></p>    <p>I will teach you to create the 5 key pages that a website should have. Each page we create contains different functions which can be used on ANY page of your site such as adding images, video, contact forms, Google maps, testimonials, Social Media Icons, plus much more</p>    <p><strong style=\"\">Who Is This Course For?</strong></p>    \t<li>If you&#039;ve always wanted to get a website for your business or for a personal interest then this is going to be the course for you.</li>  \t<li>If you already have a WordPress website and you have some features which you would like to add, but you don&#039;t know how to, then this course will help you - I am also happy to make extra tutorials for anything not covered in the course!</li>  \t<li>Beginners who want to get their off-line business on-line</li>  <p><strong style=\"\">It Is Probably Not For You If:</strong><strong style=\"\"><strong style=\"\"></strong></strong></p>    <ul style=\"\">  \t<li>You are very proficient with WordPress already, though there is a chance that you may learn something new!</li>  </ul>", 
    "end_date": null, 
    "title": "How To Create Your Own Website", 
    "price": "30.00", 
    "instructors": "Jennifer Bailey", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54659_de1b_9.jpg", 
    "course_url": "https://www.udemy.com/quick-start-website-how-to-build-your-own-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-17T08:50:02Z"
}