{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">This course takes you behind the curtains of the popular software, Homestead Sitebuilder. Using the software you will learn to go from blank web page to a full-blown website in as little as 3 to 5 hours. However, there&#039;s no rush so you can also take your time, if you so choose.</strong></p><p><strong style=\"\">Not only will you learn how to build web pages with ease, but you will also learn how to sell products and/or services from your web pages.</strong><strong style=\"\"></strong>  </p>  <p>  \t <em style=\"\">(Course Updated May 15, 2015)</em>  \t <strong style=\"\"></strong>  </p>  <p>  \t<em style=\"\"><strong style=\"\">Who is this course for?</strong></em>  </p>  <ol style=\"\">  \t<li>Small business owners who want to sell their products and/or services online</li>  \t<li>Startups - new business owners or those that are thinking of starting a business.</li>  \t<li>Individuals wanting to sell products online</li>  \t<li>Affiliates who want to promote products for profits</li>  \t<li>Aspiring web designers who want a simple solution for building websites</li>  </ol>    <p>  \t<em style=\"\"><strong style=\"\">Benefits:</strong></em>  </p>  <ul style=\"\">  \t<li>Learn to build squeeze pages (lead generators)</li>  </ul>  <ul style=\"\">  \t<li>Quickly create web pages to sell your own physical products</li>  </ul>  <ul style=\"\">  \t<li>Easily whip together a web page to sell your services</li>  </ul>  <ul style=\"\">  \t<li>Build web pages with &quot;forms&quot; to collect leads or generate estimates/proposals</li>  </ul>  <ul style=\"\">  \t<li>Host images on your domain</li>  </ul>  <ul style=\"\">  \t<li>Add Multimedia to your web pages - Audio, Video, Slideshows and More!</li>  </ul>  <ul style=\"\">  \t<li>Easy to edit your own web pages, no waiting on programmers</li>  </ul>  <ul style=\"\">  \t<li>Inexpensive hosting that is expandable, easy to add additional websites</li>  </ul>  <ul style=\"\">  \t<li>Discount on registering your domain names</li>  </ul>  <ul style=\"\">  \t<li>This May Very Well Be The World&#039;s Easiest Way to Build a Website</li>  </ul>    <p>  \t <em style=\"\"><strong style=\"\">Course Structure</strong></em>  </p>  <p>  \t                  This course is structured in an easy to follow step by step system with videos helping you every step of the way. You simply look over the shoulder of an expert user that has over 12 years of experience and follow the instructions within the video, audio or course documents.  </p>    <p>  \t <em style=\"\"><strong style=\"\">Why Take This Course</strong></em>  </p>  <p>  \t                  If you have ever felt intimidated when it comes to learning how to build a website, then this course is a complete no-brainer. This course will save you thousands of dollars and give you complete control over the creative, business and/or personal direction you want to take.  </p>    <p>  \t <em style=\"\"><strong style=\"\">Let&#039;s Do This...</strong></em>  </p>  <p>  \t              Best of all, you are only limited by your imagination. You don&#039;t have to spend long periods of time learning HTML, CSS, PHP, JavaScript or any additional skills to benefit from this course!  </p>", 
    "end_date": null, 
    "title": "How to Build Websites that Sell Using Homestead Sitebuilder!", 
    "price": "20.00", 
    "instructors": "Jake Toney", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65196_11d3_5.jpg", 
    "course_url": "https://www.udemy.com/the-worlds-easiest-way-to-build-websites-that-sell/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-12T21:48:22Z"
}