{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Migrate or Copy a WordPress website to a new location</strong>  </p>  <p>  \t    The course will provide you step by step instructions to migrate or copy a WordPress website from one hosting provider to another. You will also be able to migrate the website from root folder to a sub-folder within the same hosting provider. The course explains different methods of migration which enables the user perform the migration in various settings.  </p>  <p>  \t<strong style=\"\">  Who should take this WordPress migration course and why?  </strong>  </p>  <p>  \t    WordPress migration or copy or backup is required at multiple places. Its done either for safety purposes as a backup copy or for various other reasons like restoring a website after a virus attack or for doing affiliate marketing, where we need to replicate the website (or landing page) on more than one server. You may simply need it when you need to change your hosting provider.  </p>  <p>  \t    It can also be used for commercial reason where you want to make extra money for:  </p>  <ol style=\"\">  \t<li style=\"\">Migrating any WordPress website from one server to another</li>  \t<li style=\"\">Making a replica of the same website on multiple servers (affiliate marketing or multiple landing pages)</li>  \t<li style=\"\">Providing backup services to your customers on regular basis</li>  </ol>  <p>  \t    The course explains the important components of a WordPress website and how we can migrate them individually. It also explains a fast way of migrating using a free WordPress plugin.  </p>  <p>  \t    All the 12 videos (19 Lectures in Total) are closed captioned and there is set of 15 questions to test your skills. Videos are the demonstration of the real migration process in different settings. All the chapters are summarized in separate PDF files to provide you a generic overview of what you completed in your video tutorials.  </p>", 
    "end_date": null, 
    "title": "How to Migrate or Copy a WordPress Website ?", 
    "price": "20.00", 
    "instructors": "W3 Creatives", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430504_46b2_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-migrate-or-copy-a-wordpress-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-24T00:45:44Z"
}