{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tWhat is the Parallax design?  </p>  <p>  \tBy definition, parallax means the apparent displacement or the difference in apparent direction of an object as seen from two different points not on a straight line with the object. In web design use, parallax refers to the scrolling technique used to create the illusion of depth on websites. This technique is not new however, this technique has been around for quite some time in the web design community before its recent rise to a trending style. The use of this technique to create the illusion of depth can also be traced back to older forms of media, like old school video games for instance. Below you&rsquo;ll find some nicely designed websites that masterfully utilize this hot new trend.  </p>  <p>  \tThere hasn&rsquo;t been a design style that has captured the web&rsquo;s creative community like that of parallax website design in ages, which, in non industry terms, is about a few months. You might be wondering what parallax website design is, I don&rsquo;t believe I have ever heard of this. Well actually you have heard it, and seen its use for some time now. Before going into showcasing some really well designed websites utilizing parallax design, let&rsquo;s take some time to examine and explain what it is.  </p>  <p>  \tWhat do you get with this course:  </p>  <ul style=\"\">  \t<li>Free Template </li>  \t<li>Tips on where to get templates </li>  \t<li>Unlimited access to the instructor </li>  \t<li>Dreamweaver Skills</li>  \t<li>Photoshop Skills</li>  \t<li>And Much More</li>  </ul>  <p>  \tThere&rsquo;s a new design trend we see becoming more and more prevalent, especially coming into the year 2013, and that&rsquo;s parallax design. So basically what parallax design is, is that it&rsquo;s a vertical scrolling page that interacts with your audience in a very interesting way. Basically you can scroll down on the page, which tells a story kind of in an animation kind of way. It interacts with your audience in a way that very usable, very friendly, and without the use of flash, which is going to increase the likelihood of it showing up consistently across a number of different browsers as well as on a mobile device.  </p>", 
    "end_date": null, 
    "title": "How to build a Parallax Website without Coding", 
    "price": "25.00", 
    "instructors": "Freedom Portis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/76698_38b7_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-a-parallax-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-10T14:42:33Z"
}