{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong>This course was updated to Wordpress 4.0</strong>  </p>  <p style=\"\">  \t    Do you have a great business idea?  </p>  <p style=\"\">  \t    Are you wondering how to make your online business idea a reality?  </p>  <p style=\"\">  \t    If so, then this course is for you!  </p>  <p style=\"\">  \t    I have started several successful online businesses, and I want to show you how I did it. I'm not going to show you how to come up with a great business idea, there are lots of courses out there that do that, I'm going to show you how to actually get your online business idea out of your head and on to the internet. After all, an idea isn't worth a single penny until you act upon it.  </p>  <p style=\"\">  \t<strong>The Greatest Deal On Earth</strong>  </p>  <p style=\"\">  \t    When you buy this course, you get access to several deals for your online business that will more than pay for the cost of the course. You will be able to create as many websites as you want for about $5 per month (regularly $7 per month) and get another $30 off your hosting account on top of that. As if that weren't enough, purchasing this course gives you access to a discount on your web hosting and over $100 in free online advertising with Google, Bing and Yahoo.  </p>  <p style=\"\">  \t<strong>What Will I Learn in This Course?</strong>  </p>  <p style=\"\">  \t    In this course, you will begin by learning how to build your own website with no experience and no coding required using WordPress. You learn how to optimize your site for search engines so you can actually be found online. I will also show you some great free WordPress plugins that will make your website stand out from the crowd and free web apps you can add to your site that will super charge your business.  </p>  <p style=\"\">  \t    Along the way you will be learning all the essentials of running an online business from creating e-mail addresses, creating multiple websites, creating site maps, working with your website's files and using free accounting software.  </p>  <p style=\"\">  \t<strong>What Kinds of Websites Can I Build?</strong>  </p>  <p style=\"\">  \t    Any kind you want. You can build e-Commerce sites, blogs, company websites, subscription sites, affiliate sites and more. In the course, you can follow along with me as I show you how I built my latest and greatest e-Commerce website. You will learn so much about how to build websites using WordPress that you will even be able to build websites for other people as a business!  </p>", 
    "end_date": null, 
    "title": "How to Build Your Own Online Business with WordPress", 
    "price": 0, 
    "instructors": "Stone River eLearning", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42397_7158_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-your-own-online-business/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-19T15:57:50Z"
}