{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>This course is HTML5 focused, will teach you HTML5</strong></p><p><strong>HTML5</strong> is the latest evolution of the standard that defines HTML. This course will teach you everything you need to know in order to create websites using HTML5.  Modern web design course with New HTML5 elements, attributes, and behaviors.</p><p>Learn HTML5 which allows more diverse and powerful Web sites and applications. <span></span></p><p>All Resources, Source Files, Top Links and additional reading material is included, so that you can get started quickly creating website using HTML.  I've developed hundreds of websites and I'm going to share what I have learned over the past 15 years developing websites within this course.   </p><p>This is a perfect course for beginners who want learn more about HTML5.  </p><p>Topics covered in this course include:</p><ul><li>Create a default HTML5 template to use and reuse to create unlimited websites (source code included)</li><li>How to create a mockup for your website design</li><li>All about content sectioning and proper website design structure</li><li>adding a navigation bar to your web project</li><li>Inline text semantics</li><li>HTML5 elements that a new and powerful</li><li>How to add audio video and other media</li><li>Introduction to using Canvas to draw within HTML5</li><li>More options for forms that are now more mobile compatible</li><li>example contact form for your website</li><li>Interactive HTML5 elements</li><li>Progress bars and more</li><li>Tables and element attributes</li></ul><p>We complete the course showing you how to add CSS in order to style your website creating a full 4 page website from scratch with the code discussed within the course.</p>", 
    "end_date": null, 
    "title": "HTML5 course for Beginners Learn to Create websites", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761934_ca5e.jpg", 
    "course_url": "https://www.udemy.com/html5-course-for-beginners-learn-to-create-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-14T02:58:40Z"
}