{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>If you are in Business you know how importance a website is. It is like your business identy. but when you want to create your own webiste and contact a webdesigner, they'll charge you thousand of dollars to create that. Because they know how write code to make a website and you don't. But think if you know how to write code and create your own website, it's not just save you money it also make you money, How? just create websites for others and they will pay you thousand of dolars just doing that. So that's why this course are. In this course I'll tech HTML and CSS the language behind every website.</p><p>In the first chapter we start with HTML5. First of all we learn what is html and learn it's syntax and semantics. Then we move onto basic document structure, how to properly section pages and how to use HTML to format page content using phrase elements and font markup language.</p><p>After that, we'll explore how to properly create hyperlinks and lists. Finally, we look at html5 forms and table. And also explaning html5 audio and video tags and some embed tag like iframe.</p><p>On the next chapter we move onto styling part the CSS. In this chapter you will learn about what CSS is and what it can do for you. we start with CSS syntax then move onto fonts, colours, margins, padding, lines, links, height, width, background images. We also take an in depth look at advanced positions like absolute position, relative position and fixed position. Also we look at how to create beautiful gradient effects and many other cool things.</p><p>Thanks for watching this video, and I can't wait to show you how easy it is to begin writing html and CSS code to create your own website. </p>", 
    "end_date": null, 
    "title": "HTML & CSS : Code Your Own Interactive Websites", 
    "price": "35.00", 
    "instructors": "Somenath Sen", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792484_cc98_3.jpg", 
    "course_url": "https://www.udemy.com/html-css-code-your-own-interactive-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T15:39:39Z"
}