{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Course Updated 31 January 2016<br></strong></p><p><strong></strong></p><p><strong>Why are 18,946 students wanting me to mentor them in 38 Udemy courses? 18,946 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p>You are about to learn how to work with HTML and CSS and create websites from scratch. I am a native English speaker so you will be able to understand me easily as I teach you step by step how to create a website from the very beginning</p><p>In this course, we will create a website for a sample law business right from the beginning. You will get to start with a blank page and, with step by step instructions, create a complete website. You can then take what you have learnt and offer to build websites for clients (potentially earning thousands of dollars if you do it correctly!)</p><p>You will learn how to create your first html document and learn how to correctly use CSS.</p><p>You will also discover how to work with sub menus and learn how to add CSS to sub menus as well.</p><p>Discover how to work with images and ensure that they fit correctly on your website.</p><p>You will even create the Contact Us section, add telephone numbers and even social media links to your website. </p><p>Also included is the ability to add contact forms and how to create additional pages and links on your website.</p><p>Take this course today - you are covered by a full 30 day money back guarantee.</p>", 
    "end_date": null, 
    "title": "HTML and CSS: Create Complete Websites for Fun and Profit", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/681076_3c89_3.jpg", 
    "course_url": "https://www.udemy.com/create-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-26T00:13:18Z"
}