{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>UPDATE: Course updated and is ready for 2016</strong></p>  <p>Get the course now while the price is still low ... just CHECK OUT THE REVIEWS below!<br></p>  <p>  \t  Over 1400 students have joined this course ... a HUGE thank you to each and everyone. Do not miss out - enroll NOW and join them!  </p>  <p>  \t<strong>Create Inspirational Websites with Mood Boards and Style Tiles to Mobile First Design!  \t</strong>  </p>  <p>  \t      The digital age is upon us - and this means we have to learn its language ... become web-whisperers!  </p>  <p>  \t      Introducing inspirational web design to companies of all sizes - companies that are lost in the ocean of loud noise and customers with ADHD - has never been in more demand.  </p>  <p>  \t      If you are a web designer and need to communicate creative and inspiring ideas and proposals to customers - this course is for you.  </p>  <p>  \t      If you are a building a start-up company or are a project manager and you need to understand the flow of things in the world wide web - then this course is for you.  </p>  <p>  \t      If you want to design your own website and you find that Photoshop is too expensive and too inflexible ... this course is for you.  </p>  <p>  \t<strong>Have your customer feast her eyes on the bright and rich style tiles you create with Inkscape and allow them to taste the sweet and colorful nuggets of Bootstrap 3 goodies!</strong>  </p>  <p>  \t      Present a beautiful and scenic responsive web design ready for the most demanding project.  </p>  <p>  \t<strong>ENLIST NOW</strong> to inspire your boss and draw in new customers with your stunning skills.  </p>  <p>  \t      I will walk you through the design process of a real life case study web design project using the flexible vector drawing tool Inkscape and the popular mobile first Bootstrap 3 HTML and CSS framework!  </p>  <p>  \t      Inkscape is a wonderful FREE professional vector graphics drawing tool that you can use on Windows, Mac OS X and Linux. It's free and open source.  </p>  <p>  \t      Responsive design is fast growing - exploding really - and same can be said about Bootstrap ... as the major framework for creating websites that look great on all internet browsers ... from mobile and tablets to desktops.  </p>  <p>  \t      Designing custom websites using these two solid and trending platforms will get your projects noticed and enable you to MAKE MORE!  </p>  <p>  \t      In this course I lead you ... step by step - focusing on the most important and demanding tasks you need to complete!  </p>  <p>  \t      You will be surprised by how much you can do.  </p>  <p>  \t      My promise to you is this:  </p>  <p>  \t      You will create a complete web design that you can show your boss or customer - based on Style Tiles and a stunning Bootstrap 3 prototype.  </p>  <p>  \t      Everything based on standard and most up to date server vector graphics and HTML.  </p>  <p>  \t      Take the supplied design and customize as you like. Use for your own job advancement or sell to local clients for hundreds or even thousands of dollars!  </p>  <p>  \t      This How-to course is fast-paced ... so hold on as we speed ahead. If you feel I am going too fast - just rewind the video and watch it again :)  </p>  <p>  \t      By following the lectures carefully, you can get a job as a web designer or even sell complete designs to highpaying customers.  </p>  <p>  \t      Does this sound exciting?  </p>  <p>  \t      You must promise me ... and yourself ... to study the entire ... course (don't skip through it and don't just download the design ... make changes and create your own beautiful designs.  </p>  <p>  \t      Use the shortcuts I give you here and just do as the course shows you.  </p>  <p>  \t      Take notes as you go along.  </p>  <p>  \t      I try to answer all messages the same day.  </p>  <p>  \t<strong>Now ... Let's get started</strong>  </p>  <p>  \t      I can't wait to see those amazing web design projects that you'll create using Inkscape and Bootstrap 3!  </p>  <p>  \t      Get ready to have your own design up and running today, right after going through this course ... and be earning big - soon after that!  </p>  <p>  \t<strong>  Grab Your Copy Now.  </strong>  </p>  <p>  \t          Get up and running with this inspiring course on web design success.  </p>  <ul>  \t<li>Full, free lifetime access</li>  \t<li>All future extra lectures and upgrades are always included for free</li>  \t<li>Unconditional Udemy 30 day money-back guarantee ... that's my personal promise of your success!</li>  \t<li>... and much, much more!</li>  </ul>  <p>  \t<strong>  ONE FINAL POINT  </strong>  </p>  <p>  \t          Now you can have your own web design inspiration as you go through this course ... and start earning those big round numbers!  </p>  <p>  \t<strong>  Click the [take this course] button, top right, now ... every hour you delay is costing you money...  </strong>  </p>", 
    "end_date": null, 
    "title": "Inkscape and Bootstrap 3 -> Responsive Web Design!", 
    "price": "20.00", 
    "instructors": "Thrandur Arnthorsson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339938_c694_4.jpg", 
    "course_url": "https://www.udemy.com/inkscape-bootstrap/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T16:24:32Z"
}