{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Du möchtest deine eigene Website mit einem modernen Content-Management-System ins Netz stellen? Dann ist Joomla! 3.5 genau die richtige Lösung für dich! Anhand einer Vereinswebsite zeige ich\ndir Schritt für Schritt, wie du Texte und Bilder ins Netz stellst, das Aussehen veränderst und im Team an der Website arbeitest.</p>\n\n<p>Mit Joomla kannst du natürlich auch Bildergalerien nutzen, MP3-Dateien und YouTube-Videos präsentieren, eine Google-Maps-Karte einfügen oder ein Kontaktformular in die Homepage zaubern. Auch mehrsprachige Websites sind möglich\nund dank der feingegliederten Nutzerverwaltung erteilst du deinen Mitstreitern nur die Rechte, die sie im Moment gerade benötigen.</p>\n\n\n\n\n\n\n\n\n\n<p>In diesem Kurs geht es auch um Backup und Sicherheit. Sorge vor, damit du deine Daten im Ernstfall wiederherstellen kannst.</p>\n\n\n\n\n\n\n\n\n\n<p>Das Beispiel dieses Kurses kannst du ganz leicht abwandeln und auf deine Bedürfnisse anpassen, egal ob es sich um eine Schulwebsite, das Firmenportal oder ein privates Projekt handelt.</p>\n\n\n\n\n\n\n\n\n\n<p>Diesen Kurs hier gebe ich seit Jahren an einer VHS, natürlich stets angepasst an die jeweils aktuelle Joomla-Version. Als Kursskript verwende ich mein aktuelles Buch »Content Management mit Joomla! 3.5 für Kids«,\nerschienen bei mitp. Ich danke dem Verlag für die freundliche Genehmigung zu diesem Kurs!</p>\n\n<p>Der Kurs ist didaktisch aufgebaut und hat sich seit vielen Jahren bewährt.</p>", 
    "end_date": null, 
    "title": "Joomla 3.5: Erstelle eine komplette Website!", 
    "price": "20.00", 
    "instructors": "Johann-Christian Hanke", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864874_5cc4_2.jpg", 
    "course_url": "https://www.udemy.com/joomla-35-erstelle-eine-komplette-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T17:24:02Z"
}