{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course is about making effective web pages and landing pages.</p><p>You can be a complete novice as Past 1 of the course covers all the prerequisites to be able to do Part 2 of the course.</p><p>Part 2 of the course goes into great detail in building the HTML landing page and steps you through using JQuery and Ajax to seamlessly send and receive data from the server.</p><p>As you may be aware up until now it's been difficult to create landing pages that send a response email back to the landing page visitor as well as sending a contact email to the landing page manager. Also collecting the form data into a MySQL database.</p><p>If you want to be in control of your own landing pages and not have to pay a monthly fees to use an online landing page services then this course is going to enable you to easily create your own landing pages and host them yourself.</p><p>We discuss web hosting and how to get it and use it. It also talks about domain names how and where to get them.</p><p>The course talks about the advent of new technology and tools that make it easier to build these type of sites.</p><p>In this course you will learn about working with HTML the course spends a lot of time explaining how to layout your landing page using HTML before steping you through using JQuery and Ajax, to create a better user experience where the page doesn’t need to refresh it seamlessly sends and receives feedback on the page using Ajax.</p><p>I step you through using MySQL and PHP to send emails to the landing page visitor and the landing page manager.</p><p>I show you how to collect the landing page data in a MySQL database creating an email database that can be used for marketing later.</p><p>The course steps you through creating a real landing page.</p><p>The course steps you through some facts about Search Engine Optimization and the five (5) key questions that lead to action.</p>", 
    "end_date": null, 
    "title": "Landing Pages: Learn to Build Your Own Quickly and Easily", 
    "price": "20.00", 
    "instructors": "Maurice Price", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381986_238f_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-build-your-own-html-landing-pages-quickly-and-easily/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T06:07:27Z"
}