{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Every business needs a website and most have got one, but the majority are information sites only, they don’t actually serve any other purpose. And that’s OK if you want to be just like your competitors! If you want to stand out, you need a kick butt website that really sells you and your product. This course teaches you how to crush your competition and have a unique website that gets you new sales.</p><p>And that’s what you want, new customers. This course will help you get new customers and boost your profit. </p><p>You’ll learn how to design your home page to get users to take action. They’ll stay longer on your site, they’ll engage with you and really take time to look at you and your product.</p><p>We show you what to put where with real life examples so it’ll be easy for you to replicate on your site. Our examples show you the types of websites that sell and we'll walk you through every little feature so you can swipe and deploy them in your business niche tomorrow to make your website out perform your competitors every time.</p><p>This course shows you what to do and what not to do. And don't worry, you can use this course to either design a new website or simply make a few tweaks to your existing website.</p><p>It's an easy course to follow with bite size lessons on how to utilise the main real estate of your website and what you absolutely must have above the fold. Should you use a video for instance and what type of video you need. </p><p>And it's not all about sales! A big play that you need to make and your competitors won't be doing is building lists. This course shows you how to build an engaged list of people who you can sell to again and again and again.</p>", 
    "end_date": null, 
    "title": "Learn The Keys To Turn Your Website Into A Sales Machine", 
    "price": "20.00", 
    "instructors": "Robert Murray, Stuart Bevins, Chris Hastings", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724490_379c_3.jpg", 
    "course_url": "https://www.udemy.com/learn-the-secrets-to-turn-your-website-into-a-sales-machine/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T19:45:51Z"
}