{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">In this course, I will give you the skills and tools you need to build professional quality web sites.</p><p style=\"\"><strong style=\"\">No prior experience required!</strong></p><p style=\"\">I will show you the techniques that I use in my own web design business. You will learn my tips, tricks and best practices for building WordPress websites. Near the end, I will be going over the resources, tools, software and services that I use when I design websites.</p><p style=\"\"><strong style=\"\">Course Structure and Format</strong></p><p style=\"\"><strong style=\"\">Part 1:</strong> In this course, we will start by learning the basics of WordPress and launching websites. This will give you a better understanding of the overall process and how everything works. However, if you are already familiar with those topics feel free to skip down to the meat of the course. These lessons are lecture style with slides.</p><p style=\"\"><strong style=\"\">Part 2: </strong>After that, we are going to be diving into the nuts and bolts of WordPress. In this section, you will be watching over my shoulder as I demonstrate the features of WordPress and show you exactly how to build out your own WordPress site. This part of the course is primarily screen capture style video.</p><p style=\"\"><strong style=\"\">Part 3:</strong> Next we will start learning how to do specific things. Things like, how to add Google Analytics to your site, how to integrate social media with your site, how to block spam comments, How to create beautiful photo galleries, how to create a document repository, how to manage users and more!</p><p style=\"\"><strong style=\"\">Part 4:</strong> By this part of the course you will have learned how to build a WordPress website and will be comfortable with designing your own website(s). But I will take it a step further and give some design tips and tricks that will truly make your website beautiful, functional and engaging.</p><p style=\"\"><strong style=\"\">Part 5: BONUS section.</strong></p><p style=\"\">In this section, I will be going over things like:</p><p style=\"\"><strong style=\"\">1. </strong>How to make money with your site</p><p style=\"\"><strong style=\"\">2. </strong>How to optimize your site for SEO</p><p style=\"\"><strong style=\"\">3. </strong>How to find Copyright free photos (for free)</p><p style=\"\"><strong style=\"\">4. </strong>Where to find good graphics (free and paid)</p><p style=\"\"><strong style=\"\">5. </strong>And More!</p><p style=\"\">If you want to learn how to build professional quality web sites, learn more about WordPress, and have a greater understanding of how to be successful online, this is the course for YOU!</p>", 
    "end_date": null, 
    "title": "Learn WordPress 2015", 
    "price": "30.00", 
    "instructors": "Hunter Haley", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512202_e3f3.jpg", 
    "course_url": "https://www.udemy.com/hnh-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T20:47:37Z"
}