{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">JavaScript is the best starting point to learning how code works.</strong>  Its <strong class=\"redactor-inline-converted\">in demand </strong>and the most popular programming language available today.  With JavaScript you can jump write in and start creating right away.  This course is designed to allow you to quickly start writing your own JavaScript code.  No wasted time see how you can start with some simple code and develop really great projects.</p>\n\n<p><strong class=\"redactor-inline-converted\">JavaScript is everywhere</strong>, open the doors to the possibilities.   It gives you the freedom to create and let your <strong class=\"redactor-inline-converted\">creations come to life</strong>.   There is nothing better than seeing your ideas brought to life on your computer screen. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">JavaScript is popular</strong> and also one of the <strong class=\"redactor-inline-converted\">easiest languages to start learning</strong>.  There is nothing to install and no complex environments to configure.  You already have the tools you need right on your computer to start creating JavaScript.   Just a simple text editor and a browser, that's all you need to write JavaScript.  JavaScript runs within you web browser, any browser!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">JavaScript is powerful </strong>and you can really do a lot with a little bit of code.  Its easy to add to your web pages.</p>\n\n\n\n\n\n\n\n\n\n<p>This course is taught by an instructor with over 15 years of real world experience.  Using JavaScript on a daily basis let us introduce you to the magic of JavaScript.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>JavaScript allows you to create<strong class=\"redactor-inline-converted\"> dynamic web interactions </strong>by selecting and manipulating elements on the page.  You can customize the user experience with JavaScript.  Other programming languages many times depend on <strong class=\"redactor-inline-converted\">JavaScript to deliver</strong> content to the user.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">JavaScript is at the center of all things web</strong>, you will find that time and time again its comes back to knowing JavaScript.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Start exploring </strong>what you can do with JavaScript.  </p>\n\n\n\n\n\n\n\n\n\n<p>By the end of the course you will have the skills and know how to add JavaScript<strong> within you website</strong>.   </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I am here to help you learn how to create your own websites and ready to answer any questions you may have.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>JavaScript is the most in <strong>demand skills</strong>, and<strong> learning how to use JavaScript </strong>will help to separate you from the crowd.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Want to know more, what are you waiting for take the first step.  Join now to<strong> start learning how you too can create DYNAMIC and INTERACTIVE pages with JavaScript today.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn to Code JavaScript web designers and developers quick", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854206_f3d1_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-code-javascript-web-designers-web-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-19T17:07:20Z"
}