{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>I know I've done it countless times, I'm sure your guilty of it, and I bet that the visitors to your site have the same dirty habit. You're sitting there at your computer waiting for a website to load, and it feels like the days of slow dial up internet before broadband, you have two options like the rest of us do, you can either a) wait or b) leave (and possibly never return again). \n\n  </p>\n\n<p><em>\"Four of of ten people abandons surfing to a website if its page takes longer than four seconds to load.\" *</em>\n\n  </p>\n\n\n\n<p>Let that never happen to your Wordpress website again.\n\n  </p>\n\n\n\n<p>This online web optimizing course will teach you how to supercharge your Wordpress website for amazing speed, whether you know how to code or not.\n\n  </p>\n\n\n\n<p>This course is designed to teach you the ins and outs of making your Wordpress website work harder for you, even if you have no web development experience at all. After all every second counts.\n\n  </p>\n\n\n\n<p>Do not let your hard work of learning to build a Wordpress website go unnoticed. We will walk you through 8 actionable steps that helps you take your website to the next level, without bogging you down with lots of technical details.\n\n  </p>\n\n\n\n<p>This course was designed for all levels in mind. Section 1 is full of tools and tips that you can do within the Wordpress administration panel. No code, no technical jargon. Section 2 jumps into more technical aspects that allow you to dig deeper.\n\n  </p>\n\n\n\n<p><strong>Learn:</strong>\n\n  </p>\n\n\n\n<p>·         How browsers work, and how we can leverage this to our advantage. The boring stuff that nobody pays attention to, we show you how you can use to your advantage.\n\n  </p>\n\n\n\n<p>·         What to optimize, how to optimize and more importantly what order to do it in!\n\n  </p>\n\n\n\n<p>·         How to test and retest, to see and track your changes. So that you're not just blindly making random changes and not getting the best results.\n\n  </p>\n\n\n\n<p>·         The plugins and software that the pro's use to get the best result, that you can use.\n\n  </p>\n\n\n\n<p>\n\n  </p>\n\n\n\n<p><strong>About the instructor:</strong>\n\n Andrew has been building websites professionally for the past 10 years, and working with various CMS such as Wordpress, Joomla and Squarespace. He has been working with Wordpress with various clients over the past 5 years, creating custom themes and plugins. \n\n  </p>\n\n\n\n<p>*Stats from kissmetrics\n\n  </p>", 
    "end_date": null, 
    "title": "Learn how to speed up your Wordpress website", 
    "price": "20.00", 
    "instructors": "Andrew Bennett", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833936_cae5_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-speed-up-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T22:30:35Z"
}