{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Be the front end wizard with this unique course. We bring together a curriculum where you will learn all the tips and tricks of CSS and HTML design while building </p><p style=\"\">five awesome projects. It will help you master different aspects of front end programming and will show you all the best development practices. The following projects have been specially selected to be part of this course.</p><p style=\"\"><strong style=\"\"> Brighter ,Maximus ,Creative Juice,Curvy &amp; Clean,Philosophy Homepages.</strong></p><p style=\"\"> Description: We will create an HTML/CSS landing page which will feature a header &amp; footer, a list with image bullet points, an HTML form and a testimonial block. The page will be completely Fix. We will be using reset as well. </p><p style=\"\"> Features/Technologies: HTML, CSS3, Web Forms, Lists, Reset Files,</p><p style=\"\">The course starts with the basics. I&#039;ll show you the tips and tricks to work effortlessly with web technologies like HTML, CSS and JavaScript.</p><p style=\"\">You&#039;ll find learning both quick and fun. And, I&#039;ve used techniques proven to effortlessly lock that knowledge in, as you gallop through each comprehensive chapter.</p><p style=\"\"> It&#039;s a one-stop-shop for everything you need to start creating professional websites that engage visitors, call them to action and ultimately - make you money! </p><p style=\"\"> This fast, effective course takes you easily from zero skills to fee-earning web developer.</p><p style=\"\"><strong style=\"\">What are the requirements?</strong></p><p style=\"\">No pre-knowledge required Any computer - Windows, OSX or Linux No special software required</p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><p style=\"\">Over 25 and 4 hours of content! Develop a website Learn how to make beautiful, interactive websites Earn money from your new skills</p><p style=\"\"><strong style=\"\">What is the target audience?</strong></p><p style=\"\">Anyone wanting to learn how to build website People wanting to make a living (or side-income) from web designing</p>", 
    "end_date": null, 
    "title": "Learn Web Designing : Five Projects In CSS  From Scratch", 
    "price": "20.00", 
    "instructors": "Ajaypal Singh, Robin Singh", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554344_b973_7.jpg", 
    "course_url": "https://www.udemy.com/ultimate-5-projects-in-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T13:58:55Z"
}