{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t   This is a WordPress course like no other. In it you will not get bogged down with irrelevant information that you will not put to use. Instead we will cover, step-by-step, everything you need to do to go from no site at all (not even a domain name) to a fully functioning WordPress website or blog that is as awesome as you are!  </p>  <p style=\"\">  \t         Short, to the point video instruction will walk you through each step:  </p>  <ul style=\"\">  \t<li style=\"\">How and where to buy a domain name.</li>  \t<li style=\"\">How and where to get the right hosting for your needs.</li>  \t<li style=\"\">How to change nameservers so everything points to the right place (don&#039;t worry, just follow through the example and you will do this with ease)</li>  \t<li style=\"\">How to install WordPress (in under a minute and with just a few clicks of your mouse).</li>  \t<li style=\"\">How to log in to your new WordPress website and begin making changes.</li>  \t<li style=\"\">How to change essential WordPress settings (just the ones you need to know).</li>  \t<li style=\"\">How to install and activate a new theme.</li>  \t<li style=\"\">The best places to purchase Premium WordPress themes.</li>  \t<li style=\"\">How to install and activate Plugins on your WordPress website or blog.</li>  \t<li style=\"\">How to Create and edit posts.</li>  \t<li style=\"\">How to create and edit pages.</li>  \t<li style=\"\">How to create menus on your new website.</li>  \t<li style=\"\">How to work with images.</li>  \t<li style=\"\">How to create links.</li>  \t<li style=\"\">How to work with widgets, and add cool functionality to your site.</li>  \t<li style=\"\">How to embed video on your website (the best way).</li>  \t<li style=\"\">Plus more cool stuff...</li>  </ul>  <p style=\"\">  \t        Go from WordPress Zero to WordPress Hero in super fast time.  </p>  <ul style=\"\">  \t<li style=\"\">Use your new know-how to build your own website or blog.</li>  \t<li style=\"\">Set up a web design business and charge others to do it for them.</li>  </ul>", 
    "end_date": null, 
    "title": "Learn WordPress - A Quick and Easy Guide", 
    "price": "20.00", 
    "instructors": "David Lee Martin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170926_3294_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-step-by-step/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-22T12:51:19Z"
}