{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this Responsive Web Design training course, expert author Geoff Blake shows you how to create custom CSS and HTML so that your web site responds to differing screen sizes. With mobile and tablet web traffic increasing by leaps and bounds every day, all web designers should know how to create breakpoints and custom CSS layouts to adapt their designs to varying device resolutions.<br style=\"\"><br style=\"\">You will learn how to setup your external style sheets for three different resolutions, and how to customize your layouts for each of those. This training video will teach you how to deal with navigation and graphics as well as text and other layout features, making them responsive. You will use the latest in CSS3 and HTML5 techniques to create a website design that will gracefully wrap and adapt to three different screen sizes. Extensive working files are included with this video tutorial, so you can work along with the author throughout each lesson.<br style=\"\"><br style=\"\">When you have completed this computer based video training course, you will be capable of creating responsive, adaptive designs for your websites. You will understand how to create different external CSS files that are called depending on the resolution of the device that is requesting the web page. You will be confident in your ability to create a Responsive Web Site for todays mobile world!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learning Responsive Web Design ", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/54520_ec57_9.jpg", 
    "course_url": "https://www.udemy.com/learning-responsive-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-16T15:58:19Z"
}