{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course will teach you how to work with the amazing Wordpress platform by watching how I build a full website. </p><p><strong style=\"\">The Learning Experience:</strong></p><p>In this course you will not listen to theories or long explanations, you will simply learn how to work with Wordpress by watching how i configure themes and plugins and fit the website to my own business needs. It&#039;s best to watch each lecture and work on your website at the same time - this is a great way to learn!</p><p><strong style=\"\">The Steps of Creating a Website In This Course:</strong></p><p>I will walk you through all the steps - from signing up with a hosting company and registering a domain name, through installing Wordpress on your website and finally building a professional looking website for your business or a personal blog. </p><p><strong style=\"\">What You Will Get at The End of This Course:</strong></p><p>By the end of the course you can have your own functional, beautifully designed, responsive website for your business and/or blog, ready to be spread online to the rest of the world. The best part of learning by experience, or - learning by watching, is that you will understand how the system works and then be able to completely fit it to your own needs. You can create an exact website like the one shown in the course, just for the sake of learning, or actually using it as your own website.</p><p><strong style=\"\">What Will I Learn To Do in Wordpress?</strong></p><ul style=\"\"><li>Installing the theme we will work with</li><li>Installing and configuring plugins</li><li>Creating categories and assign them to your content</li><li>Working on the homepage which contains beautiful content areas</li><li>Creating a &quot;call-toaction&quot; bar with an incentive to your readers</li><li>Creating contact forms</li><li>Creating static pages</li><li>Creating photo galleries</li><li>Embedding videos</li><li>Embedding Google Maps</li><li>Creating menus</li><li>Working on the header elements</li><li>Adding social links icons</li><li>Working on the footer elements</li><li>Working with widgets</li><li>Configuring Wordpress&#039; essential sections</li></ul><p><strong style=\"\">What Else Does The Course includes?</strong></p><p>In addition to learning how to work with Wordpress, you will also get a list of must-have addons, known as plugins, so you can later on expand the functionality of your website and engage with your audience by building a mailing list, adding social sharing buttons and much more.</p><p><strong style=\"\">How Long Will It Take Me To Create a Website With The Help of This Course?</strong></p><p>You can have your website up and running within a few hours, and if your free time is very limited - you could learn for about 15-30 minutes each day and complete your website within a week. The lectures are short and easy to follow, and were structured in a way that they would fit those who have a full day to work on their website as well as those who only have 15 minutes a day. With that being said, &quot;throwing&quot; a website online on the World Wide Web is not enough - once it&#039;s ready, the hard work begins - it&#039;s your responsibility to continue expanding your content by writing articles and sharing your knowledge and services online in social media platforms, so your website will gain credibility and audience.</p><p><strong style=\"\">Why Taking This Course? </strong></p><p>If you&#039;ve tried learning how to work with Wordpress before, but got confused with all the configurations, themes, plugins and the various possibilities that this platform offers, here is your chance to watch how it&#039;s simply done by a web designer who works with Wordpress for the past 8 years. It&#039;s easier than you think, and moreover - it&#039;s FUN!</p><p>Wordpress is a platform that can serve anyone who wants to build a website and has basic computing skills. You don&#039;t need to pay thousand of dollars to a webdesigner and a webmaster to create a professional-looking website anymore, thanks to the great abilities of Wordpress which make this platform so flexible and understandable.</p><p>Join the ride - you&#039;re going to love it, but hey - Wordpress is addictive, so watch out! :-)</p>", 
    "end_date": null, 
    "title": "Learn Wordpress By Watching How I Create a FULL Website!", 
    "price": "20.00", 
    "instructors": "Maya Bielik", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493118_c19d_3.jpg", 
    "course_url": "https://www.udemy.com/learn-wordpress-by-watching-how-i-create-a-full-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T08:26:47Z"
}