{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>With standard HTML sites, moving from one webhost to another, or from one domain to another was simple.  Copy and paste the files.</p><p>WIth Wordpress, things are a little more complicated.  Wordpress is a script, that stores your web content (web pages) in a database.  Moving a Wordpress website requires not only moving the Wordpress script files from one place to another, but also a database.  And you are not finished there.  Even after moving both of these, your site won't work.  You need to get the Wordpress script talking to the database.</p><p>This course will take you step-by-step through the process of moving a Wordpress website.  In fact, I'll use a real site that I own to demonstrate the entire process.  You can follow along, watching over-my-shoulder and repeating the steps yourself as you move your own site.  </p><p>Apart from the obvious web hosting and Wordpress site that needs moving, everything else you need is entirely free.</p><p>This course will show you:</p><ol><li>The main reasons why a move is necessary.</li><li>An overview of the steps involved, followed by a detailed step-by-step series of video tutorials showing the entire process.</li><li>How to move the Wordpress script files from one domain (and/or webhost) to another.</li><li>You'll also copy the Wordpress database from one site, and import it into another. The copying process with replace references to the domain name (and server locations) of the site you are moving, with the domain and location of the site you are moving it to.</li><li>How to edit the Wordpress configuration file to get your Wordpress script and database talking together.</li><li>How to create redirects so that your old website automatically redirects visitors to the new site when they try to land on a webpage.</li><li>How to check to make sure the site move was successful.</li></ol><p>This course is a complete step-by-step guide to moving your Wordpress website from one domain to another, and/or one web host to another.</p>", 
    "end_date": null, 
    "title": "Learn How to Move a Wordpress Website", 
    "price": "20.00", 
    "instructors": "Andrew Williams", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617106_6a77.jpg", 
    "course_url": "https://www.udemy.com/moving-a-wordpress-site/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T07:18:28Z"
}