{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>En este curso aprenderas de la manera más sencilla, rápida y moderna todo lo necesario para empezar a crear tus webs</strong><strong>.</strong>  </p>  <p><strong>-----------------------</strong></p>  <p>  \t<strong>Macaw</strong> es una herramienta web de código inteligente, podriamos decir que es una combinación perfecta entre Photoshop y Dreamweaver, con un altisímo nivel de “intuición\" y “fluidez\" de trabajo al momento de crear un sitio web.  </p>  <p>  \t<strong>Macaw</strong> trabaja de forma fluida con capas como photoshop, breakpoint intuitivos para hacer desde el inicio de su creación un sitio adaptativo (responsive), gran variedad de fuentes web, así como la posibilidad de tener estilos (css) con “memoria propia\", es decir, que para aquellos que no conocen mucho de programación web, pueden reutilizar estos estilos de una forma muy sencilla y de manera visual… <strong>Macaw</strong> se encarga del código por ti generando automáticamente archivos jquerry, css u otro lenguaje.  </p>  <p>  \t      Podemos decir que <strong>Macaw</strong> habla dos lenguajes que hasta ahora están hasta cierto punto separados: el lenguaje del diseñador y el de los desarrolladores.  </p>  <p>  \t      Trabajar un proyecto web desde cero (boceto, mockups, prototipo, diseño, desarrollo, lanzamiento) nunca ha sido tan fluido porque solemos saltar entre el papel, el photoshop, el editor de códigos, y todas las demás herramientas que podamos implementar, pero ahora podemos hacerlo todo en una misma aplicación, que como he mencionado ya, es sumamente intuitiva y que seguramente ha llegado para quedarse en nuestro estilo de trabajo.  </p>  <p>  \t<strong>Macaw</strong> desarrolla el código de una forma sumamente limpia y precisa, con su motor llamado <em>Alchemy,</em> encargado de la ingeniería de la escritura del código exclusivamente para este programa que se encarga de realizar un código ordenado, limpio y que presenta soluciones mejores de lo que muchas veces podemos aplicar nosotros mismos.  </p>  <p>  \t      Seguro que ya tienes ganas de trabajar con <strong>Macaw</strong>.  </p>  <p>  \t  ¡¡¡A que esperas para conocer esta fantástica herramienta!!!.  </p>", 
    "end_date": null, 
    "title": "Macaw. Deja de escribir código, empieza a dibujarlo !!", 
    "price": "20.00", 
    "instructors": "Ranz López", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/251102_1c7c_5.jpg", 
    "course_url": "https://www.udemy.com/macaw-deja-de-escribir-codigo-empieza-a-dibujarlo/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-26T19:41:44Z"
}