{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This is the ultimate course to learn about CSS. Cascading Style Sheets are one of the main building blocks of web content, used everywhere to add styling to plain HTML.   Its easy to use and apply to any HTML code.</p><p><strong style=\"\">Learn to create CSS templates - which can be the base for infinite number of new web pages.  Bring your web content to life with CSS</strong></p><p>We walk you through all the syntax used within CSS and help you understand where to apply the properties and values. Whether you are a beginner or want to update your skills, this course is for YOU!</p><p>We have you covered, learn with our proven instructional style, where we don&#039;t waste your time typing on screen. We get right to the point, showing examples and explaining what they do. CSS has never been easier to learn, and you will be able to create and CSS files and attach them to your HTML code at the end of this course.</p><p>Everything you need to learn about CSS is provided within this course.</p><ul style=\"\"><li>no wasted time watching someone type</li><li>quick lessons get right to the point</li><li>fully covered topics with real world examples</li><li>source files downloadable to work along</li><li>challenges and lessons</li><li>30 day money back guarantee</li><li>new course material added regularly</li><li>trusted name in education since 2002</li><li>full HD easy to read source coding</li><li>quick response support to students</li><li>regular discussions</li></ul>Learn how CSS works and it&#039;s fundamental concepts. Learn to build your own website using CSS to style your HTML code!", 
    "end_date": null, 
    "title": "Magic of CSS made easy learn Website Design with CSS", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592236_9889_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-css-web-development-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T20:52:22Z"
}