{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t               Ask yourself a question. Who in todays world needs a <strong style=\"\">website</strong>? The answer is every single person with a business. A<strong style=\"\"> website </strong>can benefit a business in so many ways. Its the way to get your name out, and the way to grow your amount of customers. The problem people face today is websites cost high sums of money, or require great amounts of experience to code a website yourself. Well not anymore. I have made this course to show you <strong style=\"\">how to make a website</strong> for your business, or personal use. <strong style=\"\">NO CODING, DO IT YOURSELF, AND 100% FREE!</strong> It doesn&#039;t get much better than that. I will go step by step and cover:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">How to sign up for weebly </strong></li>  \t<li style=\"\"><strong style=\"\">How to make a website with weebly<br style=\"\">  \t </strong></li>  \t<li style=\"\"><strong style=\"\">How to edit and publish your website<br style=\"\">  \t </strong></li>  \t<li style=\"\"><strong style=\"\">How to add images and products to your webpage<br style=\"\">  \t </strong></li>  \t<li style=\"\"><strong style=\"\">How to input certain html codes onto your website<br style=\"\">  \t </strong></li>  \t<li style=\"\"><strong style=\"\">How to add a hit counter to your website<br style=\"\">  \t </strong></li>  \t<li style=\"\"><strong style=\"\">How to put advertisements on your website for money<br style=\"\">  \t </strong></li>  \t<li style=\"\"><strong style=\"\">How to check your statistics on your website</strong></li>  </ul>  <p style=\"\">  \t               With these skill above that I will teach, you will have a website in no time.  </p>  <p style=\"\">  \t <strong style=\"\">How long is the course?</strong>  </p>  <p style=\"\">  \t               This cours will be about 35 minutes and will have a quiz close to the end of the course to test your knowledge.  </p>  <p style=\"\">  \t <strong style=\"\">How is this course structured?</strong>  </p>  <p style=\"\">  \t               This course is structured by a series of videos that I have made showing you step by step what to do to make a website the easy way, and tools that you can use on your website and how to use them.  </p>  <p style=\"\">  \t <strong style=\"\">Who should take this course?</strong>  </p>  <p style=\"\">  \t               Anyone looking to build a website for a business or for personal use, but not knowing how to make a website; should take this course that explains how to do so.  </p>  <p style=\"\">  \t <strong style=\"\">Why should you take this course?</strong>  </p>  <p style=\"\">  \t               You should take this course because everything revolves around the internet, and its time that you get with it and become part of it. A website is like a oil well, it brings in money all day and all night. When your sleeping, eating, or working out. It sounds like its too good to be true, but its possible to make happen; and with a &quot;go get it&quot; attitude you can make it happen.  </p>  <p style=\"\">  \t <strong style=\"\">Enroll today.</strong>  </p>", 
    "end_date": null, 
    "title": "Make a website with no coding", 
    "price": "20.00", 
    "instructors": "Brent Whitehead", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394448_3b10_3.jpg", 
    "course_url": "https://www.udemy.com/make-a-website-in-10-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T23:10:17Z"
}