{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Hi there and welcome to <strong><strong>Making Your First Website From Scratch</strong> - Adobe Dreamweaver® CC </strong>tutorial<strong>. </strong>Like to thank you for taking a look at my course. In this course I am gonna walk you through every single step of creating a complete website.<br></p><p>Dreamweaver CC is an application provided by Adobe and is used by professional to create and edit websites. </p><p>As I said from scratch! So we will start from a blank page. Then we'll add some text in the page and will learn how to customize the text. After working with text, we will create and stylize links. Then After positioning our content we'll learn the basics of <strong>HTML5 and CSS</strong>. And then we'll use the power of CSS to stylize our page. And working on CSS is much easier in Adobe Dreamweaver CC because Dreamweaver gives you the full control on CSS with the new advanced layout of <em><strong>CSS designer panel</strong></em>. Then we'll learn how to use web fonts to stylize text. And then we'll learn the important part of a website designing and that is its <strong>responsiveness</strong> means the webpage should be flexible across different screen sizes. And then we'll create the <strong>mobile version</strong> of our website means our website will have different layout on mobile devices. </p><p>Then we'll learn how to create stylish menu bar and other pages for our website as our website is gonna contain four web pages. Then I'll show you how we can insert a widget in our website by inserting an awesome <strong>gallery widget</strong>. A website can't be complete without social media plug-ins, so we'll learn how to add <strong>twitter or Facebook</strong> widget and a YouTube video in our website. Then we'll <strong>create and stylize a form</strong> with which your visitors will be able to contact you. And finally we'll upload our website to get this online and to access this from anywhere in the world. We'll be discussing all these topics and much more in this course.</p><p>The course has been created in <strong>720p High Definition video and extra zooming</strong> and panning has been applied in the videos so that you can easily watch this course on your tablets and mobile devices.</p><p>So this course is a great place to start if you are looking to make your first website or to familiarize with the latest version of Dreamweaver.</p><p>If you are interested in designing a website and don't know how and from where to start, then this course is for you. I'm really excited to get started on this course with you and hope you are too, so let's get started.</p>", 
    "end_date": null, 
    "title": "Make Your First Website From Scratch - Adobe Dreamweaver® CC", 
    "price": "20.00", 
    "instructors": "M. Sajid", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614408_cee1_4.jpg", 
    "course_url": "https://www.udemy.com/adobe-dreamweaver-cc-make-your-first-website-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T02:52:28Z"
}