{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course is for visual, creative people who need to start making HTML5 banner ads. I made this course for people that are struggling to get their heads around the new world of HTML5 advertising. </p>\n\n<p>At the end of this course you'll be able to create advertising banners ready for the Google Doubleclick, Google Display Network and Simek. You will have learnt the principles behind HTML5 banner advertising so you'll be able to apply these publishing techniques to any ad network. </p>\n\n\n\n<p>If you're finding the changes in online advertising stressful then this course will enlighten you. We'll start right at the beginning. Work our way through building our own ads. Then we'll spend good time working out how to keep your files sizes really small for publishing.</p>\n\n\n\n<p>This course is step by step with exercise files. I’ve saved a copy of each Adobe Animate file after every video so if you get lost you can compare your files to my completed files. </p>\n\n\n\n<p>I’m with you at every step to make sure your questions are answered quickly and your time is well spent achieving real world skills that directly relate to your career and business. </p>\n\n\n\n<p>So if you’re ready to learn how Adobe Animate CC can do amazing (and productive) things for your web advertising or interactive design workflow, it’s time to take this course sign up today.</p>\n\n\n\n<p>Daniel Walter Scott (Adobe Certified Instructor). </p>", 
    "end_date": null, 
    "title": "Making HTML5 Banner Ads in Adobe Animate", 
    "price": "20.00", 
    "instructors": "Daniel Walter Scott", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/879532_0839_3.jpg", 
    "course_url": "https://www.udemy.com/html5-banner-ads-adobe-animate/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-15T22:52:02Z"
}