{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t              Beautiful web design begins with a practical knowledge of the tools and features of Adobe Photoshop. This course, intended for beginners and experienced designers alike, will show you how to use Photoshop to design web pages, custom graphics and more that excite end users and impress clients.  </p>  <p>  \t<strong style=\"\">Prepare Yourself for a Career in Web Design by Learning the Foundations of Photoshop and the Ins-and-Outs of the Design Industry</strong>  </p>  <ul style=\"\">  \t<p>  \t\t              ·Master the principles of web design &amp; typography.  \t</p>  \t<p>  \t\t              ·Learn to design custom graphics and beautiful icons.  \t</p>  \t<p>  \t\t              ·Gain access to premium psd files and templates to inspire your own projects.  \t</p>  \t<p>  \t\t              ·Discover how to work with clients and how to remain competitive in a cutting-edge industry.  \t</p>  </ul>  <p>  \t<strong style=\"\">Create Websites that Win Clients and Enhance Your Portfolio</strong>  </p>  <p>  \t              Professional web design is in high demand, with every type of business from large corporations to small boutiques looking for web designers who can improve their online presence and build their brand. This course will teach you the skills you need to create stunning website designs using Photoshop so that you can turn your clients’ visions into reality. You will also learn how to speak with clients, decode their requests, and meet their demands.  </p>  <p>  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p>  \t              Whether you’re a beginner or an advanced web designer, you will find this course beneficial in how it blends clear, concise instruction with real world examples and hands-on exercises.  </p>  <ul style=\"\">  \t<p>  \t\t              ·<strong style=\"\">Photoshop &amp; Web Design from A to Z: </strong>Following the course’s simple step-by-step process, you will learn the web design principles and Photoshop skills necessary to create vivid web pages and graphics, starting with fundamental topics such as comparing different versions of Photoshop and selecting a monitor, before advancing to spacing, typography, logo design, layout, and more.  \t</p>  \t<p>  \t\t              ·<strong style=\"\">Client Case Studies: </strong>You will gain a better understanding of the realities of web design by examining real-life case studies that demonstrate what to do and what not to do when working with clients.  \t</p>  \t<p>  \t\t              ·<strong style=\"\">Interactive Demos: </strong>You will watch the creation of two websites from start to finish to gain a better understanding of the design process.  \t</p>  \t<p>  \t\t              ·<strong style=\"\">Free Templates &amp; Resources: </strong>You will gain access to an exclusive selection of psd files, a cheat sheet hotkey guide, plus lots of website templates that you can use for your own projects.  \t</p>  </ul>  <p>  \t<strong style=\"\">Course features:</strong>  </p>  <ul style=\"\">  \t<li>Crystal clear audio from a native English speaker</li>  \t<li>Recorded at full HD: 1920x1080</li>  \t<li>Photoshop CC 2014 (latest version) was used throughout the course</li>  \t<li>Lots of .psd freebies attached. Take a look at lecture 64 for a preview. More to be added regularly. </li>  \t<li>Professionally edited: constant zoom in on important areas, hotkeys are shown as subtitles, repetitive techniques are slightly sped up</li>  \t<li>All lectures have the .psd presentation file attached plus a .pdf with any links that were shown in the video.</li>  </ul>  <p>  \t          After completing this course, you will have a solid understanding of the principles of web design and the foundations of Photoshop necessary to create cutting-edge web pages and graphics. You will also be familiar with the web design industry and the professional strategies necessary to build a client base.  </p>", 
    "end_date": null, 
    "title": "Master Web Design in Photoshop", 
    "price": "30.00", 
    "instructors": "Cristian Doru Barin", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352132_74cf_2.jpg", 
    "course_url": "https://www.udemy.com/master-web-design-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T17:56:00Z"
}