{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Internet browsing is rapidly shifting from desktop computers to smartphones and tablets. Mobile browsing contributed to over 50% of web traffic and surpassed desktop browsing for the first time in 2014. For web design, it means it has become extremely important to build websites optimized for mobiles, tablets and desktops alike.<br><strong></strong></p>    <p>The problem with many current sites is that the user experience in mobile browsers is terrible, and responsive design is meant to solve this problem. Responsive websites ‘respond’ to the size of screen size so you don’t have to create different sites for different devices. This course aims to teach responsive website design without writing code. </p><p><strong>Build Beautiful Mobile Responsive Professional Websites Using Strikingly </strong></p><p>You can create business, portfolio, personal and almost every kind of website using  Strikingly web builder – all without code, within a few hours!</p><ul><li>Business/Startup websites for selling products and services </li><li>Mobile e-commerce stores with payment\nmethods</li><li>Portfolio sites with HD photo and video galleries</li><li>Personal sites (or Digital Resumes) to\ndemonstrate your work </li><li>Blogs (and embedding other blogs into your\nwebsite) </li><li>Websites for Events and Organizations (Weddings, NGOs) and many more</li></ul><p><strong><br></strong></p><p><strong>Create gorgeous websites within hours – Without Code  </strong><br></p><p>Strikingly is one of the best mobile website builders which lets you create one page mobile websites with incredible ease.  </p><p>If you want to create a site for your business or startup, a portfolio or personal site for yourself or make extra income by building sites for clients, this course is for you.  You do not need to have prior coding or design experience. This is a course you can follow step by step to create and publish your website.</p><p><strong>In this course, you\nwill  : </strong></p><ul><li>Build your first website with Videos, Photos, Contact    Forms, Google Maps, Social Media icons etc. </li><li>Make a simple e-commerce store with payment method </li><li>Build a personal website (digital CV) for yourself  </li><li>Embed posts from blogs and social-media sites\ninto your website</li><li>Learn how to host your domain name and publish\nyour website on the Internet</li><li>Learn the basics of Google Analytics and SEO to analyze and improve site traffic</li></ul>", 
    "end_date": null, 
    "title": "Mobile Responsive Websites for Beginners - Without Coding", 
    "price": "40.00", 
    "instructors": "Kshitij Jain, Anisha Sogani", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741768_296a_3.jpg", 
    "course_url": "https://www.udemy.com/mobile-responsive-websites-for-beginners-without-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T03:15:46Z"
}