{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn how to create your own WordPress child theme to change the look and style of your website in this series of tutorials aimed at beginner-level web designers and web developers.    </p><ul>  \t<li><em>Using a WordPress child theme is the best, safest, and easiest way to modify an existing WordPress theme, whether you want to make a few tiny changes or extensive changes.</em></li></ul><p>  \t    In this course, we'll talk about when, where and why to use a child theme, what tools you need to create your own child theme, and how to properly set up and edit your child theme.  </p><p><strong>HOW IS THIS COURSE DIFFERENT?</strong>    </p><p>  \t                        My name is Kathleen, and I've been teaching technology to beginners under the moniker <strong><em>Robobunnyattack!</em></strong> since 2009. I believe that with the right approach, anyone can learn anything.  </p>  <p>  \t<strong>My goal in this course is to help you develop an intuitive understanding of WordPress child themes, and how to make them work for YOU.</strong>  </p>  <p>  \t  The lessons in this courses are perfect for \"advanced beginners\" who:  </p>  <ul>  \t<li>Are comfortable using <strong>WordPress</strong>;</li>  \t<li>Know (or are willing to learn) some <strong>basic HTML and CSS</strong>; and</li>  \t<li>Know (or are willing to learn) how to use <strong>FTP software</strong> to move files to and from web server.</li>  </ul>  <p>  \t  If this describes you, then you're ready to learn how to create WordPress child themes!  </p>  <p>  \t                        In this course, we'll create a simple WordPress child theme. As we work together, I'll explain what each step means and WHY we do it, so you can <strong>learn more quickly and with more confidence</strong>. We'll cover:  </p>  <ul>  \t<li>The many advantages to using child themes in WordPress, vs simply editing pre-existing themes</li>  \t<li>What you need to get started creating child themes</li>  \t<li>How to create, activate, and test your very own child theme</li>  \t<li>Where to go to learn more about building and customizing WordPress themes</li>  </ul>  <p>  \t<strong>    By the end of this course, you'll be able to create your very own WordPress child theme!</strong>  </p>  <p>  \t                        Here's just a sample of what my (awesome!) students have to say about this course:  </p>  <p>  \t<em>\"Thank you Kathleen for this great course! This course is for everyone who has kind of heard of a child theme before but doesn't know what it really does and what the first steps are.\" —Susanne B.</em>  </p>  <p>  \t<em>\"The course is taught in a conversational, clear, concise, and funny way. There wasn't a minute that I got bored watching and listening to it.\" —Randell B.</em>  </p>  <p>  \t<em>\"Really straight forward and easy to understand, step by step.\" —Matt H.</em>  </p>  <p>  \t<em>\"Kathleen's instruction is clear, down-to-earth, and spot on. Her style is devoid of geek-speak and enthusiastic. If you want to learn to customize WordPress themes to make them more your own, I highly recommend this course.\" —Leslie S.</em></p><p><em></em><strong>WHAT'S INCLUDED?</strong>    </p><ul>  \t<li>This course includes lifetime access to over 50 minutes of step-by-step videos.</li>  \t<li>You'll also get supplementary text lectures and links to helpful resources.</li>  \t<li>Short quizzes at the end of each section will help you gauge your own understanding and check your progress along the way.</li></ul>  <p>  \t<em>    BONUS: I've also included a FREE bonus section (\"SECTION 5: FTP Basics\") explaining how FTP (File Transfer Protocol) works. Understanding how to use FTP software is essential in order to build your own child theme. If you aren't already familiar with FTP or you need a quick refresher, you can start there!</em></p><p><em></em><strong>HOW LONG WILL IT TAKE ME?</strong>    </p><ul>  \t<li>This completely depends on your availability and learning preference. You can work through all the video lectures in one afternoon, or pace yourself over several days or weeks — it's up to you!</li></ul><strong>WHAT IF THIS COURSE ISN'T FOR ME?</strong>    <ul>  \t<li>This course comes with an <strong>unconditional 30-day Udemy-backed guarantee</strong>. Try out this course for 30 days and see for yourself if my approach to learning how to create WordPress child themes is right for you. If you're not 100% satisfied with this course, simply request a full refund within 30 days — no conditions, no questions asked!</li>  </ul>  <p>  \t                        I'm confident you'll LOVE this course, and I'm excited to help you learn. <strong>Enrol now and you can start building and customizing your very first WordPress child theme today!  </strong>  </p>  <p>  \t<em>—Kathleen Farley (aka Robobunnyattack!)</em>  </p>  <hr>", 
    "end_date": null, 
    "title": "Modify Your WordPress Theme the RIGHT Way Using Child Themes", 
    "price": "20.00", 
    "instructors": "Kathleen Farley", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156830_bc03_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-child-themes-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-02T20:50:28Z"
}