{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t With &quot;Build online stores for yourself or others&quot;, you will learn everything you need to build a profitable online store or take your skills and start a business building stores for others. Our goal is to give you the real world experience and tools you need to be successful.  </p>  <p style=\"\">  \t You can use this course to either save thousands building your own store or be the &quot;expert&quot; and make money building stores for others. <br style=\"\">  \t  You will have all the tools:  </p>  <ul style=\"\">  \t<li style=\"\">Free software</li>  \t<li style=\"\">A free 60 day trial website to practice with and start      making money.</li>  \t<li style=\"\">Real product databases and product images to practice      with.</li>  \t<li style=\"\">Email accounts, FTP site – everything you need to start      your store, absolutely nothing else to buy.</li>  </ul>  <p style=\"\">  \t This is not an academic, theoretical workshop. There are no flashy promises, no pot-of-gold hype.  </p>  <p style=\"\">  \t This is an actual hands-on step-by-step program using real data, your own eCommerce website and free software.  </p>  <p style=\"\">  \t We will show you how to build your own store to sell your art, crafts or other products. By building it yourself you can save $5,000 or more (and we’ll prove it.)  </p>  <p style=\"\">  \t If you want to sell other products as a drop-shipper or affiliate, with “Build online stores for yourself or others” you will learn how to analyze the market, where to find products and share the secrets to getting your products listed on Google other stores.  </p>  <p style=\"\">  \t If you want to take your business to the next level we will show you how to build online stores for people in your community. You will learn how you can be an &quot;expert&quot; with just about any shopping cart.  </p>  <p style=\"\">  \t Most experts earn $5,000 or more for each store they build. You will see who they are and what they charge.  </p>  <p style=\"\">  \t “Build online stores for yourself or others” is more than just a workshop, It’s a complete business. You choose where, how and what part fits for you. And it’s designed for people with little or no technical experience.  </p>  <p style=\"\">  \t The course is designed with lectures targeted to you specific goals:  </p>  <ul style=\"\">  \t<li style=\"\">ALL – indicated the lectures for everyone.</li>  \t<li style=\"\">DS - are topics for those interested in dropshipping or      affiliate marketing. </li>  \t<li style=\"\">BZ - are lectures for those wanting to start their own      business building stores.</li>  \t<li style=\"\">DIY - lectures are for people who want to sell their      own products.</li>  </ul>  <p style=\"\">  \t As we go through the course, you’ll download all the files, sample databases, worksheets, and checklists, so you can apply them to your own store. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Why E-Commerce</strong>  </p>  <p style=\"\">  \t <br style=\"\">  \t  If you’re a person who likes statistics, here are a few numbers you might find interesting:  </p>  <ul style=\"\">  \t<li style=\"\">E-commerce spending in the United States will hit      approximately $262 billion this year, up 13.4% from $231 billion last      year, according to a new projection from Forrester Research Inc.</li>  \t<li style=\"\">In 2017, online spending will reach $370 billion.</li>  \t<li style=\"\">Consumers spend between $1,200 and $1,300 on online      shopping every year.</li>  \t<li style=\"\">71% of shoppers believe they&#039;ll get a better deal online      than in stores.</li>  </ul>  <p style=\"\">  \t Maybe it’s a good time for you to get your store on the internet so you can take advantage of this explosive growth.  </p>  <p style=\"\">  \t <br style=\"\">  \t  &quot;Build online stores for yourself or others&quot; will give you everything you need. After you complete the course you will have your own online store full of products and you will know how to market your store.  </p>  <p style=\"\">  \t <br style=\"\">  \t  NOTE: As you know, anything online is constantly changing. To keep you up-to-date all the chapters will be updated regularly with new lectures, marketing and steps you can take to put your business on “auto-pilot”. You have free lifetime access to this course. With Udemy&#039;s 30-day money-back guarantee, it&#039;s risk-free.  </p>  <p style=\"\">  \t Sign up now for the compete course, get your free 60 day trial website, download the free software and get started on a new adventure.  </p>", 
    "end_date": null, 
    "title": "New Business - Build Online Stores for Yourself or Other", 
    "price": "30.00", 
    "instructors": "Dan Smith", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67392_c491_11.jpg", 
    "course_url": "https://www.udemy.com/build-online-stores-for-yourself-or-others-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-20T22:05:56Z"
}