{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">ONLY READ THE<strong style=\"\"> FULL DETAILS </strong>BELOW IF YOU ARE <strong style=\"\">SERIOUS ABOUT CREATING YOUR OWN WEBSITE</strong></p><p style=\"\">Come look over my shoulder and see how I create $10,000 looking websites with just Wordpress! Oh no... what is Wordpress? No worries, I get this question a lot - I got you covered. The best part about the course is <strong style=\"\">no coding experience is required</strong>. Seriously! This course has <strong style=\"\">over 80 videos</strong> and hours of content to teach you everything you need to know.</p><p style=\"\"><strong style=\"\">Good News!</strong> You do not need to pay someone thousands of dollars to do your website. Either you are an entrepreneur, an artist, a filmmaker, trying to brand yourself, or just curious. If you are looking to create a website for your company, for yourself or for someone else and do not know where to start, then this course is for you.</p><p style=\"\">Don&#039;t think Wordpress is the way to go? </p><p style=\"\">Well...aside from the fact that it is easier to create sites with Wordpress. Big companies have huge websites that are powered by Wordpress. Here a some to name a few...</p><p style=\"\">1. Tech Crunch2. The New Yorker 3. Variety 4. MTV News5. Beyonce 6. Best Buy 7. Fortune </p><p style=\"\">And the list goes on... Google the topic and you will find lists.</p><p style=\"\">In todays world, a website is everything. If you have a business or want to create a business and you do not have a site, you are toast! Want to brand your image? You are going to need a website!</p><p style=\"\">Let me help you create an awesome looking website! And jumpstart your business NOW!</p><p style=\"\"><strong style=\"\">So what are you going to learn in this course?</strong></p><p style=\"\">Literally everything to get you up and running. From registering a domain/hosting to learning how to put video, text, images, logos, sidebars, and much much more. Did I mention there is over 80 videos and hours of content to look at?</p><p style=\"\">You will literally learn step by step in how to create a $10,000 looking website, or <strong style=\"\">your money back...</strong> </p><p style=\"\">Yup...you read that right. <strong style=\"\">Udemy has a 30 day guarantee policy</strong>, so what do you got to lose? Give this course a shot, and while others are still learning how to put a site together learning basic html, you will have your site up and running in no time. </p><p style=\"\">The best part...Your site will look 1000% times better. What a great feeling right? </p><p style=\"\">So if you are serious about creating a site, then lets get to work.</p><p style=\"\">Go and Enroll Now! </p><p style=\"\">See you in a bit...</p><p style=\"\"><em style=\"\">Disclaimer: This course might change your life, and open new doors to your success. So think twice before enrolling...</em></p>", 
    "end_date": null, 
    "title": "NO CODING EXP - Create A Professional Website Fast And Easy", 
    "price": "50.00", 
    "instructors": "John Godbey", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453934_6c2d_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-10000-looking-website-with-no-coding-exp/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T16:12:33Z"
}