{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">HELLO WELCOME to this course on Orchard CMS Theme Development for Beginners.</strong>  </p>  <p style=\"\">  \t                             Are you confused, frustrated or intimidated about how to begin or get started with Orchard CMS theme development.  </p>  <p style=\"\">  \t                             How to create themes in orchard cms  </p>  <p style=\"\">  \t                             How-to and Where-to learn the basic Orchard terminologies  </p>  <p style=\"\">  \t                             If your answer to all of the above questions is Yes, then this course is for YOU!  </p>  <p style=\"\">  \t<strong style=\"\">Let&#039;s GET STARTED!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Now, why would you want to join this course?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Theme Creation in orchard can get a little bit cumbersome without having some basic knowledge about certain orchard terminologies.</li>  \t<li style=\"\">In this course you&#039;ll learn the basic Orchard terminologies like Shapes, Shape Tracing, Part Templates, Editor Templates, Placement info file and many more..</li>  \t<li style=\"\">This course starts right from the scratch where we download the orchard source code from codeplex and then use visual studio to create a theme and do the entire theme development learning throughout the duration of the course.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">There are some pre-requisites for this course. </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Basic knowledge of Orchard CMS is required,</li>  \t<li style=\"\">Basic knowledge of C# ,</li>  \t<li style=\"\">Basic knowledge of ASP. NET MVC,</li>  \t<li style=\"\">Basic knowledge of Razor syntax,</li>  \t<li style=\"\">Basic knowledge of Bootstrap UI Framework,</li>  \t<li style=\"\">Basic knowledge of HTML and</li>  \t<li style=\"\">last some interest and passion to learn orchard cms theme development.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Now, lets talk about the course agenda.</strong>  </p>  <p style=\"\">  \t                             We begin with Orchard theme development setup. Then, we dive into the theme txt file and its importance within an orchard cms theme. Next we talk about shapes, shapes and shapes, because everything in orchard is about learning shapes. Shapes can be override within our themes. After that we talk about Part and Editor templates and how to override them. Towards the end of the course we talk about how to override widgets, how to style custom forms and projection lists, Placement info file which allows you to control the rendering of shapes in orchard and last we create a theme package file for our orchard theme which can be used directly on a production-ready orchard website or can be uploaded to the official orchard cms theme gallery website for other orchard fellow end-users.  </p>  <p style=\"\">  \t<strong style=\"\">Before you join this course I would like to introduce myself to you.</strong>  </p>  <p style=\"\">  \t                             My name is Abhishek Luv and I&#039;m from Mumbai, India. I&#039;m an Orchard Dojo trainer and a contributor to the official orchard cms documentation website and I have created numerous courses and tutorial videos on orchard. I&#039;m also the founder of Orchard Beginner. Now, orchard beginner is and will be the one-stop place where you can get started with orchard cms , but orchard beginner is still in its initial stage and it will build up pretty soon. And I&#039;m also the founder of the orchard cms india community.</p>  <p style=\"\">  \t                             Thank You!  </p>", 
    "end_date": null, 
    "title": "Orchard CMS Theme Development Tutorial For Beginners", 
    "price": 0, 
    "instructors": "Abhishek Luv, Orchard Beginner", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/132708_e563_4.jpg", 
    "course_url": "https://www.udemy.com/orchard-cms-theme-development-for-beginners/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-12T10:45:20Z"
}