{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Do you Want to Learn Photoshop in a Fun Way Taught by a Friendly Education Expert?</strong></p><p>After the huge success of the first version we had to do another to help more people like you create designs for the web. This course is IDEAL for total beginners who want to know why behind each of the tools, why behind the methods and why even use Photoshop for web design in the first place. </p><p>The course is very well explained, gives you lots of nice files to practice with and you will be able to create a web page design at the end of it!</p><p><strong>Course Description</strong></p><p><strong>This course is designed to teach you the basics of Photoshop, even if you have little to no experience with it, to create profitable web designs that help you stand out from the competition.</strong></p><p>Over 20,000 Students has been taking the old course already, this is the new version of Photoshop (cc)</p><p><strong>Are you new to Photoshop (cc) or Need a refresher?</strong> Then this course will help you learn the basics of Photoshop.<br></p><p><strong>Why Choose This Course?</strong></p><p>Have you ever noticed how beautiful some websites look? That's because of the perfect design that have been made in Photoshop. Also you can definitely make a substantial income once you learn more about Photoshop.</p><p><em>“I created this course to teach you the knowledge that will help you with Photoshop since I was in your shoes some years ago. If you need support, my company Web Courses Bangkok will be just a message or an email away, feel free to visit our website.</em><em> I love when my students succeed and that for me is priceless. You success depends on yours and I will make sure with that you get all the help you need when you need it.\" – Carl Heaton, Senior Instructor </em></p><p>We take our courses very seriously but at the same time we try to make it fun since we know how difficult it can be learning from an instructor over the web. This course is fun, and when you need some energy to keep going, you will get it from me. Also the courses are well illustrated and easy to understand.</p><p><strong>The Approach</strong></p> Practice, practice and more practice. In every lecture you will find the required .psd files to download. Along the way I will be explaining what to do with the files and how to use them.<p><strong><br></strong></p><p><strong>This Photoshop course Covers the following;</strong><br></p><ul><li>Explanation about the interface of Photoshop cc</li><li>Using the paint brush</li><li>Using shapes and making custom shapes</li><li>Using layers and groups</li><li>Explanation about moving and resizing</li><li>Zooming and panning</li><li>Using different blending modes and effects</li><li>Insterting and adjusting text into Photoshop</li><li>During the course you will also learn some keyboard shortcuts</li></ul><p><br></p> <p><strong>Some of my students reviews for the older version of this course:</strong></p><p><em><strong></strong>\"great course. </em><em>Thank you Mr Carl Heaton for this great and simple course!\"</em> - <strong>Vili</strong></p><p><em>\"Thank You !! </em><em>Even though I've played around with Photoshop before this course was really worthwhile and I learnt things which will definitely help me. You are a really good presenter and you make it easy to understand, I'll definitely be taking more of your courses :-)\"</em> - <strong>Sue Henderson</strong></p><p><em>\"The Way that the Courses are put together are awesome. </em><em>Love the Way that you Put the Courses Together. The Second Showing is what makes the difference.\"</em> - <strong>Marc Antonio Turner</strong></p><p><em>\"Excellent course for web designers that want to make there page designs in Photoshop. It explains all I needed to know to design my first website.\"</em> - <strong>Koen van Dieren</strong></p>", 
    "end_date": null, 
    "title": "Photoshop CC for Web Design Beginners", 
    "price": 0, 
    "instructors": "Mr Carl Heaton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599170_aa50_3.jpg", 
    "course_url": "https://www.udemy.com/photoshop-for-web-design-beginners-version2/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T09:54:57Z"
}