{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    Are you a web designer or a developer for some time and wondering how to become faster and better in designing websites? Have you waste time in watching different YouTube videos to learn tricks and tips but end up wasting hours to finally learn something? We understand the importance of your valuable learning time and hence, present to you a fast-paced no non-nonsense &quot;really&quot; advanced tutorial on Photoshop tricks for Web Design.  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Learn the best Photoshop Tricks</strong>  </p>  <ul style=\"\">  \t<p>  \t\t    路<strong style=\"\">Photoshop basics: </strong> Auto Select, Character Styles, Point Text, Trim effect, etc.   <strong style=\"\"></strong>  \t</p>  \t<p>  \t\t    路<strong style=\"\">Colour and Creating a new document: </strong>Using colours for document, web design and mobile document, newsletter including cool tricks like Hex colours and swatches.<strong style=\"\"></strong>  \t</p>  \t<p>  \t\t    路<strong style=\"\">Guide, Grids, Layers and Rulers</strong>:  Learn super tricks like creating button or shadow effects or using guide plugins<strong style=\"\"></strong>  \t</p>  \t<p>  \t\t    路<strong style=\"\">Website UI Design: </strong>Wireframing<strong style=\"\">, </strong>Creating Navbars, creating placeholders, buttons and tools such as Save for Web and Sprite.<strong style=\"\"></strong>  \t</p>  </ul>  <p>  \t    This is a fast-paced lean program of 3hrs. with tricks meant. Watch the preview video to get a flavor the program&#039;s uniqueness and relevance.  </p>", 
    "end_date": null, 
    "title": "Photoshop CS6 for Web Design in Hindi", 
    "price": "20.00", 
    "instructors": "Yoda Learning", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314906_4eee_5.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cs6-for-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-07T08:58:46Z"
}