{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn the concepts of responsive website design and how to customize Photoshop to create full page mock-ups.</p><p><strong>Become an integral part in the overall process of web design and development with this beginner course.</strong></p><ul><li>Learn responsive web design concepts and tools</li><li>Customize Photoshop for a more streamline workflow</li><li>Build a consistent web site user experience</li><li>Prepare your designs for development</li></ul><p><strong><br>Be the fixture that turns ideas into reality</strong><br></p><p>Learning how to create website mock-ups puts you at the apex of the web design process. This is where brainstorming ideas and concepts become a reality. With this skillset, you’ll bring “left-brained” design thinkers ideas to life. In addition you’ll be the liaison to the “right-brained” web developers. </p><p>Employees or freelancers with this ability are typically involved in parts of both the creative process, and development process. You benefit by being a more valualbe asset that can take part in conversations in many different phases of a project.</p><p><strong>Content and Overview</strong></p><p>Suitable for beginners, through this course of 49 lectures and almost 4 hours of instruction I’ll show you how Photoshop can, and is, being used in modern web design work flows. We’ll start off by covering some core concepts of web design, including how the web is evolving with the advent of mobile devices and why you’d want to use Photoshop for web design in the first place. </p><p>From there, you and I are going to be working together to create a full website mockup for a fictional restaurant called Bordeaux. I’ll show you how to set up your Photoshop environment for web work. Create templates for responsive web design projects. Design aesthetic elements like UI components. We’ll finally assemble a finished mockup. And then, I’ll show you how to deliver your final results to your client or to a developer.</p>", 
    "end_date": null, 
    "title": "Photoshop CC for Responsive Web Design", 
    "price": "20.00", 
    "instructors": "Marc Rogall", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661148_38d3_3.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cc-for-responsive-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T14:50:55Z"
}