{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Hi - my name is Dan and I’ll be leading you through this course on how to Build Professional Website Mockups using Photoshop. This course is for people serious about making money building professional website mockups using Photoshop. </strong></p><p>These are the skills employers want. UI/UX design skills are where the high paying jobs are at. </p><p>I built this course for beginners. For the people nervous about changing their careers into web design - as well as for developers who lack any design skills. No experience in Photoshop or web design is necessary before taking this class. </p><p>During the course we’ll create this website for a mock creative agency - creating mobile and desktop versions.  With exercise files you can download and work along with me. While we’ll start right at the basics we’ll move quickly into the professional tricks of the trade. </p><p>This course is a mixture of head and shoulders style presentations and HD screen captures. The course also includes printable notes as well as quizzes to help retain what you have learnt. </p><p>I’ll be teaching you how to setup your new documents. How to work with mobile, tablet and desktop views.  You’ll be able to easily pick web safe colours and fonts for your website and preview them on your iPhone or iPad. You’ll learn how to crop images and make full backgrounds all the way through to exporting all the right files for your website. Know that I’ll be around to help - when you’re ready you can send me your work and I’ll see if they are any suggestions I can offer.  </p><p>If you’ve ever wondered <strong>how to design a website in Photoshop</strong> than this is the course for you. </p><p>Now it’s time to upgrade your skills, get that better job and impress your clients. </p>", 
    "end_date": null, 
    "title": "Photoshop CC 2015: Building Website Designs in Photoshop", 
    "price": "20.00", 
    "instructors": "Daniel Walter Scott", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635272_5c6d_3.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cc-2015-building-website-designs-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T21:17:03Z"
}