{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>Attention: Business Owners and SoloPreneurs</em></p><p><strong>Feel Unable to Choose Which WordPress Theme is Right for Your Business?</strong></p><ul><li>Already bitten by a poor theme? </li><li>No idea what makes a good theme?</li><li>No idea where to look for great themes? </li><li>Confused by the WordPress Terminology?</li></ul><p>Instead of making the same mistakes discover the key knowledge you need to make an informed decision. No Previous WordPress Knowledge Needed.</p><p><strong>Last Updated: March 2016</strong></p><p>This course takes you step by step from working out your website requirements to locating candidate themes for your business. The candidate can then be narrowed down by taking each theme for a test drive.</p><p>Based on the instructors experience, the course explores the different marketplaces and major theme sellers. How to understand the different listing styles.</p><p>The course takes the time to ensure you aren't confused by WordPress terminology and know how to describe the features you are looking for. </p><p>Once you've found your short list you will be taken through a due diligence checklist to make sure your theme designer is giving good support and  is going to be around to support you in the future.</p><p>The course is organised in a step by step manner, which can work through in order. Look over the instructors shoulder, using screencast recording, as he explains each part and then works through examples of the process.</p><p>Also provided are key documents to help you make the best decisions. Such as the test drive checklist for you to complete as you follow along.</p><p>The course should take about 2 hours to complete fully but you will be making progress towards finding the perfect theme for business within 30 minutes.</p><p>As a bonus the course shows you how to enhance any WordPress theme using some key WordPress plugins. Plus how to engage a developer to enhance the theme for you.</p><p><br></p>", 
    "end_date": null, 
    "title": "Picking a WordPress Theme For Your Business", 
    "price": "30.00", 
    "instructors": "Rob Wilson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631122_8e43_3.jpg", 
    "course_url": "https://www.udemy.com/wordpress-themes-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T09:32:21Z"
}