{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  Descubre un <strong>curso fácil, claro, completo, práctico y muy didáctico</strong> y conviértete en programador y diseñador de páginas web con las más recientes versiones de los lenguajes de programación HTML y CSS.  </p>  <p>  \t  ¿Quieres dedicarte a una de las profesiones con más futuro y proyección pero te parece muy difícil?. ¿O tal vez ya tengas conocimientos básicos de HTML o CSS y quieres profundizar?.  En ambos casos, <strong>te ofrecemos los mejores recursos</strong> para que lo consigas.  </p>  <ul>  \t<li><strong>Más de 100 vídeos</strong> donde te explicamos cada tema de forma amena y dándole más importancia al aspecto práctico.  ¡A programar, se aprende programando!.</li>  \t<li>Un <strong>manual escrito para cada capítulo </strong>del curso donde podrás repasar los temas tratados en los vídeos, ampliar conocimientos y acceder a más ejemplos prácticos.</li>  \t<li>Decenas y decenas de <strong>ejercicios con sus correspondientes soluciones</strong>, para que pongas a prueba lo aprendido en el curso.</li>  \t<li>Y el soporte y ayuda de tu <strong>tutor</strong>, para que nunca te sientas perdido.</li>  </ul>  <p>  \t  Y ten presente que este es un <strong>curso dinámico</strong>.  Respondiendo a tus dudas y para estar siempre a la última en programación y diseño web responsive con HTML y CSS iremos ampliando los contenidos de nuestro curso con<strong> nuevos temas, trucos y casos prácticos</strong>.  Recuerda que tienes acceso ilimitado e indefinido.  ¡Vuelve cuando quieras, aquí estaremos!  </p>", 
    "end_date": null, 
    "title": "Programador web: HTML5 y CSS3 Responsive ¡Fácil y Práctico!", 
    "price": "25.00", 
    "instructors": "Juan De La Torre Domingo", 
    "commitment": "19.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341198_b193_4.jpg", 
    "course_url": "https://www.udemy.com/programador-web-html5-y-css3-responsive-facil-y-practico/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T08:05:22Z"
}