{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>¿Has aprendido a crear tus propias páginas web, otra persona te la ha creado o piensas tener pronto una? Si es así, seguro que querrás publicarla en Internet para que todo el mundo pueda visitar la octava maravilla del mundo que has creado :)</p><p>En este curso vas a aprender a <strong>publicar tu Web en Internet</strong>. Para ello aprenderás a <strong>registrar un Dominio</strong> para tu sitio web y a <strong>saber elegir</strong> qué <strong>Plan de Hosting</strong> cubre mejor tus necesidades. Y no solo eso, también aprenderás todos los casos más comunes a la hora de <strong>Gestionar tu Servidor</strong>, de manera que no tendrás que pagar <em>¡¡¡NUNCA MÁS!!!</em> a nadie para que lo haga por ti.</p><p>Si estás harto de que te expliquen las cosas y se te quede cara de pokerface, ¡Éste es tu curso! Donde aprenderás con la <strong>Metodología <em>Learning By Doing</em></strong>.</p><p>Además, te explicaré los conceptos técnicos (Dominio, Subdominio, Web Hosting, FTP, DNS, <em>etc.</em>) como me hubiera gustado aprenderlos a mi, con un <strong>lenguaje sencillo</strong> y utilizando <strong>comparaciones con el mundo real</strong>.</p><p>Te invito a que eches un vistazo al listado de clases y a sus descripciones y ¡No le des más vueltas y<strong> únete ahora a los más de 1280 alumnos que ya han realizado el Curso GRATIS más completo sobre Web Hosting en Udemy!</strong></p>", 
    "end_date": null, 
    "title": "Publica tu Web y Domina el Web Hosting para Emprendedores", 
    "price": 0, 
    "instructors": "David Perálvarez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516894_ce3a_4.jpg", 
    "course_url": "https://www.udemy.com/web-hosting-course/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T10:21:24Z"
}