{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn what it takes to start creating your own websites.   Have you ever wondered how your favorite websites were built, and how they work?  This<strong class=\"redactor-inline-converted\"> comprehensive course</strong> is designed to show you everything you need to know to to create your own websites.</p>\n\n<p>This course is designed to take you through all the fundamentals to creating websites, including <strong class=\"redactor-inline-converted\">HTML, CSS, JavaScript </strong>and<strong class=\"redactor-inline-converted\"> jQuery.</strong>  Learn the foundations of creating a website opening the doors to limitless possibilities.  </p>\n\n<p><strong class=\"redactor-inline-converted\">Creating websites is easier than you think</strong>, even if you have never looked at HTML code, this course will help get you started quickly.  You will be creating you own HTML in minutes. To create websites all you need is a desire to learn, then practice and apply what you learn.  </p>\n\n<p>Web skills are in demand, and there is an ever growing need to know the basics of how websites work.   Companies will continue to shift focus to online content, online platforms and everything online.  the internet has changed the rules, as more people buy online, spend time online and work online, the demand will continue to grow.  Being able to create websites is a like a key to a whole new world of possibilities.  </p>\n\n<p>I'm an instructor with over 15 years of real world web development experience.  Let me share my knowledge with you and show you the core skills you need in the real world.  </p>\n\n<p><strong>No additional courses needed, its all here everything you need to know.</strong></p>\n\n<p>By the end of the course you will have the skills and know how to add JavaScript<strong class=\"redactor-inline-converted\"> within you website</strong>.   </p>\n\n<p>I am here to help you learn how to create your own websites and ready to answer any questions you may have.</p>\n\n\n\n<p>Web developments skills are the most in <strong class=\"redactor-inline-converted\">demand skills</strong>, and<strong class=\"redactor-inline-converted\"> learning how to use HTML CSS and JavaScript </strong>will help to separate you from the crowd.</p>\n\n\n\n<p>Want to know more, what are you waiting for take the first step.  Join now to<strong class=\"redactor-inline-converted\"> start learning how you too can create AMAZING THINGS ONLINE today.</strong></p>", 
    "end_date": null, 
    "title": "QUICK Frontend Website Creation HTML CSS JavaScript jQuery", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830836_ca19.jpg", 
    "course_url": "https://www.udemy.com/frontend-website-developer-html-css-javascript-jquery/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T20:08:00Z"
}