{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\">This is a complete course that is for anyone who has designed a website in the past or is thinking about designing a website in the near future. </strong></p><p>This course does not include coding of any kind, so no knowledge of HTML is required. If you have ever designed your website with any of the following technologies:</p><ul style=\"\"><li>Dreamweaver</li><li>HTML 4/5</li><li>CSS</li><li>WIX</li><li>MS Front Page</li><li>Wordpress</li><li>Drupal</li><li>PHP</li><li>.NET</li></ul>...then this course is perfect for you.<p><strong style=\"\">Have You Ever Designed A Website That Has Not Increased Your Online Sales?</strong></p><p>If you have ever designed a website and have not been able to sell your products or services from it, then it may be designed ineffectively. I will show you how to make your website successful just by changing its design.</p><p>My course will show you what type of web design makes website visitors take action to achieve your website goal. We also show what does NOT work and how to fix the issues.</p><p><strong style=\"\">Using This Course As A Reference</strong></p><p>This course is not just for learning how to create successful websites, but also to be used as a reference while you design your website.</p><p><strong style=\"\">My Background In Web Design And Fixing Ineffective Websites</strong></p><p>I have not only designed websites for my clients, but I have also turned around their sales and visitor engagement. I now offer these same strategies to students in this course.</p><p><strong style=\"\">I Offer Several Activities and Projects In This Course To Help Students Apply This Course To Their Own Websites</strong></p><p>When students sign up for this course, they will have access to various exercises and quizzes to help them apply the knowledge and design strategies taught in this course.</p>", 
    "end_date": null, 
    "title": "Redesign A Better Website And Increase Engagement", 
    "price": "20.00", 
    "instructors": "Bruce Chamoff", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499408_84ed_3.jpg", 
    "course_url": "https://www.udemy.com/creating-engaging-websites-that-turn-visitors-into-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T21:54:07Z"
}