{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Das Praxis-Training für den neuen Webdesign-Standard! Der Webexperte Jonas Hellwig zeigt Ihnen, wie Sie Ihre Websites mit HTML, CSS und JavaScript für alle Geräte und Auflösungen optimal aufbereiten. Mit diesem Training sind Sie am Puls der Zeit und erfahren, wie Sie Responsive Webdesign richtig einsetzen. Lernen Sie die neuen Design-Workflows von Grund auf kennen, erstellen Sie ganz früh Prototypen und entwickeln so Ihre Websites von Anfang an richtig. Sie lernen an zahlreichen Praxisbeispielen, worauf Sie bei der Gestaltung für mobile Endgeräte achten sollten, und entwickeln flexible Designkonzepte, mit denen Sie die Besucher Ihrer Website begeistern – egal ob auf dem Tablet, Smartphone oder einem PC.</p><p>- Responsive Webdesign für alle Anwendungsfälle</p><p>- Design und Code vom Profi erklärt</p><p>- Komplettes Beispielmaterial mit HTML- und CSS-Quellcode enthalten</p><p>- Alle Videos auch lauffähig auf iPad und iPhone</p><p>Jonas Hellwig ist einer der gefragtesten Webdesigner in Deutschland und Gründer der erfolgreichen Design-Agentur »kulturbanause«. Unter der Adresse blog.kulturbanause.de bietet er mit zahlreichen Artikeln, Tutorials und Tipps eine wichtige Informationsquelle für moderne Web-Themen. Hellwig ist Experte für Webdesign, Photoshop und WordPress und gibt sein Wissen regelmäßig in Video-Trainings, Schulungen und Vorträgen weiter.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Responsive Webdesign: Das umfassende Praxis-Training", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455246_82b5.jpg", 
    "course_url": "https://www.udemy.com/responsive-webdesign-das-umfassende-praxis-training/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T23:35:06Z"
}