{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>You can run your own web design business from home and make exceptionally good money – all you need is a computer and an internet connection.</p><p>My name is Rob Cubbon and I have been running a successful web design business since 2006 which turns in more profit year after year.</p><p>How do I do it? Well, it's not because I'm the best designer in the world, that's for sure! ;) Here are some essential questions I'll answer for you:</p><ul><li>What software and hardware you will need to start and grow the business?</li><li>How do you get clients? How you handle clients on email, on the phone in real life?</li><li>Do you need contracts? If so, what you put in a contract.</li><li>How do you get paid? What are the best ways to ensure you get paid properly and on time?</li></ul><p>If you really want to make money running a web design business then you'll have to offer a premium service to the best type of clients and I can show you how to do that.</p><p>In order to build a company that offers complete digital solutions rather than being an overworked freelancer you will need to learn the following:</p><ul><li>How to start The first essential tasks necessary to start your web design business.</li><li>How to continue The basic principles behind the business.</li><li>Getting work Should you signup on bidding sites, cold call or concentrate on your site to bring in business?</li><li>Dealing with clients How much information, what to say and when to say it.</li><li>Numerous tried-and-tested email transcripts to simply paste into your client emails.</li><li>What to charge A simple sliding scale of charges and lists of extras to provide so you can charge premium rates!</li><li>How to branch out How to offer logo design, print design, SEO and marketing services to your clients to expand your business…</li><li>How to specialize … and ways to pinpoint your interests so you because the go-to business in a certain field.</li><li>And, meet the designers. Direct advice from over 40 successful independent web designers!</li></ul><p>This isn't just my business model. I surveyed over 40 different independent designers from the mega-successful to those just starting out. Some names you may know, like David Airey, Chris Spooner and John O'Nolan. They answered questions like how much you should charge, how much time you should spend marketing, how you should get work and many more.</p><p>In fact I collate their answers and display them graphically to give you a complete picture of the life of a web design business owner.</p><p>Leaving work and running my own web design business from home changed my life for the better. It can change yours too.</p>", 
    "end_date": null, 
    "title": "Running A Web Design Business", 
    "price": "30.00", 
    "instructors": "Rob Cubbon", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65208_3c05_10.jpg", 
    "course_url": "https://www.udemy.com/running-a-web-design-business/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-12T23:16:51Z"
}