{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>\"Setup + Install Wordpress\" is a new course, launched February 2016.</p><p>[last update: 1st March 2016]<br></p><p>\"Great class.<strong> Excellent information</strong>. Took me <em><strong>from no idea to a published blog in 2 days</strong>!</em> Thanks!\" (5-star, Marcy, Feb 2016).</p><p>\"The content of this course is super informative and comprehensive.<strong> <em>The instructor is one of the best. His delivery is great and understandable.</em> A commendable instructor! </strong>Thank You.\" (5-star, Juliette Barredo, Feb 2016)</p><p>This course walks a complete beginner through every step of <strong>setting up a Wordpress blog at their own web-hosting account</strong>.</p><p>If you always wanted to create a Wordpress blog, but thought the technical aspects of setting up a blog were too hard, this is the course for you.</p><p>Inside the course, I take nothing for granted. Every aspect of building a Wordpress blog is explained in beginner's terms. I even take a step back and explain how to get a domain name and choose a web-host before moving on to Wordpress.</p><p>We look at three different auto-installers as well as manually installing Wordpress, then we cover your first steps with Wordpress, from creating a blog page and a blog post, to changing the theme and installing a plugin.</p><p>After taking this course you'll be excited to start your own Wordpress blog, and will have the knowledge to do it!</p>", 
    "end_date": null, 
    "title": "Setup + Install WordPress! Start Installing A Blog [2016]", 
    "price": "20.00", 
    "instructors": "Neil and Linda Shearing", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/734302_d96c_5.jpg", 
    "course_url": "https://www.udemy.com/setup-install-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T16:29:52Z"
}