{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>POST BLACK FRIDAY SALE - Get this course for a limited time at $25</strong><br></p><p>Have you always wanted to learn HTML but find all that reading of books boring or difficult? Well, welcome to my easy and fun course on HTML5 and CSS3.<br></p><p>My goal was to create a course on HTML5 and CSS3 that <strong>anyone</strong> could follow along with and learn from; regardless of if you have never created a page or have some skill in webdesign. This successful course now has over 2000 students learning, designing webpages and using HTML5 and CSS3.<strong></strong></p><p><strong>The best thing is; its follow by example so no hours of theory upfront!</strong></p><p>Here are a couple of reviews from students that have taken this course and are creating pages now:</p><p>\"<em>Takes you from the basics to a fully working site.</em></p><p><em>This is a great course to learn HTML5 &amp; CSS3, with a bit of PHP thrown in for good measure. If you don't know where to start then this is a course that I would recommend.</em>\" <em><strong>by Kenneth Rough</strong></em></p><p>\"<em>I liked the way this course was laid out. It got straight into the practical side with explanations afterwards. Using Brackets to build a Bootstrap site was also very very useful.</em>\" <strong><em>by Max Kelly</em></strong></p><p>\"<em>Just Do It!</em></p><p><em>Very apt title and enjoyable course.</em></p><p><em>feeling a lot more comfortable with my understanding of HTML5/CSS3</em>\" <em><strong>by Mike Veldsman</strong></em></p><p>These are just some of the great reviews on this course; a course I like to say is so easy even your Granny could do it...</p><p>Creating a Webpage can be easy. Why spend hours reading and learning the theory? You could be joining over <strong>2000</strong> students who are currently learning HTML5 and CSS3 by following along in this course and actually creating a webpage. </p><p>Then; taking it further by creating a Bootstrap page and adding Animation using HTML and CSS. There is even a section where you can follow along and create a Contact page written in PHP where visitors can send contact emails direct to you.</p><p>We start by showing you how to create a simple HTML5 page; something you can create so easily you will wander why someone never told you this before. So easy, you will only need to add <strong>1 line</strong> of HTML.</p><p>Next, you will be taken one lecture at a time and shown how easy it is to create a more complex page. Then; how to add CSS to style the page. By the end of this section you will have created a webpage and styled it - giving it borders, shadows and how to section off giving it a floating look..</p><p>Once you've finished your first HTML page you will more onto - how to create a Bootstrap page. Its so easy you hardly have to enter any code... You will learn by following along; how to quickly and easily create the base Bootstrap page; how to add elements and then add your own custom CSS.</p><p>Once completed, its time to learn about animation in HTML5 and CSS3. Yes; you can animate elements on your page just with HTML5 and CSS3!!! No need for Javascript, PhP or any other.. You will learn by following along how to add and create animation.</p><p>By the end of this course you will have built HTML5 pages with CSS; a Bootstrap page AND added your animation. So easy your granny could do it...</p><p>So, are you ready to create a webpage? If so; this is what we will be doing :</p><ul><li>Follow along example of HTML5 and CSS webpage</li><li>Now includes follow along example of Bootstrap webpage</li><li>Create some webpages</li><li>Add styling using CSS</li><li>Learn some great HTML based annimation techniques</li><li>Gain what you need to create your webpage</li><li>Create a Mobile Responsive website with Bootstrap</li><li>Add animation to your webpage</li></ul><p>So, why not join over <strong>2000</strong> students who are currently learning HTML5, CSS, Bootstrap and Webpage Animation in this course..</p><p><strong>8th June 2015</strong></p><p>I've just added a new section and 10 new lectures; teaching by example how to use Bootstrap to create a mobile responsive website. By the end of these lectures you too will be able to reproduce the Bootstrap page.</p><p><strong>17th June 2015</strong></p><p>Animation in Webpages has come a long way and to show how it can be done I have added a new section to this course on animation.</p><p><strong>20th Just 2015</strong></p><p>I've just added a new section; section 9 which in how to create a simple contact us page using HTML, CSS3 and PHP. </p><p><strong>07th December 2015</strong><br></p><p>HTML5 brought native commands for loading audio and video into HTML5. I've just added updates to the course to detail how to do this in your pages.</p>", 
    "end_date": null, 
    "title": "Simply Learn HTML5 and CSS3 ", 
    "price": "20.00", 
    "instructors": "Sean McCammon", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507620_673a_9.jpg", 
    "course_url": "https://www.udemy.com/html5-and-css3-just-do-it/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T23:41:11Z"
}