{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Hola, my name is Pablo Stanley. I’ve been a designer for almost 18 years– And I have worked with different startups for quite a while. I want to teach you how to apply the tools I use every day–and I’ll give you some insight into my workflow and process as a product designer.</p>\n\n<p>On this course you'll learn how to design web and mobile products using Sketch 3. We’ll also learn how to prototype full flows and micro-interactions using the most current apps in the industry like Flinto, Principle, Marvel App, and Invision’s Craft Plugin. And the coolest part about this course? We’ll learn how to create detailed UI animations and how to apply them to your projects.</p>\n\n\n\n\n\n<p>This course is designed in different sections so you can jump around depending on your skill level. You’ll be able to learn how to use the tools to make your own designs from scratch. And we’ll also learn by doing, getting hands-on with more advanced projects.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So, Why Sketch?</strong><br>Sketch 3 is a design tool focused on user interface and user experience design. Because of its simplicity, it’s really easy to understand; anyone with little to no training can learn Sketch. It’s perfect for designing for multiple mobile devices, working on responsive web design, delivering assets in an easy way, and makes collaboration with developers amazing. It also costs a fraction of the price of Adobe Suite (goodby monthly payment). So yeah, it's pretty cool.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>This Course<br></strong>This course covers the basics, but also goes into detail on some advanced features, tricks, and plugins that I use in my daily workflow.</p>\n\n\n\n\n\n\n\n\n\n<p>We'll also work on some cool projects that we'll be able to prototype and share on our mobile devices and the web. We'll even do some UI animation and micro-interactions that will make your prototypes look pretty realistic.</p>", 
    "end_date": null, 
    "title": "Sketch 3 and Flinto: UI Animation, Design, and Prototype", 
    "price": "20.00", 
    "instructors": "Pablo Stanley", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864758_7c6e.jpg", 
    "course_url": "https://www.udemy.com/ui-animation/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T15:11:24Z"
}