{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>MORE THAN 1300 STUDENTS &amp; 10 TOP RATINGS WITHIN THE FIRST 5 DAYS!</em><em></em><br><strong></strong></p><p><strong>HUNDREDS OF HIGH QUALITY IMAGES AT THE CLICK OF A BUTTON!</strong><br><strong></strong></p><p><strong>Are you active on SOCIAL MEDIA but HATE spending time searching for eye-catching images that CONVERT, SELL and are also FREE?</strong></p><p>Does downloading, resizing and editing these images for hours feel like a massive WASTE OF TIME you'd much rather spend making money?</p><p><strong>Are you more than reluctant to use your monthly shoe and/ or fancy gadget budget on overpriced stock photos that are proven to perform \"oh so poorly\" on social media anyway?</strong><br></p><p><strong></strong><em>THERE IS A SMARTER WAY!</em><strong></strong></p><p><strong>It's QUICK, it's EASY, it's actually FUN, FREE and you can even use your designs for COMMERCIAL PURPOSES without having to be afraid someone might sue you for copyright infringement!</strong><br></p><p>This first <strong>Biz Cookie Bakery Training</strong> is s a series of <strong>Visual Content Training Quickies</strong> for online entrepreneurs, bloggers &amp; coaches digging DIY design &amp; “no frills” biz building. </p><p>It includes:<br></p><ul><li>The BEST resource for downloading photos at the click of a button</li><li>How to get your hands on hundreds of high-quality photos within minutes</li><li>Where to find photos you can even use for COMMERCIAL PROJECTS</li><li>How to properly resize hundreds of photos within minutes</li><li>Find out which image size is suitable for both Facebook and Twitter Feeds</li><li>How to create a unique social media brand design and make photo editing a super quick breeze</li></ul><em></em><p><strong>Are you an online entrepreneur, blogger or coach building an online business DIY style and ready to take action NOW?</strong></p><p><strong>Then it's time for YOU to join the Biz Cookie Bakery!</strong><br><strong></strong></p>", 
    "end_date": null, 
    "title": "Social Media Marketing: Stunning Images In Bulk & For Free", 
    "price": "25.00", 
    "instructors": "Nathalie Chantal de Ahna", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737720_ae2a_7.jpg", 
    "course_url": "https://www.udemy.com/social-media-image-creation/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T10:38:52Z"
}