{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>*** COURSE FREE FOR LIMITED TIME  ***</strong></p><p>  \t<strong>What is Social Log in?</strong>  </p>  <p>  \t               Registering on websites is hard. So is trying to remember yet another username and password combination. Social login makes it easy for people to register on your site and quickly sign in using the social network or email identities they already have.  </p>  <p>  \t               With social login, your customers simply select their preferred social identity from Facebook, Google, Twitter or other networks, and choose whether to share some of their information with you. There are no forms to fill out, and makes for one less password to remember. Social login has proven to improve registration conversion rates by at least <strong>50%.</strong>  </p>    <p>  \t<strong>What this Course will teach?</strong>  </p>  <p>  \t             This course will teach you how to integrate Social Log in to your WordPress website with Step by step tutorials. You will learn how to create Facebook, Twitter, Google+, Instagram applications and how to configure their APIs to the WordPress website.  </p>    <p>  \t<strong>Take this course if either of these apply to you:</strong>  </p>  <ol>  \t<li><strong></strong>You own a business and need more users to signup for your website</li>  \t<li>You are blogger and want your users to write their content at your site</li>  \t<li>Your Idea involves integrating Social Log in</li>  </ol>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>I'll walk you through every step in how to use WordPress through a series of videos. I've also included useful resource documents for you to reference.</strong>  </p>  <p>  \t           ~I know where you're at.  </p>  <p>  \t           ~I know where you're coming from.  </p>    <p>  \t<strong>HOW WE WILL WORK ON THIS COURSE:</strong>  </p>  <ol>  \t<li>Installing Plugin</li>  \t<li>Creating Facebook application</li>  \t<li>Configuring Facebook APIs and auths to the WordPress website</li>  \t<li>Creating Twitter application</li>  \t<li>Configuring Twitter APIs and auths to the WordPress website</li>  \t<li>Creating Google+ application</li>  \t<li>Configuring Google+ APIs and auths to the WordPress website</li>  \t<li>Creating Instagram application</li>  \t<li>Configuring Instagram APIs and auths to the WordPress website</li>  </ol>    <p>  \t <strong>After taking this course you'll have a unique, professional and easy-to-use website with Social Log in to be proud of - and you'll have created it yourself!</strong>  </p>  <p>  \t You can get started right after you have enrolled in my course. So just click \"Take This Course\" button which will be your first step creating an amazing WordPress website with Social Log in!  </p>    <p>  \t<strong>GOOD LUCK!</strong>  </p>  <p>  \tSee You inside the course  </p>", 
    "end_date": null, 
    "title": "Social Log In For WordPress Website", 
    "price": "20.00", 
    "instructors": "Tanzeel Ur Rehman, WordPress Coach", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436392_3fe9_2.jpg", 
    "course_url": "https://www.udemy.com/social-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T10:35:17Z"
}