{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>  Start a blog or website using Wordpress in under 20 minutes!  </strong>  </p>  <p>  \t    Have you been wanting to start blogging but didn&#039;t know how to do it?  </p>  <p>  \t    Did you download Wordpress only to realize that it&#039;s a bit more involved than you originally had planned?  </p>  <p>  \t    In my course, &quot;4 Steps to Starting a Wordpress Blog Website,&quot; I will quickly show you how to setup and install Wordpress on one of the most popular web hosts. You will be blogging in no time!  </p>  <p>  \t    The best time to start blogging is now.  </p>  <p>  \t  You don&#039;t have to be a developer anymore to setup a website, or be a website designer for that matter. There are so many tools out there that make it easy for you to setup your own website in no time at all.  </p>  <p>  \t<strong>Why would you want to setup your own website?</strong>  </p>  <ol>  \t<li>Test an idea: Before investing in a custom website, you can setup your own website to test your idea and see if it is worth investing in. I have done this on multiple occasions by setting up a simple Wordpress website to test an idea before I spent a lot of time working on something custom. <br>  \t</li>  \t<li>Connect with others: A blog is a great way to connect with others who have similar interests. Writing about your experiences is a great way to learn and share with others. If you have a business, you are probably already aware of what a website could do to help you connect with new customers.</li>  \t<li>Share Information: A website helps you share information with others. If you are a professional or have information that you feel would be useful to others, a website can help you expand your reach and set you apart from your competition.</li>  </ol>  <p>  \t  With all of the themes and plugins available these days, it is easy to setup a Wordpress website and add the features you need.  </p>  <p>  \t  There is no better time to start a website than now. The earlier you get started the more content you will have. The issue with waiting is that by the time you do get around to building your website, you could have had a nice head start.  </p>  <p>  \t  Take this short free course and get started on building your own website today.  </p>  <p>  \tAs a website designer and developer of 13 years, I have coached many people through the process of having a website designed. I have suggested to even more people that they start smaller by designing their own website. This process used to be more difficult. Now, I suggest that people start their own website just as I outline in this course. When their business or needs grow to require customized support, that is when you call a designer or developer to help you take your website to the next level. One of the greatest features of Wordpress is that you can completely redesign the website without having to reinsert all of your content. Get started today and learn as you go.  </p>", 
    "end_date": null, 
    "title": "Start a Wordpress Blog Website Today", 
    "price": 0, 
    "instructors": "Jerad Hill", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341992_f1ea_3.jpg", 
    "course_url": "https://www.udemy.com/4-steps-to-starting-a-wordpress-blog-website/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T02:40:29Z"
}