{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>\"The instructor gives a comprehensive review of WP tools and techniques to secure your WP website better. No website is invulnerable to attack but this course will put you way ahead of the game in a short time. I thoroughly enjoyed the course and I plan to use the downloadable code to secure my websites. Excellent course worth the cost many times over!\" - Brian Crane</em><br></p><p><strong><em>____________________________________________________________________</em><span></span></strong></p><p>Every single day tens of thousands of WordPress websites are attacked. Hackers inject spam on your website, redirect your site visitors to other sites, delete your website files or take over complete control of your website. </p><p>It's quite scary what a hacker can do once they have access to your website.</p><p>If you're a WordPress website owner who thinks their website is too small or too insignificant for a hacker to target, think again. You see, most of the WordPress website attacks these days are completely automated which means no website is safe. </p><p>Hackers look for vulnerable websites that make it easy for them to gain access. It's your responsibility as a website owner to take security into your own hands and make a hackers job as difficult as possible so they go elsewhere. </p><p>By the end of this course you'll know and be able to implement the exact steps needed to protect your WordPress website from a variety of common attacks. </p><p><em>____________________________________________________________________</em><br></p><p><em>\"Have whipped through the course, I understand how vulnerable my site is and that I need to take steps to protect it. The explanations of which tools I would need and how I would apply them are clear and there is a useful checklist at the end.\" - Sharon Ghouila<br></em></p><p><em>____________________________________________________________________</em><br></p><p>We'll cover steps you can take to better protect your website including:</p><ul><li>Two-step verification</li><li>Using security keys</li><li>Changing WordPress defaults</li><li>Hiding, password protecting &amp; denying access to core WordPress files and directories</li><li>How to keep hackers from gaining access to your site through comments</li><li>Selecting the right host</li><li>Selecting the right themes and plugins</li><li>and many other security measures</li></ul><p>Not sure what these are? Not only will you learn about these security measures here, I'll show you exactly how to implement each one. </p><p>On top of that, we'll discuss:</p><ul><li>How to know if you website has been infected</li><li>How to know if Google has blacklisted your website</li><li><span></span>And the exact steps to take if your website is hacked</li></ul><p>On top of that, I welcome any questions you have as you go through the process of securing your WordPress website. </p><p>Having your website hacked means you will lose time, money and possibly even your organic rankings. Don't leave another day to chance and secure your WordPress website today.</p>", 
    "end_date": null, 
    "title": "The Ultimate Step-By-Step Guide to WordPress Security", 
    "price": "20.00", 
    "instructors": "Christine Maisel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644926_2ae8.jpg", 
    "course_url": "https://www.udemy.com/wordpress-security-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T17:01:29Z"
}