{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Are you looking to learn how to use WordPress either for yourself or to start your internet marketing career but you still can't find the right training yet?</p><p style=\"\">If your main interest in using WordPress is about building a website that looks great, is easy to maintain, ranks in Google pretty fast and can even make you money on the side, then I pretty much have you covered.</p><p style=\"\">The WordPress Blueprint for Non-Techie Entrepreneurs was created precisely with the non-technical person in mind.</p><p style=\"\">This is a fast and highly effective course that takes you easily from WordPress newbie to WordPress master in just a few days.</p><p style=\"\">I explain all the reasons for everything I do on video so you can understand the logic behind the actions.</p><p style=\"\">This is fundamental to teach you how to take your own informed decisions whenever you need to pick a different theme, plugin, widget or anything not covered on this course depending the specific goals of your website.</p><p style=\"\">WordPress allows you to create fantastic websites as long as you know what you're doing but it can also quickly become overwhelming and cause problems if you're not using it properly.</p><p style=\"\">The training is designed to be taken on a step by step basis with no “cherry picking\" since every video builds up foundations on the next one.</p><p style=\"\">The course is properly laid out by topics and it starts from the core fundamentals flowing nicely to intermediate and more advanced concepts.</p><p style=\"\">But worry not, we won't be touching much code since this is for non-technical people.</p><p style=\"\">If you're ready to dive in, I look forward to meet you inside and help you develop your understanding and WordPress skills and teach you all about WordPress websites without the technical headaches.</p><p style=\"\">The training is literally a one-stop-shop for everything you need to start creating professional WordPress websites that engage your visitors, grab their interest with your content and ultimately make you money (if that's one of your goals!)</p><p style=\"\">Everything you need is a computer, internet access and a strong desire to learn!</p><p style=\"\">Last but not least important, I'm highly active on twitter, facebook, my own marketing blog and of course, Udemy as well so if you ever need my personal help, I'm extremely approachable and would love to connect with you.</p><p style=\"\">I hope to help you the best I can on your WordPress journey and your online entrepreneurship!</p><p style=\"\">Sergio Felix<br style=\"\"></p>", 
    "end_date": null, 
    "title": "The WordPress Blueprint for Non-Techie Entrepreneurs", 
    "price": "50.00", 
    "instructors": "Sergio Felix", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/79300_edfd_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-blueprint-non-techie-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-15T21:42:44Z"
}