{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><em>------------------------------------------</em>UPDATES<em>-----------------------------------------------------</em></strong></p>\n\n<p><em><strong>UPDATE: This course is completely updated and current for MARCH 27, 2016.</strong></em><br></p>\n\n<p><strong>Update Log:</strong></p>\n\n<p><strong>New lecture added(</strong>Themeforest Overview<strong>) on </strong><em>15/3/2016</em><strong>.</strong></p>\n\n<p><strong><strong>New lecture added(</strong><em>Becoming An Instructor</em><strong>) on </strong><em>19/3/2016</em><strong>.</strong><br></strong></p>\n\n<p><strong><strong>New lecture added<em>(</em></strong><em>Browser Testing</em><strong>) on </strong><em>19/3/2016</em><strong>.</strong><br></strong></p>\n\n<p><strong><strong>New lecture added(</strong><em>Must Have Pages</em><strong>) on </strong><em>19/3/2016</em><strong>.</strong><br></strong></p>\n\n<p><strong><strong>New lecture added(</strong><em>Must Have Features</em><strong>) on </strong><em>19/3/2016</em><strong>.</strong><br></strong></p>\n\n<p><strong><strong>New lecture added(</strong><em>Code Validation</em><strong>) on </strong><em>19/3/2016</em><strong>.</strong><br></strong></p><p><strong><strong>New lecture added(</strong><em>Theme Documentation Part 1</em><strong>) on 27</strong><em>/3/2016</em><strong>.</strong></strong><br></p><p><strong><strong>New lecture added(Theme Documentation Part 2</strong><em></em><strong>) on 27</strong><em>/3/2016</em><strong>.</strong></strong><br></p><p><strong></strong></p><p><strong></strong></p>\n\n<p><strong>-------------------------------------------------------------------------------------------------------------</strong></p>\n\n<p>  \t<strong>OVER 4,000 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE</strong>  </p>\n\n<p>  \t  After watching this course you will be able to create a free account and earn money with the help of your expertise and skills on 5 marketplaces, freelance websites and some designing platforms AND the good news is you don't need extra cash to begin with, you can work on all of these websites for free without spending a single dollar AND also from the comfort of your home.  </p>\n\n<p>  \t              If you are a web designer, graphic designer or web developer, this is the course for you.  </p>\n\n<p>  \t                                        This course is for any web designers or developers who wants to market their skills and outsource their talents. In this course we will visit different marketplaces like Themeforest and get an overview of the marketplace then we will go through the process of uploading a theme. Also we will visit freelancing website and get some freelancing tips and tricks.  </p>\n\n<p>  \t                                        If you want to make money online from your skills as a web designer and developer this course might help you achieve your goal without spending a single dollar for your business.  </p>\n\n<p>  \t                                        Having skills isn't enough, you must learn to outsource them and market your true potential. If you take this course then at the end of the course you will be able to sell your services and products and earn money online like your fellow designers and developers are earning with same technical and potential skills.  </p>\n\n<p>  \t                                                In this course you will learn about :  </p>\n\n<ul>  \t<li>Different marketplaces where you can sell your themes and templates.</li>  \t<li>Different freelance websites where you can work for your customers in real time.</li>  \t<li>Different designing platforms where you will be able to sell your services.</li>  \t<li>Marketing your skills</li>  </ul>\n\n<p>  \t      Also there will be a document including tips for working on freelance websites. There will be another document including some important resources for web designers and developers.  </p>\n\n<p>  \t                                                This course consists of three main sections. In the first we will visit marketplaces and understand working there. In the second we will visit freelance websites. Then in the third section we will visit some other platforms where wed designers and developers can showcase their skills.  </p>\n\n<p>  \t                                                Watching this course and learning about the new world where making money is very easy could benefit you a lot. You can watch this course in one day, set up an account and start working instantly.  </p>", 
    "end_date": null, 
    "title": "Tips for Running Your Business as a Web Designer", 
    "price": "20.00", 
    "instructors": "JUNAID AFZAAL", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/210286_f4ea_5.jpg", 
    "course_url": "https://www.udemy.com/starting-a-web-design-business/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-04T10:46:24Z"
}