{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>WARNING: If you are looking for a course on how to design a layout in Illustrator, this is not the course.</strong></p><p>I think there's been some misunderstanding as for what this course is about, so let me say this again:</p><p>It's a list of 10 reasons why it's a good idea to use Illustrator for web design. It shows you 10 tools to use for web design in Illustrator.</p><p>*******************</p><p>I know you might not be too familiar with the concept of Illustrator being a web design tool. Well that's mainly because many people are not aware of tools built in Illustrator, that make it a really great web design software.</p><p>Like the majority of aspiring designers I started designing web sites in Photoshop,. But I was really missing the artwork creation flexibility Illustrator provides.</p><p>That is why I dug deep into the topic of using Illustrator as a web design tool and this course is the result of that research.</p><p><strong>In this course you will discover:</strong></p> <ul><li>Web design tools of Illustrator</li> <li>How to set up Illustrator for a web design job</li> <li>What are the most useful, practical benefits of using Illustrator for web design </li></ul><p>So join the happy community of my students and see you inside.</p><p>All the best,<br>Dawid</p>", 
    "end_date": null, 
    "title": "Top 10 reasons to use Illustrator for web design", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567370_1491_4.jpg", 
    "course_url": "https://www.udemy.com/top-10-reasons-to-use-illustrator-for-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T14:51:03Z"
}