{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t <strong style=\"\">Curso de WebDesign para Iniciantes e Veteranos.</strong>  </p>  <p>  \t       Nesse curso você irá aprender<em style=\"\"> inicialmente </em>as duas bases de desenvolvimento web que são: <strong style=\"\">HTML</strong> e <strong style=\"\">CSS</strong>. Logo após essas seções iremos abordar sobre o <strong style=\"\">GRID</strong>, que dará ao seu site uma maior responsividade.  </p>  <p>  \t       Finalizando essas seções iremos realizar um projeto Final, na qual iremos construir um site profissional e colocá-lo na internet (Hospedá-lo), ficando então disponível para qualquer pessoa acessar.  </p>  <p>  \t<em style=\"\"><strong style=\"\">Obs:. Quem fizer com sucesso o Projeto Final, ao me enviar e passar por uma análise, receberá o CERTIFICADO DO CURSO.</strong></em>  </p>  <p>  \t <em style=\"\"><strong style=\"\"><br style=\"\">  \t </strong></em>  </p>  <p>  \t <strong style=\"\">Vale a pena mesmo fazer este curso ?</strong>  </p>  <p>  \t       A melhor maneira de você desenvolver o seu site é aprendendo o conteúdo presente neste curso. Existem milhares de softwares que &quot;criam&quot; sites com alguns cliques, mas são sites que não ficam do jeito que você quer, são cheios de propagandas e ainda lhe cobram taxas.  </p>  <p>  \t <strong style=\"\">E quando terminar este curso ?</strong>  </p>  <p>  \t       No final deste curso você estará <em style=\"\">TOTALMENTE </em>apto a criar sites Profissionais da maneira que você quiser.  </p>  <p>  \t       Poderá também, até abrir a sua própria empresa de desenvolvimento web e sair lucrando muito com os vários sites que criar.  </p>  <p>  \t <strong style=\"\">Requisitos ?</strong>  </p>  <p>  \t       Não é necessário nenhum tipo de conhecimento a lógica de programação ou qualquer outro curso anterior. Como dizemos no vídeo: <em style=\"\">&quot;Basta apenas força de vontade e o Interesse &quot;</em>.  </p>  <p>  \t <strong style=\"\">Não perca tempo !</strong>  </p>  <p>  \t       O que está esperando ? Inscreva-se neste curso conosco e acrescente esse amplo conhecimento na sua vida. Ele fará uma enorme diferença. Faça esse investimento por você e pelo seu futuro.<strong style=\"\"> Vamos Juntos Nessa !!!</strong>  </p>  <p>  \t <strong style=\"\">________________________________________________________________________</strong>  </p>  <p>  \t <strong style=\"\">Gregory C. Beviláqua</strong>  </p>", 
    "end_date": null, 
    "title": "Torne-se um WebDesign Profissional e crie o Seu próprio Site", 
    "price": "20.00", 
    "instructors": "Gregory C. Beviláqua", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/185616_3c36_2.jpg", 
    "course_url": "https://www.udemy.com/webdesign-profissional/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-20T03:27:05Z"
}