{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Thor Alexander: TYPO3 - Schnelleinstieg für Nutzer</strong></p><p>Ich erkläre die Bedienung des CMS TYPO3. Sie machen ohne eigenes Redaktionssystem bzw. ohne eigne TYPO3-Homepage mit.<br></p><p>+++ Letzte Aktualisierung des TYPO3-Kurses am 22.12.2015 +++<br></p><p><strong>Internet-Veröffentlichungen ohne HTML-Kenntnisse</strong><strong></strong><br></p><p>Wer <strong>TYPO3 als Nutzer bedienen möchte</strong>, ist in diesem Kurs willkommen - egal ob Sie bereits eine TYPO3-Homepage haben oder noch nicht. (Zugang zum Lernsystem kann beantragt werden. TYPO3-Homepages gibt es bei guten Webhostern nicht kostenlos, sondern inklusive.)</p><p><strong>Einstündiger Kompaktkurs zum TYPO3 CMS</strong></p><p>In rund einer Stunde und 18 Lektionen wird das Wichtigste zur Bedienung des bekannten Redaktionssystems für Nutzer vermittelt. Dazu werden die Handgriffe zuerst per Video gezeigt und erklärt. Anschließend können Sie diese Handgriffe nachmachen.</p><p>Der Online-Kurs beginnt mit einem Überblick über Redaktionssysteme und TYPO3 in drei Minuten. Anschließend erfahren Sie das Wichtigste zu den TYPO3-Benutzereinstellungen, lernen Dateien und Bilder hochzuladen, neue TYPO3-Seiten anzulegen und zu ändern. Den Großteil des TYPO3-Kurses nimmt die Gestaltung der Inhalte ein: Überschriften, Texte, Links, Bilder und deren Beeinflussung (Gestaltung).</p><p><strong>Was gibt es noch im TYPO3-Kurs?</strong></p><p>Zum Kursende erhalten Sie die Regeln für eine gute Webseitengestaltung mit TYPO3 auf einer Folie zusammengefasst. Das Skript können Sie sich (wie immer bei Thor-Alexander-Kursen)  kostenfrei herunterladen.</p><p><strong>Als Nutzer anderer TYPO3-Versionen</strong></p><p>Dieser TYPO3-Kurs setzt auf die TYPO3-Version CMS 6.2 auf. Die TYPO3-Versionen 4.4, 4.5, 4.6 und 4.7 sind ähnlich zu bedienen sowie 7.x. Daher kann dieser Kurs auch zum Einarbeiten als TYPO3-Nutzer in den anderen Versionen genutzt werden.</p><p><strong>Als Ergänzung zum TYPO3-Kurs empfehle ich folgende Online-Kurse:</strong></p><ul><li>Homepage/Blog - Der Top-Einstieg</li><li>Rechtskonformes Impressum selbst erstellen</li><li>5 x Webanalyse per Google - kostenlose Webstatistiken</li></ul><p><strong>Wenn Sie TYPO3 richtig verstehen und effizient bedienen wollen, dann besuchen Sie jetzt meinen TYPO3-Kurs!</strong></p>", 
    "end_date": null, 
    "title": "TYPO3 - Schnelleinstieg für Nutzer", 
    "price": "25.00", 
    "instructors": "Dipl.-Ing. Thor Alexander", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672718_463f_11.jpg", 
    "course_url": "https://www.udemy.com/typo3-62-schnelleinstieg-fur-nutzer/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-17T22:13:30Z"
}