{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong></strong><strong>NEW! NEW! NEW!</strong></p><p>This is another course in the <strong><em>\"WordPress and Genesis DIY Series\"</em></strong></p><p><strong>Course Objective: </strong>Introduce the Genesis Framework and<strong> </strong>explain<strong> </strong>how to use the Genesis Framework with WordPress to take WordPress to places you never thought it could go. To learn how to get up and running with The Genesis Framework.</p><p>In this course, the student will gain an in-depth knowledge of the Genesis Framework features. If you already have WordPress installed and want to take it to the next level, then this course is for you.</p><p>If you do not have WordPress already installed on your web server, I highly recommend that you install it before taking this course. If WordPress is totally new to you, may I recommend you taking my \"<em><strong>WordPress and Genesis DIY Series: </strong><strong>WordPress and Installing The Genesis Framework\" </strong>course.</em></p><strong><em>\"Genesis\"</em></strong> is much more than a mere WordPress theme; it's an underlying framework of immaculate code that offers three important benefits: SEO, security, and a huge selection of design options. Learn how to get up and running with Genesis in this course.<p><strong>*** ALL LECTURES ARE IN HIGH DEFINITION (HD) ***</strong></p><p>In my more than 35 years of formal teaching experience, I have found that the best approach to teaching was for the teacher to place himself at the desk of and in the role of the student. And, to teach in a manner imaging that he himself is the student.</p><p>Some instructors teach over the head of the student. Not all students are the same. Yet, it is the responsibility of the teacher to find a way to reach students who \"just don't get it.\" Indeed, the teacher should sweat over finding a solution to reach that student. If necessary, lose sleep over it. Then when the light bulb in that students head \"turns on\" then there is the reward!</p><p>In this course, I will teach with the <em>Look-Over-My-Shoulder</em> lecture method and DEMONSTRATE how to quickly get up and running with the Genesis Framework.</p><p><strong>Let Me Help You</strong></p><p>So if you have a strong desire or compelling need to learn The Genesis Framework and quickly get up and running it on your WordPress website, then this course is for you.</p><p>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk!</p><p>After taking my course, any mystique you may have had about The Genesis Framework will be removed. You will feel confident in your ability to make The Genesis Framework do what you want it to do.</p><p>Click the <em>\"Take This Course\"</em> button now.</p><p>Kind regards,</p><p><em>R. Jerome Harris</em></p>", 
    "end_date": null, 
    "title": "Up and Running With The Genesis Framework", 
    "price": "20.00", 
    "instructors": "R. Jerome Harris", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556330_b96d_3.jpg", 
    "course_url": "https://www.udemy.com/up-and-running-with-the-genesis-framework/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T14:16:15Z"
}