{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>\"</em>Knowledgeable and helpful teacher<br></p><p><em>Sean explains the material very well and solves any problems or questions. He also updates material as he uncovers new needs.\" by </em><em>Jon Arbizu</em></p><p><em>\"This course saved a project i was working on ... Thank you a lot :).\" <em>by Omåř Ħàny</em></em></p><p><em>\"I was very impressed with how the emphisis was on simplicity. I thought that rather than getting bogged down in the techy stuff the tutor made things easy to understand. I have been overwhelmed with the amount of stuff crammed into ultimatum and it his left me uninspired. Doing this course has made me feel good about the software, it has allowed me to feel I can use it. Thanks Sean.\" <em>by Justin Martin</em></em></p><p><em>\"This course covers anything there is to know about the Ultimatum framework. </em></p><p><em>If you are staring at your screen and don't know where to start? TAKE THIS COURSE!\"</em></p><p><em><strong>These are just a few of the great reviews this course has already received (and which I am very grateful for).</strong></em></p><p>  \tYou can build a mobile responsive themed website in less than 1 hour using the lectures in this course combined with Wordpress and Ultimatum.  </p>  <p>  \t      The one thing I disliked about Wordpress was that; although you can get MANY themes, to create your own mobile friendly responsive theme you had to know and understand Php, CSS and how to edit those in the theme to get what you wanted.  </p>  <p>  \t        This is not a simple task, especially how the source is set out.  </p>  <p>  \t        Well, I discovered the secret. Ultimatum. The Ultimatum framework can be simply used to create YOUR Theme.  </p>  <p>  \t        Not edit someone else's but create YOUR theme. Just using drag and drop components. Better still, you can export it and use on other sites.  </p>  <p>  \t        Take this course today if you want to understand how to use Ultimatum and  you could create your own Wordpress Themed website in less than 1 hour.  </p>  <p>  \t        No editing Php, no changes to CSS in files. Its all done from the interface using Drag and Drop and configuration setup.  </p>  <p>  \t        Below is a little more info on this course if you still need it :  \t<strong></strong>  </p>  <p>  \t                Have you ever wanted to create your own webpage but don't want to spend hours and hours learning HTML, Php, JQuery and all the other languages and APIs?  \t<strong></strong>  </p>  <ul>  \t<li>What if you could create an awesome website with no code?</li>  \t<li>What if you could use the power of the Wordpress CMS and create YOUR own theme?</li>  \t<li>What if that theme creation was just drag and drop and update of parameters?</li>  \t<li>What if you could then export this as a child theme and load onto other sites?</li>  \t<li>What if you could use this to create customer websites and become a web developer?</li>  </ul>  <p>  \t              Well you can. This course shows you how to use Wordpress and Ultimatum 2.7 to create websites using drag and drop.  </p>  <p>  \t                    Create custom layouts and themes. You can then export those themes and import into other sites running ultimatum  </p>  <p>  \t                    Use wordpress and Ultimatum to start a website design business.  </p>  <p>  \t                    Child Themes created can even be sold to others running ultimatum.  </p>  <p>  \t                                                          This course will show you just how easy Wordpress is while using the Ultimatum Theme Framework  </p>  <p>  \t                    I walk you through how to put together a page using Wordpress and Ultimatum. I show you how easy it is to get your page up and running. Then using this knowledge and skills you can go and create your own custom theme using the framework.  </p>  <p>  \t              At the end of this course you will know what Wordpress and Ultimatum are. You will know how to install Ultimatum; you will know how to create your own Template and Layout in Ultimatum and have the knowledge to create your own unique Wordpress Website.  </p>  <p>  \t<strong>After completing this course you will understand how to :</strong>  </p>  <ul>  \t<li>Install and activate ultimatum</li>  \t<li>How to create layouts</li>  \t<li>How to add content, posts</li>  \t<li>Partial and Full layouts</li>  \t<li>How to create a menu</li>  \t<li>Header and Footer creation</li>  </ul>  <p>  \t                                                          Do you want to know how to <strong>create and use a static page</strong>? Maybe you want to <strong>add a contact us form</strong>? This is covered too.  </p>  <p>  \t                                                          So, if you want to create your page then please start today and start building  your dream page.  </p>  <p>  \t<strong>Updates</strong>:  </p>  <p>  \t                                              08/01/15 - New lecture to demo the Visual Composer. Visual Composer is a tool to help create your Ultimatum site. This is supplied by the Ultimatum team.  </p>  <p>  \t                              15/01/15 - New section 7 with 5 new lectures where we quickly create a first website using using the drag and drop techniques that were shown in the course  </p>  <p>  \t  28/02/15 - New lecture showing how to change the website background from the CSS configuration. This lecture gives in-sight on just how easy this is to do with Ultimatum  </p><p>05/03/15 - New lectures just added on using BBPress and BuddyPress with Ultimatum. This video lecture shows how easy it is to add BBPress to your Ultimatum site and how to use BBPress Connect with Ultimatum</p><p>21/04/15 - Ultimatum 2.8 has been released. To give some idea of the new things you can do I have created section 6 (at the moment) which has 5 new lectures talking about Ultimatum 2.8 and showing how to change you template, layout and widgets to use this new Bootstrap 3 functionality.</p><p>11/08/15 - I've added 2 new lectures, currently 35 and 36, on Showbiz Pro Plugin. This is a great slideshow plugin which is mobile aware and great for your websites.</p>", 
    "end_date": null, 
    "title": "Use Ultimatum and Wordpress To Create Fantastic Webpages", 
    "price": "20.00", 
    "instructors": "Sean McCammon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371092_0929_5.jpg", 
    "course_url": "https://www.udemy.com/beginning-with-the-ultimatum-wordpress-theme-framework/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T00:31:34Z"
}