{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>For a lot of people getting your first great job in the digital design industry seems like a crazy dream...</strong></p><p><strong></strong></p><p>Getting into the industry can seem super-intimidating. Even people who <em>already </em>work in agencies sometimes struggle to progress if they aren't learning the right skills. </p><p>Here's the thing. The top agencies and in-house digital teams have usually got more work than they can handle so there are often opportunities for enthusiastic people who can come in on the ground floor and learn fast on the job. If you're smart, if you have some talent and you're prepared to put a little work in, <strong>that could be you </strong>(cue fist-pump).</p><p>By the end of this course you'll be able to design a working prototype of a website with great user experience <strong>(UX),</strong> user interface <strong>(UI)</strong> and interaction design <strong>(IxD)</strong>. You'll be able to use navigation in a sophisticated way and learn the basics of <strong><strong>responsive<em> </em></strong>design</strong> for multiple devices. Along the way you're going to learn how to present content and work with web fonts and colours. And you're going to learn all the right terminology to articulate how you reached your design solution.</p><p><strong>Who am I &amp; why did I do this course?</strong></p><p>I'm a digital Creative Director and agency owner. When interns or inexperienced designers come to work in my studio I want them to <strong>start designing confidently</strong><strong> </strong><strong>on day one</strong>. This course is a collection of all the things I teach them, so if you're still reading by this point, it's probably the stuff you want to know too. There's no filler - I've put a lot of effort into keeping it really focused to get you up and running as fast as possible.</p><p>To help you out, you're going to get <strong>pro quality design templates</strong> based on the ones used by my agency in the work we do for clients like Amnesty, Timberland, BBC, Johnson &amp; Johnson &amp; others. We're also going to pick apart some of the sites we've designed so you can see our thinking.</p><p><strong>What this course does NOT cover</strong></p><ul><li>This course does not teach you how to code or be a web developer</li><li>There are not tons of Photoshop tricks 'n' tips. There are other courses on Udemy that are great at that stuff. This course is aimed at students who want to be professional digital designers so I concentrate on the skills that busy Creative Directors or critical clients care most about: being able to design great website experiences, being able to articulate your design decisions and being able to communicate with other web professionals.</li></ul><p><strong>Is this the right course for me?</strong></p><ul><li>To get the most out of this course you need some basic familiarity with graphics tools like Photoshop.</li><li>This course will suit everyone from a first year student through to experienced graphic designers.</li><li>There are advanced techniques in here too, so if you already work in web design but want to up your game on responsive design or prototyping you should check it out. Have a look at the free videos and see if it's for you.</li></ul><p>Let me help you give yourself the best shot at getting on in the industry.</p><p>What are you waiting for? Let's go!</p>", 
    "end_date": null, 
    "title": "Web Design: Learn Pro Skills FAST! (Sept 15)", 
    "price": "20.00", 
    "instructors": "Darius Pocha", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434150_dd1a_17.jpg", 
    "course_url": "https://www.udemy.com/web-design-pro-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T14:50:19Z"
}