{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">WebWarrior, is a modularized, effective training program fully tough for strategical design. This program will teach you about mass web production and optimizing your web business so you deliver the projects your clients are looking for. Each lesson is a different weapon in your arsenal of techniques and knowledge, and each lesson has an on-demand application in the web ecosystem. This course is made with video presentations, demos, useful advice and systematic learning mechanics. Design better websites, get more precise in your plans, approach clients efficiently, design user experiences with the right methods, sell your work and always aim to use the best practices. The materials you need are a simple web browser, pen and paper, your notepad and you attention.  Immediatelly apply the knowledge you get from web warrior in your next business project or use it to grow your web agency.</p><p style=\"\">The web warrior method is based in modules that you assemble until you get the learning experience that you are looking for. All you need is desire to learn a new mind shift in web production. From psychology to real use case applications, this program leads you trough the path of a normal day of considerations for the web producer.</p><p style=\"\">You will get key resources and input to start applying these informational assets in your next project.</p><p style=\"\">Key topics Covered (MODULES):</p><ul><li>PAGE FLOWS</li><li>WIREFRAMES</li><li>JOURNEY MAPS</li><li>NEGOTIATION</li><li>CLIENT TYPES</li><li>WEB ARCHITECTURE</li><li>PORTFOLIO SHOWCASES</li><li>CLIENT ADQUISITION</li><li>QUOTING</li><li>COLLECTING</li><li>USER PSYCHOLOGY</li><li>DESIGN MINDSETS</li></ul>", 
    "end_date": null, 
    "title": "Web Warrior - Agile Design Program", 
    "price": 0, 
    "instructors": "David Echeverri", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548768_e3d9_2.jpg", 
    "course_url": "https://www.udemy.com/web-warrior-agile-design-program/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-08T07:22:17Z"
}