{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t in this Web design Course will teach you practically how you can analyze the customer requirements and convert this analysis into a Photoshop file, then slicing it and go coding using Dreamweaver and writing html and css   .  </p>  <p style=\"\">  \t Software: Photoshop CS6, Dreamweaver CS6  </p>  <p style=\"\">  \tCode: HTML, CSS  </p>  <p style=\"\">  \t-------  </p>  <p style=\"\">  \tبدايةً يرجع الفضل لله عز وجل في خروج هذه الدورة للطلبة بهذا الشكل وهذا المستوى ، فلله الحمد والمنة. فكرة تسجيل الدورة في الأساس كانت تقديم شيء ينفع الاسلام والمسلمين والحمد لله تم البدء في التسجيل بدون أي تحضر أو تكليف.  </p>  <div style=\"\">  \t<p style=\"\">  \t\tفقمت في الجزء الخاص بتصميم المواقع بالعمل على مجموعة من المواقع التي صممتها من قبل وهي مواقع حقيقة موجودة على الانترنت ، وهذا جعل الدورة على درجة كبيرة من الواقعية.  \t</p>  \t<p style=\"\">  \t\tإعتمدت في الشرح على التطبيق العملي بشكل كبير حتى أكسر الملل الذي يصيب الدارس للتصميم والبرمجة من كثرة الأجزاء النظرية التي تتخلل الدورات .  \t</p>  \t<p style=\"\">  \t\tفي المستويات الست التي قمت بشرح التصميم والتكويد عليها اتعبت اسلوب ثابت وكررته في كل المستويات فبدأت بعملية تحليل لمتطلبات العميل ثم تحديد الأساسيات الضرورية للبدء في تصميم الموقع.  \t</p>  \t<p style=\"\">  \t\tفمثلا تحديد الأولوان ودرجاتها والتركيز على طرق اختيار الالوان وتوزيع ووزن عناصر التصميم الاساسية من هيدر وفوتر وسايد بار ومحتوى الصفحة.  \t</p>  \t<p style=\"\">  \t\tوالتركيز على عملية التحليل بشكل كبير هذا بهدف السرعة في تحويله الافكار الي تصميم ومن ثم السرعة في تكويد هذا التصميم.  \t</p>  \t<p style=\"\">  \t\tأثناء الشرح لايهمني أبدا الوقوف على كل أداة وشرحها بشكل نظري ، فقط كان يكفيني تنفيذ المطلوب منها بشكل متكرر مما يكسب الطالب الخبرة في استخدام الأدوات بشكل سريع.  \t</p>  \t<p style=\"\">  \t\tفكنت أشرح التصميم وكأنني أنفذه للمرة الأولي فقط مع التحدث بماذا افعل وتعليل الاسباب لتوضيح ما اقوم به.  \t</p>  \t<p style=\"\">  \t\tايضا بداية الدورة كانت بشكل عملي وكان هناك حضور وكان أغلبهم للمرة الأولي يتعامل الفوتوشوب وليس لديه معرفه مسبقة بتصميم المواقع مما جعل الشرح يناسب بدرجة كبيرة من ليست لدية اي خبرة بتصميم المواقع ثم تدرجنا معا في الشرح حتي المستوى السادس وزادت درجة التعقيد في الكود والتصميم بحيث نصل لدرجة كافية من الخبرة.  \t</p>  \t<p style=\"\">  \t\tمن أكبر المشكلات التي تواجه اي طالب يدرس تصميم المواقع والبرمجة هي مشكلة التدريب حيث ان المتدرب يحتاج الى تدريب عملي حتى يستطيع ان ينزل الى سوق العمل ويشارك المصممين في المهنة.  \t</p>  \t<p style=\"\">  \t\tفبفضل الله اذا نظرنا الى جدول الدورة نجد انها تغطي الكثير من الخبرات التي تعطي الطالب الثقة في مواجهة السوق دون أن يحتاج الى تدريب فالدورة نفسها تتضمن تدريب بشكل كبير.  \t</p>  \t<p style=\"\">  \t\tنبدأ في الدروة بدراسة المستويات الست بالتوالي وكل مستوى يتطلب أسبوع واحد فقط ويتم تصميمه وتكويده مرتين متتاليتن في نفس الاسبوع. ثم نصل للنهاية يكون الطالب لدية القدرة على تنفيذ ما لديه من افكار فقد قام بالتطبيق حوالي 12 مرة.  \t</p>  \t<p style=\"\">  \t\tثم يطلب منه تنفيذ 5 مشروعات يقوم هو بتحليل وتصميم وتقطيع وتكويد الموقع.  \t</p>  \t<p style=\"\">  \t\tفيكون الطالب بفضل الله ثم مجهودة الذي بذله قد قام بعميلة التصميم والتكويد اكثر من 17 مرة ، وهذا المقصود منه التدريب على العديد من المشكلات المختلفة والتعامل معها وبالتالي يجد الطالب في نفسه الثقة المطلوبة والتي تمهل لنزوله الى سوق العمل دون الحاجة الى النزول كفترة تدريب.  \t</p>  \t<p style=\"\">  \t\tأيضا بمقارنة الفترة الزمنية بكمية الاعمال نجد ان هناك ضغط كبير يقع على المتدرب وهذا ايضا مقصود وهو ان تكون لدية القدرة على العمل تحت ضغط وهذه طبيعة سوق العمل.  \t</p>  \t<p style=\"\">  \t\tوبفضل الله حينما اردت البدء في دورة البرمجة قمت في البداية بعمل دروة قصيرة من 13 درس لشرح اساسيات البرمجة بلغة البي اتش بي ثم انتقلت سريعا الى العلمي والتطبيقى على موقع المستوى الخامس ايه ويب ارتس حتى تكون تكلمة لمشروع بشكل كامل.  \t</p>  \t<p style=\"\">  \t\tايضا كان الشرح بشكل عملي في قواعد البيانات من البرمجة بحيث اننا ننفذ علميا ومن ثم نفهم النظرية من وراء التطبيق.  \t</p>  </div>", 
    "end_date": null, 
    "title": "Web design: دورة تصميم مواقع الإنترنت", 
    "price": 0, 
    "instructors": "Ali Hamdi", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176588_dfa1_3.jpg", 
    "course_url": "https://www.udemy.com/web-design-course-ali-hamdi/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T11:46:36Z"
}