{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>I remember myself watching web design tutorials and courses thinking:<em class=\"redactor-inline-converted\"> Ok, I know how to click things, but how to put all the pieces together?</em>\n</p>\n\n<p>I rarely got the answer.</p>\n\n\n\n<p>So I know what it feels like to look for practical knowledge and not getting it.</p>\n\n\n\n<p>That is why I’ve put this course together, so <strong class=\"redactor-inline-converted\">y</strong>ou can learn the <strong class=\"redactor-inline-converted\">actual web design process</strong> and so you can do it effortlessly.</p>\n\n\n\n<p>Because if you want to</p>\n\n\n\n<ul><li>Learn professional web layouts design in Illustrator</li><li>Build your confidence in being able to design a web layout independently</li><li>Lern only the practical aaspects of using Illustrator for designing web layouts</li></ul>\n\n\n\n<p>this is the course for you.</p>\n\n<p>Because you will learn how to design a website in Illustrator without spending weeks on watching tutorials, that get you nowhere.<br></p>\n\n\n\n<p>Because you will learn how to design a website without spending weeks on watching tutorials, that get you nowhere.<br></p>\n\n\n\n<p>You will learn all that is necessary to design a website, but nothing more, so if you are looking for some Illustrator or web design basics, take a look at my other courses.<br></p>\n\n\n\n<p>Oh, and don’t forget. You are totally covered by a  30-day 100% money back guarantee. No questions asked, no hard feelings.</p>\n\n\n\n<p>Your risk is absolutely zero.</p>\n\n\n\n<p>So it’s really up to you now.</p>\n\n<p>Enroll in the class and see you inside.</p>\n\n\n\n<p>Dawid</p>\n\n<p>PS: This is what one of my students, Gidget Harris, had to say about this course<br></p>\n\n<p><em>\"I'm so glad that I took this course. The Instructor is friendly and genuinely cares about his students. I've just bought all of his other courses because I've been so impressed. I highly recommend this course to everyone. This Instructor has taught me that there is always something new to learn.\"</em><br></p>", 
    "end_date": null, 
    "title": "Web design : How To Design a Website in Illustrator", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664922_54ea_4.jpg", 
    "course_url": "https://www.udemy.com/web-design-design-website-a-web-design-software-illustrator-cs6/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T18:00:17Z"
}