{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>\n                                        <strong><em>\"Excellent.</em></strong><em> This is probably to \ndate one of the best courses that I have taken here at Udemy.  Kristen \nis an excellent instructor and is very helpful as you move forward.  I \nwould recommend this course to anyone that is even thinking about \nlearning web design. Kristen is Amazing. Thanks!\" </em>-Shawn G. Miller</p>\n\n<p><em></em><em></em><em></em> <strong></strong></p><p>  \t<strong>      Are you ready to get a FULL web design foundation and overview (the equivalent of 12 power-packed smaller courses) all in one concise bundle from an artist and professor teaching web design since 2002 to hundreds of happy University students? </strong>  </p>\n\n<p>  \t            Use these bite-sized lessons to make your own website from scratch or learn how to  manage a website that someone else created for you.  </p>\n\n<p>  \t            Worried that you are too late to get started or there is too much you don't know? Online tools, software programs, coding languages, and methods change  or come and go, but <strong>a good web design foundation will stay with you no  matter which direction you go in or which tools you ultimately use.</strong>  </p>\n\n<p>  \t            This course will teach you best practice web design fundamentals that NEVER change (the way software programs change) along with several current and easy methods for creating beautiful websites. Learn at your own pace and in the order you choose. <em>Web Snax </em>is one giant, delicious resource that you can come back to again and again.  </p>\n\n<p> <strong></strong> <br></p><p>  \t<strong></strong>Most of my past and current students are artists, designers, and technophobes who now never have to pay anyone else to make their own websites, saving themselves thousands per year.  </p>\n\n<p>  \t                                                                                                                                          Many have also gone on to start their own web design businesses or joined companies as well-paid web designers and content managers. <strong>If they can do it, so can you.</strong>  </p>\n\n<p>This fun and easy to follow course was originally created in Nov. 2014 for my <strong>Web Graphics, Coding, and Site Design Students</strong> from <strong>The American University of Rome </strong>to use as a resource at the end of our busy semester and beyond. It's now open to the public, is constantly being updated, and has received glowing reviews from students all over the world.  </p>\n\n<p>  \t       In <em>Web Snax</em>, I draw upon my experience teaching web design on four continents to students from all walks of life and can show you how to create and manage your own website regardless of your personal software/hardware set up, resources, and budget.  \t<strong></strong>  </p>\n\n<p>  \t                                                                                                                                             New lessons are continuously added, making this <strong>the most comprehensive online web  design course available </strong>and the best choice for right-brained, visual learners who are often intimidated by technology, software, and  the like and prefer to be <strong>taught in plain language from a fellow creative.</strong>  </p>\n\n<p>  \t                                                                                                                                                                                                  I'm a  tenured Associate Professor of Digital Media and the Program Director of  Film &amp; Digital Media at <strong>The American University of Rome </strong>and a practicing award-winning multimedia artist.  </p>\n\n<p>  \t                                                                          I have run my own charitable website, Aura's House that has raised over $100K for needy children in developing countries around the world. I also manage my own online portfolio, and have personally worked on the official website for multi-platinum, award-winning rock band, <em>The B-52's</em> and designed and/or contributed to websites for clients and non-profit organizations.  </p>\n\n<p>  \t                                                                                                                                                                                                                      I have over 15 years of experience teaching students all over the  world using my tried and true custom approach (turning  complex  information into something simple, memorable, easy-to-understand  in as  short amount of time as possible) to ensure that <strong>you get the  most  important, relevant, and useful information that can be applied   immediately.</strong>  </p>\n\n<p>  \t<strong>This course teaches you TWELVE important essentials of web design, leaving you empowered to go in any direction you choose in the field.</strong>  </p>\n\n<ol>  \t<li>The Do's and Don'ts of Web Design and Best Practices. </li>  \t<li>Content Management and Planning an Effective Website.</li>  \t<li>Web Graphics and Media Creation Essentials.</li>  \t<li>How HTML works and an introduction to coding.</li>  \t<li>How CSS works.</li>  \t<li>Making websites from scratch using Dreamweaver.</li>  \t<li>How to upload to and download from the internet using an FTP program.</li>  \t<li> How to get a high quality web host and domain name.</li>  \t<li> Adding dynamic features to a website using J-Query assets, Javascript, and code created by programmers.</li>  \t<li>Migrating to a Content Management System. Create/manage a WordPress hosted site and set up pages, posts, themes, widgets, plugins, etc. </li><li>(*NEW) A Step-by-Step Demonstration of giving your website a complete makeover using the WordPress <em>Elegant Theme, Divi.</em></li><li>(*NEW) Diagnose, tune-up, and supercharge your website so it performs\n better, generating more clicks, engagement, followers, subscribers, and\n sales 24 hours a day while you are off doing other things. All students\n in this course get access to my follow-up course, <em>WordPress Website \nChallenge: Easy Ways to Boost Impact</em> FREE.</li>  </ol>\n\n<p>  \t<br><strong></strong></p><p><strong>This course will show you what to do and why to do it so you will understand the material easily and can apply it no matter what you decide to do next</strong>; as a content manager for your organization's website, a web designer for yourself or others, or as a key member of a  company's full web team, etc.  </p>\n\n<p> <strong></strong>You have a <strong>30-day, 100% money-back guarantee</strong> with no questions asked so you have nothing to lose. I make myself available so you will have access to me if you have questions or need feedback along the way. <br></p><p>  \t<strong></strong>Please Note: Students enrolled in ANY of my courses periodically  receive freebies and discounts to my other top-rated current and upcoming courses  as well.  </p>\n\n<p>  \t                                                                                                            Are you ready to get started right away saving yourself money on web design fees and even making new income setting up websites for others? Let's go!  </p>\n\n<p>  \t                                                                                                                                    Click the \"Take This Course\" button in the upper right corner of this page to <strong>enroll now. I look forward to working together with you so you can empower yourself to achieve your web design goals.</strong>  </p>", 
    "end_date": null, 
    "title": "Web Snax: Super Simple Recipes for Easy Web Design", 
    "price": "45.00", 
    "instructors": "Kristen Palana", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350828_3477_12.jpg", 
    "course_url": "https://www.udemy.com/web-snax-right-brained-recipes-for-easier-web-site-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T13:03:21Z"
}