{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Are you a web design beginner?</p>  <p>Have you been designing web sites for a while, but never in Illustrator? </p>  <p>Or maybe you have been using Illustrator for some time, but never thought you could use it for web design?</p><p>Stop wasting your time on wondering and guessing.</p><p>Thanks to this course you will gain all the knowledge you need start designing amazing websites independently.</p>  <p><strong>Inside you will find unique information on:</strong><br></p>  <ul><li>How to transform Illustrator into a web design supertool. </li><li>How to easily build a wireframe and a website on top of that – fast!</li><li>How to master desktop, tablet and smartphone web design – all in one file thanks to Illustrator’s artboards</li><li>How to make your design faster and more professional with a custom, Bootstrap like 12-column grid</li></ul><p><span></span></p>            <p>What you get is an exclusive occasion to start designing wonderful websites, that you can charge thousands of dollars for. </p><p>And yes, you can do that using Adobe Illustrator.</p><p>But you don't have to take my word for it. Take a look at what Jason Martinez, one of the students in this course, had to say about it:</p><p><em>\"This course will help out tremendously in getting set up for web design. Takes all the guess work out of the picture and has practical tips to make the process less difficult.</em></p><p><em>This course will save you time! Recommend to any beginner who wants to learn about web design. Also, covers saving in file type(s) before submitting to the client. Awesome instruction.\"</em></p><p><em>-</em></p>  <p>This course is for all those who want to start designing websites in Adobe Illustrator.</p><p>Otherwise, this course isn't for you.</p><p>I know, that it is not that common to use Illustrator for web design. Well that’s mainly because developers are simply used to receiving designs made in Photoshop. And that’s ok! Illustrator lets you export files to Photoshop with ease!<br></p><p>So you get the best of both worlds: design in Illustrator, deliver in Photoshop.</p>  <p>And this goes to all you logo designers and all you dtp designers: you don’t have to ditch Illustrator to design web sites! You can do that successfully in your favorite design tool!</p>  <p>I vouch for this course. I wish I came across this kind of knowledge, when I was starting out as a designer. </p>  <p>But if, within the 30-day guarantee period, you are not convinced, that this course is going to kick-start your web design projects  in Adobe Illustrator…</p>  <p>… simply ask Udemy for a refund, but I really doubt that you will have a reason for it. </p>    <p><strong>You risk nothing.</strong></p>  <p>It’s up to you now.</p>  <p>Click that Enroll button and take your first step to creating sensational web designs in Illustrator. </p><p>See you inside.</p><p><br></p>", 
    "end_date": null, 
    "title": "Web Design Fundamentals in Illustrator", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642608_7bad_6.jpg", 
    "course_url": "https://www.udemy.com/web-design-software-web-designer-adobe-illustrator-cs6/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T17:15:10Z"
}