{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>In this course you will learn how to create a responsive website with tons of complex functions that you can use for your own web projects.</span>  </p>  <ul>  \t<li>Create a fully responsive website without any code</li>  \t<li>Create a responsive navbar with a drop down menu</li>  \t<li>Create a responsive slideshow that is touch activated on mobile devices</li>  \t<li>Create a lightbox widget to showcase your beautiful images</li>  \t<li>Create a responsive contact form to collect user data</li>  \t<li>Create elegant hover states for buttons with transitions</li>  \t<li>Create awesome interactions for images, thumbnails and navigational elements</li>  \t<li>Create animations that can loop and play when the page loads</li>  \t<li>Publish your project to the web with one click</li>  \t<li>Learn how to optimize a website for smaller screens</li>  </ul>  <p>  \tAt the end of this course you will be able to build all of this without writing a single bit of code!  </p>  <hr>  <p>  \t<span>You should take this course if you&#039;re doing web design work for a client, family member, friend, or if you&#039;re starting your own business!</span>  </p>  <p>  \tThis course is Learn-By-Doing so you&#039;ll follow along with me throughout the course as I show you how to build the website and I&#039;ll explain all the <em>tools</em>, <em>functions</em> and <em>design concepts</em> as I go.  </p>  <p>  \tEach lecture will be really focused on one specific part, and I explain how that part fits in with the rest of the site so that you not only learn how to exactly replicate what I&#039;m showing you, but you will be able to use your own creativity to create something unique, and I encourage it.  </p>  <p>  \tWhen you enroll to this course you will receive announcements whenever I add new lectures and content, so there will always be something new for you to learn!  </p>", 
    "end_date": null, 
    "title": "Webflow: Create A Responsive Website Without Code Knowledge", 
    "price": 0, 
    "instructors": "Edvin Lynch", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365592_012b_5.jpg", 
    "course_url": "https://www.udemy.com/webflow-create-a-responsive-website-without-code/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T05:00:05Z"
}