{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><em>Over 5,993 successful students have enrolled in this course with 5-star reviews!</em></strong></p>\n\n<p>This course was updated April 12th, 2016.</p>\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p><strong>Website Design</strong> - If you want to learn how to build a fully mobile-responsive website for your business without touching a line code, this course is for you!</p>\n\n<p><strong>What do you get from this course?</strong></p>\n\n<p>Learn the exact <strong>12 steps</strong> I used to build a mobile website design for my marketing and consulting business with no coding and no experience necessary.</p>\n\n<p>**This course uses Strikingly website designer. You can create a free account at Strikingly dot com. Some of the lessons in this course require Strikingly Pro features, which start at $8/mo. (Still a very low price to pay for an awesome professional website). </p>\n\n<p><strong>What you will learn:</strong></p>\n\n<ul><li>The 12 Simple Steps to Build a Mobile Website with no coding.</li><li>How to build an awesome website with no experience necessary.</li><li>Learn how to have your website designed in 1-2 hours.</li></ul>\n\n<p><strong>Who is this course for?</strong></p>\n\n<p>Freelancers, Entrepreneurs, Business Owners, Photographers, and anyone that wants to learn to build a fully mobile-responsive website in a couple of hours.</p>\n\n<p><strong>Do I need experience with web design?</strong></p>\n\n<p>Nope. The website builder that I teach in this course, <strong>Strikingly</strong>, uses a text editor and  drag and drop design to make building a website simple. I will teach you how to use it to build your website in the shortest time possible. </p>\n\n<p>If you can edit a Microsoft Word document, you can build your own mobile website in 1-2 hours (not a typo :))</p>\n\n<p><strong>How is the course taught?</strong></p>\n\n<p>Screen capture video lecture which allow you to see my screen and what to click as I walk you step-by-step through building your website.</p>\n\n<p>The course includes full access to all video lectures immediately and includes all future updates FREE.</p>\n\n<p>I look forward to teaching you!</p>\n\n<p>See you on the inside!</p>\n\n<p>Josh :) </p>", 
    "end_date": null, 
    "title": "Website Design - Build an Amazing Web Design (No Experience)", 
    "price": "20.00", 
    "instructors": "Josh Gwin, MBA", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492166_e652_6.jpg", 
    "course_url": "https://www.udemy.com/website-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-02T22:29:30Z"
}