{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t <strong style=\"\">What&#039;s the course about?</strong>  </p>  <p>  \t    Web development - Plain and simple. Everyone needs a website, whether it&#039;s to market your business, sell your new e-book, make money through advertising and affiliate marketing, or just for your family. The problem is that it just seems so difficult to create, and so really expensive to get someone else to do it for you.  </p>  <p>  \t           Try Google &quot;custom website design&quot; and see what you find. You&#039;ll find companies offering to design a site for $500, $1000, and more. And don&#039;t forget the monthly fee, which can be anything from $50 upwards. So, that&#039;s not an option for most of us, unless you have your own private jet - in which case you can probably buy the website design company.  </p>  <p>  \t           The other option is to create your own website. However this sends tremors of fear rippling through your body as you imagine weeks and months of trying to learn Javascript, HTML, XML, and what the &#039;L. Or maybe you can try and master Wordpress. Some say that is not too hard. Yeah sure! It&#039;s also not too hard to do a backflip on a trampoline (or so I&#039;m told). But you&#039;re likely to hurt yourself trying.  </p>  <p>  \t <strong style=\"\">The Web Development Solution</strong> - A simple drag and drop way to design a website. This course will show you how to use an awesome online website creator to design the most professional looking site possible. In fact I will start of by letting you watch me create an amazing website in under 5 minutes. Yes, that&#039;s correct. It is possible to create a fully functional, professional website in 5 minutes, if you know how! And I will show you how to do just that! By the end of the course...actually by the end of the first section you will be able to create a website in 5 minutes too!  </p>  <p>  \t           I&#039;ll show you how to develop a website that includes videos, images, contact forms, a blog, twitter feeds, contact forms and more. And you do not need to know anything about website creation, HTML or anything else. It&#039;s simply copy/paste, drag/brag!  </p>  <p>  \t           We will also cover other important things (after you&#039;ve mastered creating your site) such as choosing a domain name, buying a domain, getting images and video, etc. And to really make sure the website you develop is not only awesome but professional and money generating, there is a section where I will share Power Tips from the experts. Tips on getting free resources, making sure your website looks professional, making sure your website is found in Google (Search Engine Optimisation), and even some power tips on how to turn your website into a money making machine!  </p>  <p>  \t <strong style=\"\">What kind of materials are included?</strong>  </p>  <p>  \t           Everything you need for web devlopment will be explained. In fact you will be so good you could even start creating websites for others and making money. The course will consist of some really easy, professional, step-by-step videos that show you how to create your website. I mean professional...both in presentation and recording. This is not just some guy mumbling ramblings into a webcam! Plus there are downloadable tip sheets, and more. This is the ultimate web development guide!  </p>  <p>  \t <strong style=\"\">How long will the course take to complete this web development course?</strong>  </p>  <p>  \t           There are 4 sections to this web development course. After you have done Section 1 you can easily begin building your website. And that will take you just over 30 minutes of learning! Seems unbelievable, but I guarantee it! Thereafter Sections 2, 3 and 4 will extend your ability, in the same easy way as Section 1, helping you create the most amazing website possible.  </p>  <p>  \t <strong style=\"\">How is this web development course structured?</strong>  </p>  <p>  \t           This is an action course. So the course starts with getting to the doing straight away. Sure there is lots of &quot;fluff&quot; like choosing domains, and sourcing images etc. which is important, but that is left till later. I want you to get building immediately, and then we can deal with the rest. The course is structured in the following way:  </p>  <p>  \t           1.Section 1 - A website in 5 minutes.  </p>  <p>  \t           2.Section 2 - Making my website awesome  </p>  <p>  \t           3.Section 3 - Making my website professional  </p>  <p>  \t           4.Section 4 - BONUS - Making your site famous!  </p>  <p>  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t <strong style=\"\">Why take this web development course?</strong>  </p>  <p>  \t           If I am looking for an online course there are 3 key things I look for. Firstly, the qualification/experience of the teacher. Secondly, the ability of the teacher to teach/present. Thirdly, the quality of the teacher’s material. So here are my credentials.  </p>  <ol style=\"\">  \t<li>My Qualification/Experience - I have just completed a PhD in the use of IT for education. I&#039;ve been involved in IT both as a university lecturer, IT consultant and entrepreneur for over 20 years. This includes starting up multiple businesses both online and offline.</li>  \t<li>Ability to teach - In addition to having been a lecturer for over 20 years I have spoken around the world to everyone from business leaders to politicians to teachers to children. But don&#039;t believe me, here are what some of those who have heard me say:</li>  </ol>  <ul style=\"\">  \t<li>-  &quot;<em style=\"\">Craig has the rare ability to engage personally with each member in his audience</em>&quot; (A. Byrnes, PDM Pty Ltd, Australia),</li>  \t<li>- &quot;<em style=\"\">Craig is a dynamic speaker, out-of-the-box strategic thinker and professional</em>&quot; (R. van Rooyen, Associate Partner, Deloitte)</li>  \t<li>- “<em style=\"\">Mr. Blewett is a pleasure to take in. The excitingly focused style by which he speaks keeps you on the edge of your attention</em>.” (C. Stickney, USA)</li>  \t<li>- “<em style=\"\">Craig is an experienced and highly competent teacher and presenter. He has the rare ability to convey innovative concepts in an engaging fashion that is packed with enthusiasm but also logic and balance</em>.” (Dr. Alleyne, UK)</li>  \t<li>- &quot;<em style=\"\">Craig is possibly on of the most interesting presenters I have encountered. His students love him and in public forums he is unequalled</em>.&quot; (Prof. Maharaj, UKZN, South Africa)</li>  </ul>  <p>  \t          3. All the material presented in this course is professionally produced using HD video, high quality audio and specialist video editing software.  </p>  <p>  \t           Besides all this, you wont find a better value, easier course that will enable you to develop your own online business website. If you need a website for your company, to sell products online, to launch your e-book, or just for your family - then this is the web development course for you.  </p>", 
    "end_date": null, 
    "title": "Website Design", 
    "price": "20.00", 
    "instructors": "Craig Blewett", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/167244_7c51_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-website-in-5-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-19T10:10:15Z"
}