{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">The course covers exactly what is needed to build and produce a 2015 WordPress website by following very simple steps that anyone who can point and click a mouse and type on a keyboard will be able to do.</p><p style=\"\">The course is taught in a relaxed but informative style that anyone can follow regardless of their level of expertise or knowledge of the subject. </p><p style=\"\">Here's some of the subjects covered in the course:</p><ul><li>Why build a website?</li><li>Learn skills that pay you well.</li><li>How to and where to buy a website name and web hosting.</li><li>Installing WordPress on your website.</li><li>Adding another website at no extra cost.</li><li>How to add social media icons, contact forms, and Google Maps.</li><li>How to produce a good looking logo - free and paid.</li><li>and more...</li></ul><p style=\"\"><br>The skills and knowledge learnt in this course will enable the student to learn simple website building skills that they can use again and again for their own personal use or even build websites for business owners.<br></p><p style=\"\">When you consider how much it costs for an education at university that runs into thousands and the amount of personal time invested normally over a period of years, the cost of this course doesn't compare and the time it takes to complete is minimal.</p>", 
    "end_date": null, 
    "title": "Website Creation For Beginners Using WordPress 2015", 
    "price": "35.00", 
    "instructors": "Paul Fryatt", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596534_1193_12.jpg", 
    "course_url": "https://www.udemy.com/website-creation-for-beginners-using-wordpress-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T07:02:11Z"
}