{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>( Note : Still adding more videos)</strong></p>\n\n<p>You are here reading this because you are a complete <strong class=\"redactor-inline-converted\">beginner in HTML. And CSS </strong>. If not, please close this page right now. You want to learn about HTML to become a Web Designer or a Web Developer.\n\n  </p>\n\n<p>Just to get this out of the way. You will learn a lot about HTML in this course. But it will not be enough to enable you to create the awesomest web pages yet. Every learning is a process. And if you are not patient. Believe me you will never be as good as you want to be.\n\n  </p>\n\n\n\n\n\n<p>You must start from the bottom. “Started from the bottom now we’re here” .Yeah it’s all true.  It all takes time. \n\n  </p>\n\n\n\n\n\n<p>Be patient. Learn to be good.  Don’t learn so that you can create things haphazardly . Of course that is the ultimate dream. To be able to create anything with HTML and CSS. It is more important to learn to be a problem solver. If a problem is set before you, you need to be able to come up with a solution that will still be feasible years down the line.\n\n  </p>\n\n\n\n\n\n<p>Whatever your reason for learning HTML may be, start here. And grow your skills.\n\n  </p>\n\n\n\n\n\n<p> \n\n  </p>\n\n\n\n\n\n<p>I have to be frank and admit that it is more about me in creating this HTML (and  just a brush of CSS) course. The reason I say that, is because, my ultimate goal is Javascript. And I want to be sure that 6months or 2 years from now when I will be intensely doing JavaScript tutorials I will have these HTML courses to refer you back to. \n\n  </p>\n\n\n\n\n\n<p>And yes , I will be creating a couple more advanced HTML and CSS courses before I fully dive into Javascript . So start here and take this journey with me.  I am currently working on a new Website . I haven’t mentioned this anywhere else. And I will not mention it anywhere else until the time is right. I am working on a website, where I will be teaching JS related tutorials. I will do this in a bid to master the language , myself.\n\n  </p>\n\n\n\n\n\n<p>Join this HTML tutorial and take this journey with me.\n\n  </p>\n\n\n\n\n\n<p> \n\n  </p>\n\n\n\n\n\n<p>Ricky Wahowa ( Bizanosa )\n\n  </p>\n\n\n\n\n\n<p> </p>", 
    "end_date": null, 
    "title": "What is HTML?  and a bit about CSS", 
    "price": "20.00", 
    "instructors": "Ricky Wahowa ( Bizanosa )", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854934_3d10.jpg", 
    "course_url": "https://www.udemy.com/what-is-html-and-css/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T11:34:55Z"
}