{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Dies ist die erste von drei Lektionen, bei der ich Ihnen die gesamte Fertigstellung der Webseite </span><span style=\"\">Wie erstelle ich eine Homepage oder Blog</span><span style=\"\"> in nur einer Stunde erkläre! Die Lektionen, die Sie hier lernen, ermöglichen es Ihnen, eine professionelle Webseite oder einen Blog mit jeglichem gewünschten Aussehen zu erstellen.</span>  </p>  <p style=\"\">  \t  In diesem Video erfahren Sie, wie Sie eine Domain kaufen, das Erwerben eines Hosting-Accounts,<br style=\"\">  \t  das Verbinden der beiden Konten, und das Installieren von WordPress.  </p>  <p style=\"\">  \t       WIE ERSTELLE ICH EINE HOMEPAGE ODER EINEN BLOG: mit WordPress, ganz OHNE Programmierung, auf eigener Domaine, und in weniger als zwei Stunden!  </p>  <p style=\"\">  \t       In Zusammenarbeit mit: <span style=\"\">Make Money from Home LIONS CLUB</span><span style=\"\"> und </span><span style=\"\">Wie erstelle ich eine Homepage oder Blog</span><span style=\"\">.</span>  </p>  <p style=\"\">  \t       KEINERLEI  KENNTNISSE  WERDEN  VORAUSGESETZT.  ALLE  INSTRUKTIONEN  SIND  SEHR  DETAILLIERT UND  SCHRITTWEISE AUFGEBAUT – SO  DASS  SIE  FÜR  JEDERMANN  LEICHT  NACHVOLLZIEHBAR  SIND.  </p>  <p style=\"\">  \t      Lernen Sie, wie Sie eine professionelle Webseite oder einen Blog in wenigen Stunden auf Ihrer eigenen Domain erstellen und erfahren Sie, wie Sie dies mit dem populärsten Entwicklungssystem des Internets,  der Software WordPress durchführen.  </p>  <p style=\"\">  \t      Keine Programmierkenntnisse sind erforderlich um WordPress zu nutzen. Wenn Sie sich mit Microsoft WORD auskennen, dann können Sie eine professionelle Webseite mit WordPress erstellen. WordPress ist im Übrigen eine völlig kostenlose Software.  </p>  <p style=\"\">  \t      Alle Lektionen werden Ihnen in diesem Buch schrittweise vermittelt. Zusätzlich werden Ihnen die Video Sequenzen weiterhelfen welche Ihnen die vollständige Erstellung von Anfang bis Ende auf mikeomarwebsites aufzeigen.  </p>  <p style=\"\">  \t      Mit den Lektionen, die Ihnen mein Buch vermittelt, werden Sie in der Lage sein, jedwede Art von Webseite zu erstellen, welcher Art und in welchem Erscheinungsbild auch immer. Dies umfasst persönliche Blogs aber auch professionelle Business und e-Commerce  Seiten.  </p>  <p style=\"\">  \t      Darüberhinaus erhalten Sie in einem Bonus Kapitel eine Einführung in die Erstellung von Webseiten mit WordPress, die Ihnen passives Einkommen garantieren und Ihnen vermittelt, wie Geldverdienen im Netz tatsächlich funktioniert.  </p>  <p style=\"\">  \t      Die Hauptthemen meines Buches sind:  </p>  <p style=\"\">  \t      TECHNOLOGIE / AUFBAU:  </p>  <p style=\"\">  \t      - Die intelligenteste und preiswerteste Art eine Domain zu erwerben.  </p>  <p style=\"\">  \t      - Die intelligenteste und preiswerteste Art ein Hosting Arrangement  zu erwerben.  </p>  <p style=\"\">  \t      - Wie Sie Ihre Domain mit Ihrem Hosting Konto verbinden und WordPress installieren.  </p>  <p style=\"\">  \t      DIE GRUNDLAGEN:  </p>  <p style=\"\">  \t      - Eine Einführung in WordPress und bestmögliche Optimierung  der Suchmaschinen-Einstellungen für Ihre Webseite.  </p>  <p style=\"\">  \t      - Wie Sie Seiten zu regulären Webseiten zuzufügen.  </p>  <p style=\"\">  \t      - Wie Sie Postings zu Blogs hinzufügen.  </p>  <p style=\"\">  \t      - Wie Sie Bilder und Links hinzufügen.  </p>  <p style=\"\">  \t      - Wie Sie Sidebars mit Widgets aufbauen.  </p>  <p style=\"\">  \t      - Wie Sie das Erscheinungsbild Ihrer Webseite mit verschiedenen Themen verändern.  </p>  <p style=\"\">  \t      - Wie Sie ein Kontaktformular, Plugins und Verbindungen zu Sozialen Medien hinzufügen.  </p>  <p style=\"\">  \t      WEITERFÜHRENDE SCHRITTE:  </p>  <p style=\"\">  \t      - Wie Sie Google Analytics zur Nachverfolgung hinzufügen.  </p>  <p style=\"\">  \t      - Wie Sie “Jetzt kaufen” PayPal  Schaltflächen hinzufügen.  </p>  <p style=\"\">  \t      - Wie Sie eine interaktive \"Google Maps\" Karte zu Ihrer Webseite hinzufügen.  </p>  <p style=\"\">  \t      - Wie Sie eine Mailing Liste oder einen Newsletter bestmöglich aufbauen.  </p>  <p style=\"\">  \t      - Wie Sie Ihre Webseite vor Hackern,  Schadsoftware und anderen Viren schützen.  </p>  <p style=\"\">  \t      - Voraussetzungen für e-Commerce Webseiten, für Stichwortsuche, für den Aufbau von Links und Suchmaschinenoptimierung,  den Aufbau von Marketing Partnerschaften und Member-Webseiten, sowie für Outsourcing, Video Aufnahmen und Vieles mehr.  </p>  <p style=\"\">  \t      EINE EINFÜHRUNG IN DIE MÖGLICHKEITEN, ONLINE GELD ZU VERDIENEN:  </p>  <p style=\"\">  \t      - Welches sind die gängigsten Methoden, online Geld zu verdienen?  </p>  <p style=\"\">  \t      - Welches ist der einfachste Weg passives Einkommen online zu generieren.  </p>  <p style=\"\">  \t      - Wenn ich wirklich online Geld verdienen will, wie fange ich an?  </p>  <p style=\"\">  \t      - Der Aufbau einer Webseite die in 1.000 EUR pro Monat an passivem Einkommen  resultiert.  </p>  <p style=\"\">  \t      Dieses Buch wird Sie in die Lage versetzen, eine professionelle Webseite auf Ihrer eigenen Domain in nur wenigen Stunden aufzubauen und wird Ihnen die notwendigen Kenntnisse vermitteln, um die Türe Ihrer Möglichkeiten zum Unternehmertum weit aufzustoßen.  </p>  <p style=\"\">  \t     Hier finden Sie meine eBuch LIONS CLUB Lektion über, \" Lernen wie man von Zuhause Geld verdient, mit einem Schritt für Schritt Plan, um 5000 EUR monatlichen Gewinn an passivem Einkommen mit einem Portfolio von zu erstellenden Webseiten zu erzielen: <span style=\"\">WIE MAN ONLINE GELD VERDIENEN KANN</span>  </p>  <p style=\"\">  \t<br style=\"\">  \t     Wie man eine Webseite erstellt, über ein Thema schreibt das Sie lieben und somit eine loyale Leserschaft entwickelt und dabei ein sechsstelliges Einkommen verdient: <span style=\"\">WIE SIE EINEN BLOG STARTEN</span>  </p>  <p style=\"\">  \t     Mike Omar  </p>", 
    "end_date": null, 
    "title": "Wie man eine Homepage oder einen Blog mit WordPress erstellt", 
    "price": 0, 
    "instructors": "Mike Omar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96930_0ef3_4.jpg", 
    "course_url": "https://www.udemy.com/wie-erstelle-ich-eine-homepage-oder-einen-blog-mit-wordpress/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-25T01:23:23Z"
}