{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Cada vez es más necesario disponer de un sitio web, tanto si estás buscando empleo como si quieres comenzar un negocio, como si tienes un negocio consolidado o simplemente para tu uso personal. </p><p style=\"\">En un mundo cada vez más globalizado, <strong style=\"\">estar comunicados y accesibles es una necesidad</strong>.<br style=\"\"></p><p style=\"\">Antes, crear páginas web era una tarea compleja sólo reservada para personas con un perfil técnico alto, pero hoy en día eso ha cambiado y todo el mundo puede desarrollar su propio sitio web. </p><p style=\"\"><strong style=\"\">Aprende todo lo que necesitas saber para </strong><strong style=\"\">construir un sitio web desde cero con este curso.</strong></p><ol style=\"\"><li style=\"\"><strong style=\"\">Identificar los objetivos</strong> que pretendes conseguir</li><li style=\"\"><strong style=\"\">Estructurar </strong>el sitio en base al punto anterior</li><li style=\"\"><strong style=\"\">Construirlo </strong>con la herramienta WiX</li><li style=\"\"><strong style=\"\">Mantener y promocionar</strong> el sitio</li></ol><p style=\"\"><strong style=\"\">Y todo esto lo puedes conseguir aunque no tengas conocimientos técnicos y con muy poco esfuerzo.</strong></p><p style=\"\">Siempre tienes la posibilidad de acudir a un <strong style=\"\">proveedor</strong> para que construya tu sitio, pero esto tiene sus <strong style=\"\">inconvenientes</strong>:</p><ul style=\"\"><li style=\"\">Necesitas hacer una <strong style=\"\">inversión</strong> y en función del importe tendrás una web más personalizada o un producto más estándar (muy similar a la de otros clientes de ese mismo proveedor)</li><li style=\"\"> El <strong style=\"\">resultado final</strong> probablemente no sea exactamente el que esperas, ya que es complicado transmitir todas tus necesidades a un tercero</li><li style=\"\">Una web siempre tiene que estar <strong style=\"\">actualizándose</strong>, si conoces el proceso tu mismo te puedes encargar del mantenimiento posterior, en caso contrario siempre dependerás de alguien y eso tiene un <strong style=\"\">coste adicional</strong></li></ul><p style=\"\">¿<strong style=\"\">Qué te ofrece WiX</strong> para poder construir tu sitio web?</p><ul style=\"\"><li style=\"\">Puedes construir un sitio web completo <strong style=\"\">gratis</strong></li><li style=\"\">Con <strong style=\"\">una cuenta</strong> gratuita puedes gestionar todos los sitios web que desees</li><li style=\"\">Cientos de <strong style=\"\">plantillas gratuitas realizadas por profesionales</strong> del diseño, que harán que el aspecto de tu sitio sea realmente atractivo</li><li style=\"\"><strong style=\"\">Editor visual</strong>, inserta elementos con no más de 3 clics de ratón y los sitúas en la posición de la página donde quieras que aparezcan, simplemente arrastrándolos con el ratón</li><li style=\"\"><strong style=\"\">Personalización total</strong> y absoluta del sitio, tanto la versión que verán los usuarios cuando accedan a tu web desde un <strong style=\"\">ordenador</strong> como lo que verán cuando lo hagan a través de un <strong style=\"\">dispositivo móvil</strong></li><li style=\"\"><strong style=\"\">Configuración del SEO</strong> para que sea más sencillo localizarte</li><li style=\"\">Gestión completa de un <strong style=\"\">blog</strong> y tus suscriptores</li><li style=\"\"><strong style=\"\">Generación y envío de correos</strong> a tus suscriptores para informarles de todas las ofertas y novedades que vayas incorporando a tu sitio</li></ul><p style=\"\">¿Qué <strong style=\"\">características </strong>presenta este curso?</p><ul style=\"\"><li style=\"\">Cubre toda la funcionalidad de la herramienta WiX descrita en el punto anterior</li><li style=\"\">Sabemos que el aprendizaje no presencial exige de un extra de motivación, por eso todas nuestras <strong style=\"\">clases</strong> comienzan con una <strong style=\"\">frase motivadora</strong> y están <strong style=\"\">cargadas de energía</strong></li><li style=\"\">Cumplen con los <strong style=\"\">estándares de calidad y buenas prácticas</strong> que se exigen a un curso no presencial, vídeo en formato de alta definción, tiempo medio de las clases en torno a los 10 minutos, auto evaluaciones de seguimiento para que sepas tu grado de asimilación de conceptos, entre otras.</li><li style=\"\"><strong style=\"\">Construimos desde cero</strong> un sitio web que podría ser un caso real, no enseñamos los conceptos de forma aislada sino que contamos como usarlos en un caso real. en el que cubrimos todas las fases de la construcción, desde la planificación, hasta el mantenimiento final</li></ul><p style=\"\">Si quieres aprender a construir un sitio web de forma <strong style=\"\">rápida y sencilla</strong> con una de las herramientas más usadas del mercado (WiX cuenta con más de <strong style=\"\">25 millones de cuentas activas</strong>), este es tu curso. <strong style=\"\">Adelante y te deseo que tengas un feliz y ameno aprendizaje.</strong></p>", 
    "end_date": null, 
    "title": "WiX: cómo crear páginas web increíbles paso a paso", 
    "price": "20.00", 
    "instructors": "Miguel López Moreno", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456846_1a43_4.jpg", 
    "course_url": "https://www.udemy.com/crea-paginas-web-profesionales-sin-apenas-esfuerzo-con-wix/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T16:37:39Z"
}