{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  Looking to earn extra income as a freelancer developing websites and web shops? Or maybe you plan to enjoy more free time and extra flexibility by creating websites that bring you passive-income?  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">WordPress from Scratch</strong></em> is THE most detailed, all-in-one course to learn how to easily build websites. It&#039;s a one-stop-shop for everything you need to go from zero to a knowledgeable person who can create professional websites - or your money back.  </p>  <p style=\"\">  \t                                    In today&#039;s modern age, where online presence is a must for people and businesses, knowing how to create and manage websites becomes a crucial skill. After taking this course you can immediately start building and managing money-making websites for yourself or for others.  </p>  <p style=\"\">  \t                                                                Just think about it: <strong style=\"\">Your Own Website</strong>!  Something on the Internet that you have a complete control over.  Something that you can easily create, change the look of and add  content. Your own place to share your thoughts, photos or sell something!  </p>  <p style=\"\">  \t                                                                WordPress is probably the best way to  publish something on the Internet. It is currently powering 1/4 of the  Internet and the number goes up every day. As it looks today,  WordPress is the future of web publishing, so it&#039;s a smart decision to  know how to use it. Who knows, maybe this course will help you land a  dream job at some point?  </p>  <p style=\"\">  \t<strong style=\"\">What&#039;s inside?</strong>  </p>  <p style=\"\">  \t                                You&#039;ll gain immediate access to the massive 6.5 hours of content, fully packed with useful information and recommendations. Using my university teaching experience, I structured the materials to avoid overwhelm and to easily explain even the most difficult concepts (hey, I was able to teach students Quantum Mechanics, so I can definitely teach you WordPress, no matter how newbie or non-tech you are!). I&#039;m convinced the information presented in this course will be easy to follow and absorb.  </p>    <p style=\"\">  \t<strong style=\"\">Features:</strong>  </p>  <ul style=\"\">  \t<li>Easy to follow, step by step instructions</li>  \t<li>Combines practical tutorials with the explanation why we do things that way</li>  \t<li>Valuable tips on how you can save money</li>  \t<li>Suitable for beginners with little or no prior knowledge of WordPress</li>  \t<li>6.5 hours of content</li>  \t<li>Personal contact with me</li>  \t<li>Quick answers to your questions</li>  \t<li>Review of your website at the end of the course</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Problems?</strong>  </p>  <p style=\"\">  \t                                                                            If you have problems following any of the lectures, let me know and I&#039;ll try to set up a live Q&amp;A session to guide you through.  </p>  <p style=\"\">  \t<strong style=\"\">What else should I add?</strong>  </p>  <p style=\"\">  \t                                                                              Would you like to see any specific topic covered? Simply let me know and I&#039;ll try to fit it into the course.  </p>  <p style=\"\">  \t<strong style=\"\">What next?</strong>  </p>  <p style=\"\">  \t                              Join <em style=\"\">WordPress from Scratch</em><strong style=\"\"></strong> and master this amazing website building platform today!  </p>", 
    "end_date": null, 
    "title": "WordPress for Beginners: Create Professional Websites", 
    "price": 0, 
    "instructors": "Piotr Wawrzyniak", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/154934_ba49_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-101/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-29T20:16:10Z"
}