{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn how to create amazing WordPress themes from HTML that are powered by the fantasting Architect plugin by PizazzWP</p><p><strong>What Will We Learn?</strong></p><p>In this course we will learn how to convert free static HTML sites into fully functional WordPress themes.</p><ul><li>Convert Static HTML files into a valid WordPress Theme</li><li>Introduction into the WordPress Loop</li><li>How to find help through the WordPress Codex</li><li>Introduction to web scripting languages such as PHP, HTML and CSS</li></ul><p><strong>How Do We Make It Simple?</strong><strong></strong></p>By using the Architect Plugin by PizazzWP, all the code for displaying our content is taken care of, so we can focus on what is important, making our site look GOOD!<p><strong>What About Learning To Code?</strong></p><p>Whilst this course will get you started on some basic PHP, HTML and CSS, we primarily focus on the design and showing you where to further grow your learning.</p><p><strong>Content and Overview</strong> </p><p>Suitable for beginning web developers, through this course you'll learn establish a strong understanding of the concept behind WordPress Theme development. </p><p>Starting with the installation of the Local Development Kit, this course will take you through PHP Functions, and how to use them. </p><p>Students completing the course will have the knowledge to create functional and useful WordPress Themes.</p><p>Complete with working files and code samples, you'll be able to work alongside the author as you work through each concept, and will receive a verifiable certificate of completion upon finishing the course.</p>", 
    "end_date": null, 
    "title": "WordPress Theme from scratch with Architect", 
    "price": "20.00", 
    "instructors": "Jon Mather", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545236_04cc_4.jpg", 
    "course_url": "https://www.udemy.com/wordpress-theme-from-scratch-with-architect/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T06:43:37Z"
}