{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Wordpress For Noobs is a complete step-by-step course which will teach you how to build a Wordpress blog from scratch.</p><p style=\"\">The course consists of simple to understand video tutorials laid out in sections and modules. The approximate viewing time for all the videos together is about 75 Minutes.</p><p style=\"\">The course consists of 4 sections - <br style=\"\"></p><ul style=\"\"><li style=\"\">Installation</li><li style=\"\">Settings</li><li style=\"\">Customizations</li><li style=\"\">Blogging</li></ul><p style=\"\">Each of these sections are further divided into modules covering a specific aspect of the section.</p><p style=\"\">Wordpress Installation and management is one of the trickiest aspect of WordPress blogging. There are quite a lot of aspects that bloggers often miss which takes the sheen out of their blog. Add to it the fact that the lack of customization makes every blog look similar and you become one of the millions of online bloggers.</p><p style=\"\">In order to stand out from the crowd it becomes essential to understand the nitty-gritties of Wordpress. This will also save you - <br style=\"\"></p><ul style=\"\"><li style=\"\">Time - because you will not have to spend hours trying to figure out things</li><li style=\"\">Money - you can avoid the services of a blog management company.</li><li style=\"\">Frustration - by securing your installation, content and privacy.<br style=\"\"></li></ul>", 
    "end_date": null, 
    "title": "Wordpress For Noobs: Build A Blog", 
    "price": "25.00", 
    "instructors": "R Dilip Kumar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46160_0314_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-for-noobs/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-17T10:15:44Z"
}