{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>##Last Updated on April 1st,2016 ##</strong></p>\n\n<p><strong>****1200 students enrolled, 5 Star Ratings ****</strong></p>\n\n<p><strong>Learn how to make a wordpress website 2015 - Step by Step</strong><strong>.</strong><br>This course teaches you how to make a wordpress website in 2015 and lets you customize it so you can build it any way you want. You don't need to know any type of programming.This course is going to walk you through how to make a website using wordpress in 2015. <strong>For those of you that have no experience on how to make a website have no fear</strong>...All you’ll need to do is watch course and you'll build something amazing and save thousands of dollars. This is some of the best work I've done so far in creating a website that I think is very versatile for a variety of websites.<br><br>If you need help on how to make a wordpress website, tutorial walks you through building a website in 39 simple steps.<br><br>I've taken a lot of the design features of professional and successful businesses to create this course. Just watch the tour of the wordpress website we are going to build and you'll see for yourself!<br>If you have any questions about your website or what you're creating/building, and anything related to wordpress - feel free to leave a comment. Enjoy this <strong>Create Professional Website Using Wordpress for Free</strong> Let's get your website up and running!</p>", 
    "end_date": null, 
    "title": "Wordress for Beginners: Create professional website", 
    "price": "20.00", 
    "instructors": "Deepika Khanna", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688610_49a3_3.jpg", 
    "course_url": "https://www.udemy.com/create-professional-website-using-wordpress-for-free/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T03:47:32Z"
}