{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t    Discover how to put the <strong style=\"\">FREE s2Member plugin</strong> to work for you with my video course on creating a WordPress Membership Site Using s2Member &amp; other no-cost plugins.  </p>  <p style=\"\">  \t<strong style=\"\">Enjoy the benefits of knowing you have a secure, powerful &amp; scalable WP Membership site after you have completed this course. </strong>  </p>  <ul style=\"\">  \t<li style=\"\">You will discover frustration-free code setup for the S2Member plugin. I  show you step-by-step PLUS give you copy &amp; paste code snippets.<br style=\"\">  \t   Watch me -&gt; Copy -&gt; Paste -&gt; Done!</li>  \t<li style=\"\">You&#039;ll learn how to create custom fixed-term PayPal buttons.</li>  \t<li style=\"\">How to prepare your WordPress site for the S2Member plugin.</li>  \t<li style=\"\">How to connect your s2Member site with Amazon S3 &amp; CloudFront for added speed &amp; security.</li>  \t<li style=\"\">and much more.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">You want to create a WordPress membership site...</strong>  </p>  <p style=\"\">  \t<em style=\"\">But you are not sure how to properly set things up.</em>  </p>  <p style=\"\">  \t<strong style=\"\">You want a powerful and secure membership script that works with WordPress...</strong>  </p>  <p style=\"\">  \t<em style=\"\">But you are not made of money so it cannot cost a fortune.</em>  </p>  <p style=\"\">  \t<strong style=\"\">s2Member is a WordPress plugin – It is FREE – It&#039;s Powerful &amp; Secure...</strong>  </p>  <p style=\"\">  \t<em style=\"\">But is is so feature rich that all those bells &amp; whistles are too difficult to setup.</em>  </p>  <p style=\"\">  \t       This course on making<strong style=\"\"> <u style=\"\">WordPress Membership sites</u> </strong>using the FREE<strong style=\"\"> <u style=\"\">s2Member</u> </strong>Framework plugin and other FREE WordPress plugins is your answer.  </p>  <p style=\"\">  \t       → No more reading the sleep-inducing blog posts that claim to have all the answers.  </p>  <p style=\"\">  \t       → No more wading through ancient YouTube videos trying to figure things out.  </p>  <p style=\"\">  \t       These s2Member Training videos are <strong style=\"\">brand new (2015)</strong> and you can get a feel for the audio and video quality by <strong style=\"\">checking out the Free Preview on Lecture 1</strong>.  </p>  <p style=\"\">  \t       I’ve been using s2Member in a few of my WordPress sites since late 2011 but only the basics of s2Member.  </p>  <p style=\"\">  \t       I just never found the time to dive in and learn how to get more out of s2Member than just the basic settings.  </p>  <p style=\"\">  \t       One of my long-time Customers kept asking me about doing a set of training videos on creating a WordPress Membership site &amp; several months ago I finally had the time.  </p>  <p style=\"\">  \t       So over the last 4 to 5 months I’ve been learning how to squeeze more out of an s2Member site than just putting up secured post and pages &amp; PayPal buttons.  </p>  <p style=\"\">  \t       I knew s2Member had a lot to offer but my goodness, I was like a kid in a candy store with everything I was learning about s2Member.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">AND IT’S FREE!!</strong></em>  </p>  <p style=\"\">  \t       Not only is it FREE but you also get the source code to the plugin, meaning if you are a programmer or you know one, you can customize the code to make it do whatever your imagination can come up with.  </p>  <p style=\"\">  \t       You might be surprised to learn some people have done just that and charge upwards of $300 for what they created from the s2Member Framework source code.  </p>  <p style=\"\">  \t       Now I’m NOT A PROGRAMER so these s2Member training videos are <strong style=\"\">GEEK-SPEAK-FREE</strong> Video Guides.  </p>  <p style=\"\">  \t       These videos are <strong style=\"\">over the shoulder style</strong> videos that allow you to see me doing the actions – not just talk about them. That along with the <strong style=\"\">included exclusive copy &amp; paste templates and code snippets</strong> your task of building an S2Member powered WordPress site just got a lot easier.  </p>  <p style=\"\">  \t       One of my pet-peeves with some of the other training videos, is they assume you already know this or that about the topic and a gaping hole is left in your training if you ARE NOT &#039;in the know&#039;.  </p>  <p style=\"\">  \t       When I make my training videos I assume you are brand new to the topic so I focus on leaving no technical stone unturned.  </p>  <p style=\"\">  \t       If you are brand new to <strong style=\"\">WordPress &amp; s2Member</strong> then you will be able to follow along easily and just do as I do.  </p>  <p style=\"\">  \t       If you are <em style=\"\">NOT NEW</em> to WordPress and / or S2Member but simply want to learn more, then some of this will already be familiar &amp; you will move along even quicker to creating your own <strong style=\"\">Powerful &amp; Secure S2Member Membership site</strong>.  </p>  <p style=\"\">  \t       The first lecture is an introduction video to the series. It lays out a brief description of each video.  </p>  <p style=\"\">  \t       If you have not yet installed and setup your WordPress site then I suggest you start at the bottom of the Lectures where my <strong style=\"\">Bonus Lectures</strong> are.  </p>  <p style=\"\">  \t       I have included some basic WordPress install &amp; setup videos in the Bonus section at the bottom of the page.  </p>  <p style=\"\">  \t       Start there then come on back to lecture 2 and move on from there.  </p>  <p style=\"\">  \t       You may be tempted to jump around the different lectures but they are put together in progression so I suggest you stick to the numbers &amp; go in order.  </p>  <p style=\"\">  \t       But hey, you have lifetime access so you can always come back and re-watch them however many times you need.  </p>  <p style=\"\">  \t      There is no time like the present to create your own powerful &amp; secure S2Member powered WordPress site and this course will get you there – <em style=\"\"><strong style=\"\">GUARANTEED!</strong></em>  </p>", 
    "end_date": null, 
    "title": "WordPress Membership Sites Using s2Member", 
    "price": "20.00", 
    "instructors": "Steve Dougherty", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420290_42aa_4.jpg", 
    "course_url": "https://www.udemy.com/creating-wordpress-membership-sites-with-s2member/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T15:41:50Z"
}