{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><p>In this training course you will learn how to use WordPress for E-Commerce. A+ rated training company InfiniteSkills teaches you how to extend the WordPress blogging platform to build an E-Commerce website by adding plugins and customizing your WordPress installation. This course is designed for the student that already understands the fundamentals of WordPress.</p><p>E-Commerce has always been the domain of the geek, requiring complex programming and an in-depth understanding of website development techniques. As WordPress has become recognized as a platform capable of more than simple blogging, it has seen an influx of plugins and strategies to utilize WP as a complete front to back E-Commerce website solution. George takes you through the installation and configuration of some of the most popular plugins to add E-Commerce to your WordPress Website. He covers topics ranging from how to take payments, calculate taxes and shipping, deliver digital as well as physical products, and so much more.</p><p>By the time you have completed this video tutorial, you will have an in-depth understanding of several WordPress plugins for E-Commerce, and will be able to make an informed decision on which will work best for you. You will understand how to install and configure your choice of plugin, and be able to begin selling your products to the world. Working files are included, allowing you to follow along with the author throughout this video based training course.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "WordPress For E-Commerce Tutorial - A Definitive Guide", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/31580_5653_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-wordpress-for-e-commerce/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-07T14:03:14Z"
}