{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t    I am not a professional web designer. I don&#039;t know a lick of coding . . . no css, html, java script, python, cobra, php, pcp, or naacp. I don&#039;t know any of it!  </p>  <p style=\"\">  \tWhat I am is an entrepreneur, a coach, a consultant, and a communicator. When I launched my career eleven years ago I knew that having a viable web presence was going to be an essential component of my success. But I didn&#039;t have the funds to hire a professional to build me one. So I learned how to build them myself!  </p>  <p style=\"\">  \tI&#039;ve concluded, after having spent thousands of hours and thousands of dollars working with hundreds of templates across multiple platforms, that anyone can build a beautiful website using wordpress.  </p>  <p style=\"\">  \t    I&#039;ve taken everything that I&#039;ve learned in those thousands of hours and with those thousands of dollars and boiled it down to a process that you can learn in less two hours; that&#039;s what you&#039;re getting if you sign up for this course.  </p>  <p style=\"\">  \t    What I&#039;ve learned (and what I share in this course) can be boiled down to four questions:  </p>  <p style=\"\">  \t    1. What hosting solution shall I use and how shall I set it up?  </p>  <p style=\"\">  \t    2. What template shall I use and how shall I build it out?  </p>  <p style=\"\">  \t    3. What graphics shall I use and how shall I create them?  </p>  <p style=\"\">  \t    4. What plugins/widgets shall I use, and how shall I install them?  </p>  <p style=\"\">  \t    You don&#039;t need to have any prior experience or knowledge in web or graphics design. All you have to do is follow my lead and I&#039;ll give you the ghetto guide to web design!  </p>  <p style=\"\">  \t    Launch your blog. Start your business. Present your portfolio. Promote your industry. Claiming your piece of the world wide web has never been easier than it is right now!  </p>", 
    "end_date": null, 
    "title": "Wordpress Websites 101: Design, Build & Monetize", 
    "price": "20.00", 
    "instructors": "Benjamin Robinson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317068_e301_11.jpg", 
    "course_url": "https://www.udemy.com/the-ghetto-guide-to-web-design/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-10T07:29:07Z"
}