{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>En este curso aprenderás todo lo que necesitas para crear tu primer sitio web con la plataforma más popular en el mundo.</strong></p><p>Este curso es en realidad dos cursos en uno. <strong>Wordpress Nivel Básico</strong> y <strong>Wordpress Nivel Intermedio</strong>.</p><p>La plataforma <strong>Wordpress</strong> es usada en más de un <strong>30% de todos los sitios web en Internet</strong> y ha probado ser robusta, segura y fácil de usar. <br></p><p>A través de estas lecciones aprenderás lo básico de Wordpress para que puedas darle vida a ese sitio web o blog que siempre has tenido en mente.</p><p>En el <strong>Nivel Básico</strong> veremos, entre otras cosas:<br></p><ul><li>Cómo crear <strong>tu primer sitio web o blog gratis</strong> y tenerlo online en menos de 5 minutos.</li><li>Publicación de artículos y entradas tipo blog, con formato, imágenes, etiquetas y categorías.</li><li>Cómo escoger <strong>diseños profesionales</strong> para nuestro sitio web, tanto gratis como a muy bajo costo.</li><li>Gestión de contenido multimedia en nuestro sitio utilizando la <strong>Librería Multimedia</strong>.</li><li>Personalización del sitio sin límites con \"widgets\", <strong>desde cero</strong>.</li><li>Gestión de usuarios: editores, colaboradores, autores y otros.</li></ul><p>Algunos de los temas que veremos en el <strong>Nivel Intermedio</strong> son:</p><ul><li>Registro de dominio .com y selección de hosting para Wordpress.</li><li>Temas o plantillas. Veremos diversos ejemplos de cómo cambiar el aspecto de tu sitio y cómo cambiar aspectos gráficos según las opciones de cada tema.</li><li>Plugins desde cero. Dónde obtenerlos, cómo activarlos y desactivarlos.</li><li>Comentarios que requieren login con cuentas de redes sociales para evitar el spam y mejorar la calidad de las discusiones.</li><li>Facilitar el seguimiento en redes sociales. Barra social. Tweet stream in nuestro sitio.</li><li>Formulario de feedback.</li><li>Cómo respaldar nuestra base de datos y exportar los archivos a Dropbox.</li></ul><p>Los cursos de ZENVA <strong></strong> se caracterizan por la metodología de <strong>aprender haciendo</strong> y de guiar <strong>paso a paso</strong> a los estudiantes en los distintos objetivos, de manera que personas sin experiencia previa <strong>logren superar sus propias metas en cosa de minutos</strong>.</p>", 
    "end_date": null, 
    "title": "Wordpress Desde Cero - Nivel Básico e Intermedio", 
    "price": "20.00", 
    "instructors": "Pablo Farias Navarro", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42211_95e2_9.jpg", 
    "course_url": "https://www.udemy.com/curso-basico-de-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-18T12:57:05Z"
}