{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Hey everyone! In this course we'll be using the premium divi theme, which I will be including in the course for free! We will learn how to make a premium WordPress business website that you can feel proud of. I'll also do my best to keep things up to date with divi updates. <br><br>This WordPress Web design course is set in a structured format that builds from one lecture to the next. We begin by going over how to register a domain name and sign up for hosting with my optional affiliate hosting coupon. After that we proceed to installing WordPress and than building out our WordPress website. </p>\n\n<p>The course builds from one lecture to the next where we cover so many different elements that the powerful divi theme comes with. For our first website we build a 6 page website jammed packed with everything that you could ever want in a website. By doing this we get to review lots of different page types, styles, features, and formats throughout the course.<br></p>\n\n\n\n\n\n\n\n<p>I recommend that people looking for a valuable high quality premium theme that is the perfect WordPress web design for a variety of websites take this course. I'm confident that you will complete the course with a high quality project as the end result. It would help if you have wordpress web design experience, and if you are familiar with WordPress. I have another free course on udemy that could help you with getting up to speed if needed.</p>\n\n\n\n\n\n\n\n<p>If you have any questions about the course please feel free to reach out to me prior to enrolling and I'll do my best to get back to you quickly. Also, I highly recommend that you check out the website preview prior to enrolling to see what we'll be building in the course. I'm very active on udemy and want you to have a wonderful experience designing a premium WordPress website!</p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "WordPress Web Design - Premium Theme Included", 
    "price": "25.00", 
    "instructors": "Tom Johnson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833006_325a_4.jpg", 
    "course_url": "https://www.udemy.com/wordpress-web-design-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T00:19:08Z"
}