{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong><em>Course Updated on September 7th, 2015</em></strong>  </p>  <p style=\"\"><em>Final course files, including the final WordPress theme, plus some additional resources available all in one easy download :)</em></p>  <p style=\"\">  \t<em>- - -</em>  </p>  <p style=\"\">  \t<strong>Do you want to supercharge your HTML, CSS &amp; PHP knowledge and learn how to turn them into a real business that can make you more money as a freelancer?</strong>  </p>  <p style=\"\">  \t      Whether you're a freelance designer, entrepreneur, employee for a company, code hobbyist, or looking for a new career — this course gives you an immensely valuable skill that will enable you to either:  </p>  <p style=\"\">  \t<strong>Make money on the side</strong>  </p>  <p style=\"\">  \t      So you can save up for that Hawaiian vacation you've been wanting, help pay off your debt, your car, your mortgage, or simply just to have bonus cash laying around.  </p>  <p style=\"\">  \t<strong>Create a full-time income</strong>  </p>  <p style=\"\">  \t      WordPress developers have options. Many developers make a generous living off of creating custom WordPress themes and selling them on websites like ThemeForest. Freelance designers and developers can also take on WordPress projects and make an extra $1,000 - $5,000+ per month.  </p>  <p style=\"\">  \t<strong><em>Who Should Take This Course?</em></strong>  </p>  <p style=\"\">  \t<strong>Graphic &amp; Web Designers</strong>  </p>  <p style=\"\">  \t      Graphic designers are extremely talented, but ask them to code their designs and they'll freeze up! This leaves them with no other choice but to hire a web developer. Any professional graphic designers knows web developers can be expensive.  </p>  <p style=\"\">  \t      If you're a designer, learning to code your own WordPress websites can change your business entirely! Now, not only are you a great designer, but you're a skillful developer, too! This puts you in a position tomake an extra $1,000 – $5,000 per project.  </p>  <p style=\"\">  \t<strong>Entrepreneurs</strong>  </p>  <p style=\"\">  \t      Entrepreneurs have big dreams, and in many cases, shoestring budgets. In order to survive in the cut-throat world of the Startup company, it's a necessity to have a world-class website. However, world-class websites come with a large price tag.  </p>  <p style=\"\">  \t      If you can learn how to build a high-quality startup website by yourself, then you've just saved yourself a lot of cash, tens of thousands of dollars in many cases.  </p>  <p style=\"\">  \t<strong>Employees of a company</strong>  </p>  <p style=\"\">  \t      Any company knows the education &amp; training of their employees is key to a thriving team.  </p>  <p style=\"\">  \t      Depending on the type of company you work for, if you understand how to code, and can develop CMS driven websites, that gives you negotiating power for a better position, or a higher salary.  </p>  <p style=\"\">  \t<strong>Code Hobbyists</strong>  </p>  <p style=\"\">  \t      It's fun to learn challenging new skills. Code hobbyists can add dynamic websites to their arsenal of tools to play with — you can even sell WordPress themes and plugins for cash! The possibilities are truly endless.  </p>  <p style=\"\">  \t<strong>People Looking for a New Career</strong>  </p>  <p style=\"\">  \t      Are you out of work? Looking for a more rewarding job? Desire a career that can allow you to work almost anywhere in the world? Becoming a Web Developer might be the answer for you.  </p>  <p style=\"\">  \t<strong>Web developers are paid well, anywhere from $33,000 to more than $105,000 per year. </strong>They get to work at amazing companies that are changing the world, or they enjoy the ability to start their own companies, become location-independent and work from home, from coffee shops, in an airplane, on the beach, or wherever they want!  </p>  <p style=\"\">  \t<strong>Final Project Features</strong>  </p>  <p style=\"\">  \t      Throughout this entire course, you work towards building an incredibly beautiful, 100% custom website using the Bootstrap framework. The coolest part? The Bootstrap website doesn't look <em>anything</em> like the Bootstrap websites you see all over the Internet. It's a highly customized design, and the type of website layout I use when I build custom WordPress websites for my real-life clients.  </p>  <p style=\"\">  \t<em>The final project features:</em>  </p>  <p style=\"\">  \t<strong>Sexy &amp; Modern Design</strong>  </p>  <p style=\"\">  \t      You get to work with a modern, professional quality design &amp; layout.  </p>  <p style=\"\">  \t<strong>Quality HTML5 &amp; CSS3</strong>  </p>  <p style=\"\">  \t      You'll learn how hand-craft a stunning website with valid, semantic and beautiful HTML5 &amp; CSS3.  </p>  <p style=\"\">  \t<strong>Easy-to-use CMS</strong>  </p>  <p style=\"\">  \t      Allow your clients to easily update their websites by converting your static websites to dynamic websites, using WordPress.  </p>  <p style=\"\">  \t<strong>You can dramatically increase your efficiency, and supercharge your web development skills. </strong>And by doing so, you'll effectively be able to take on more projects, charge higher rates, and make more money as a freelancer.  </p>  <p style=\"\">  \t<strong>Why take this course?</strong>  </p>  <p style=\"\">  \t      I don't mess around. I do this for a living, and I'm sharing you my exact process for making a comfortable living as a work-from-home web developer. There is absolutely no filler in this course, no fluff, just 100% quality content, nothing less. If you take this course, follow my lead, and take action — I guarantee you will not only love the course, but you'll see real results; you will have the skills &amp; confidence to take on WordPress projects for clients, charge more money, and make the value of the course back in a single project. If you hate the course (which you won't) you have 30-days to get a 100% refund — no risk, no problem.  </p>  <p style=\"\">  \t<strong>Stop wasting time, and come learn with me! Enroll today!</strong>  </p>", 
    "end_date": null, 
    "title": "WordPress Theme Development with Bootstrap", 
    "price": "30.00", 
    "instructors": "Brad Hussey, Code College", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/271228_ce5b_8.jpg", 
    "course_url": "https://www.udemy.com/bootstrap-to-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-29T20:44:04Z"
}