{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>NEW CONTENT PUBLISHED 11/2/2015</p><p><strong><br></strong></p><p><strong>WordPress For Beginners: A Complete \"Step by Step\" Educational Experience!</strong></p><p>This course was designed specifically to help YOU create your very first WordPress Blog.  In this course, I'll create a new blog from scratch, and walk you thru, step by step, everything I do and everything you need to do, to build an amazing blog!</p><p>This course is broken up into 9 different sections.<br></p><p><strong>Section 1: Course Overview</strong></p><p>In this section, which is just one short lecture, I'll introduce myself, tell you what you can expect to learn from the course, and help you decide if the course is right for you.</p><p><strong>Section 2: Getting Started</strong></p><p>In the getting started section, I'll help you select a domain for your site, explain the difference between shared and managed hosting, help you select a host, and walk you thru the GoDaddy signup (please see NOTE at the bottom of this course summary) and WordPress Installation.</p><p><strong>Section 3: WordPress Setup and Configuration</strong></p><p>In this section, I'll teach you about the WordPress dashboard, theme installation and customization, using widgets,  adding menus, working with plugins, adding users, and additional tools.  Then we'll cover General settings, Writing settings, Reading settings, Discussion settings, Media settings, Permalink settings, and even how to limit login attempts. (which we'll also cover in the security section of the course)</p><p><strong>Section 4: Creating Content</strong></p><p>In section 4, I'll explain the All Posts Page, show you how to create and use categories and sub categories, teach you about tags, show you how to create content (your first post) and how to enhance that content.  I'll also show you how to use short codes, work with images, audio, and video, as well as additional post options, publishing options, how to use an editorial calendar, and how to customize your pages.</p><p><strong>Section 5: Comments</strong></p><p>Every blog needs a commenting system, but which one?  WordPress Comments? Disqus Comments? Facebook Comments?  In this section, I'll show you how to setup and configure each of these systems so you can decide which is right for your blog.</p><p><strong>Section 6: Social Media</strong></p><p>In section 6, first I'll show you how to create a Facebook page, a google plus page.  Then I'll show you how to integrate your blog with social media, making it easier for readers to like your content and follow you on social media.  Then I'll teach you about URL shortening, show you how to setup a Bitly account and use it within your WordPress blog.  I'll also show you how to track your link clicks.  Next I'll show you how to create polls and ratings, how to enable your readers to tweet quotes from you, and how to add Facebook and twitter feeds to your blog.  Finally, I'll show you how to setup and implement a custom twitter landing page.</p><p><strong>Section 7: Email and List Building</strong></p><p>In this section, I'll show you how to setup a MailChimp account, setup your first mailing list, and create side-bar and popup opt-in forms using only MailChimp.  Then I'll you more advanced techniques for opt-in forms and boxes with MailMunch, and Ninja Popups.  I'll also show you how to create a custom thank you page that you display after your readers opt-in.  Finally I'll show you how to setup an RSS (Rich Site Summary) Feed Syndication using MailChimp, as well as Feedly integration within your blog.</p><p><strong>Section 8: SEO (Search Engine Optimization)</strong></p><p>In the SEO section of the course, I'll show you how to setup and configure Google Webmaster Tools, how to setup and use the Yoast SEO plugin, how to submit site maps to Google (to help them realize you exist, and know when you publish new content.  Then I'll explain pinging and show you how to publish your site on the most popular ping websites.  Then I'll show you how to improve your SEO with image compression and show you how to use FTP.  Finally, I'll show you the GrowthHow Website Analyzer, a tool I developed to review your website and give you dozens of SEO recommendations.</p><p><strong>Section 9: Security</strong></p><p>In this section, I'll show you industry standard security techniques such as best practices for your admin account naming and password creation.  I'll show you how to modify your database prefix, and explain why you should.  I'll also show you how to limit login attempts, use the .htaccess file to lock down files, the Akismat plugin for spam prevention, Graphic Password for enhanced hacking protection, and we'll take a deep dive in WordFence, the most advanced security tool available for WordPress.</p><p><strong>Section 10: Archived Lectures</strong></p><p>In section 10, I'll keep lectures that have been removed from the main area of the course because they have been replaced with more accurate, relevant, or improved lectures.</p><p><strong>Section 11: Bonus Section</strong></p><p>In the Bonus Section, I'll cover advanced topics, or topics that were not covered as a part of the main course, but that may still be relevant to you.  Currently, the bonus section has lectures on setting up Office 365 Email, and an advanced security technique called 2 factor authentication.</p><p><br></p><p><strong><em>NOTE</em>:  </strong><em>GoDaddy Managed Hosting is the host I have chosen for my blog.  I chose GoDaddy because of performance and price but also because I'm expecting most of my students are setting up WordPress for the first time, and are probably first time bloggers on a budget.  I believe that GoDaddy hosting is a good choice for most beginner as well as seasoned bloggers, however your choice of host is exactly that, your choice.  I have no affiliation with GoDaddy.  In this course, I do show you multiple hosting choices from various companies.  Most popular registrar/hosting companies offer similar features when it comes to hosting WordPress.  In this course, some of what I will teach is based on the GoDaddy hosting environment.  However, most of the course can be followed regardless of the host you choose.  I'm committed to your success with building your blog.  If you find that you are not able to follow along with any part of this course because things don't look the same between different hosting companies, I'll gladly coach you as best I can to ensure your success.</em><br></p>", 
    "end_date": null, 
    "title": "WordPress: Step by Step for Beginners", 
    "price": "20.00", 
    "instructors": "Chris Phelps", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489008_e94e_3.jpg", 
    "course_url": "https://www.udemy.com/wordpress-from-zero-to-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-28T23:02:01Z"
}