{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong></strong></p>\n\n<p>\n                                        <strong><em>\"This course inspires me to do! </em></strong><em>This course, \ntogether with Kristen's Divi course, gives me the courage to really attack my \nwebsite building. It is detailed, but just enough, no overwhelm. It is \nproven: see how it works for Kristen. And I understand the why and how \nof things. Thank you very much, Kristen. Excellent course!\" -Anneke Camstra</em></p><p><em></em><br><em></em></p>\n\n<p><strong></strong><strong>Is your website performing at its highest level and gaining you clicks, sales, engagement, followers, and working hard on your behalf 24 hours a day?</strong><strong></strong></p>\n\n<p>This\n course is for anyone who is looking to get more out of their existing \nwebsite, who would like an easy step by step plan of action for maximizing their\n website's impact, regardless of which tools, platforms, or themes they are \nusing. In particular this course is for people who are NOT coders, professional web developers, or programmers who would like to learn easy, reliable, and measurable ways to boost their website's impact.</p>\n\n<p>In this course I use my own website's optimization as a case \nstudy and show the exact process I used during my \nwebsite's tune-up to help YOU jump-start your progress. I specifically use WordPress <em></em>and the<em> Elegant Theme, Divi </em>and the<em> Elegant Theme </em>plugin,<em> Bloom</em> (for opt-in forms)<em></em>, but you don't need to have my exact set-up to benefit from this course.</p>\n\n<p><strong>Let me help you tune-up and adjust your website so it can do the online heavy lifting for you 24 hours a day by showing you how to:</strong></p>\n\n<ul><li>Diagnose and improve your website in the areas of performance, mobile, SEO, and security.</li><li>Increase engagement, clicks, and sales from your website using tried and tested methods for increasing impact.</li><li>Take advantage of web users' eye-tracking patterns backed by research to ensure your content is more effectively seen.</li><li>Collect more newsletter subscribers  more quickly using one or multiple mailing lists and an array of custom opt-in forms.</li><li>Generate more social media shares (and more traffic) for your blog posts and other content.</li><li>Get more followers for your linked social media pages.</li><li>Take advantage of easy ways to make extra passive income using affiliate linking programs from your website.</li></ul>\n\n<p>I'm a tenured Associate Professor of Digital Media and the Program Director of Film &amp; Digital Media at <em>The American University of Rome</em> and a practicing award-winning multimedia artist.</p>\n\n<p>I\n have over 15 years of experience teaching students all over the world \nusing my tried and true custom approach (turning complex information \ninto something simple, memorable, easy-to-understand in as short amount \nof time as possible) to ensure that <strong>you\n get the most important, relevant, and useful information that can be \napplied immediately.</strong></p>\n\n<p>New\n bonus lectures and resources will continue to be added and timely advice will be provided in the discussion forum. I love to help \nand always respond to inquiries and discussions ASAP.</p>\n\n<p><strong>Please\n Note: All students who enroll in this course also will receive periodic\n free and discounted access to my other top-rated current and upcoming \ncourses.</strong></p>\n\n<p>You have a 30-day, 100% money-back guarantee \nwith no questions asked so you have nothing to lose. I make myself \navailable so you will have access to me if you have questions or need \nspecific feedback along the way.</p>\n\n<p>Empower yourself now by enrolling in this easy to follow WordPress Challenge course and join our growing learning community! Click the \"Take This \nCourse\" button in the upper right corner and <strong>l</strong><strong>et's get started optimizing your website and boosting its impact right away!</strong><br></p>", 
    "end_date": null, 
    "title": "WordPress Optimization Challenge: Easy Ways to Boost Reach", 
    "price": "20.00", 
    "instructors": "Kristen Palana", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728970_4c0e_3.jpg", 
    "course_url": "https://www.udemy.com/wordpress-website-challenge-easy-ways-to-boost-impact/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T11:13:37Z"
}