{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">NEW! NEW! NEW!</strong></p><p style=\"\"><strong style=\"\">Course Objective:</strong> Install a WordPress Development Server on your computer, create and test WordPress websites on your computer, and then import them &quot;live&quot; to your web host server.</p><p style=\"\">This skill is in high demand. Think of it: Build your WordPress websites right on your computer! Test and tweak them to your satisfaction and then import them to your web host server!</p><p style=\"\">No Coding</p><p style=\"\"><strong style=\"\">*** ALL LECTURES ARE IN HIGH DEFINITION (HD) ***</strong></p><p style=\"\">In my more than 35 years of formal teaching experience, I have found that the best approach to teaching was for the teacher to place himself at the desk of and in the role of the student. And, to teach in a manner imaging that he himself is the student.</p><p style=\"\">Some instructors teach over the head of the student. Not all students are the same. Yet, it is the responsibility of the teacher to find a way to reach students who &quot;just don&#039;t get it.&quot; Indeed, the teacher should sweat over finding a solution to reach that student. If necessary, lose sleep over it. Then when the light bulb in that students head &quot;turns on&quot; then there is the reward!</p><p style=\"\">In this course, I will teach with the Look-Over-My-Shoulder lecture method and DEMONSTRATE to you how to build a WordPress website powered by the popular Genesis Framework. This course sets the foundation for learning more about WordPress in conjunction with the Genesis Framework.</p><p style=\"\"><strong style=\"\">Here Is What You Will Learn</strong><strong style=\"\"></strong></p><ul style=\"\"><li style=\"\">How To Install a &quot;FREE&quot; WordPress Development Server on Your Computer</li><li style=\"\">How To Use Your WordPress Development Server to Create WordPress Websites</li><li style=\"\">Import Your WordPress Website &quot;Live&quot; to Your Web Host Server<br style=\"\"></li></ul><p style=\"\"><strong style=\"\">Let Me Help You</strong></p><p style=\"\">So if you want to know how to develop WordPress website on from your computer desktop and them import the finished product to your web host server, then this course is for you!</p><p style=\"\">I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk!</p><p style=\"\">After taking my course, you will know how to install a WordPress Development Server on your computer, use it to create and test your WordPress websites and when finished, import them &quot;live&quot; to your web host server.</p><p style=\"\">Click the &quot;Take This Course&quot; button now.</p><p style=\"\">Kind regards,</p><p style=\"\">R. Jerome Harris</p>", 
    "end_date": null, 
    "title": "WordPress Desktop Development", 
    "price": "20.00", 
    "instructors": "R. Jerome Harris", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596542_5720_5.jpg", 
    "course_url": "https://www.udemy.com/desktop-wordpress-development/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T07:35:34Z"
}