{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong class=\"redactor-inline-converted\">Wordpress for Beginners - A complete guide to Wordpress!</strong></p>\n\n<p>  \t<strong>Up-to-Date - </strong>Covers the latest version of Wordpress (4.x).</p>\n\n<p><strong class=\"redactor-inline-converted\">About the Course</strong> <br></p><p>This course will guide you through the installation and running of Wordpress on a web host, and show you how to run a successful, beautiful, responsive-design website you can be proud of.  You will be taken from your current level of Wordpress knowledge, to one where you enjoy and are confident in using Wordpress to build great sites.  </p><p>After taking you through all of the main options in Wordpress and explaining what each one does and how you set it up, I'll let you <strong class=\"redactor-inline-converted\">w</strong><strong class=\"redactor-inline-converted\">atch over my shoulder</strong> as I build a Wordpress website.  It will be an affiliate site that I hope will make me passive income for many years to come.  Go and check out the free preview tutorials in Section 13.  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">Who is this Wordpress course for?</strong>  </p>\n\n<p>  \t                              Have you ever wanted to build a professional looking website, but didn't know where to start?  Now you can with Wordpress 4.  </p>\n\n<p>  \t                              Wordpress for Beginners is a complete course for anyone, no matter what your technical ability.  This course assumes no prior knowledge!  </p>\n\n<p>  \t                              We'll start at the beginning, by choosing a domain name and setting it up to work with a web host.  </p>\n\n<p>  \t      Once Wordpress is installed, we'll login and have a look around to familiarize ourselves with the main areas of the Dashboard.  </p>\n\n<p>  \t      Once you are happy navigating around your new tools, we'll go through the main features you will need as you create your site, including:  </p>\n\n<ol>  \t<li>The WYSIWYG Editor.  This is where you enter all of your website content.</li>  \t<li>The Media Library, to manage your images, videos, sound files and other media you want to share on your site.</li>  \t<li>Wordpress Settings, and I'll take you step by step to set those up just right.</li>  \t<li>We'll look at the differences between Wordpress posts and Wordpress pages, and I'll give you a simple way of knowing which one to use on any occasion.</li>  \t<li>We'll look at post excerpts, categories and tags, and how to use them on a well-structured site to maximize visitor experience and search engine ranking benefits.</li>  \t<li>You'll see the two main ways you can set your homepage up.</li>  \t<li>We'll create a contact form on the site so visitors can get in touch.</li>  \t<li>We'll setup an About us page, and I'll explain why this page is important and what information to include on it.</li>  \t<li>We'll cover the legal pages you need.</li>  \t<li>We'll discuss the navigation system on your site, and how you can set up customized navigation in the header, sidebar or footer of your site.  We'll also talk about internal site linking.</li>  \t<li>We'll cover Wordpress security, and set up a system that will keep the site safe from hackers.</li>  \t<li>We'll check out some great free plugins.</li>  \t<li>Finally, I'll give you a 20 step plan for creating your site.  </li>  </ol>\n\n<p>  \t                              By the end of this course, you will have a website that you are truly proud of.  </p><p><strong class=\"redactor-inline-converted\">Just of few of the many Student Reviews</strong></p>\n\n<ul><li><em>This is a fabulous course, and I would it give it six stars if such a rating were available! Everything is very clearly explained, and Andy promptly answers any question you might have. If you are interested in using and learning WordPress, you owe it to yourself to take this outstanding course.</em> <strong class=\"redactor-inline-converted\">Robert Weiser</strong></li><li><em>Lectures are well-structured with lots of details given. The instructor is extremely knowledgeable and communicates very effectively. I've been able to set up my first website based on what I've learned here. A definite plus is that questions posted via the course are answered quickly!</em> <strong class=\"redactor-inline-converted\">Susan Worms</strong></li><li><em>I love this course. I have spent a few hours today and I have already learned so much. Really excited about the potential for when I am done. Great Course! </em><strong class=\"redactor-inline-converted\">A. Luis Acosta</strong></li><li><em>I learned a lot more than how to use WordPress in basic terms. Andrew shares a lot of insider knowledge and tips that would take you countless hours of doing your own research to learn...and answering questions you may not have thought to ask. Couldn't have asked for a better course to help me jumpstart into WordPress. </em><strong class=\"redactor-inline-converted\">Nathaniel Stephens</strong></li><li><em>What a fantastic share of knowledge. </em><em>I really appreciated and loved how a \"real\" site was used for the lectures, real world examples of everything. I would definitely take this course - highly recommended! </em><strong class=\"redactor-inline-converted\">Glen Schafer</strong></li><li><em>This course is perfect for people who want to start a blog or info page with wordpress. He covers all the basics and sometimes goes even a little deeper, to give you an idea what to look for. The provided documents are gold and very helpfull. I can't wait to go public with my site. Thank you for the great lectures</em>. <strong class=\"redactor-inline-converted\">Andreas Lackmann</strong></li><li><em>I really wish I had access to a course such as this four years ago when I first started dabbling with Wordpress as a hobby in my retirement. The learning process at the time, for a non-techy like me, was painstaking. Andy's course was the ideal step-by-step teaching method. I'm now much more confident about starting a new affiliate marketing website. </em><strong class=\"redactor-inline-converted\">Leon</strong></li><li><em>Well delivered, well structured. Easy to follow and logical. </em><em>Developed my own website in parallel with the course, and had it up and running within two weeks of starting. Looking forward to undertaking a couple of the course developers other courses now. Highly recommended. </em><strong class=\"redactor-inline-converted\">Steve Laing</strong></li><li><em>Excellent instructor. </em><em>Andy is great. He used visuals for everything he say. I was able to pause him and go to my site and test my understanding in all areas that I did know. The results and excitement are fantastic. </em><strong class=\"redactor-inline-converted\">Esau Khan</strong></li><li><em>A fantastic course. </em><em>Thank you Andy. This is a great course and it has helped me start to build my own WordPress website. I was very impressed when I had a problem with viewing my site that you took time to check for me. That shows what a great teacher you are. I have booked up another course by to and can't wait for more. Once again. Thank you. </em><strong class=\"redactor-inline-converted\">B Brown</strong></li><li><em>Many of the courses I've been through related to learning Wordpress are either too complicated or the author doesn't spend enough time explaining concepts so that you can understand what's being said. Andy strikes a nice balance with this course in that all the modules are broken up into easily digestible pieces. I like that he takes enough time to explain each new concept or module without being repetitive or using jargon that's difficult to follow. I also love being able to follow along with Andy as he explains each new module as well (as opposed to just talking off of slides all the time). He literally walks you through everything, so it's like you're right there looking over his shoulder. For anyone wanting to understand all the fundamentals of Wordpress, I think you'll absolutely love this course. It will save you tons of time by having all this information in one place. And you'll even learn some additional features like setting up affiliate links (not that everyone needs to know this but I like that Andy included it so it's there if you ever want to know). Truly a fantastic course!</em> <strong class=\"redactor-inline-converted\">Lance Gross</strong></li><li><em>Superb Course - Extraordinary Instructor!! </em><em>Andy's Wordpress for Beginners-Master Wordpress Quicky course is by far the best Wordpress course I've seen. And I definitely wouldn't say it's just for beginners. I'm not a beginner - I thought I knew Wordpress pretty well, but I learned SO MUCH MORE from this course! I've always had a lot of questions about the many settings and various options in Wordpress and most courses just skip over them or tell you to check this box and move on with no explanation. I never really got my questions answered until now. Andy is very detailed in his instruction. He walks you through step by step and tells you what each setting or section is for, how it is used (or not used) and why. I got more out of Andy's course than any other course I've ever taken. He has an extensive teaching background and it is evident in his clearly produced videos. After taking this course, you'll find your confidence level will soar.</em> <strong class=\"redactor-inline-converted\">Carol</strong></li></ul><p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Wordpress for Beginners - Master Wordpress Quickly", 
    "price": "30.00", 
    "instructors": "Andrew Williams", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355212_948a_4.jpg", 
    "course_url": "https://www.udemy.com/wordpress-for-beginners-course/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T12:32:12Z"
}