{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Para ver la Página Web que vamos a crear en este curso vea el video promocional aqui arriba... \n\n  </p>\n\n<p>·       <strong>Si desea crear una Página Web o blog sin tener que aprender nada de programación, este es el curso perfecto para ti!</strong>\n\n  </p>\n\n\n\n<p>·       <strong>Usted no necesita conocimientos de programación!</strong>\n\n  </p>\n\n\n\n<p>·       <strong>No hay necesidad de escribir código! Ni siquiera una linea!</strong>\n\n  </p>\n\n\n\n<p>·       <strong>No se requiere experiencia previa.</strong>\n\n  </p>\n\n\n\n<p>·       <strong>Construir un Página Web profesional de la etapa de cero a paso</strong>\n\n  </p>\n\n\n\n<p>El objetivo de este curso es ayudarte y mostrarte paso a paso como crear una Página Web profesional estupendo para usted o su negocio utilizando WordPress. Y no es necesario saber nada de programación.\n\n  </p>\n\n\n\n<p>Vamos a estar juntos durante este curso, es como sentarse a mi lado mientras creamos una Página Web de Wordpress desde cero, vamos a paso a paso, explicando todos los detalles, para que pueda construir su sitio Wordpress mientras ve las lecciones de esta curso.\n\n  </p>\n\n\n\n<p>En lugar de pagar un montón de dinero para un desarrollador, usted puede crear una Página Web facilmente utilizando WordPress.\n\n  </p>\n\n\n\n<p>Este curso es para principiantes, si usted es un experto en Wordpress este curso no es para ti.\n\n  </p>\n\n\n\n<p><strong>Estos son algunos de los puntos que vamos abordar durante el curso:</strong>\n\n  </p>\n\n\n\n<p>1. Usted aprenderá algunos puntos muy importantes que hay que tener en cuenta para elegir el nombre de dominio perfecto para su sitio.\n\n  </p>\n\n\n\n<p>2. Te voy a dar una lista de plugins gratuitos que son esenciales para su sitio.\n\n  </p>\n\n\n\n<p>3. Usted aprenderá cómo utilizar plugins para aumentar su exposición en Google, y para crecer su Página Web en redes sociales.\n\n  </p>\n\n\n\n<p>4. Va a utilizar herramientas increíbles que le ayudarán a encontrar el dominio perfecto para su sitio.\n\n  </p>\n\n\n\n<p>5. Usted sabrá cómo comprar un dominio por sólo $ 1 por año.\n\n  </p>\n\n\n\n<p>6. Usted sabrá cómo iniciar su plan de hosting por sólo $ 0,01 para el primer mes!\n\n  </p>\n\n\n\n<p>7. Va a configurar una cuenta de hosting para alojar todos sus sitios de WordPress.\n\n  </p>\n\n\n\n<p>8. Usted aprenderá paso a paso como instalar Wordpress en su sitio / blog.\n\n  </p>\n\n\n\n<p>9. Usted aprenderá como configurar WordPress para un rendimiento óptimo.\n\n  </p>\n\n\n\n<p>10. Va a instalar un tema de WordPress gratis en su Página Web.\n\n  </p>\n\n\n\n<p>11. Usted aprenderá paso a paso como personalizar Wordpress tema para adaptarse a sus necesidades o su empresa.\n\n  </p>\n\n\n\n<p>12. Usted aprenderá a crear entradas de Wordpress.\n\n  </p>\n\n\n\n<p>13. Usted aprenderá cómo crear páginas de Wordpress.\n\n  </p>\n\n\n\n<p>14. Instalación de plugins en Wordpress.\n\n  </p>\n\n\n\n<p>15. Usted aprenderá a usar Wordpress!\n\n  </p>\n\n\n\n<p>Al final de este curso tendrás un sitio súper profesional (Wordpress), publicado en Internet, y todo esto en menos de una hora!\n\n  </p>\n\n\n\n<p>La mejor manera de aprender algo es haciéndolo! Ahora estás en el lugar correcto!\n\n  </p>\n\n\n\n<p>Vamos a empezar!\n\n  </p>\n\n\n\n<p>Estoy listo para empezar a crear tu Página Web! Estás listo?\n\n  </p>\n\n\n\n<p>Nos vemos en el curso!\n\n  </p>", 
    "end_date": null, 
    "title": "Wordpress: Como Crear Una Pagina Web Para Tu Negocio", 
    "price": "20.00", 
    "instructors": "Diego Davila", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580442_6d5a.jpg", 
    "course_url": "https://www.udemy.com/crearblogwordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T18:52:20Z"
}