{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em>This course was recently described as one of the best courses on the web by skilledup.</em></strong></p>\n\n<ul><li>Is creating a website putting you off starting your own online business?</li></ul>\n\n<ul><li>Do you think you need to hire an expensive designer to do it for you?</li><li>Do you think doing it yourself will take time, money and look amateruish?</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><em>Did you know you can easily create your own WordPress website with integrated blog in half a day?</em></strong></p>\n\n<p>This course will show you <strong class=\"redactor-inline-converted\">step by step</strong> how to create a mobile-responsive, professional WordPress website from scratch <strong class=\"redactor-inline-converted\">with no coding experience needed</strong>.  It is really easy - I promise!</p>\n\n<p> <strong class=\"redactor-inline-converted\"><em>Just watch what I do and copy me</em>.</strong></p>\n\n<p>When I started my online business, I struggled for ages trying to create a website using a premium WordPress theme, but it was so difficult to do as the theme was too complicated.</p>\n\n<p> If you want to set up an eCommerce site or something fancy, you would probably need a premium theme, but if you just want to increase visitors to your website and start building your list, <strong class=\"redactor-inline-converted\">this course is going to save you time. money and a lot of heartache!</strong></p>\n\n<p>With the help of this course, you can design your own WordPress website in under half a day with no technical knowledge or coding experience needed!</p>\n\n<p> And it will only cost you the price of your domain and hosting, which is much cheaper than you think!</p>\n\n<p>We will be using a FREE WordPress theme to create a beautiful, mobile-responsive website complete with email list-building functionality, so you can start to build your mailing list to promote your products and services or start up your own affiliate marketing business.</p>\n\n<p><strong class=\"redactor-inline-converted\">I will be with you every step of the way</strong> as you follow what I do in each of the videos. </p>\n\n<p>This course is for you if you want to start a part-time online business, or if you want to design WordPress websites for other people.</p>\n\n<p><strong class=\"redactor-inline-converted\">In this course, you will learn:</strong></p>\n\n<ul><li>How to create a professional, mobile-responsive WordPress website <strong class=\"redactor-inline-converted\">from scratch</strong></li><li>How to create an email sign-up box to help <strong class=\"redactor-inline-converted\">build your mailing list</strong></li><li>How to design a beautiful web header using FREE online software</li><li>How to create an integrated blog page</li><li>How to install plugins to help improve your website's functionality</li><li>How to write effective SEO-friendly blog posts </li><li>How to use Google analytics to make sure your website is attracting visitors</li></ul>\n\n<p>...and much much more!</p>\n\n<p><strong class=\"redactor-inline-converted\">It doesn't matter if you've never done anything like this before</strong>, I will go through each stage from installing WordPress onto your domain, to creating the pages and menus you will need to make your website look professional.</p>\n\n<p>I will also show you how you set up pages and posts so you can <strong class=\"redactor-inline-converted\">easily manage your</strong> <strong>website by yourself</strong>, going forwards, saving you money.</p>\n\n<p>This course will give you everything you need to set up your WordPress website so that you can start to promote yourself and your products easily and effectively.</p>\n\n<p>As a bonus for enrolling on this course, you will receive a FREE <strong class=\"redactor-inline-converted\">Psychological Sales </strong>Secrets eBook containing sales secrets used by the most successful online marketers.</p>\n\n<p>This course includes a discussion forum where you can share tips with other students and you also get the opportunity to ask me questions!</p>\n\n<p> I would love for you all to share links to your websites so you can give each other supportive feedback and help your websites get some exposure.</p>\n\n<p>I am here to support you. Please feel free to ask me questions...I really want to help!</p>\n\n<p>The course comes with a certificate of completion, which you can put on your CV to show potential employers, if you want to start a career as a web designer.</p>\n\n<p>This course has an unconditional 30 day money back guarantee, so there is ZERO risk to enrolling in this course!</p>\n\n<p>So what have you got to lose? Enrol today and take the first steps to an exciting new business.</p>", 
    "end_date": null, 
    "title": "WordPress Made Easy: Design a website and build a list", 
    "price": "20.00", 
    "instructors": "Business Divas Academy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473560_d7da_3.jpg", 
    "course_url": "https://www.udemy.com/design-a-mobile-responsive-wordpress-website-in-3-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-11T14:20:03Z"
}