{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<ul><li><strong>No Coding</strong></li><li><strong></strong><strong>No Prior Experience Required</strong></li></ul><p>With Wordpress 4,Build a beautiful responsive Wordpress site that looks great on all Device <br></p>  <p><strong></strong></p>  <p><strong><br></strong></p><p><strong>About the Course</strong></p>  <p>After taking you through all of the main options in Wordpress and explaining what each one does and how you set it up, I'll let you <strong>watch over my shoulder</strong> as I build a Wordpress website.</p>    <p><strong><br></strong></p><p><strong>Who is this Wordpress course for?</strong></p>  <p>Have you ever wanted to build a professional looking website, but didn't know where to start? Now you can with Wordpress </p>  <p>Wordpress for Beginners is a complete course for anyone, no matter what your technical ability. This course assumes no prior knowledge!</p>    <p><strong><br></strong></p><p><strong>Here is a list of some of the things you will learn in this course:</strong></p>  <ul><li>You will learn how to buy, and pick out a domain name.</li><li>You will setup a hosting account to host all of your websites.</li><li>You will learn how to point your DNS to the correct hosting account.</li><li>You will learn the easiest way to install wordpress on your URL.</li><li>You will build an entire websites step by step.</li><li>You will learn how to use plugins and widgets.</li><li>You will learn how to integrate social aspects into your website.</li><li>You will integrate our twitter, and facebook feeds into your websites.</li><li>Finally you will go over my \"go to\" contact form and SEO plugins.</li></ul>                    <p>By the end of this course, you will have a website that you are truly proud of.</p>", 
    "end_date": null, 
    "title": "Wordpress For Beginners-Create Your Website With Wordpress", 
    "price": "20.00", 
    "instructors": "Alex Addo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692852_dc4b_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-for-beginners-create-your-website-with-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T10:46:56Z"
}