{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong><strong><strong><em></em></strong></strong></strong><em>\"Excellent for busy people. If you haven't started using WordPress for your site but would like to write content for it by yourself you should take this course. Excellent, no fluff explanations and perfectly presented.\"</em> -Matt S. Rinc<strong><strong><strong></strong><strong><strong><strong> </strong></strong></strong><em></em><strong></strong></strong></strong></p>\n\n\n\n<p><strong><strong></strong></strong></p>\n\n<p><strong><strong></strong></strong></p><strong><strong>\n\n</strong></strong><p><strong><strong></strong></strong><br></p>\n\n<p><strong><strong></strong></strong><strong>This quick and dirty course will get you up and running using WordPress in under an hour.</strong> <br></p>\n\n\n\n\n\n\n\n<p>These clear and easy-to-follow lessons are ideal for complete beginners, anyone who has a WordPress hosted website that someone else made for them, or for someone tasked with having to edit and contribute to their organization's WordPress website who has no idea where to begin.<em></em></p>\n\n\n\n\n\n<p>I start from the very beginning and show you the most essential and important features of the WordPress dashboard and interface. </p>\n\n\n\n\n\n<p>I'll show you how to get started making posts, pages, and managing all aspects of your WordPress hosted website so that <strong>by the end of the day today you can already add a new skill to your CV or resume and be contributing or editing your WordPress site at home or at work.</strong></p>\n\n\n\n\n\n<p> These powerful, bite-sized lessons come directly from my larger (7+ hours long)<strong> Web Snax: Super Simple Recipes for Easy Website Design</strong><em></em> course which is a full web design foundations class that not only gets into WordPress, but also how to plan and organize websites, create online graphics and animations, HTML and CSS, adding Javascript, and making beautiful websites from scratch in a variety of ways using an intuitive right-brained method that requires little to no coding ability. </p>\n\n\n\n\n\n<p> I'm a tenured Associate Professor of Digital Media and the Program Director of Film &amp; Digital Media at <strong>The American University of Rome </strong>and a practicing award-winning multimedia artist.</p>\n\n\n\n\n\n<p> I have over 15 years of experience teaching students all over the world using my tried and true custom approach (turning complex information into something simple, memorable, easy-to-understand in as short amount of time as possible) to ensure that <strong>you get the most important, relevant, and useful information that can be applied immediately to your art, work, and everyday life. </strong> </p>\n\n\n\n\n\n<p> New bonus lectures and resources will continue to be added and timely design advice will be provided in the discussion forum. I love to help and always respond to inquiries and discussions ASAP. <strong> </strong> </p>\n\n\n\n\n\n<p> <strong></strong> <br></p>\n\n\n\n<p> <strong>Please Note: All students who enroll in this course also will receive periodic free and discounted access to my other top-rated current and upcoming courses.</strong> </p>\n\n\n\n\n\n<p> You have a 30-day, 100% money-back guarantee with no questions asked so you have nothing to lose. I make myself available so you will have access to me if you have questions or need specific feedback along the way. </p>\n\n\n\n\n\n<p> <strong></strong> Empower yourself now by enrolling in this easy to follow WordPress course and join our growing learning community!<strong> Click the \"Take This Course\" button in the upper right corner and let's get started building your web design and content management skills today.</strong></p>", 
    "end_date": null, 
    "title": "WordPress in 1 Hour: Quick & Easy Essentials For Beginners", 
    "price": "20.00", 
    "instructors": "Kristen Palana", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465688_4cb3_4.jpg", 
    "course_url": "https://www.udemy.com/the-busy-entrepreneurs-quick-easy-wordpress-starter/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T08:36:00Z"
}