{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>The course provides complete details of how to install and customize a Wordpress site for use as a blog, business site, membership site or any other purpose needed by people who want to build a web site as part of their internet presence.</p><p>A Wordpress installation consists of separate modules for the creation of pages &amp; posts, configuring widgets and menus, and defining the overall look of the site. The course examines each function in detail, explaining how to change existing default setting to give the functionality required.</p><p>Wordpress site security is addressed and we look at manual and automatic ways of preventing hackers from accessing, and controlling the site. We also look at ways to improve SEO (Search Engine Optimization).</p><p>Course modules include (14 videos in all):</p><ul><li>What is Wordpress?</li><li>One Click Installation</li><li>Manual Installation</li><li>Cleaning Up The Site</li><li>Pages and Posts</li><li>Security</li><li>The Dashboard</li><li>Plug Ins</li><li>Brute Force Attacks</li><li>Themes</li><li>Widgets</li><li>Menus</li><li>SEO (Search Engine Optimization</li></ul><p>The course will take around 2 hours to complete.The video lessons are a combination of face to face discussion and\n explanation, plus over-the-shoulder screen videos showing a Wordpress \ninstallation at every stage.</p><p>The Wordpress platform is well established and is ideal for site creators who have no coding knowledge and require maximum control over the sites they create.<br></p>", 
    "end_date": null, 
    "title": "Wordpress Essentials: Installing Wordpress for Beginners", 
    "price": "20.00", 
    "instructors": "Jim Bruce", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754282_e7c2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-essentials-installing-wordpress-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T12:10:19Z"
}