{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>STUDENT REVIEWS For \"</strong><strong>Wordpress &gt; Create an Insanely Awesome Wordpress Website\"</strong></p>\n\n<p><em>\"Best Wordpress Course. I made my website with the lessons of this course in only three days! </em><em>Excellent: step by step, great plugins, smart tips. Recommended!\"</em><em> -</em> Patricia Garcia</p>\n\n<p><em>\"Wonderful Wordpress course. </em><em>I cannot believe how much I learned from this course. The instructor covered material that I could use to build an actual Wordpress website. I didn't just learn how to built a site; I actually built a website. Great Instructor!!\" -</em> Karen Gibson</p>\n\n<p>------------------------------------------------------------------------------------------------------</p>\n\n<ul><li><strong>No Coding</strong></li><li><strong>No Prior Experience Required</strong></li><li><strong>Build one professional website from scratch step by step</strong></li><li><strong>Initial investment = less than $5</strong></li></ul>\n\n<p>The goal of this course is to show you how to setup and create a complete, amazing and professional looking website using WordPress without writing one single line of code! Amazing right?</p>\n\n<p>I'll let you <strong>watch over my shoulder</strong> as I build a Wordpress website from scratch, we will be going step by step, so you can build your Wordpress website while watching the lessons on this course.</p>\n\n<p>Instead of paying hundreds of dollars to a developer, you can easily do it yourself.</p>\n\n<p>This course is for beginners if you are an expert in Wordpress this course is not for you.</p>\n\n<p><strong>You will watch over my shoulder as we cover all this:</strong></p>\n\n<ol> <li>You will learn some very important points you need to consider to choose the perfect domain name for your website.</li> <li>You will use amazing tools that will help you to find the perfect Domain Name.</li> <li>You will know how to buy a domain name for around $1/year!</li> <li>You will know how to start your Hosting plan for only $0.01 for the first month!</li> <li>You will setup a hosting account to host all of your Wordpress websites.</li> <li>You will learn step by step how easy is to install Wordpress for your website/blog.</li> <li>You will learn how to set up Wordpress settings for perfect performance.</li> <li>You will install a Free Wordpress theme on your website.</li> <li>You will learn step by step how to customize your Wordpress theme to fit all your ideas.</li> <li>You will learn to create Posts in Wordpress.</li> <li>You will learn to create Pages in Wordpress.</li><li>You will learn Wordpress!</li></ol>\n\n<p><br></p>\n\n<p>By the end of this course, you will have an amazing professional looking Wordpress website and it will take you less than 1 hour!<br></p>\n\n<p>The best way to learn something is by doing it! And YOU are in the right place right now!</p>\n\n<p>Let's start this together!</p>\n\n<p>I am ready to start building YOUR website! Are you ready?</p>\n\n<p>See you inside the course…</p>", 
    "end_date": null, 
    "title": "WordPress - Master WordPress in 2016", 
    "price": "20.00", 
    "instructors": "Diego Davila", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411446_6806_7.jpg", 
    "course_url": "https://www.udemy.com/wordpress-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T21:07:58Z"
}