{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>NEW! NEW! NEW!</strong></p><p><strong>Course Objective: </strong>To build a WordPress website powered by the popular Genesis Framework. Do it yourself (DIY) with WordPress and Genesis, the WordPress theme framework.</p><p>This course shows you how to set up the WordPress self-hosted script on your web host sever, gives you a crash course in using WordPress and then shows you how to install the popular Genesis Framework.</p><p>This course is the first in the \"WordPress and Genesis DIY Series\" and an introductory course and provides a foundation from which to expand your skills and knowledge of the Genesis Framework. </p><p>By the time the student has completed this course, they will have a WordPress installation and the Genesis Framework installed on top of WordPress. At course completion, the student will be prepared for the more advanced courses in the <em><strong>\"WordPress and Genesis DIY Series.\"</strong></em></p><p><strong>No Coding</strong></p><p>No Prior WordPress or Genesis Framework Experience Required</p><p><strong>*** ALL LECTURES ARE IN HIGH DEFINITION (HD) ***</strong></p><p>In my more than 35 years of formal teaching experience, I have found that the best approach to teaching was for the teacher to place himself at the desk of and in the role of the student. And, to teach in a manner imaging that he himself is the student.</p><p>Some instructors teach over the head of the student. Not all students are the same. Yet, it is the responsibility of the teacher to find a way to reach students who \"just don't get it.\" Indeed, the teacher should sweat over finding a solution to reach that student. If necessary, lose sleep over it. Then when the light bulb in that students head \"turns on\" then there is the reward!</p><p>In this course, I will teach with the Look-Over-My-Shoulder lecture method and DEMONSTRATE to you how to build a WordPress website powered by the popular Genesis Framework. This course sets the foundation for learning more about WordPress in conjunction with the Genesis Framework.</p><ul><li>Here Is a List of Some the Things You Will Learn</li><li>How To Choose The Best Web Host Services</li><li>Download and Install The WordPress Self-Hosted Script</li><li>Build a WordPress Website</li><li>Install the Genesis Framework</li><li>How to FTP To Your Web Host Server</li><li>How To Create a Database For WordPress</li><li>How to Perform the WordPress 5-Minute Install</li><li>How to Log Into The WordPress Dashboard</li><li>How To Configure WordPress</li><li>How To Create a Post In WordPress</li><li>How To Install and Use WordPress Themes</li><li>How To Install and Use WordPress Plugins</li><li>Have a WordPress Website Powered By The Genesis Framework</li><li>Be Encouraged To Increase Your Knowledge of WordPress and The Genesis Framework</li></ul><p><strong>Let Me Help You</strong></p><p>So if you have a strong desire or compelling need to quickly learn enough about WordPress and the Genesis Framework for personal or business use, then this course is for you.</p><p>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk!</p><p>After taking my course, you will have a basic understanding on how to build a basic WordPress website powered by the Genesis Framework.</p><p>Click the <strong>\"Take This Course\"</strong> button now.</p><p>Kind regards,</p><p>R. Jerome Harris</p>", 
    "end_date": null, 
    "title": "WordPress and Installing The Genesis Framework", 
    "price": "20.00", 
    "instructors": "R. Jerome Harris", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556324_ccc6_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-and-genesis-diy-setting-up-genesis/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T14:13:54Z"
}