{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Within the next few minutes you can be working right alongside me to create your very own website.</p><p>Even if you have never had any previous website experience before, this course is exactly what you need.</p><p>If you can write a simple document on Microsoft Word or similar, then you are good to go.</p><p>I dont fill the course with fluff and try and pad it out to make it look like a long intensive course.</p><p>I cover in detail every step you need right from the outset.</p><p>Got your domain name yet?</p><p>No problem. I show you how to choose it as one of the first things and I even show you how to register a domain name and set up your hosting.</p><p>If you dont know what that is or how to do it, dont panic. I explain it all in a few minutes and you see exacty how easily its done, each and every step. No technical jargon.</p><p>By the way, this is not a series of videos with me talking behind a load of powerpoint slides telling you what to do.</p><p>I don't tell you what to do,<strong> I show you.</strong> This is filmed using Camtasia studio and it shows you exactly what to do, every step I take, every mouse movement, every click.</p><p>I show you where to click, what to fill in, where to go next.</p><p><strong>What are the requirements?</strong></p><p>You dont need anything other than a computer and an internet connection.</p><p>No experience or knowledge is required - everything is shown in this video course</p><p><strong>What am I going to get from this course?</strong></p><p>Over 30 lectures and 3 hours of content and help and support from me directly answering any questions you have as promptly and professionally as possible.</p><ul><li>Learn to create your own WordPress website from scratch</li><li>Learn how to make changes to your site as and when required,</li><li>See how to easily add pictures and graphics</li><li>See how to create a blog or diary of events</li><li>Learn how to import themes for your new website</li><li>Learn how easily you can incorporate video to any page on your site.</li><li>Know the right way to  arrange your menu bar</li><li>See how easily you can add drop down menus</li><li>What you must never do to get people to contact you on your website</li></ul><p><br></p><p><strong>What is the target audience?</strong></p><p>Anyone who wants to create their very own website for whatever reason. Entrepreneurs, Business Owners, Individuals, Students, Employees and even kids. The youngest person I have taught this to is 10 years old and farming and tractors mad!</p><p>No matter what age you are of what country you are from... this is for you.</p><p>See you shortly.</p><p>Ian</p>", 
    "end_date": null, 
    "title": "Wordpress:Quick And Easy Video Tutorial Series for Beginners", 
    "price": "20.00", 
    "instructors": "Ian McMullan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625972_221d_2.jpg", 
    "course_url": "https://www.udemy.com/wordpressquick-and-easy-video-tutorial-series-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T15:38:58Z"
}