{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong><strong><strong>**This course is completely updated and tailored to help you achieve great results in 2016! Let's make this year a great one guys**</strong></strong></strong></p>  <p>  \t<strong></strong>I will offer Skype support to every student who asks for it. If you have a problem/question, send me a private message and we will set a time for the call.  </p>  <p>  \t<strong><em>-------------------------------------------------------------------------------------------------------------</em></strong>  </p>  <p>  \t<strong>Would you like to learn how to instantly create an amazing website for your business, blog or any other endeavor?</strong>  </p>  <p>  \t                                                    Would you like me to teach you how to setup said website in under <em>two hours</em>, with your only upfront costs being hosting and a domain name ?  </p>  <p>  \t                                                    Can you follow the easy instructions I will lay down for you in order to setup your very own commerce or entertainment platform?  </p>  <p>  \t                                                    If you answered « yes » to any of the questions above, congratulations. This Wordpress course is definitely for you.  </p>  <p>  \t<strong>Let me help you !</strong>  </p>  <p>  \t                                                    In this course,<strong>I will teach and DEMONSTRATE </strong>every step of the process from registering hosting and installing Wordpress to crafting your beautiful masterpiece.  </p>  <p>  \t                                                    Better yet, the learning curve for this course is very short. Watch it once and you'll be ready to go. Monkey sees monkey does.  </p>  <p>  \t                                                    ·Do you need/want a website for your business?  </p>  <p>  \t                                                    ·Do you have very low starting capital, or wish to invest as little money as possible?  </p>  <p>  \t                                                    ·Are you busy and want to get things done as fast as possible with Wordpress ?  </p>  <p>  \t                                                    ·Do you want to own a business that you can be proud of?  </p>  <p>  \t                                                    If you answered « yes » to <em>these </em>questions, <strong>then consider this course to be your blueprint to success.</strong>  </p>  <p>  \t                                                    Upon enrolling, you will get my personal help to create your Wordpress site. I will answer any question that you may have in the member's area, and I also offer Skype support if needed.  </p>  <p>  \t<strong>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. </strong>You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk !  </p>  <p>  \t                                                    You can get started right after you have taken my course -That means <strong><em>TODAY!</em></strong>  </p>  <p>  \t                                                    Click the \"Take This Course\" button now. That's your first step to building an amazing website from scratch. Every minute that goes by without action is <strong>a minute you are not getting back.</strong>  </p>  <p>  \t                                                    Cheers!  </p>  <p>  \t                                                    Howard  </p>", 
    "end_date": null, 
    "title": "Wordpress For Beginners", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354482_310c_3.jpg", 
    "course_url": "https://www.udemy.com/build-a-wordpress-website/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T13:56:41Z"
}