{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t</p>\n\n<p><strong class=\"redactor-inline-converted\">Why is <u>WordPress Essentials for Business</u> one of the most popular and highest-rated WordPress beginner courses on the web?</strong></p>\n\n\n\n\n\n\n\n<ul><li>Build an attractive website A-Z using the provided sample files, then repeat for your own site!  (you will create the following site: www.wp-clone.com)</li></ul>\n\n\n\n\n\n<ul><li>It's designed for busy professionals -- no technical experience is required, and we only teach you what you need to know (HTML?  Forget it).  </li></ul>\n\n\n\n\n\n<ul><li>You will  save many hours of trial-and-error in setting up your first website -- don't try and learn WordPress by \"point, click and pray!\"</li><li>Unlike other beginner WordPress courses, we cover topics that are key to creating a professional-looking website, such as theme selection, graphics sources, and more</li></ul>\n\n\n\n\n\n\n\n<p>***SPECIAL BONUS***  Get high-performance managed WordPress Hosting for 1/3 of the going rate!  Skip to the \"Hosting WordPress\" video, minute 3:50, to find out how<br></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why bother with WordPress training? The software is simple, right? </strong></p>\n\n\n\n<p>WRONG.  While it is true that WordPress is relatively easy to navigate, most people without any web design experience are going to be completely perplexed in how to use it.  The WordPress software has revolutionized the web design business; and yet, finding a course that covers all the basics, is oriented to a non-technical audience, and gives practical advice on the commercial services that are imperative to making an attractive website, has proven to be difficult. WordPress Essentials for Business is designed to fill that training gap. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">About the Course</strong><br>  \n\n\n\n</p>\n\n\n\n\n\n<p>  \t                   15,000 students have already participated in this course!</p>\n\n\n\n\n\n<p>WordPress Essentials for Business is a quick (90 min) but thorough overview of using WordPress to create a business website.  It is  designed for busy small-business owners and self-employed professionals who want to quickly master the WordPress software for the purpose of creating an attractive website that generates leads and sales.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                         We learn by doing as we build out an actual website for a client of ours, explaining and demonstrating key concepts along the way, such as themes, plugins, widgets, images, etc.  Students should download the project files from \"wpacademy dot com slash essentials\" and then follow the tutorial on their own website, repeating the keystrokes and mouse sequences as they build out their own site.  You can expect to walk away from this training with an attractive website and a solid understanding of WordPress fundamentals.  </p>\n\n\n\n\n\n\n\n\n\n<p>  \t                         To take this course you will need a self-hosted WordPress website under your own domain and hosting account, and we will show you how to set that up. Domains cost about $10/yr and a hosting account will cost you an additional $7-12/mth, and will host all of your business and personal websites.  </p>\n\n\n\n<p><strong>Can I really learn web design in 90 minutes?</strong></p>\n\n\n\n<p>Of course there are many aspect to building an attractive and functional website.  WordPress Essentials for Business is designed to boot-strap your skills, but there is much more to learn.  See some of these other WP Academy courses to gain these additional and essential skills.  Many people have become professional web designers and virtual assistants from this training: <br></p>\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>WordPress Theme Selection &amp; Customization</li>  \t<li>WordPress Backup, Security &amp; Performance </li>  \t<li>Images and Graphic Editing </li>  \t<li>WordPress CSS Styling &amp; Advanced Content Creation </li>  \t<li>WordPress SEO</li>  \t<li>WordPress eCommerce &amp; Membership Systems</li>  \t<li>WordPress Email Newsletters &amp; Social Media Integration</li>  \t<li>Video Production for the Web </li>  \t</ul>", 
    "end_date": null, 
    "title": "WordPress Essentials for Business", 
    "price": 0, 
    "instructors": "Marc Beneteau", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41878_1cc8_5.jpg", 
    "course_url": "https://www.udemy.com/wordpress-essentials/", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-15T23:50:32Z"
}