{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tUsed by more than 85 million entrepreneurs and small businesses worldwide, the Wordpress Content Management System (CMS) is the #1 website builder available. There is nothing more important than how your business&#039; products, services and messaging are presented to an online audience.  </p>  <p>  \tUsing Wordpress allows you to perfectly introduce and manage your online presence. In this course, we teach advanced Wordpress developments topics such as;  </p>  <p>  \t<strong style=\"\">1.</strong> Effective homepage set-up and design  </p>  <p>  \t<strong style=\"\">2. </strong>When and where to insert banner ads. sidebar ads and other direct calls to action  </p>  <p>  \t<strong style=\"\">3.</strong> How Wordpress sliders increase visitor engagement as well as profits  </p>  <p>  \t<strong style=\"\">4.</strong> The only 5 pages any business website needs to be successful  </p>  <p>  \t<strong style=\"\">5.</strong> Why plugins and widgets matter for increasing profitability and how to set them up  </p>  <p>  \t<strong style=\"\">6.</strong> Setting up blog posts that will increase website subscribers and paying customers  </p>  <p>  \t<strong style=\"\">7.</strong> Setting user permissions for maximum readership engagement  </p>  <p>  \t<strong style=\"\">8.</strong> How to integrate social media components into web design  </p>  <p>  \tand many more topics! Join is today and learn how to set-up a Wordpress website which will take your business to the next level!  </p>", 
    "end_date": null, 
    "title": "Wordpress Development", 
    "price": "20.00", 
    "instructors": "Brian Dale", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118874_3391_6.jpg", 
    "course_url": "https://www.udemy.com/web-design-wordpress-intro/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-12T19:42:40Z"
}