{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>En este<strong class=\"redactor-inline-converted\"> Curso Definitivo de </strong><strong class=\"redactor-inline-converted\">WordPress</strong> aprenderás a: </p><ul><li><strong class=\"redactor-inline-converted\">Crear y </strong><strong class=\"redactor-inline-converted\">diseñar un blog o página web de manera profesional</strong><strong class=\"redactor-inline-converted\">.</strong></li><li><strong class=\"redactor-inline-converted\">No necesitas</strong> <strong class=\"redactor-inline-converted\">conocimientos de </strong><strong class=\"redactor-inline-converted\">programación</strong> <strong class=\"redactor-inline-converted\">ni</strong> <strong class=\"redactor-inline-converted\">técnicos</strong>.</li><li><strong class=\"redactor-inline-converted\">No necesitas escribir código HTML ni PHP.</strong></li><li><strong class=\"redactor-inline-converted\">No necesitas experiencia previa en creación de Blogs ¡Este curso te lo explica todo desde 0!</strong></li></ul>\n\n<p>Este curso te enseñará lo que<strong class=\"redactor-inline-converted\"> otros cursos de la misma temática no enseñan</strong>, desde lo más básico y fundamental, para poder tú mismo desenvolverte con WordPress sin necesidad de tener que contratar a nadie:</p>\n\n\n\n<ul><li>¿Qué es Apache?</li><li>¿Qué es MySql?</li><li>¿Qué es una DNS? y ¿Una IP?</li><li>¿Para qué sirve un Hosting?</li><li>¿Qué necesito para instalar WordPress?</li><li>¿Qué es un entorno de desarrollo? Diferencia entre Servidor de Desarrollo y Servidor de Producción.</li><li>¿Es posible instalar Wordpress en mi propio ordenador?</li></ul>\n\n\n\n<p>Aprenderás a <strong class=\"redactor-inline-converted\">configurar y administrar tu WordPress</strong> fácilmente. En unas pocas horas habrás adquirido todos los conocimientos necesarios para ser un <strong class=\"redactor-inline-converted\">blogger profesional</strong> y a empezar a escribir en tu propio Blog.</p>\n\n\n\n<p>Diseñarás tu sitio rápidamente en unas <strong class=\"redactor-inline-converted\">pocas horas</strong> con una mínima inversión.</p>\n\n\n\n<p>Al finalizar el curso habrás aprendido <strong class=\"redactor-inline-converted\">todo</strong> sobre <strong class=\"redactor-inline-converted\">Wordpress</strong>:<br></p>\n\n\n\n<ul><li>A <strong class=\"redactor-inline-converted\">crear una base de datos</strong> para instalar WordPress</li><li>Conceptos básicos, pero necesarios sobre <strong class=\"redactor-inline-converted\">administración de sitios webs</strong> (diferencia entre un servidor de desarrollo y de producción, que es una IP, que es un DNS, que un hosting, que es Apache...)</li><li>A crear un <strong class=\"redactor-inline-converted\">servidor de desarrollo en tu propia máquina</strong> para poder hacer todas las pruebas y cambios que necesites en tu blog antes de subirlo a tu Hosting.</li><li><strong class=\"redactor-inline-converted\">Configurar los ajustes de WordPress</strong> y saber para que es cada uno ellos.</li><li><strong class=\"redactor-inline-converted\">Crear nuevas páginas y entradas</strong>.</li><li><strong class=\"redactor-inline-converted\">Instalación de nuevos temas</strong>.</li><li>¿Para qué son los Widgets? y ¿Cómo podemos utilizarlos?</li><li><strong class=\"redactor-inline-converted\">Instalación y configuración de Plugins</strong>: Añadir nuevo formulario de suscripción, formulario de contacto, herramienta antispam...</li><li><strong class=\"redactor-inline-converted\">Seguridad en WordPress</strong> (actualización del sistema, realizar copias de seguridad, ...)</li><li>Como <strong class=\"redactor-inline-converted\">crear nuevos usuarios</strong> (colaboradores, autores, editores...)</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">======== Detalle del Curso ========</strong></p>\n\n\n\n<ul><li>Ajustes de WordPress: Veremos a fondo todos y cada uno de los ajustes de WordPress para conocer en detalle para que sirve cada una de las opciones que nos ofrece este gestor de contenidos.</li><li>Como configurar correctamente los permalinks (enlaces permamentes) para así posicionar mejor nuestros artículos en buscadores como Google.</li><li>También veremos los ajustes generales, ajustes de escritura, lectura, comentarios y medios.</li><li>Crear nuevas entradas: Aprenderás a crear nuevas entradas, también veremos los diferentes formatos de entradas y sus opciones avanzadas. Además de qué son y cómo crear campos personalizados para las entradas.</li><li>Diferencia entre categorías y etiquetas. Porqué es importante categorizar nuestros artículos correctamente y el uso de las etiquetas.</li><li>Páginas estáticas: En la sección páginas, aprenderás a crear nuevas páginas en Wordpress. La diferencia entre páginas y entradas.</li><li>Como crear una nueva página de bienvenida y una página que te permita listar tus nuevas entradas.</li><li>Comentarios. Aprenderás a Gestionar comentarios: Desactivar, eliminar y activar comentarios en entradas y páginas.</li><li>Temas: Cambiar la apariencia de tu tema en WordPress, instalar nuevos temas de forma automática y manual, crear y configurar nuevos widgets, cómo añadir nuevos menús para el tema que estés utilizando y finalmente el editor avanzado de temas. \n\n\nPlugins: añadir nuevos plugins, Configurar Akismet, como insertar el código de seguimiento de Google Analytics para saber las visitas que tiene tu blog sin necesidad de hacer uso de plugins. También veremos como insertar en el blog un nuevo formulario de contacto. Cómo añadir un nuevo formulario de suscripción, para que tus usuarios se puedan a suscribir a tu blog.</li><li>Seguridad: Veremos la importancia de mantener nuestro sistema WordPress, plugins y temas actualizados, además de instalar plugin de backup para poder realizar copias de seguridad de la base de datos y de los archivos de WordPress.</li><li>Usuarios y Perfiles: Cómo crear nuevos usuarios en WordPress y asignarles diferentes roles: como el rol de autor, editor, colaborador, ...</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">========&gt; RECUERDA &lt;========<br></strong>Al <strong>inscribirte</strong> a este curso podrás acceder a él siempre que quieras, llevar las clases a tu ritmo, no hace falta que lo acabes en un mes, ni en dos, ya que <strong class=\"redactor-inline-converted\">tendrás acceso al curso de por vida</strong>, accediendo a todos los materiales y los nuevos vídeos que vaya creando para siempre.\nAdemás contarás con una <strong class=\"redactor-inline-converted\">instructora experta en desarrollo web</strong>. Podrás consultarme tus dudas siempre que lo necesites y plantearme preguntas en cualquier momento del curso. \nMi intención es que este sea el <strong class=\"redactor-inline-converted\">curso definitivo de WordPress</strong>, por lo que si consideras que hay algún tema que no se trate en el curso y que crees que debería incluir, tu sugerencia será más que bienvenida.</p>", 
    "end_date": null, 
    "title": "Wordpress Curso definitivo", 
    "price": "50.00", 
    "instructors": "Roxana Falasco", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755450_0466.jpg", 
    "course_url": "https://www.udemy.com/wordpress-curso-definitivo/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-07T23:06:11Z"
}