{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>\n\n<strong>Earn $150 p/hour</strong> or more <em><strong>with your very next client. </strong></em>Implement the 6 easy steps outlined in my <strong>Web Design Business Formula</strong> and <strong><em>explode your income in 2016!</em></strong></p>\n\n<p><em>In less than 2 hours</em> you will be able to implement the exact formula that I use to <em><strong>consistently earn at least $150 p/hour with every client</strong></em> as a freelance web designer using WordPress.</p>\n\n<p><em>I’m so sure of your success that <strong>I offer a 30 Day Money Back Guarantee with No Questions Asked!</strong></em><em><strong></strong></em></p>\n\n<p>I’m a <strong>self-taught Web Designer</strong> that’s been in the business since 1997. I’ve designed hundreds of websites from small mom &amp; pop type businesses, to startups to leading web design projects with budgets upwards of $20 Million dollars as the Director of Product Design for a well known global organization.</p>\n\n<p>I’m telling you this <strong><em>not to impress you</em></strong>, but to impress upon that what you’ll learn in this course comes from <em><strong>19 years (5 years-WordPress) of practical hands on experience</strong></em>, which is key. </p>\n\n<p>I know that when I take a course, I’m looking to <strong>learn from someone who is actually successful <em>DOING</em> what it is that I want to do</strong>. Not from some professor with a text book and a lot of hot air.\n</p>\n\n<p>What you will learn in this course is <strong>NOT academia</strong>, it is <strong>NOT theory</strong> - <em><strong>IT WORKS in the real-world with real clients.</strong></em>\n</p>\n\n<p><strong>You should take this course if...</strong><br></p>\n\n<ul><li>you love web design but can't figure out how to earn what you're worth</li><li>you get clients, but often end up working for little of nothing</li><li>you went to school for web design/development but haven't figured out how to make money with your skills</li><li>you work full-time, do freelance on the side, but don't earn enough to leave your day job</li><li>you have a small business that offers web design, but you're not making a decent margin</li><li>you simply want to earn $150 p/hour or more offering web design services</li></ul>\n\n<p><br>If any of the above describe your situation then <em>take this course!</em> You will not be disappointed. The formula outlines a <strong>simple proven way to consistently earn $150 p/hr </strong><em>or more that</em><em> <strong>any web designer can implement </strong>using WordPress.</em><br></p>\n\n<p><em><strong>If my Web Design Business Formula doesn't work for you within 30 Days I will give you all Your Money Back with No Questions Asked!</strong></em></p>\n\n<p><em></em><em>Click the</em> <strong>ENROLL NOW</strong> <em>button to the right,</em> and I will walk you through it <strong><em>step-by-Step and give you all the tools</em></strong> (game plan, proposal templates, etc.) you need <strong><em>to start earning $150 p/hour</em></strong> right now!</p>\n\n<p><em>Click the</em> <strong>ENROLL NOW </strong><em><strong>button</strong> to the right</em> to get started today.</p>\n\n<p><strong>ENROLL NOW</strong> and view this course <em><strong>free on</strong></em> <em><strong>your iPhone, iPad and Android devices </strong>with the <strong>UDEMY app!</strong></em></p>\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "WordPress Web Design Business Formula - Secrets to Success", 
    "price": "20.00", 
    "instructors": "Dante Varnado Moore", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705856_de18_8.jpg", 
    "course_url": "https://www.udemy.com/wordpress-web-design-business-formula-secrets-to-success/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T16:46:47Z"
}