{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t   As an open source content management system, WordPress allows users to easily  build feature-rich web sites with no programming experience. This unique  book-and-video package is a friendly, self-paced beginners guide to the latest  release of WordPress. Lessons are focused on practical, everyday tasks that  users will need to create and maintain their sites: entering new content,  creating new pages, managing menus, making content search-engine friendly. Plus  you&#039;ll find lots of tips based on years of experience teaching people to use  WordPress.  </p>  <p>  \t   You&#039;ll also learn how to extend the functionality of WordPress by using the  thousands of plugins available. Connecting to social media, creating membership  and e-commerce sites, setting up events calendars, making your site  mobile-friendly—these are just some of the plugins you&#039;ll be introduced to. Each  lesson in the book is supplemented by an instructional video intended to enhance  your learning experience. Plus, a trouble-shooting appendix addresses various  issues to help you solve any challenges you may face.  </p>  <p>  \t  As a bonus, we’re including the complete ebook for a second WordPress book <em style=\"\">Professional WordPress 2<sup style=\"\">nd</sup> Edition</em>. This advanced tutorial will expand the skills you’ve learned in WordPress to extending WordPress through plugins and customizing it via themes, a developer view of user experience and optimization, deployment requirements for performance, security, and measurement, HTML5, CSS3, and JavaScript, custom post types, custom taxonomies, and multi-site installations.  </p>  <p>  \tVisit www.wrox.com and www.wiley.com  </p>  <p>  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "WordPress 24-Hour Trainer Second Edition", 
    "price": "45.00", 
    "instructors": "John Wiley & Sons, Inc.", 
    "commitment": "19 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/73172_26d8_8.jpg", 
    "course_url": "https://www.udemy.com/wordpress-24-hour-trainer-second-edition/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-02T19:54:53Z"
}