{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Save Time, Money And Stress</strong></p><p><strong>Find Out What Hackers Don't Want You To Know!</strong></p><p><strong><em>30000 Website Are Hacked Every Day.</em></strong>..And most owner don't even know their site is one of them..</p><p>Every single day hackers inject spam on your site ,redirect your site visitors to their sites, delete some of your files or even take over complete control of your website.</p><p><strong>This course will save you many hours of trial and error in setting up first website</strong></p><p>This course is all about the securing your website and you will be able to secure your Wordpress site and you can also secure your friends as well as your clients site. You can earn through giving services of your Wordpress security expertise .</p><p><strong>Use the simple steps in this course to secure Wordpress!</strong></p><p><strong>Wordpress Security Best Practices</strong></p><p>This course is regularly updated to reflect the Wordpress security best practices based on the most latest Wordpress version and the recently security threats.</p><p><strong>My Guarantee To You </strong></p><p><span>I am 100% confident that this the <strong>Best Wordpress Security Course </strong><span>available anywhere at the lowest price.. So ,<strong>Take this course now,</strong><span> Just click on the blue button that says \"Take this course\" and remember its entirely risk free!</span></span></span></p>", 
    "end_date": null, 
    "title": "Wordpress Security Earning Formulae in 2016", 
    "price": "50.00", 
    "instructors": "Zia Ur Rehman", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746576_b5cb_2.jpg", 
    "course_url": "https://www.udemy.com/wordpress-security-earning-formulae-in-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T06:17:38Z"
}