{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    When you’re looking for step-by-step instructions on creating a website using WordPress, this <em style=\"\"><strong style=\"\">WordPress Video Series</strong></em> will save you a lot of time and money.  </p>  <p>  \t    I recently held a two-day Internet Marketing Workshop, <em style=\"\"><strong style=\"\">Website Design Mastery Weekend</strong></em>, where I showed a small group of small business owners how to create a web site and blog using WordPress.  </p>  <p>  \t    It was a step-by-step presentation where I answered all of their questions.  </p>  <p>  \t    As a result of the LIVE workshop, I promised the group I would put together <strong style=\"\">instructional videos</strong> that they could refer back to over and over again, as if I were there still teaching.  </p>  <p>  \t    It took me a while to do it, but the result is amazing.  </p>  <p>  \t    I have used my vast years of web design experience and encapsulated it into <strong style=\"\"><em style=\"\">40 videos that take you step-by-step and shows you how to create a self-hosted wordpress professional looking web site that ranks high on the search engines</em></strong>.  </p>  <p>  \t    There is nothing out there that compares to these instructional videos because it’s not just “how-to” create the web site, it’s also why you should do some of the things I cover, and when it’s the best time to do it.  </p>  <p>  \t    Take the course now and see how this course is different than any other. The course is perfect for you if you&#039;re brand new to the Internet, or are a seasoned professional.  </p>  <p>  \t<strong style=\"\"><em style=\"\">  Take the course now.  </em></strong>  </p>", 
    "end_date": null, 
    "title": "Wordpress: Learn it and Earn From It", 
    "price": "20.00", 
    "instructors": "Mr. Edison Guzman", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338920_4d38_9.jpg", 
    "course_url": "https://www.udemy.com/wordpress-learn-it-and-earn-from-it/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T00:15:03Z"
}