{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"><p style=\"\">This Building a Website with Wordpress  course is for those who want to build their own website/blog (or build websites  for others) quickly, efficiently, and with the most cutting-edge, modern  designs.&nbsp; This Wordpress course  is for those with no knowledge of anything as well as those who are proficient  in HTML and Photoshop but want to learn the quickest and easiest way to build  industry-leading websites.</p>    <p style=\"\">In less than 4 hours, I will personally walk you  through the ENTIRE process from start to finish to teach you the skills you  need to be able to create Wordpress websites or blogs for yourself, or for  profit by providing it as a service to others.</p>    <p style=\"\">In this remarkable Wordpress course, we will cover the  following:</p>    <p style=\"\">1) How to buy a domain (www.) and the best (and  cheapest) place to buy hosting.</p>    <p style=\"\">2) How to use the cPanel interface that is needed to  create subdomains, email accounts and many more important elements of your  site.</p>    <p style=\"\">3) How to install Wordpress in less than 2 minutes.</p>    <p style=\"\">4) The VERY best, yet undiscovered resource for  industry-leading Wordpress templates for blogs and for professional websites  which will literally save you hundreds of hours and thousands of dollars.</p>    <p style=\"\">5) How to install premium Wordpress themes and  customize them with YOUR branding and content.</p>    <p style=\"\">6) HTML 101: A crash-course HTML lecture, giving you  the essentials you need to customize your site EXACTLY the way you want it, but  leaving out all the complicated stuff you don&#039;t need.</p>    <p style=\"\">7) My 17 top favorite plugins and how these will  save you hours of time and integrate everything from Facebook and Twitter, to  contact forms and tools to make your site load 33% quicker.</p>    <p style=\"\">8) How to collect payment on your website with order  forms using paypal and other merchant accounts (which take about 2 minutes to  set up)</p>    <p style=\"\">9) How to set up an email list database and auto  responder sequence</p>    <p style=\"\">10) How to collect leads and build your email list  database by integrating opt-in forms on your website (and also linking paypal  to it!)</p>    <p style=\"\">Take this ultimate Wordpress Course: course right now and  learn every step for building  a website with Wordpress.</p>&lt;/p&gt;<p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "WordPress Rockstar", 
    "price": "40.00", 
    "instructors": "Levi Sanford", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35789_be47_3.jpg", 
    "course_url": "https://www.udemy.com/wordpress-rockstar/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-11T22:44:20Z"
}