{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  <strong style=\"\">\"Cody's course covers everything you need to start building a kickass online business.\" </strong>–Scott Britton  </p>  <p style=\"\">  \t<strong style=\"\">\"Cody is a pro. This course is detailed, actionable and comprehensive. Thanks for getting me up and running.\"</strong> –Christian Martin  </p>  <p style=\"\">  \t<strong style=\"\">\"Everything you need to know about Wordpress from the Master.\"</strong> –John Bardos  </p>  <p style=\"\">  \t      -----  </p>  <h5 style=\"\"> <strong style=\"\">Do you want to break into online business?</strong> </h5>  <h5 style=\"\">             By now you probably know that getting a website up and earning your first steady income on your own two feet can be very difficult as someone non-technical. </h5>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">It can be damn disempowering, and I've seen it hold back WAY too many people for way too long…</em></strong>  </p>  <p style=\"\">  \t                                          But today I want to help by giving you <strong style=\"\">a straightforward, step-by-step blueprint</strong> that will guide you from LITERALLY step 0 to having your OWN website, blog, and income-generating potential at your fingertips.  </p>  <p style=\"\">  \t                                          If you're a professional who takes what you do seriously… a subject expert who wants to <strong style=\"\">make something more of your life</strong>… you have the \"Linchpin\" mentality and want to become an authority in your field…  or even someone who wants to <strong style=\"\">build your own \"Lifestyle Business\"</strong> so you can simply spend more time with the people you care about and enjoy your life… but you're struggling with finding the right tools, learning how to code, failed attempts at hiring developers or outsourcing…  </p>  <ul style=\"\">  \t<li style=\"\">You know the challenge of being a pioneer in your field but being held back by the exponential rate of change in technology.</li>  \t<li style=\"\">You know you could earn the recognition you deserve if only given the chance.</li>  \t<li style=\"\">And you want to have more control over your time, and be able to make money doing something meaningful…</li>  </ul>  <p style=\"\">  \t                                          Well let me give you the missing pieces. <strong style=\"\">Zero to Hero</strong><strong style=\"\"> is a comprehensive video tutorial course that will give you all the training you need to get started with a lucrative new career online</strong>… as a full-fledged card-carrying member of the New Economy, giving you a platform to build your brand and become an authority in your industry, and access exponentially more clients around the globe.  </p>  <p style=\"\">  \t Our video lessons will SHOW YOU exactly how to purchase your first domain name, setup web hosting, DNS, how to work with FTP, cPanel, WordPress plugins and themes, backups, comments, analytics tracking, keyword tools and SEO research, SERP rankings, email autoresponders, social media sharing, Facebook apps and more…  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">===== </em></strong><strong style=\"\">Let us help you learn ALL the essential skills to… </strong><strong style=\"\"><em style=\"\">=====</em></strong>  </p>  <ol style=\"\">  \t<li style=\"\">Build your first website…</li>  \t<li style=\"\">How to leverage WordPress, and other free and inexpensive tools to get your message out there to the world…</li>  \t<li style=\"\">Learn how to broadcast your ideas far and wide, cultivate an audience and build community around your business…</li>  \t<li style=\"\">Develop what very well may become your most valuable asset EVER - an email list of subscribers who care about what you have to say…</li>  \t<li style=\"\">Uncover previously undiscovered ideas and opportunities, and target what you have to offer with unrivaled power through understanding the basics of Search Engine Optimization practices…</li>  \t<li style=\"\">Discover several simple ways to start earning a basic income from your website from its early days, and ensure you see a return on your investment of time from the beginning…</li>  \t<li style=\"\">All the basics about engaging with people on social media - potential customers, readers, partners, etc.</li>  \t<li style=\"\">Have more control and flexibility over your content online…</li>  \t<li style=\"\">Understand the basics of techie jargon when you need to communicate your ideas to freelancers, outsourcers or employees…</li>  \t<li style=\"\">And LOTS more…</li>  </ol>  <p style=\"\">  \t Get hands-on, guided experience with <strong style=\"\">WordPress</strong>, Google Analytics, Thesis Theme, <strong style=\"\">Wishlist Member Pro</strong> to build membership sites, <strong style=\"\">AWeber</strong> for email marketing, Google Adsense, Clickbank, Feedburner, Commission Junction, Twitter, Facebook and more…  </p>  <p style=\"\">  \t<strong style=\"\">ALL of this and more, explained in plain language that you can understand, and easy-to-follow and implement video guides</strong> that show every single step of the way to guide you to greater success!  </p>  <hr style=\"\">  <p style=\"\">  \t <strong style=\"\">\"Every first-time entrepreneur should take this course.\" </strong>–twentysomething serial entrepreneur Jun Loayza  </p>  <p style=\"\">  \t <strong style=\"\">\"</strong><strong style=\"\">A MUST for any Internet Marketing novice!\"</strong> –Shawn Rill  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\">Over 130 lectures and 11 hours of content</strong> that will take you <em style=\"\">by the hand</em>, every step of the way through getting started with your first domain name, all the Internet Business Basics you need to learn, using and building with <strong style=\"\">WordPress step-by-step, Advanced Blogging Tips and Tactics, SEO and Link Building, Email List Building, Social Media Marketing, and Making Money with your Blog…</strong>  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">===== But Cody, why should I listen to you?? </em></strong><strong style=\"\"><em style=\"\">=====</em></strong>  </p>  <p style=\"\">  \tI taught myself XHTML, CSS, and PHP and have been building websites professionally since 2006.  </p>  <p style=\"\">  \tI quit my office job as an Administrative Assistant in 2007 to pursue my side gig full-time. I started from scratch with web design (I had no formal education in technology OR design) and <strong style=\"\">grew and built it to the point where I could move abroad and travel the world FULL-TIME</strong>… and have since built an online community with my sites <a class=\"external-link\" href=\"http://www.thrillingheroics.com/\" rel=\"nofollow noreferrer\" style=\"\" target=\"_blank\">Thrilling Heroics</a> and <a class=\"external-link\" href=\"http://digitalnomadacademy.com/\" rel=\"nofollow noreferrer\" style=\"\" target=\"_blank\">Digital Nomad Academy</a> where I get to help others achieve similar success through marketing consulting, helping small businesses with their product launches online, personal career coaching and mentoring, and simply writing and sharing my passions with the world!  </p>  <p style=\"\">  \t                            I literally started with <em style=\"\">less than a thousand dollars</em> in my bank account and now I've worked with hundreds of amazing people, been a part of dozens of empowering and fun projects, I've coached and directly helped dozens of people to start new businesses and new lives as self-employed successes… and I've lived in 5 countries around the globe along the way! :)  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">===== </em></strong><strong style=\"\">Don't just take my word for it… Here's what some of my students say </strong><strong style=\"\"><em style=\"\">=====</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"> <em style=\"\"><strong style=\"\">\"Seems I owe you a decent gin at least as reading your site has led me to getting a few small businesses together for myself.\"</strong></em></strong>  </p>  <p style=\"\">  \t              –David McGrail  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\"><em style=\"\"><strong style=\"\">\"Cody my man, you have been a freaking ANGEL sent right from heaven to me bro and I'm not kidding about it.\"</strong></em></strong>  </p>  <p style=\"\">  \t              –Sergio Felix  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\"><em style=\"\"><strong style=\"\">\"I have to tell you, you have opened my eyes to what is possible and our life will never be the same again. I now have a strong foundation and am concentrating on what I believe will be some monumental wins in the next year. When I started out, the online business world seemed like a murky, incongruent, frustrating mess. Now, I can see a very bright light at the end of the tunnel.\" </strong></em></strong>–Tim Juliussen  </p>  <hr style=\"\">  <p style=\"\">  \t<em style=\"\"><strong style=\"\">\"Cody McKibben is amazing. An inspiring entrepreneur/world traveler and blogger who has helped me a ton with pursuing my passions. A great person to follow, especially if you want to enter into the blogging world, start your own business and lead an unconventional life where you're following your passions and are your own boss.\" </strong></em>–Emelina Minero  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\">\"</strong><strong style=\"\">Cody McKibben isn’t your ordinary freelancer.\" </strong>  </p>  <p style=\"\">  \t<img align=\"center\" src=\"https://freelanceswitch.com/wp-content/themes/fsw-v3/images/logo.gif\" style=\"max-width: 100%;\">  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\"><strong style=\"\">\"Cody started out as a typical person with a regular job who decided to leave all of that behind him, including his native country, the US. He’s been doing this for the last five years and now he helps other people understand the benefits of a digital nomad lifestyle and achieve their dreams of escaping the shackles of living in one place and being bound by a 9 to 5 job.\" </strong></em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\"><strong style=\"\">\"Cody is on a mission to show people how to lead different lives and break free from the traditional working routine.\" </strong></em></strong>–Transitions Abroad  </p>  <p style=\"\">  \t <strong style=\"\">\"He’s an archetype of the digital age and the never-before-possible lifestyle opportunities that the internet provides.\" </strong>–Nicholas Tart, 14clicks.com  </p>  <hr style=\"\">  <p style=\"\">  \t <strong style=\"\"><em style=\"\">===== </em></strong><strong style=\"\">Please Check Out the HUGE Amount of Content Inside This Course Below! </strong><strong style=\"\"><em style=\"\">=====</em></strong>  </p>  <p style=\"\">  \t                Look through all the curriculum below <strong style=\"\">(there are several <em style=\"\">FREE</em> example videos!) </strong>and the many reviews in the sidebar…  </p>  <p style=\"\">  \t<strong style=\"\">Over 130 step-by-step video tutorials, in 5 modules, PLUS 3 Bonuses:</strong>  </p>  <ol style=\"\">  \t<li style=\"\">Bonus 1: <strong style=\"\">Introduction to Making Money with Your Blog</strong> </li>  \t<li style=\"\">Bonus 2: <strong style=\"\">List Building Tips with AWeber</strong> </li>  \t<li style=\"\">Bonus 3: <strong style=\"\">Social Media Marketing with Twitter &amp; Facebook</strong></li>  </ol>", 
    "end_date": null, 
    "title": "Zero to Hero: Build Your Online Business with WordPress", 
    "price": "45.00", 
    "instructors": "Cody McKibben", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112102_e0b5_5.jpg", 
    "course_url": "https://www.udemy.com/zerotohero/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-29T04:41:02Z"
}