{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Создавай сайт без знания кода программирования</strong>  </p>  <p>  \t              Программа Adobe Muse используется дизайнерами для создания сайтов. Основным преимуществом этой программы является отсутствие необходимости работы с HTML кодом. С Abode Muse вы собираете ваш сайт как пазл - у вас уже есть готовые кнопки, текстовые и графические блоки, слайдшоу, панели навигации и множество других компонентов, которые вы заполняете своим контентом и применяете нужные цвета.  </p>  <p>  \t<strong style=\"\">Почему Вы должны пройти наш курс:  </strong>  </p>  <ul style=\"\">  \t<li>Вы изучите основы программы  Adobe Muse с нуля быстро и эффективно</li>  \t<li>Видеоуроки представлены в легкой пошаговой форме</li>  \t<li>Лекции подробно демонстрируют работу в программе</li>  \t<li>Вы приобретете навыки, необходимые для создания простого сайта</li>  </ul>  <p>  \t<strong style=\"\">Что входит в курс:  </strong>  </p>  <ul style=\"\">  \t<li>Курс содержит 7 разделов</li>  \t<li>Общее количество видеоуроков - 44</li>  \t<li>Общая длительность курса более 4 часов.</li>  </ul>  <p>  \t            Если вы хотите научиться создавать интересные, дизайнерские, профессиональные веб-сайты, то этот курс для вас! Так что давайте начинать.  </p>  <p>  \t______________________________________________________________  </p>  <p>  \t  Create a site without any knowledge of programming code  </p>  <p>  \t  The program Adobe Muse is used by designers to create sites. The main advantage of this program is no need to work with HTML code. With Abode Muse you collect your website as a puzzle - you already have a ready-made buttons, text and picture boxes, slideshows, navigation bar, and many other components that you fill out your content and apply the desired color.  </p>  <p>  \t  Why do you have to go through our course:  </p>  <p>  \t  You will learn the basics of the program Adobe Muse from scratch quickly and efficiently  </p>  <p>  \t  Video lessons are presented in an easy step by step form  </p>  <p>  \t  Lectures detail showing work in the program  </p>  <p>  \t  You will gain the skills needed to create a simple website  </p>  <p>  \t  What is included in the course:  </p>  <p>  \t  The course comprises 7 sections  </p>  <p>  \t  Total number of video tutorials - 44  </p>  <p>  \t  The total duration of the course for more than 4 hours.  </p>  <p>  \t  If you want to learn how to create interesting, designer, professional web sites, then this course is for you! So let&#039;s begin.  </p>", 
    "end_date": null, 
    "title": "Изучение программы Adobe Muse с нуля", 
    "price": "20.00", 
    "instructors": "Елена Домашева", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343750_71cb_3.jpg", 
    "course_url": "https://www.udemy.com/musemaster/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T23:11:22Z"
}