{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Создавай мобильную версию сайта в Adobe Muse </strong>  </p>  <div style=\"\">  \t  Мобильный интернет недооценен многими вебмастерами и собственниками бизнеса, в то время как мобильная версия является продолжением веб-сайта и по своим функциональным способностям может удовлетворить потребность интернет пользователей.  \t<p>  \t\t  C помощью моего курса Вы научитесь создавать мобильные версии сайтов в программе Adobe Muse.  \t</p>  \t<p>  \t\t  Программа Adobe Muse используется дизайнерами для создания сайтов. Основным преимуществом этой программы является отсутствие необходимости работы с HTML кодом.  \t</p>  \t<p>  \t\t  В этом курсе я подробно расскажу об особенностях создания мобильного макета сайта в Adobe Muse, как адаптировать сайт для более удобного использования на небольшом экране смартфона. Вы научитесь переносить контент из настольной версии сайта, создавать слайд-шоу, применять якоря и параллакс эффект перемещения, создавать альтернативный макет с горизонтальным пролистыванием страниц и многое другое. В конце курса я поделюсь с вами полезными ресурсами для саморазвития и вдохновения.  \t</p>  \t<p>  \t\t<strong style=\"\">Почему Вы должны пройти наш курс: </strong>  \t</p>  </div>  <ul style=\"\">  \t<li>Вы изучите основы создания мобильного сайта в Adobe Muse быстро и эффективно</li>  \t<li>Видеоуроки представлены в легкой пошаговой форме</li>  \t<li>Лекции подробно демонстрируют работу в программе</li>  \t<li>Вы приобретете навыки, необходимые для создания и публикации мобильного сайта а Adobe Muse</li>  </ul>  <p>  \t<strong style=\"\">Что входит в курс: </strong>  </p>  <ul style=\"\">  \t<li>Курс содержит 7 разделов</li>  \t<li>Общее количество видеоуроков - 25</li>  \t<li>Материалы для скачивания к каждому разделу курса</li>  </ul>  <p>  \t  Если вы хотите научиться создавать профессиональные адаптированные мобильные сайты, то этот курс для вас!  </p>  <p>  \t  Давайте начнем создавать мобильную версию сайта в Adobe Muse  </p>  <p>  \t  __________________________  </p>  <p>  \t  Create a mobile version of a site in Adobe Muse  </p>  <p>  \t  Mobile Internet is underestimated by many webmasters and business owners, while the mobile version is a continuation of the web site and in their functional abilities can meet the need of Internet users.  </p>  <p>  \t  Using my course you will learn how to create mobile versions of sites in the program Adobe Muse.  </p>  <p>  \t  The program Adobe Muse is used by designers to create websites. The main advantage of this program is not having to deal with HTML code.  </p>  <p>  \t  In this course, I will describe in detail about creating a mobile site layout in Adobe Muse, how to adapt the site for more convenient use on the small screen of your smartphone. You will learn how to transfer content from the version of the site so, create a slideshow, use anchors and parallax motion effect, create an alternate layout with horizontal scrolling pages and much more. At the end of the course I will share with you useful resources for self-development and inspiration.  </p>  <div style=\"\">  \t  Why do you have to go through our course:  \t<p>  \t\t  You will learn the basics of creating a mobile site in Adobe Muse quickly and efficiently  \t</p>  \t<p>  \t\t  Video lessons are presented in an easy step by step form  \t</p>  \t<p>  \t\t  Lectures detail demonstrate the work program  \t</p>  \t<p>  \t\t  You will gain the skills needed to create and publish a mobile site and Adobe Muse  \t</p>  \t<p>  \t\t  What is included in the course:  \t</p>  \t<div style=\"\">  \t\t  The course consists of 7 sections  \t\t<p>  \t\t\t  The total number of video tutorials - 25  \t\t</p>  \t\t<p>  \t\t\t  Downloads to each section of the course  \t\t</p>  \t\t<p>  \t\t\t  If you want to learn how to create professional customized mobile sites, then this course is for you!  \t\t</p>  \t</div>  </div>  <p>  \t  Let&#039;s start to create a mobile version of a site in Adobe Muse  </p>", 
    "end_date": null, 
    "title": "Создание сайта для мобильных устройств в Adobe Muse", 
    "price": "40.00", 
    "instructors": "Елена Домашева", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343724_fbaa_3.jpg", 
    "course_url": "https://www.udemy.com/mobilesite/", 
    "currency": "USD", 
    "subject_name": [
        "Web Design"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T22:19:49Z"
}