{"selfpaced": false, "topic_name": ["Nutrition & Wellness"], "description": "\n\n                    \n                    \n                    This course covers chemicals in our environment and in our bodies and how they impact our health. It addresses policies and practices related to chemicals, particularly related to how they get into our bodies (exposures), what they do when they get there (toxicology), how we measure them (biomonitoring) and their impact on our health.\n\n                                            Syllabus\n                        Week 1: Welcome &amp; IntroductionStart off this week with the peer assessment (we know, we know. . .how can we have an assessment before the course even starts, right?). We simply hope to gauge your initial understanding of the topics that we’ll cover (so grade easy). \n\nThen we get into a quick overview of the course, a discussion of chemicals &amp; how we are exposed (in three parts) and an introduction to chemical production &amp; regulation. The module ends with a fun homework assignment: watch an eight-minute video and discuss amongst yourselves (and with us too).Week 2 - Toxicology: What do chemicals do in our bodies?Now that you have a sense of what a chemical is, and how we are exposed to them, we dive into the science of how chemicals impact our health, starting with toxicology. But before you dive into the study of poisons, please review, evaluate, and grade at least four of your classmates' submissions from last week. After you listen to the lectures by Professor Trush, take the ten-question/multiple-choice quiz that covers weeks 1 &amp; 2. Feel free to go back and use the lectures to help you answer the questions.Week 3 - Biomonitoring: How do we measure these chemicals in our bodies and why?Start by watching a two-minute video and a five-minute news report. Post your reactions not only to the video and audio files, but also to your peers’ thoughts! \n\nNext you’ll hear from a CDC scientist about the US’ National Biomonitoring Program, then you’ll hear how that program translates to the local level. Be sure to keep in mind the relationship of communities to their government! This week is pretty light – so enjoy!Week 4 - Health effects of chemicals: How do we figure out how chemicals affect our health?Finally we get to one of the main questions presented in this course - how do scientists assess the impact of chemicals on our health? You’ll hear from a physician who specializes in environmental &amp; occupational medicine and epidemiology. Then you’ll hear how policymakers use the knowledge that we do have (about chemicals &amp; health) to assess risk and drive policy. Once you’ve viewed the two lectures, another ten-question/multiple-choice quiz will assess how much information you absorbed from weeks 3 and 4. Feel free to go back and use the lectures to help you answer the questions.Week 5 - Chemicals Policy: What do we do about chemicals &amp; health?So far we’ve covered: how chemicals get into our bodies and how we measure them,\twhat our bodies do with them and what they do to our bodies, and how that ultimately impacts our health. Now we turn to policy and how society addresses the impact of chemicals on health. \n\nWe will hear from a non-profit group that works to change policies such as laws &amp; regulations related to this area. Then we’ll hear how such changes have impacted our health and environment historically, looking specifically at air quality regulation in the US. \n\nAfter you view the lectures in Module 5, there is a second peer-reviewed writing assessment that aims to gauge your shift in understanding the complex relationship between chemicals and health (again grade each other generously).Week 6: Case Studies At this point you may be wondering: so how do all these pieces fit together? From chemicals in our natural world to production on a large scale, through exposure to health effects and policy . . . this module provides real world examples of how the general public, scientists, industry, governments and non-profit groups come together to effect change. Specifically, we’ll hear about tobacco, contaminated food, drinking water, nanotechnology &amp; worker health. At some point this week (either before, after or in-between listening to the case studies), you’ll need to review, evaluate, and grade at least four of your classmates' submissions from last week. The final lecture offers a summary &amp; conclusion, hopefully providing ideas for next steps for those of you interested in learning or doing more related to chemicals &amp; health. Please let us know how we did and how we can improve! \n                                    ", "end_date": "2016-08-15T00:00:00Z", "title": "Chemicals and Health", "price": 0, "instructors": "Megan Latshaw and Beth Resnick", "institution_name": ["Johns Hopkins University"], "commitment": "2-4 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/learn/chemicals-health", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-07-04T00:00:00Z"}