{"selfpaced": false, "topic_name": ["Nutrition & Wellness"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    feedingtheworld-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This course will explore the concepts driving current food production science (population growth, urbanization, emerging affluence, resource constraints, and underlying biological limits) with the main focus on livestock production. Each of the major food animal species (dairy, swine, beef, and poultry) will be covered in terms of their universal life cycles, constraints to production and emerging societal issues. Throughout the course, we will tackle some difficult and important questions:What are the major health benefits and potential concerns regarding the production and consumption of animal products?How does animal production affect the efficient use of resources and impact our environment?Can cost of production be reduced to meet growing demand for animal products around the globe while maintaining health and safety for both animals and consumers?What are the different types of animal food production systems?Myths and misconceptions surrounding the animal food systems will be discussed. We’ll also look closely at some of the global issues, problems, and challenges in these food systems which scientists, farmers, and veterinarians, are attempting to solve through collaboration.Lectures will be delivered by several experts from the University of Pennsylvania, School of Veterinary Medicine who are intimately involved in the study and advancement of animal production systems. The course is geared towards learners who seek a greater understanding of animal food systems as well as those who might have never visited an animal farm, but have a desire to learn more about where some of our food comes from and issues surrounding sustainability.\n\n                                            Syllabus\n                        WEEK ONE:  POPULATION GROWTH AND GLOBAL ANIMAL INDUSTRIESAnimal food systems will be introduced and we’ll look at production processes here and across the globe with an eye on our growing population, demands of emerging economies, and more.WEEK TWO:  ISSUES SURROUNDING ANIMAL PRODUCTIONThe benefits, concerns, ethical aspects, and management of environmental resources used in animal production systems will be discussed.WEEK THREE: ANIMAL FEED, THE ENVIRONMENT AND GENETICSWe’ll explore the what, how, and why aspects of animal feeding and how its production affects our environment. We’ll also talk about genetic selection and emerging technologies in animal breeding.WEEK FOUR: GENERAL ANIMAL PRODUCTION, EFFICIENCY, AND FOOD SAFETYThe final weeks of the course will focus on specific animal systems. We’ll look at each (dairy cows, swine, poultry and beef cows) in terms of their industry trends, animal life cycles, different types of production systems and myths and issues surrounding them.WEEK FIVE:  DAIRY PRODUCTION SYSTEMSWEEK SIX:  SWINE PRODUCTION SYSTEMSWEEK SEVEN: POULTRY PRODUCTION SYSTEMSWEEK EIGHT: BEEF PRODUCTION SYSTEMS\n                                    ", "end_date": "9999-12-31T23:59:59Z", "title": "Feeding the World", "price": 0, "instructors": "David Galligan and James Ferguson", "institution_name": ["University of Pennsylvania"], "commitment": "2-4 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/course/feedingtheworld", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "9999-12-31T23:59:59Z"}