{"selfpaced": false, "topic_name": ["Nutrition & Wellness"], "description": "\n\n                    \n                    \n                    How can we use food as medicine?\n\nThis free online course introduces the concept of food as medicine. You will explore how food can be important both in preventative health and in the treatment of certain conditions today, in the past and in the future. You will also learn about what’s in food that gives it the potential to improve our health.\n\nNutrition science: how do you know what to eat and how much?\n\nThe science behind nutrition is a complex and ever-evolving field, and making sense of it all can be hard. In this course you will discuss the latest evidence-based nutrition guidelines and unpick some of the current controversies so that you can decide what’s right for you.\n\nA body systems approach to food and diet\n\nYou will explore key body systems, including the brain and the gut, and explore foods that may play a role in the optimal functioning of these systems. We will discuss genetics and the advances in our knowledge of how this interacts with food and nutrition, plus how we can manage our weight in context of the environment that we live in.\n\nWe will also examine the relationships between food, fertility and pregnancy and how using food as medicine can influence the health of future generations.\n\nA practical course on food as medicine\n\nThis course will help you to recognise which types of foods are essential for health and wellbeing, and how food can play an important role in treating/preventing disease. You will learn how to apply the latest nutrition guidelines to improve your personal food choices, nutritional intake and take a modern look at how we can use food as medicine.\n\nLearn from a diverse team of nutrition experts\n\nThis course is designed by a team of experts in food, nutrition science and dietetics from Monash University. As researchers and clinical health practitioners, they apply the latest research to practical patient care.\n\nA valuable course for anyone interested in health and nutrition\n\nThis course will have broad general interest appeal to everyone interested in food, nutrition and health. But it will be of particular interest to healthcare professionals who are looking to have more evidenced-based information, to assist them in providing food-based recommendations to their patients.\n\n\n                                    ", "end_date": "2016-05-23T00:00:00Z", "title": "Food as Medicine", "price": 0, "instructors": "Helen Truby", "institution_name": ["Monash University"], "commitment": "4 hours", "subject_name": ["Health & Medicine"], "course_url": "http://www.futurelearn.com/courses/food-as-medicine?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-05-02T00:00:00Z"}