{"selfpaced": false, "topic_name": ["Nutrition & Wellness"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/chronicpain\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/chronicpain-003/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    chronicpain-001\n                                                                    chronicpain-002\n                                                                    chronicpain-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Chronic musculoskeletal pain (including head, neck, and back pain) is a significant cause of suffering, disability, and health care in the world. Care for chronic pain often involves surgery, multiple medications (including opioids), endless physical and chiropractic therapy, injections, implanted devices, and other passive treatments-- making it the highest cost condition in health care. The burden upon individuals in terms of ongoing pain and suffering is incalculable.Consider an alternative. By using a human systems approach, we can better understand how individual risk factors in the cognitive, behavioral, physical, emotional, spiritual, social, and environmental realms of our lives can interact to perpetuate chronic pain and, if improved, can prevent it.  During this course, you will: Identify the problems of our health care system in dealing with chronic pain. Review the diagnosis, mechanisms, and etiology of chronic pain conditions. Explore specific risk factors that can contribute to chronic pain. Learn how a human systems approach can be applied through evidence-based self-management strategies to prevent chronic pain. Experience active strategies designed to enhance the protective factors that can transform our own lives, and those of our patients, to one of health and wellness.This course was first offered in 2014. The course evaluations were carefully reviewed and the course was modified to improve its quality. Overall, 91%\nof participants believed the overall\nexperience was satisfying, 92%\nbelieved it met\nthe\nobjectives, 93%\nbelieved that it made\na\ndifference in their life, and 85% believed that it\nmade\na\ndifference in the care of\npatients. Selected comments from participants included; \"This course is one of the most generous offerings that I have ever\nencountered. There is so much life-changing,\nlife-affirming information available at no charge, to anyone who wants it,\nis rare and amazing. I am VERY grateful\nfor it.\" “The learning experience has been tremendous!! Everyone\nshould have this knowledge, especially those in the health profession.” \"I loved this class and want to take it again!\"\n\n\n\n“Absolutely\nfascinating and enlightening…This information should be part of every health\ncare educational program!” “This course has really helped me to understand\nmyself better and why I think, act and see the world as I do.” “I am eternally\ngrateful for taking the time and energy to provide this beacon of knowledge to\nthe world.” “I think this course is a wonderful gift, because pain is an avoidable\npart of our life. I have learned so many things.”We hope you enjoy the course and, of course, learn how to prevent chronic pain.\n\n                                            Syllabus\n                        Part  A:  Putting chronic pain in contextIntroduction to the courseThe health care dilemma of chronic painThe personal impact of chronic painThe balance between health and illness Part B: Tracing the mechanisms of painMyofascial painHeadacheFibromyalgiaArthritisTemporomandibular and orofacial painCurrent concepts of chronic pain mechanisms Part C: Preventing pain in the 7 realms of daily lifeResilience, self-efficacy, &amp; expectationExercise, posture, &amp; reducing physical strainPositive relationships &amp; social supportCreating safe and protective environmentsManaging emotional challengesDiet, sleep, &amp; energyGaining insight, hope, &amp; purpose Part D: Bringing it all together to help the patientThe patient’s story: foundations for clinical reasoningImplementing transformative health careImproving the health care system\n                                    ", "end_date": "2015-11-30T00:00:00Z", "title": "Preventing Chronic Pain: A Human Systems Approach", "price": 0, "instructors": "James Fricton", "institution_name": ["University of Minnesota"], "commitment": "2-4 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/course/chronicpain", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-09-21T00:00:00Z"}