{"selfpaced": false, "topic_name": ["Nutrition & Wellness"], "description": "\n\n                    \n                    \n                    Population ageing is occurring in nearly every country around the world. This MOOC takes a multidisciplinary approach to explore the impact of living longer and takes into account the technological advancements, the built environment, economics and ethics to rethink what it means to 'age well' now and in the future.\n\nRethinking Ageing is a uniquely designed course to give you a broad overview of the many complex issues involved as we as individuals get older and on the macro-level for population ageing. You may already have a particular interest in one discipline, such as mental health and ageing or age-friendly design. We encourage you, though, to use this course to explore the other perspectives on population ageing as the modules build on each other.\n\n                                            Syllabus\n                        Worldwide population ageing trendsThe course begins with the big picture when it comes to global population ageing over the 21st century. Together we explore from both a social policy and demographer perspective what is actually happening to our current and projected lifespans. The video lectures start with Tara Sklar providing an overview for the course and the key staff involved. She is followed by Professor Simon Biggs and he presents the social, cultural and intergenerational issues to consider in population ageing. Dr Rebecca Kippen then takes us through a series of lectures where she highlights demography tools and reliable, free data sources for measuring population ageing. Both Professor Biggs and Dr Kippen are attempting to better understand the trends over the 21st century and make evidence-based predictions for the future. These lectures will form the foundation for topics to come in the later weeks as well as your first assessment, so please take the time to watch them and then participate in the related discussion board forums so we can hear from you and you can meet each other. Week one concludes with whether there are limits to future increases in life expectancy. Particularly, since some argue the current generation of children in western countries are the unhealthiest ever to live with their high rates of Type 2 Diabetes and inactivity. Will they live longer than the previous generation?Lifelong participationThere are a myriad of ways people continue to participate in their later years. Week two dives into the physical and psychological changes that are more common in later life and how the gains in technology advancements enable people to be active, independent and socially connected to support lifelong participation.  We move from the population perspective covered in week one and consider your individual health status and the factors that influence how you age, such as the type of work you do, your environment, current health conditions and daily activities. Associate Professor Louisa Remedios and Dr Debra Virtue from Physiotherapy, along with Dr Eleanor Curran from Psychiatry explore what typically happens to bodies and minds during the ageing process and practical strategies to help bodies and minds age well. Related to this – Professor Fernando Martin-Sanchez will discuss recent technology advancements that will enable people to be active, independent and socially connected in later life.Planning and design for an ageing populationThis week highlights the planning and design principles for an age-friendly environment for housing, retirement communities and health care settings. We showcase information technology software, such as mapping and data visualisation to identify population trends and make evidence-based projections.  Associate Professor Clare Newton and Professor Alan Pert want you to ask 'What next? What if?' when it comes to the role of the built environment for the health and wellbeing of an ageing population. For example, to consider how the design of hospitals might change so that they are extended into communities and bring the hospital to the patient rather than the patient to the hospital. We also take an alternative approach with the traditional power point lectures in the fourth video, and have Professor Alan Pert interview architect Allen Kong about his work in designing for older residential communities. In the last two video presentations Dr Jack Barton from the Australian Urban Research Infrastructure Network (AURIN) shows you how to use freely available data sets to map data in order to address a number of issues that face an older population. Economics of ageingIn this week, Professor Ian McDonald explores private and public support for older people with examples from Australia and other parts of the world.  He covers the major sources of risk that make decision-making and planning for our later years difficult, including financial, longevity and health risks as well as suggests ways to manage these risks. Professor McDonald also focuses on the shortcomings in individual decision-making and increasing fiscal pressures on government. Economic planning for the future is complex, with significant uncertainty around productivity, employment, health, technology and pension projections. Irrespective of your age, we are all facing issues concerning how to optimally prepare for our longer lifespans.Ageing wellIt is a common sentiment that we all want to live longer, but we don't want to get older...These seemingly conflicting thoughts reflect some of the ideas Associate Professor Briony Dow and Dr Dominique Martin will cover in Week 5. This week takes a thoughtful approach on the broad societal issues and ethical questions involved in what means to 'age well.' Briony begins the week with perceptions of ageing and how they are changing, especially as we continue to live longer. For example, is 60 the new 40? What do these changes in perception of ageing mean for intergenerational relationships and how we value older people?  Dominique includes in her video lectures a series of folk tales from around the world that include strong imagery describing how we treat and value older people. She concludes with a common dilemma for older people in regards to deciding where to live and the ethical issues involved with that decision.  The provocative questions raised by Briony and Dominique culminate in an overarching idea they would like you to consider, 'How ought we to live and act in order to age well and sustainably as individuals and together?'\n                                    ", "end_date": "2016-07-31T00:00:00Z", "title": "Rethinking Ageing:  Are we prepared to live longer?", "price": 0, "instructors": "R Moodie, T Sklar, S Biggs, R Kippen, L Remedios, D Virtue, E , F Sanchez, A Pert, C Newton, C Pettit, J , I McDonald, B Dow and D Martin", "institution_name": ["University of Melbourne"], "commitment": "3-4 hours", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/learn/ageing", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-26T00:00:00Z"}