{"selfpaced": false, "topic_name": ["Nutrition & Wellness"], "description": "\n\n                    \n                    \n                    Physical inactivity and sedentariness are “silent killers”. Do you feel like you spend too much time sitting? Do you feel like you would like to be more active?  Are you unsure about how to incorporate physical activity into your daily life? We are here to help. \n\nJoin us on a journey to learn about how to sit less and become more active.  Use this FREE course to learn how to monitor your own activity and set physical activity goals. We will feature various examples of how physical activity could be increased in different settings, such as your neighbourhood, home or work, to give you ideas of ones that could best fit your lifestyle. \n\nAre you a health professional? Use this opportunity to learn how to incorporate physical activity into your daily routine and also how to empower your patients to be more physically active. If time with a patient is an issue, you can simply “prescribe” this course to your patient. \n\nThis course offers you a unique opportunity to receive weekly physical activity health messages and monthly video-reminders on how to increase physical activity in various settings for 6 months after the initial 3 week course. So, join us on the Sit less, get active! journey.\n\nFollow us on Twitter @GetActive MOOC #GetActiveMOOC.  Also, visit our YouTube channel to check out the promo videos (more are to come) https://www.youtube.com/channel/UC6xpBMzJXnffdUaY32-zPdA \nIf YouTube is not available in your country, you can access the promo videos here https://media.ed.ac.uk/search/searchkeyword/sit%20less%20get%20active\n\n                                    ", "end_date": "9999-12-31T23:59:59Z", "title": "Sit Less, Get Active", "price": 0, "instructors": "Danijela Gašević, Graham Baker and Andrew Murray", "institution_name": ["University of Edinburgh"], "commitment": "", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/learn/get-active", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-30T00:00:00Z"}