{
    "selfpaced": false, 
    "topic_name": [
        "Course Development"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Education &amp; Teaching\n                                                                                                    &gt; Course Development\n                                                            \n                            \n                                                \n                    \n                    \n                    This is the second part of the Blended Learning Essentials course, which will build upon the content of the first part, covering issues such as learning from experience and tackling difficult challenges with the help of blended learning.\n\nIf you are working in further education, skills training, vocational education, workplace learning, lifelong learning or adult education, the course is designed to support you as a professional who wants to use blended learning to make more effective use of technology to support your learners.\n\nBy the end of the course, you’ll be able to:\n\n\n  \n    integrate new technologies into courses, and learning and training opportunities;\n  \n  \n    propose ways in which new technology can help to address key challenges in the VET sector;\n  \n  \n    develop your own skills further and contribute to the sector’s community knowledge of the optimal uses of blended learning.\n  \n\n\nThis course has been created with the generous funding of the Ufi Charitable Trust.\n\nLearn together with your colleagues in the vocational education and training sector\n\nThis online course will be supported by a group of dedicated Digital Champions. They will help you connect with teaching and training professionals who understand the practical, everyday challenges of using blended learning in your sector. This way you will have access to colleagues with the experience to answer questions, to discuss ideas and share problems.\n\nStart learning with part 1: Getting Started\n\nThis course is run in two parts. Ideally, to take the Embedding Practice course, you will have previously taken the Getting Started course, although it is not essential.\n\nAccreditation\n\nThe course offers peer assessment of assignments and the curriculum is mapped to accreditation frameworks including CMALT.\n\nAs a course participant you have a number of ways to gain professional recognition and accreditation for participating in the course and as a next step in your professional development including:\n\n\n  \n    FutureLearn Statement of Participation and certified CPD hours for all participants who complete the course;\n  \n  \n    Accreditation via professional bodies for participants who seek wider recognition of their professional practice;\n  \n  \n    Paths to post-graduate qualifications for participants whom the course inspires to further study. For full information, please see the guide for participants.\n  \n\n\n\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Blended Learning Essentials: Embedding Practice", 
    "price": 0, 
    "instructors": "Neil Morris and Diana Laurillard", 
    "institution_name": [
        "University of Leeds"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.futurelearn.com/courses/blended-learning-embedding-practice?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}