{
    "selfpaced": false, 
    "topic_name": [
        "Course Development"
    ], 
    "description": "\n\n                    \n                    \n                    This course is intended for teachers and other educational professionals interested in competence-based education. The course aims to provide you with a thorough introduction to the topic, as well as make you aware of the issues and challenges related to making competence-based education a reality in the classroom. Furthermore, teachers will be given concrete tips on how to implement project-based learning, a particularly suitable method for delivering competence-based education, as well as on how to assess this type of collaborative learning.\r\nModule 1 will provide you with an introduction to the topic, looking at the importance and definition of competences as well as international frameworks; how competences are understood, expressed and implemented in various countries across Europe; and the main teaching and assessment methods associated to this approach.\r\nModule 2 will look at practical ways in which teachers can use project-based learning techniques in the classroom and beyond to develop their pupils’ competences across a variety of subjects and skills. Inspiring examples from across Europe will be provided, and possible solutions to challenges explored. There will be a special focus on how to best develop students' collaborative problem-solving skills within project-based learning.\r\nFinally, Module 3 will help you understand the assessment methods which are most suitable to competence-based approaches to learning, and will provide you with concrete advice on how to implement these various methods and in which contexts. An Irish case study will provide participants with an inspiring example of how Ireland introduced competence-based assessment in Mathematics. This module will also give participants the opportunity to learn more about assessing an important transversal skill explored in module 2 - collaborative problem solving.\r\nThis course has been designed to improve your competences, so that you can in turn develop those of the young people you teach, work with or on behalf of.\r\nThe material within this course has mainly been developed on the basis of the work produced by KeyCoNet - the European Policy Network on Key Competences in School Education, managed by European Schoolnet, and funded by the European Commission.\r\nYou can follow us and share your ideas about the course on Twitter, using #21skillscourse. You can also join in on the discussion via our LinkedIn group on key competences in school education.\r\nWe look forward to welcoming you to the course, and we hope you are as excited as we are aboutstarting this learning journey together. \n\n                                    ", 
    "end_date": "2014-12-08T00:00:00Z", 
    "title": "Competences for 21st Century Schools", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "European Schoolnet Academy"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.europeanschoolnetacademy.eu/web/keyconet", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2014-11-17T00:00:00Z"
}