{
    "selfpaced": false, 
    "topic_name": [
        "Course Development"
    ], 
    "description": "\n\n                    \n                    \n                    \r\n\r\n\r\nJoin us on this 5 week journey of exploration into the world of tablets in schools.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nTablets with their simple interface, portability, speed, affordability and their variety of apps are quickly moving into schools across Europe and a growing number of teachers are experimenting with tablets or are interested in doing so.\r\nHowever, most of us are faced with the same questions: What rules do I need to set for the use of tablets in class? How do I deal with related administrative and technical issues? How can tablets support innovative approaches such as personalized or collaborative learning? This course does not only provide guidance on these topics but also provides a forum for you to exchange with your peers on these questions.\r\nThe course aims to inspire to use tablets to foster innovative teaching and learning. In four modules it provides a general introduction to the use of tablets in schools (Module 1) and then discusses how tablets can support new learning approaches such as content creation, collaborative learning, personalized learning and the flipped classroom model (Modules 2, 3, 4).\r\nWhile the course will be in English, it will be supported by national course ambassadors who can provide support in your national language throughout the course. Please note that unfortunately there is not an ambassador for every EU country available. Take a look at their profiles further below to see if there is an ambassador for your country (click on their picture to see their profile). \r\nThe course will be followed-up with a briefing for policy makers from national Ministries of Education where your views and ideas shared on this course will be presented. The course will therefore be a great opportunity to provide feedback to policy makers on the kind of support teachers need to successfully integrate tablets in their teaching.\r\nSuccessful completion of the course will be certified using digital badges and a digital certificate.\r\nEnroll now and help us spread the news by tweeting #tabletscourse and joining our Facebook group at https://www.facebook.com/groups/CreativeClassrooomsLab/\r\n\r\n\r\n\r\n\r\n\n\n                                    ", 
    "end_date": "2015-05-18T00:00:00Z", 
    "title": "Creative use of Tablets in Schools", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "European Schoolnet Academy"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.europeanschoolnetacademy.eu/web/tablets-in-schools", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-04-13T00:00:00Z"
}