{
    "selfpaced": false, 
    "topic_name": [
        "Course Development"
    ], 
    "description": "\n\n                    \n                    \n                    L’objet de ce cours est l’utilisation innovante du numérique dans l’enseignement / apprentissage des langues, vue à travers quatre approches : les formations hybrides en langues, la télécollaboration, les outils de l’intercompréhension, l’exploitation du web social.Les objectifs de ce cours : découvrir quatre approches innovantes d'enseignement-apprentissage des langues permises par le numériquecomprendre les atouts et les limites de ces approchesintégrer l’une ou l’autre de ces approches pour une mise en œuvre future dans votre pratique pédagogiquepartager vos expériences et vos idées pédagogiquesA l'issue de ce cours, vous devriez avoir une connaissance basique de ces approches, en comprendre les atouts et les limites et être capables d’envisager leur adoption dans votre contexte pédagogique. Une place importante sera accordée à la mutualisation des expériences et des idées pédagogiques.Nous vous invitons à nous retrouver sur Google+ ou sur Twitter pour suivre l'évolution du cours.\n\n                                            Syllabus\n                        Semaine 1 : les formations hybrides en langues - pour conduire vos apprenants à effectuer une partie de leurs apprentissages à distance, à l'aide d'environnements numériques.Semaine 2 : la télécollaboration - faire interagir via internet des apprenants de langues et cultures différentes.Semaine 3 : les outils de l'intercompréhension - permet au lieu d'apprendre une langue unique, de développer sa compréhension de plusieurs langues.Semaine 4 : l'exploitation du web social - afin d'offrir des contextes authentiques pour la production langagière.\n                                    ", 
    "end_date": "2015-11-30T00:00:00Z", 
    "title": "Enseigner et former avec le numérique en langues", 
    "price": 0, 
    "instructors": "Christian Degache", 
    "institution_name": [
        "Université Paris-Saclay"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/ENSCachan/20006S02/session02/about", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-11-02T00:00:00Z"
}