{
    "selfpaced": false, 
    "topic_name": [
        "Course Development"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso é oferecido pelo Google em parceria com a Fundação Lemann e a Foreducation, e tem como objetivo apresentar a educadores possibilidades de uso das tecnologias do Google para aumentar a eficiência, a inovação e a personalização do ensino. O conteúdo está dividido em cinco módulos:\n\n1. Visão geral: entenda a estrutura do curso e confira dicas para obter sucesso na sua estratégia de estudo.\n2. Pesquisa e comunicação: busque recursos online e divulgue informações para a comunidade escolar.\n3. Criação e compartilhamento: crie documentos online e incentive a colaboração usando ferramentas de edição de texto, planilhas, apresentações e formulários de pesquisa.\n4. Melhorar a experiência em sala de aula: utilize ferramentas online para melhorar a comunicação e aspectos visuais nas aulas.\n5. Saiba mais: encontre links e conteúdos interessantes de assuntos relacionados ao uso de tecnologia em sala de aula.\n\nCada módulo contém um vídeo de introdução seguido de tópicos que exploram casos práticos de como educadores podem fazer o melhor uso das  tecnologias do Google  em sala de aula. Em seguida, os módulos apresentam um passo a passo sobre como realizar tarefas básicas com a ferramenta indicada e links para aprofundamento. Como conclusão de cada etapa, teremos atividades para praticar as habilidades adquiridas e discussões em fóruns para compartilhar experiências e obter feedback de outros cursistas. \n\nPronto para começar? Desejamos um excelente curso!\n\n                                            Syllabus\n                        Visão Geral do CursoEste módulo apresenta a estrutura do curso e sugere dicas para você obter sucesso na sua estratégia de estudo online.Pesquisa e ComunicaçãoAprenda a encontrar materiais de referência usando a Busca, a engajar a sua classe utilizando vídeos do YouTube, a explorar recursos online usando o Chrome, a publicar informações usando Google Sites, a contatar pais e alunos com o Gmail, a programar o seu período letivo usando o Google Agenda e a explorar maneiras de aproximar a sua escola ou região com os Grupos do Google.Criação e CompartilhamentoNeste módulo você irá explorar como armazenar arquivos e registros usando o Google Drive, colaborar com colegas e alunos usando Documentos Google compartilhados, criar e compartilhar apresentações para aulas, organizar dados da turma usando Planilhas, coletar dados da turma usando Formulários.Melhore a Experiência em Sala de AulaO último módulo apresenta outros recursos úteis que podem ajudar o professor a melhorar a experiência dos alunos em sala de aula fazendo, por exemplo, vídeo conferências com pais, professores e alunos usando Hangouts, aproximando os grupos da escola com as comunidades do Google+, mostrando o mundo para sua turma com o Google Maps, levando a classe para o Museu usando o Instituto Cultural do Google e também aprimorando a gestão da sala de aula com o Google Classroom.Saiba maisAqui você encontrará outros assuntos e projetos interessantes relacionados ao uso da tecnologia em sala de aula. \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Fundamentos do Google para o Ensino", 
    "price": 0, 
    "instructors": "Augusto Portugal and Artur Jovanelli", 
    "institution_name": [
        "Fundação Lemann"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/learn/fundamentosgoogle", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}