{
    "selfpaced": false, 
    "topic_name": [
        "Course Development"
    ], 
    "description": "\n\n                    \n                    \n                    \r\n\r\n\r\n\r\n\r\nJoin us in this exciting MOOC for teachers exploring the potential of games-based learning in schools. The course will examine the opportunities but also challenges offered by integrating games into our teaching and learning and will provide practical examples of gaming tools and activities to use in your daily teaching practice. We will be learning through a mix of video, interactive activities and discussions as well as sharing of resources.\r\nThe first question we will explore is, why use computer games in schools? We will then look at a range of games which do not necessarily have an educational purpose but can be used nicely for thematic learning on topics such as gravity, planets, construction, and many others. However, we will also explore games that have an explicit pedagogical focus and are designed to help students learn anything from Maths to Languages. Game mechanisms can be powerful motivators to succeed at a task, so we also ask the question, what can we learn from games for our teaching. And rather than just have students using games we will introduce a range of tools that you can use to get your students to design games, learning important skills such as coding, design, and creativity along the way. Finally, we address why it is important to teach about games, highlighting issues such as privacy, safety but also the cultural impact of games.\r\nThe course is presented by Ollie Bray, a former teacher and current school principle who has received numerous awards for his work in the field of technology enhanced learning. For more information about Ollie, click on his picture on the right.\r\nThe course is being run jointly by European Schoolnet and ISFE (The Interactive Software Federation of Europe) and is entirely free. It is open to anyone who is interested in the topic but is primarily aimed at practising teachers.\r\nJoin us already in the Games in Schools Facebook Group or share your ideas about the topic using#gamescourse\r\n\r\n\r\n\r\n\r\n\n\n                                    ", 
    "end_date": "2016-05-30T00:00:00Z", 
    "title": "Games in Schools", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "European Schoolnet Academy"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.europeanschoolnetacademy.eu/web/games-in-schools-3rd-round", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2016-04-18T00:00:00Z"
}