{
    "selfpaced": false, 
    "topic_name": [
        "Course Development"
    ], 
    "description": "\n\n                    \n                    \n                    Sie möchten Ihre Schule hin zu einer Lernkultur der Potenzialentfaltung transformieren, benötigen aber noch ein paar Hilfestellungen auf dem Weg? Sie möchten sich mit anderen Personen austauschen und verbinden, die ebenfalls beschlossen haben, ihrer Vision Taten folgen zu lassen? Sie möchten lernen, was alles möglich und denkbar ist, wenn man sich auf den Weg macht, die eigene Schule neu zu gestalten?\r\nDieser Kurs richtet sich in erster Linie an Mitglieder von Schul- bzw. Lerngemeinschaften, die etwas verändern wollen und diese Veränderung selber mitgestalten möchten: LehrerInnen, Eltern, ältere SchülerInnen, SchulleiterInnen, SozialarbeiterInnen, ReferendarInnen, etc. Die Inhalte sind jedoch auch auf andere Organisationsformen übertragbar, wenn eine Transformation von innen hin zu mehr Potenzialentfaltung der Mitglieder angestrebt wird. Der Kurs bereitet auch Lehramtsstudierende auf die Aufgaben vor, die sie neben der Lehre an ihrer zukünftigen Schule erwarten werden.\r\nWas lerne ich in diesem Kurs?\r\n\r\nVeränderungen selber gestalten\r\nProzesse verstehen und moderieren\r\nVerständnis von Potenzialentfaltung vertiefen\r\nAllein anfangen und Bündnisse bilden\r\nZusammenarbeit gestalten\r\n\r\nWelche Vorkenntnisse brauche ich für diesen Kurs?\r\nEs sind keinerlei Vorkenntnisse notwendig, nur der dringende Wunsch, Schule mitzugestalten.\r\nArbeitsaufwand\r\n\r\n3-5 Stunden pro Woche\r\n\r\nErhalte ich ein Zertifikat?\r\n\r\nTeilnehmer erhalten nach Beendigung des Kurses eine kostenfreie Teilnahmebescheinigung. Hierzu müssen 80% der Videoeinheiten sowie 80% der Quizzes absolviert werden.\r\nTeilnehmer können außerdem ein Zertifikat erwerben, wenn Sie alle 36 Aufgaben bearbeiten.\r\n\n\n                                    ", 
    "end_date": "2014-06-14T00:00:00Z", 
    "title": "Meine Schule transformieren – ein Reiseführer", 
    "price": 0, 
    "instructors": "Prof. Dr. Stephan Breidenbach", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://iversity.org/courses/meine-schule-transformieren-ein-reisefuhrer", 
    "duration": "12 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2014-03-22T00:00:00Z"
}