{
    "selfpaced": false, 
    "topic_name": [
        "Course Development"
    ], 
    "description": "\n\n                    \n                    \n                    Why use film to teach literacy? This free online course, led by film education experts from the British Film Institute (BFI) and film education charity Into Film, will examine the debate surrounding film as a vehicle for teaching literacy, alongside recent evidence demonstrating significant improvements in children’s reading and writing through use of film texts.\n\nWe’ll discover how film can be used to develop a range of abilities - decoding, inference and analysis - as well as expanding creativity and improving vocabulary.\n\nDiscover inspiring ways to teach literacy\n\nOver four weeks, you’ll explore a range of strategies and frameworks that you can use to engage and inspire young people when teaching literacy, and improve their progress and levels of attainment in both reading and writing.\n\nYou’ll have the opportunity to share best practice, download classroom-ready resources, including how-to guides, activities and worksheets, and access an exclusive playlist of short films and clips to use in school.\n\nWe will also discuss the benefits of creating film content in the classroom and how this can be used to aid deep learning, which is more easily retained. You’ll have the opportunity to make your own short film for use in the classroom, which can be shared with fellow educators on a YouTube playlist.\n\nJoin a supportive community of literacy teachers\n\nThe course is open to anyone worldwide, so that you can share ideas and best practice with other literacy teachers around the globe, providing a rich, cultural learning experience.\n\nIn discussions, we’ll ask you to give feedback on the activities you’ve been trying out in class, so that you benefit from real-time tutoring from our expert educators.\n\nAnd if you’re a UK educator working with young people aged 5-19, you can follow up this course with free face-to-face training from Into Film.\n\nYou can find out more in Jennifer Johnston’s post for the FutureLearn blog: “Why use film to teach literacy?”\n\n\n                                    ", 
    "end_date": "2016-06-20T00:00:00Z", 
    "title": "Teaching Literacy Through Film", 
    "price": 0, 
    "instructors": "Diane Evans", 
    "institution_name": [
        "The British Film Institute"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.futurelearn.com/courses/teaching-literacy-through-film?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-23T00:00:00Z"
}