{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<ul><li><strong>Kurs online seit: </strong>Februar 2016</li><li><strong>Letztes Kurs-Update:</strong> 21.02.2016</li><li>Es sind \"Free Preview\" Lektionen verfügbar.</li></ul><p><br>Dieser Kurs richtet sich an unerfahrene Einsteiger in die Musikproduktion oder an Nutzer von anderen Programmen, die Ableton Live kennenlernen wollen. Ableton Live ist eine moderne Software, die einige einzigartige Features und Funktionen enthält und mit einem zeitsparenden Workflow aufwarten kann.</p><p>Im Zuge der Lektionen der erste Kurshälfte wird die Benutzeroberfläche erforscht, wichtige Einstellungen erklärt und getroffen und die unterschiedlichen Konzepte von Arrangement- und Session-Modus beleuchtet. Dabei werden die Teilnehmer schnell zu Kennern der Software und müssen (außer einem geeigneten Computer) nichts in den Kurs mitbringen um Audio- und MIDI-Daten aufzunehmen und zu bearbeiten.</p><p>In der zweiten Hälfte wird es kreativ: Die Teilnehmer probieren das neu erworbene Wissen an einem Beispielprojekt aus, einerseits zur Kontrolle, andererseits aber auch, um mit eigenen Ideen auf den gelernten Techniken aufzusetzen. Das Speichern, Verwalten und Exportieren von Projekten rundet den Kurs ab.</p><p>Der Kurs ist in ca. 3 bis 5 Stunden zu bewältigen, je nachdem, wie viel Zeit für die praktischen Aufgaben aufgewendet wird. Am Ende der Lektionen haben die Teilnehmer gute Kenntnisse der wichtigsten Funktionen von Ableton Live und können auf diesem Wissen aufbauen!</p>", 
    "end_date": null, 
    "title": "Ableton Live - Einstieg in die Musikproduktion", 
    "price": "25.00", 
    "instructors": "Marc \"Selec\" Zimmermann", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680760_f549_3.jpg", 
    "course_url": "https://www.udemy.com/ableton-live-grundlagen/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T18:34:29Z"
}