{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong style=\"\">Get started using Audacity</strong> - even if you&#039;ve never used the software before! We&#039;ll start by walking you through how to download and install the program, move on to the layout and functions of the software, then move into some of the most essential and basic functions of this powerful audio editing tool.</p><p><strong style=\"\">This course is for:</strong><span></span></p><ul style=\"\"><li>Those who want to learn the basics of audio editing</li><li>Those who want to start a podcast but don&#039;t know how to record or edit audio</li><li>Those who need to learn the basics of good audio editing technique - and how to do it</li><li>Anyone who wants to master the skills needed to eventually become an audio editor</li></ul><strong style=\"\">Video instruction with a &quot;see it done - then you do it&quot; structure</strong>Screen capture videos will show you how to do every function, each step of the way. Assignments will guide you to do what you just learned to embed the skills in your mind. It&#039;s up to you to keep practicing until you are proficient.<strong style=\"\">I can learn to be a &quot;professional&quot; audio editor using this software?</strong>Seriously, Audacity is used by many professional audio editors and is extremely powerful in what it can do. You&#039;ll go from step one all the way to being a skilled user of the software if you walk through these videos and put the skills into practice.", 
    "end_date": null, 
    "title": "Audacity For Podcasting - Bachelor Level", 
    "price": "20.00", 
    "instructors": "Carey Green", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557478_a249_3.jpg", 
    "course_url": "https://www.udemy.com/afpbachelor/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T20:22:46Z"
}