{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>\"Audacity Tutorial: Learn How to Edit Audio Files\" is a quick crash course that teaches the fundamentals of editing audio in Audacity in an easy to understand format.</p>\n\n<p>After completing the course you will have a great understanding of:</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>What Audacity is</li><li>How to navigate and operate the software</li><li>How to edit audio files</li><li>How to edit audio from video footage</li><li>How to fix bad audio</li><li>How blend audio with music</li><li>Various audio formats</li><li>The proper settings to get the best quality</li><li>And more!</li></ul>\n\n\n\n\n\n\n\n\n\n<p><em>You will now be able to offer high quality audio for podcasts, udemy courses, tedex,  speeches, sermons, and more with these professional editing techniques! </em> Stop wasting your valuable time searching the internet for the right material and get everything you need to edit and improve audio files easily in Audacity in this step by step tutorial course!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Enroll Today!</p>\n\n\n\n\n\n\n\n<p>All these reviews were copied from the course reviews below.</p><p><em>\"Good course. Very informative info. All vids are downloadable, which is always a big plus to me. Well worth it...\"</em> - Reggie Spigner<br></p>\n\n\n\n\n\n\n\n<p><em>\"The course was well explained and the instructions and demonstrations were easy to follow. I was able to chop up and edit sounds in Audacity as I followed this course very easily.  The instructor is a nice down to earth and real guy and seems to really want to help people improve their skills. This course is recommended for beginners looking to learn how to use Audacity for their projects.\" - </em>A L<br></p>\n\n\n\n\n\n\n\n<p><em>\"Joseph is such a great instructor. He comes across well- very likeable and explains things step by step. I have just started a new career doing voiceovers and what I learned in this course has been invaluable. Recommended.\"</em> - Business Divas Academy</p>\n\n\n\n\n\n\n\n<p>See you on the other side! :)</p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Audacity Tutorial: How to Edit & Improve Audio In Audacity", 
    "price": "20.00", 
    "instructors": "Joseph Evans Jr", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427796_9ee0_14.jpg", 
    "course_url": "https://www.udemy.com/audacity-tutorials-for-beginners-learn-to-edit-audio-files/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T15:49:03Z"
}