{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>This is a class about the joy of Circuit Bending.</strong></p><p>In this class we will first talk about what Circuit Bending is, and how it works. Then, we will actually circuit bend an old keyboard from beginning to end, going <strong>step-by-step through the entire process</strong>. In the end, we will have a cool new keyboard capable of brand new sounds, and I'll even make a track with it.</p><p>This might just be the weirdest class I've ever made. In this class we will hit the road, going to some thrift shops to look for bendable instruments, I'll do some time-lapse videos of taking things apart (complete with Benny Hill), and we will melt down some Spongebob Squarepants. <strong>You will have to join the class to see how that all unfolds.</strong></p><p><strong>And of course, once you sign up for this class, you automatically get huge discounts on many of my other classes - stay to the end to find out how!</strong></p><p>You will not have another opportunity to learn Circuit Bending in a more comprehensive way that this. Start here.</p><p><em>Dr. Jason Allen is an Ableton Certified Trainer, and a PhD in Music Composition and master of Electronic Sounds. His music has been heard internationally in film, radio, video games, and industrial sound, as well as the concert hall and theater. His 2015 album, </em>Aniscorcia, <em>reaching the CMJ Top200 Charts and radio broadcasts nationwide. In 2014 he was named a semi-finalist for the Grammy Music Educator Award.</em></p><p><em>He currently as an adjunct professor of composition at the University of St. Thomas, and the CEO of Slam Academy in Minneapolis.</em></p><p><em><strong>Praise for classes by Dr. Jason Allen:</strong></em></p><ul><li><em>\"Without a doubt the best explanation and east of use that one can get. It leaves you enough room to go explore. The classes go by quick, so you can be on your way at being proficient. What are you wait for!\"<br><br></em></li><li><em>\"Amazing - Seriously Loved It! I took all his courses and have to say I'm so happy! Learnt loads! Jason is an awesome teacher!\"<br><br></em></li><li><em>\"I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going through this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.\"<br><br></em></li><li><em>\"I like these courses because you can get up and running quickly without having to spend hours of time wading through TMI (too much information!). Jason hits the high points but shows you what you need to know. Thanks!\"<br><br></em></li><li><em>\"I've watched many other videos on scales and chords before, however, this one has been the best. I now understand minor scales and chords and even how to analyze songs. It really gave me the confidence to start producing music because I feel like I have some structure and guidelines to follow. AWESOME!\"<br><br></em></li><li><em>\"Clear and Informative - Jason has a clear uncluttered style (with the important dashes of humor) of presentation that is focused on the important key aspects of this course. Recommended for those starting out!\"<br><br></em></li><li><em>\"Dr. Allen does it again with his music theory series. This course really opened up everything I learned from the 1st section, and now I understand more about the composition side of things for music. I highly highly recommend this course to anyone!!! Really opened my eyes to many things I wasn't aware of.\"<br><br></em></li><li><em>\"The Best Teacher Ever, who makes you understand the ins &amp; outs of Music Theory by all means without giving what you don't want to know.\"</em></li></ul>", 
    "end_date": null, 
    "title": "Circuit Bending: Making Music By ReWiring Devices - Intro", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743786_9586.jpg", 
    "course_url": "https://www.udemy.com/circuit-bending-making-music-by-rewiring-devices-intro/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T17:06:15Z"
}