{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">Learn your way around the Traktor remix decks so you can create amazing and unique DJ mixes to impress your fans and take your DJ career to the next level.</p><p style=\"\"><strong style=\"\">Master the Remix Decks with Ease by following this Comprehensive and Direct Video Course.</strong></p><ul style=\"\"><li style=\"\">Master the Basics of the Remix Decks</li><li style=\"\">Discover the Hidden Features</li><li style=\"\">Create your very own unique remix sets</li><li style=\"\">Find alternative ways to creatively integrate the remix decks in your DJ Sets</li><li style=\"\">Recognize the full potential of Traktor software</li><li style=\"\">Peel away the layers of confusion with ease &amp; take control of the software</li></ul><p style=\"\"><strong style=\"\">Understanding the Remix Decks Sets you apart from many other DJ&#039;s</strong></p><p style=\"\">Traktor is a very popular DJ software and is used by many professionals, knowing how to use it to it&#039;s fullest potential will give you an edge over many other DJ&#039;s. Even with the recent introduction of &#039;Stem Decks&#039; (a simpler form of the remix deck) the remix decks remain, which proves they are an important and useful part of the Traktor software. The remix decks are a little more complex than the stem decks, therefore offering you much more control and scope for being creative. By understanding the full potential of the remix decks you will develop your own unique sound, taking the next step towards blending the two disciplines of DJ&#039;ing and music production. </p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">This course is designed for those who have some experience using Traktor, but not yet ventured into, or fully grasped, the Remix Decks. </p><p style=\"\">The course is broken down into 6 sections.</p><ol style=\"\"><li style=\"\">Intro and Setup</li><li style=\"\">Functions of the Remix Decks (Part 1)</li><li style=\"\">Functions of the Remix Decks (Part 2)</li><li style=\"\">Creation</li><li style=\"\">Live Uses</li><li style=\"\">Bonus Material<span style=\"\"></span></li></ol><p style=\"\">Sections 2, 3 &amp; 4, end with a quiz to aid in your learning. Throughout the 75 videos (approximately 3 hours 20 mins) you will learn all the functions of the remix decks. Once you have mastered these functions, you will piece together these skills to create a remix set of your own. </p><p style=\"\">You will be shown, step-by-step, how to build a remix set from scratch, with the option of downloading the demo remix set so you can follow along and develop your skills as you go.</p><p style=\"\">You will be given a number of suggestions for how you can integrate the remix decks into your performance and additional bonus material to take you a little deeper into accessing your own creative talents.</p><p style=\"\">By completing the course, you will become a master of the remix decks enabling you to bring a level of individuality and creativity to your DJ sets. By fully understanding the software it frees you up to focus on the important part of DJ&#039;ing; the Music. By embracing the Remix Decks and completing this course, your DJ sets will never be the same again. </p>", 
    "end_date": null, 
    "title": "Complete Guide to the Traktor Remix Decks", 
    "price": "30.00", 
    "instructors": "Alan Churchill", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581346_7035.jpg", 
    "course_url": "https://www.udemy.com/traktor-remix-decks/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T16:54:24Z"
}