{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Este curso te permitirá crear tu propia estación de radio por internet profesional y funcional. Aprenderás todas sus configuraciones, además de cómo realizar transmisiones en vivo con el uso de diversos programas. En este curso también te mostraré cómo indexar tu estación de radio en servicios como ShoutCast y hacerla disponible en servicios secundarios como iTunes, entre muchos otros. Este curso está estructurado con un lenguaje sencillo y no es necesario tener experiencia previa al respecto. Al final tendrás una estación de radio activa y podrás hacer transmisiones en vivo a todo el mundo.</p>\n\n<p>Este curso se basa en el uso del programa CentovaCast, el cual es utilizado por millones de personas para transmitir señal de radio por internet de manera fácil y cómoda. Entre algunos de los temas importantes aprenderás a como configurar las listas de reproducción para automatizar el uso de la radio en un servidor. Esta opción es importante ya que te permitiría tener tú estación de radio activa las 24 horas del día, sin preocuparte de la programación. En las listas de reproducción se colocan los comerciales o Jingles, los cuales harán sonar tu estación aún más profesional.</p>\n\n<p>El programa de CentovaCast tiene una opción que te provee enlaces de reproducción los cuales puedes compartir no sólo en las redes Sociales, sino en un sitio Web. En este curso aprenderás a como colocar un reproductor en tu página Web y cómo agregar Widgets con las portadas de la música que se esté reproduciendo. </p>\n\n<p>Otro punto importante es indexar tu estación de radio a servicios como ShoutCast. ShoutCast en un directorio de estaciones de radio el cual está conectado con otros servicios como iTunes. Los radioescuchas podrán encontrar tu estación de radio por medio de esos servicios, y así, aumentar tu popularidad. Al final hablaremos de las licencias y cómo transmitir de manera legal. </p>", 
    "end_date": null, 
    "title": "Crear Estación De Radio Por Internet Desde Cero", 
    "price": 0, 
    "instructors": "Omar Castañeda", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/809524_c20b.jpg", 
    "course_url": "https://www.udemy.com/crear-estacion-de-radio-por-internet-desde-cero/", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-31T21:26:14Z"
}