{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong><em>Please continue reading to see how I can help you learn Garageband and improve your music in 2016.</em></strong><br></p><p><strong><em></em></strong>Don't you hate when you buy new software and it seems overwhelmingly too complicated to get started doing anything?  Well that was how it was for me when I first took a look at Apple's new and improved version of Garageband.  But after studying the software, I cracked the code so to speak, and now have a simple step by step blueprint for navigating and easily get started making beats in Garageband.<br></p><p>You will learn everything you need to make beats in Garageband like a professional music producer after taking this course.  We will cover how to find sounds, how to modify Garageband's pre-made drummer application (which is great for those who are just getting started and don't know how to make complicated drum patterns), and the complete process of making beats!</p><p>It would be best if you have at least a basic understanding of music production fundamentals before enrolling but it isn't necessary to successfully complete this course. And it is mandatory that you have a macbook pro, iMac, or some type of Apple computer before enrolling.  And don't worry about getting Garageband from the store, I'm going to show you how to download it from the App Store (The programs only 5 bucks by the way, so no excuses of why you can't get started ok).</p><p>Take the first step to living your dreams and gain the freedom to create the music that God put in your heart to create! </p><p>I am very confident in the course material and am available to answer any questions you may have about the software and making beats once you enroll.  So relax and let me show you how to unlock your creative genius using Garageband. </p><p>Click on the \"TAKE THIS COURSE\" button now, and I'll see you on the other side. </p>", 
    "end_date": null, 
    "title": "Garageband Tutorial: Make Beats in Garageband", 
    "price": "20.00", 
    "instructors": "Joseph Evans Jr", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588648_8e69_19.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-beats-in-garageband/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T17:10:43Z"
}