{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<em>Course updated on Jan 13, 2015.  \tMORE THAN 800 STUDENTS ALREADY ENROLLED!</em>  </p>  <p>  \t            Learn the basics of Garageband, from downloading and installing it, to getting your hands on new sounds, understanding its basic use, and beginning to create your own music with it.  </p>  <p><em>This course will not only teach you the basics, but also be a resource that you can continue to make use of, helping you with shortcuts and techniques.</em><br></p>  <p>  \t              This course teaches you things other courses tend to skip over, assuming you've already figured them out on your own or that they're things that can be breezed over--instead, we'll look at the basics in depth and make sure you're fluent in them and understand them.  </p>  <p>  \t              About this course:  </p>  <ul>  \t<li><em>Identify and understand all buttons and knobs required for basic Garageband use</em></li>  \t<li><em>Create a new project using the right template</em></li>  \t<li><em>Use different templates to speed up songwriting</em></li>  \t<li><em>Create the right sort of tracks for your project</em></li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and upgrades are always included for free</em></li>  \t<li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</li>  \t<li><em>Regular free surprise bonuses to improve your tracks even more!</em></li>  </ul>  <p>  \t              Enroll in this course now to learn the essentials of basic Garageband for a creative edge over other producers, engineers, and music hopefuls in the competitive world of music. Put your new understanding to work for you immediately. You will gain insight and practical understanding of how to use Garageband, and begin being able to use the software TODAY.  </p>  <p>  \t          What you learn in this course are things you can put into use immediately—your mixes can improve today!  </p>  <p>  \t              You'll learn how to  </p>  <ol>  \t<li>Identify and understand all buttons and knobs required for basic Garageband use </li>  \t<li>Create a new project using the right template</li>  \t<li>Use different templates to speed up songwriting</li>  \t<li>Create the right sort of tracks for your project</li>  \t<li>... and much, much more!</li>  </ol>  <p>  \t              So, you've read this far! Thank you.  </p>  <p>  \t<em>One final very important point</em>.  </p>  <p>  \t              You can begin using Garageband immediately—right after going through this course!  </p>  <p>  \t              Click the \"take this course\" button, top right, now ... <em>every hour you delay is setting your music career back…</em>  </p>", 
    "end_date": null, 
    "title": "Garageband: Getting Started from installation to songwriting", 
    "price": "20.00", 
    "instructors": "Stephen Frost", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392140_3e41_2.jpg", 
    "course_url": "https://www.udemy.com/garageband-getting-started/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T15:35:59Z"
}