{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Always wanted to make demos of your songs but never had the right equipment?<br>Keep on losing your best ideas because you can’t record them fast enough?<br>Want to add some background sounds and music to a podcast but haven’t found an easy App to use?<br>Don’t know how to play any musical instruments but really want to make some music?<br></strong></p>\n\n<p>If you would answer “yes” to any of the questions above, then you should know that this course will deliver the missing pieces for you. It can unlock the answers you’ve been looking for so you can explore further and enjoy yourself in the process.</p>\n\n\n\n\n\n\n\n\n\n<p>This course will introduce you to GarageBand on your iPad so you can play, create, jam and mix your own music wherever and whenever you want.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">What terminology is used?</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p>Nearly all terminology used in the course is Apple’s own. This is to keep the course in line and consistent with Apple’s official GarageBand help pages and resources.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">What materials are included?</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p>All video lectures, transcripts, links and additional help files are included in the course. Once paid for, this course is yours for life - including all future updates.</p><p>Note: The GarageBand App is Apple software and only available for Apple devices.</p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">How long will the course take to complete?</strong></em></p>\n\n\n\n\n\n\n\n\n\n<p>Because the course is structured around 10 minute videos, the pace you choose to learn at will determine how long it will take to study this subject. If you want to proceed quickly through it as fast as you can, it may only take you 2 hours. However, if you take your time, explore the things that are demonstrated and take part in the quizzes, it might take you a few days.</p>\n\n\n\n\n\n\n\n<p><strong><em>How is the course structured?</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p>Currently, the course is made up of 14 video lectures which are an average of 10 minutes long. In between lectures 4 to 12, there are quizzes that relate to the subject materials of each lecture - to test knowledge and encourage you to retain concepts and information more clearly. There is also a final quiz that tests knowledge across everything covered in the course.</p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Why take this course?</strong></em></p>\n\n\n\n\n\n\n\n\n\n<p>Set your creativity free. Unleash your potential as a songwriter, musician, DJ or producer!</p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Introducing GarageBand for iPad - completely awesome!", 
    "price": "30.00", 
    "instructors": "Paul Douglas", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/168386_801c.jpg", 
    "course_url": "https://www.udemy.com/introducing-garageband-for-ipad/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-20T03:45:13Z"
}