{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t    Are you just starting out in audio engineering? This course will cover what an audio engineer is, does, and much more. Audio engineering is a very competitive field. But don&#039;t let that discourage you if you have a passion for audio engineering. There are a ton of skills and experience needed to become a good audio engineer, and this course will get you started on some things you need to know. If you&#039;ve been going about audio engineering blindly this course will help you see things clearer. Sharing some of my 15 years of experience working in the audio industry,  I will help you get started in your career in audio engineering. Not knowing audio terms and basic knowledge in audio can make engineering very intimidating. This course is for those who are just getting into engineering and need some help getting on their feet. It focuses on the ins and outs (pun intended) of audio engineering on a beginner level. This is a power point presentation from the MIA conference I spoke at in Dallas, TX a few years ago. Everyone enjoyed it so much I thought it would be a great idea to put on Udemy for everyone to learn from. My method of teaching is straightforward and simple to make sure everything is easily understood. After this course you should be able to understand enough to take you to the next step in engineering. If you have blindly jumped into engineering this course will help you see things clearer. This course has over an hour of content and will teach you the following and more:  </p>  <ul>  \t<li>What is an audio engineer</li>  \t<li>Different types of audio engineers</li>  \t<li>DIfferent types of audio files</li>  \t<li>Sample rate</li>  \t<li>Signal flow </li>  \t<li>Audio converters</li>  \t<li>Different types cables</li>  \t<li>Troubleshooting tips</li>  \t<li>Recording tips</li>  \t<li>Choosing gear for your studio tips</li>  </ul>", 
    "end_date": null, 
    "title": "Introduction to Audio Engineering", 
    "price": "30.00", 
    "instructors": "Christopher \"Czar\" Smith", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304548_e02b_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-audio-engineering/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-21T02:16:40Z"
}