{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tEl curso da un repaso general por las ordenes y menús mas básicos, para poder generar rápidamente un proyecto musical. En el se dará un vistazo a los diferentes menús, partes y ventanas que el programa nos presenta. Se explicará de una manera rápida el contenido y la función de cada uno de los elementos, a la vez que se construye un tema musical muy básico.  </p>  <p>  \tCubase es una serie de aplicaciones informáticas para editar audio digital, MIDI y un secuenciador de música, (comúnmente conocidas como DAW - Digital Audio Workstation), creadas originalmente por la firma alemana Steinberg en 1989.  </p>  <p>  \tEste curso es impartido por Miguel Sar, artísticamente conocido como Tadeo, comenzó su andadura profesional en el año 1996, desde ese momento y hasta la actualidad viene realizando funciones de discjockey, productor, mezclador y masterizador de música. Además de poseer dos sellos discográficos, publicar mas de una veintena de discos y ser un artista de carácter internacional, en los últimos tres años viene ofreciendo varios cursos de mezcla y síntesis del sonido enfocado tanto a principiantes como a profesionales que quieren ampliar conocimientos o depurar su técnica dentro del estudio, para conseguir un sonido limpio y potente que respete las normas del rango dinámico.  </p>", 
    "end_date": null, 
    "title": "Iníciate en el secuenciador Cubase", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/182808_1178.jpg", 
    "course_url": "https://www.udemy.com/iniciate-en-el-secuenciador-cubase/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-14T22:16:32Z"
}