{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Did you just purchase or upgrade to Logic Pro X?</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are you dreading having to read the manual?</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Have you searched for Logic Pro X tutorials online but aren’t satisfied?</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Are you frustrated because its like you’re learning a new software program all over again, when all you really want to do is create music?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Well I was once in your shoes.</p>\n\n\n\n\n\n\n\n\n\n<p>I go by EvaJ Music and have been producing music for several years. I got my first introduction to Logic Pro back in 2008 when I attended Full Sail University for Recording Arts. So I became very familiar with how to create music in the program. But last year when I upgraded to Logic Pro X, I found that it was initially very frustrating to navigate the interface, access Logic Pro’s main features, and actually get back to creating music!</p>\n\n\n\n\n\n\n\n\n\n<p>So I created “Logic Pro X: Get Back To Creating Music” to help other producers and music creators like you, <strong>quickly learn the basics of Logic Pro X so you can get back to creating the music you love.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>In just over 1 hour and in 22 short lectures you will be able to:</p>\n\n\n\n\n\n<ul>\n<li>Navigate within Logic Pro X</li>\n<li>Use Key Commands to save time</li>\n<li>Fully understand Logic Pro X’s new interface</li>\n<li>Use MIDI to create your own melodies &amp; drum patterns</li>\n<li>Create your own new sounds</li>\n<li>Edit &amp; customize Logic Pro X’s Drummer Feature</li>\n<li>Use Apple Loops</li>\n<li>And several other things that will help you quickly create music</li></ul>\n\n\n\n\n\n\n\n\n\n<p>Broken down, Logic Pro X was designed to help creators produce music professionally and quickly. So in the first section is all about productivity. We will cover the basics of what this program has to offer, how to navigate, and key commands you can use to quickly operate Logic Pro X. The second section is all about functionality. So you will learn the basics of MIDI, why it is the best way to create, and how to use it to connect external devices to the program. The third section is all about sound design. So we will cover several ways to edit and save sounds found in Logic Pro X and even use the ESX24 Sampler to create your own drum kits. The last section is all about practical application. So you will learn how to record, edit, use the drummer &amp; Apple Loops to create your own music in the software. There is even a live example at the end showing you how to apply the various techniques taught in this course!</p>\n\n\n\n\n\n\n\n\n\n<p>Enroll Now! </p>\n\n<p>I'll see you on the other side!<br></p>", 
    "end_date": null, 
    "title": "Logic Pro X: Introduction to Making Beats in Logic Pro X", 
    "price": "20.00", 
    "instructors": "Joseph Evans Jr", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777992_e109_19.jpg", 
    "course_url": "https://www.udemy.com/logicprox/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T17:47:43Z"
}