{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>In this course, I will teach you how to design Trap sounds from the ground up using Native Instruments&#039; Massive virtual analog synthesizer. In the process, you will become a master of this powerful software synthesizer!</p><p><strong style=\"\">Become a pro Trap Music DJ or Producer by mastering the tricks and techniques of top Trap artists such as Flosstradamus, Bro Safari, RL Grime, Diplo, DJ Snake, and more.</strong><br style=\"\"></p><p>Using 44 high definition video lectures, I will show you exactly how producers and DJs build Trap patches using Massive.</p><p>I will teach you how to design dirty basses, huge leads, powerful plucks, trap drums, crazy FX patches, and much more. </p><p>At the end of this course, you will be able to:</p><ul style=\"\"><li style=\"\">Understand the building blocks of specific sounds</li><li style=\"\">Imagine a sound and design it from the ground up</li><li style=\"\">Choose wavetables and oscillator modes</li><li style=\"\">Set up different filter routings</li><li style=\"\">Create modulation routings including sidechaining modulation</li><li style=\"\">Control the signal flow of your patch</li><li style=\"\">Set up insert and master FX</li><li style=\"\">Set up the noise generator and feedback controls</li><li style=\"\">Building and categorizing macro controls</li><li style=\"\">and much more!</li></ul><p><strong style=\"\">You will learn how to be a Trap Music Producer by mastering Native Instruments&#039; Massive.</strong></p><p>I&#039;ll walk you through designing more than 40 trap patches step-by-step. Using plain english, I will show you exactly how to design patches used by professional DJs and Producers for their tracks. For each lecture, I&#039;ll also include the Massive preset file we create together for your reference or for use in your own productions. </p><p>That means you&#039;ll get <strong style=\"\">more than 40 <em style=\"\">FREE</em> Massive presets!</strong></p><p>I&#039;ll also provide several <strong style=\"\">bonus lectures</strong> showing you how to apply modulation to your patches inside your host DAW as well as sampling vocals. </p><p>If you have ever wondered how Trap artists create sounds, this course will show you exactly that.</p><p>If you&#039;re just getting started with Massive, you will feel right at home with this course. If you are a more experienced producer, you will learn tons of new tricks and techniques I&#039;ve developed over the years. </p><p><strong style=\"\">You will be able to do things with Massive you never imagined possible.</strong></p><p>After taking my course, you&#039;ll be able to call yourself a pro Trap producer. Plus you&#039;ll receive a verifiable certificate of completion from Udemy, showing your new expertise. </p><p>If you want to make Trap Music with Massive, this course is for you.</p><p>Let&#039;s Go!</p>", 
    "end_date": null, 
    "title": "Massive Trap Tutorial: Design Trap Sounds with Massive ", 
    "price": "20.00", 
    "instructors": "Dylan Bowes", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399722_11da_7.jpg", 
    "course_url": "https://www.udemy.com/massivetraptutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T03:56:07Z"
}