{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t        In today’s digital era, the computer is now an instrument. Whether it is used as a medium to create music or a supplemental tool to produce music, there is no doubt the computer is an essential tool for any aspiring musician or hobbyist.  </p>  <p>  \t        This is where the course comes in. BeatsBlueprint is a step by step beginner level video series course on music production. There is no pre-requisite knowledge required. The goal is to not only teach students how to tap into the potential of a computer, but also, to help facilitate the creative process for students to craft his or her own sound. Using the digital audio software, Ableton, as a medium, students will learn the technical concepts of music theory and how to apply their knowledge to create music across a span of genres.  </p>  <p>  \t        What sets Beatsblueprint apart is our project based approach. By the end of the course, <strong style=\"\">the student will be able to create his or her own track from start to finish.</strong>  </p>  <p>  \t        In order to complete the course, you must have access to Ableton. Ableton is a powerful software music sequencer and digital audio workstation. It offers a generous demo that allows you to access and utilize it’s full range of tools completely <strong style=\"\">FREE</strong>. After 30 days, however, the trial ends. However, this <strong style=\"\">does not mean</strong> you stop making music. BeatsBlueprint specifically designed this course to work across a variety of platforms. Music theory is music theory. Production is production. Regardless of what you choose to use, your knowledge can be adapted to any music software.  </p>  <p>  \t<em style=\"\"><strong style=\"\">---------------------------------------------------------------------------------------------------------------------</strong></em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">WHAT&#039;S INSIDE:</strong></em>  </p>  <p>  \t<span style=\" color:inherit;\"><strong style=\"\"><em style=\"\"><u style=\"\">Audio Design</u></em></strong></span>  </p>  <p>  \t         Variety is the spice of life. From pop to house, dubstep to hip pop, learn fundamental      concepts to create music from an array of genres.  </p>  <p>  \t<span style=\" color:inherit;\"><em style=\"\"><strong style=\"\"><u style=\"\">Music Theory</u></strong></em></span>  </p>  <p>  \t         Take the guesswork out of producing. Learn basic structures of scales, chords, and         rhythms to craft smooth melodies.  </p>  <p>  \t<span style=\" color:inherit;\"><strong style=\"\"><u style=\"\"><em style=\"\">Project Based Approach</em></u></strong></span>  </p>  <p>  \t         From the intro, beat drop to the chorus, learn how to craft an entire song alongside          the instructor from start to finish  </p>  <p>  \t<span style=\" color:inherit;\"><strong style=\"\"><em style=\"\"><u style=\"\">Mixing and Mastering</u></em></strong></span>  </p>  <p>  \t         Learn how to take a composition to a crisp radio ready jam. From EQ techniques to        special effects, learn how to craft quality professional tracks.  </p>  <p>  \t<strong style=\"\"><em style=\"\"><u style=\"\">Technical Concepts</u></em></strong>  </p>  <p>  \t         MIDI vs Audio? Loops vs Virtual Instruments? Learn the technical know how and            basic techniques of music production.  </p>  <p>  \t<span style=\" color:inherit;\"><strong style=\"\"><em style=\"\"><u style=\"\">Creative Inspiration</u></em></strong></span>  </p>  <p>  \t      From piano keys, guitar riffs, to music samples, learn how you can integrate melodies to help facilitate the creative process and sculpt your unique sound.  </p>", 
    "end_date": null, 
    "title": "Music Production 101- Make Music on Your Computer!", 
    "price": "20.00", 
    "instructors": "Ian Gonzales", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417534_1ddb_3.jpg", 
    "course_url": "https://www.udemy.com/beatsblueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T19:09:12Z"
}