{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t    Nebula is famous for its amazing emulations of classic studio gear, but up until now it has been very hard work for the average user to get the most out of it.<br style=\"\">  \t<br style=\"\">  \t    Nebula uses unique and complex technology that has previously been understood by only a small number of dedicated computer audio geeks. Now at last this information is available for everyone in plain English!<br style=\"\">  \t<br style=\"\">  \t    This course is not only for people who have just started using Nebula, it also covers a much wider range of subjects that need to be understood by all users to get the best out of the plug-in. Nebula Explained Starter is all about getting you started properly.<br style=\"\">  \t<br style=\"\">  \t    The course will take approximately an hour to finish, and by the time you have completed it you will:  </p>  <ul style=\"\">  \t<li style=\"\">  Understand how Nebula's brute force emulation works and what it can and can't achieve</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Have made basic and important changes to Nebula's default setup to get the optimum performance on your machine</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Have understood the difference between the 'Nebula' and 'Nebula Reverb' versions of the plug-in and know which version you should be using</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Be able to install and delete Nebula libraries easily</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Understand how Nebula's latency settings affect its sound and performance</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Be able to easily change GUI parameters using buttons, sliders, keyboard input and the modifier keys</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Be able to use the program browser, jump directly to programs, and understand every parameter on the PROG page</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Be able to save a Program with a new name and change its category</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Know the basics of gain staging and understand how important it is in relation to Nebula</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t    Nebula Explained Starter is made up mostly from video which includes:  </p>  <ul style=\"\">  \t<li style=\"\">  Screen-cast examples of Nebula in action</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Call-outs, graphics and photos to highlight key points</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Specially created diagrams to make sure everything is easily understood.</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t    Every lecture starts by telling you exactly what you will learn in the lecture and ends with a detailed summary. These summaries are available as PDF files for you to download and print out. At the end of each section there are multiple choice questions to help consolidate your learning.<br style=\"\">  \t<br style=\"\">  \t    Starter is a cut-down version of the Nebula Explained Professional course offered at a reduced cost. It is for those only wanting to learn the basics.<br style=\"\">  \t<br style=\"\">  \t    If you have not done so already please also take a look at the Nebula Explained Professional curriculum so you can best decide which is the right course for you.<br style=\"\">  \t<br style=\"\">  \t    Enrol now and take your Nebula knowledge to the next level!  </p>", 
    "end_date": null, 
    "title": "Nebula Explained Starter", 
    "price": "20.00", 
    "instructors": "David Else", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/136076_d1f5_2.jpg", 
    "course_url": "https://www.udemy.com/nebula-explained-starter/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-20T14:29:01Z"
}