{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<ul style=\"\">  </ul>  <p style=\"\">  \t        Nebula is famous for its amazing emulations of classic studio gear, but up until now it has been very hard work for the average user to get the most out of it.<br style=\"\">  \t<br style=\"\">  \t        Nebula uses unique and complex technology that has previously been understood by only a small number of dedicated computer audio geeks. Now at last this information is available for everyone in plain English!<br style=\"\">  \t<br style=\"\">  \t     Professional is the full version of the course and contains all the detailed information about using Nebula that the professional user demands. It contains all the lectures included in Starter and builds on this to provide all the specialist knowledge to transform your way of working with Nebula and the results you can achieve<br style=\"\">  \t<br style=\"\">  \t        The course is comprised of 22 lectures and will take approximately 2.5 hours to finish, and by the time you have completed it you will learn:<br style=\"\">  \t<br style=\"\">  \t        In the <strong style=\"\">Welcome To the World of Nebula</strong> Section:  </p>  <ul style=\"\">  \t<li style=\"\">How Nebula's brute force emulation works and what it can and can't achieve</li>  </ul>  <ul style=\"\">  \t<li style=\"\">The different ways that Nebula can sample hardware and why we would use each of them</li>  </ul>  <ul style=\"\">  \t<li style=\"\">An overview of sampling using Nebula's NAT sampling software</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How convolution impulse responses are used in reverb emulation</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How sampling with Nebula differs from standard convolution</li>  </ul>  <ul style=\"\">  \t<li style=\"\">What the 'dynamic dimension' is and how Nebula can sample it</li>  </ul>  <ul style=\"\">  \t<li style=\"\">The limitations of Nebula's technology</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t        In the <strong style=\"\">Installation &amp; Setup</strong> Section:  </p>  <ul style=\"\">  \t<li style=\"\">The difference between the 'Nebula' and 'Nebula Reverb' versions of the plug-in and which version you should be using</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to install and delete Nebula libraries easily</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How Nebula's latency settings affect its sound and performance</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to Locate and edit the plug-ins XML files to customize your install</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to create multiple versions of the plug-in with different latencies</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to create alternative directories to store your Nebula libraries</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to add meaningful names to the default 3 character categories</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to add the ability to use TIMED kernels</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to adjust compressor look ahead time with AHEADLENGTH</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t        In the <strong style=\"\">Graphic User Interface</strong> Section:  </p>  <ul style=\"\">  \t<li style=\"\">How to easily change GUI parameters using buttons, sliders, keyboard input and the modifier keys</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How to save a Program with a new name and change its category</li>  </ul>  <ul style=\"\">  \t<li style=\"\">All about RTE, The Flashing 'T', KERNELS:, MONO-L / STEREO and SPLITH / CLASSIC mode</li>  </ul>  <ul style=\"\">  \t<li style=\"\">About what the exact difference is between the FREQD and TIMED modes</li>  </ul>  <ul style=\"\">  \t<li style=\"\">About the kernel control grid and how SPLITH Works</li>  </ul>  <ul style=\"\">  \t<li style=\"\">About using an analyser and turning distortion kernels on and off</li>  </ul>  <ul style=\"\">  \t<li style=\"\">About what EVERY parameters on the global MAST page does in detail</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t        In the <strong style=\"\">Mixing With Nebula</strong> Section:  </p>  <ul style=\"\">  \t<li style=\"\">The basics of gain staging and understand how important it is in relation to Nebula</li>  </ul>  <ul style=\"\">  \t<li style=\"\">What good gain staging looks like</li>  </ul>  <ul style=\"\">  \t<li style=\"\">What exactly dBFS, RMS and dBu are</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Why use -18dBFS instead of -20dBFS or another similar value</li>  </ul>  <ul style=\"\">  \t<li style=\"\">About using the 'magic' formula and measuring -18dBFS accurately using a free insert channel plug-in</li>  </ul>  <ul style=\"\">  \t<li style=\"\">About the accuracy and usability of Nebula's emulations</li>  </ul>  <ul style=\"\">  \t<li style=\"\">About how the core technology is used in preamps/consoles, EQ, reverb and compressors</li>  </ul>  <ul style=\"\">  \t<li style=\"\">About each category of program including examples of hardware types sampled, the general uses of each category and a review of their accuracy and usability</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t        Every lecture starts by telling you exactly what you will learn in the lecture and ends with a detailed summary. These summaries are available as PDF files for you to download and print out. At the end of each section there are multiple choice questions to help consolidate your learning.<br style=\"\">  \t<br style=\"\">  \t        As an extra special bonus there is a full audio interview with Giancarlo Del Sordo (the creator of Nebula) included.<br style=\"\">  \t<br style=\"\">  \t     Enrol now and take your Nebula knowledge to the next level!  </p>", 
    "end_date": null, 
    "title": "Nebula Explained Professional", 
    "price": "50.00", 
    "instructors": "David Else", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42987_ebc7_3.jpg", 
    "course_url": "https://www.udemy.com/nebula-explained-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-22T18:42:02Z"
}