{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">Learn the basic concepts, tools, and functions that you will need to build fully functional projects with the most popular Digital Audio Workstation, Pro Tools. </p><p style=\"\"><strong style=\"\">Build a strong foundation in Pro Tools workflow with this tutorial for beginners. </strong><br style=\"\"></p><ul style=\"\"><li style=\"\">Create New Sessions</li><li style=\"\">Record Audio Instruments</li><li style=\"\">Build MIDI Compositions</li><li style=\"\">Speed Up Your Workflow Using Keyboard Shortcuts</li><li style=\"\">Learn the Fundamentals in Mixing and Mastering</li></ul><div style=\"\"><strong style=\"\">A Powerful Skill at Your Fingertips</strong></div><div style=\"\">Learning fundamentals of Pro Tools puts a powerful and very useful skill at your fingertips. Pro Tools is the Photoshop for professional music production and mixing. </div><div style=\"\">Jobs in music production and mixing are plentiful, and being able to learn Pro Tools will give you a strong background to more easily pickup new projects. </div><div style=\"\"><strong style=\"\">Content and Overview</strong></div><div style=\"\">Suitable for beginners, through this course you&#039;ll learn the fundamentals of Pro Tools. Included are exercises and &quot;cheat sheets&quot; for a speedier workflow. </div><div style=\"\">Starting with the basics on setting up your first session, we touch on the importance of proper input levels when recording, as well as MIDI channel routing to save CPU processing. </div>  <p style=\"\">Our focus is not to reiterate the manual, but a comprehensive course of what you need to know.</p><p style=\"\">Students completing this course will have the &quot;know-how&quot; to use Pro Tools entirely on a music project. </p>", 
    "end_date": null, 
    "title": "Pro Tools - Quick Start", 
    "price": "50.00", 
    "instructors": "Music Tech Courses Pulsating Waves", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384254_82fd_3.jpg", 
    "course_url": "https://www.udemy.com/protoolsquickstart/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T19:05:23Z"
}