{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Welcome to our Pro Tools Audio Recording And Music Production For Beginners Course!</strong> You can expect to learn the audio recording software Pro Tools from the very beginning of creating a new project all the way to exporting a finished music track.</p>\n\n<p>This course is structured in a way that you can begin learning audio recording with Pro Tools without prior knowledge of audio production or the software. You will receive to the point lectures without unnecessary introductions.</p>\n\n\n\n<p><strong>Once this course has been completed, you'll have the skill set and knowledge to:</strong></p>\n\n\n\n<ul><li><em>Create new Pro Tools projects</em></li><li><em>Record audio</em></li><li><em>Work with midi</em></li><li><em>Utilize different virtual instruments within your audio projects</em></li><li><em>Apply insert audio plugins such as reverb, EQ and compression</em></li><li><em> Complete basic mixing and mastering.</em></li></ul>\n\n\n\n<p>There's a ton of other information shared in this course as well such as: <em>creating and working with a click track at different tempos, bussing audio to other tracks, keyboard shortcuts, understanding inputs and outputs and the differences between the various types of recording tracks.</em></p>\n\n\n\n<p>Your instructor is Will Bartlett who is the founder of an established media production company in Toronto. He has been using Pro Tools since 2009 and has been involved in audio production since 2004 recording bands, creating stock music for sale and mixing and mastering the audio of hundreds of video projects.</p>\n\n\n\n<p><strong>We hope to see you in there!</strong></p>", 
    "end_date": null, 
    "title": "Pro Tools Audio Recording For Beginners", 
    "price": "20.00", 
    "instructors": "OVC Masters", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791988_e69d_2.jpg", 
    "course_url": "https://www.udemy.com/learn-protools-audio-recording/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T04:33:31Z"
}