{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t  Have you ever wanted to pick apart the amazing productions of Paramore? Want to know the secrets to the incredible guitar tones, solos, and drums?  </p>  <ul style=\"\">  \t<li style=\"\">Are you blown away by the thick rhythm guitars?</li>  \t<li style=\"\">Ever wonder how they glued the bass and guitars together so well?</li>  \t<li style=\"\">Do you want to pick apart the drum sounds used and learn to mix them to perfection?</li>  \t<li style=\"\">Have you tried referencing to Paramore before, always feeling let down when you hear your own mix?</li>  \t<li style=\"\">Is it even possible to get those incredible sounds in your home studio?</li>  </ul>  <p style=\"\">  \t   One of the best sounding records out there in the rock genre is Paramore’s <em style=\"\">Riot</em>. We all love the amazing guitar tones, hard hitting drums, and slick production.  </p>  <p style=\"\">  \t   But just because you love the sounds doesn’t mean you know <em style=\"\">exactly </em><em style=\"\">how to get them </em>on your session.  </p>  <p style=\"\">  \t   As a producer, there’s always value in learning the tones, styles,  and secrets that were used to create incredible hit recordings. That’s  why we’ve <em style=\"\">painstakingly </em>recreated a track in the style of this hit from scratch – you’ll be amazed at what you find.  </p>", 
    "end_date": null, 
    "title": "Secrets of the Hits In the Style Of Paramore", 
    "price": "20.00", 
    "instructors": "Music Recording, Mixing Multi Platinum", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208072_2379_2.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-the-hits-in-the-style-of-paramore/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-30T15:29:30Z"
}