{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t      Don&#039;t be a &quot;preset-picker&quot; anymore!  </p>  <p style=\"\">  \t      You get frustrated with your productions because you are constantly scrolling through factory presets of your synthesizers. You look at the user interface of Sylenth and think to yourself, &quot;I&#039;ll never know how to use this thing. It&#039;s too complicated. It&#039;s for professionals.&quot; You try to mess with some of the controls, but give up because it takes too long. Then you return to scrolling through presets again and sticking to stock sounds for your mixes.  </p>  <p style=\"\">  \t      I&#039;m here to change all that.  </p>  <p style=\"\">  \t      You <strong style=\"\">can</strong> master the principles of subtractive synthesis--even if you don&#039;t know what that means. You <strong style=\"\">can</strong> design your own sounds from scratch. You <strong style=\"\">can</strong> learn how to imagine a sound and then build it from the ground up using Sylenth.  </p>  <p style=\"\">  \t      After taking this course, you will be able to dream up a sound, determine the right building blocks for that sound, and design it inside Sylenth--and <strong style=\"\">quickly</strong>. I will teach you the fundamental principles of <strong style=\"\">subtractive synthesis</strong>, walk you through every single nook and cranny of the software, and show you exactly how to create your very own sounds from scratch.  </p>  <p style=\"\">  \t      I created this course to be <strong style=\"\">comprehensive</strong>--if you are new to sound design or synthesis, you will not be left behind. If you are somewhat familiar with using synthesizers, I promise you will learn new valuable techniques for your productions.  </p>  <p style=\"\">  \t    Using <strong style=\"\">55 high definition screencasts</strong>, I&#039;ll teach you everything you need to know about Lennar Digital&#039;s Sylenth software. We leave no knob unturned or LFO un-cycled. We will walk through <strong style=\"\">every aspect</strong> of the software methodically, and then use a cookbook approach to <strong style=\"\">building our own sounds</strong>. I&#039;ll also include my own presets used in the course for you to download for your own reference.  </p>  <p style=\"\">  \t      You will leave this course a <strong style=\"\">master</strong> of Sylenth.  </p>  <p style=\"\">  \t      ----  </p>  <p style=\"\">  \t       Lennar Digital&#039;s &quot;Sylenth&quot; is a powerful, versatile, and all-around awesome sounding soft synth.  </p>  <p style=\"\">  \t        Highly regarded among producers and DJs as the only virtual synthesizer which truly emulates the warmth and clarity of analog hardware synths, Sylenth is the <strong style=\"\">primary tool</strong> for many electronic and pop music producers.     In this course, you will learn <strong style=\"\">every aspect</strong> of this very powerful virtual synthesizer.  </p>  <p style=\"\">  \t        Using <strong style=\"\">100% high definition video tutorials</strong>, you will learn how to navigate the software, how the audio signal path works, and how to design sounds from scratch--from screaming leads to fat basses, weird fx patches, lush pads, and even drum loops!  </p>  <p style=\"\">  \t           All you need is the Sylenth VST and a host DAW (digital audio workstation) of some kind. I&#039;ll show you the rest.    We will walk through the entire architecture of the software, from oscillators to filters to modulation routing to effects processing. <strong style=\"\">Everything you need</strong> to create unique, stunning sounds is contained within this course.  </p>  <p style=\"\">  \t           Even if you have <strong style=\"\">no prior knowledge</strong> of sound design, analog synthesis, or music theory, by the end of this course you will be creating your own sound patches with confidence and creativity.     In the process, you will develop skills in analog synthesis which you can translate to many other synths such as Native Instruments&#039; Massive, Rob Papen&#039;s Predator, and just about any other virtual analog synthesizers.  </p>  <p style=\"\">  \t           You will also learn how to <strong style=\"\">design specific sounds</strong> for specific genres. Are you tired of sifting through presets, unhappy with your choices? Learn how to translate the sounds in your head into powerful, rich, and warm patches which you can save in your own soundbank.  </p>  <p style=\"\">  \t            Don&#039;t be a preset picker! Learning how to design your own sounds will take your productions to the <strong style=\"\">next level</strong>. It will help you be more musical and will make your mixes unique.  </p>  <p style=\"\">  \t      Join us and become a master of Sylenth.  </p>", 
    "end_date": null, 
    "title": "Sylenth Tutorial: Master Lennar Digital's Sylenth1", 
    "price": "20.00", 
    "instructors": "Dylan Bowes", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/395076_9977_5.jpg", 
    "course_url": "https://www.udemy.com/sylenthtutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-15T18:34:38Z"
}