{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">For years I've been teaching Ableton Live and Max in the college classroom. As a University Professor, my classes are sought after, and, frankly, expensive. I believe Ableton Live can be learned by anyone, and cost shouldn't be a barrier. This class uses the same outline and syllabus I've used in my college classes for years, at a fraction of the cost.</p><p style=\"\"><strong style=\"\">This is Part 7: MaxForLive</strong></p><p style=\"\">MaxForLive is a powerful tool that lets users design their own instruments, effects, and devices. It isn't without its drawbacks: MaxForLive is notoriously difficult to learn.<strong style=\"\"> I've developed an approach for teaching MaxForLive that focuses on teaching it like a language: </strong>You will learn small blocks and patches, understanding the how and the why along the way. As we grow our vocabulary, we <em style=\"\">\"<strong style=\"\">learn how to learn\"</strong></em> more and more. </p><p style=\"\">Topics include:</p><ul style=\"\"><li style=\"\">The unique and quirky history and development of Max</li><li style=\"\">What we can do with MaxForLive</li><li style=\"\">Max vs. MaxForLive</li><li style=\"\">The MaxForLive Devices</li><li style=\"\">Finding and Sharing MaxForLive Devices</li><li style=\"\">Getting Help: Help Windows in MaxForLive</li><li style=\"\">Presentation Mode &amp; Patching Modes</li><li style=\"\">The Max Editor</li><li style=\"\">Messages</li><li style=\"\">Bangs &amp; Buttons</li><li style=\"\">Project 1: Building a MIDI Delay</li><li style=\"\">Project 2: Building an Arpeggiator</li><li style=\"\">Working with Audio Signals</li><li style=\"\">Project 3: An Audio Delay</li><li style=\"\">~ Objects (tilde objects)</li><li style=\"\">Presentation Setup</li><li style=\"\">Controlling Live</li><li style=\"\">Abstractions</li><li style=\"\">Controlling anything in Live</li><li style=\"\">Project 4: A Beat-Quantized Randomized Filter</li><li style=\"\">Finding the Beat from Live</li><li style=\"\">Project 5: Artificial Intelligence (sort of)</li><li style=\"\">... And much more!!!</li></ul><p style=\"\"><strong style=\"\">Also included in this class is 6 of my own MaxForLive patches for you to download, dissect, use, and build on. </strong></p><p style=\"\">And of course, once you sign up any part, you automatically get huge discounts to all the upcoming parts of this class. You will not have another opportunity to learn Ableton Live in a more comprehensive way that this.</p><p style=\"\"><em style=\"\">J. Anthony Allen is an Ableton Certified Trainer, and a PhD in Music Composition and master of Electronic Sounds. His music has been heard internationally in film, radio, video games, and industrial sound, as well as the concert hall and theater.</em></p><p style=\"\"><em style=\"\">He currently as an adjunct professor of composition at the University of St. Thomas, Macphail Academy of Music, and the CEO of Slam Academy in Minneapolis.</em></p><p style=\"\"><em style=\"\">Praise for other classes by J. Anthony Allen:</em></p><em style=\"\"><em style=\"\"><li style=\"\"><em style=\"\">\"I've had Live Lite for a while but never quite understood how to use it because of the different options in how to arrange audio. This course explains exactly how to do that and get the most out of Live.\"</em></li><em style=\"\"><em style=\"\"><li style=\"\">\"Great overview - I would start here for sure if you are just getting your feet wet with live. clear and to the point. session walkthroughs are great. looking forward to more\"</li><li style=\"\">\"I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going thru this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.\"</li></em></em></em></em>", 
    "end_date": null, 
    "title": "Ultimate Ableton Live: Part 7 - MaxForLive", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604202_00aa_4.jpg", 
    "course_url": "https://www.udemy.com/ableton7-maxforlive/", 
    "currency": "USD", 
    "subject_name": [
        "Music Software"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T19:58:52Z"
}