{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    Zizhi Tongjian is one of the earliest Chinese historiographies spanning nearly 300 volumes and covering 1,300 years of history. Literally meaning “Comprehensive Mirror in Aid of Governance,” Zizhi Tongjian is an annalistic-style history featuring the subjects of politics and the military as the main thread of narration. The collection has been cherished by scholars over numerous dynasties for its historical value and insight into governance, peace and stability.\nThis guided reading course will help learners deepen their understanding of Chinese history, in addition to applying Zizhi Tongjian’s ancient wisdom to modern-day governance. Because Zizhi TongJian is a rich, expansive text, this course is intended to remove colloquial barriers and help students gain a deeper understanding of Chinese history from Emperor Qin to Caocao and Emperor Taizong.\n \n资治通鉴》是北宋司马光主持编纂的著名编年体史书、传统史籍“通鉴体”门类的开山之作。该书以政治、军事为记述主线，上起公元前403年，下迄公元 959年，以294卷、300多万字的篇幅，系统展现一千三百多年间华夏大地波澜壮阔的历史画卷。该书问世以来，不但以其不可替代的史料价值为历代学者所 重视，更以其资政育人、总结历代治乱兴衰之道的根本动机与高卓史识为后世所称道，呈现出超越时空的巨大生命力。然而《资治通鉴》篇幅浩瀚、内容复杂，加以 历史文献自身的时代特点，非文史专业出身的广大青年学生难以通读并领会其要旨。“《资治通鉴》导读”课程作为一门人文通识课程，目的即在于消除专业壁垒， 引导同学近距离感受这部中国伟大史学著作的魅力。课程主讲张国刚教授潜心研读《资治通鉴》数十年，通过精心选取其中的经典人物言行与历史场景，钩沉发覆、 条分缕析，以现代思维总结文化精髓，以生动语言阐发历史智慧，尤其侧重其中修身、齐家、治国的现实意义，以及中西文化之间的历史性比较。通过“《资治通 鉴》导读”课程的学习，同学们不但可对战国至五代之间中国历史发展演化的基本脉络产生较为全面的把握，还可领悟到如何从传统文化汲取现实营养的基本方法， 为将来进一步学习中国文化开辟道路。\n\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "00612642X: 资治通鉴: Chinese History From Warring States to the Tang Dynasty", 
    "price": 0, 
    "instructors": "Zhang Guogang", 
    "institution_name": [
        "Tsinghua University"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/zi-zhi-tong-jian-chinese-history-warring-tsinghuax-00612642x-1", 
    "duration": "18 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-02-22T00:00:00Z"
}