{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    Did you know that Henry VIII ordered the first apricot trees to be planted in England because he couldn’t get enough of them? Or that chocolate was first introduced to England by Charles II to compete with the French court?\n\nOn this course, you’ll join expert historians, curators and food scientists from the University of Reading and Historic Royal Palaces, to immerse yourself in the changing tastes of successive generations of royalty and experience the splendour of their palaces - from the Tudors to the 20th century.\n\nExplore royal food through five remarkable monarchs and their palaces\n\nOver five weeks, we’ll explore the history of royal food through the tastes of five key monarchs, and take an intimate look behind the scenes at some of the most incredible palaces in England:\n\n\n  \n    Henry VIII at Hampton Court Palace\n  \n  \n    Elizabeth I at the Tower of London\n  \n  \n    George I at Hampton Court Palace\n  \n  \n    George III at Kew Palace\n  \n  \n    Victoria at Kensington Palace.\n  \n\n\nEach week, you’ll be invited to:\n\n\n  \n    Cook royal recipes: from Tudor pies to Georgian chocolate, prison food to afternoon tea, you’ll get a cooking challenge to try at home, so you can eat like royalty.\n  \n  \n    Get scientific: you’ll explore the flavour, nutritional value and medicinal benefits of royal food past and present, and investigate which era enjoyed the healthiest and tastiest diet.\n  \n  \n    Hone your investigative skills and powers of deduction: you’ll evaluate evidence, artefacts and science to draw your own conclusions about royal food in different eras.\n  \n  \n    Discover some surprising facts: we’ll share riveting tales and challenge some common misconceptions about palaces, monarchs, and their impact on dietary tastes today.\n  \n  \n    Share your findings with thousands of people around the world: you’ll debate your opinions and compare experiences with expert mentors and other learners.\n  \n  \n    Throughout the course, you’ll learn with well-known experts;\n  \n\n\nFrom University of Reading:\n\n\n  \n    Kate Williams is Professor of Public Engagement with History. Kate has written acclaimed books on royal history, including books on Victoria and Elizabeth II. She comments widely on royal events and affairs on TV and also on food history - including Bake Off and on Heston Blumenthal’s shows. She has collaborated frequently with Historic Royal Palaces on fundraising events and believes that the palaces are a key part of the nation’s heritage that should be preserved for future generations.\n  \n  \n    Dr Lisa Methven: Associate Professor in Food and Sensory Science and manager of the Sensory Science Centre. Lisa’s research focuses on individual differences in sensory perception of foods and their association with liking, food choice and dietary intake.  Her research has led to public engagement through television, radio and national press.\n  \n  \n    Dr Jane Parker:  Founder and Director of the University Flavour Centre and an expert in the area of flavour chemistry.\n  \n\n\nGuest contributor:\n\n\n  Heston Blumenthal, OBE, world renowned chef is famous for his creativity and pioneering \nnew techniques through multi-sensory cooking, flavour encapsulation and food pairing. Heston received an honorary Doctor of Science degree, in 2006, from the University of Reading in recognition of his unique scientific approach to food and long-standing relationship with the University’s School of Food Biosciences.\n\n\nFrom Historic Royal Palaces:\n\n\n  \n    Marc Meltonville: Food Historian with the Historic Royal Palaces kitchen team, with a specialism in Tudor food, who collaborates with Heston Blumenthal on new multi-sensory dishes for his award winning Michelin-starred restaurants.\n  \n  \n    Polly Putnum: Collections Curator responsible for Hampton Court Palace and Kew Palace, who researched the recently restored Chocolate Kitchens at Hampton Court Palace.\n  \n  \n    Dr Annie Gray: Historian, Cook, and Broadcaster who specialises in the history of food and dining in Britain from 1600 to the present day.\n  \n\n\n\n\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "A History of Royal Food and Feasting ", 
    "price": 0, 
    "instructors": "Kate Williams", 
    "institution_name": [
        "University of Reading"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/royal-food?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}