{
    "selfpaced": true, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    This course provides an overview of Thomas Jefferson's work and perspectives presented by the University of Virginia in partnership with Thomas Jefferson’s Monticello. Together, UVA and Monticello are recognized internationally as a UNESCO World Heritage Site.\n\n                                            Syllabus\n                        Thomas Jefferson, American IconThomas Jefferson is an American icon.  He has also been one of the most polarizing and controversial figures in American history.  In this introductory module, we’ll explore how Jefferson’s reputation has changed and evolved over the last two centuries.  We’ll discover what Jefferson considered to be his most important contribution to the “Age of Enlightenment” in which he was living.  We’ll discuss why some people in both the nineteenth and twentieth centuries have viewed Jefferson and his ideas with skepticism or worse while others have embraced Jefferson.  Overall, learning about how people from many different backgrounds and perspectives have interpreted Jefferson throughout history will help us understand why it’s so important to think critically and honestly about Jefferson’s life and legacy today.Jefferson’s Declaration of IndependenceNo document is more closely associated with Jefferson than the Declaration of Independence.  Listing it as the first of three achievements on his tombstone, Jefferson clearly believed the Declaration to be of profound importance.  Generations of Americans have agreed, constantly quoting its phrases and invoking its ideas.  But do we really understand what Jefferson was trying to do when he wrote the Declaration?  In this module, we’ll explore the Revolutionary context in which Jefferson lived and worked.  We’ll ask why the Declaration takes the form that it does, and also what Jefferson hoped it would accomplish.  Surprisingly, the parts of the Declaration that we celebrate most frequently today may not be the ones Jefferson would have understood to be the most important.Jefferson and SlaveryThe man who wrote in the Declaration of Independence that “all men are created equal” was a lifelong slaveowner whose affluence rested on the exploitation of hundreds of African Americans.  In this module, we travel to Montalto, the mountain overlooking Jefferson’s home and plantation on Monticello, to try to gain some perspective on this great tension in Jefferson’s life and thought.  Our goal will be neither simply to exonerate nor to castigate Jefferson, but rather to understand how he viewed slavery and his relationship to it.  Only by confronting and considering this complicated, frustrating, and tragic chapter in American history can we come to a more complete and nuanced understanding of Thomas Jefferson and his legacy.  As students attending the University Jefferson founded, it is especially important to engage this topic.Jefferson and ReligionThe role of religion in public life continues to be a topic of debate today in both the United States and around the world.  Thomas Jefferson was never happier than when his Bill for Religious Freedom was finally enacted in Virginia in 1786.  In this module, we’ll try to understand why Jefferson believed freedom of religion to be so essential to the future of the United States.  To do this, we’ll explore the historical context in which Jefferson developed his ideas about the proper relationship between religious denominations and the state.  We’ll also investigate Jefferson’s own faith—a subject of much controversy from his own day through the present.  Considering Jefferson’s serious engagement with questions of religion will help us understand the kinds of communities and society he hoped would take hold and flourish in the new nation.Jefferson and EducationFounding the University of Virginia in 1819 was the most obvious example of Jefferson’s interest in education, but it was by no means the first time he considered the subject.  Indeed, education was one of Jefferson’s constant preoccupations.  In this session, we’ll discuss Jefferson’s ideas about education as they developed over the course of his life, from the ambitious plan for a state-supported system of schools outlined in his “Bill for the More General Diffusion of Knowledge,” to his conclusion in the early nineteenth century that the other institutions of higher learning that existed in the United States just weren’t suited to forming the leaders of a free republic.  Throughout the discussion, we’ll try to understand why Jefferson was so focused on education by asking what he believed was at stake if Americans failed in their duty to provide proper instruction for future generations.'The earth belongs to the living'In 1789, Jefferson wrote a letter to James Madison from Paris in which he asserted that “the earth belongs to the living.”  Calculating that a single generation could be said to last nineteen years, he proposed that no debts should be incurred that could not be paid off in nineteen years; that all laws should be re-written every nineteen years; and that Americans should re-write even their constitutions every nineteen years.  Madison thought the ideas Jefferson outlined in this letter to be wildly impractical, and most commentators since then have come to the same conclusion.  In this module, however, we’ll explore what Jefferson was getting at in claiming that “the earth belongs to the living.”  In so doing, we’ll discover how this phrase expresses an idea that lies at the very core of Jefferson’s conception of equality, democracy, and the American nation.Final Exam\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Age of Jefferson", 
    "price": 0, 
    "instructors": "Peter Onuf", 
    "institution_name": [
        "University of Virginia"
    ], 
    "commitment": "1-3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/ageofjefferson", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}