{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The Battle of Agincourt, in 1415, is one of the most famous battles in the history of warfare, and one of the most important and memorable English victories. It still captures the imagination today, but why are stories still told about Agincourt? And do these stories represent what really happened on the battlefield?\n\nThis free online course will explore the myths and realities about the battle, which marked its 600th anniversary on 25 October 2015. The three weeks will be led by the foremost academic expert on the battle, Professor Anne Curry.\n\nUnderstand Agincourt’s place in the Hundred Years’ War\n\nWith Anne, you will learn about the preparations for the battle and its context within the Hundred Years’ War between England and France. You will consider the legitimacy of Henry V’s claim to the French throne and whether his actions in going to battle were justified.\n\nUsing original archive documents, you will also learn more about the soldiers who met on the field of battle. Who was in the English army and what was it like to be a medieval soldier? Which places in England have significance for the battle? Where was the army recruited from and could YOUR ancestor have taken part in the battle?\n\nLearn what happened on the medieval battlefield\n\nYou will then learn about what happened during the battle itself, and examine how myths about the battle have built up over subsequent years. Dan Spencer, one of Anne’s PhD researchers, will examine the kinds of guns and other weaponry which could be found on the medieval battlefield. He will explore how and why the longbow was used at Agincourt with such devastating effect.\n\nFinally, we will visit the battlefield itself, to examine what remains at Agincourt today. You will learn about the modern site of the battle and how scientific historical research can transform our understanding of an event which took place 600 years ago.\n\nJoin us to learn the exciting and enthralling story of the Battle of Agincourt!\n\nImage from the ‘Chroniques d’Enguerrand de Monstrelet’ (early 15th century). Used with permission from the Bibliotheque Nationale de France © BNF)\n\n\n                                    ", 
    "end_date": "2016-03-07T00:00:00Z", 
    "title": "Agincourt 1415: Myth and Reality", 
    "price": 0, 
    "instructors": "Dan Spencer and Anne Curry", 
    "institution_name": [
        "University of Southampton"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/agincourt?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-02-22T00:00:00Z"
}