{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    American Prophet is a course about the inner life and thoughts of Dr. Martin Luther King, Jr. Many history books tell us that King was a civil rights leader who advocated for peaceful protest and made inspirational speeches. But what was he really thinking and feeling during the various campaigns in which he participated? How did he even become a civil rights leader in the first place? Was he really as confident about his methods as we think?\r\nOver the coming weeks, we will address these questions and many others while exposing participants to one of the most important techniques in historical analysis: the use of primary source documents as windows into the past. There are thousands of documents about King that have been published, with more available online, and each one gives us insight into what his life was really like. In this course, we will focus on a few documents each week in order to both help participants learn the best strategies for understanding primary sources and leverage the information contained within them for our study of King. By the end of the course, participants will feel comfortable using documents as historical sources, appreciate who Dr. King was on a more personal level, and gain new skills in understanding the nuances of historical study.\r\nThe first introductory series of American Prophet consists of five episodes that provide an overview of King's private and public life. These episodes, which will run every two weeks from January 12th to March 22nd, will feature the historical materials assembled by Carson and his colleagues for their definitive edition of The Papers of Martin Luther King, Jr. Enrolled participants completing 70% of assignments for Episodes 1-5 by March 22nd will receive Statements of Accomplishment.\r\nDuring the Spring, we will release an additional series of episodes that will provide a more comprehensive examination of King's life.\n\n                                    ", 
    "end_date": "2016-03-08T00:00:00Z", 
    "title": "American Prophet: The Inner Life and Global Vision of Martin Luther King, Jr.", 
    "price": 0, 
    "instructors": "Clayborne Carson", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://lagunita.stanford.edu/courses/HumanitiesSciences/MartinLKing/Winter2016/about", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Stanford OpenEdx"
    ], 
    "start_date": "2016-01-12T00:00:00Z"
}