{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    We currently face unprecedented challenges on a global scale. These problems do not neatly fall into disciplines. They are complicated, complex, and connected. Join us on this epic journey of 13.8 billion years starting at the Big Bang and travelling through time all the way to the future. Discover the connections in our world, the power of collective learning, how our universe and our world has evolved from incredible simplicity to ever-increasing complexity. Experience our modern scientific origin story through Big History and discover the important links between past, current, and future events. You will find two different types of lectures. ‘Zooming In’ lectures from multiple specialists enable you to understand key concepts through the lens of different disciplines, whilst David Christian's ‘Big History Framework’ lectures provide the connective overview for a journey through eight thresholds of Big History.\n\n                                            Syllabus\n                        Big History, Critical Thinking, &amp; TransdisciplinarityWelcome to Big History! This is where we use the power of a transdisciplinary perspective to explore broad trends in the grand narrative of 13.8 billion years. In this module you'll learn how Big History works, explore critical-thinking, how we know what we know, and learn about the first \"3 Thresholds of Increasing Complexity\", milestones around which Big History is organized, starting at the beginning of the Universe, space, time, and everything in existence.The Universe, Stars, and PlanetsOur journey across space and time has begun. In this module, in a timeline that covers billions of years, we'll explore the origins of the universe, new stars &amp; elements, and the solar system. You'll have the opportunity to examine cosmology, astronomy, physics, chemistry, and geology.The Evolutionary EpicTravel through the evolutionary epic from the origin of life c.3.8 billion years ago, the evolution of complex forms after c.550 million years ago, to the evolution of some very odd primates - humans. Zoom in and explore evolutionary biology, geology, palaeontology, and anthropology.Human HistoryAfter billions of years of cosmic evolution, our own rather peculiar species has emerged to cultivate even greater heights of increasing complexity. In this module, we will explore the long trend of human development from the origin of our species c.200,000 years ago to the eve of the Industrial Revolution. You will explore archaeology, paleography, and ancient, medieval, and early modern history.ModernityWe have now arrived at one of the most dynamically changing periods ever seen in human history - our own times. This module will explore how the agrarian era that had lasted for 10,000 years transitioned to the modern era with its explosion of production and complexity. We will explore modern history, political science, and economics.The FutureWe've looked far into the deep past, now is the time to take what we've learned and look ahead. In this module we will explore the near and distant future, what challenges we face this century, how we study the future on the scale of billions of years, and where complexity may go from here. The section incorporates climatology, cosmology, physics, and foresight.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Big History: Connecting Knowledge", 
    "price": 0, 
    "instructors": "David Baker", 
    "institution_name": [
        "Macquarie University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/big-history", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}