{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Humanities\n                                                                                                    &gt; History\n                                                            \n                            \n                                                \n                    \n                    \n                    Learn what motivates the restive Muslim youth from Tunis to Tehran, what political positions Islamists from Mali to Chechnya are fighting for, where the seeming obsession with Islamic law comes from, where the secularists have vanished to, and whether it makes sense to speak of an Islamic state.\n\nSince 2009 there has been a renewed wave of popular unrest sweeping throughout much of the Muslim world. Secular, but generally repressive and inefficient autocracies have come under pressure or been swept aside entirely. At the same, the various Islamic Republics have not fared much better, but been convulsed by internal unrest, economic and social decline. Throughout the Muslim lands, existing constitutional arrangements are being challenged, often very violently.\nThis course is a survey of the constitutional ideas and institutions that have developed since the mid 19th century throughout predominantly Muslim countries, but its focus will lie on the actors that have dominated this discourse and shaped its outcomes. We will look at the large body of classical writings on the Islamic state only in so far as it is necessary to understand the contemporary debate, but concentrate on the legal and political developments of the 20th and 21st centuries.\n\nThree common themes will characterise the course: \n\nWe privilege the study of the legal and social reality and seek to highlight where it is at odds with dogmatic stipulations, be they religious or constitutional. \n\nWe seek to illustrate the practical tensions posed by limited administrative capabilities and political legitimacy that resulted from the incomplete reception of modern bureaucratic statehood. \n\nWe seek to examine how popular dissatisfaction with the practical performance of Muslim governments has fuelled demands for greater accountability under the guise of cultural authenticity. \n\nUltimately, the course aims to equip participants to better understand Muslim contemporary discourse about the res publica, better contextualise the demands for religious law in public life, and to better ascertain the theoretical and practical feasibility of postulated religious alternatives to the still-dominant secular model of governance.\n\n                                            Syllabus\n                        Overview: Presenting the CourseThis week, we try to give you an overview of the themes and principles that we will focus on during the course. We look at the current state of the countries in the region and present the role of religion, the challenge of modernity and the different responses to modernity, which we will revisit thematically during the next weeks. It is highly recommend to read my article \"Contested Universalities of International Law. Islam’s Struggle with Modernity\" in this week's readings to gain a better understanding of the argument put forward throughout the course.Ottoman Empire and Modern TurkeyThis week, we look at Turkey and at the history of the Ottoman Empire, whose legacy continues to influence many countries in the region today. Turkey occupies a special place due to its explicit constitutional and social commitment to secularism and a self-conscious emulation of the Western model. Keep the four models of adaptation in mind while watching the lectures of this week as well as the next ones.Egypt and MaghrebThis week concerns the region where the so-called \"Arab Spring\" originated: North Africa. We will focus especially on Egypt due to its historical importance, relative size and the impact its politics have had on other Arab and Muslim countries. Following the Secularism/Emulation model exemplified by Turkey last week, this region represents the second broad approach to modernity, namely Religious Modernism/Reform.Saudi Arabia &amp; The GulfThis week we will look at the Gulf Monarchies, especially at Saudi Arabia. The impact of essentially free oil income defines the social and governmental structure of this sub-region, so we will focus on the character of so-called rentier economies and their socio-political impact. These countries represent the third broad approach to modernity, namely Traditionalism, that is the notion that there is no need to change inherited socio-political structures.Iran &amp; The ShiitesIran is the one place where the fundamentalist response to the challenge of modernity has had its longest and most thorough chance of carrying out the promise of Islamist governance. One of the main questions of the week regards the extent to which this promise has been fulfilled. In other words, whether Islamist claims to have a functioning and qualitatively better form of government have been sustainable, or whether the practical challenges of government have led to widespread popular disillusionment.The Levant (Jordan, Syria, Lebanon and Iraq)This week, even more than throughout the rest of the course, we are dealing with a very topical issue: The Western military invasion of Iraq led to the destruction of its state institutions and brought about the much predicted collapse of social order in that country. In Syria we are witnessing the disintegration of state institutions, caused by internal revolt rather than external attack, but with similarly disastrous humanitarian outcomes. While Jordan has generally managed to avoid being drawn into its neighbours' internal conflicts, Lebanon's fragile political system has shown much greater exposure to neighbouring events, especially in Syria.Afghanistan, Pakistan and BangladeshDue to the importance of the Afghan conflict for world politics of the last decade or so, this conflict will be the main focus of this week's lectures. It is a truly interesting story, replete with exotic locales, tales of betrayal and great heroism, and more. This focus regretfully entails that the fascinating story of Bangladesh and Pakistan does not get as much attention as it deserves. Malaysia &amp; IndonesiaThis week deals with the very rich historical, ethnic, linguistic and geographic tapestry of the two archipelagic nations of Malaysia and Indonesia. Truly fascinating places and very different from the localities we have so far discussed in the course. We look at both nations before and after their independence and end with a thorough investigation of the challenges they face today. The week's material is sure to be an eye opener to many.Sub-Saharan AfricaThis week, we will look at sub-saharan Africa and the particular challenges faced by Muslim-majority societies there. For obvious reasons, colonialism plays a very large role here and so we will return to many of the same issues already touched upon in earlier classes. But perhaps even more important is the endemic weakness of institutions. For more on those African nations that have successfully broken out of the vicious cycle of weak institutions, endemic poverty, bad governance, and domestic conflict, please see this week's readings. Conclusion and OutlookThis week, we move beyond the geographical focus as we try to tie up some of the loose ends and highlight some of the recurring issues we have studied during the past weeks together. We look at what the different countries have in common, what separates them and at the different kinds of tensions that we have found across the region. At the end of the week, you should have a good understanding of how issues in different countries relate to to each other and of the challenges that the region as a whole is facing today. \n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "Constitutional Struggles in the Muslim World", 
    "price": 0, 
    "instructors": "Ebrahim Afsah", 
    "institution_name": [
        "University of Copenhagen"
    ], 
    "commitment": "8-12 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/muslim-world", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}