{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    L’enseignement de l’histoire en France est traditionnellement découpé en quatre périodes canoniques : histoire ancienne, médiévale, moderne et contemporaine. Que signifient ces époques qui sont le produit d’une histoire avant tout européenne et méditerranéenne ? Ce qui pose la question de la pertinence de cette périodisation pour d’autres aires géographiques. Même en Europe, les délimitations des périodes ne recouvrent pas les mêmes bornes chronologiques selon les pays. En outre, ces inflexions dépendent des objets d’étude retenus puisque les structures économiques, les manières de manger, d’habiter, de croire, de faire la guerre, et plus généralement d’être présent au monde ne répondent pas forcément aux ruptures politiques qui ont souvent déterminé la périodisation.L’objectif du cours est de comprendre les raisons qui poussent l’historien à découper le temps. Fondamentalement, la périodisation vise à rendre intelligible le passé pour dégager des lignes de forces qui caractérisent une époque.\n\n                                            Syllabus\n                        Semaine 1 : Les mondes anciensSemaine 2 : Le Moyen Âge n'existe pasSemaine 3 : Les ruptures de l'époque moderneSemaine 4 : L'invention des 19ème sièclesSemaine 5 : Le 20ème siècle existe-t-il ?\n                                    ", 
    "end_date": "2016-06-06T00:00:00Z", 
    "title": "Découper le temps : les périodes de l'histoire", 
    "price": 0, 
    "instructors": "Jean-Marie Le Gall, Jean-Philippe Genet and Sylvie Pittia", 
    "institution_name": [
        "Université Paris 1 Panthéon-Sorbonne"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.fun-mooc.fr/courses/Paris1/16002S02/session02/about", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-05-02T00:00:00Z"
}