{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The Modern Civil Rights Movement is a significant landmark in United States history. This movement was a struggle for human rights directly challenging the nation to extend its democratic principles to African Americans and all peoples. This course sheds light on the often overlooked strategic planning that supported the direction of the events and is told by a voice intimately involved in the organization of movement—Dr. Bernard LaFayette, Jr. Topics include the history of the campaigns, the different coalitions and groups, philosophy and methods of nonviolent direct action, and the contemporary application of nonviolent conflict transformation. The course hosts several guest speakers, including Andrew Young, Reverend C.T. Vivian, Henry \"Hank\" Thomas, and Constance Curry.\n\nUpon completion of this course, learners will be able to:\n\n●  Discuss the contributions and involvement of civil rights activists and leaders in the Civil Rights Movement (CRM) campaigns in the United States. \n●  Examine the chronology and phases of the Movement and CRM campaigns.\n●  Recognize and characterize the diverse activist groups involved in the CRM. \n●  Discuss Martin Luther King Jr.’s philosophy of nonviolence from a historical perspective. \n●  List and define the principles and strategies of nonviolence. \n●  Examine organizational and social change applications related to nonviolence. \n●  Identify the role of nonviolence in modern activism along with additional resources to broaden knowledge of principles of nonviolence. \n●  Recognize the application of nonviolence theories to activism, current issues, and everyday life.\n\n                                            Syllabus\n                        Movements &amp; CampaignsUpon completion of this module, learners will be able to: 1) discuss the contributions and involvement of civil rights activists and leaders in the Civil Rights Movement (CRM) campaigns in the United States, and 2) examine the chronology and phases of the Movement and CRM campaigns.Organizations of the Civil Rights MovementUpon completion of this module, learners will be able to: 1) list the major groups of the American Civil Rights Movement,  2) discuss the impact of CRM groups, 3) discuss the importance of having multiple groups involved in the CRM, and 4) analyze the importance of strategy in organizing groups.Nonviolent Philosophies &amp; TacticsUpon completion of this module, learners will be able to: 1) list and define the six principles of nonviolence, 2) identify the six strategies of nonviolence, and 3) analyze the social dynamics of nonviolence.Organizational &amp; Social ChangeUpon completion of this module, learners will be able to: 1) describe the various applications of nonviolence, 2) outline the academic foundations of nonviolence, and 3) define and discuss social action.Education for Change and the Future of Nonviolence Conflict TransformationUpon completion of this module, learners will be able to: 1) recognize current nonviolence initiatives involving Dr. LaFayette, 2) examine the work of Emory University's Center for Advancing Nonviolence (ECAN), 3) differentiate between the various modern applications of nonviolence, and 4) assess the future of nonviolence and education for change. \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "From Freedom Rides to Ferguson: Narratives of Nonviolence in the American Civil Rights Movement", 
    "price": 0, 
    "instructors": "Bernard LaFayette, Jr. ", 
    "institution_name": [
        "Emory University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/nonviolence", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}