{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    This course will give you a perspective on the multiple historical pathways to our present. It builds on Global History Lab, Part 1, but you are welcome to take this course without having taken Part 1.\r\nThis course begins with a discussion of industrialization during the 1800s, and continues with a close look at the 20th century and current-day globalization. The course themes include economic integration, warfare and conflict, the transformation of the ecological balance, and cultural responses and innovations. To grapple with these themes, we explore first-hand perspectives of historical actors through a collection of texts and images.\r\nThis is an overview of world history–but with a difference. We will invite you to learn the history of the world not just by watching lectures and conducting weekly readings, but also by applying your knowledge. The core of this course is a series of lab assignments in which you and your fellow students will work in teams to use historical knowledge from the course to solve problems and develop new connections and interpretations of primary historical materials. The teams will post their ideas online for other students and teams to review and respond to. Over time, the course will become a dynamic gallery of collaborative student perspectives on history from around the world.\n\n                                    ", 
    "end_date": "2015-01-25T00:00:00Z", 
    "title": "Global History Lab, Part 2", 
    "price": 0, 
    "instructors": "Jeremy Adelman", 
    "institution_name": [
        "Princeton University"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://novoed.com/global-history-lab-2", 
    "duration": "13 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2014-10-26T00:00:00Z"
}