{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    This history course delves into the medieval history of the city of Burgos, from its inception in 884 c.e. as the homeland of the Spanish Kingdom of Castile and Leon, until the completion of the Spanish Reconquista in 1492. We will study complicated legendary heroes like Rodrigo Diaz de Vivar, “The Cid”, both a champion of the Christian Reconquista and a friend of Islamic rulers, who lays buried in the Cathedral of Burgos. Like the Cid, medieval Burgos presented two competing views for Spain’s future – one centered on overt Castilian supremacy and another more nuanced one that incorporated religious minorities, especially Jews and Jewish converts to Christianity (conversos), into every element of political, economic, and even religious life.\n\nThis course will investigate the disastrous impact of the Plague and how it led to the death of King Alfonso XI and the ruinous civil war between the half-brothers, Pedro “The Cruel” and Enrique II of Trastamára. We will also appraise the collapse of the kingdom’s “Old Christian” nobility and the generation of new elite clans, some of whom hailed from Jewish ancestries. It was also the era of anti-Jewish pogroms, Christian fixations on “blood purity” and unsuccessful pleas for Christian harmony, and the last gasps of Jewish, Christian, and Muslim coexistence.\n\nWe will virtually-tour the Cathedral of Burgos, the Museum of Burgos, and what remains of the city’s medieval neighborhoods and structures. We will also study and transcribe intriguing vellum and paper manuscripts from the cathedral and municipal archives so that we discover new facets of this history.\n\nNo knowledge of Spanish is needed to participate in the course or in our transcription efforts.\n\n                                    ", 
    "end_date": "2016-07-26T00:00:00Z", 
    "title": "HGA.2.1x: Deciphering Secrets: Unlocking the Manuscripts of Medieval Burgos (Spain)", 
    "price": 0, 
    "instructors": "Roger L. Martínez-Dávila", 
    "institution_name": [
        "Universidad Carlos iii de Madrid"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/deciphering-secrets-unlocking-uc3mx-hga-2-1x", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-14T00:00:00Z"
}