{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    1865-1890: The Unfinished Revolution, examines the pivotal but misunderstood era of Reconstruction that followed the Civil War, the first effort in American history to construct an interracial democracy. Beginning with a discussion of the dramatic change in historians’ interpretations of the period in the last two generations, the course goes on to discuss how Reconstruction turned on issues of continued relevance today. Among these are: who is an American citizen and what are citizens’ rights; what is the relationship between political and economic freedom; which has the primary responsibility for protecting Americans’ rights – the federal or state governments; and how should public authorities respond to episodes of terrorism? The course explores the rewriting of the laws and Constitution to incorporate the principle of equality regardless of race; the accomplishments and failings of Reconstruction governments in the South; the reasons for violent opposition in the South and for the northern retreat from Reconstruction; and the consolidation at the end of the nineteenth century of a new system of white supremacy.\n\nThis course is part of the XSeries, Civil War and Reconstruction, which introduces students to the most pivotal era in American history. The Civil War transformed the nation by eliminating the threat of secession and destroying the institution of slavery. It raised questions that remain central to our understanding of ourselves as a people and a nation – the balance of power between local and national authority, the boundaries of citizenship, and the meanings of freedom and equality. The XSeries will examine the causes of the war, the road to secession, the conduct of the Civil War, the coming of emancipation, and the struggle after the war to breathe meaning into the promise of freedom for four million emancipated slaves. One theme throughout the XSeries is what might be called the politics of history – how the world in which a historian lives affects his or her view of the past, and how historical interpretations reinforce or challenge the social order of the present.\n\n                                    ", 
    "end_date": "2016-06-15T00:00:00Z", 
    "title": "HIST1.3x: The Civil War and Reconstruction – 1865-1890: The Unfinished Revolution", 
    "price": 0, 
    "instructors": "Eric Foner", 
    "institution_name": [
        "Columbia University"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/civil-war-reconstruction-1865-1890-columbiax-hist1-3x", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-04-06T00:00:00Z"
}