{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    A House Divided: The Road to Civil War, 1850-1861 begins by examining how generations of historians have explained the crisis of the Union.  After discussing the institution of slavery and its central role in the southern and national economies, it turns to an account of the political and social history of the 1850s. It traces how the issue of the expansion of slavery came to dominate national politics, and how political leaders struggled, unsuccessfully, to resolve the growing crisis. We will examine the impact of key events such as Bleeding Kansas, the Dred Scott decision, the Lincoln-Douglas debates, and John Brown’s raid on Harper’s Ferry, and end with the dissolution of the Union in the winter of 1860-61.\n\nThis course is part of the X Series, Civil War and Reconstruction, which introduces students to the most pivotal era in American history. The Civil War transformed the nation by eliminating the threat of secession and destroying the institution of slavery. It raised questions that remain central to our understanding of ourselves as a people and a nation – the balance of power between local and national authority, the boundaries of citizenship, and the meanings of freedom and equality. This X Series will examine the causes of the war, the road to secession, the conduct of the Civil War, the coming of emancipation, and the struggle after the war to breathe meaning into the promise of freedom for four million emancipated slaves. One theme throughout the series is what might be called the politics of history – how the world in which a historian lives affects his or her view of the past, and how historical interpretations reinforce or challenge the social order of the present.\n\nImage courtesy of Library of Congress\n\n                                    ", 
    "end_date": "2015-12-09T00:00:00Z", 
    "title": "HIST1.1x: The Civil War and Reconstruction - 1850-1861: A Nation Divided", 
    "price": 0, 
    "instructors": "Eric Foner", 
    "institution_name": [
        "Columbia University"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/civil-war-reconstruction-1850-1861-columbiax-hist1-1x-1", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-30T00:00:00Z"
}