{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    Perhaps no story is as essential to get right as the history of capitalism. Nearly all of our theories about promoting progress come from how we interpret the economic changes of the last 500 years. This past decade’s crises continue to remind us just how much capitalism changes, even as its basic features—wage labor, financial markets, private property, entrepreneurs—endure. While capitalism has a global history, the United States plays a special role in that story. This course will help you to understand how the United States became the world’s leading economic power, revealing essential lessons about what has been and what will be possible in capitalism’s on-going revolution.\n\nFAQ\n\nDo I need to have taken economics before?\nNo. Though there will be discussion of economic ideas, professors will assume no prior economic training.\n\nI am not familiar with American history, but I am interested in how capitalism works. Can I take this course?\nYes. We will have relevant links to helpful background material for each section that should make it possible for those with no knowledge of U.S. history to take the class.\n\nIs this class about economic thought like Smith, Marx, Ricardo, Hayek, etc.?\nThis class is primarily about what actually happened rather than theories of what happened. While we will touch on important economic thinkers, this class will focus more on the people and institutions that developed capitalism in the United States. If you want to know how capitalism works and came about, this is the class for you.\n\nWill certificates be awarded?\nYes. If you complete the work and achieve a passing grade in the course, you can earn a Honor Code Certificate, which indicates that you have completed the course successfully. Certificates will be issued by edX under the name of CornellX, designating the institution from which the course originated.\n\nWhat will help me complete this course?\nWe have found that the best help you can get is other people in the real world. Enlist friends, co-workers, family, and other people to take the class with you. Ask your friends on Facebook or Twitter. Arrange a time during a lunch break or an evening to discuss the week’s videos and readings. Think of this “MOOC club” like a book club! You will get more out of the material and be much more likely to finish.\n\nI want to read more about American Capitalism!\nProfessors Baptist and Hyman just wrote a course reader expressly for this MOOC (though it is also being taught at Cornell University).\n\nContaining every reading from the MOOC, as well as additional readings from leading scholars (that could not be had for free!), this course reader provides the student with more background for every topic.\n\nEach reading is introduced and discussed by the professors. Each reading, as well, has additional questions for the student to discuss with their friends.\n\nAre there prerequisites?\n\nThis course is designed to be accessible for people without a strong background in U.S. history. Nevertheless, we make reference to many people, locations, events, or developments that may be unfamiliar to some students. Below are sources for additional information.\n\nWikipedia is a very helpful source for a quick definition or description of most of the material in this course. It can help you answer most factual questions you might have.\n\nDigital History is a website that can serve as an online text book if you need a stronger grounding in U.S. history.\n\nFor more difficult questions, you can post a question on the discussion board where your fellow students may be able to help you.\n\nAn e-book has been designed for this class, containing all the readings and some additional essays by leading scholars in the history of capitalism, including the professors. American Capitalism: A Reader [Kindle Edition] Amazon.com.\n\n                                    ", 
    "end_date": "2015-05-18T00:00:00Z", 
    "title": "HIST1514x: American Capitalism: A History", 
    "price": 0, 
    "instructors": "Louis Hyman and Edward E. Baptist", 
    "institution_name": [
        "Cornell University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/american-capitalism-history-cornellx-hist1514x-0", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-03-23T00:00:00Z"
}