{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    Jewish Diaspora in China is a unique experience for world Jewry, as China is the only country in Far East that has had Jews living in its society for over 1,000 years. Documentary evidence shows that Jews started to live in China no later than the Tang Dynasty (618–907). The famous Kaifeng Jewish community, which was established in Kaifeng, the Chinese capital of the Song Dynasty (960-1279), is but a best-known example. However, the largest Jewish Diaspora in China appeared in modern times. In over 100 years, from the mid-19th century to the mid-20th century, about 40,000 Jews came to China and lived in newly-established major port cities such as Hong Kong, Shanghai, Tianjin, and Harbin. Jewish communities composed of these Jews became an essential part of the economic and social life of those modern Chinese cities. What brought such a large number of Jews to China? Where did these people come from? How did they arrive? Were they all in China at the same time, and were there any differences among them? What happened to them after they arrived? Where are they now? The story of Jews in modern China is certainly a fascinating and up-lifting one. This course will examine these questions and more.\n\n                                            Syllabus\n                        IntroductionThis course, \"Jewish Diaspora in Modern China,\" will give you an understanding of the major issues related to the history of Jews in China in Modern times. Background: Jews and ChinaIn this module, we will introduce pre-modern Chinese society, wars with Western Powers, and the Open Door Policy. We will also analyze major causes that brought Jews to China. In particular, we will focus on waves of migrating Sephardic and Ashkenazi Jews to China, which mark the beginning of the history of the Jewish diaspora in modern China.The Jewish Community in ShanghaiIn this module, we will study four Jewish communities established in Shanghai from the second half of the 19th century to the mid-20th century, with a special focus on the Sephardic Jews and European Jewish refugees. The Jewish Community in HarbinIn this module, we will discuss Harbin as a newly established modern Chinese city. We will explore the Jewish communal life in the city from its leadership, various Zionist organizations, business, observance, and relations with adjacent Jewish communities in the region and in the country. The Jewish Community in TianjinIn this module, we will focus on the Jewish communal life in the port city of Tianjin, tracing its beginnings, development, and decline. We will also introduce some well-known Jewish individuals living in the city. The Jewish Community in Hong KongIn this module, we will explore the special status of Hong Kong as a center of Jewish life in China. We will trace the ups and downs of Jewish life in the city and the unique roles the Hong Kong Jewish Community played in the city-- the only Jewish community with a sustained, uninterrupted history in China over the past 160 years. Departure and ContributionsIn this module, we will analyze the factors that spurred the departure of about 40,000 Jews from China. We will also discuss their contributions-- economic and cultural-- on Chinese society today. History Renewed and ImpactIn this module, we will describe the re-establishment of Jewish communities in contemporary Chinese society, especially in Beijing and Shanghai, following the adoption of China's open-door policies and economic reforms in the 1980s. We will also discuss the impact of the re-establishment of Jewish communities on Chinese academia.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Jewish Diaspora in Modern China", 
    "price": 0, 
    "instructors": "Xin Xu", 
    "institution_name": [
        "Nanjing University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/jews-in-china", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}