{
    "selfpaced": true, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    Der Kurs zeichnet die Geschichte Karls des Großen nach. Sein Aufstieg, die innere Durchsetzung, die Expansion des Reiches bis zur Kaiserkrönung sind Kernthemen der Geschichtswissenschaft. Weitere Themenfelder sind: Strukturen des Reiches, Funktionsweisen mittelalterlicher Königsherrschaft ohne Hauptstadt und Institutionen, Schriftlichkeit, Kommunikation und Bildung im frühen Mittelalter. Vor allem möchte der Kurs in den Umgang mit mittelalterlichen Quellen und ihrer Deutung einführen. Er soll zuletzt zu einem fundierten, kritischen Urteil in aktuellen Fragen befähigen: wie gelangt man zu methodisch korrekten Erkenntnissen und wie lassen sich so unterschiedliche Karlsbilder bewerten.\r\nWas lerne ich in diesem Kurs?\r\n\r\nHintergrundinformationen zur Geschichte Karls des Großen.\r\nSie lernen typische Quellen seiner Zeit kennen und werden mit den Schwierigkeiten ihrer Interpretation vertraut gemacht.\r\nSie erhalten Einführungen in typische geschichtswissenschaftliche Fragestellungen und Forschungsinstrumente. Das befähigt Sie zu selbständigen Recherchen über Fragen des Kurses - und viele andere Fragen, die sich an die Geschichte des Mittelalters stellen lassen.\r\n\r\nWelche Vorkenntnisse benötige ich?\r\nHistorische Vorkenntnisse oder propädeutische Grundlagen sind nicht erforderlich. Der Kurs richtet sich neben Studierenden der Geschichte auch an ein ein breiteres, geschichtsinteressiertes Publikum. Inhalte und Umgang mit Instrumenten der Forschung werden schrittweise erläutert. Zentrale Quellen werden in deutschen Übersetzungen präsentiert. Lateinkenntnisse sind also nicht erforderlich. Unverzichtbar ist: Interesse an Geschichte als Wissenschaft!\n\n                                    ", 
    "end_date": null, 
    "title": "Karl der Große - Pater Europae?", 
    "price": 0, 
    "instructors": "Dr. Rainer Leng", 
    "institution_name": [
        "Julius-Maximilians-Universität Würzburg"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://iversity.org/en/courses/karl-der-grosse-pater-europae-may-2016", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2014-06-23T00:00:00Z"
}