{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The contemporary history of the Korean peninsula has been a tumultuous tale of decolonization, war and rapid economic development. Both North and South Korea has had an immense impact on the world stage and today many wonder why this region of East Asia appears so frequently in the international news.\n\nThis free online course, from Yonsei University in Seoul, will explore the modern history of Korea from 1945 to the present. The historical journey will wind its way through a catastrophic civil war, economic collapse, and the rapid rise of two model states within the Cold War framework.  We will examine how two rival nations emerged from the ashes of the war and ask such question as:\n\n● How did North Korea create a model socialist state and build a controversial nuclear program despite its economic collapse?\n\n● And how did South Korea achieve rapid economic development, despite decades of military rule and a long struggle for democracy?\n\nThe course will take us all the way down to the present day to explore the complexity of North-South relations and the fascinating details behind the rise of K-Pop and rapid demographic change in South Korea.\n\nThe educator for this course is Michael Kim, who is a professor of Modern Korean history at Yonsei University’s Graduate School of International Studies. Michael Kim was educated in the United States but has had a long professional career at Korea’s top private university. His unique qualifications will provide you with an insider and outsider’s perspective on modern Korea.\n\n\n                                    ", 
    "end_date": "2015-07-27T00:00:00Z", 
    "title": "Modern Korean History: Liberation, War and Nuclear Ambitions", 
    "price": 0, 
    "instructors": "Michael Kim", 
    "institution_name": [
        "Yonsei University"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/modern-korean-history?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-06-15T00:00:00Z"
}