{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The course provides an introduction to the scientific character of historical studies. As guidelines of access to history serve basic categories that capture and describe human action and thinking in space and time. Are taught traditional period divisions as well as the methodological diversity of the subject. The discussion of epochal breaks into a critical approach with a historical images. The course focuses on European history, being an example of the German story moves into the modern era in the foreground.\r\nWhat will I learn in this course?\r\n\r\nDifference between history and historiography\r\nCentral categories as historical research Arrivals\r\nGuidelines of the historical continuum and epochal breakthroughs\r\nIntroduction to the width of the historical subject area, in sub-disciplines and methods of the subject\r\nGeneral knowledge of historical processes from Antiquity to the Present\r\nSelf-employed, methodically reflected and critical use of primary sources and research opinions\r\n\r\nWhat knowledge do I need?\r\nPast experience or propaedeutic foundations are not required. The course is aimed at students of history and to all who are considering a degree in history. In addition, he is also directed to a broader audience interested in history. Content and use of instruments for research are explained step by step. Central sources will be presented in German translations. Indispensable: interest in history as a science.\n\n                                            Syllabus\n                        \r\n\r\n\r\nChapter 1\r\n\r\n\r\nWhat is history?\r\n\r\n\r\nChapter 2\r\n\r\n\r\nHistory as a science\r\n\r\n\r\nChapter 3\r\n\r\n\r\nHistory and sources\r\n\r\n\r\nChapter 4\r\n\r\n\r\nOrientation Ancient History\r\n\r\n\r\nChapter 5\r\n\r\n\r\nAncient History - Era term, sources, subjects and methods\r\n\r\n\r\nChapter 6\r\n\r\n\r\nOrientation Middle Ages\r\n\r\n\r\nChapter 7\r\n\r\n\r\nMiddle Ages - sources of history, worldviews, era term\r\n\r\n\r\nChapter 8\r\n\r\n\r\nOrientation Early Modern Times\r\n\r\n\r\nChapter 9\r\n\r\n\r\nEarly Modern Age - Era discussion and alternative terms\r\n\r\n\r\nChapter 10\r\n\r\n\r\nOrientation Modern History\r\n\r\n\r\nChapter 11\r\n\r\n\r\nModern and Contemporary history - definitions and discussion period, withholding and methodological problems, time history as a dispute History\r\n\r\n\r\nChapter 12\r\n\r\n\r\nState and regional history - forms, functions and themes\r\n\r\n\r\nChapter 13\r\n\r\n\r\nPast and Present - afterlife and reception functions of history in the knowledge of the present\r\n\r\n\r\n\n                                    ", 
    "end_date": "2016-01-19T00:00:00Z", 
    "title": "Orientierung Geschichte", 
    "price": 0, 
    "instructors": "Dr. Rainer Leng", 
    "institution_name": [], 
    "commitment": "4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://iversity.org/en/courses/orientierung-geschichte-november-2015", 
    "duration": "13 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2015-10-20T00:00:00Z"
}