{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The destruction of the First Temple in Jerusalem and the Babylonian Exile were a great catastrophe in the history of the Jewish Nation.  \nWhat really happened during that dark, fateful age, and how did new opportunities arise from the ashes?\n\n                                            Syllabus\n                         Introduction to geopolitics and geography of the Ancient Near EastWelcome to the first module of \"The Fall and Rise of Jerusalem\"! In this module you will be introduced to the geopolitical reality of the time of the Assyrian empire, followed by the Neo-Babylonian. We hope you'll find the videos informative and interesting. We encourage you to use the discussion forums in order to raise any questions or thoughts you might have after watching the videos.Judah Under Babylonian RuleThe second module deals with Judah under Babylonian rule. We will learn about the Babylonian Conquest of Hattu-land and Judah, the events that lead to Jehoiakim's revolt and its outcome, and the changes in the Babylonian policy towards Judah following this revolt. You are welcome to raise questions for discussion regarding these topics.The Days of the Destruction of JerusalemThis module deals with Zedekiah's rebellion and the destruction of Judah.You are invited to watch the following units and learn about the Egyptian intervention, the reasons for Zedekiah's revolt, and the history of the destruction of Judah.Gedaliah son of AhikamIn this module we will learn about the transition of the capital city from Jerusalem to Mizpah and the governorship of Gedaliah son of Ahikam in Mizpah following the destruction. We encourage you to use the discussions to ask about anything that isn't clear or raise your own ideas regarding the material you learned. Archaeology of the sixth century BCEAfter learning of the days of the destruction and the historical role of Gedaliah son of Ahikam, you are invited to watch the lessons of the fifth module, which deals with the archaeology of the Babylonian Period. We will explore the magnificent finds from Ramat Rahel, the stamp impressions and what they can teach us about continuity or discontinuity in this period and the fate of Jerusalem and Judah following the destruction. I also recommend watching the optional videos which deal with additional interesting research topics.   The restoration of Jerusalem in the early Persian PeriodThe last module of our course will deal with different aspects of the Persian period: the cult of Jerusalem, changes in Jerusalem's status, the Judahite diaspora, the fall of Babylon and much more. We hope you will enjoy this final module which closes the story of Jerusalem's fall and rise. \n                                    ", 
    "end_date": "2016-04-07T00:00:00Z", 
    "title": "The Fall and Rise of Jerusalem", 
    "price": 0, 
    "instructors": "Oded  Lipschits and Ido Koch", 
    "institution_name": [
        "Tel Aviv University"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/jerusalem", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-02-25T00:00:00Z"
}