{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The Holocaust was an inconceivable historical event, which forever robbed Western culture of its innocence. As civilized human beings, we fail to understand how events of such horror could have taken place, and how an idea so inhumanly warped could have spread like wildfire through an entire continent, instigating the systematic annihilation of millions of Jews.\n\nThis free online course was produced jointly by Tel Aviv University and Yad Vashem – the World Center for Holocaust Research. The course tracks the history of the Holocaust and has two parts. \"The Holocaust - An Introduction (I): Nazi Germany: Ideology, The Jews and the World\" is the first of the two courses and covers the following themes in its three weeks:\n\nWeek 1: From Hatred to Core Ideology\nWe will try to delve into Nazi ideology and the special place of Jews and Judaism in it. We will also discuss how the National Socialist Party converted the German Democracy of the Weimar Republic into a totalitarian regime within a short period of time, and its meaning for Jews and non-Jewish citizens.\n\nWeek 2: The World and the Jews in World War II\nWe will try to examine the broader contexts of the Holocaust and to place it, as part of World War 2. In this meeting we will also refer to the vital Jewish world to be found under various Nazi occupations and influences.\n\nWeek 3: The Isolation Abyss - the Perspective of the Individual\nWe will try to reveal different aspects of Jewish life in the face of the badge of shame, ghettos and segregation, as well as the formation of individual, societies’ and leader’s reactions in the face of a consistent policy of dispossession and discrimination.\n\nOnce you’ve completed this course, you can continue your learning with The Holocaust - An Introduction (II): The Final Solution\n\n\nThis online course is offered in an innovative, multi-level format, comprising:\n\n* Comprehensive lectures by leading researchers from Tel Aviv University and Yad Vashem.\n* A wealth of voices and viewpoints presented by guest lecturers.\n* Numerous documents, photos, testimonies and works of art from the time of the Holocaust.\n* Novel learning experience: Crowd sourcing – involving the learners themselves in the act of collecting and shaping information, via unique, exciting online assignments.\n\nREQUIREMENTS:\nThis course is designed for anyone with an interest in the Holocaust, including students, teachers, academics and policy-makers.\n\n                                            Syllabus\n                        From Hatred to Core Ideology; From Democracy to a Totalitarian State; Nazi Germany and the JewsWe will try to delve into Nazi ideology and the special place of Jews and Judaism in it. We will ask ourselves what, if anything, it renewed regarding traditional hatred of Israel and modern anti-Semitism and analyze Nazi documents to see how it reflects in them. Also, in this lesson we will discuss how the National Socialist Party succeeded in converting the German Democracy of the Weimar Republic into a totalitarian regime within a short period of time, and the significance of this process for its citizens - Jews and non-Jews alike.The World and the Jews in World War IIWe will try to examine the broader contexts of the Holocaust and to position it as a part of a various global conflicts that took place during world war 2. In this context, we will focus in a number of unique realities that were formed and created in Occupied Poland and France using them to identify key practices of Nazi Germany, European companies and the Jews who lived among them. We’ll look at the different fates of Jews in various European countries before and during World War 2, through the lens of the enormous changes which the Jewish world underwent in modern times: emancipation, secularization, urbanization and emigration.The Abyss of Isolation - the perspective of the individualInstead of policy, state and society at large, we’ll focus on the individual, the family and the Jewish communities across Europe, using a broad range of wartime accounts: official documents, diaries, letters, artwork and more. In this context, we will try to reveal different aspects of Jewish life in the face of shame, ghettos and segregation, as well as the formation of individual, societies and leaders reactions in the face of consistent policy of dispossession and discrimination. A variety of sources will help us create a complex puzzle consists of Jewish life in those dark days. In this context, we will try to reveal different aspects of Jewish life in the face of shame, ghettos and segregation, as well as the formation of individual, societies and leaders reactions in the face of consistent policy of dispossession and discrimination. A variety of sources will help us create a complex puzzle consists of Jewish life in those dark days.\n                                    ", 
    "end_date": "2015-02-14T00:00:00Z", 
    "title": "The Holocaust - An Introduction (I): Nazi Germany: Ideology, The Jews and the World", 
    "price": 0, 
    "instructors": "Professor Havi Dreifuss, PhD", 
    "institution_name": [
        "Yad Vashem ", 
        "Tel Aviv University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/holocaust-introduction-1", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-01-24T00:00:00Z"
}