{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The Holocaust was an inconceivable historical event, which forever robbed Western culture of its innocence. As civilized human beings, we fail to understand how events of such horror could have taken place, and how an idea so inhumanly warped could have spread like wildfire through an entire continent, instigating the systematic annihilation of millions of Jews.\n\nThis free online course was produced jointly by Tel Aviv University and Yad Vashem – the World Center for Holocaust Research. This course is the second of the two courses and covers three themes in its three weeks:\n\nWeek 1: The Final Solution\nWe’ll look at the cultural and mental processes that paved the way to the comprehensive and systematic mass murder of Jews in Europe – that is, the Final Solution. As part of this hard lesson we will discuss the various characteristics of the murder sites and death camps, and reveal selected aspects of the horror that occurred in them. \n\nWeek 2: Jewish and Non-Jewish Responses to the Holocaust\nWe will try to explore questions regarding knowledge about the application of the Final Solution, as well as a variety of responses and annihilation of victims, local populations and perpetrators.\n\nWeek 3: The End of the War\nWe will dedicate this lesson to the events that occurred in the last years of the Holocaust, as well as questions of memory, commemoration and future research. \n\nWe strongly recommend that you register for \"The Holocaust - An Introduction (I): Nazi Germany: Ideology, The Jews and the World\" as well. Taking both parts of the course would enable you to obtain a fuller and more comprehensive knowledge about The Holocaust.\n\nThis online course is offered in an innovative, multi-level format, comprising: \n\nComprehensive lectures by leading researchers from Tel Aviv University and Yad Vashem.\nA wealth of voices and viewpoints presented by guest lecturers\nNumerous documents, photos, testimonies and works of art from the time of the Holocaust.\nNovel learning experience: Crowdsourcing – involving the learners themselves in the act of collecting and shaping information, via unique, exciting online assignments.\n\n                                            Syllabus\n                        The Final Solution and the Drive for Eliminating All Jews and All Perceived Jewish \"Influences\"This lesson will be devoted to the cultural and mental processes which paved the way to the comprehensive and systematic mass murder of Jews. We will deal with the specific decision-making process regarding the murder of the entire European Jewry, the implementation of the initial murder, the broadening circle of killing, and the early Jewish reactions to the \"Final Solution\".Jewish and Non-Jewish Responses to the HolocaustWe will look at a broad spectrum of questions, including: \"As Lambs to the Slaughter\"? Choiceless choices? Did the world remain silent? Why were Auschwitz and Birkenau not bombed? And more. Discussion of the various issues and frameworks will challenge the existing definitions regarding resistance and rescue, and examine patterns of cooperation with persecutors alongside rebellious acts by Jews and non-Jews alike. As part of this important discussion, we will return to our previous examination of the Jewish leadership and re-evaluate the responses of various Jewish leaders to the annihilation campaign, while pointing out the complexities of the subject matter.The Free World, the last months, the Aftermath and the Implications This lesson will describe the steps taken by Nazi Germany, with the Allied advance across Europe, to increase efforts to exterminate the Jews and to destroy all evidence of their crimes. We will deal with questions of memory and commemoration, examine the significance of the Holocaust for different audiences, and present the latest research in the field of Holocaust studies.\n                                    ", 
    "end_date": "2016-02-14T00:00:00Z", 
    "title": "The Holocaust - An Introduction (II): The Final Solution", 
    "price": 0, 
    "instructors": "Professor Havi Dreifuss, PhD", 
    "institution_name": [
        "Yad Vashem ", 
        "Tel Aviv University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/holocaust-introduction-2", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-01-24T00:00:00Z"
}