{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    This free online course focuses on when and how the West first approached China. We will explore the influence that the discovery of China exerted on late medieval and early modern European minds.\n\nExplore Chinese history through the eyes of Westerners\n\nThe backdrop of the course is the history of China. We will begin by looking at China’s place in the world and connections to the West via the Silk Road, before examining the changes brought about by the Song dynasty, the rise of Genghis Khan and the Mongol Empire, and finally the Ming dynasty.\n\nWe’ll analyse this period of Chinese history through the eyes of travellers, discoverers and missionaries who wrote about China from the 13th to the 17th century. These will include Marco Polo - not the first European to discover China, but the first to chronicle his time there in detail - and later Portuguese settlers, such as Galeote Pereira.\n\nWe’ll also take advantage of Chinese and European illustrated sources, like scrolls, paintings and maps, to give a more accurate picture of how China really was at each time.\n\nUnderstand how Europe constructed the image of China\n\nThrough these sources, we’ll see how Europeans constructed a highly positive image of China that would persist until the 18th century.\n\nWhat these Western travellers saw, what they didn’t see, what they choose not to tell and what they invented - that’s the story that we will unravel in this course.\n\n\n                                    ", 
    "end_date": "2015-11-23T00:00:00Z", 
    "title": "The European Discovery of China", 
    "price": 0, 
    "instructors": "Dolors Folch", 
    "institution_name": [
        "Pompeu Fabra University"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/european-discovery-china?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-09-28T00:00:00Z"
}