{
    "selfpaced": true, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    This course, produced with The Great Courses, will look at four key themes in the History of America as presented by Dr. Richard Kurin, Undersecretary for History, Art and Culture at the Smithsonian.\n\nAmerican Icons – from the Star Spangled Banner to the Statue of Liberty – how have these become iconic symbols for Americans?  What do these icons represent in a global context?\n\tRights and Liberties – from the Declaration of Independence to the Greensboro Lunch Counter, how have Americans defined, and continue to define, their rights and governance?\n\tAmerica the Beautiful – From evidence of the continent’s first inhabitants to the conservation efforts of the Smithsonian’s scientists, how have the American people – both native and settler – envisioned, explored, worked and protected the land and its resources?\n\tSpirit of Invention – from the Model T to the space program, how have America’s pioneering inventions changed the world?\nIn this course you will gain a unique perspective on American history and culture by learning the stories behind objects that were, and continue to be, an essential part of U.S. history. Most importantly, you will reflect on what objects have personal meaning to you, and the role that symbolic objects play in your own histories.\n\nThis course is adapted from the video lecture series produced by Smithsonian and The Great Courses, Experiencing America: A Smithsonian Tour Through History.\n\n                                    ", 
    "end_date": "2015-05-13T00:00:00Z", 
    "title": "USHIS1.2x: Smithsonian’s Objects That Define America", 
    "price": 0, 
    "instructors": "Richard Kurin", 
    "institution_name": [
        "Smithsonian Institution"
    ], 
    "commitment": "1-2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/smithsonians-objects-define-america-smithsonianx-ushis1-2x", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-04-15T00:00:00Z"
}