{
    "selfpaced": true, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    This MIT and Harvard co-taught course examines Japanese history and uncovers the skills and questions involved in reading history through digital imagery. The introductory module considers methodologies historians use to “visualize” the past, followed by three modules that explore the themes of Westernization, in Commodore Perry’s 1853-54 expedition to Japan; social protest, in Tokyo’s 1905 Hibiya Riot; and modernity, as seen in the archives of the major Japanese cosmetics company, Shiseido.\n\nThe course will cover the following topics in four modules:\n\nModule 0: Introduction: New Historical Sources for a Digital Age (Professors Dower, Gordon, Miyagawa). Digitization has dramatically altered historians' access to primary sources, making large databases of the visual record readily accessible. How is historical methodology changing in response to this seismic shift? How can scholars, students, and the general public make optimal use of these new digital resources?\n\tModule 1: Black Ships &amp; Samurai (Professor Dower). Commodore Matthew Perry's 1853-54 expedition to force Japan to open its doors to the outside world is an extraordinary moment to look at by examining and comparing the visual representations left to us by both the American and Japanese sides of this encounter. This module also addresses the rapid Westernization undertaken by Japan in the half century following the Perry mission.\n\tModule 2: Social Protest in Imperial Japan: The Hibiya Riot of 1905 (Professor Gordon). The dramatic daily reports from participants in the massive \"Hibiya Riot\" in 1905, the first major social protest in the age of \"imperial democracy\" in Japan, offer a vivid and fresh perspective on the contentious domestic politics of an emerging imperial power.\n\tModule 3: Modernity in Interwar Japan: Shiseido &amp; Consumer Culture (Professors Dower, Gordon, Weisenfeld). Exploring the vast archives of the Shiseido cosmetics company opens a fascinating window on the emergence of consumer culture, modern roles for women, and global cosmopolitanism from the 'teens through the 1920s and even into the era of Japanese militarism and aggression in the 1930s. This module will also tap other Visualizing Cultures units on modernization and modernity.\nThe course is based on the MIT \"Visualizing Cultures\" website devoted to image-driven research on Japan and China since the 19th century (visualizingcultures.mit.edu).\n\nNOTES:\n\nUTokyo001x: Visualizing Postwar Tokyo, by University of Tokyo, follows in this series.\n\nFor MIT students: VJx will be part 21F.027J Visualizing Japan in the Modern World, a residential course taught by Professor Miyagawa, Fall 2015.\n\nIn addition to MITx and HarvardX, this project is supported by the U.S. Japan Foundation, the University of Tokyo, and the Reischauer Institute of Japanese Studies, Harvard University.\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                    ", 
    "end_date": "2016-02-23T00:00:00Z", 
    "title": "VJx: Visualizing Japan (1850s-1930s): Westernization, Protest, Modernity", 
    "price": 0, 
    "instructors": "John W. Dower, Andrew Gordon, Shigeru Miyagawa and Gennifer Weisenfeld", 
    "institution_name": [
        "Harvard University", 
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "5-6 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/visualizing-japan-1850s-1930s-harvardx-mitx-vjx-1", 
    "duration": "23 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-15T00:00:00Z"
}