{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    2014 marks the centennial year of the beginning of World War 1. The war began in the Balkans, but it soon spread to become a European conflict, and developed into a world war.\n\nIt was a war of unprecedented scale and brutality, with countless casualties. It also left a poisonous legacy for the 20th century and beyond, and many of the issues that were left unresolved in 1918 would lead to another world war in 1939. 1914-1918 was a period in history that has proved provocative and culturally resonant for the last hundred years.\n\nOn this free online course, you will study the subject of physical and mental trauma, its treatments and its representation. You will focus not only on the trauma experienced by combatants but also the effects of World War 1 on civilian populations.\n\nOver three weeks, you will discover just how devastating the effects of World War 1 were in terms of casualties across the many combatant nations, and look in depth at the problem of “shell shock” and how deeply it affected the lives of those who lived through it. You will also develop the skills to carry out your own independent research.\n\nThe war was not only experienced on the battlefield, however, and you’ll explore the many and varied ways in which civilians’ lives were affected by it. For example, in the way combatant casualties affected the lives of loved ones who were left behind.\n\nFinally, you will look at how the trauma of World War 1 has been depicted in art and literature, and see what has been learned from the past in the modern day treatment of combat stress reactions and post-traumatic stress disorder (PTSD).\n\nFor a taste of what will be covered in this course, read a post from lead educator, Annika Mombauer, on our blog: “Remembrance Sunday: how World War 1 changed the way we mourn the dead.”\n\nThis course is part of a series designed in partnership with the BBC to commemorate the war. Using archive material, you will see how representations of trauma have changed over the years.\n\nThe other courses in this series are:\n\n\n  \n    World War 1: Paris 1919 - A New World Order? (University of Glasgow)\n  \n  \n    World War 1: Aviation Comes of Age (University of Birmingham)\n  \n  \n    World War 1: Changing Faces of Heroism (University of Leeds)\n  \n\n\nYou may also be interested in\n\n\n  World War 1: A History in 100 Stories (Monash University)\n\n\n\n                                    ", 
    "end_date": "2015-12-07T00:00:00Z", 
    "title": "World War 1: Trauma and Memory", 
    "price": 0, 
    "instructors": "Annika Mombauer", 
    "institution_name": [
        "The Open University"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/ww1-trauma?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-11-16T00:00:00Z"
}