{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The Paris Peace Conference of 1919 ended a Great War, but it also designed the post-war future. In 1919, world leaders assembled in Paris redrew the map of the world, partitioned and created countries, and ushered in a new era of international relations. The naivety of the peace-makers of 1919 has been justly criticised. However, in setting up a permanent ‘world organisation’, the League of Nations, they changed the management of world affairs forever.\n\nProduced in collaboration with the BBC, this three-week course will let you retrace the steps of those who took those momentous decisions almost a century ago, and to get a sense for the consequences of their decisions. You’ll have a chance to assess how, over the past century, world organisations (first the League of Nations, then the United Nations) have become a forum for international cooperation.  And you’ll be encouraged to debate many of the issues that have vexed international politics since then.\n\nTo find our more, read Christian J. Tams’s post for our blog: “From Islamic State to Ebola: how 1919’s Paris Peace Conference still shapes world affairs.”\n\nThis course is part of a series designed in partnership with the BBC to commemorate the war.\n\n\n  \n    World War 1: Aviation Comes of Age (University of Birmingham)\n  \n  \n    World War 1: Changing Faces of Heroism (University of Leeds)\n  \n  \n    World War 1: Trauma and Memory (The Open University)\n  \n\n\nYou may also be interested in:\n\n\n  World War 1: A History in 100 Stories (Monash University)\n\n\n\n                                    ", 
    "end_date": "2015-07-13T00:00:00Z", 
    "title": "World War 1: Paris 1919 - A New World Order?", 
    "price": 0, 
    "instructors": "Christian Tams", 
    "institution_name": [
        "University of Glasgow"
    ], 
    "commitment": "5 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/ww1-new-world-order?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2015-06-22T00:00:00Z"
}