{
    "selfpaced": false, 
    "topic_name": [
        "History"
    ], 
    "description": "\n\n                    \n                    \n                    The centenary of the First World War is a time for reflection and exploration. In this short course you will discover just some of the ways that heroism is portrayed through art and film.\n\nYou will explore recruitment posters and the messages they portrayed for both those going to war and those staying at home, as well as researching WW1 art and reflecting upon a painting you have chosen. You will then move on to explore contemporary German film consolidating your learning by reviewing a recent book, film, or TV programme about the First World War.\n\nNote for students\n\nThis course is part of a collection from the University of Leeds  which have been specifically designed for those studying at school or college. All of the courses will help to enrich and extend your knowledge in a specific topic and develop your transferable skills.  These courses will help you with making decisions about which subject to study at university and will give you examples and evidence when developing your university application.\n\nThroughout the course you will join a community of online learners, providing an opportunity for interactive learning with other students both in the UK and internationally.\n\nEach course is designed to complement your existing studies and aims to:\n\n\n  provide evidence for UCAS applications and prepare you for university\n  help you to gain new skills, think critically and learn independently\n  encourage online / social learning\n  develop collaboration and analytical skills\n  embed current research into your online learning\n\n\nFor information about degrees available at the University of Leeds, please visit our course finder website.\n\nNote for teachers\n\nAimed at prospective Undergraduate students both in the UK and internationally, our online courses provide a ‘taster’ of Undergraduate study at the University of Leeds.\n\nOur courses benefit from being shaped by the latest research from the University of Leeds and are presented by leading academics who are actively engaged in pioneering research. They will inspire your students to think critically and develop their knowledge and analytical skills.\n\nThe course can be used as a wider classroom or enrichment resource or can be used independently by students to discover more about the subject area. Each course provides flexible study and benefits from online discussions with other learners.\n\nIf you would like to know more about this course or the range of courses from the University of Leeds designed specifically for schools and colleges, please visit our teachers’ pages for further information and resources.\n\n\n                                    ", 
    "end_date": "2016-12-19T00:00:00Z", 
    "title": "WW1 Heroism: Through Art and Film", 
    "price": 0, 
    "instructors": "Alison Fell", 
    "institution_name": [
        "University of Leeds"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/ww1-heroism-art-film?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-12-05T00:00:00Z"
}