{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p style=\"\">&quot;<em style=\"\">Parabéns ao Raiam pela iniciativa de ajudar e guiar jovens brasileiros a realizar o sonho de estudar fora, e pelo ótimo curso produzido, com abordagens diretas sem enrolação, bastante informativo, pois fala de assuntos ou situações em que não conhecíamos, ou tínhamos alguma ideia errada sobre aquilo, e só quem já teve essa experiência pode nos falar como realmente é. E é ótimo ter dicas e o passo a passo para ajudar na hora de fazer a inscrição no SAT e outros testes, que vão nos levar a brigar por uma bolsa em faculdades americanas, com certeza depois desse curso sairemos com uma boa vantagem contra a concorrência. Muito obrigado pela oportunidade</em>.&quot;<br style=\"\"><strong style=\"\">Ítalo Augusto Siqueira, aluno</strong><br style=\"\"><br style=\"\"><em style=\"\">&quot;Esse curso, sem nenhuma dúvida, é um divisor de águas! Estou na metade dele e com certeza, ele já mudou a minha vida e a perspectiva do meu futuro pra sempre. O Raiam é um cara sensacional! Muito carismático, explicativo e bem humorado durante o curso, sem falar que está sempre disposto a conversar e tirar dúvidas. Se você quer mudar a sua vida, e ter uma chance de estudar nas melhores universidades americanas e do mundo, entre já no curso, dou a minha palavra que você não irá se arrepender&quot;</em><strong style=\"\">.<br style=\"\"></strong><strong style=\"\">Alexandre Krum, aluno</strong><br style=\"\"><br style=\"\">Já sonhou em estudar em uma grande universidade americana? Assistir jogos de College Football no estadio, freqüentar festas de fraternidades e ter amigos de dezenas de países diferentes? Já pensou em conseguir um diploma de universidades como Harvard, Yale, MIT e Princeton?<br style=\"\">  \t<br style=\"\">  \t         A hora é agora! <br style=\"\">  \t<br style=\"\">  \t         O workshop <strong style=\"\">Como ganhar bolsa para universidades americanas</strong> tem todas as ferramentas que você precisa para estudar em uma universidade americana sem pagar nada.  </p>  <p style=\"\">  \t         São 70 lições e mais de 3 horas de curso com informações preciosas sobre o processo de admissão das melhores universidades do mundo!<br style=\"\">  \t<br style=\"\">  \t         No workshop você vai aprender: <br style=\"\">  \t<br style=\"\">  \t         - Como conseguir bolsas de estudos de até <strong style=\"\">250mil dólares</strong><br style=\"\">  \t<br style=\"\">  \t         - Tudo sobre os principais <strong style=\"\">testes de admissão</strong> para faculdades americanas<br style=\"\">  \t<br style=\"\">  \t         - Como usar sua <strong style=\"\">nacionalidade brasileira a seu favor</strong> no processo de admissão e na conquista de bolsas<br style=\"\">  \t<br style=\"\">  \t         - As diferenças entre o <strong style=\"\">sistema universitario</strong> americano e o brasileiro<br style=\"\">  \t<br style=\"\">  \t         - Como preencher um <strong style=\"\">COLLEGE APPLICATION</strong> do inicio ao fim<br style=\"\">  \t<br style=\"\">  \t         - Quais são os temas dos <strong style=\"\">COLLEGE ESSAYS</strong> das principais universidades<br style=\"\">  \t<br style=\"\">  \t         - Que universidades são as <strong style=\"\">mais festeiras</strong> dos Estados Unidos<br style=\"\">  \t<br style=\"\">  \t         - Como se preparar para fazer o <strong style=\"\">SAT, o ACT e o TOEFL</strong><br style=\"\">  \t<br style=\"\">  \t         - De onde vêm os recém-graduados com os <strong style=\"\">maiores salarios</strong> dos Estados Unidos<br style=\"\">  \t<br style=\"\">  \t         - Como escrever um COLLEGE ESSAY que te <strong style=\"\">destaque do resto dos candidatos</strong><br style=\"\">  \t<br style=\"\">  \t         - Que universidades oferecem <strong style=\"\">bolsas para estudantes brasileiros</strong> e o que fazer para entrar lá<br style=\"\">  \t<br style=\"\">  \t         - Que <strong style=\"\">instituições brasileiras patrocinam</strong> jovens cujas familias não conseguem bancar uma graduação nos Estados Unidos?  </p>  <p style=\"\">  \t        Tudo isso explicado de uma maneira clara e descontraída pelo apresentador de TV, especialista em intercambio, atleta da Seleção Brasileira de Futebol Americano e ex-bolsista da University of Pennsylvania Raiam dos Santos. <br style=\"\">  \t<br style=\"\">  \t    O QUE ESSE CURSO <strong style=\"\">NÃO COBRE</strong>:<br style=\"\">  \t- Bolsas de curto prazo do governo brasileiro em programas como <em style=\"\">Ciencias Sem Fronteiras</em><br style=\"\">  \t- Intercambios de high school<br style=\"\">  \t- Cursos de Inglês no exterior <br style=\"\">  \t- Negociações com técnicos de programas universitarios<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Como fazer faculdade de graça nos Estados Unidos", 
    "price": "50.00", 
    "instructors": "Raiam Santos", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404430_fee9_7.jpg", 
    "course_url": "https://www.udemy.com/estudenoseua/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T15:24:51Z"
}