{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p><strong>Welcome!</strong> My name is Christian and I'm a highly-experienced pro SAT tutor with multiple perfect test scores under my belt.</p><p><strong>SAT Vocabulary</strong> has always been a speciality of mine, even since I was in high school myself. Because of my daily habits, careful planning, and elite-level SAT tutoring, I found it quite easy to get a perfect score on SAT vocabulary by the time I was in 10th grade. </p><p><strong>Since graduating from a Top-10 ranked college</strong> and founding my own SAT tutoring business Love the SAT!, I've helped coach hundreds of high school students to higher SAT verbal scores in under 5 years though my natural gift and talent (even passion!) for vocabulary skills.</p><p><strong>Let me share my natural gifts of vocab with you</strong> (or your high schooler) so that you too can get closer to YOUR perfect score on the SAT vocab and verbal sections.</p><p><strong>These timeless lessons</strong> will apply to any college-bound high schooler aspiring to develop their vocabulary for SAT / ACT testing and for all the college-level vocabulary that they will soon encounter.</p><p><strong>This complete introduction to SAT vocabulary skills includes:</strong></p><p><strong>Over an hour of high-definition video</strong> from a perfect-scoring, highly experienced pro SAT tutor. Hi-def video and audio gives me the chance to share my knowledge of vocabulary without a crummy audio-visual experience getting in the way.<br></p><p><strong>More than 20 independent lectures</strong> on score-boosting topics from the best vocab flashcard techniques to the <em>true</em> value behind vocab shortcuts like roots, prefixes, and suffixes. </p><p>(<strong>For example,</strong> <strong>d</strong><strong>o you know</strong> how you can use cutting-edge technology <em>and</em> a three-thousand-year-old language to boost your SAT vocab score?)<br></p><p><strong>Supplemental materials</strong> are included in the course, like PDF articles from our SAT prep blog archives with exclusive content you won't get from anybody else.<br></p><p><strong>Final Review Quiz</strong>. Demonstrate your knowledge and increase your confidence and comprehension with the comprehensive end-of-course quiz.</p><p><strong>30-day money back guarantee</strong> (no questions asked). This is extended by Udemy and I fully support your right to be satisfied with the video course or else get a complete refund.</p><p><em>If you're still reading, this course was tailor-made for YOU - <strong>now it's time to take action!</strong></em><strong></strong><br></p><p><strong>Click the \"Enroll\" button</strong> at the top-right of your screen to take this course and get your SAT vocab score going up in under 60 seconds!</p>", 
    "end_date": null, 
    "title": "Conquer SAT Vocabulary For Higher Reading & Verbal Scores!", 
    "price": "20.00", 
    "instructors": "Christian Heath", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/713456_ae55_2.jpg", 
    "course_url": "https://www.udemy.com/conquer-sat-vocabulary/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-02T17:17:43Z"
}