{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p><strong>*This course prepares for the previous version of the SAT and PSAT, prior to March 2016. </strong></p>\n\n<p><strong>*To prepare for the current SAT and PSAT, please visit </strong><strong>DOUBLE800 for redesigned SAT &amp; PSAT online courses.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t    A complete preparation course for all subjects on the SAT and PSAT:                         Math, Critical Reading, Writing (including Essay). This online video program is as comprehensive as our popular 8-week live prep course, which has helped thousands of students pursue their college dreams.</p><p>First, the student will review all concepts and rules with official College Board questions, categorized by order, within the subjects of the SAT. After reviewing tested concepts (and optimal problem-solving strategies and techniques) in each subject area, student will independently take an official College Board SAT test. Student will then score and review all test answers in the videos. Student will complete this test and review process three separate times. By the conclusion of the program, the student will gain total familiarity and confidence with every question type on the SAT, and walk into the test knowing exactly what to expect.</p>\n\n\n\n<p>Each lesson is ~ 10 minutes or less, and students can learn and review at their own pace. Students can submit additional questions, and we will post supplemental videos to answer queries.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                       This course is taught by Micah Salafsky, the founder and principal member of DOUBLE800. Micah holds graduate degrees in business and law, and has instructed classes and tutored students for the SAT and PSAT since 2002.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t      The Official SAT Study Guide, 2nd Edition is required to follow these lessons.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                       We look forward to working with you!  </p>", 
    "end_date": null, 
    "title": "DOUBLE800 SAT & PSAT Prep Course", 
    "price": 0, 
    "instructors": "DOUBLE800 LLC", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/165402_c00b_3.jpg", 
    "course_url": "https://www.udemy.com/double800/", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-17T03:47:50Z"
}