{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Hello Udemy! Welcome to my LSAT prep course. It is an honour and a privilege to share my material with the Udemy community.</p><p>This course is intended for those who are interested in applying to law school and will be writing the Law School Admissions Test. People who generally take this course are at least 19 years of age, and have at least 2 years of University under their belt.</p><p>This course includes a student manual with answer key, video and pdf explanations of questions, worksheets to enhance understanding of the different question categories, and virtual manipulatives to aid in developing a concrete understanding of diagramming for the Analytical Reasoning section. </p><p>The course is intended to be a 4 week course in which students practice twice a week, and cover three question categories per session. Each session in a classroom setting takes approximately 3 hours. </p><p>This course will give you a good practical understanding of the Logical Reasoning, Analytical Reasoning, and Reading Comprehension section. It already has helped law school candidates write a successful LSAT. Furthermore, compared to the competition, this course is offered at a very reasonable price by a person with teaching experience and an admissions offer into a prestigious law school. I look forward to meeting you and helping you in your LSAT journey.</p>", 
    "end_date": null, 
    "title": "Education 180 - LSAT Prep", 
    "price": "30.00", 
    "instructors": "Daniel Loucks", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538158_bbeb_6.jpg", 
    "course_url": "https://www.udemy.com/education-180-lsat-prep/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T18:40:58Z"
}