{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>  \t  Vocabulary is the key to success on the Verbal Reasoning and Critical Reading sections of every standardized test.  If you are taking the SAT, GRE, ISEE, SHSAT, ELA or any other standardized test, you need to have a rich and varied vocabulary.  You need to learn many words--and chances are that you need to learn those words quickly in an easy, effective manner that doesn’t overload your already “too busy” schedule. You need to learn more to score more in less time. Word Parts for Word Smarts is a simple way to learn thousands of complex words--fast!  </p>  <p>  \t  Experts would agree (and the evidence is incontrovertible) that the fastest--and most effective--way to acquire a powerful vocabulary is by learning and applying word parts such as roots, prefixes, and suffixes.  Word parts are the building blocks of words, and because English was built primarily on Latin and Greek foundations, hundreds of thousands of words in our language were constructed with Latin and Greek word parts.  What’s shocking (and really good news for us all) is that most of the Latin and Greek derivatives come from just a few word parts.  For example, five prefixes (Im, In, Dis, Re, Un) constitute nearly 57% of all English words with a prefix.  It means, also, that the same Latin and Greek elements were used to create thousands of different words.  </p>  <p>  \t<strong style=\"\">  Here’s our Five Step Method for learning new words--fast!  </strong>  </p>  <p>  \t  Example word:<strong style=\"\"> INTRACTABLE</strong>: What does this word mean?  </p>  <p>  \t<strong style=\"\">Sentence example</strong>: The conflict in the Middle East is intractable.  </p>  <ol style=\"\">  \t<li><strong style=\"\">Break the word into its parts: </strong></li>  </ol>  <p>  \t  In tract able  </p>  <ol style=\"\">  \t<li><strong style=\"\">Think of a simple word which contains the root and/or prefix and illustrates the meaning of that root or prefix.  Learn the meanings of those parts from the word or words you have chosen.</strong></li>  </ol>  <p>  \t  Simple key words: <strong style=\"\">Attract </strong>(contains ‘tract”) <strong style=\"\">Incomplete</strong> (contains “In”)  </p>  <ol style=\"\">  \t<li><strong style=\"\"> Learn the meaning of that word part or those word parts from the simple key words.</strong> </li>  </ol>  <p>  \t  Since attract means to draw someone to you, and “at” means ‘to”, tract must mean “draw or pull.” Tract also means to “manage” or to “control.”  </p>  <ol style=\"\">  \t<li><strong style=\"\"> Use your word parts knowledge to decode the complex word.</strong></li>  </ol>  <p>  \t<strong style=\"\">“In”</strong> means <strong style=\"\">not,</strong> <strong style=\"\">“tract”</strong> means to<strong style=\"\"> draw, pull,or manage,</strong> and “<strong style=\"\">able”</strong> means capable.  </p>  <p>  \t<strong style=\"\">Intractable means</strong>: not able to be managed. If a problem is “intractable,” it’s nearly impossible to solve.  </p>  <ol style=\"\">  \t<li><strong style=\"\">If the word was found in a sentence, substitute that meaning back into the sentence to see if it makes sense in the context of that sentence.</strong></li>  </ol>  <p>  \t<strong style=\"\">Course Outline:</strong>  </p>  <p>  \t<strong style=\"\">The course is arranged as follows:</strong>  </p>  <p>  \t<strong style=\"\">Section One is titled Prefix Smart.</strong>  </p>  <p>  \t  In this section you will learn the meanings of the most valuable prefixes and the simple key or anchor words that will help you to remember them.  </p>  <p>  \t<strong style=\"\">Section Two is titled Root Smart.</strong>  </p>  <p>  \t  In this section, you will discover the meanings of the most productive roots and the simple key or anchor words that will help you to remember them.  </p>  <p>  \t<strong style=\"\">Section Three is titled: Putting it all together: How to apply the Word Parts for Word Smart System.</strong>  </p>  <p>  \t  In this section, you will use the prefix and root parts of simple key words to decode and to learn more complex words that share those parts.  </p>", 
    "end_date": null, 
    "title": "English Vocabulary Made Easy for Everyone", 
    "price": "25.00", 
    "instructors": "Brian Vieira", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405108_cfd6_5.jpg", 
    "course_url": "https://www.udemy.com/word-parts-for-word-smarts-learn-more-words-in-less-time/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T07:27:39Z"
}