{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p style=\"\">  \t  Welcome to Griffin SAT!  </p>  <p style=\"\">  \t  This is a complete course in the Math, Critical Reading, and Writing sections of the SAT. It is a <em style=\"\">condensed</em> and <em style=\"\">comprehensive</em> course&mdash;and these qualities constitute its real value. Yes, there are many places you could go to look for SAT study material, but here I have condensed a decade&#039;s worth of experience tutoring the SAT into a single 24 video course that covers EVERYTHING.  </p>  <p style=\"\">  \t  Our motto is &quot;24 Videos To a 2400!&quot; Or at least, &quot;24 Videos <em style=\"\">Towards</em> a 2400!&quot;  </p>  <p style=\"\">  \t  I know how valuable your time is. I tutor high school kids day in and day out. I know how much devotion and time and energy it takes to sit and watch a video, let alone 24 of them, so I have made this video course as <em style=\"\">streamlined</em> and <em style=\"\">thorough</em> as possible.  </p>  <p style=\"\">  \t  The class can be taken as one&#039;s primary course of study for preparing for the SAT or it can perfectly complement one&#039;s outside work with a private tutor or an in-class SAT course. You could take the course over a month or so (or even less), or you could stretch it out over several months. You could also take the course twice!  </p>  <p style=\"\">  \t  The course is taught by me, Paul Griffin (Princeton &#039;01), a full-time tutor and web educator with ten years of experience tutoring the SAT for ambitious New York City private school students. I have helped my students gain admittance to Harvard, Princeton, Yale, Cornell, Amherst, Duke, Wash U, Dartmouth, Stanford, and many other top tier universities. I know the game well! You are in good hands!  </p>  <p style=\"\">  \t  Here is the structure and basic content of the course:  </p>  <p style=\"\">  \t  OPENING TALKS:  </p>  <p style=\"\">  \t  &mdash;One video on the basic structure and scoring of the exam in which we also discuss how to establish good homework habits and create the right mindset to ace this thing!  </p>  <p style=\"\">  \t  &mdash;One lecture on the Five Most Important General Techniques for Success to be applied across the entire exam.  </p>  <p style=\"\">  \t  MATH:  </p>  <p style=\"\">  \t  &mdash;Three key lectures on the necessary tricks for the Math: the Plug-In Method, the Answer Plug-In Method, and How To Make An Educated Guess.  </p>  <p style=\"\">  \t  &mdash;A 20 question <em style=\"\">video quiz</em> on all the math you need to know for the test.  </p>  <p style=\"\">  \t  &mdash;A long-ish video (it clocks in at just under 40 minutes) detailing the answers to the quiz. This is the video where you learn outright all the math you need to know.  </p>  <p style=\"\">  \t  &mdash;A final video on advanced techniques such as timing and pacing.  </p>  <p style=\"\">  \t  CRITICAL READING:  </p>  <p style=\"\">  \t  &mdash;A video on how to augment (i.e. build or increase!) your vocabulary.  </p>  <p style=\"\">  \t  &mdash;A video on how to use analytical methods and tricks to ace the sentence completions when you do NOT know the definitions of the words in question.  </p>  <p style=\"\">  \t  &mdash;A Speed Round video challenging you to use your newfound tricks on actual sentence completion questions.  </p>  <p style=\"\">  \t  &mdash;A critical video on how to approach the Long Reading Passages using the Integrative Method. Also includes a detailed analysis of the various types of questions on the Critical Reading.  </p>  <p style=\"\">  \t  &mdash;A video on how to perfect the Process of Elimination.  </p>  <p style=\"\">  \t  GRAMMAR:  </p>  <p style=\"\">  \t  &mdash;One overview video on how to approach the different types of grammar questions.  </p>  <p style=\"\">  \t  &mdash;Two video bootcamps on the grammar rules you need to know for the exam.  </p>  <p style=\"\">  \t  &mdash;Two Speed Round videos challenging you to apply the rules to actual Error Identification questions.  </p>  <p style=\"\">  \t  &mdash;A crucial video on the No-Error Rule, namely, choose &quot;No Error&quot; 2-4 times on the Error Identification portion of the exam.  </p>  <p style=\"\">  \t  THE ESSAY:  </p>  <p style=\"\">  \t  &mdash;A video on how to both prepare and execute the essay like a champ.  </p>  <p style=\"\">  \t  THE HOMESTRETCH:  </p>  <p style=\"\">  \t  &mdash;A valuable video on combatting test anxiety. In this video, we look at seven different practices to help keep your body calm, your mind confident, and your spirit focused.  </p>  <p style=\"\">  \t  &mdash;A final video with tips for test day success and tips for maintaining progress over time.  </p>  <p style=\"\">  \t  I love teaching and I am excited to share my experience and knowledge with you in this course! I also love the online education thing (I have a YouTube channel with all kinds of free content and tutorials: http://www.youtube.com/user/PaulCharlesGriffin?feature=watch). I am excited to work with you via the internet on your SAT journey. I am confident that if you set your mind to improving your score on the SAT, you can and <em style=\"\">will</em> do exactly that&mdash;improve your score! And I am certain that you can do so with this course.  </p>  <p style=\"\">  \tGood luck to you!  </p>  <p style=\"\">  \tAnd I&#039;ll see you on the inside in the first video!  </p>  <p style=\"\">  \t  Sincerely,  </p>  <p style=\"\">  \t  Paul Griffin  </p>", 
    "end_date": null, 
    "title": "GRIFFIN SAT: A Complete Course On Acing the SAT", 
    "price": "25.00", 
    "instructors": "Paul Griffin", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62701_932f_3.jpg", 
    "course_url": "https://www.udemy.com/griffinsat/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-27T22:14:00Z"
}