{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>  \t<strong>Language analysis is SIMPLE, you just have to know how to go about it.  \t</strong>  </p>  <p>  \t<strong>Trust me, I was in the exact same position as you are when I was in VCE, and once I discovered how to approach Language Analysis so that teachers and examiners loved what they read, I was soon achieving consistent A+ marks across my SACs and exam.</strong> <strong>And guess what? You can succeed as well! Do you:</strong>  </p>  <ul>  \t<li><strong></strong>struggle to identify language techniques?</li>  \t<li>find it difficult to identify which tones are adopted in articles?</li>  \t<li>have no idea explaining <em>HOW</em> the author persuades?</li>  \t<li>find it difficult to structure your language analysis essay?</li>  \t<li>become even more unsure when comparing 2 or 3 articles?</li>  \t<li>feel like your teacher at school never explained language analysis properly?</li>  \t<li>prefer learning when it's enjoyable and easy to understand?</li>  \t<li>want to stand out from other students across the cohort?</li><li>want to know the secrets of 45+ English high achievers?</li><li>want to know what examiners are looking for?</li><li>see room for improvement whether you're an average student or a pro?</li>  \t<li>want to get a head start and maximise your potential in VCE?</li>  </ul>  <p>  \t<strong>If you have said yes to any of the points above, whether you struggle grasp the essentials of language analysis or, are an A graded student who wants to further distinguish yourself from others, then this course is for you. </strong>My extensive advice is designed so that anyone, no matter what level you are, can easily gain new skills so that you can <strong>successfully</strong> accomplish fantastic results.<strong> </strong>Together, we will cover the entire language analysis section of VCE English, establish where students go wrong, how to avoid it, and why the top students score perfect marks. At the end of the course, you will <strong>undoubtedly</strong> depart with <strong>greater confidence</strong> in your knowledge, skills, and writing ability!  </p>  <p>  \t<strong>My name is Lisa, and I graduated in 2008 with a raw study score of 45 in VCE English.</strong><strong> I have since specialised in tutoring VCE English, and my passion for teaching and motivation to help my students has lead me to be a popular word-of-mouth tutor in the field. </strong>Over the past 6 years tutoring, I have collaborated with many VCE teachers and examiners, particularly through my website VCE Study Guides, leading to my unique and comprehensive understanding of the course. In this time,<strong> I am proud to say that I have seen many of my students succeed in Language Analysis to accomplish study scores of 45+ through my easy-going, straightforward and enjoyable way of teaching!</strong>  </p>  <p>  \t            Learn how to succeed in language analysis during the 5 hours of this course (whether it'd be all in one go, or through breaking up the sections at your convenience). This isn't just any educational video on language analysis, but instead, we're going to interact with each other through my personable videos. There are numerous opportunities throughout the course for you to proactively analyse articles and images yourself, be quizzed on your knowledge, access your ability to analyse - all from the convenience and ease of your home! Furthermore, I have incorporated several past VCAA VCE English exam language analyses so that you can get the real experience of what is expected of you as a potentially high-scoring VCE student. On top of that, there are plenty more resources available for you to download such as a list of language techniques, tones, sample plans and A+ essays!  </p>  <p>  \t<strong>I charge $60 per hour for private tutoring, so for 5 hours of intensive and interacting learning, you're definitely getting a bargain!</strong>  </p>  <p>  \t  If that's still not enough, you'll also have the chance to directly chat to myself and other participants of the course in the course forum! So if you ever need any help, or have a question that you would like answered, then there is a whole community waiting for you on the other side.  </p>  <p>  \t<strong>You've found the right course. </strong>I'm certain that together, we will ensure that you can be as successful as possible in the crucial year of VCE.  </p>  <p>  \t<strong>So go ahead and I'll see you on the other side :)</strong>  </p><p>Disclaimer: Please note that all Udemy prices are set to USD, not AUD. Though I would like to, unfortunately I am unable to set a transparent AUD pricing. I have set the price of this course to $49USD. I do not intend to mislead you in any way (please take advantage of discount coupons!), but please be aware of the conversion :) </p>", 
    "end_date": null, 
    "title": "How to achieve A+ in Language Analysis for VCE English", 
    "price": "40.00", 
    "instructors": "Lisa Tran", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/318174_4738_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-achieve-a-plus-in-language-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-12T09:23:11Z"
}