{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;My goal was to score above a 30 on the ACT and I surpassed that with the help of Master the ACT&quot;</strong> </em>- Aaron, freshman @ Centre College  </p>  <p style=\"\">  \t_  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;My ACT score went up 3 points using the strategies in Master the ACT&quot;</strong> </em>- Ellie, freshman @ Vanderbilt University  </p>  <p style=\"\">  \t_  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;Not only does Patrick cover all of the basic ACT material in detail, but he breaks down the questions until they make complete sense. There is no doubt that his instruction was a major factor in my success. Highly recommended!&quot;</strong> </em>- Christina, freshman @ College of Charleston  </p>  <p style=\"\">  \t_  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;Before this course, I was dreading the college application process. Now, I&#039;m going into my senior year with a great ACT score and I&#039;m actually excited about applying to schools. It&#039;s a great feeling.&quot;</strong></em> - Sean, freshman @ University of Kentucky  </p>  <p style=\"\">  \t_  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">&quot;I went from a 23 to a 26 thanks to Master the ACT.&quot;</strong> - Joseph, senior at Trinity High School</em>  </p>  <p style=\"\">  \t<em style=\"\">_</em>  </p>  <p style=\"\">  \t<em style=\"\">Master the ACT</em><span style=\"\"> is a comprehensive, start-to-finish ACT prep program designed to help students achieve their maximum potential score on test day. That means we&#039;ll cover all four sections of the test in great detail, providing the explanations and strategy you need to make your ACT score stand out on your college applications.</span>  </p>  <p style=\"\">  \t      As a veteran ACT instructor, I have spent hundreds of hours perfecting strategies and explaining concepts to students in a live classroom environment. While it&#039;s nice to get to work with students in-person, it is very difficult to teach at a pace that is optimal for everyone. I&#039;ve learned that every student starts at their own place with standardized tests like the ACT and has his or her own unique mix of strengths and weaknesses. On top of that, live courses are very expensive and many students never get the opportunity to enroll.  </p>  <p style=\"\">  \t      When I discovered Udemy, I realized that I finally had the opportunity to build the ideal ACT prep course - one that is<strong style=\"\"> affordable and allows everyone to truly learn at their own pace.</strong>  </p>  <p style=\"\">  \t      The course format and curriculum is designed around the following principles:  </p>  <ul style=\"\">  \t<li style=\"\">Uses only authentic ACT questions for practice and explanation </li>  \t<li style=\"\">Every drill and practice problem set has a clear purpose</li>  \t<li style=\"\">Comprehension of test material comes first, then timing and strategy</li>  \t<li style=\"\">Multiple learning tools (video, audio, text, etc.) reinforce comprehension</li>  \t<li style=\"\">Reviewing mistakes and learning from them is key to significant improvement</li>  \t<li style=\"\">The best study plan is one that is custom tailored to match your skills, goals, and schedule</li>  </ul>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Why is <em style=\"\">The Real ACT Prep Guide</em> (3rd Edition) a course requirement?</strong>  </p>  <p style=\"\">  \t      The reason is simple - it is the only book on the market that contains <em style=\"\"><strong style=\"\">authentic ACT questions</strong></em> from official tests given to students in previous years. On top of that, it contains <em style=\"\"><strong style=\"\">five full-length practice tests</strong></em> with an explanation for every single question! Other books and companies attempt to mimic the test by creating their own ACT-style questions, but this approach is simply less effective for students.  </p>  <p style=\"\">  \t      Although this added requirement reduces the number of students able to take the course, I cannot stand behind any test prep product that does not use the authentic questions. Please message me if you are having trouble purchasing the book - I am working on creative ways to make sure anyone who wants to take this course has that opportunity!  </p>  <p style=\"\">  \t<strong style=\"\">Disclaimer: The creators of this course have no affiliation with the makers of <em style=\"\">The Real ACT Prep Guide.</em></strong>  </p>", 
    "end_date": null, 
    "title": "Master the ACT", 
    "price": "20.00", 
    "instructors": "Patrick Garvey", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/66188_3a36_14.jpg", 
    "course_url": "https://www.udemy.com/mastertheact/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-17T04:14:23Z"
}