{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>This is a very enjoyable course on Physics-Mechanics with in-depth explanation of each phenomena and good grip on problem solving. Take it and clear Engineering Entrance Exams like IIT-JEE, Medical or other exams having Physics subject happily and easily. This course will have around 20 video lectures and a lot many quizzes and problem solving. The video lectures have been kept short around 20 minutes each. At present, five lectures have been uploaded for initial launch. After this launch, every week 1 more lecture will be added till complete Mechanics syllabus is covered. This will be supplemented with assignments and solution videos. You may take it as live coaching for your College, Engineering Entrance ( IIT JEE), Medical or IAS examination preparation or to increase you knowledge in Physics.You must watch these lectures again and again till you get firm grip on the content.The material will be mainly based on the book \"Feynman Lectures on Physics\" by Nobel Lauret Sir RP Feynman, Resnik Halliday's Physics book and Sears Zemansky's \"University Physics\" Book. Though a lot many new concepts will also be discussed. So, enroll in this course, sit back and enjoy. You will see, how easy and enjoyable this subject of Physics is....</p>\n\n<p>Other 9 Modules in Physics like </p>\n\n<p>Physics Module 2: Waves &amp; Oscillations, </p>\n\n<p>Physics Module 3: Optics, </p>\n\n<p>Physics Module 4:Gas Kinetics &amp; Thermodynamics, </p>\n\n<p>Physics Module 5:Electricity, </p>\n\n<p>Physics Module 6: Magnetism, </p>\n\n<p>Physics Module 7: Atomic &amp; Molecular Physics, </p>\n\n<p>Physics Module 8: Electronics &amp; Semiconductors, </p>\n\n<p>Physics Module 9: Space and Time</p>\n\n<p>Bonus Module: Physics Problem Solving </p>\n\n<p>Will be made available soon (one by one). All the modules will be priced at $20 uniformly and separately (there will be no bundled discount). Only Bonus Module will be available freely with any other module.<br></p>", 
    "end_date": null, 
    "title": "Physics Video Classes - Module 1: Mechanics", 
    "price": "20.00", 
    "instructors": "Scientist with BE (Electronics) JP Singh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783082_4355_2.jpg", 
    "course_url": "https://www.udemy.com/physics-for-iit-entrance/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-05T13:47:52Z"
}