{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>✓ 9 hours of engaging, fully-animated content<br><strong></strong></p><p>✓ Hundreds of guided practice problems explained thoroughly by our ACT experts</p><p>✓ Analysis and explanation of essential test-taking strategies<br></p><p>✓ Created by a team of test preparation experts hailing from the nation's most prestigious universities</p><p>Nobody enjoys the ACT. It's boring, time consuming and worst of all, it's actually pretty important.<br></p><p>So how do you overcome the boredom of the ACT and score well?</p><p>Welcome to TutorMe's ACT course, the <strong>first ever </strong>fully-animated ACT course, where we teach you the ACT like nobody has before. It's fully-animated and will teach you the concepts tested on the ACT like never before. The boring black and white problems of standardized testing will be brought to life in an engaging and entertaining manner. With over 10 hours of original content, you won't find more in depth coverage of the concepts tested on the ACT. On top of that, we've added an additional 500 practice problems taken directly from the ACT. That's over two full tests of extra material.</p><p>Knowing <em>how </em>to take the ACT is almost as important as knowing what's <em>on </em>the ACT. Remember, this is a <em>Standardized </em>Test, meaning that the questions on the test will change every time you take it, but the skills and concepts tested won't. The ACT is <u>predictable</u>. If you study it, you will know exactly what to expect and when to expect it. There are important test taking strategies that you won't learn in High School or from Test Prep Books. We'll help you master the most effective strategies to tackling the test. We're here to help.<br style=\"\"></p><p>At the end of the day, the ACT tests concepts you have learned in High School, but it also tests how well you take the ACT. We'll make you an expert on both.</p><p><br style=\"\"></p><p><strong>Why is the ACT so important?</strong></p><ul><li>ACT scores are critical to a student's college opportunities</li><li>A higher ACT score can lead to more scholarship money</li><li>Some employers require ACT scores well beyond graduation</li></ul>", 
    "end_date": null, 
    "title": "Premium ACT® Prep Course: Improve Your ACT Score", 
    "price": "20.00", 
    "instructors": "TutorMe Test Prep", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615074_2e25_4.jpg", 
    "course_url": "https://www.udemy.com/tutorme-act/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T18:17:44Z"
}