{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>  \t                              Write an essay as a &quot;rock star&quot;!  </p>  <p>  \t                            In only 6 classes you will be able to plan and write a &quot;rock star&quot; essay! Learn to develop your point of view on an issue and support your position with reasoning and examples taken from your reading, studies, experience or observation.  </p>  <p>  \t          You will learn to write a good introduction, a strong thesis statement, enough main ideas to support your thesis, ways to develop supporting ideas and conclude as a &quot;rock star&quot;  </p>  <p>  \t          All you need is want to excel the SAT essay and get ready for a fast track learning course with SATprepVenezuela in a fun environment.  </p>  <p>  \t                            You will end up writing an essay taylor made to get into college!  </p>  <p>  \t<em>Ser una estrella escribiendo el ensayo del SAT!</em>  </p>  <p>  \t<em>En solo 6 clases seras capaz de planificar y escribir un ensayo &quot;estrella&quot;. Aprender a desarrollar tu punto de vista sobre un tema y soportar tu posici칩n con razonamiento y ejemplos tomados de lecturas, estudios, experiencias y observaci칩n.</em>  </p>  <p>  \t<em>Aprenderas a escribir una buena introducci칩n, plantear una tesis robusta, suficientes ideas principales para soportar tu tesis y concluir como una &quot;estrella&quot;.</em>  </p>  <p>  \t<em>Todo lo que necesitas es desear realizar un ensayo excelente y estar listo para un divertido aprendizaje acelerado con SATprepVenezuela.</em>  </p>  <p>  \t<em>Concluir치s el curso escribiendo tu ensayo para ser admitido en la universidad!</em>  </p>", 
    "end_date": null, 
    "title": "Rockstar SAT essay in 5 steps for spanish learners", 
    "price": "20.00", 
    "instructors": "Josefina Erminy", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/156158_bdbb_14.jpg", 
    "course_url": "https://www.udemy.com/1-sat-essay-organization-development-for-spanish-learners/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-31T23:37:44Z"
}