{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>  \t  South Korean Hagwons are the world’s famous most effective ‘<em style=\"\">cram schools</em>’ that appeal to students and their families with the most systematic and intensive programs. Each year thousands of students come to Korea for famous Elite Hagwon Training Programs and for a good reason. After completing our SAT Math courses, most of the students show excellent performance and score from 750 to 780 out of 800 points in their entrance exams!  </p>  <p>  \t  LeanPrep knows exactly how to adapt to a changing world and we want you to learn from the winners. We bring the very best Hagwon courses to you online!  </p>  <p>  \t  As a part of our special offer, we present one complete course of SAT Math at very affordable price on Udemy.  </p>  <p>  \t  In our course, we focus on improving students’ exam taking skills through intensive training on effective problem solving patterns, finding shortcuts and general techniques that help you to solve the problems faster and make your whole performance as efficient as possible!  </p>  <p>  \t<strong style=\"\">Our tutor.</strong>  </p>  <p>  \t<strong style=\"\"></strong><span>Henry Song is our SAT Math teacher. He has graduated from Korea Science Academy and received his Master’s and PhD in Physics from Columbia and Brown Universities, respectively. Henry is a high level professional with 6+ years of experience in Elite Hagwon tutoring for US College Entrance Exams.</span>  </p>  <p>  \t  Content is divided into five sections with 38 videos 10-18 min. average length.  </p>  <p>  \t  Section 2 helps you to build a solid understanding of what kind of challenges (concepts) you face in SAT Math exam followed by Practice in Section 3. Each video has the description of what the concepts Henry will go through.  </p>  <p>  \t  Section 4 and 5 include Four Mock Tests, Real Questions and problem solving process.  </p>  <p>  \t  Feel the difference and learn more with LeanPrep.  </p>  <p>  \t  Good Luck!  </p>", 
    "end_date": null, 
    "title": "SAT Math: Success with Online Hagwon.", 
    "price": "20.00", 
    "instructors": "LeanPrep Corporation", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386282_920c_3.jpg", 
    "course_url": "https://www.udemy.com/sat-math-success-with-online-hagwon/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T02:56:23Z"
}