{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p style=\"\">  \t    Contrary to most people think, the SAT is <strong style=\"\">not</strong> about the content.  Learning more vocabulary or more grammar will help you but the most efficient and effective use of your time is to focus on understanding simple academic fundamentals.  </p>  <p style=\"\">  \tIn this course will learn the following:  </p>  <p style=\"\">  \t1.) How to Simplify  </p>  <p style=\"\">  \t2.) How to Organize the Necessary Information  </p>  <p style=\"\">  \t3.) How to Eliminate Wrong Choices  </p>  <p style=\"\">  \t4.) How to Read Better!  </p>  <p style=\"\">  \tFocusing on simplification means that you can deconstruct the necessary sentences and get back to basics. That equals an understanding that by the end of this course will translate into you entering university better prepared than many of your peers.  </p>  <p style=\"\">  \tMoreover, by seeing how tests like this are made you will better answer all questions on all exams in the future.  Why?  Because the process of answering multiple choice is the same: understand the question, find keywords or clues, and then use a process of elimination to the discard wrong choices.  The techniques are the same and will benefit you for years to come if you follow through and practice them, whether in a university classroom, in writing a grant application, or in any office function where you work.  </p>  <p style=\"\">  \t   This course should take 10 hours to complete, which includes your completion of practice test sections.  We have videos, .pdf handouts, hyperlinks, Powerpoint presentations, and quizzes.  This system has proven effective with hundreds of students over the last five years and can work for you too!  </p>", 
    "end_date": null, 
    "title": "SAT Critical Reading Passages : Read Less, Score Higher!", 
    "price": "20.00", 
    "instructors": "Dr. Robert Niebuhr", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241888_e425_3.jpg", 
    "course_url": "https://www.udemy.com/sat-critical-reading-passages-read-less-score-higher/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-12T04:44:00Z"
}