{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p style=\"\">This course provides an in-depth overview of the NEW SAT, which starts with this years PSAT in October 2015 and continues with the SAT in March 2016. Every example and concept directly correlates to concepts that are taught on the new SAT. The SAT is a curved test; College Board first looks at the results from the test makers and fits scores into a &quot;bell curve&quot;. Since most students will not be used to the new test, you should begin preparing now and get &quot;ahead of the curve&quot;!</p><p style=\"\">Each lesson is taught in a format similar to that of Khan Academy; lessons are taught through video where you can see the instructors work and explanations. It is important that you follow the order of the lessons, as some topics build on each other. After every math lesson, you will be given a chart that correlates to questions in The Official SAT Study Guide (Not affiliated with this course or Master Scholars). Once you learn a new skill, test your new-found knowledge on REAL SAT questions from the source (must purchase separately, but the tests in The Official SAT Study Guide are the same as the four tests released by Khan Academy, which you can download for free on their site).</p><p style=\"\">This course has a book that you can purchase which includes all the questions that are covered in the class and the charts for each one. While this book is not required, it could be convenient while you are working through the lessons. Pdf&#039;s of each lesson are available in the course if you wish to print each one before working through the lessons in lieu of purchasing the book.</p><p style=\"\">This course covers all aspects of the test and gives students strategies and knowledge that they can use to be successful on the test.  In order to maximize your score, understand that practice is what will get you there.  We are here to guide you on your journey, but you must put in the effort.  Good Luck!</p>", 
    "end_date": null, 
    "title": "The New SAT Video Series", 
    "price": "25.00", 
    "instructors": "Jesse Patrick, Mr. Robert John Hovel", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571652_b07b_3.jpg", 
    "course_url": "https://www.udemy.com/the-new-sat-video-series/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T15:07:49Z"
}