{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Prepmobi's Integrated writing course will teach you all the Top Tips, Tricks &amp; Strategies you'll need to succeed on the first of the two TOEFL iBT Writing tasks. </p><p>This course is a MUST for anyone applying to one of the more than 9,000 colleges, agencies, and other institutions in over 130 countries that accept TOEFL iBT scores as proof of English language proficiency.</p><p>Our unique curriculum divides the course into six parts: (1) an overview of the Writing 1 Task, (2) short video lectures with step-by-step instructions on how to approach each part of the integrated essay process, (3) quick quizzes reinforcing key points in the lectures, (4) real time videos showing you how to complete each step in the time allowed on actual test day, (5) practice prompts where you apply the skills you've learned under timed, simulated test condition, and (6) a student handout with an Integrated Essay TEMPLATE and a pace and timing INFOGRAPHIC.</p><p>Prepmobi is the online, mobile test prep solution for ESL and EFL students taking the TOEFL iBT test. The instructors at Prepmobi are all Native English Speakers with years of experience helping international students gain admission to exclusive boarding high schools, Intensive English Programs, and undergraduate and graduate programs at Ivy League colleges and universities across the U.S. We've taken our tried and tested one-to-one Skype curriculum and turned it into a series of affordable TOEFL online, self-paced test prep courses. The classes are sold in separate units so you buy just the parts you need, when you need them, at a price you can afford.  If you enjoy Anywhere, Anytime Learning and want to test your best on the TOEFL exam, then this course is for you!</p><p>Don't take our word for it! Check out the Prebmobi website for testimonials from our satisfied students and for more information about one-to-one Skype tutorial lessons and access to FREE TOEFL vocabulary study sets.</p>", 
    "end_date": null, 
    "title": "TOEFL iBT Writing: 2 Hours to a Perfect Integrated Essay", 
    "price": "35.00", 
    "instructors": "Prepmobi Test Prep", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292492_baef.jpg", 
    "course_url": "https://www.udemy.com/tackling-the-toefl-ibt-writing-task-1/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T16:27:25Z"
}