{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>This 5-hour video course is for <strong>every </strong><strong>high school student and parent</strong> who wants to know <em>how</em> they are going to ever <em>pay</em> for college!</p><p>It's designed so that YOU will win <strong>Free Money</strong> to pay for college in the form of college scholarships that are a perfect fit for YOU!</p><p><strong>There are thousands of college scholarships out there.</strong> How will you sift through them? Which ones are worth your time and effort, and which are just a waste of time? Once you find them, how do you apply to win? What can your family do to significantly UP your chances of winning a highly-competitive, highly-valuable top scholarship and to REDUCE the amount you pay out-of-pocket for college?</p><p>By taking this course, you'll be on the road to earning thousands of dollars in college scholarships. It's our goal to teach you how to find those thousands of dollars and claim them for yourself, <strong>before the other kids get to them first!</strong></p><p><strong>This well-organized 5-hour video course includes sections on:</strong></p><ul><li>Finding College Scholarships and Narrowing Your Scholarship List</li><li>Applying For and Winning College Scholarships</li><li>Alternative Financial Aid Options</li><li>End-of-Section Quizzes to Increase Comprehension</li><li>Additional Relevant Articles in PDF format</li><li>Bonus Section!</li></ul><p><span></span></p><p><strong>Start this course today</strong> before deadlines disappear and scholarship opportunities evaporate. Paying for college will be in the top-10 decisions of your financial life - don't put it off another moment.</p><p>Click the <strong>\"Take This Course\"</strong> button at the upper-right of this page to get started!</p>", 
    "end_date": null, 
    "title": "Winning College Scholarships in High School", 
    "price": "20.00", 
    "instructors": "Christian Heath", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659406_ea12_2.jpg", 
    "course_url": "https://www.udemy.com/winning-college-scholarships/", 
    "currency": "USD", 
    "subject_name": [
        "College Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T21:47:34Z"
}