{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>WANT TO GO BEYOND THE INDUCTIVE BIBLE STUDY METHOD?</strong></p><p>This course is for ANY Christian who has a basic understanding of the Bible but wishes to take their study of the Bible to a deeper level. </p><p>In addition, if you are someone who desires to lead or is currently leading a Bible study this course will give you the tools for maximum preparation and confidence.</p><p><strong>BASIC CONCEPTS IN THE COURSE</strong></p><p>This course teaches advanced Bible study techniques in the form of the 7 rules of Bible Interpretation:</p><ol><li>Rule #1 - Pre-existing Conditions - How does your experience, church tradition, language and culture interfere with a proper understanding of the Bible?</li><li>Rule #2 - By the Book - Why you must complete a book study before diving in to the individual verses of any book?</li><li>Rule #3 - Context, Context, Context - Why what comes before and after your passage may be just as important as the message of the passage?</li><li>Rule #4 - Word Up - How doing a simple word study will open up your eyes to different parts of the Bible?</li><li>Rule #5 - Culture Shock - How and why you must understand the Bible's culture in order to make sense of its message?</li><li>Rule #6 - Bible Context - Why it is important to hear what other parts of the Bible say about your passage?</li><li>Rule #7 - Application - How to apply any passage of the Bible to your everyday life</li></ol><p><strong></strong></p><p><strong>CHAPTER CONTENT</strong></p><p>Each chapter includes:</p><ul><li>An introduction to each rule</li><li>A step-by-step process to demonstrate how to use each rule</li><li>An example of how to put a particular rule into practice using a variety of passages</li><li>Written PDF of each lesson</li><li>Q &amp; A section</li></ul><strong>REASONS TO TAKE THIS COURSE</strong><ul><li>Everyone unconsciously interprets the Bible.  This course will make you an active interpreter.</li></ul><ul><li>Your personal Bible studies will become adventures of discovery.</li><li>You will have more confidence to share in small group Bible studies and Sunday school classes.</li></ul><ul><li>You will be able to prepare Bible studies for small groups or Sunday School classes.</li></ul><ul><li>You will be able to lead Bible studies for small groups or Sunday school classes.</li></ul><ul><li>You will have the tools to study complex Bible verses or topics.</li></ul>", 
    "end_date": null, 
    "title": "7 Rules of Bible Interpretation EVERY Christian Should Know", 
    "price": "35.00", 
    "instructors": "Gustavo Karakey", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20661_5196_13.jpg", 
    "course_url": "https://www.udemy.com/7-rules-of-bible-interpretation-every-christian-should-know/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-04T21:46:25Z"
}