{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t Q. Ever tried to learn tarot from books and found yourself more confused than when you began?  </p>  <p style=\"\">  \t My aim with this course is to make learning the tarot as easy as possible.<br style=\"\">  \t The course is designed for the complete beginner but beneficial to those with some experience with the tarot.  </p>  <p style=\"\">  \t The course teaches you the skills to become a professional tarot reader but it&#039;s really up to you how far you want to take it.  </p>  <p style=\"\">  \t In the course:  </p>  <p style=\"\">  \t - I share with you 2 or 3 meanings for each card that have worked well for me, including course notes in PDF format.  </p>  <p style=\"\">  \t - Learn an easy astrological system for working with the court cards and minor arcana.  </p>  <p style=\"\">  \t - Learn 3 different layouts and create your own.  </p>  <p style=\"\">  \t - Learn how to deliver information in a professional manner.  </p>  <p style=\"\">  \t - Watch some sample readings.  </p>  <p style=\"\">  \t - I discuss important aspects of being a professional tarot reader, including,  </p>  <p style=\"\">  \t - How to protect yourself. <br style=\"\">  \t - Ways to develop your intuition. <br style=\"\">  \t - Charging a fee. <br style=\"\">  \t ...and much more.  </p>  <p style=\"\">  \t One thing I hear a lot from potential students is;<br style=\"\">  \t I feel drawn to the cards but I&#039;m not psychic...  </p>  <p style=\"\">  \t A psychic is different to a tarot reader. A tarot reader reads the cards, conveying one or more potential meanings to the client in relation to the positional meanings.<br style=\"\">  \t You will however find that your intuition will develop. Everyone is born with the ability to be intuitive and just like a muscle it will get stronger the more you use it. <br style=\"\">  </p>  <p style=\"\">  \t I am a practical person and this method of reading the cards has worked well for me for many years and it can work for you too.  </p>  <p style=\"\">  \t If a simple, common sense, responsible approach to reading the cards appeals to you then I invite you to join me on a wonderful journey that is The Tarot!  </p>  <p style=\"\">  \t <strong style=\"\">Disclaimer:</strong><br style=\"\">  \t  Tarot readings are for entertainment purposes only. <br style=\"\">  \t  In various parts of this course, card meanings are discussed that may indicate Illness, whether physical or psychological, physical pain, pregnancy or patterns of abuse. This is for the information of the tarot reader alone. If a client expresses that they are unwell and asks you what is wrong with them, advise them to seek the advise of a health care professional. The tarot does not and the tarot reader should never diagnose or treat any form of medical condition.<br style=\"\">  \t  Similarly, if a client asks you for legal advice or advice on how to spend/invest money, advise them to seek the advice of an industry professional in an appropriate field. No guarantees of any kind are meant to be implied regarding a reading. The client has the free will to decide whether or not they will follow the guidance offered in a Tarot reading. <br style=\"\">  \t  The instructor/creator of this course accepts no responsibility for any loss, damage or harm arising from the actions/advise given to clients by students who take this course.  </p>", 
    "end_date": null, 
    "title": "Become a Professional Tarot Reader from Scratch", 
    "price": "20.00", 
    "instructors": "Ben Scott", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/72400_8b47_6.jpg", 
    "course_url": "https://www.udemy.com/become-a-professional-tarot-reader-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-01T01:52:36Z"
}