{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Extraordinary Teacher and Spiritual Tool (Updated Dec 2015)</em></strong><br></p><p><em>If you are on a \nspiritual path, this course is a precious gem.  Well organized and \nfilled with practical help toward transcendent bliss and health, this \ncourse and its practice could be some of the best time you spend on your\n lifetime Path.  The instructor is delightful, diligent, responsive, \nwell-organized, a master of the material, and a person you would love to\n know. by Connie Stevens</em><br></p><p><strong></strong></p><p>Bindu Chakra will add an <strong>extra dimension</strong> to your ability to move through your life with a candour, bliss and ease you may have thought impossible. You will discover that <strong>nothing is impossible </strong>once you tap into the wonders, the spirituality and bliss that is the dripping nectar of Bindu.</p><p>This is a relatively short course to add to expand and build upon your current knowledge of the Chakra system.</p><p>This course uses the latest adult learning techniques to assist you in knowing the life you have been dreaming. </p><p>There will be a number of relatively short meditations (that you are advised to expand upon!) and video lectures to ease you into the <strong>bliss of Bindu</strong>.</p><p>Please take this course if you interested in expanding your awareness beyond the main seven chakras.</p><p>Not sure? Scroll down there are free previews for you to get a taste of what is to come.</p><p>Enroll with confidence! Your enrollment is backed by Udemy's 30 Day, no questions asked, money back Guarantee! <br></p>", 
    "end_date": null, 
    "title": "Bindu Chakra Spiritual Activation", 
    "price": "20.00", 
    "instructors": "Sharon Ramel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618702_cfe1_3.jpg", 
    "course_url": "https://www.udemy.com/discover-bindu-chakra-a-spiritual-jouney/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T01:00:34Z"
}