{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you want to start a spiritual healing business but have a limited budget? </p><p>Are you a coach, psychic or healer who is already earning income in your chosen path but lack expertise in how to build your spiritual healing business? </p><p>Do you feel drawn to change careers and become a healer, professional psychic or Life Coach, but feel overwhelmed about where to start, what to charge, how to get a website that works without spending a fortune, how to deal with cancellations, find a perfect space or even how to get qualified in your new chosen career? </p><p>This course can teach you everything you need to know about starting, building, and growing a spiritual healing business to bring more peace, freedom, success and financial rewards into your life while staying deeply connected to your higher purpose. . </p><p>While there are hundreds of courses that can teach you about business- this course is tailored specifically for healing, psychic and Life Coach businesses so you will save thousands of dollars and months of time with the dozens of tips and techniques of mastering success as a spiritual healer. </p><p>You will also learn how to balance the heart-centered approach needed to be a healer, coach or psychic as well as be a savvy and successful business person. </p><p>This course will give you access to a private Facebook page Healers in Business, where you can promote your services, blogs and insights as a spiritual healing business owner as well access powerful resources and receive support on your entrepreneurs journey. </p><p>So enroll now and start building, growing and succeeding in your spiritual healing business. <br></p><p> <br></p>", 
    "end_date": null, 
    "title": "Build Your Spiritual Healing Business on a Budget", 
    "price": "50.00", 
    "instructors": "Sal Jade", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/813120_60d5_4.jpg", 
    "course_url": "https://www.udemy.com/build-your-spiritual-healing-business-on-a-budget/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-05T03:18:18Z"
}