{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>&quot;Rejoice always;<sup> </sup>pray without ceasing; in everything give thanks; for this is God’s will for you in Christ Jesus.&quot; (1 Thes 16-18)</strong><br>  </p>  <p>  \t                    Prayer is a <strong>necessity</strong> in all faith traditions especially in the Roman Catholic tradition.  Finding the <strong>best practices</strong> that work for you and understanding what prayer is and how to pray effectively will help you <strong>encounter God</strong> in your everyday life.  </p>  <p>  \t                    The course covers the basics of why do we pray and what benefits do we get from prayer.  It will cover why prayer is necessary and how a person can <strong>get the most out of prayer</strong> in their everyday life.  </p>  <p>  \t            The course covers with the fundamentals on what prayer is and why it is necessary.  Then we go into the steps of prayer and stages of prayer and coming around to why it is needed in our own life and how we can <strong>incorporate pray everyday</strong> in the business of everyday day life.  </p>  <p>  \t                      Covering the different aspects, types and forms of prayer so that prayer can be easily understood and accessible to all.  Often prayer is thought of a dry or a &quot;one way conversation.&quot;  Through use of a variety of methods of prayer including formal prayer, mediation and &quot;free form&quot; prayer.  You can slowly go from one who had difficulty to the biblical mandate of &quot;<strong>pray without ceasing</strong>&quot;.  </p>  <p>  \t        This course is designed for people that would like to <strong>develop a prayer</strong> <strong>life</strong> in but are hesitant on where to start or what to do.  We walk through the importance of prayer but also what how to prayer and the benefits from it when we take it<strong> from out hearts and out into the world.</strong><br>  </p>", 
    "end_date": null, 
    "title": "Catholic prayer as a path to get closer to God in your life", 
    "price": 0, 
    "instructors": "John R Boyle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303672_dad8_2.jpg", 
    "course_url": "https://www.udemy.com/catholic-prayer/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-19T14:18:58Z"
}