{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Prayer is a core Christian practice, but for many, this means \"saying prayers\" or asking God for various favors. In this course, we will review a variety of methods of prayer that have been used for centuries in Christianity. Whether you're a beginner who is just learning how to pray, or a more mature Christian who has been at it awhile, this course will offer specific guidance, encouragement and support for practicing several time-tested methods of prayer.</p><p>The following topics will be covered:<br>* Prayer of Jesus, Paul and the Early Christians<br>* Prayer and Christian Spirituality<br>* Basic Ingredients of Personal Prayer<br>* Praying With Scripture (Lectio Divina)<br>* Centering Prayer<br>* Christian Meditation<br>* Breathing Prayer<br>* Praying Psalms<br>* Praying with Icons and Art (Visio Divina)<br>* Dealing with Distractions<br>* Supports for Daily Prayer</p><p>The course will consist of 10 short video lectures, with supplemental resources for each. Discussion questions and comments are welcomed. Students are encouraged to work at their own pace, but not simply to rush through the course. Taking time each day to practice the prayer methods is an important part of the learning experience.</p><p>If you are seeking to grow in your practice of Christian prayer, this course will be helpful to you. Even if you're not sure and just where you are with Christian beliefs, come and see.</p><p><br></p>", 
    "end_date": null, 
    "title": "Christian Prayer Methods", 
    "price": "20.00", 
    "instructors": "Dr. Philip St. Romain", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643416_9fc9_2.jpg", 
    "course_url": "https://www.udemy.com/christian-prayer-methods/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T17:01:54Z"
}