{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you have ever been on an overseas mission trip, you know that it can be very daunting to be exposed to seemingly endless needs that have no clear solution.  It is often tempting to provide some sort of short term relief to meet these needs that unfortunately then creates problems in dependency upon you as an outsider; jealousy among those who receive something and those who don't; and only lasts until whatever it is that has been given is depleted.  What then are we to do about the many needs we see when we go on a volunteer trip?  How can we both make a lasting impact on a community's physical needs that doesn't neglect the eternal, more important spiritual needs?  In fact, how can we meet physical needs in a reproducible way that fits into an overall comprehensive evangelism and church planting strategy?  CTT is an attempt to answer these important questions!</p><p>While this course is introductory in nature, you will receive enough instruction to perhaps challenge your previous thinking in regards to the way you incorporate human needs strategies with evangelism and church planting.  The course is broken into 10 different modules providing you plenty of time to process the simple yet profound concepts being presented.  </p><p>If you or your church is embarking on the exciting, divinely-appointed task of being an ambassador for Christ in a cross-cultural setting, you will want to arm yourselves with as many tools as possible in order to be successful.  This course can begin to help you think through concepts you have perhaps not contemplated and ensure that you do not overlook key principles in your missions strategy as you move forward.  So come join us with an open mind and an open heart, ready to hear all that the Holy Spirit would teach us!</p>", 
    "end_date": null, 
    "title": "Community Transformation Training", 
    "price": 0, 
    "instructors": "David Olson, Vicki Lassiter, Don Barger, Jennifier Barger", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/599818_f30d_2.jpg", 
    "course_url": "https://www.udemy.com/cttraining/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-01T22:51:11Z"
}