{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will help you to build a relationship with your Spirit Guides.  These Spirit Guides have been with you since before you were born, and have made a contract to aid you throughout your lifetime. </p><p><strong>C</strong><strong>onnecting T</strong><span><strong>o Y</strong><span><strong>our S</strong><span><strong>pirit G</strong><span><strong>uides </strong>is a course designed to help you live your life to its fullest potential. Your spirit guides help to aid you in treasuring the experiences life has to offer.</span></span></span></span></p><p><span><span><span><span>This course is designed to teach you to:</span></span></span></span></p><ul><li><span><span><span><span> Learn about spirit guides that are around you.</span></span></span></span></li><li><span><span><span><span> See how spirit guides can show themselves to you.</span></span></span></span></li><li><span><span><span><span>Find your own way to connect to your spirit guides. </span></span></span></span></li><li><span><span><span><span>Meet your spirit guides and establish a personal relationship with them.<br> <br></span></span></span></span></li></ul><p>Through this course, you will learn how to develop a relationship with Spirit Guides such as:</p><ul><li>The Doctor Chemist Guide</li><li>The Protector Guide</li><li>The Joy Guide</li><li>The Doctor Teacher Guide</li><li>Angels</li><li>Elementals</li><li>Ascended Masters and Outer Band Guides</li></ul><p>Building a relationship with your spirit guides not only helps to deepen your spirituality but also creates a bond with the universe. Spirit guides help to give you clues to directions in your life that will help to steer you away from obstacles that can keep you from experiencing joy. Having a connection to your spirit guides is a great tool that can be used to map out your life experiences and you can use this information to bring positive abundance in your life.</p><p>This course is unique in that the instructor takes you through her personal experience in meeting her guides.  With the knowledge of her personal experience, you can follow her guidance and experience to create your own relationship with your guides.</p><p>This course will help you come to know your Spirit Guides and let them aid you in your spiritual growth upon this earthly plane.</p>", 
    "end_date": null, 
    "title": "Connecting to your Spirit Guides", 
    "price": "20.00", 
    "instructors": "Melanie Rimkus", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754404_1576.jpg", 
    "course_url": "https://www.udemy.com/connecting-to-your-spirit-guides/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T15:17:42Z"
}