{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tThis course is all about cosmic ordering and specifically, using vision boards to help aid the manifestation process. The audience would probably have heard of the law of attraction and &#039;the secret&#039; before, but this is taking it a step further by going into depth as to why this technique works. The target audience are those who have a belief in and respect for the law of attraction, metaphysics and manifestation.  </p>  <p>  \tYou should take this course if you want to take your learning and understanding of cosmic ordering a step further. Have you written long lists that just seem to gather dust? Fed up with ‘wishing’ and ‘hoping’ and not really ‘having’? Are you still waiting on the dream job? Perfect match? More money?  </p>  <p>  \tJoin us on this course, and you’ll learn how a picture speaks 1000 words ... not just to you, but the cosmos (who is always on standby and ready to deliver)! Allow thought vibration and visualisation to align you to what you want. Select it. Project it. Expect it. Collect it!  </p>  <p>  \tThere are video recording of lectures, an ebook and some outside links to refer to.  </p>  <p>  \tThe course will take about 2-3 hours to complete.  </p>  <p>  \tYou print off the workbook and work your way through it with the video lectures. This course is ideal if you are into the law of attraction, and you want to manifest what you want in your life. We cover how to make a vision board, place an order and allow the receiving to come in. We cover various metaphysical laws – not just the law of attraction, but the law of clarity, the law of resistance, the law of flow – to name but a few.  </p>  <p>  \tWe look at the 4<sup style=\"\">th</sup> dimension of time space reality and how to speed up our order and how to remove blocks which may be getting in the way of the receiving. The only disclaimer is – be careful about what you ask for, as you just might get it!!  </p>", 
    "end_date": null, 
    "title": "Cosmic Ordering With Vision Boards", 
    "price": "40.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302460_5383_4.jpg", 
    "course_url": "https://www.udemy.com/cosmic-ordering/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:10:40Z"
}