{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">YOUR PATH TO THE ULTIMATE PERSONAL TRANSFORMATION: <br style=\"\">  \t                 *** A NEW CREATION! </strong>***<br style=\"\">  \t<strong style=\"\">____________________________________________________________________</strong>  </p>  <p>  \t<strong style=\"\">Are You Ready to CRUSH IT? You can do so with Christianity!</strong>  </p>  <ul style=\"\">  \t<li>How can you Crush this journey called &quot;Life&quot; if Heaven is never realized?</li>  \t<li>How does &quot;no Heaven&quot; = Victory? It&#039;s doesn&#039;t! Losing team, right? Right!</li>  \t<li>Is it true only so-called &quot;Good&quot; people make it to Heaven?</li>  \t<li>Can You know for sure you will make it to Heaven? You can Know!</li>  </ul>  <p>  \t<strong style=\"\">      In this course,</strong> I’m going to take you step-by-step through a success formula which will not leave you the same person. Nor will it leave you standing on the outside of Heaven’s gates when this thing is all said and done.  </p>  <p>  \t                No my friend! This course is going to show you the narrow way to life. Life without discovering life is not success, is it? By no means!  </p>  <p>  \t<strong style=\"\">So, the first step:</strong> We’re going to talk about “having ears to hear.” This is necessary if you are going to make a right assessment regarding who you are, why you are here and where you are going. The only personal transformation which will matter in the end is a new creation! I’m going to show you how to get there and I’m confident you will have the ears to hear as we go over, together—this all important information for those who have ears to hear.  </p>  <p>  \t<strong style=\"\">The second step</strong> involves changing your mind. Any person who is truly wise understands <em style=\"\">from where </em>this wisdom comes. They adjust their thinking in order to be aligned with this wisdom. In step 2, let’s celebrate wisdom together as I encourage you to change your mind regarding its important aspects.  </p>  <p>  \t<strong style=\"\">Once we get into Step 3</strong>, it will be time to get serious about your soul to make sure you are not gambling with it. Did you ever here, “craps!” Well, if you have or haven’t, you don’t want to come up short and bust out when it comes to your soul. You will be encouraged in this step to make the right decision—regarding your soul—in this formula of success.  </p>  <p>  \t<strong style=\"\">Step 4 brings you to a place</strong> of reality-checking. We look over what is required to have success in the way of transformation and heaven. Taking a leap of blind faith isn’t required when you have good, solid evidence and reasons to take an active step of trust. You do it every day and in this step, you will be encouraged as I get into the trenches with you so you can surface, shining like gold!  </p>  <p>  \t<strong style=\"\">Finally in Step 5,</strong> we’re going to make sure you proceed in a manner which will guarantee your success. Success involves victory and having a game plan. This step will give you that game plan.  </p>  <p>  \t<strong style=\"\">IDENTITY * PURPOSE * DESTINATION</strong>  </p>  <p>  \t                All this and much more as we investigate:<br style=\"\">  \t<strong style=\"\">How to Get to Heaven - CRUSH IT! WITH CHRISTIANITY 101 - How You Got to Heaven.</strong>  </p>  <p>  \t<em style=\"\">Stress Free Living for the Stressed, How to Find Peace, Stress Reduction, Stress Management &amp; the Ultimate Personal Transformation via Heaven&#039;s 5-Step Success Formula.</em>  </p>", 
    "end_date": null, 
    "title": "CRUSH IT! with Christianity: How You Got to Heaven", 
    "price": 0, 
    "instructors": "Jeff Zahorsky", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/197416_b153_35.jpg", 
    "course_url": "https://www.udemy.com/crush-it-with-christianity-101/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-11T12:16:47Z"
}