{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">How can we pray effectively for the sick and hurting?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Is the power of God real?  And how can we contact it?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">What causes God to intervene?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">What obstacles do people have when trying to be healed?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">How do we know if we have strong enough faith?</strong>  </p>  <p style=\"\">  \t      With real life experiences and extensive work in helping people be healed by God, Chas makes the impossible become probable.  Chas has been in gospel ministry since 1997, with a niche emphasis on faith and healing, according to the Bible.  He was first an assistant at a church in Houston, then began a traveling ministry for four years, and next pioneered Houston Faith Church, where he has been the senior pastor for 11 years. Several times in his childhood and young adult life he encountered the healing power of God and saw immediate results.  And in ministry, Chas has dedicated himself to helping others do the same.  </p>  <p style=\"\">  \t Join him in this <strong style=\"\">12 hour</strong> course on the <strong style=\"\">7 Keys to Heal the Sick and Afflicted</strong>.  The class is sectioned into EIGHT, 1.5 hour long video teachings, including Q&amp;A and practical application. Students will feel as if they are in a classroom setting with other students, as the school is filmed from an actual 8 week class taught at Houston Faith Church.  The response and results that students have had has been so good that we decided to make this school available to the public.  </p>  <p style=\"\">  \tAlso included are teaching notes with all scripture references included, as well as a detailed chart of all of Jesus healings, methods, keys, catalysts, and results.  </p>  <p style=\"\">  \t                If you are a believer in Jesus Christ who wants to understand the power of God, how to do the works of Jesus, and how to pray more effectively for people in your life, then you&#039;ll love this school!  </p>  <p style=\"\">  \t<em style=\"\">&quot;</em><em style=\"\">I have watched and heard many many teachings on healing and I believe yours is the best I&#039;ve seen yet as it answers and addresses many of the obvious failures in getting Christians healed.&quot; </em>DB - New Zealand  </p>  <p style=\"\">  \t                A good target for completion would be 8 weeks, assuming one 1.5 hour lecture (and study) per week.  </p>  <p style=\"\">  \t       Added bonus: Pastor Joni Stevenson is a guest teacher in this series...and you&#039;ll love her fire!  </p>  <p style=\"\">  \t  Instructors are available for questions, messages, or one-on-one guidance through the course.  Email is the most appropriate method of contact.  </p>", 
    "end_date": null, 
    "title": "Divine Healing School for Believers", 
    "price": "20.00", 
    "instructors": "Chas Stevenson", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/85088_be01_5.jpg", 
    "course_url": "https://www.udemy.com/divine-healing-school/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-28T16:57:10Z"
}