{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"><p style=\"\">This Facility  Care and Stewardship: Church  Trustees Training is divided into three sections; collecting  information, planning your inspection, and documenting the results.</p>    <p style=\"\">In this church  trustees training course you will learn how to utilize as-built drawings  as a communication and ministry planning tool, and to develop safety documents  for the management of your facilities. This will be done through an existing  facility analysis spreadsheet. This form will give you a tool which will be  helpful in understanding how you are using your facilities, how you can use  them more efficiently and will provide information to help you decide the best  way to maximize the efficient use of your classrooms and other facilities.</p>    <p style=\"\">The lecture on documenting the results of your inspection  utilizes another form, facilities report data form, which looks at the building  as a system of construction components to ensure detailed and complete analysis  for your inspection report.</p>    <p style=\"\">The final lecture also includes a series of photographs of  typical maintenance conditions. There are suggestions for additional items to  discuss in future live sessions or by e-mail.</p>    <p style=\"\">Take this free facility care and stewardship: church trustees training course right now!</p>&lt;/p&gt;<p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Facility Care and Stewardship (Trustees Training)", 
    "price": 0, 
    "instructors": "Brewster Ward", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/31409_97b5_3.jpg", 
    "course_url": "https://www.udemy.com/facility-care-and-stewardship-trustees-training/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-05T19:57:03Z"
}