{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tWelcome to Helping People Flourish! This course introduces you to the study of psychology in an integrated fashion. Based on the Institute for the Psychological Sciences’ (IPS) Model, you will study psychological principles and theory through the lens of the Catholic-Christian vision of the person.  </p>  <p style=\"\">  \tAs you proceed through this course, you will consider principles from the Catholic Faith and psychology that influence the work of the helping professional. For instance, you will contemplate the belief that each person possesses innate dignity, has free will, and is made for flourishing. You will explore some of the factors that facilitate or inhibit flourishing, including the influence of virtues and vices, personal filters, and responses to obstacles. In addition, you will examine the three levels of vocation, which are calls from deep within each person to: 1) be good, do good, and flourish (and ultimately be in relationship with God, our Creator and Father); 2) develop great, committed relationships with others; and 3) engage in meaningful work and service within one’s community. You will also examine some of the specific ways that helping professionals offer assistance to others.  </p>  <p style=\"\">  \tWith each theme addressed in this course, you are encouraged to engage in sincere reflection, as this will enable you to deepen your understanding of yourself and others, and, ultimately, strengthen your contribution as a helping professional.  </p>  <p style=\"\">  \tThe media presented here are drawn from the curriculum of the first course in IPS’ online MS in Psychology Program. For more information on that program, please visit the Institute for the Psychological Sciences website.  </p>  <p style=\"\">  \tNow, as you prepare to begin your coursework, keep in mind the words of the Apostle Paul (Philippians 4:13): “I can do all things through Him who strengthens me.” May your journey at IPS and this first course be blessed with new insights and wisdom that will enhance your ability to work with and assist others. Welcome!  </p>", 
    "end_date": null, 
    "title": "Helping People Flourish", 
    "price": "40.00", 
    "instructors": "Institute for the Psychological Sciences, Elina Holland", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355416_2188.jpg", 
    "course_url": "https://www.udemy.com/helping-people-flourish/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T17:46:34Z"
}