{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Learn to have better control of your dreams by understanding the World of Lucid Dreaming while awakening for the journey of a lifetime!</p><ul style=\"\"><li style=\"\">Do you ever feel worn out by the end of your long day?</li><li style=\"\">Does your mind stay constantly racing in your times of focus?</li><li style=\"\">Do you seek to better understand yourself and situation?</li><li style=\"\">Do you sometimes become blinded by your rage?</li><li style=\"\">Do you seek relief in an open minded environment free of religious dismay?</li><li style=\"\">Are you in need of overcome your fear or grief?</li><li style=\"\">Have you ever asked yourself &quot;What does my dream mean ?&quot;</li></ul><p style=\"\">If any of this seems near you heart or someone you know Lucid Dreaming might be the solution for you. Lucid Dreaming is a way that seeks freedom and to better balance to ones mind and body by interacting with the Inner Self or Subconscious mind. Lucid Dreaming may aid you with:</p><ul style=\"\"><li style=\"\">Staying focused longer</li><li style=\"\">Improved problem solving skills</li><li style=\"\">Increase emotional intelligence</li><li style=\"\">More mental space</li><li style=\"\">More creativity</li><li style=\"\">Less overall stress</li><li style=\"\">Flexibility to change tasks faster</li><li style=\"\">Increased intuition</li><li style=\"\">Greater sense of balance in life and work</li><li style=\"\">Improved thought habits</li></ul><p style=\"\"><strong style=\"\">Why am I qualified to teach you?</strong></p><ul style=\"\"><li style=\"\">I have over 10 years in Waking Life of experience in Lucid Dreams and countless more in the Dream World</li><li style=\"\">I&#039;m certified in Reiki and is a Shamanic Reiki Practitioner </li><li style=\"\">I&#039;ve studied the ways of Shamanism of the old ones of my Siksika Blackfoot culture as well as a variety of techniques from around the world.</li><li style=\"\">I&#039;m am certified in C.A.D, have an Associate in Architectural Technology, &amp; Graduated with a Bachelor of Architecture, so I know how stressful a workload can be.</li><li style=\"\">I grew up as an Usher, Jr Deacon, and Youth Coordinator of my church growing up, so I was attuned to listen and become lose to my inner self and the Great Spirit.</li><li style=\"\">I grew up a Christian, but have an amalgamation of Taoism, Buddhist, and Shamanism entangled together in my core system making me very open minded.</li><li style=\"\">I have experience in Martial Arts, as a Violinist, a Child Care Provider, and a Summer Camp Counselor making me extremely patience and sensitive to the voice of another.</li></ul>", 
    "end_date": null, 
    "title": "How to Have Amazing Lucid Dreams", 
    "price": "20.00", 
    "instructors": "Na'Shawn Jordan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530572_e7cd_3.jpg", 
    "course_url": "https://www.udemy.com/luciddreaming/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T18:19:03Z"
}