{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course teaches you how to think, and grow into an awareness of yourself, and the relationships that surround you. In this course you work on your inner self, to produce an inner and outer change. </p><p>This course will give you the insight, information, and practical application, so that you can effectively transform into life, where you have a close awareness of, and relationship with God. </p><p>When I grew up, I had a close relationship with God, and I understood how that felt, but everyone around me did not have that. I felt when I was very young, that I was the odd one out, and began to conform to those around me. When I did, I lost the closeness of that relationship with God, and when I realized this years later, I sought to seek it out again. This course is explains, through a refined process of how you can connect with God, based on what I learned about reconnecting with God, and how to get that confidence to walk as a child of God, and where the source of that confidence can come from. </p><p>In this course you will learn how my thinking changed, and how you can change and transform your thinking, to get past religion, culture, and man-made laws, to find beneath that a real, and true connection with God. </p><p>This is a process, and journey, and a change within yourself. This is not meant to be done in a day, or a week, you may have to go through this course over and over, each time transforming yourself, a little bit at a time. You may take the course and have a small effect, or a large effect, it is most important for you to decide what effect it will have on you before you begin, so that you are prepared for what will come of it. </p><p>There are many truths that are in this course, they will lead you, and in your deepest part of your heart, you will know that they are true. Some parts of this course, as it was for me, I had to take a step back for months, as I asked God if that was really true, and if that was how I needed to believe or think. Some lessons may be like that for you. One such lesson in this course took me 6 months to process and go through. Other lessons take weeks, days or hours to learn and apply them. </p><p>My hope is, that you find what you are looking for in this course, and that you are encourage, and comforted beyond belief, in a multitude of ways, and that you are blessed and changed in a way, that no other course or process in your life might affect you. I want you to know, that I sank my whole effect, mind, body and soul into preparing, and delivering this course, with all of my love for you, and the hope of bring an abundance of good into your life, through the material covered in this course. </p><p>For me this is a life's work, for you may it make your life work better, more harmoniously, and more in depth, as you pursue a deeper and stronger connection with God. </p><p>blessings,</p><p>-Sam</p>", 
    "end_date": null, 
    "title": "How to Act Like A Child of God", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606452_4818_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-act-like-a-child-of-god/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T00:14:34Z"
}