{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>The following quotation summarizes this course.  From the book \"Celestial Song of Creation\" by Annalee Skarin (if you are new to her writings, begin with her first book \"Ye Are Gods\")</strong></p>\n\n<p><strong>The Birth of The Spirit</strong> </p>\n\n\n\n\n\n\n\n\n\n<p>One is not born of the Spirit because he has espoused some religion or had certain ordinances performed over him and for him, as mankind has been taught to believe. These ordinances are beautiful and impressive and certainly not without merit but they are only the symbols of the true reality. They are often but the infant pacifiers of the searching soul.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The earthly ordinances are but the symbols used to gain admittance into some church that belongs to this earth. There is a higher church than any earthly organization. It is \"The Church of the First Born\" and consists of the great \"Brotherhood of Light.\" This church belongs to a higher realm and in order to gain admittance into it one must go beyond the symbols and partake of their true reality. It is only the full <em>Truth</em> that can bring the fulfillment of so great a promise as that \"spiritual birth.\"</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>One is born of the Spirit only when \"The Divine Light of Christ, which is been given to abide in every man who cometh into the world,\" is brought forth in its fullness. Only with the completion of this divine reality is one truly born of the Spirit. That it is that one is so filled with Spirit he becomes spiritual -- or is Spirit. His physical being is exalted into a spiritual vibration that is eternal and divine. In this new awareness and exalted condition the flesh and all its weaknesses and desires are transformed and one becomes a new person, a literal son of God.</p>\n\n\n\n\n\n\n\n\n\n<p>Within this birth of the Spirit is contained the dynamic fulfilling glory of the released Christ Light as it fills the individual with Its eternal Light and everlasting power.</p>\n\n\n\n\n\n\n\n\n\n<p>As one <em>prepares himself</em>, through love and compassion and inner devotion he grows into the vibration of Spirit and It's boundless Light and eternal Truth become a very part of him. One is only born of the Spirit when the great Christ Light so fills his being It becomes a permanent factor. When this happens it becomes as impossible for him to return to the dark, mediocre level of mortal living and thinking as it is for a chick to return to the egg, \"Or for a man to enter the second time into his mother's womb to be born again.\"</p>\n\n\n\n\n\n<p>It is only the TRUTH that will make one free -- the great Almighty Truth of God Himself and the unutterable glory of His vibrating power of Eternal Light -- or Spirit -- of Life...</p>", 
    "end_date": null, 
    "title": "How to Be True to Truth. Outwitting Indecision, Doubt & Fear", 
    "price": "25.00", 
    "instructors": "Andrine & Timothy \"Atmadev\"", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/789490_0aba_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-true-to-truth/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T10:04:42Z"
}