{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong></strong>If you've been struggling with waking up early and praying fajr on time; this class will teach you the practical tips to easily wake up Fajr and make most of the early hours in sha Allah:</p><ul><li>Discover how to wake up for Fajr every day with energy and sincerity</li><li>Learn spiritual tools that overcomes the classic shaytan trick of “just 5 more minutes”</li><li>Get practical tips to stay up after Fajr and maximise your barakah in the early morning</li></ul><p><strong><br></strong></p><p><strong>How's the class structured?</strong><br></p><p>The class is divided into six lessons that covers three areas:</p><ol><li>Why do you need to wake up early?</li><li>How to wake up early and pray fajr on time?</li><li>What to do after you wake up early?</li></ol><p><strong>How much time do I need to commit to complete the class?</strong><strong></strong><br></p><p>Each class lesson lasts a maximum of 10-15 minutes (most of the lessons are less than this). These easy-to-digest classes are short enough to listen to on your lunch break or daily commute. We also encourage you to allow for an 30 minutes to an hour to complete the exercises and reflections of each class.<br></p><p>So in total, you’ll need approximately 90 minutes to complete the class! This is probably the amount of time you spend in one week procrastinating, watching YouTube or TV, scrolling Facebook, over sleeping in the mornings, and other time wasters!!</p><p>By choosing to invest this short amount of time into this class instead, you’ll gain practical knowledge, resources, tips, and spiritual tools that can change your focus for life, InshaAllah!</p>", 
    "end_date": null, 
    "title": "How To Never Miss Fajr (Again!)", 
    "price": "50.00", 
    "instructors": "Mr. Mohammed Faris", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651042_dc6e_3.jpg", 
    "course_url": "https://www.udemy.com/never-miss-fajr-again/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T08:36:11Z"
}