{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t This class was created to help Pastors, Church Workers, Tech People and anyone with a ministry that wants to know how to better utilize the internet and advance their ministry online. Specific topics covered are:  </p>  <p style=\"\">  \tPart 1: Website &ndash; A Great Website that is Easy-to-Use.  </p>  <p style=\"\">  \tPart 2: Multimedia &ndash; Interactive Multimedia, online video and online streaming  </p>  <p style=\"\">  \tPart 3: Ecommerce &ndash; Online Stores/Online Donations.  </p>  <p style=\"\">  \tPart 4: Social Media &ndash; Engage and Connect.  </p>  <p style=\"\">  \tPart 5: Mobile &ndash; Mobile websites and mobile apps.  </p>  <p style=\"\">  \tParticipants in <em style=\"\">The iChurch Method</em> online school will enjoy a unique and informative set of courses that delve deep into the concepts presented in both volumes of <em style=\"\">The iChurch Method</em> books (available for purchase online here - <a href=\"http://www.ichurchmethod.com/ichurch-book/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Vol. 1</a> - <a href=\"http://www.ichurchmethod.com/ichurch-book2/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Vol. 2</a>).  </p>  <p style=\"\">  \tAlthough the books will give you the insights and information you need to help take your ministry online and global, many people prefer a more in-depth discussion to answer questions that may come up throughout the course of reading the book.  </p>  <p style=\"\">  \tEach chapter of The iChurch Method is broken down into a section incorporating videos and additional concepts that will be examined in detail. The courses include not only a chapter by chapter review from an interactive book module, a PDF version of the book for viewing as well and instructional videos that walk participants through a more in-depth, detailed discussion of each concept that will really drive the message home! Of course, a quality course wouldn&rsquo;t be complete without some Q &amp; A, interactive webinars, group discussions and brief quizzes to be certain that everyone understands the concepts to assure there is no stone unturned.  </p>  <p style=\"\">  \tCourses are at YOUR OWN PACE, there is no set time that they begin or end, it&#039;s entirely up to you. We suggest that each course take a week but if you want to move faster or slower, it&#039;s entirely up to you.  </p>  <p style=\"\">  \tGet more from <em style=\"\">The iChurch Method</em> by signing up for our <strong style=\"\"><em style=\"\">Online Training Courses</em></strong> today!  Dive into the concepts and prepare yourself to head down the path of building your ministry online with a global mindset and get your message out there today!  </p>  <p style=\"\">  \tAlthough the books will give you the insights and information you need to help take your ministry online and global, many people prefer a more in-depth discussion to answer questions that may come up throughout the course of reading the book.  </p>", 
    "end_date": null, 
    "title": "How to Advance Your Ministry Online", 
    "price": "25.00", 
    "instructors": "Jason Caston", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137960_f01e_6.jpg", 
    "course_url": "https://www.udemy.com/ichurchmethod/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-26T05:48:24Z"
}