{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Join over 550 Students!</strong></p><p><strong>Updated: </strong>February 5, 2016.</p><p>Do you need to know now what is going on with someone you love?</p><p>Do you like tarot but can't seem to do your own readings?</p><p>Do you feel your thoughts and emotions are too private to share with a stranger?</p><p>This course will help you to learn how to do your own love reading <strong>even if you've never done tarot before</strong> without paying a tarot reader or psychic to do it for you.</p><p>You will have...<br></p><ul><li>Privacy</li><li>Accurate Answers</li><li>Know what to do next - \"Keep him or dump him?\"</li><li>Know if you should wait until he contacts you.</li></ul><p>You will be able to ask all the questions you have been dying to know...</p><ul><li>Is he cheating?</li><li>Does he really love me?</li><li>Is he the one I will be with forever?</li><li>Is he married?</li><li>Is he lying to me?</li></ul><p>You will be able to find out about friends and family too! Know who is the cause of all the drama or how your future in-laws really feel about you.</p><p>This course is for beginners AND all other levels of experience. </p><p>Very EASY course that you will learn quickly on how to do a full love reading for yourself in the privacy of your own home. </p><p>Hello,</p><p>I'm Jessica Brown, a Master Psychic with over 12 years experience and I will be your instructor for this course. I have seen many readers struggle with doing an accurate reading for themselves, but I was <em>fortunate</em> enough to do my own readings that were on point for years! I'm sharing with you on how I did it and how to make sure you are going to get an <em><strong>accurate reading</strong></em><strong></strong>!</p><p>Start this course now to get answers!!<br></p>", 
    "end_date": null, 
    "title": "How to Do Your Own Love Tarot Reading - No Experience Needed", 
    "price": "20.00", 
    "instructors": "Jessica Brown", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427774_4b73_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-your-own-love-tarot-reading/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T15:27:35Z"
}