{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">In this course I will teach you how to activate your 12 DNA strands. The process is easy, free and fun. Many have done it already and it&#039;s time you do it as well !</p><p style=\"\">If you choose to activate your 12 DNA strands you will begin to gradually <strong style=\"\">become more and more psychic</strong>. </p><p style=\"\">But you will have many other benefits as well. Here are some benefits you will have by activating your 12 DNA strands:</p><p style=\"\"><strong style=\"\">Cleanse Your Aura</strong></p><p style=\"\">Clear the highest priority auric attachments you have picked up from people, places, times, things and events. Close openings in your auric field that absorb other people&#039;s negative energy, spill your Life Force away and cause you to feel tired and restless. Calibrate your chakras, remove discarnates and other foreign entities from your field.</p><strong style=\"\">Unplug Your Mind From The Matrix</strong><p style=\"\">Clear unnatural seals, implants and DNA blockages that connect your mind to the matrix. Activate your 12 strand DNA to access higher aspects of your multidimensional awareness, embody your Soul&#039;s purpose and raise your frequency to attract a higher grid of people, places, times, things and events. Activate your Golden DNA to become a frequency holder for the ascension of Earth and humanity.</p><strong style=\"\">Cut All Cords of Attachment</strong><p style=\"\">Clearing cords of attachment is the first step to freedom. Stop other people from siphoning your energy and bring a resourceful completion to past unresolved events that keep being projected onto your relationships. Allow the spiritual ties between you and other people to blossom.</p><strong style=\"\">Transcend Your Emotional Pain Body</strong><p style=\"\">Your pain body is an energy vampire that takes over your mental and emotional bodies to feed from your discordant thought forms and the reactions of other people. The pain body loves to create drama and feed from pain. Clear the soul fragments and past painful events related to the SOURCE of your pain body and become more present, peaceful and centered.</p><p style=\"\"><strong style=\"\">Master Your Relationships</strong></p><p style=\"\">Clear all your past relationship baggage and painful experiences like: betrayal, abandonment, heartbreaks, rejection and abuse. Get out of relationship karmic loops, raise your frequency and manifest the relationship you have always envisioned with your current partner or a new relationship if you are single. Relationships are the greatest opportunities to grow, evolve and experience a higher giving love.</p><strong style=\"\">Annihilate All Your Fears</strong><p style=\"\">Fear is the only thing that can stop you from moving forward. Clear all the highest priority fears from this and all past lifetimes so you can embody a state of courage and take inspired action. Imagine how your life would be if you were free from the fear of failure, fear of death, fear of criticism, fear of not being good enough and the fear of not being loved. It is time to activate the ultimate sense of personal power and unleash your greatest potential!</p><strong style=\"\">Activate Your Heart Chakra With Unconditional Self-Love</strong><p style=\"\">Clear all soul fragments related to resentment, betrayal, judgment, hatred, guilt, shame and trust issues that prevent your from fully opening your heart chakra and melting in unconditional self love. Experience the bliss of melting in Divine Love and let your mind surrender to your heart&#039;s intelligence and guidance.</p><strong style=\"\">Advanced Higher Self Healing Techniques</strong><p style=\"\">Master the connection to your Higher Self, read energy signatures and clear the SOURCE of any energetic blockage on yourself and other people. This energy healing technique will allow you to transcend both time and space to perform soul retrievals and heal soul fragments that were created in this and past lifetimes. Remove auric attachments, karmic imprints, shadow self archetypes, negative thought forms and energy blockages to any manifestation. Connecting to your Higher Self is the ultimate way to become sovereign and take control of your destiny!</p><strong style=\"\">Manifest Financial Abundance</strong><p style=\"\">Clear all energetic blockages like unworthiness, undeservedness, poverty consciousness, lack and limitation to finally get out of the scarcity karmic loop. Activate your DNA, chakras and auric field with the frequencies of financial and material wealth. </p>", 
    "end_date": null, 
    "title": "How to become psychic by activating your 12 DNA strands ", 
    "price": "20.00", 
    "instructors": "Gilad James", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568412_70fd.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-psychic/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T16:40:35Z"
}