{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Tap into Your Psychic Ability, Contact Your Spirit Guide and Angels, Protect Yourself against Psychic Attack and Learn to Give Accurate Psychic Readings to Improve your Finances, Your Career and Your Relationships with this How to be Psychic course.</strong></p><p><em>Update: This psychic development course is completely updated and current through August 2015</em></p><p>Would you like to know ahead of time how to make the <strong>best decisions</strong> in your career, finances and relationships?<br></p>  <p>Would you love to have instant access to your <strong>spirit guides</strong> using your psychic abilities so you were always <strong>protected from harm</strong>?</p><p>Do you feel drained by the negative energy of those around you and would love to know how to always protect yourself with <strong>psychic protection</strong> so you can experience more peace and clarity in your life and no longer be influenced by others? </p><p>Would you like to improve your <strong>psychic abilities</strong> and <strong>contact your spirit guide</strong> for spiritual guidance? <br></p><p>Would you love the opportunity to practicing giving psychic readings in a safe and supportive environment with over 150 other beginners to build up confidence in your <strong>intuition</strong> ? </p><p><br></p>  <p>  \t<strong>How to Be Psychic </strong>will teach you everything you need to know about giving psychic readings so you can confidently navigate your life for your best and highest good. This course will also give you powerful audio meditations to contact your guardian angel and spirit guides to improve your finances, your career path and your relationships. </p><p>This psychic development is ideal for anyone who wants to instantly improve their intuition, discover what intuitive gifts they have and learn to give accurate psychic readings, as well as anyone who is <strong>sensitive</strong> and easily takes on the problems and negative energy of those around you. . </p><p>It will also suit tarot readers, alternative therapists, nurses, healers and anyone who wants to make a living helping others using their <strong>intuition. </strong></p>  <p>  \t<strong>You will learn to:</strong>  </p>  <ul>  \t<li>Make the right decisions to avoid costly mistakes including bad relationships, poor investments and nightmare jobs.</li>  \t<li>Easily contact your spirit guides and angels for spiritual guidance and advice</li>  \t<li>Protect yourself from damaging people and situations that may drain or harm you</li>  \t<li>Confidently read oracle cards to get the answers you need</li><li>Channel psychic information by only contacting light beings that can help improve your life</li>  \t<li>Earn extra income as a psychic </li>  \t<li>Attract new clients and give safe and ethical readings to help others.</li>  \t<li>Use remote viewing to improve your finances, career, health and personal relationships</li><li>Join hundreds of beginners to exchange readings in a private Facebook page in a safe and supportive environment to build up your confidence and practice your new intuitive abilities. </li>  </ul>  <p>  \t                                           Featuring 48 lectures with video presentations, live psychic readings, guided audio meditations and 3 quizzes, that will teach you everything you need to know about being psychic in a safe and accessible way.  </p>  <p>  \t                  You will also receive regular updates on the latest tips and techniques to enhance your intuition, as well as links to free oracle readings and healings on the web.  </p>  <p>  \t                  Course last updated: August, 2015.  </p>  <p>  \t<strong>Bonus Facebook Page Access</strong>  </p>  <p>  \t                                      When you join <strong>How to Be Psychi</strong>c - you have access to course Facebook page where you can meet other students and practice your skills!  </p>  <p>  \t      As a student you will also get my help answering any questions you have about the course content.</p>  <p>  \t                  So enroll in this course now and discover how empowering it feels to completely trust you are always making the best move forward in your life.  </p>", 
    "end_date": null, 
    "title": "How to Be Psychic - Psychic Development for Beginners", 
    "price": "40.00", 
    "instructors": "Sal Jade", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/201966_bb2e_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-psychic/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-20T03:53:22Z"
}