{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Recorded at a full day of Tabernacle Prayer teaching and activation, these powerful video sessions lead the listener through the gates of the Heavenly Tabernacle on a revelation filled journey into the Holy of Holies. If you want to learn to pray Tabernacle | Temple Prayer you will be inspired and instructed with 4 hours of in depth revelatory teaching, activation and testimony. The teaching begins with a look at foundational truths concerning prayer, and the reality of the Heavenly tabernacle, and then steps through the gates to begin a step-by-step guide through the Tabernacle and right into the Holy of Holies.  </p>  <p>  \t Register now to get lifetime online access to all 21 videos, leading you step-by-step from the doorway to the Holy of Holies.  </p>  <p>  \t The teaching begins with a look at foundational truths concerning prayer, and the reality of the Heavenly tabernacle, and then steps through the gates to begin a step-by-step guide through the Tabernacle and right into the Holy of Holies.  </p>  <h5></h5>  <h5>SECTION 1. Introduction &amp; The Doorway</h5>  <p>  \t Learn how praise, worship and thanksgiving carries us into the heavenlies to approach God.  </p>  <h5></h5>  <h5>SECTION 2. The Brazen Altar – The Cross</h5>  <p>  \t How to apply the awesome results and benefits of the cross in our lives through prayer.  </p>  <h5></h5>  <h5>SECTION 3. The Brazen Laver</h5>  <p>  \t How to set ourselves apart in service to God through His Word, and understanding how the atonement transforms law into promise.  </p>  <h5></h5>  <h5>SECTION 4: THE HOLY PLACE<br style=\"\">   <br style=\"\">   The Golden Candlestick &amp; the Table of Showbread</h5>  <p>  \t The Golden CandlestickCommuning with the Holy Spirit, and receiving from Him as you fellowship in the heavenly sanctuary.  </p>  <p>  \t Hearing the NOW Word of God from Jesus’ lips.  </p>  <h5></h5>  <h5>SECTION 5: THE HOLY OF HOLIES<br style=\"\">   <br style=\"\">   The Altar of Incense &amp; The Ar of the Covenant</h5>  <p>  \t Offering true New Covenant sacrifices of praise and worship, and coming before the Father with full confidence to present your requests before Him.  </p>", 
    "end_date": null, 
    "title": "How To Pray Tabernacle Prayer", 
    "price": 0, 
    "instructors": "David Lee Martin", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/64415_057d_6.jpg", 
    "course_url": "https://www.udemy.com/tabernacle-prayer/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-08T15:14:21Z"
}