{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Are you on a path of spiritual development? Your Spirit Guides and Teachers are always there to help. Spirit Guides can and should be an ongoing part of your life; this course offers a way to help you build a connection, and communicate with your guides at any time.</p><p style=\"\"><strong style=\"\">Become Open to Spirit&#039;s Guidance</strong></p><p style=\"\">Learn how Spirit Guides Communicate.</p><p style=\"\">Identify which guides are communicating with you and how they can help.</p><p style=\"\">Understand tools you have for communication.</p><p style=\"\">Build a foundation for a long lasting connection.</p><p style=\"\"><strong style=\"\">Build a Foundation for Spiritual Growth</strong></p><p style=\"\">Understand that you are NEVER truly alone. Your Spirit Guides are your own personal spiritual helpers, and can aid you in your spiritual growth. You have guides that can aid you on your path to happiness, health, and wisdom. If you but open the door, spirit is there to guide you.</p><p style=\"\">You do not have to be a fully developed psychic medium to connect with spirit, your guides are your personal helpers and there whenever you seek them.</p><p style=\"\"><strong style=\"\">Course Overview</strong></p><p style=\"\">In this course you will learn the basics of spirit guides and how they can help. We will go in depth about the types of guides and their roles, and how you can begin to build a connection. Spirit Guides can communicate in many ways, and we will discuss the most common ones in detail. I will show you how you can use breathing and meditation to aid in spirit communication, and common tools used to reach your guides.</p><p style=\"\">At the end of the course you will be empowered to build a long lasting connection with your guides, and use their love and light to aid your spiritual growth.</p>", 
    "end_date": null, 
    "title": "How to Connect with your Spirit Guides", 
    "price": "40.00", 
    "instructors": "Justin Terry", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537422_f5b1.jpg", 
    "course_url": "https://www.udemy.com/justin-terry-spirit-guides/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-25T20:59:01Z"
}