{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>If you ever had questions about the Stations of the Cross and how they applied to your daily life, then this course is for you!  </strong></p>  <p>Many people are familiar with the story of Jesus and his journey on the road to Calvary.For Christians, it’s the most important journey ever taken and the foundation of the faith.The time of Lent and Easter is paramount to the Christian doctrine.</p>  <p>Some may not know or understand that the stations – a pictorial representation of each major step from Jesus being condemned to his entombment – have meaning beyond the story of the journey.These meanings apply to our daily lives; helping guide us to act as Jesus – in a righteous manner within society. </p>  <p>The course will cover each of the 14 stations.In our parish, we’d studied the 15<sup>th</sup> as well – the resurrection. So this will also be included. </p>  <p>Another aspect of this course is regarding the prayers for each station.I’d been blessed to have been part of a production of a <em>living</em> Stations of the Cross in our Parish.My mother had helped write and produce it.The prayers used in this course come from that presentation!</p>  <p>My mother had been a strong influence in our family’s foundation of faith. I’d begun my ministry at age 15 – having served as a minister of Christian Service, youth and music minister, and a Catechist for the Rite of Christian Initiation and Confirmation. </p>  <p>Imagine entering any church or courtyard, walking up to a station, and reveling in the deeper, personal meaning behind it. This course is intended to provide this experience for you if you consider the reflections with an open mind!</p>  <p>Thank you for taking this journey with me.I look forward to seeing you inside the course. And have a blessed day!</p>", 
    "end_date": null, 
    "title": "How to Apply Lessons from Stations of the Cross to Your Life", 
    "price": "20.00", 
    "instructors": "Frances C. Rodriguez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777158_a452_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-apply-lessons-from-stations-of-the-cross-to-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-28T21:59:31Z"
}