{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>My most endearing memories of this life are of walks and talks with Swami Rama along the River Ganges, in the foothills of the Himalayas. He held my hand and guided me in the subtler principles and practices of Yoga as practiced by our Himalayan meditation tradition.</p><p>For over 20 years I have been helping to pass on these principles and practices through group discussions of these writings, which are being highlighted here in this presentation.</p><p>This course is for those who already have some exposure to Yoga, and wish to explore the subtler principles. If you have ever heard of, or may be interested in Yoga as expounded in the traditions of the Himalayas, you may quite enjoy this overview of the essence of Yoga through the eyes of Swami Rama of the Himalayas (1925-1996). Yet, the information and practices of this tradition are universal, and applicable to all people. There is no effort here to recruit anybody into any religion, institution, or other such group.</p><p>It has been widely said that when the student is ready, the teacher will appear. Putting this together is—for me—an act of gratitude and love for Swami Rama, the one who showed up in my life.</p><p>We hope this presentation gives you 'food for thought' about Yoga and spiritual life. Please use these readings as contemplations, rather than lectures for an examination. When a reading captures your attention, pause the video and reflect on it in your own words. Then, allow insights to lead you to silent, wordless inner contemplative meditations. Please be patient with this, gently exploring over time.</p><p>We had a lot of fun putting this together for you. For those of you who will enjoy this offering, I am…</p><p>In loving service,</p><p>Swami J</p><p>(Swami Jnaneshvara Bharati)</p>", 
    "end_date": null, 
    "title": "Inspirational Yoga Messages from Swami Rama ", 
    "price": 0, 
    "instructors": "Abhyasa Ashram, Swami Jnaneshvara Bharati, Swami Ma Tripurashakti Bharati", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725680_05a4_4.jpg", 
    "course_url": "https://www.udemy.com/inspirational-yoga-messages-from-swami-rama/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T15:09:53Z"
}