{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Dijeron los discípulos de Emaús en Lucas 24,32: ¿No ardía nuestro corazón cuando nos hablaba en el camino y nos explicaba las Escrituras? Por años he visto muchas vidas transformadas por el estudio y meditación de la Palabra de Dios. Por eso sé que Iniciar un estudio serio de la Biblia con la certeza de que se conocen las reglas básicas dictadas por la Iglesia Católica para su adecuado estudio, es clave para tener un encuentro personal con Jesús que haga arder el corazón, llenarlo de vida, alegría, amor y fe, una fe que, con la ayuda de Dios, todo lo vence.</p>    <p>Este curso de Introducción a la Biblia va dirigido primordialmente a Cristianos Católicos que sientan hambre y sed de la Palabra de Dios.</p><p>Para este curso necesitarás una Biblia Católica con sus 73 libros y de ser posible un ejemplar del Catecismo de la Iglesia Católica. Recuerda que para meditar la Sagrada Escritura y entender el mensaje de \nDios es fundamental el amor a Jesucristo, la Oración diaria y la Pobreza\n de Espíritu (Mt 5,3: \"Dichosos los pobres de espíritu, porque de\n ellos es el Reino de los Cielos”).<br></p><p>Las enseñanzas de este curso vienen en pequeños videos de entre 1 y 6 minutos y abarcan una amplia gama de temas importantes para queines se adentran en el mundo de la Sagrada Escritura. En total el curso dura un poco más de una hora.</p>    <p><br></p>", 
    "end_date": null, 
    "title": "Introducción Amable al Estudio de la Biblia para Católicos", 
    "price": 0, 
    "instructors": "Francisco Delgado", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550266_68c9_2.jpg", 
    "course_url": "https://www.udemy.com/introduccion-amable-al-estudio-de-la-biblia/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-09T17:32:21Z"
}