{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">In this course I will explain what the Dark Side or darkness really is. As a by product you will also understand what the Light really is. </p><p style=\"\">The hues <strong style=\"\">white and black</strong> are widely used to depict opposites. Visually, white and black offer a high contrast. In Western culture, white and black traditionally symbolize the dichotomy of good and evil, metaphorically related to light and darkness and day and night. The dichotomy of light and darkness appears already in the Pythagorean <em style=\"\">Table of Opposites</em>.</p><ul style=\"\"><li style=\"\">in religion and mythology<ul style=\"\"><li style=\"\">The Genesis creation narrative has God &quot;separate light from darkness&quot; on the First Day.</li><li style=\"\"><em style=\"\">War of the Sons of Light Against the Sons of Darkness</em></li><li style=\"\">The underworld (Hades, Tartarus) was imagined as a chthonic place of darkness, contrasting with the celestial realm of the gods. Christian notions of heaven and hell inherit this conception, as do the &quot;dark angels&quot; vs. the unfallen angels, often with aureola (halos), inChristian mythology.</li></ul></li><li style=\"\">&quot;Black and white thinking&quot; is the false dichotomy of assuming anything not good is evil and vice versa.</li><li style=\"\">Dress<ul style=\"\"><li style=\"\">White often represents purity or innocence in Western culture, particularly as white clothing or objects are easy to stain. In most Western countries white is the color worn by brides at weddings. Angels are typically depicted as clothed in white robes. In manyHollywood Westerns, bad cowboys wear black hats while the good ones wear white. Melodrama villains are dressed in black and heroines in white dresses. Evil witches are stereotypically dressed in black and good fairies in white.</li><li style=\"\">This can be reversed as a deliberate play on conventions, by having the evil character dress in white, as a symbol of their hypocrisy or arrogance. For example, Don Fanucci in &quot;The Godfather, Part II&quot; is an evil character, but wears an expensive all-white suit as a sign of his esteem, power and prestige. Sometimes protagonists can wear black too, as in<em style=\"\">Star Wars Episode VI: Return of the Jedi,</em> wherein Luke Skywalker wears black during the final battle.</li><li style=\"\">In computer security, a black hat is an attacker with evil intentions, while a white hat bears no such ill will. (This is derived from the Western movie convention.)</li></ul></li><li style=\"\">Magic<ul style=\"\"><li style=\"\">Healing or &quot;good&quot; paranormal magic is called White magic. Black magic is a destructive or evil form of magic.</li><li style=\"\">A Treatise on White Magic is a book by Alice Bailey, a Theosophist.<sup style=\"\"></sup></li><li style=\"\">White witch.</li></ul></li><li style=\"\">The Yin and yang symbol (太极图 tàijítú), attributed to Lái Zhī-Dé (1525–1604).</li><li style=\"\">The Dark Ages vs. the Age of Enlightenment.</li><li style=\"\">As shown in <em style=\"\">The Lord of the Rings</em>, the antagonist is Sauron, who is the &quot;Dark Lord.&quot;</li></ul><p style=\"\">The topos of &quot;light and darkness&quot; is also reflected in numerous titles in popular culture, such as <em style=\"\">Heart of Darkness</em> (1899), <em style=\"\">Light in My Darkness</em> (1927), <em style=\"\">Darkness and the Light</em> (1942),<em style=\"\">Creatures of Light and Darkness</em> (1969), <em style=\"\">From Darkness to Light</em> (1973), <em style=\"\">Darkness and Light</em> (1989), <em style=\"\">The Lord of the Light and of the Darkness</em> (1993), the <em style=\"\">Star Trek: Deep Space 9</em>episode &quot;The Darkness and the Light&quot; (1997), the <em style=\"\">Babylon 5</em> episode &quot;Between the Darkness and the Light&quot; (1997), and <em style=\"\">Out of the Darkness, Into the Light</em> (1998).</p><p style=\"\">George Orwell makes a bitterly ironic use of the &quot;light and darkness&quot; topos in his <em style=\"\">Nineteen Eighty Four</em>. In the early part of the book the protagonist is getting a promise that &quot;We will meet in the place where there is no darkness&quot; - which he interprets as referring to a place where the oppressive totalitarian state does not rule. But the man who made the promise was in fact an agent of the Thought Police - and they eventually meet as prisoner and interrogator where there is indeed no darkness, in detention cells where the light remains on permanently, day and night, as an additional means of torturing detainees.</p>", 
    "end_date": null, 
    "title": "Introducing our enemy- The Dark Side", 
    "price": "20.00", 
    "instructors": "Gilad James", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597168_3586.jpg", 
    "course_url": "https://www.udemy.com/introducing-our-enemy-the-dark-side/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T04:51:06Z"
}