{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Everyone has a desire to be successful in life. Yet for so many, the idea of success seems elusive or far away.</p><p>In this online course, we pinpoint the time-tested principles necessary to achieve true success coupled with lasting fulfillment. Stop toiling and progress toward your destiny!</p><p><strong>About the Course</strong></p><p>You may have read books or watched lectures about success, but many of them are missing vital Kingdom principles that are often overlooked.</p><p>The goal of this course is to lay the proper foundation with time-tested principles to build your vision on and discover true success. In each lecture, you'll find videos from Trista Sue Kragh, international business and leadership speaker, and a workbook with reflective questions to help guide the way!</p><p>It's time for true, lasting success!</p><p><strong>What do I get?</strong></p><ul><li>The key element for activating success in your personal life</li><li>100% Self-paced - Take this course anywhere, anytime, on any device</li><li>Exclusive video lectures featuring course instructor, Trista Sue Kragh</li><li>Private Student Workbook with reflection questions included!</li></ul><p>The idea of success means something entirely different in the Kingdom of God. Learn what that missing piece is and finally find lasting success.</p>", 
    "end_date": null, 
    "title": "Keys to True Personal Success", 
    "price": "40.00", 
    "instructors": "Trista Sue Kraugh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744310_9035_2.jpg", 
    "course_url": "https://www.udemy.com/keys-to-true-personal-success/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T00:37:25Z"
}