{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hello,</p><p>    Welcome to the<em> Kingdom Glory training series</em> which is a highly interactive course that will propel you into the<strong> </strong><em>Glory</em> and train you how to release the Kingdom of God in an unprecedented fashion! In these sessions there are three main themes throughout the course: Learning your <em>Authority</em>, Learning your <em>Identity</em> and Learning the <em>Heart of God</em>. </p><p>    Along with these teachings you will also have powerful activation's to put into practice what you have just learned to make it a part of your life. Also, there is a session that is a <em><em>complete</em></em> Bethel Treasure Hunt training where you will be trained in the gifts of the Spirit with an actual group to learn how to release God into any situation in life so that revival becomes a normal lifestyle!</p><p><strong>About the Author:</strong><br></p><p>   Alexander Logia is a Bethel School of Supernatural Ministry graduate and is currently a ministry Associate with Kevin Dedmon and Jason Chin. Recently married, Alexander lives in Redding as an overseer for Treasure Hunts and Firestarters at Bethel Church. He has been doing crusades throughout Africa and Philippines with a passion to see worldwide harvest through the preaching of the gospel in a demonstration of the Holy Spirit and power. Thousands of people have been healed, saved and delivered in his ministry in various nations around the world-<br></p><p><br></p><p><strong>Fund Revival Around the World:</strong></p><p>   As you join this training series you will also be sowing into the ministry and helping fund crusades and missions work in various nations. We ultimately want to take this glorious gospel to all creation and see Jesus get His full reward! Thank you for your support and we pray that you are abundantly blessed !</p>", 
    "end_date": null, 
    "title": "Kingdom Glory: Release the Presence of God as a Christian", 
    "price": "25.00", 
    "instructors": "Revival Lifestyle Academy", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/621802_86e9.jpg", 
    "course_url": "https://www.udemy.com/kingdomglory/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T23:41:47Z"
}