{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    Yoga is very popular today. You will find answers in this course beyond the physical exercises or the relaxation which yoga is normally associated with.  </p>  <p>  \tThe course is structured in 7 sections which make the journey as short as 2 days and as long as you want. We advise you to take it slowly and meditate at each step. There are plenty resources that may give you room for expanding your horizons and fulfill your expectations. In Yoga there is no competition, no pain and no stress.  </p>  <p>  \tIn the First Section you will find an historical introduction to Yoga and its modern interpretation given by Ananda Marga school of Yoga and Way of Life.  </p>  <p>  \tIn the Second Section we enter into the main characteristics of spirituality associated with Tantra Yoga.  </p>  <p>  \tIn the Third Section we pass through the system of cardinal principles which constitute the moral foundation of Yoga.  </p>  <p>  \tIn the Fourth Section we examine the 8 steps of Astaunga Yoga.  </p>  <p>  \tIn the Fifth Section we open to the social outlook through the philosophy of neo-humanism and neohumanist education.  </p>  <p>  \tIn the Sixth Section we expand the social Philosophy of PROUT - Progressive Utilization Theory  </p>  <p>  \tAnd in the Seventh and last section we consider the social service that is done by Ananda Marga globally through its different departments and related welfare projects.  </p>  <p>  \tThe course is structured for giving you a very broad perspective. You are free to get deeper in any of the Sections according to your personal interest. Eventually we hope you will get in direct contact with Ananda Marga in its multifarious endeavor to bring welfare and upliftment to all.  </p>  <p>  \tMay you enjoy the universal peace and advance on the spiritual path towards the supreme desideratum.  </p>", 
    "end_date": null, 
    "title": "Know yourself with Yoga", 
    "price": 0, 
    "instructors": "Ac. Avt., Dada Diiptimanananda", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370098_4d50.jpg", 
    "course_url": "https://www.udemy.com/ananda-marga-rajadhiraja-yoga/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-14T14:17:24Z"
}