{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "\n\n\n\n<p>Presentaciòn de las clases conociendo de la biblia temas importantes de su origen, formación y desenvolvimiento. El canon de la biblia es presentado en su veracidad y ecigencias para su formacòn. Temas com revelación, inspiración e iluminacion que son importantes para la teologia son vistos como centrales para la compreensión del asunto tratado</p>\n\n<p>Son presentados argumentos para la defensa de la misma en la areas de sus textos originales. Son presentadas las referencias necesárias a respecto de valor que ella se da. El panorama general de las divisiones de la biblia son presentadas en terminos graficos para ser recordados con facilidad</p>\n\n\n\n<p>Este curso de introducción biblica es importante y básico para desenvolver otras etapas de la bibliologia y de la teoloiga sistemática. Asi el alumno podra tener una construcción teologica firme en su teologia de vida</p>\n\n\n\n<p>Este curso es indicado para todos aquellos que estudian en areas de humanidad, sea historia, psicologia, filosofia,teologia etc. Pero independiente de la forrmacion este curso ofrece un conocimiento general de la biblia. Sbeiendo que la biblia es un libro universal y de una de las religiones mayores en el mundo, es recomendable participara para asi conocer mejor la formacion del occidente y su cultura</p>\n\n\n\n<p>No es exigido de una formacion formal y superior. Basta tener  el interes en el conocimiento general del ser humano. No son exigidos recursos especiales en terminos de software o de otra naturaleza.</p>\n\n\n\n<p>Este curso esta estructurado em seis secciones las cuales cada una de ellas inclui sus clases en particular. Al todo son 18 lecciones que daran al alumno informaciones suficientes para establecer un conocimiento basico de la Biblia</p><p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "La biblia: Su Historia Desde Su Nacimiento", 
    "price": "20.00", 
    "instructors": "Reverendo José Miguel M. Aguilera", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818952_0af2.jpg", 
    "course_url": "https://www.udemy.com/introduccion-biblica/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T18:19:19Z"
}