{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>First of all, let's make sure that this course is right for you before you sign up for it.</p><p><strong>This course is right for you if:</strong><br></p><ol><li><strong>You feel stuck in life, or</strong></li><li><strong>You are wanting something more, or</strong></li><li><strong>You feel like you're fighting an uphill battle when it comes to your goals.</strong></li></ol><p>If you answered YES to any of the above questions, this course is for you. If you answered yes for more than one, than this course is definitely for you.</p><p>What if, by the end of this course, you could be 100% happy and fulfilled with the life you live...today? Wouldn't that be the ultimate reward for what you're learning here today?</p><p><strong>A two-year journey to instant manifestation.</strong></p><p>I won't be modest here. I've literally discovered the key to instantly manifesting anything and everything I want in life, and I'm proud of it.</p><p>Within 24 hours of installing the \"mental programming\" in myself that I'm helping you install during this course, I was already living the life I once dreamed of living.<br></p><p>And then I used this technique on all my friends/clients..and they are now in full control of creating their life.</p><p>The unconscious is now conscious for us...and you are here today because this course will share what I learned with you.</p><p><strong>This is (by far) the most important course, you'll ever have taken in your entire life...and this is why...</strong><br></p><p>If you want to learn how to TAKE FULL CONTROL OF, and steer the direction of your life...this course is definitely for you.</p><p>By the end of this course, you'll already have realized that you are the creator of your experience in this life.</p><p>In the past, I would type up some long \"salesy\" description here to try to get you to buy the course...but I said all I needed to say. You can either continue the journey I went on and learn how to manifest instantly YEARS from now (or never)....or you can pay the small price for my time to create this course for you, and learn it right now.</p><p>Whether you choose to decide to sign up for this course now, or if you want to delay your goals by a couple of years...the choice is yours.</p><p>-Andrew Alexander</p>", 
    "end_date": null, 
    "title": "Law of Attraction - You Already Have It...", 
    "price": "20.00", 
    "instructors": "Andrew Alexander", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/774154_ed71_2.jpg", 
    "course_url": "https://www.udemy.com/master-the-law-of-attraction-yesterday/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T17:17:56Z"
}