{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn the ancient art of reading Tarot cards using the Kabbalistic Tree of Life, as practiced and taught by Dovid Krafchow author of Kabbalistic Tarot published by Inner Traditions 2005.</p><p>In this workshop Dovid Krafchow shows how the meaning of the tarot is locked within the Kabbalah. Designed for beginners and experienced readers alike, this online workshop will take you through a journey to understand the Kabbalistic symbolism of these ancient cards, and how to perform successful readings for yourself and others.</p><p>You will become familiar with the structure of the Tarot deck and learn the art of Tarot readings. You will learn how the deck aligns with the Kabbalistic Tree of Life and the human body so you can use them as a systematic blueprints for performing your readings. As such, this method is non-deck specific which means you will be able to use your favorite deck (Please note that Dovid will be using the Ryder-Waite deck during the workshop). By the end of the workshop you will know how to perform a reading, and be ready to practice with your friends and family!  </p>\n<p>Dovid’s unique reading method features a 10 card spread. This detailed layout utilizes the various suits to reveal where the subject of the reading is spiritually and physically in their life’s journey, as well as provides insight as to their destination. Furthermore, Tarot sheds light on the steps which can be taken to alleviate the challenges that the reading addresses. </p>\n<p>Dovid’s light, engaging and entertaining style allows for slow, structured familiarization with the deck, which will be the focus of the first part of the workshop. The last part is dedicated to learning the reading method as well as to provide you with tips, tricks and other invaluable information, derived from Dovid’s 30 years of experience. </p>\n<p>In this workshop, you will learn: <br><br></p><ul><li>What Tarot is, and how the readings work</li><li>What the Kabbalistic Tree of Life is and how it can be used as a Tarot reading </li><li>How to quickly get familiar with the Tarot Deck </li><li>What the Major Arcana is and the significance of each card</li><li>What the Minor Arcana is and what each suit means</li><li>How to spread the cards during your readings</li><li>Your responsibilities as a Tarot reader</li><li>Tips and tricks for successful readings</li><li>And much more!</li></ul>", 
    "end_date": null, 
    "title": "Learn to Read Tarot Cards", 
    "price": "50.00", 
    "instructors": "Dovid Krafchow", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/712202_b533_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-read-tarot-cards/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-01T00:02:53Z"
}