{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Check out the video to see the first lesson in the course.</strong></p><p><strong>************************************************************************<br>Reviews from Current Students:</strong></p><p><strong><em>Correct use of the Word is so refreshing! </em></strong><em>I started this course last night, and I like the way Dr. Shane Wall talks. I appreciate those who know the WORD and use it correctly. </em> —Gary</p><p><strong>Very inspiring! </strong>Dr. Shane Wall succeeded with this course to increase my faith that ''I'' am doing the right thing in that what ''I'' am doing...... It is a very inspiring course and I am looking forward to learn more from him. Thank you Shane...<br>************************************************************************</p><p>The Bible says that <strong>everyone can prophesy</strong>. That means its up to you to grasp God's Word so that you can begin speaking life into your life, the lives of those around you, and even to the nations. Use this course to unlock the prophetic abilities that God has already placed in you, even if you don't think that it's your special spiritual gifting.<br></p><p>As His children, God wants us to encourage one another, and that can happen through your life through prophesy. This course will teach you how to prophesy accurately, affecting that individual in their very spirit, directing their eyes to God.</p><p>I've used the very teachings in this course to prophesy accurately for over 20 years, and I want to teach you to do the same. Join me in discovering your God-given prophetic ability.</p>", 
    "end_date": null, 
    "title": "Learn How to Prophesy with Amazing Accuracy", 
    "price": "20.00", 
    "instructors": "Dr. Shane Wall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594736_3392.jpg", 
    "course_url": "https://www.udemy.com/youcanprophesy/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T07:30:19Z"
}