{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Years of my experience in overseas Bible missions, to hostile and anti-Christian territories, are brought to you here for your convenience and edification. This course will ALWAYS BE FREE.</p>\n\n<p>This course will explain how to understand the true context and meaning of God's Word so that one can conduct a proper and accurate personal Bible study on their own. </p>\n\n<p>First we will conduct a quick lesson on how to gain a complete CONTEXTUAL understanding of scripture passages in a manner God intended for the message to be received, not in a manner the reader, or someone behind a podium, wants to receive it. </p>\n\n\n\n\n\n<p>Secondly we will breeze through some online tools (free &amp; no registration required) that will assist you on gaining true perspective of a passage as it relates to the time period, audience, and cultures in which it was written, and how we are to apply it to ourselves now. </p>\n\n\n\n\n\n<p>The core of this course is to teach you an easy 1-2-3 step method of studying the Bible in a manner that will give you better understanding, meaning, and life application. This is not a 'Bible in a year' plan. This is a 'Know The Bible &amp; Its Message' plan regardless of how long or quick it takes you to read it. </p>\n\n\n\n\n\n<p>If you need a Bible. Send me a message with your address and I will ship one out to you...for free. Its a nice Bible too. It's a ministry my wife and I conduct. </p>\n\n\n\n\n\n<p>I hope to see you in the course! God Bless!</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn to Become a Bible Study Pro! (All levels)", 
    "price": 0, 
    "instructors": "James Neil", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/820720_0e7d_4.jpg", 
    "course_url": "https://www.udemy.com/bible-study-pro/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T08:41:51Z"
}