{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Merry Meet</strong>. This magical course is about showing you gifted approaches to bringing the sacred spirituality into everyday life through simple rituals, easy spell casting and more. Discover how to make your actions matter by casting spells and engaging is the sacred times of the moon and the year. Learn to dedicate alters and more as you begin to move through life with love with ease. </p><p>This is an interactive course, you will be working with me. So join me as we:</p><ul><li>cast a spiritually infused sacred circle</li><li>cast spells</li><li>perform ritual</li><li>recite power invocations</li><li>decorate seasonal altars and so much more.</li></ul>\n\n<p>This course aims to bring the sacred alive within you so that the your potential is opened and becomes transformative for all of you who sign up. You will be able to bridge this magical spiritual path with your family, business, community, becoming of greater service to the planet.</p>\n\n\n\n<p>Moving into the sacred realm is an essential part of Witchcraft. If fact it may be said it is the very essence itself. This is an ancient path for those who hearts are true. One of the ancient religions that has survived the rigours of both time and persecution. The craft is not what is was thousands of years ago, nothing is. It has moved and morphed so that it is just as relevant to as back in the Mists of Avalon.</p>\n\n\n\n\n\n\n\n\n\n<p>Come, lets celebrate together in perfect love and perfect trust. With all my courses I aim to create a sacred global community from which we can all safely do deep spirit fuelled work. I know there are mixed feelings about courses taught online in this way. There are pros and cons. However time, isolation and distance gift us an opportunity to work with a global community.  We are joining our hearts and spirits together on behalf of our mother Earth as we once again resonate in frequency with her upon the sacred magical path that is Witchcraft.</p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Magical Witchcraft", 
    "price": "20.00", 
    "instructors": "Sharon Ramel", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/812266_4c92.jpg", 
    "course_url": "https://www.udemy.com/magicalwitchcraft/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-04T11:41:25Z"
}