{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Welcome to this course, <em style=\"\">Metaphysical Bible Study: Decoding the Revelation, Part One (Revelation 1:1 to 8:1). </em></p><p style=\"\">This study of <em style=\"\">Revelation is</em> a consciousness-journey where you will learn to decode the apocalyptic symbols and apply spiritual truths, ideas, and laws to your life that bring healing and immense spiritual development.</p><p style=\"\">If you are a spiritual seeker curious about the book of <em style=\"\">Revelation</em>, looking for powerful spiritual development with practical effects, this course is for you. Part One of this course includes the riveting story of Revelation&#039;s origin, the experiences of its author, and a life-changing, health-producing analysis of the &quot;Messages to the Churches,&quot; messages to the individual consciousness that skyrocket spiritual development and understanding. It continues to the 2nd of the seven Visions that make up the body of <em style=\"\">Revelation (the &quot;Throne-Room&quot; and the &quot;Angels with Seals&quot;).</em> The following course, &quot;Decoding the Revelation: Part 2,&quot; completes this dynamic and energizing study with the final Visions. Expected launch date, October 2015.</p>    <p style=\"\">  \t  Students should work through this course (Part One) in about six to eight weeks, and the subsequent course on the seven visions of <em style=\"\">Revelation </em>in three to four months. Steady, systematic study will yield the best results as you train thought to live consistently and consciously in the healing-energy of the Christ.</p><p style=\"\">Recommendation: Study deeply and meditate on the key ideas. Utilize the decoded instructions for overcoming whatever is unlike good and claiming your true freedom in the Love of the One, the I AM THAT I AM. Review each day, keep a journal, and feel after the vibrant energy of Spirit in everyday life. </p>  <p style=\"\">Let the Spirit shine through. “Draw nigh to God, and He will draw nigh to you&quot; (James 4:8).  </p>", 
    "end_date": null, 
    "title": "Metaphysical Bible Study: Decoding the Revelation, Part One", 
    "price": "30.00", 
    "instructors": "Abby Parsons, PhD", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427912_89a9_2.jpg", 
    "course_url": "https://www.udemy.com/decodingrevelation1/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T18:41:03Z"
}