{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Do you dream of one day knowing all you need to know about spirituality and have discovered the pot of gold of what you have been searching for?  </p>  <p style=\"\">  \t  Do you dream that you will be in control of your thoughts and feel more alive and bliss states in your daily life?  </p>  <p style=\"\">  \t  Do you fear that you may die not having worked out the spirituality puzzle and dying with regret, fear and pain in your heart?  </p>  <p style=\"\">  \t  Are you scared that the deeper you go the more questions you’ll have and this will lead you on a wild goose chase?  </p>  <p style=\"\">  \t  Have you bought other programs and it feels like you have hardly progressed in your evolution as a human?  </p>  <p style=\"\">  \t  Hi My name is Ivan Kramer and I’ve had a really tough childhood, and I looked into spirituality to explain my life and why I was here and help me move though the deep hurt and pain I had as a child.  </p>  <p style=\"\">  \t  Today I’m free as a bird and my heart feels so light I want to sing sometimes. But that was not always the case. I’m going to give you the answers you have been searching for and make your journey fun.  </p>  <p style=\"\">  \t  I’ve spent 20 years trying to put all the pieces together with spirituality and I’m going to make your job a lot easier by giving you’re the best tools and techniques I’ve found while learning from the best teachers on the planet.  </p>  <p style=\"\">  \t  And the number 1 secret I got is this… That you have to go into the pain and hurt, not push it away, then that metamorphoses into more of the greatness we really are. Which in the end is what we are searching for is more of us, the search is in our hearts, not out there. You are what you have been searching for.  </p>  <p style=\"\">  \t  I can say that I’m living a very meaningful life with almost no burdens, and I feel the happiest I ever have been in my life and I’m sharing all the secrets how right here.  </p>  <p style=\"\">  \t  So here is what you are going to learn in this ground breaking course. A lot of these techniques you will not find online freely and are the cream of the crop in what I’ve discovered over the many years. So enjoy.  </p>  <p style=\"\">  \t<strong style=\"\">  #01 Your Hero&#039;s Journey Begins, Now!  </strong>  </p>  <p style=\"\">  \t  Here we unlock what is your underlying ultimate life journey and how to live it and become your own hero in your own journey.  </p>  <p style=\"\">  \t<strong style=\"\">  #02 Oneness 101  </strong>  </p>  <p style=\"\">  \t  Now, here we pull back the curtains and take a deep look inside to uncover what really is oneness and what it is not that many people have wrong.  </p>  <p style=\"\">  \t<strong style=\"\">  #03 How Does Duality Fit into Oneness?  </strong>  </p>  <p style=\"\">  \t  It&#039;s funny that we live our whole life in duality, which makes it a hard game to stop playing. This teaches us how to get transcend this way of thinking to the next level of oneness.  </p>  <p style=\"\">  \t<strong style=\"\">  #04 &quot;I&quot; Can Never Reach Enlightenment  </strong>  </p>  <p style=\"\">  \t  WHAT, you are thinking! Are you for real! &quot;I&quot; Can Never Reach Enlightenment. This is a great little trick that we reveal here.  </p>  <p style=\"\">  \t<strong style=\"\">  #05 The Quickest Way to Oneness &amp; Enlightenment  </strong>  </p>  <p style=\"\">  \t  If there was a magic wand and you wanted instant enlightenment, and the quickest way on the planet, then here it is.  </p>  <p style=\"\">  \t<strong style=\"\">  #06 How to Undo the Ego and its Games  </strong>  </p>  <p style=\"\">  \t  This goes into how our separation has let the ego on a rampage into guilt, fear, and shame and how this can be undone using this Formula.  </p>  <p style=\"\">  \t<strong style=\"\">  #07 Everyone is Thinking &amp; No-one is Living the Feeling  </strong>  </p>  <p style=\"\">  \t  In a nutshell, most of us are too logical and we use our minds a lot, so this is about how we can move from our minds thought to our hearts feelings, and feel all the goodness that life is offering us every moment.  </p>  <p style=\"\">  \t<strong style=\"\">  #08 How to Eliminate all Your Problems in 1 Sec  </strong>  </p>  <p style=\"\">  \t  How to eliminate all of your problems in 1 second flat with this simple technique. You will be amazed at this and it’s almost real magic.  </p>  <p style=\"\">  \t<strong style=\"\">  #09 Immense Pleasure = Immense Pain, Let me Explain  </strong>  </p>  <p style=\"\">  \t  Like going to the gym to lift some weights. We are propelled into love by the amount we are willing to deeply explore our darkness or shadow.  </p>  <p style=\"\">  \t   The way my course is different is that it is not boring, and delves straight into some amazing topics. And I live what I say. I’m a living breathing example of what I’m teaching you. And it’s amazing.  </p>  <p style=\"\">  \t  So you may want to learn how to develop your spirituality or be more spiritual, and reach an awakening and inspiration. Well this is the course for you.  </p>  <p style=\"\">  \t  I have had many mentors in my life and they include; Russell Brand, Neale Donald Walsch, Dr. Wayne Dyer, Gary Zukav, Shakti Gawain, Marianne Williamson, Louise L. Hay, Dr. Deepak Chopra, Eckhart Tolle, Dalai Lama, Andrew Weil, Caroline Myss, Gregg Braden, Bruce Lipton, Doreen Virtue, Esther Hicks, Bashar, Rhonda Byrne, Jack Canfield, Joe Vitale, Michael Bernard Beckwith, Tony Robbins, Brian Tracy, Alan Watts, Ramana Maharshi, Ram Dass, Ken Wilber, and Gary Renard. Whheewww did you manage to take a breath.  </p>  <p style=\"\">  \t  Now you’re probably thinking, yeh! Does this really work. And how good it the content? And should I buy or not. Well I can tell you from experience that it’s the small decisions you make, like to buy this course right now, which can have a huge difference to where you’ll be in a week, a month and a year from now. I’m asking you to invest in your future so you can be free of burdens and really be living a grateful and meaningful life every day.  And attracting to you whatever you need to make it happen. And why not, because I have made this super affordable, so it’s a no brainer.  </p>  <p style=\"\">  \t  So I want you to take action and overcome any obstacles. I want to tell you about this 1 idea that changed everything. It was that whenever I become is because choices I have made in the past. And it’s up to me to make wise choices that propel me into my future self-quicker than I can imagine, and I hope you can consider this course, as I believe it can make a difference in your life.  </p>  <p style=\"\">  \t  Ok, that’s it for me, See you on the other side.  </p>", 
    "end_date": null, 
    "title": "More Spirituality and Oneness for a Blissful Awakening", 
    "price": "20.00", 
    "instructors": "Ivan Kramer", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406686_fb9f_3.jpg", 
    "course_url": "https://www.udemy.com/spirituality-oneness/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T14:30:53Z"
}