{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is for those who wish to discover more about the\ninner and spiritual teachings of Christianity as well as those who seek to make\nprogress on their spiritual journey.</p><p>\n\n</p><p style=\"\">For many centuries Christianity has recognized three primary\nstages of spiritual development which reach their pinnacle in mysticism. Yet\nmysticism remains a word that is little understood. The objective of this\ncourse is to provide an outline of what Christian mysticism is and the three\nprimary stages of development which precede this pinnacle of spiritual\nattainment.  </p><p style=\"\"><br></p><p style=\"\">As a primary steep towards this an examination is made of\nEvelyn Underhill’s talk ‘What is Mysticism?’ in which she introduces what the\nnature of mysticism is and what it is not.</p><p>\n\n</p><p style=\"\">This is followed by an overview of what the three stages of\nthe spiritual journey are. It speaks of there being two major conversion\nexperiences on this path; baptism and the Mystical New Birth. This section also\nintroduces a fourth (or what is really the first) stage of the journey, namely\nthat of the natural human state.</p><p>\n\n</p><p style=\"\">By way of example this section also describes spiritual\nexperiences had by Madame Guyon and Saint Catherine of Genoa. It also draws\nfrom what Saint Theresa of Avila and Saint Bernard of Clairveaux describe of\nthe state of Mystical Union or Unification.</p><p>\n\n</p><p style=\"\">If you feel that something is missing in your Christian\nlife, if there is something more to discover and experience, then this course\nis for you. It is for those who are asking questions and looking for answers.</p><p>\n\n</p><p style=\"\">This course is intended to provide an introduction to the\ndeeper teachings of Christian spirituality as well as a foundation which can be\nbuilt on.</p><p>\n\n</p>", 
    "end_date": null, 
    "title": "Mysticism: The Apex of Christian Spirituality.", 
    "price": "20.00", 
    "instructors": "Janet Gentles", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736188_a3eb_3.jpg", 
    "course_url": "https://www.udemy.com/mysticism-the-apex-of-christian-spirituality/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T00:04:59Z"
}