{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      In this course you will learn about the philosophy of religion, which is a branch of philosophy (not theology) that focuses on using rational understand to comprehend various religious phenomenons and beliefs.  </p>  <p style=\"\">  \t      In the course I focus on some philosopher&#039;s views on the evolution of religion from ancient times to the present. I present the rationalizations and proofs of God as well as reasons not to believe in God.  </p>  <p style=\"\">  \t      The course is 100% objective. At times I offer my own opinions, but I always try to give both sides of arguments by philosophers on both sides of the issues I present.  </p>  <p style=\"\">  \t      Additionally, <strong style=\"\">I NEVER single out any religion or ANY group of people</strong>. My goal for the course was to be as objective as possible, and let you decide on your eventual beliefs. I just introduce you to philosophy of religion approximately as it would be taught in an undergraduate philosophy of religion course.  </p>  <p style=\"\">  \t<strong style=\"\">You Will Get Introduced To New Ideas And Perspectives</strong>  </p>  <p style=\"\">  \t      Religion is as prevalent and widespread in the world today as it has ever been. I feel that you will find the course enlightening and thought provoking. I welcome and encourage you to take the course. It will give you a number of perspectives and arguments from which to view spirituality and religion in a new light.  </p>  <p style=\"\">  \t<strong style=\"\">No Risk To Take The Course</strong>  </p>  <p style=\"\">  \t      Every course on Udemy comes with a 30-day money back guarantee. So there is no risk to take the course. If you find that you don&#039;t like the course, just get your money back. But I am confident that you will find the course interesting!  </p>", 
    "end_date": null, 
    "title": "Philosophy of religion: spirituality despite politics", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424998_bd9c.jpg", 
    "course_url": "https://www.udemy.com/philosophy-of-religion-spirituality/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T15:31:55Z"
}