{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course helps you find your natural intuitive ability and teaches you how to growth this gift. This course covers the principles, knowledge and history needed to develop your intuition. The course includes personal experiences from the instructor herself as examples on how spirit and psychic communication works. </p><p><strong>Psychic Mediumship Development </strong>can be beneficial to anyone interested in this topic or someone who already has experience in this field. This is a great beginner class that covers the history of Spiritualism to topics that include information that even a practicing psychic medium can learn from. This course is unique because the instructor herself is a practicing psychic medium and learned to develop her own gifts as a psychic medium. The course was formulated and created based on her own personal development and journey.</p><p>This course is designed to teach the student the basic fundamentals of psychic mediumship. Topics that are covered include:<br></p><ul><li>Psychic Mediumship development</li><li>History of Spiritualism</li><li>Divination Tools</li><li>Dream Interpretation</li><li>The Psychic \"Clairs\"</li><li>Spirit Guides</li><li>Discernment</li><li>The Dangers of Psychic Mediumship</li><li>Symbols</li></ul><p>At the end of this course you will have the knowledge to develop your own skill set as a psychic medium, understand how to use your psychic senses, grow a relationship with your spirit guides, and be able to master your own style of psychic mediumship using the information learned from this course.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Psychic Mediumship Development", 
    "price": "20.00", 
    "instructors": "Melanie Rimkus", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749482_630f_2.jpg", 
    "course_url": "https://www.udemy.com/psychic-mediumship-development/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T23:41:50Z"
}