{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Psychic Power : Psychic Power- Develop Your Telepathic Skills' By Pradeep Aggarwal , you will learn -</p><p>Telepathy is one of the most beautiful Psychic Powers. Telepathy is made of two words – Tele and Pathy where Tele means Distance and Pathy means feelings. Telepathy can be stated as direct communication between minds.</p><p>This course is designed to help people who want to enhance their psychic powers and develop Telepathic Skills. In this lesson, you will learn the most common example of telepathy and about telepathy.</p><p>This course is ideal for everyone who want to increase and improve their telepathic skills ,psychic powers , gut feeling , intuitions and sixth sense using very powerful self hypnosis techniques and psychic exercises. It is also very useful for magicians , tarot card readers, hypnotists , healers etc for fun , fame and profit</p><p>By the end of the course you will be more psychic, telepathic and intuitive than before and achieve more success in your life by trusting your intuitions.</p><p>Also learn the myths about self hypnosis and how to use your conscious and subconscious mind more effectively.</p><p>This course contains a lot of telepathic exercises and more than 35 minutes of live video content designed 8 lectures , Bonus audio file and E-book on positive affirmations..</p>", 
    "end_date": null, 
    "title": "Psychic Power- Develop Your Telepathic Skills ", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/602204_2269.jpg", 
    "course_url": "https://www.udemy.com/psychic-power-develop-your-telepathic-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-04T06:26:31Z"
}