{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Psychic Powers –Learn Astral Projection Now' By Pradeep Aggarwal , you will learn -</p><ul><li><strong>What is Astral Projection?</strong> In this lesson, you will learn what is astral projection? Astral Projection means to out-of-body-experience (OBE) during which the astral body leaves the physical body and travels to the astral plane. <strong></strong></li> <li><strong>What is Mental Projection?</strong></li> <li><strong>Difference between Astral Projection and Mental Projection: </strong>In this lesson you will understand the difference between Astral Projection and Mental Projection.<strong></strong></li> <li><strong>About Conscious Mind, Subconscious Mind and Super-Conscious Mind: </strong>Learn what is conscious mind, subconscious mind and super-conscious mind and how they function.<strong></strong></li></ul><p> <strong>Myths About Hypnosis: </strong>Get rid of all your myths concerning about hypnosis.<br></p><p>It is ideal for people who are into spirituality, hypnotism , tarot card reading, healers , magicians and astrologers.</p><p>By the end of the course you will be more psychic and be able to create experience out of body astral projection and gain answers to many questions regarding your life and experiences.</p><p>You will also learn more about conscious and sub conscious mind and instant relaxation and self hypnosis.</p><p>This course contains a lot of psychic exercises and more than 35 minutes of live video content designed over 8 lectures in English including bonus e-books.</p>", 
    "end_date": null, 
    "title": "Psychic Power- Learn Astral Projection Now ", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613634_cb5b.jpg", 
    "course_url": "https://www.udemy.com/psychic-power-learn-astral-projection-now/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T11:26:57Z"
}