{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Psychic Power : Exercises To Develop Your Senses' By Pradeep Aggarwal , you will learn -</p><p>This course is designed to help you develop your senses (first five senses and the sixth sense) to enhance your intuition skills. We need to sharpen our first five senses to activate our sixth sense.<br></p><p>You will also learn to be more psychic and intuitive and be able to trust your intuitions and sixth sense much better than before.</p><p>This course is ideal for everyone who want to increase and improve their psychic powers , gut feeling , intuitions and sixth sense using very powerful self hypnosis techniques and psychic exercises to understand complex situations in life better and improve your risk taking abilities.</p><p>By the end of the course you will be more psychic and intuitive than before and achieve more success in your life by trusting your intuitions. </p><p>You will be able to develop and improve your sense of seeing, hearing, smelling , tasting and feeling.</p><p>Also you will learn how to relax instantly using powerful techniques of deep relaxation and meditation.</p><p>This course contains a lot of psychic exercises and more than 35 minutes of live video content designed over 10 lectures in English including a bonus e-book.</p>", 
    "end_date": null, 
    "title": "Psychic Power- Exercises To Develop Your Senses ", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607884_d345.jpg", 
    "course_url": "https://www.udemy.com/psychic-power-exercises-to-develop-your-senses/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T11:12:25Z"
}