{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t     Don&#039;t have a lot of time but want to learn tarot?  </p>  <p>  \t     Feeling insecure about what you already know?  </p>  <hr style=\"\">  <p>  \t     Quick and Easy Tarot Lessons specifically organized to help BEGINNERS gain accurate readings.  </p>  <hr style=\"\">  <p>  \t <em style=\"\">A</em><em style=\"\"> to Z tarot description and instructions.</em><strong style=\"\"></strong>  </p>  <p>  \t     The best FAST online tarot class out there!  </p>  <p>  \t     Join over <strong style=\"\">140</strong> Students!  </p>  <p>  \t     Price will go up by February 30, 2015. Sign up now!  </p>  <p>  \t <em style=\"\">Latest Update:</em> February 4, 2015  </p>  <hr style=\"\">  <p>  \t     Walk away with:  </p>  <ul style=\"\">  \t<li>Confidence </li>  \t<li>Accurate Readings </li>  \t<li>Make cash Online</li>  \t<li>Make cash online with your new skill.</li>  \t<li>Have unlimited Access to videos and downloadable files.</li>  \t<li>Speak to the instructor for questions ANYTIME.  </li>  </ul>  <hr style=\"\">  <p>  \t     You will get:  </p>  <ul style=\"\">  \t<li><strong style=\"\">Unlimited Access </strong>to      videos and downloadable files.</li>  \t<li>Instructor guidance for questions ANYTIME. </li>  \t<li>Vivid Video and high quality audio.</li>  \t<li>Discussion board and talk to other students.</li>  </ul>  <hr style=\"\">  <ul style=\"\">  </ul>  <hr style=\"\">  <p>  \t     Hello,  </p>  <p>  \t     I am Jessica Brown, your instructor.  </p>  <p>  \t     I have over 2 years as a Spiritual Counselor and 10 years’ experience as a successful Psychic and Tarot Reader.  </p>  <p>  \t     The beginning of my learning experience with tarot reading started by studying several different books, through trial and error doing actual tarot readings face to face my first 2 years and surrounding myself with other psychics. It was a slow process for me and most of the books I read were very hard to understand and sometimes 300 to 700 pages long.  </p>  <p>  \t     I made this course so that you do not have to go through the pains I did trying to learn how to be a successful tarot reader.  </p>  <p>  \t     This course will show you step by step instructions where it makes perfect sense and you can use what you have learn by the end this course for personal use, helping others and/or to make real money online.  </p>  <p>  \t     Disclaimer  </p>  <p>  \t     The information contained in this website is for general information purposes only. The information is provided by Spiritual Success Haven and while we endeavor to keep the information up to date and correct, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, suitability or availability with respect to the website or the information, products, services, or related graphics contained on the website for any purpose. Any reliance you place on such information is therefore strictly at your own risk. In no event will we be liable for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss or damage whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website. Through this website you are able to link to other websites which are not under the control of Spiritual Success Haven. We have no control over the nature, content and availability of those sites. The inclusion of any links does not necessarily imply a recommendation or endorse the views expressed within them. Every effort is made to keep the website up and running smoothly. However, Spiritual Success Haven, takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.  </p>  <p>  \t     Spiritual Success Haven and its owner do not guarantee everyone will make a profit after taking this course.  </p>  <hr style=\"\">", 
    "end_date": null, 
    "title": "Quick and Easy Tarot Lesson", 
    "price": "20.00", 
    "instructors": "Jessica Brown", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/142390_147b_5.jpg", 
    "course_url": "https://www.udemy.com/tarot-meanings/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-05T19:25:14Z"
}