{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Reclaim your healing abilities and psychic gifts with Past-Life Regression.</strong> </p><p>Discover which lifetimes have caused you to experience serious blockages in your Soul Journey and easily heal these lifetimes and release all blockages to your intuitive and healing powers with this gentle and powerful past life therapy. </p><p>Through accessing the Akashic records with this powerful past-life \ntherapy you can release all vows, karmic contracts and bindings to free \nyourself from all past-life trauma and reclaim your ancient healing and \nintuitive gifts to make your world and the entire world a better place.</p><p><strong>This course is perfect for anyone who wants to use their intuition to heal their own lives or to help others but feels nervous, afraid or blocked about tapping into their psychic and healing powers. </strong></p><p>This course will also benefit tarot card readers, astrologers, palm readers, Reiki practitioners, Angel Intuitives, massage therapists or anyone who wishes to earn income being  healer or psychic but experiences constant interference, blockages or anxiety. </p><p>Enrol now to heal your soul journey and rapidly improve your psychic powers and healing abilities. </p><p><strong>Updated: January, 2016</strong><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Remove Blocks to Psychic Power with Past Life Therapy", 
    "price": "20.00", 
    "instructors": "Sal Jade", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634278_cec6_5.jpg", 
    "course_url": "https://www.udemy.com/pastliferegressionforpsychicdevelopment/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T01:47:49Z"
}