{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course provides a deep-dive into elements of the Garden of Eden story, a story that has had a profound influence on our culture. The foundational stories we tell remain the same; how we understand those stories changes over the course of our lives. Learning a new way to understand this foundational story provides new possibilities for our future. </p>\n\n<p><strong>Gain insights into who you are and into the unfolding of human life</strong>. </p>\n\n<p>·       At the end of this course, students will be able to find their way back to the Garden of Eden and eat from the Tree of Life. Okay, that's hyperbole, but it's closer to the truth than anything else I could think of in describing this course.</p>\n\n<p>·       Stories about origins are also stories that attempt to tell us something about where we are going. This course provides insights into how the Bible understands who we are and where we are going.</p>\n\n<p>·       Regardless of your religious beliefs or perspective, these insights into human life are both profound and exciting.</p>\n\n<p><strong>Learn seven secrets that are embedded within the first three chapters of the Bible. </strong></p>\n\n<p>Anyone interested in gaining new insights into the foundations of our culture should take this course. ###b/b###Atheists and religious fundamentalists alike will be enriched by this course without having their core commitments challenged.</p>\n\n\n\n<p>If you are NOT open to new Biblical interpretations you should not take this course.</p>\n\n\n\n<p>If you have been influenced or intrigued by both Western and Eastern religious thought, this course might help provide a bridge between those two worlds. And if you have a clear preference for either Eastern or Western thought, you will also enjoy what this course offers.</p>\n\n\n\n<p>I guarantee that there will be something new for <u>every</u> student, no matter how familiar you are with this material. If every perspective and insight offered in this course is familiar to you, I encourage you to request a course refund. </p>\n\n\n\n<p><strong>Contents and Overview</strong></p>\n\n\n\n<p>This course consists of X NUMBER lectures. The seven secrets are revealed one at a time through a close examination of the Biblical text. </p>\n\n\n\n<p>The course is designed to speak to the novice and the expert, to Christians, Jews, Muslims, Buddhists, Hindus, atheists, agnostics, whomever. </p>\n\n\n\n<p>The texts under examination will be provided on screen. No additional materials are necessary. </p>\n\n\n\n<p>At the end of the course your understanding of, and appreciation for, the Bible’s creation story will be transformed. <br></p><p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Seven Surprises of the Bible's Creation Story", 
    "price": "20.00", 
    "instructors": "Dan Ehrenkrantz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/775086_9c78_2.jpg", 
    "course_url": "https://www.udemy.com/seven-secrets-of-the-bibles-creation-story/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-26T13:48:21Z"
}