{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\">\"Simply Amazing\" latest review from Velia (June 2016)</em></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Your spiritual growth and  transformational healing  begins here. Today, you are invited to explore and experience a unique deeply spiritual journey.</strong> You are personally invited to learn, to be initiated into the <strong class=\"redactor-inline-converted\">Nine Rites </strong>of Munay Ki engaging in the quest for deeper, broader vision of who you truly are. The Munay Ki rites are intended to help you to become a person of wisdom in your lifetime.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Your guide Sharon Ramel is here with you to initiate you into the Nine Rites of the Munay Ki</strong>. Theses are spiritually based practices or initiations from the  shamans of the Andes and the Amazon. <em>This course has an active discussion board and I answer every question personally. I work tirelessly to keep this course vivid and alive for you all.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Explore</strong> and learn transmissions that are gifted as spiritually engaged energetic seeds that when nurtured, quicken the path to your spiritual growth, development and enlightenment. The seeds of these rites can grow within anyone. This is our human birthright and path. <strong class=\"redactor-inline-converted\">Spirituality is a living breathing dynamic force.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                           The course is presented in a fluid series of video lectures, meditations both still and movement orientated, <strong class=\"redactor-inline-converted\">guided video attunements, </strong>notes and an extensive course guide book to assist your journey. This course has been thoroughly tested to ensure you will be able to received the Rites as they unfold. They have a natural order. You have the option of going as fast or as slow as you wish. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Spirituality is a core human need</strong>. Spiritual explorers receive a calling, something that speaks to us deep inside. This course is part of your empowering journey.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li><strong class=\"redactor-inline-converted\">Healers Rite</strong> - healing can take place, awaken your spiritual healing power</li>  \t<li><strong class=\"redactor-inline-converted\">Bands of Power Rite</strong> - five energy belts are woven into your luminous energy field</li>  \t<li><strong class=\"redactor-inline-converted\">H</strong><strong class=\"redactor-inline-converted\">armony Rite</strong> - A transmission to bring alignment into the seven main Chakras</li>  \t<li><strong class=\"redactor-inline-converted\">Seers Rite</strong> - awaken your ability to perceive the invisible world of energy and Spirit.</li>  \t<li><strong class=\"redactor-inline-converted\">Daykeepers Rite</strong> - you begin to heal your inner feminine, step beyond fear, and practice peace.</li>  \t<li><strong class=\"redactor-inline-converted\">Wisdomkeepers Rite</strong> - heal your inner masculine, step outside of time, and taste infinity</li>  \t<li><strong class=\"redactor-inline-converted\">Earthkeepers Rite</strong> - connect with the archangels, guardians of our solar system</li>  \t<li><strong class=\"redactor-inline-converted\">Starkeepers Rite</strong> - helps your physical body to evolve, you become a guardian for the future generations</li>  \t<li><strong>Creators Rite</strong> - stewardship for all creation, you are the co-creator of your life.</li>  \t<li>Meditations offered that are derived specifically to facilitate this journey</li>  \t<li>Fire Ceremonies - a way to nurture your inner growth through the initiations.</li>  \t<li>Comprehensive notes gifted as a lasting reference for you.</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t            Life time access to the Course material, all fully downloadable for you to keep and return to at any time. This is self paced so no need to rush. If you require certification from me as you intend to work with the Rites or require in for you ongoing education then please do not hesitate to contact me.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I am often asked is this a religion?</strong> </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Religion and spirituality are two related yet distinct terms associated with faith. <em class=\"redactor-inline-converted\">Religion</em> denotes \"a set of beliefs concerning the cause, nature, and purpose of the universe, usually involving devotional and ritual observances and a moral code.\" In contrast, <em class=\"redactor-inline-converted\">spirituality</em> can be defined as \"the quality of being spiritual\". Based on these definitions, the major difference between religion and spirituality is one of <em class=\"redactor-inline-converted\">believing</em> versus <em class=\"redactor-inline-converted\">being</em>. Religion's focus is the content of one's belief and the outworking of that belief; spirituality's focus is the process of becoming more attuned to unworldly affairs. It's possible to be religious without being spiritual and spiritual without being religious.. Spirituality is more abstract than religion. Religion usually promotes a creed and has a defined code of ethics; it is tangible. Spirituality exists in the nebulous realm of the undefinable. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t            30 Day no questions asked money back guarantee.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t            Sharon Ramel has been a MunayKi teacher since 2009 having received the Rites herself mid 2008.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Welcome to the Religious and Spirituality Section of Personal Development at Udemy</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em class=\"redactor-inline-converted\">The material on this site is provided for educational purposes only,  and is not to be used for medical advice, diagnosis or treatment.</em>  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                           .  </p>", 
    "end_date": null, 
    "title": "Shamanic Initiation for Spiritual Awakening", 
    "price": "25.00", 
    "instructors": "Sharon Ramel", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/180806_112e_11.jpg", 
    "course_url": "https://www.udemy.com/munay-ki/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-12T04:57:16Z"
}