{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Spiritual Development with the Archangels</em></strong> <strong><em>Part 1</em></strong> has been carefully designed to give you a solid  foundation for spiritual growth. It has been written to ensure a confident and successful spiritual journey whatever your current level of experience.</p><p>I will share with you the vital components of successful spiritual development and show you how to clear your path of all of the barriers which block spiritual growth. </p><p>I believe that it is essential for you master the level you are on, wherever that might be. When you have mastered your level, you are confident and solid in your understanding and knowledge and your self-confidence and inner knowing, allow you to go from strength to strength and succeed in whatever you do.</p><p><strong><em>Spiritual Development with the Archangels Part 1</em></strong> will quickly and easily see you progress into your own spiritual potential. </p><p>In Spiritual Development with the Archangels you will :</p><ul><li><strong>Become fully prepared for your successful Spiritual Journey<br></strong></li><li><strong>Clear any blocks or barriers to your Spiritual Development<br></strong></li><li><strong>Learn how to strengthen and sharpen your clairvoyance<br></strong></li><li><strong>Discover your Life Purpose definition and how to live it<br></strong></li><li><strong>Develop the ability to manifest your desires with speed and accuracy<br></strong></li></ul><p><br></p><p>Spiritual Development with the Archangels Part 1 is highly recommended whatever your current level of Spiritual Development. </p><p>I can't wait welcome you &lt;3</p><p>With love and happiness always,</p><p>Ros xxx</p><p><br></p><p><strong>What are students saying about my Udemy courses?</strong></p><p><strong>\" <em>This course is amazing! ......... I will definitely go through this material again and again!! Love it!! \"  Katherine Merritt <br></em></strong></p><p><strong><em>\" The course will give you more than you could possibly imagine. Go for it! \" Donna Palmer<br></em></strong></p><p><strong><em>\" I couldn't be happier about taking this course!!  This material is genuine and has my highest recommendation!</em><em> \" Jamie Briggs</em></strong></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Spiritual Development with the Archangels Part 1", 
    "price": "50.00", 
    "instructors": "Ros Place", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/734134_7d4f_3.jpg", 
    "course_url": "https://www.udemy.com/spiritual-development-with-the-archangels-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T14:19:09Z"
}