{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The Spiritual Awakening Mastery Course is designed to take you step-by-step through your spiritual awakening process.</p>  <p>If you are experiencing a spiritual awakening, you know it can be challenging. In this course you will learn how to move through difficulties with ease. If you have an awareness of what is going on, then you have the ability to change your circumstances into what you are wanting.</p>  <p>This course has 8 modules and over 3.5 hours of instruction. In this course you will learn:</p>  <ul><li>Why you are awakening</li><li>Stages of a spiritual awakening</li><li>Symptoms of an awakening and how to heal</li><li>Your spiritual gifts</li><li>Handling practical matters</li><li>Divine relationships</li><li>Living your mission</li><li>Manifest with Ease</li></ul>                <p>This course will teach you to live your truth and follow your heart. You are discovering yourself on a deep inner level and are transforming out of old patterning and beliefs.</p>  <p>Loving yourself is an important part of the spiritual awakening journey. You will learn through this course how to love you and treat yourself gently and with care always. Be everything that you are and love yourself deeply. </p>  <p>Allow yourself to play and be in a state of wonder and excitement every day, that is what this spiritual journey is taking you into. </p>  <p>You must take this course if you are experiencing a spiritual awakening and need guidance on how you can get through it while being happy, centered, and empowered.</p>", 
    "end_date": null, 
    "title": "Spiritual Awakening Mastery Course", 
    "price": "20.00", 
    "instructors": "Angelica King", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689776_2dc9.jpg", 
    "course_url": "https://www.udemy.com/spiritual-awakening-mastery-course/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-05T19:09:09Z"
}