{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    When you go through Spiritual Warfare, though it’s hard to tell the difference between ordinary battle and spiritual battle, there is a difference between honest conflict and spiritual attacks. This course will teach you how to fight and win spiritual battles. There is an effective and ineffective way to fight spiritual battles. There is a way to fight that brings victory and there is a way to fight just to keep fighting but with no results. The death of the Lord Jesus Christ on the cross of Calvary - the shedding of His precious blood - has enabled you to overcome the World. For what is in you when you believe and receive this truth, is far greater than what is in the World.  </p>  <p style=\"\">  \t    When you go through this 7-section Spiritual Warfare e-Course in faith, and however little faith you may have, God will give you victory. This e-Course is for Christians and non-Christians alike; especially those with chronic challenges. It&#039;s also meant for those who are living with problems that seem to never go away! These people have tried all other methods like counseling and even medical help to find a solution to no avail. This Spiritual Warfare e-Course comes in videos and text format and will take you approximately about two hours to complete. The key truth in understanding spiritual battles is that you are a created spirit in God&#039;s image. You are therefore a spirit in a physical body with a soul. Your soul is the battleground. It comprises your mind for thinking, your emotions for feeling, and your will for deciding.  </p>  <p style=\"\">  \t    You&#039;ll learn several truths in Spiritual Warfare. First, you&#039;ll be empowered to spot spiritual battles. Second, you&#039;ll understand how spiritual forces work. Third, you learn to prepare for spiritual battles by putting on the 7-piece armor of God. Fourth, you learn that the fighting proper is what you believe and declare in the face of any attack, and what attitudes and actions you adopt to guarantee victory. Fifth, to win spiritual battles all the time, you&#039;ll understand clearly that Satan&#039;s intention toward you is to steal, kill, and destroy; but the intention of the Lord and Savior Jesus Christ toward you is that you may have life and have it more abundantly. Sixth, you&#039;ll learn to overcome Satan the Devil by the blood of the Lord Jesus Christ, by the word of your testimony, and by your lifestyle of reliance on the grace of God! And seventh, you&#039;ll learn to have everlasting life by believing that the Lord Jesus Christ is the son of the living God Almighty; and that He gave up His life and shed all His blood to save you and translate you from the kingdom of darkness to the kingdom of light!  </p>", 
    "end_date": null, 
    "title": "Spiritual Warfare", 
    "price": "20.00", 
    "instructors": "jackie ngomesia", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/345196_6131_3.jpg", 
    "course_url": "https://www.udemy.com/spiritual-warfare/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-15T13:53:26Z"
}