{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Spiritual Development with the Archangels</em></strong> <strong><em>Part 2 </em></strong></p><p>If you are a Spiritual Development with the Archangels Part 1 graduate, you will have mastered the principles of successful spiritual growth. You will have established a solid foundation and you will be ready to take your spiritual development to a more advanced level of mastery.</p><p>Spiritual Development with the Archangels Part 2 will build on your solid foundation and ensure that the next stage of your spiritual journey takes you deeply into experiencing your full spiritual potential.</p><p>I am excited to share with you all of the advanced spiritual development tools the Angels have given to me in my lifetime. I am thrilled to offer you, the powerful spiritual growth and mastery you desire.</p><p><strong><em>Spiritual Development with the Archangels Part 2</em></strong> will quickly and easily see you progress into your deeper and more advanced spiritual potential.</p><p><strong><em>In Spiritual Development with the Archangels Part 2 you will:</em></strong></p><ul><li><strong>Learn what you can do to succeed spiritually AND personally</strong><strong></strong></li><li><strong>Define success and infinitely attract it</strong></li><li><strong>Activate your full manifesting ability</strong></li><li><strong>Succeed in advancing your spiritual growth </strong></li><li><strong>Deepen your spiritual connection and awareness</strong></li><li><strong>Advance powerfully into the next spiritual level </strong></li></ul><p>Spiritual Development with the Archangels Part 2 is highly recommended for those who have completed Spiritual Development with the Archangels Part 1.</p><p>I LOVE this course and I can't wait welcome you &lt;3</p><p>With love and happiness always,</p><p>Ros xxx</p><p><strong>What are students saying about my Udemy courses?</strong></p><ul><li><strong>No woo woo or weird stuff!</strong> This is by far the best course I've ever done in regards to working with the Archangels. The biggest reason is because Ros has such a wonderful down to earth way about her that you just get that feeling like she's talking directly just to you and she's been your friend for a long time. There's no weird stuff, or woo woo.... it's just simple loving teaching about the archangels and I can't tell you how much this has opened me up inside to have that excitement when I ask the Archangels to help me with certain situations. It's full of fun and you learn so much about your intuition at the same time. The oracle card exercises are fab! by Katie</li><li><strong>magical!! </strong>During my first week I had a true catharsis, healing...did not expect that at all, I must say! Even though I have always known my Guardian Angel and was communicating with Him since my childhood, this course definitely gave me a lot! It is truly for everyone &lt;3Thank You so much Ros, thank You, Angels! &lt;3</li><li>by Bárbara Heliodora G. Rodrigues </li><li>· <strong>Overwhelming experience! </strong>The course was exciting from the begining to the end. I could learn how to connect with my guardian angel, he showed me his aura colors, gave suggestions during the course, he even whispered guidance to find out what his name is, and before taking this course I didn't know anything about him.I really appreciate the classes Ros put here to guide us in discovering about our guardian angel. She comments and answers our doubts and posts. The content is clear and helps you climb up one step at a time towards a better relationship with the angels. I do recommend all people to take this course.Thanks Ros!</li><li>by Izzy MacLean,</li><li>· <strong>A beautiful journey of connection </strong>This is a beautiful course,taught by an equally beautiful earth angel. Its very well structured, the print out worksheets are perfectly laid out and are a joy to do.Ros not only guides you step by step so gently but she also oozes kindness,understanding,patience and some heartfelt guidance in the videos and the angelic meditations. This course is worth every penny and is a sheer delight from start to finish. Thank you Ros xx</li><li>by Emma· I've found the course to be extremely helpful! I think the meditations are wonderful and really help me relax, Since starting the course a few things I've dreamt about have actually happened! The course has really helped my confidence , Thanks Ros@) </li><li><strong>Amazing Clarity</strong></li><li><strong></strong>My daughters and I took this course as a family and it has played a special role in the development of our awareness and connection to all 3 of our guardian angels as well as the evolving of all of our clair-senses.Ros teaches beautifully and engages her audience with her visualizations and meditations that more than meets but exceeds expectations. You feel the personal touch and attention she gives to you almost instantly by the way she accurately communicates the energy of the Angels. I will continually go back to this vital course in spiritual development to enhance my own connection to my Guardian Angel and beloved lifelong friend, Daphne! Thank you Ros for sharing this course with us, with deep appreciation, we love you! &lt;3 &lt;3 &lt;3All my Love and Respect,Faith</li></ul>", 
    "end_date": null, 
    "title": "Spiritual Development with the Archangels Part 2", 
    "price": "50.00", 
    "instructors": "Ros Place", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/740954_6551.jpg", 
    "course_url": "https://www.udemy.com/spiritual-development-with-the-archangels-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T12:24:22Z"
}