{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you seeking to greater understand the Divine Source?  Know that you have direct access to the wellspring of all Wisdom, Love and Truth.  Everything is connected.  This course will help you build a firm foundation to better understand our Divine nature.  <br></p><p><strong>Build your Spiritual Toolkit</strong></p><p>Understand how God works through Universal Law</p><p>Learn the Similarities in World Religions</p><p>Discover your Connection to the Divine Source<br></p><p>Use the 12 Step Process to Spiritual Unfoldment</p><p>Build a Foundation for Spiritual Growth</p><p>You will learn how metaphysics teaches us we each have a connection to Divine Intelligence.  You can practice Effectual Prayer, and learn how you receive guidance.  No one is closer to God than you, you need no intermediary between you and the Divine.<br></p><p><strong>Course Overview</strong></p><p>In this course you will learn the difference between Spirituality, and Religion, and how you can unfold within yourself a powerful spirituality that will enrich your understanding of the Cosmos, and your place in it.  You will learn about God, and how God works through natural laws that can be understood so that you can manifest a better reality for yourself.  You will be able to use the 12 Step Process of Spiritual Unfoldment to guide you on your future development and understanding.</p><p>At the end of the course you will be empowered to continue on a path that will bring you a deeper understanding of the world, and our place in it.</p>", 
    "end_date": null, 
    "title": "Spiritual Unfoldment: Working with the Divine ", 
    "price": "40.00", 
    "instructors": "Justin Terry", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617402_5094.jpg", 
    "course_url": "https://www.udemy.com/justin-terry-spiritual-unfoldment/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T17:49:47Z"
}