{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>  Start Your Traveling Ministry</strong> is a powerful course that will teach you the nuts and bolts to getting started effectively in the traveling ministry! It will help you quickly get launched into full-time ministry as an itinerant minister. The 12 lessons will cover everything in detail from how to schedule meetings, how to find churches to minister in, how to arrange your own profitable book table, to gathering monthly financial partners. This is a one of a kind course from someone with over 30 years of successful full-time ministry experience.</p><p>The <strong>TRAVELING MINISTRY</strong> course will teach students the practical keys to getting successfully launched into a growing traveling ministry.</p><p>Students will learn how the practical parts of the traveling ministry are set up and arranged and even strategized for effective outreach and impact in a churches and nations! </p><p>Lessons:<em>• Setting Up Your Ministry• YouTube Strategies• Marketing and Advertising Your Ministry</em></p><p><em>• Answer Questions Like, \"Isn't It All Just Spiritual? Won't God Just Do It All By Himself?\"</em></p><p><em>• Why Plan?</em></p><p><em>• Extended Meetings vs. One Day Services</em></p><p><em><em>• Booktable Ministry and Product </em></em></p><p><em><em>• Non-Profit Status</em></em></p><p><em><em>• How Will Churches Hear of My Ministry?</em></em></p><p><em><em>• Proper Ministerial Etiquette </em></em></p><p>About this course: </p><ul><li><em>Thousands of happy students</em></li><li><em>Comes with workbook and extra ebook </em></li><li><em>Multiple instructors that will bring great revelation of the word of God!</em></li><li><em>Full, free lifetime access</em></li><li><em>The bible training you need to make it in ministry</em></li></ul><ul><li>We have over 30 years of full time ministry training</li><li>No bible school out there will train you with practical training like MTI</li><li>Comes with free consulting for bible training</li><li>We have organizations that we refer students who have graduated MTI to get both licensed and ordained</li><li>You can go through all of the MTI classes as quickly as your schedule allows and then allowing you in an accelerated time to get launched into your ministry!</li></ul><p>Ministry Training Institute is a video school that gives you all the practical and revelation knowledge that is needed for you to get started in full time ministry or just getting to know the Lord Jesus in a greater light. </p><ul><li>This course has <strong>over 200 students globally</strong>! </li></ul><ul><li>This course has been <strong>UPDATED with new lectures on October 8</strong></li></ul>", 
    "end_date": null, 
    "title": "Start Your Traveling Ministry - Itinerant and Evangelistic", 
    "price": "30.00", 
    "instructors": "Tom Scarrella", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430396_226f.jpg", 
    "course_url": "https://www.udemy.com/start-your-traveling-ministry/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T22:36:58Z"
}