{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Cindy McGill</strong> wants to equip you to share God's unconditional love everywhere you go. This training will transform your perspective and open your eyes to see that God's love knows no limits.</p><p>Peoples hearts are being sidetracked from their destiny. Cindy McGill has been given specific 'strategies' to help people see the hope and future that God has for them.</p><p>Each teaching includes an incredible on-site demonstration of personal encounters while at the <strong>Burning Man festival</strong>, an <strong>Adult Entertainment Expo</strong> and the <strong>Sundance Film Festival</strong>. </p><p>Cindy demonstrates how to use <strong>dream interpretation, non-religious language</strong> and<strong> prophetic insights</strong> to see their hearts cry and call them into their destiny.</p><p>This training is invaluable and will empower you with courage to lead your own outreach teams! </p><p><br></p><p>Cindy McGill is a keynote speaker on the subject of outreach and evangelism using prophecy and dream interpretation. Her passion is to raise up people who will take the message of Jesus into every culture with life-changing power, presence, and nonreligious language.</p><p>The author of <em>What Your Dreams Are Telling You: Unlocking Solutions While You Sleep</em>, she and her husband, Tim, have planted and pastored churches since 1979. Her work has been published in magazines and online media outlets such as <em>Elijah List</em>, <em>Charisma</em> magazine, TBN, and XP Media with Patricia King.</p><p>Cindy and Tim are currently working with Shawn Bolz and E58 ministries in L.A. to reach an emerging generation of creative people in Hollywood. </p>", 
    "end_date": null, 
    "title": "Strategies for Reaching the World - Christian Outreach", 
    "price": "30.00", 
    "instructors": "Cindy Mcgill", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613942_a7a4.jpg", 
    "course_url": "https://www.udemy.com/strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T17:34:50Z"
}