{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Discover how to give an accurate Tarot Reading to find the path to love, your perfect career and the best path to improve your income and investments by learning how to read tarot like a professional. </strong></p><p>By taking this tarot course you will learn to read like a professional tarot reader for personal use, or to give psychics readings to earn income. </p><p>You will also master how to give accurate psychic readings while discovering your own spiritual path to success. </p><p>By studying the tarot card meanings from this psychic development course, you can help others discover their destiny and make important decisions to improve their lives in a gentle and easy way. </p><p><strong>By the end of this course you will know how to: </strong></p><ul><li>Confidently give accurate psychic readings using these ancient divination cards</li><li>Use the tarot to improve your love life</li><li>Use the tarot to improve your business, career and finances</li><li>Discover the answer to quick questions and do more detailed readings for up to 1 hour</li><li>Identify what spiritual lessons you need to master to rapidly improve your life</li><li>Know how to consult the tarot to heal any challenge in your life</li></ul><p>This tarot course includes a full interpretation of Tarot Card Meanings including the Major and Minor Arcana, tarot card readings for General, Love and Business, dozens of sample readings to rapidly improve your understanding of the tarot, the different spreads to use for different purposes, the best techniques to get the most accurate psychic readings and how to psychically protect yourself while giving readings</p><p>You will have full access to <strong>private Facebook page</strong> where you can build up your confidence by practicing with other students from the course and the course will be updated regularly with the latest tips and techniques to enhance your psychic readings. </p><p><strong>So enroll now and change your destiny by learning to give tarot readings like a professional. </strong></p><p><strong>Updated January 2016</strong><br><strong></strong></p>", 
    "end_date": null, 
    "title": "Tarot Card Success - Tarot Reading", 
    "price": "30.00", 
    "instructors": "Sal Jade", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554014_2170_5.jpg", 
    "course_url": "https://www.udemy.com/tarot-card-meaningshow-to-read-tarot-like-an-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T04:01:37Z"
}