{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>By the end of this course you will feel fully confident reading the tarot – fast! Whether for pleasure or for profit.</p><p>Just imagine, one month from now you will be captivating your friends, revealing insights that will amaze them. You'll be developing your own self-reliance because you'll always have access to new perspectives, whenever you have a life-choice or a big decision to make.</p><p>And, yes, you can choose to make a home-base career reading the tarot, on-line or as personal consultations – working as much as you want, when you want. And it's a great way to make new online friends around the globe.</p><p><b>A fun way to learn</b></p><p>I believe there are two ways to learn new life-skills – the hard way and the fun way. This is the fun way, making it so easy to remember the meanings of the cards and their significance together. Traditional ways of training tarot reading are incredibly complex and confusing. Not my way.</p><p>And, remember, should you have any problems or queries, I'm always available to help and guide you. I love to help.</p><p><strong>Master the Meanings of the Tarot</strong></p><ul><li>Symbolism as a cultural construct.</li><li>The elements of the Tarot.</li><li>The story of the Fool's  Journey</li><li>The Major Arcana</li><li>The Minor Arcana</li><li>Card Spreads</li></ul><strong>Contents and Overview                                                                                                 </strong>The course contains 35 lectures and over 4.5 hours of content. It is aimed at anyone wanting to achieve a greater understanding of the tarot. There are downloadable memory joggers to help you remember the keywords for the cards and to use a tool to recall the cards. The course also includes a pdf images of all the cards so you will not require a deck of cards to progress through the course. This will give you your own images to look at if you do not own a deck of Rider-Waite tarot cards. With all this content you will be well on your way to establishing you own tarot reading business at the end of the course. You will receive bonus material and updates to the course as they become available. <p><strong>What are the requirements?</strong></p><ul><li>There are no prerequisites for this course.</li><li>An open mind and a willingness to learn will be required.</li></ul><strong>What am I going to get from this course?</strong><ul><li>30+ lectures and over 3 hours of content!</li><li>By the end of the course you will be able to do tarot cards readings for fun or profit.</li><li>You will be able to interpret symbolism in the tarot a well as in everyday life.</li><li>You will understand the Fool's Journey as metaphor or life.</li></ul><strong>Who is the target audience?</strong><ul><li>Beginners to the tarot</li><li>People who which to expand their knowledge of the tarot</li><li>People who which to understand the archetypes as represented by the tarot cards</li></ul>", 
    "end_date": null, 
    "title": "Tarot Reading – Read Tarot Cards for Fun or Profit", 
    "price": "25.00", 
    "instructors": "Sharon Smith", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516600_4206_3.jpg", 
    "course_url": "https://www.udemy.com/the-tarot-demystified-read-the-cards-for-fun-or-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T03:10:13Z"
}