{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is a <strong>power packed</strong> hand position and you will not only discover why but be given very <strong>practica</strong>l ways to utilise <strong>prayer position</strong>. <em>If you are on a spiritual path, this course is a precious gem</em>.</p><p>If you have ever attended a yoga class or a church or temple you will be familiar with the classic prayer position gesture of drawing your hands, <strong>palms together</strong> to your <strong>heart centre</strong>. At <strong>sacred</strong> gatherings Namaste, Amen, Shalom, Blessed Be are common closures used to complete at prayer, a ritual or any sacred intent to incorporate the experience into their lives.</p><p>However do you know the <strong>benefits</strong> of this classic position? Come with me and together we will explore the deeper possibilities of this powerful hand position or mudra. (Mudra means hand position in Sanskrit).  This is a course presented in two halves. The first half we shall investigate the chakras in our hands, there will be a number of easy to learn very practical, powerful exercises to feel into these centres and boost the energy within them. The second half focuses on using the increased power in your palm chakras to raise your vibrational level during a series of movement meditations.</p><p>Prayer position is a universal symbol from the priests in the churches to the Dalai Lama peering over his fingertips. It is a little something that is both <strong>simple</strong> and <strong>profound</strong> that we can use and take heart from, and find <strong>peace</strong> within.</p><p><em>What is you heart whispering? Pulling you towards? The power of prayer position will take you into a deeper level of practice. Enrol today.</em></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "The Spiritual Power of Prayer Position ", 
    "price": "20.00", 
    "instructors": "Sharon Ramel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/668526_0aed_6.jpg", 
    "course_url": "https://www.udemy.com/the-power-of-prayer-position/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T06:08:24Z"
}