{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>The Tao of Quantum Physics </em>course bridges the gap between Science and Spirituality and provides breakthrough ideas that will transform your experience of reality. It will take you on an extraordinary journey to reveal the Unity of it all as it challenges you to reconsider your most cherished beLIEfs about reality. </p><p><strong>Leap Beyond Your Perceived Limitations with this Mind Expanding, All-Levels Course.</strong></p><ul><li>Enhance your awareness and mental focus</li><li>Navigate expanded states of consciousness</li><li>Understand that YOU are the Ultimate Observer</li><li>Reach new potentials in thought and action as you unlock a gateway into profound forms of perception</li></ul><p><strong>The guides in </strong><strong><em>The Tao of Quantum Physics </em><strong>course share eye opening views of Science and Spirituality merging that will change your life forever.</strong></strong></p><p>This course is based on the international smash hit film, <em>The Tao of Quantum Physics. </em>By sharing wisdom, insights and personal stories from pioneering scientists, this course creates the opportunity for you to experience a great sense of peace, calm and balance. You'll learn about concepts within quantum physics, spirituality, and nonduality, with topics ranging from human consciousness, to the power of choice and perception, fields of possibility, and the Observer Effect. This incredible course features course material from pioneering scientists and consciousness experts such as:</p><ul><li><strong>Dr. Fred Alan Wolf</strong>: Theoretical physicist featured in the international smash hit film, <em>Leap! A Quantum Awakening.</em></li><li><strong>Dr. Joe Dispenza</strong>: Neuroscientist, chiropractor, <em>New York Times</em> best-selling author and expert on change, the brain, mind and human potential. </li><li><strong>Dr. Amit Goswami</strong>: Theoretical quantum physicist, author, and practitioner of spirituality and transformation.</li><li><strong>Peter Russell</strong>: Physicist and author featured in the international smash hit film, <em>Leap! A Quantum Awakening.</em></li><li><strong>Stuart Hameroff</strong>: Anesthesiologist and professor known for his studies of consciousness, featured in the international smash hit film, <em>Leap! A Quantum Awakening.</em></li><li><strong>William Arntz</strong>: Featured in the international smash hit film, <em>Leap! A Quantum Awakening, </em>and creator of the film <em>What The Bleep Do We Know!?</em></li><li><strong>iKE ALLEN:</strong> Internationally sought-after speaker, Founder of AVAIYA, A Leader in Conscious Media, &amp; Intuitive Archaeology, and creator of films and courses such as <em>Leap! A Quantum Awakening, A Course in Miracles The Movie</em>, and <em>The Gratitude Effect.</em></li></ul><p>    <strong>Contents and Overview</strong></p><p>This course contains 20 lectures and over 1 hour of video content from leaders in quantum physics and consciousness. It is designed for anyone with an interest in diving deeper into the nature of reality and experiencing a quantum leap in your personal Awakening.</p><p>This course is designed to be watched and listened to repeatedly. You can take the whole course and complete all the curriculum in one sitting, but we recommend you revisit the curriculum and let it wash over you again. Each time you view the materials in this course, you'll gain new insights and remove psychological blocks.</p><p>The course is broken up into sections and lectures. The sections cover broad topics within the course such as the nature of reality, oneness, perception, and time-space reality. The lectures are where you'll dive deeper into specific topics of the course. The lectures are primarily in high-definition video format, and occasionally include text format. At the end of each section, you'll have the opportunity to test your knowledge of the course material through multiple choice and true/false quizzes.</p><p>Through the video lectures in this course, you will learn from some of the most brilliant, enlightened minds in the fields of quantum physics, consciousness, and spirituality. By the end of this course, you'll have the opportunity to unleash the power of your true nature, and discover <em>Who You Really Are</em>. </p>Get ready to experience A Scientific Revolution in Enlightenment!", 
    "end_date": null, 
    "title": "The Tao of Quantum Physics: A Quantum Leap in Your Awakening", 
    "price": "25.00", 
    "instructors": "iKE ALLEN", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499008_0f41.jpg", 
    "course_url": "https://www.udemy.com/the-tao-of-quantum-physics-a-quantum-leap-in-your-awakening/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T14:43:43Z"
}