{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Spiritual fulfillment is one of the primary tools that\nhelps us on our journey to wisdom. Our ancestors knew this. And they have given\nus a way to make this change—the power of witchcraft.\nBut do witches exist? They absolutely do. Through the information in this course,\nyou’ll find out what and who witches really are. You’ll also enhance your own\nspirituality and will grow and become empowered through the wisdom of the craft.</p><p>This course introduces you to the beliefs and moral code of Wicca. We\nalso discuss the history of witchcraft and its growing popularity in the present day.</p><p><strong></strong>This course takes an in-depth look at Wiccan beliefs. We also examine\nsome of the responsibilities of being a witch and introduce Wiccan ritual and\nsome basic magickal tools. </p><p>In this course you will learn how to prepare yourself\nfor ritual. You’ll also learn how and where to do ritual. </p><p>This course takes a closer look at ritual and celebrates the Wiccan\nholidays. You’ll also learn about magickal natural objects and entities. </p><p>This course shows you how to work with\nastrology and the calendar to enhance the affects of your magick. </p><p>This course is where you will learn all\nabout spells—how to write them and how to cast them. You’ll also learn about foretelling\nthe future and gain some new insight into your dreams.<br></p>", 
    "end_date": null, 
    "title": "Wicca and Witchcraft for beginners", 
    "price": "20.00", 
    "instructors": "Gilad James", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749306_ae40.jpg", 
    "course_url": "https://www.udemy.com/wicca-and-witchcraft-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T20:15:05Z"
}