{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">WOW! – plugged Edition</strong></p><p>Ein Kurs für Fortgeschrittene zur 2-Punkte-Methode und darüber hinaus - Teil 1. </p><p>Plugged ist Englisch und heißt eingeklickt oder eingestöpselt. In Anspielung auf MTV Unplugged wo Musiker ohne Technik quasi ausgestöpselt Musik machen. In unserem Fall ist Plugged jedoch viel passender. Du wirst lernen in dir und im Feld eingeklickt zu sein. <strong style=\"\"></strong></p><p>In diesem Kurs erhältst du erweiterte Grundlagen zur 2-Punkte-Methode, die auch die spirituelle Dimension mit einschließt. Du erfährst, was bei der 2-Punkte Methode eigentlich passiert, was das Ganze mit deinem multidimensionalen Sein zu tun hat, warum das wie Fahrradfahren lernen ist und warum die 2-Punkte Methode letztendlich keine Technik ist, sondern eine Bewegung in deinem Energiebewusstsein. </p><p>Ich werde dir die Grundelemente vorstellen, die dich aus der Technik in ein WOW! Erlebnis bringen und wir werden uns in dem Kurs intensiv mit dem ersten Element beschäftigen. </p><p>Bei dir sein und Offenheit </p><p>Der beste Zugang dazu geht über deinen Körper und ich werde dir vier „Stellschauben“ vorstellen und dir auch Tipps geben wie du in sie leicht hineinkommst. </p><p>Diese sind.</p> <ul style=\"\"><li>„Im Körper sein“ und auch die Erklärung warum Gegenwärtigkeit so wichtig ist</li><li>Das innere Lächeln und das federleichte Herz</li><li>Die eigene Aufrichtung</li><li>„Open Focus“ oder „Wie du deine Verstandesbox einfach aufschließen kannst“ </li></ul> <p>Wir machen auch einen Crashkurs und drei weitere Anwendungen zusammen. Sollest du bisher mit dem Umkippen Probleme gehabt haben, dann gehe ich auch drauf ein. </p><p>Ich wünsche dir jedenfalls viel Spaß mit dem Kurs und viele WOW! Erlebnisse! </p><p>Ich freue mich auf dich! </p><strong style=\"\"><p></p></strong>", 
    "end_date": null, 
    "title": "WOW! -plugged Edition", 
    "price": "50.00", 
    "instructors": "Mircea Ighisan", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/511862_682a_3.jpg", 
    "course_url": "https://www.udemy.com/wow-plugged-edition/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T15:34:18Z"
}