{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t     There’s kind of a cliché among people who’ve studied and practiced with both Christianity and Buddhism. The Christians say learning Buddhism makes them better Christians, and Buddhists say the Christianity makes them better Buddhists. I have found this to be true from my own practice. This course is an opportunity to find out why, through examining how ideas from the great religious traditions converge and inform each other.  </p>  <p>  \t     Designed as a 4-week &quot;retreat in daily life&quot;, this course asks you to commit to a daily meditation practice and explore how the contemplative techniques can help you to find clarity, peace, healing, freedom, and new energy.  </p>  <p>  \t     In a series of five lectures we will examine:  </p>  <ul>  \t<li>Humanity’s basic goodness and the path to enlightenment</li>  \t<li>The causes of human suffering in attachment and thinking</li>  \t<li>How people commonly create unnecessary suffering</li>  \t<li>The value of being mindful of God’s presence</li>  \t<li>Jesus&#039; roles as healer and Zen teacher</li>  \t<li>The path from coping, to healing, to liberation</li>  \t<li>The emergence of an intrinsic discipleship</li>  </ul>  <p>  \t     After each lecture you will learn a new meditation technique that is found in Buddhist practice, but is connected with biblical teaching. These meditation techniques range from simple to complicated, but their true value is only discovered by experience and regular practice. They cover functions such as:  </p>  <ul>  \t<li>viewing your own thinking</li>  \t<li>identifying attachments and desires</li>  \t<li>disrupting disordered opinion</li>  \t<li>and experiencing love and compassion.</li>  </ul>  <p>  \t     A final component of the course is the opportunity to reflect on these ideas and discuss them with your fellow retreat participants. With each lecture there are some selected scripture readings for you to engage with and share your thoughts in the discussion forums. Similarly at the beginning of each new session you will have the chance to learn from the experiences of your fellow meditators as well as share your own.  </p>", 
    "end_date": null, 
    "title": "Zen Christian Meditation Retreat", 
    "price": "20.00", 
    "instructors": "James Burraston", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284112_33b8.jpg", 
    "course_url": "https://www.udemy.com/zen-christian-meditation-retreat/", 
    "currency": "USD", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-20T00:25:53Z"
}