{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> 我是怎样一步一步迈入我超自然的命定</p><p>我的名字叫 Joanna，我出生和生长在中国西南部一个美丽的城市--昆明。1990年财会专业毕业后一直从事会计工作。</p><p>   我的母亲在我很小的时候就信主受洗成为基督徒，她很爱神，记得那个时候没有圣经，后来她借到一本圣经，非常兴奋，她就手抄圣经，抄写了创世纪和约翰福音。我是在1997年一次参加家庭教会聚会时接受耶稣基督作我个人的救主成为一个基督徒。我信主后就非常火热的参与侍奉，几个月之后就成为小组长并带领家庭细胞小组。在2000年的时候神呼召我去到一个非常贫困的少数民族地区的小学，在那里我成为一名义务支教的老师。一年后回到昆明，很快进入到一个国际扶贫组织财务部工作，三年后开始了一项新的事工-临终关怀，主要是针对癌症病人的关怀。</p><p>我对神一直很追求，也希望自己与神的关系就像当年大卫与神之间的亲密关系。在2012年我去到以色列，就在加利利海边，神对我说：“把你的船开到水深之处”，但我不知道哪里是水深之处。但是就在二十多天以后我遇到一位多年没有见面的朋友，她和我分享了她生命的改变成长，神怎样奇妙供应她的所需，以及怎样一次又一次的遇见神。她告诉我那个时候她正在美国伯特利超自然事工学校读二年级，我问她我是否可以申请这个学校，她给了我申请这个学校的链接，第二天我就申请了这个学校，10天以后我拿到了录取通知书，同一天在我还没有开始办理美国签证的情况下我辞去了工作。2个月后，也就是2012年9月份我离开中国昆明来到美国伯特利超自然事工学校上一年级，虽然来之前我对伯特利学校并不太了解，但是我很清楚这是神的带领，也感觉到一些很好的事情将要发生。在伯特利学校的这三年，改变了我的生命，我更认识自己，自己的身份；也更认识神；更清楚神对我的呼召，更清楚我的命定；也相信在神的帮助下正步入我的超自然的命定当中。</p><p>   还记得在伯特利一二年级学期结束之后的夏天回到中国，我很兴奋的把我在伯特利学校所学到，和中国教会的弟兄姐妹分享，看到很多医治和神迹奇事在他们当中发生，也看到他们生命的改变和成长，更爱神。</p><p>   我的呼召和我的热情是使万人作基督的门徒，透过点火班、寻宝、coaching 等等工具, 把人对神的热情和对神的爱火点燃起来，帮助他们发现自己的命定，并步入他们的命定当中，成为改变世界的复兴者，将福音传的地极。</p><p>How Do I Step by Step Walk Into My Supernatural Destiny?<br></p><p>My name is Joanna and I was born and raised in a beautiful city in the Southwest of China, Kunming. I worked as an accountant for many years After I graduated from University in 1990. My mother became a Christian and was baptized when I was a little. She loved Jesus. I still remember that it was hard to find a Bible in those days. One day she borrowed a Bible and was very excited. She copied the Bible Genesis and the book John by hand.</p><p>One day in 1997, I went to a house church. This was the day I accepted Jesus Christ as my personal savior and I became a Christian. After I was converted, I immediately got involved serving God and doing ministry. A few months later I started leading a cell group.</p><p>In 2000, God called me to go to a very poor minority's village. I became a volunteer teacher in that village's elementary school. I taught mathematics and science. After I finished a whole school year in this elementary school, I went back to my city Kunming. There I was hired to work with an international organization called 'Project Grace International' (Currently called 'Bless China International') I worked in the financial office. After three years working as an accountant, I established a new ministry working with \"terminal care\". This ministry was primary care for people who got cancer.</p><p>I love God and I always want to pursue Him. I want to have intimacy with Him just like King David had with God. I went to Israel in 2012 and at the Sea of Galilee, God said to me: “Launch out into the deep water”. But I did not know where the place “deep water” was. </p><p>Twenty days after this encounter with God, I met with a friend whom I had not seen for many years. She shared her life story with me and how her life had been changed and how God supernaturally provided for her needs and all the encounters she had with God. I was so amazed about what she said. She told me she was studying at a ministry school called Bethel Supernatural Ministry School. I was so excited and I asked her if I could apply for this school. She gave me the link to applying for this school. I applied for this school right after the day we met and 10 days later I got the admission letter. In the same day I resigned from my job even though I had not applied for a U.S. visa yet. </p><p>Two months later in September of 2012, I left China and came to the United States for the Bethel Supernatural Ministry School. Although I didn't really know about this school, I put my trust in my God and I believed. I could sense that some good things would be happening.</p><p>The three years of studying at the Bethel School changed my life. I know more about my identity, who am I and know more about God. I know more about my calling and my destiny. After the 2nd year of school, I went back to China for the summer. I was so excited and wanted to share with the brothers and sisters in churches about what I had learned while at the Bethel School. God opened doors for me and I had opportunities to share with them. I have seen many healing, signs and wonders happen among them. I have also seen the changes in their lives and growth and they have more love and passion for the Lord.</p>My calling and my passion is to make disciples of all nations, through the Firestarter classes, treasure hunts, coaching etc. and to build people up and to ignite their passion, the fire of love for God. I hope to help them find their own supernatural destiny and walk into their destiny and become revivalists and world changers who preach the Gospel to the ends of the earth.", 
    "end_date": null, 
    "title": "步入你超自然的命定  Christian Supernatural Destiny ", 
    "price": 0, 
    "instructors": "Revival Lifestyle Academy", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667232_bcfa.jpg", 
    "course_url": "https://www.udemy.com/how-to-walk-into-my-supernatural-destiny/", 
    "subject_name": [
        "Religion & Spirituality"
    ], 
    "duration": null, 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T22:14:22Z"
}