{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>UPDATE: All videos in this course now come with complete English subtitles.</strong></p>\n\n<p><strong>Join more than 7<em>,000</em> students learning about interesting research in psychology!</strong></p>\n\n\n\n<p>If you've ever wanted an easy way to start learning about psychology,<strong> this is the course for you!</strong></p>\n\n\n\n<p>In this free course, you'll learn about 5 studies in psychology and see how their results reveal interesting things about human thought and behavior.</p>\n\n\n\n<p>The studies in this course reveal…</p>\n\n\n\n<ul><li>how we can persuade someone to do what we want without even providing good reasons</li><li>why praising some kids for their intelligence vs. their hard word dramatically changed their test scores</li><li>why people who held a hot cup of coffee instead of an iced coffee automatically started thinking a stranger was especially generous and caring</li><li>…and more!</li></ul>\n\n\n\n<p>Carefully designed experiments tell us a great deal about the choices we make, the ways we behave, and why we think the way we do. <strong>I'm a social psychologist </strong>myself, and I thought about which studies most interested me early in my education and which studies are my current favorites. I even reached out to my colleagues to ask them what studies have most inspired them and are important for everyone to know about.</p>\n\n\n\n<p>So <strong>enroll </strong>in this fun introductory course and start seeing how simple research in psychology tells us amazing things about human thought and behavior!</p>\n\n\n\n<p><em>This course is a special selection of lectures on experiments in social psychology. For a more advanced course, please check out “Quickly Understand Social Psychology,\" available here on Udemy.</em></p>", 
    "end_date": null, 
    "title": "5 Amazing Psychology Experiments", 
    "price": 0, 
    "instructors": "Andrew Luttrell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/509618_b914_2.jpg", 
    "course_url": "https://www.udemy.com/5-amazing-psychology-experiments/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-23T14:31:52Z"
}