{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">- Content last updated: April 15, 2016</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">- Join 700+ students learning in this course!</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">- The information in this course will change the way you think <br>about yourself and those around you - don't miss out on this chance to increase your knowledge about yourself and other people through the lens of psychology.</strong></p>\n\n<p>Jump right into this free course to learn about some fascinating psychology research and its incredible implications for you. This course, delivered by a social psychologist, is for anyone who wants to get started learning about psychology and for people who are already familiar with the basics but who want to learn more. <strong>Every single lecture in this course is backed by scientific research in the field of psychology.</strong></p>\n\n<p>In this course, you will learn the details and implications of 6 very interesting psychology studies. Among other things, you will learn how psychologists examine emotions from a functional perspective, that is, what they were designed by evolution to do and how they promote adaptive behavior. We will begin by examining the functional psychology of low mood/sadness and how a normal emotional response can actually get in the way of you achieving your difficult goals.You will learn how emotions can change your visual perception in interesting ways, how the color of clothing you choose to wear can actually cause you to behave differently and cause others to perceive you differently as well. You will also learn some intriguing developmental psychology research that suggests humans may actually be born with a moral sense of right and wrong. This course is designed for people who are at any level of learning psychology, whether you are just starting out or are already an advanced psychology student. Everything in this course is walked through step-by-step and explained, including how to interpret the data graphs that will be reviewed. You should take this course if you want to learn more about yourself and those around you through the lens of psychology. <strong class=\"redactor-inline-converted\">Don't miss out on this free opportunity to  treat yourself to a better understanding of you and those around you.</strong></p>", 
    "end_date": null, 
    "title": "6 Fascinating Psychology Studies", 
    "price": 0, 
    "instructors": "Conor Steckler", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821448_3bab_3.jpg", 
    "course_url": "https://www.udemy.com/6-fascinating-psychology-studies/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T22:12:53Z"
}