{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Этот курс создан </strong><strong>Фондом поддержки семьи и детей «Хранители детства».</strong></p><p><strong class=\"redactor-inline-converted\">Наставничество</strong> – это проверенная временем стратегия, которая помогает ребенку-сироте развить свой жизненный потенциал и способствует успешному переходу ребенка к самостоятельной жизни. Сегодня многие организации заинтересованы в развитии программ наставничества, но не имеют достаточной информационной базы и опыта создания эффективной программы.</p>\n\n<p><strong class=\"redactor-inline-converted\">Первый в России курс</strong> по разработке и реализации программ наставничества для детей в трудной жизненной ситуации основан на уникальной методике наставничества и социальной адаптации детей-сирот, разработанной фондом «Хранители детства» с учетом лучшего зарубежного и отечественного опыта. Данный курс создан для специалистов некоммерческих организаций, заинтересованных в системном развитии наставничества для детей-сирот и детей, оказавшихся в трудной жизненной ситуации». </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">В результате слушатели смогут самостоятельно разработать эффективный проект наставничества, сопровождения детей-сирот  в своем регионе.</strong></p>\n\n\n\n\n\n<p><strong>Курс доступен бесплатно всем желающим</strong>. Мы будем рады, если вы возьмете на вооружение методики, доказавшие свою эффективность в России и за ее пределами. Наша общая задача – помочь каждому ребенку в трудной ситуации найти любящего и заботливого взрослого для полноценного развития и успешного перехода из детского дома к самостоятельной жизни. </p>", 
    "end_date": null, 
    "title": "7 ключей Эффективного Наставничества", 
    "price": 0, 
    "instructors": "Анна Кочинева", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/866776_01ca_2.jpg", 
    "course_url": "https://www.udemy.com/7-keys-of-effective-mentoring/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-02T12:09:01Z"
}