{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t        Accessibility means to grant equal access to  services and built environment  to persons with disabilities. Goal of this class is:  </p>  <p style=\"\">  \t1- to provide some clarity both on roles of federal and state agencies  in implementing and enforcing code compliance.  </p>  <p style=\"\">  \t2 - to explain the difference between laws, guidelines and state codes, and their application in construction.  </p>  <p style=\"\">  \t\t\t\t       This class is focused on accessibility to the built environment and will provide some details on the structure of Chapter 11B of the California Building Codes as developed in the latest code edition of 2013.  \t\t\t\t</p><p style=\"\">  \t\t\t\t\t    A sample of   how to search the code (CBC), is presented,  \t\t\t\t\t</p><p style=\"\">  \t\t\t\t\t\t    along with a code application related to parking stall design.  \t\t\t\t\t\t</p><p style=\"\">A copy of CBC Chapter 11B table of contents is provided to download as supplemental material.</p><p style=\"\">  \t\t\t\t\t\t\t    The course is about 1 hour length and it is divided in 8 parts with a short quiz at the end of each portion.  \t\t\t\t\t\t\t</p><p style=\"\">  \t\t\t\t\t\t\t\t    Professionals involved in the design and construction industry  will find this class useful.  \t\t\t\t\t\t\t\t</p><p style=\"\">  \t\t\t\t\t\t\t\t\t    This class may qualify for 1 continuing education learning unit, for architects licensing renewal. Please note that other agencies may accept the CE credit  \t\t\t\t\t\t\t\t</p>", 
    "end_date": null, 
    "title": "accessibility Codes and Laws an overview", 
    "price": "20.00", 
    "instructors": "Laura Baldrati", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416032_aa8b_2.jpg", 
    "course_url": "https://www.udemy.com/accessibility-codes-and-laws-an-overview/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T19:19:44Z"
}