{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Ace Your Online Class is a course designed to help people who have never taken an online college class before, or struggled with one in their first go around. The course teaches students how online learning differs from traditional learning, the tools needed for success, the main features of your course, and tips on how to navigate them. </p><p>Thirty instructional videos (4-10 minutes each) split into ten sections will prepare and guide learners through the maze that is your school's Learning Management System, identifying the main features most likely to be used, and strategies for best execution. Each video has an accompanying fact sheet that offers a summary of the video, optional resources, and an extra daily challenge for those wishing to take their online mastery to the next level. Quizzes and worksheets are also included.</p><p>The course may be taken at whatever pace works best for you, but it is designed to be consumed by watching one video per day for thirty days. This suggestion is intentional as it mimics the workflow recommended for tackling your online classes. In effect, the hope is that the routine you develop while watching these videos effectively becomes your routine for tackling online coursework. </p><p>For new online learners, this course is best taken just prior to the start of your online class (it helps if you can access the class), or as your class is beginning. Students who have struggled in the past, or are currently struggling may seek out certain sections of the course after your class has started, as needed. </p><p>The course is also particularly helpful for students with learning disabilities or cognitive issues, such as trouble with attention, concentration and memory.</p><p>In the end, you probably invested a great deal of money into college, and are about to invest a great deal of time. Make sure your time and money are well spent by arming yourself not only with a solid overview of how college online classes operate, but the mindset and workflow that you'll need to ace your online class!</p>", 
    "end_date": null, 
    "title": "Ace Your Online Class", 
    "price": "20.00", 
    "instructors": "Derek Malenczak", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/847674_ce01_4.jpg", 
    "course_url": "https://www.udemy.com/ace-your-online-class/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T02:08:54Z"
}