{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong>¿Por qué este curso es para ti?</strong>  </p>  <p>¿Necesita entrenar varias personas en su lugar de trabajo, en todo lo relacionado con el análisis de riesgo laboral? </p><p>¿Los accidentes laborales han estado ocurriendo?</p><p>¿Debe garantizar un conocimiento que permita prevenir lesiones y contaminaciones?</p><p>Sí es así, este curso es para usted.</p><p>En el mundo altamente competitivo de hoy, todas  las organizaciones valoran más a  aquellos colaboradores, que están en capacidad de analizar y disminuir los riesgos a su alrededor. Esto optimiza los procesos y disminuye la posibilidad de sufrir perdidas que afectan a las personas, el ambiente y a la organización.  </p>  <p>  \t            El curso ha sido diseñado teniendo en cuenta  las normas internacionales <strong>ISO 9001, ISO 14001 Y OHSAS 18001</strong>, por lo tanto, si conoces las normas recordaras conceptos claves. Sí no las conoces, te será muy fácil acercarte a ellas mediante este curso.  </p>  <p>  \t                  La gestión de riesgos es algo que puedes aprender en este curso de forma <strong>dinámica</strong> y <strong>aplicable</strong> al día a día. Este curso te provee herramientas para entender, identificar y valorar situaciones con potencial de riesgo, y te enseña cómo poder tomar decisiones acertadas frente a los riesgos valorados.  </p>  <p>  \t            Después de hacer este curso, nada volverá a ser como antes, tu mente estará entrenada y empezará a aplicar lo aprendido en el curso. <strong><em>\"Una vez le muestras a tu cerebro un nuevo camino, el lo utilizará, inclusive de manera inconsciente.\"</em></strong>  </p>  <p>  \t<strong>  \t</strong>  </p>  <p>  \t<strong>¿Cuanto tiempo te tomará realizar este curso?</strong>  </p>  <p>  \t                El tiempo promedio de duración del curso es de 2 horas. Este tiempo incluye las preguntas que debes contestar  </p>  <p>  \t<strong>¿Qué materiales incluye el curso?</strong>  </p>  <p>  \t            Cada lección contiene material de apoyo que podrás <strong>descargar</strong>. Entre ellos, <strong>normas</strong>, documentos en <strong>Word </strong>y un formato en <strong>Excel</strong>. Estoy seguro que te servirán de gran apoyo.  </p>  <p>  \t<strong>¿Cómo está estructurado el curso?</strong>  </p>  <p>  \t                El curso está conformado por 5 secciones, cada sección contiene en promedio 3 videos que la desarrollan, así como el material de apoyo y descargas, en la sección de recursos de la plataforma.  </p>", 
    "end_date": null, 
    "title": "Análisis de riesgos en el lugar de trabajo - Nivel Básico", 
    "price": "25.00", 
    "instructors": "Yesid Torres", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403144_47f9_2.jpg", 
    "course_url": "https://www.udemy.com/gestion-de-riesgo-e-impactos-ambientales/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T20:33:17Z"
}