{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Si eres estudiante de administración y dirección de empresas o de economía seguramente tienes econometría en alguna asignatura (o en varias). Pon en práctica lo aprendido sobre inferencia estadística.</p><p style=\"\">Invirtiendo unas seis horas en este curso entenderás los conceptos básicos para poder estudiar y aprobar tus asignaturas en mucho menos tiempo.</p><p style=\"\">Tendrás el mejor diseño en gráficas y formulas para que entiendas perfectamente los conceptos básicos de econometría. </p><p style=\"\">Las betas de las regresiones son nuestra munición para disparar con las regresiones dentro de la batalla de la econometría. Todo es mucho más sencillo cuando tenemos ejemplos visuales de lo que está sucediendo. además, lo hacemos bonito.</p><p style=\"\">Toma notas, reproduce los gráficos y anota las fórmulas mientras ves los vídeos de teoría. Páralos y vuelve a verlo tantas veces como necesites.</p><p style=\"\">Intenta los ejercicios resueltos por tu cuenta, así como los exámenes y los ejercicios propuestos y resueltos, para asegurarte que lo has entendido.</p><p style=\"\">Si tienes alguna duda, mándame un mensaje, te contestaré enseguida que pueda.</p><p style=\"\">Por favor, si detectas algo que no te gusta, no se entiende, no se ve... dilo, e intentaremos resolverlo cuanto antes.</p><p style=\"\">¡Y no te olvides de valorar el curso!</p><p style=\"\">Póntelo fácil con foli</p>", 
    "end_date": null, 
    "title": "aprueba econometría ahorrando tiempo ", 
    "price": "40.00", 
    "instructors": "Foli Centre d'Estudis", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595828_4b51.jpg", 
    "course_url": "https://www.udemy.com/aprueba-econometria-con-foli/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T10:59:32Z"
}