{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to 'Basics of Microeconomics : Theory of Producer Behavior'</p><p>In this course , you will understand how a producer :</p><p>1) Maximizes his profit</p><p>2) Decides what to produce and how much to produce</p><p>3) Decides what all inputs to use and in what proportion</p><p>In this course, we will discuss the following: <br>What is microeconomics?<br>What is the difference between fixed factors of production and variable factors of production?<br>How do we differentiate between short run and long run?<br>How is the meaning of cost in economics different from meaning of cost in accountancy?<br>What is the difference between fixed cost and variable cost?<br>What do we mean by Perfect competition and Monopoly market type?<br>What is the difference in the behavior of revenue curves in these two market types?<br>How does a monopoly or perfectly competitive firm decides how much to produce to maximize his profit?</p><p>Some concepts that we will use while discussing the topics mentioned above -<br></p><p>Production Function, Returns to a factor, Law of variable proportions, Total cost, Marginal Cost, Average Cost, Total Product, Marginal Product, Average Product, Total Revenue, Marginal Revenue, Average Revenue.</p><p>This course has 16 video lectures and 1 hour of content.</p><p>How will this course benefit you?</p><p>If you are an economics student - This will help you in gaining better clarity of concepts. <br></p><p>If you are someone who has a desire to learn economics - This course is the first step that you need to take to fulfill your desire, it starts from the scratch and covers all the concepts in detail. </p><p>All that said, if you would like to discuss something while you are learning, please feel free to start a discussion or PM me.</p><p>Lets get started..!</p>", 
    "end_date": null, 
    "title": "Basics of Microeconomics : Theory of Producer Behaviour", 
    "price": "20.00", 
    "instructors": "Shubham Kalra", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/696620_1e37_2.jpg", 
    "course_url": "https://www.udemy.com/basics-of-economics-theory-of-producer-behaviour/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-13T20:50:58Z"
}