{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>Why should I do this course?</strong></p><p> If you are looking to boost your performance in your studies and/or at work, this course is for you!  The way in which you express yourself in writing certainly says a lot about who you are.  Just as you invest time, money and effort to create a positive image through your physical appearance, it is also vitally important to invest in the image you portray to others through your written work. This course is designed to help you do just that!</p>    <p><strong>What will I get from this course?</strong></p>  <p>Confidence and opportunity! The key to improving your written expression is through confidence.  The more you use the techniques you learn in this course, the more you will produce effective written work that will attract attention and praise, thus, increasing your confidence bit by bit.  As your confidence grows so, too, will your opportunities!</p>    <p><strong>How is this course structured?</strong></p>    <p>This course is comprised of five sections, incorporating nearly 3 hours of video, involving 20 lectures and including a PDF downloadable resource.</p>  <ul><li><strong>Section One</strong> introduces your instructor, outlines the importance and benefits of the course and provides information on course structure.</li><li><strong>Section Two</strong> helps you get started with your written work by outlining the planning process and detail regarding the written structure of your document, your sections and your paragraphs.</li><li><strong>Section Three</strong> is all about making sense with your written expression and highlights some common errors in this respect. More importantly, techniques that allow you to express yourself logically and meaningfully, are presented and these will help to boost your confidence.</li><li><strong>Section Four</strong> addresses the styling elements of the document, the paragraphs and the sentences and helps you add that final “polish” to your written work.</li><li><strong>Section Five</strong> wraps up the course and presents a practical tool that can be downloaded and used to significantly enhance the effectiveness of your future written documents. </li></ul>            <p><strong><br>This course will advantage:</strong><br></p>  <ul><li>Undergraduate and postgraduate students</li><li>PhD, Masters and Honours Students</li><li>Anyone who wishes to significantly improve the quality and professionalism of their written work</li></ul>", 
    "end_date": null, 
    "title": "Boost Your Academic/Work Performance: Writing Effectively", 
    "price": "20.00", 
    "instructors": "Professor Debra Grace", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765996_3fb5_2.jpg", 
    "course_url": "https://www.udemy.com/boost-your-academic-work-performance-writing-effectively/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T01:26:47Z"
}