{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong style=\"\">OVER 150 STUDENTS HAVE TAKEN THIS COURSE.</strong></p><p><strong style=\"\">This is a great course for psychology students, high school and college anatomy students, and allied health professionals looking to learn more about brain anatomy.</strong></p><p style=\"\"><strong style=\"\">- Over 90 minutes of course content<br style=\"\"></strong><strong style=\"\">- Built in quizzes to help you master key terminology<br style=\"\"></strong><strong style=\"\">- Structures of the brain and their functions explained in simple terminology</strong></p><p>  \tDo you have an interest in the human brain anatomy? Are you a high school or college student who is struggling to learn neuroanatomy or keep up with your biopsychology course? Want to learn more about biopsychology? Have an interest in psychology? This is the course for you!  </p>  <p>  \tIn this fun course, you will learn the basics of brain anatomy from the structures to the functions. This course is meant to supplement courses you may be taking in school, give a refresher to anyone who is working in the medical field, and will certainly help anyone with a keen interest of the brain. This is not a stuffy lecture where giant terms are just thrown at you, but rather presented in a why to help any student master the basics of brain anatomy.  </p>  <p>  \tThe course is broken down into simple, bit size pieces that simplifies complex terminology with simple terms and fun mnemonics to help students to master difficult subjects. There are many great graphics to help you follow along, as well as a couple of short quizzes to make sure you master important terms. If you need to prepare for a test, or just brush up on brain anatomy, biopsychology, and neuroscience for an upcoming class, this is a great course for you.  </p>", 
    "end_date": null, 
    "title": "Brain Anatomy - Learn biopsychology science quickly & easily", 
    "price": "20.00", 
    "instructors": "Dr. Jeramy Colvin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399728_3cbf_3.jpg", 
    "course_url": "https://www.udemy.com/brain-anatomy-learn-biopsychology-quickly-and-easily/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T04:00:03Z"
}