{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This course is an introduction to comparative politics and concentrates on the public sphere of politics and relationships on a global basis that are formed by the search for or possession of that which yields power. </p><p>This course will compare types of government and political systems and include the rudimentary theories of social science, comparisons of political theories, and approaches and the character of the state. </p><p>There will be assessments of authoritarian, totalitarian, and democratic forms of the state. The course will address the concepts of democracy and democratization and the institutional features of government and governance. </p><p>This course will address variables which shape outcomes in global politics, in ideology and government policy processes. </p><p>The first unit will address The Rule of Law with comparatives between parts of Europe, the United States of America, and a large part of Asia. To the extent applicable, the Rule of Law will be addressed in the remaining lectures. </p><p>This course is designed to not only address a comparison of politics globally, but to examine the periphery of political issues which result in global conflicts. </p><p>This course addresses the United Nations and its charge of bringing about positive change in the 21st century. With respect to the United Nations, we will learn its current role of focusing on globalization at a time when people want to be free from want, free of fear, and desire the assurance that current generations will weather these challenges and other global problems and that future generations will enjoy a sustainable world.</p><p>Politics </p><p>Politics locally is the establishing of policies. Globally is has a different connotation. The word politics comes from the Greek word “politikos\" which means, “relating to citizens\" and is the practice of influencing people on a worldwide, local, or even for small group to one person alone. More particularly, it is the attaining and often retaining positions in governance and control among humans or in a state. Furthermore, politics is the application and distribution of power and resources and the interstitial relationship between communities. </p><p>A host of strategies are used in politics, including the influencing of others to adopt and support certain preferred political views, tradeoffs with political allies or subjects, and, as noted above, designing laws, and using force, including violence against antagonists. </p><p>As will be shown, the history of politics' roots is traceable to ancient times, with influential works to include Aristotle's Politics and the writings of Confucius.</p><p>Politics will always be with us and should, in the ideal, lead to commitment between all governments and their citizens. Enter then the United Nations, which we will discuss and that has its own internal politics with which to deal. <br style=\"\"></p>", 
    "end_date": null, 
    "title": "Comparative Politics and Global Issues", 
    "price": "20.00", 
    "instructors": "Mr. John Augustus Rose", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616962_7d01_3.jpg", 
    "course_url": "https://www.udemy.com/comparative-politics-and-global-issues/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T01:52:15Z"
}