{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<strong></strong><strong></strong><strong></strong><strong>Overview</strong><p><span></span></p><p>As advanced economies come to the end of the process of industrialization and with the rise of information technology we are witnessing the birth of a new type of post-industrial economy, it is built on services, fueled by information and knowledge and it is increasingly integrated through global financial and supply chain networks. These huge changes in the deep architecture to our economies go far beyond our industrial paradigm and are necessitating a re-imagination of economy theory. General equilibrium models that were derived from classical physics got mathematized during the 20th century, these models give us a picture of the economy as composed of isolated, purely rational individuals, optimizing over a well defined set of preferences out of which we get a macro level general equilibrium in a somewhat static and timeless economy.<br>It was a paradigm that fitted well with industrial age mechanization. But today the limitations of general equilibrium theory are becoming more apparent as we build new models, models to individual agents that have bounded rationality, driven by a diversity of motives they are interconnected and interdependent. And it is out of these nonlinear interactions we get the emergence of economic institutions as network structures that are far-from-equilibrium, in an economy that is constantly changing from internal drivers as it develops over time through an evolutionary process.</p><p><strong>Content</strong></p><p>This course is an overview to the new area of complexity economics, the application of models from complexity theory to the domain of economic science. The course is broken down into five main sections, we will start off with an overview to economic theory discussing our standard approach before going on to give a clear outline to the main ideas coming out of complexity economies. Next we will borrow from behavioral economics to build up a more complex model to economic agents as we talk about the idea of bounded rationality, different theories of value, choice theory and incentive systems.<br>In the third section we will be looking at nonlinear economics as we apply system dynamics to modeling micro economic phenomena, we will be talking about how feedback loops create nonlinearity and the process of self-organization out of which emerges non-equilibrium patterns of organization in the economy. Next we will apply network analysis to modeling macro level economic institutions such as markets, we will introduce you to the basics of network theory and go on to talk about economic networks, their topology, distribution and dynamics. In the final section will be looking through the lens of complex adaptive systems theory to understand how whole macro economies emerge out of the actions and reactions of many different organizations, we will use the model of a fitness landscape in order to help us understand the process of economic evolution.</p>", 
    "end_date": null, 
    "title": "Complexity Economics An Introduction", 
    "price": "20.00", 
    "instructors": "Complexity Academy", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/768540_3dc4.jpg", 
    "course_url": "https://www.udemy.com/complexity-economics/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-20T10:22:55Z"
}