{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t   Calculating confidence intervals and determining sample sizes is an important topic of statistical inference. This is one of the most practical areas of statistics that allows the student to learn the concepts and apply them to real world situations.  </p>  <p style=\"\">  \t   This course explains the concepts in an easy to understand way.  This is reinforced with fully solved and explained problems to highlight all the important details the student needs to pay attention to.  In addition, the student will have the opportunity to take selected quizzes that serve as check points to determine if each concept is well understood.  </p>  <p style=\"\">  \t   The course includes tables of the standard normal distribution, the Student t distribution and the Chi square distribution.  In addition, you will be given the opportunity to take a final test to check your understanding of the overall material.  </p>  <p style=\"\">  \t   It may take between two weeks to a month to finish this material depending on how much time is devoted to the course as well as the student prior preparation.  It is important to realize that this course prerequisite is the knowledge of the Normal distribution.  The student can achieve that requirement by taking my course &quot;Learn the Normal or Gaussian distribution&quot; first.  </p>  <p style=\"\">  \t   This topic of confidence intervals and determining sample sizes is a required section for students learning statistics.  The material is also very useful to professionals in many fields who want to apply statistical concepts in their daily work.  </p>", 
    "end_date": null, 
    "title": "Confidence intervals and sample sizes estimations ", 
    "price": "20.00", 
    "instructors": "Luc Zio", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/122690_6d2f_5.jpg", 
    "course_url": "https://www.udemy.com/and-samconfidence-intervals-ple-sizes-estimations/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-20T04:25:25Z"
}