{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Si eres estudiante de universidad o bachillerato seguramente tienes inferencia estadística en alguna asignatura (o en varias).</p><p style=\"\">Invirtiendo unas tres horas en este curso entenderás los conceptos básicos para poder estudiar y aprobar tus asignaturas en mucho menos tiempo.</p><p style=\"\">Tendrás el mejor diseño en gráficas y formulas para que entiendas perfectamente los conceptos básicos de inferencia estadística. </p><p style=\"\">Los estimadores, intervalos de confianza y contraste de hipótesis se ven fáciles cuando los hacemos bonitos.</p><p style=\"\">Cuando lo acabes, podrás pasar a estudiar la econometría, por ejemplo.<br style=\"\"></p><p style=\"\">Toma notas, reproduce los gráficos y anota las fórmulas mientras ves los vídeos de teoría. Páralos y vuelve a verlo tantas veces como necesites.</p><p style=\"\">Intenta los ejercicios resueltos por tu cuenta, así como los exámenes y los ejercicios propuestos al final del pdf de solución, para asegurarte que lo has entendido.</p><p style=\"\">Si tienes alguna duda, mándame un mensaje, te contestaré enseguida que pueda.</p><p style=\"\">Por favor, si detectas algo que no te gusta, no se entiende, no se ve... dilo, e intentaremos resolverlo cuanto antes.</p><p style=\"\">¡Y no te olvides de valorar el curso!</p><p style=\"\">Póntelo fácil con foli</p>", 
    "end_date": null, 
    "title": "contrastes de hipotésis: aprueba estadística inferencial", 
    "price": "20.00", 
    "instructors": "Foli Centre d'Estudis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/570050_9c61_4.jpg", 
    "course_url": "https://www.udemy.com/inferenciaestadistica_foli/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T10:35:25Z"
}