{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>This <u>FREE</u> course addresses the following issues:</p>    <p>- How good are we at solving crime in the US?  (Hint – not so good~~)</p>  <p> <br> - Who are the detectives and what do they do? </p>  <p><br> - How did we get into this situation, and why? </p>  <p><br> - What can we expect in the future?</p>    <p>- And just how much can forensics and technology be expected help investigations? <br> <br> </p>  <p>To find answers to these and other questions, we explore the criminal investigation process of the present, the past, and the future.</p>    <p>We present an overview of the subject in a listener-friendly and informative way. It is scripted to be understood by the casual observer, as well as the experienced investigator and the aspiring academic.</p>    <p>This<strong> </strong>course is rooted in the research literature and is amply referenced and well-cited. It provides some of the most comprehensive and current information available on the process. <br> <br> It does NOT teach how to be an investigator. Instead, it teaches ABOUT the investigation process itself.</p>    <p>The course consists of about 58 lectures ranging from five to 20 minutes in length (about 12 hours total). The lectures are divided into six sections addressing the following:</p>    <p>(1) Where are We? <br> (2) Who are the Detectives and What Do They Do?<br> (3) How Did We Get Here? <br> (4) Where are We Going? <br> (5) Where Do We Want to Go? <br> (6) The Year “2084.”</p>    <p>To guide us through the sections, students will learn to use a <u>HANDY FRAMEWORK</u> to do the following:</p>    <p>1. <strong> </strong>IDENTIFY a crime problem (in terms of the phases of a crime).</p>  <p>2.  DESCRIBE the availability of crime information and sources in each crime phase (in terms of space and time).</p>  <p>3.  UNDERSTAND how the various detective models of the past have investigated crime (to see their strengths and weaknesses).</p>  <p>4.  MANIPULATE what we learned to project how developments in forensics and technology, and a new detective model, can address the crime problems of the future.</p>", 
    "end_date": null, 
    "title": "Criminal Investigation in the New Millennium", 
    "price": 0, 
    "instructors": "Robert T. Meesig", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578030_8502_2.jpg", 
    "course_url": "https://www.udemy.com/criminal-investigation-in-the-new-millennium/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T13:45:58Z"
}