{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t      Este curso &quot;¿Cómo estructurar y redactar una tesis?&quot; cubre la redacción de las partes esenciales de una tesis, y cómo dichas partes se estructuran entre sí. Se desarrolla trabajando el significado de cada elemento de la tesis, el análisis de ejemplos y pasos prácticos para su redacción.  </p>  <p style=\"\">  \t  La fortaleza principal de este curso-taller es su sencillez práctica para redactar y para interconectar las partes más importantes de una tesis. Al inscribirse a este curso-taller, el estudiante o egresado que sólo requiera la tesis, obtiene la oportunidad de hacer rápidamente su tesis y titularse.  </p>  <p style=\"\">  \t      Este curso va dirigido a todas aquellas personas que deseen realizar su documento de tesis para titularse en corto tiempo y con alta solidez estructural. Estudiantes o graduados de los niveles de licenciatura, maestría (master) o doctorado pueden tomar este curso, lo único que se necesita es asumir el compromiso de hacer un documento de calidad.  </p>  <p style=\"\">  \t      Hemos elaborado este curso de tal forma que independientemente del tema o área de conocimiento que se trabaje en tu tesis, las ideas que se expresen en la misma se puedan argumentar con las diferentes partes del documento, y que estas tengan relación y coherencia entre si.  </p>  <p style=\"\">  \t      Debido a que el curso es de más o menos 7 horas, la idea es tomar una hora aproximadamente de curso al día, realizando también los respectivos ejercicios de cada clase. Con lo que en una semana habrás completado el curso y habrás avanzado en tu documento, teniendo una segunda semana para repasar aquellas clases o secciones donde más lo necesites.  </p>", 
    "end_date": null, 
    "title": "Cómo estructurar y redactar una tesis de investigación", 
    "price": "30.00", 
    "instructors": "Javier  Nava González.", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362796_9dea_5.jpg", 
    "course_url": "https://www.udemy.com/como-redactar-y-estructurar-una-tesis/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T04:13:17Z"
}