{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Neste <strong style=\"\">Crash Course em Gestão de Empresas </strong>obtém uma explicação <strong style=\"\">rápida e muito prática </strong>dos conceitos fundamentais da da gestão empresarial. O curso é apresentado em <strong style=\"\">vídeos de curta duração</strong>,, fáceis de incorporar mesmo em agendas carregadas. Pode visualizar e descarregar todos os slides utilizados no curso, bem como diverso material adicional.</p><p><strong style=\"\">Aprenda os Conceitos e Teorias Fundamentais da Gestão de Empresas</strong></p><ul style=\"\"><li>Entenda a importância da invenção das sociedades</li><li>Conheça a evolução das escolas de pensamento  da gestão</li><li>Saiba o que realmente faz um gestor eficaz</li><li>Aprenda a distinguir liderança e gestão</li><li>Entenda os princípios fundamentais da motivação</li><li>Domine técnicas de eficácia pessoal</li></ul><p><strong style=\"\">Uma Panorâmica dos Grandes Temas da Gestão</strong></p><p>Este curso não se debruça minuciosamente sobre todos os pequenos detalhes da investigação e das teorias da gestão de empresas. A ênfase é numa abordagem global e prática dos grandes temas que dispensa leituras enfadonhas de textos em letra miudinha.</p><p>A linguagem utilizada é acessível e a ligação entre a teoria e exemplos práticos é uma preocupação constante. Desta forma compreenderá a relevância da matéria abordada e como a transpor para a sua própria experiência. O reconhecimento da necessidade de aprofundamento de temas que para si tenham mais relevância está também assim facilitado e orientado.</p><p><strong style=\"\">Se é um executivo que procura valorizar-se ou um estudante em busca de uma perspetiva global, este curso é para si: Inscreva-se Agora!</strong></p>", 
    "end_date": null, 
    "title": "Dê Cartas em Gestão de Empresas!", 
    "price": "20.00", 
    "instructors": "Anika Dzus", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447768_6f15_3.jpg", 
    "course_url": "https://www.udemy.com/gestao-de-empresas-descomplicada/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-15T10:37:34Z"
}