{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Neste <strong style=\"\">Crash Course em Gestão Financeira </strong>obtém uma explicação <strong style=\"\">rápida e muito prática </strong>dos conceitos fundamentais da contabilidade e da gestão financeira e da sua aplicação. O curso é apresentado em <strong style=\"\">vídeos de curta duração</strong>, entre cinco a vinte minutos, fáceis de incorporar mesmo em agendas carregadas. <strong style=\"\">Inclui a resolução de muitos exercícios </strong>concebidos para lhe proporcionar uma compreensão acelerada dos temas mais importantes. Pode visualizar e descarregar todos os slides utilizados no curso, bem como diverso material adicional. </p><p style=\"\"><strong style=\"\">Surpreenda-se Com o Rápido Aumento Da Sua Inteligência Financeira</strong></p><ul style=\"\"><li style=\"\">Entenda o Balanço, a Demonstração de Resultados e os Fluxos de Caixa</li><li style=\"\">Saiba o que é ter lucro e como pode ser diferente de ter dinheiro</li><li style=\"\">Comprenda a Análise Financeira e saiba como utilizar Rácios</li><li style=\"\">Entenda como analisar investimentos</li></ul><p style=\"\"><strong style=\"\">Domine A Prática Dos Conceitos Contabilísticos E Financeiros Fundamentais</strong></p><p style=\"\">Este curso não se destina a ensinar a contar feijões, mas sim a entender de uma perspetiva empresarial e de gestão o que são a contabilidade e a gestão financeira e como é que lhe podem ser úteis na sua atividade professional..</p><p style=\"\"><em style=\"\">Os módulos de curta duração facilitam a interiorização da aprendizagem e conferem ainda mais flexibilidade a este curso online. Pode segui-lo em qualquer lugar, em qualquer horário, no seu computador, tablet ou telemóvel. </em></p><p style=\"\">Os conceitos são transmitidos através de inúmeros exemplos e da resolução de exercícos práticos e não de aborrecidas exposições teóricas. O ponto de vista é sempre o do empresário ou gestor de topo, não do escriturário ou contabilista. Se procura um curso que ensina como fazer classificações e lançamentos contabilísticos - este curso não é para si. Se o que pretende é saber como pensar corretamente em termos financeiros então sim, é disso que aqui trato.</p><p style=\"\">Os exemplos e exercícios apresentados referem-se na sua maioria a micro e pequenas empresas, de acordo com a nossa realidade empresarial. Desta forma facilita-se também a compreensão global da atividade de uma empresa e da perspetiva empresarial da mesma.</p><p style=\"\"><strong style=\"\">Se é um executivo que procura valorizar-se ou um estudante em busca de uma perspetiva diferente, este curso é para si: Inscreva-se Agora!</strong></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Dê Cartas Em Gestão Financeira!", 
    "price": "20.00", 
    "instructors": "Anika Dzus", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445152_e40d_2.jpg", 
    "course_url": "https://www.udemy.com/gestao-financeira-descomplicada/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T20:24:25Z"
}