{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to my course  - Basics of microeconomics : Theory of Consumer Behavior. </p><p>In this course, you will understand the theory of how consumers make buying decisions.</p><p>There are two approaches to study Consumer's Equilibrium -  Utility approach and Indifference curve approach. </p><p>In this course, we will discuss the following : <br>What is economics?<br>How different and related are microeconomics and macroeconomics?<br>Who is a consumer, are all human beings consumers?<br>How can we measure consumer satisfaction?<br>Which approach is more realistic - Utility approach or Indifference curve approach? <br>If a consumer is making buying decision then how is his income affecting his decisions?<br>How does a consumer reach equilibrium?<span></span></p><p>Some concepts that we will use while discussing the topics mentioned above - </p><p>Rational Consumer, Total Utility, Marginal Utility, Law of Diminishing Marginal Utility, Budget Set, Budget Line, Indifference Map and Indifference curve. </p><p>This course has 12 video lectures and 1 hour of content. </p><p><span></span>How will this course benefit you?</p><p>If you are an economics student -  This will help you in gaining better clarity of concepts. <br></p><p>If you are someone who has a desire to learn economics - This course is the first step that you need to take to fulfill your desire, it starts from the scratch and assumes you have no knowledge of economics. </p><p>All that said, if you would like to discuss something while you are learning, please feel free to start a discussion or PM me. </p><p>Lets get started..!</p>", 
    "end_date": null, 
    "title": "Economics: How Consumers Take Buying Decisions", 
    "price": "20.00", 
    "instructors": "Shubham Kalra", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670542_257d.jpg", 
    "course_url": "https://www.udemy.com/basics-of-microeconomics-consumer-behaviour/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T19:17:19Z"
}