{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>What is the course about?</strong></p>  <p>‘Egg timer economics’ is a series of very short lectures that illustrate key areas of the A level Economics course. (Each lecture is about 3.5 minutes, hence the title 'Egg-timer Economics!) The course introduces key areas of micro and macroeconomics in a very straightforward way. There are also two sections on current affairs to encourage those attending the course to use news items to learn about Economics.</p>  <p>The course is divided into 13 lectures with the final lecture being a short revision.</p>  <p><strong>What terminology would you expect the audience to use to find your course?</strong></p>  <p> The terminology is common business language – as found in newspapers. Therefore terms such as ‘fiscal policy’ and ‘monetary policy’ are used. Students  are encouraged to use the Discussion Forum to raise points and questions. These questions will very quickly be responded to.</p>  <p><strong>What kind of materials are included?</strong></p>  <p>13 short lectures and some documents that a) test whether the student had understood/remembered the key elements of the lecture and b) questions encouraging to do their own research. In that way the course continues beyond the video.</p>  <p><strong>How long will the course take to complete?</strong></p>    <p>Assuming the student has an hour a day, the course could easily be covered in a week. However, one of the purposes of the course is to enthuse the student and the questions asked may encourage the student to spend hours reading newspaper articles </p>  <p><strong>How is the course structured?</strong></p>  <p>The lectures follow the A level Economic syllabus. So, video, then an extension document. Then the next video.</p>  <p><strong>Why take this course?</strong></p>  <p>The course gives a foretaste for a far longer main A level economics course. It also serves to stimulate interest – and thought.</p>", 
    "end_date": null, 
    "title": "Egg timer economics", 
    "price": 0, 
    "instructors": "Chris Bankes Sivewright", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638604_c94a_2.jpg", 
    "course_url": "https://www.udemy.com/egg-timer-economics/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T21:15:23Z"
}