{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t    Do you know what H-index, citation tracking, dissemination, and research impact mean? Do you think your job ends when your paper is published? This package introduces all the concepts regarding making impact in the academic world such as citation tracking, dissemination, networking and bookmarking. If you have finished your paper and want to make it as visible and possible, if you want to increase your H-index and become an established researcher, if you want to receive comments and citations this package is all you need.  </p>  <p style=\"\">  \t    Suitable presentation of scientific results to the academic world is essential in knowledge production. Without the comments and opinions of other researchers, you cannot say you have achieved your ultimate goal. In order to obtain the ideas and opinions of other experts and professionals, the results of your research should become easily and publicly available.  </p>  <p style=\"\">  \t    There are various tools developed by well-known institutes throughout the academic world to help improve the quality of research. These sets of tools are developed with great effort by elites in order to aid in researchers and using them in systematic ways leads to a valuable and high quality research project.  </p>  <p style=\"\">  \t    After becoming familiar with the concepts and tools introduced in this package you will be able to successfully disseminate your paper and make it visible to other researchers. You will know how to use various tools to make your paper search-engine friendly and you will realize the importance of social websites and free online repositories in disseminating your paper and making a bigger in impact in the academic world.  </p>  <p style=\"\">  \tTCFEX &#039;s Research Department  </p>", 
    "end_date": null, 
    "title": "Enhancing Research Visibility and Improving Citations", 
    "price": "20.00", 
    "instructors": "TCFEX LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342312_5d3e_3.jpg", 
    "course_url": "https://www.udemy.com/enhancing-research-visibility-and-improving-citations/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T11:56:31Z"
}