{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Food Energy Water: Foundation Systems of Modern Society</p><p>Modern society rests upon three distinct foundation systems, or pillars that came into existence over many thousands of years; food, energy, and water. The stability of each of these pillars is critical to the survival of human societies. Throughout this course we will look at each of these foundation systems from their origins to their status in today&#039;s world. This historical overview will provide insight into how societies evolved because of these pillars, but more importantly how they remain stable, a critical requirement for long-term survival. The way these systems have evolved is often viewed differently depending upon your perspective. The biological sciences look to genetic material, and physical development, as just some of the criteria in evaluating such systems. Economist, on the other hand, are more concerned with a systems approach, as they evaluate how systems interact for survival and longevity. As an engineer, I will try to walk a middle ground between these disciplines, and view them as a systems engineer.</p><p>Many of the systems, which have evolved around humanity and continue to evolve as human society becomes more complex, and the demands upon the systems increase. Resultant increase in demand has placed creasing amounts of stress on each of these foundation pillars that may have long ranging impact for human society.</p><p>This course is several hours in length, and provides a wealth of reference material for further study at the end of each section</p><p>The course is in three main sections. The first section covers the development of FOOD production as a system. The second section focuses on Energy as a system, and the final section is about Water management.</p>", 
    "end_date": null, 
    "title": "Food Energy Water: Foundation systems of Modern Society", 
    "price": "20.00", 
    "instructors": "Arthur Jackson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479362_638b_2.jpg", 
    "course_url": "https://www.udemy.com/food-energy-water-foundation-systems-of-modern-society/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-17T22:07:22Z"
}