{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t            Have you ever wondered what fascinating stories hang from the branches of your family tree? This course can teach you how to start climbing. Through a mixture of engaging lectures, intriguing primary source documents, and a wide variety of anecdotes from my own path of discovery, you can expect to quickly learn the basics of genealogical research and to begin tracing your roots.  </p>  <p style=\"\">  \t            In Section 1, we will discuss how to set goals for your project, how to take stock of what you know, and how to conduct interviews. Section 2 will provide resources to help you maintain accurate and detailed records of your findings. Through Section 3, you will learn to locate and examine some of the most common sources of genealogical information, and how to begin using these to construct your own family history. In Section 4, we will discuss how to overcome some of the most common challenges that researchers may face in exploring their ancestry. And in Section 5, we conclude with advice for sharing your findings, and for passing on your work to future generations.  </p>  <p style=\"\">  \t          Researching your family history can be a life-changing experience, and one that I know you will not regret. Just don&#039;t be surprised if you find yourself on a journey that is never quite finished; you may very well end up encouraging others to do the same!  </p>", 
    "end_date": null, 
    "title": "Genealogy: Learn to Climb the Branches of Your Family Tree", 
    "price": "40.00", 
    "instructors": "Daniel Isaac", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329956_0c49_2.jpg", 
    "course_url": "https://www.udemy.com/familytree/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T00:13:59Z"
}