{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t  Are you familiar with ISI indexed journals and different types of academic papers? Do you know how to select the most suitable journal for publishing your paper? In this package, which is the third of our series of video tutorials, you will become familiar with all the terminologies regarding ISI-indexed journals such as impact factor and journal appraisal criteria, various types of academic papers you can publish in journals; and most importantly journal selection criteria for paper submission.  </p>  <p style=\"\">  \t  There are various tools developed by well-known institutes throughout the academic world to help improve the quality of research. These sets of tools are developed with great effort by elites in order to aid in researchers and using them in systematic ways leads to a valuable and high quality research project.  </p>  <p style=\"\">  \t  After taking courses provided in this package, you will become familiar with all the terminologies around ISI-indexed journals and the tools that allow you to appraise them and find which journals in your field are high ranking. You will also be introduced to different types of scholarly papers such as case studies, review papers, letters and reports and the purpose of each one. Last but not least, you will be provided with certain criteria for targeting suitable and high quality journals and of course tools which help you find the most suitable ones using keywords in your title and abstract. This way you will not waste your time by submitting your paper to the wrong journal and getting it rejected. This package is essential for those who want to survive in the academic world!  </p>  <p style=\"\">  \tTCFEX &#039;s Research Department  </p>", 
    "end_date": null, 
    "title": "Get Your Research Published in The Best Matching Journals", 
    "price": "25.00", 
    "instructors": "TCFEX LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342178_35d8_2.jpg", 
    "course_url": "https://www.udemy.com/get-your-research-published-in-the-best-matching-journals/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T08:13:31Z"
}