{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t      Es hora de usar herramientas digitales para escribir sus artículos científicos o tesis (de grado o posgrado). ¿Cómo organizar sus citas bibliográficas, sus referencias de una manera óptima. En este curso se examinan 4 organizadores bibliográficos que son gratuitos. Estas herramientas le ayudarán a escribir académicamente su manuscrito, porque permiten la conexión con Word. Esto es, se puede transferir citas bibliográficas y notas a su escrito. Estas herramientas organizan y generan la bibliografía de su escrito. En síntesis, obtenga herramientas específicas para organizar sus referencias y documentación.  </p>  <p>  \t      Se incluye video tutoriales con indicación explícita de cómo descargas estas herramientas. Trate de aprende a usar cada herramienta y aplíquela a algunos de sus escritos. En seguida, puede seguir con otra herramienta. De este modo alcanzará un pleno dominio y podrá decidir cuál o cuáles son las más apropiadas para usted.  </p>  <p>  \t      Parece obvio responder la pregunta ¿por qué este curso es para usted?  </p>  <p>  \t      Se trata de mejorar la calidad de su escritura académica, organizando y sistematizando el enorme caudal de información que se requiete para escribir un artículo científico o una tesis.  </p>  <p>  \t      Es difícil estimar el tiempo para aprender la totalidad del curso, porque supone la instalación de las cuatro herramientas y la ejercitación necesaria. Se sugiere que se dé el tiempo necesario antes de avanzar a una nueva herramienta.  </p>", 
    "end_date": null, 
    "title": "Herramientas para la escritura académica: Artículos/Tesis", 
    "price": "20.00", 
    "instructors": "Eduardo Escalante", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314324_9dd0_11.jpg", 
    "course_url": "https://www.udemy.com/herramientas-para-la-escritura-academica-articulostesis/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T14:52:30Z"
}