{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t               With this award-winning proposal, students will see and understand in a clear and graphic way the flaws of our existing system and will be better equipped to know what has to be done. The Action Workshop will engage students to lay the foundation of societal innovation to build a better bridge to their own and our common future. And those who want to learn even more about this call for action can visit the Holigent website.<br>  \t<br>  \t      The future of young people throughout the Western world and beyond is endangered for the following reasons:  </p>  <ul>  \t<li>Governments are unable to solve the great social, economic and environmental challenges of our time.  </li>  \t<li>Educational institutions are turning out graduates—often with the crushing debt of student loans—into a world without jobs.  </li>  \t<li>Fossil fuel-based capitalism is causing the world to slide toward a climate catastrophe.   </li>  \t<li>Exponential concentration of wealth is causing extreme inequality that is undermining social order. </li>  </ul>  <p>  \t<br>  \t               It is time for the young, and all who care about our future to engage in a soft and smart revolution.   This course begins with stress testing the following pillars and other critical aspects of our existing bridge to the future:  </p>  <ul>  \t<li>Capitalism  </li>  \t<li>Democracy </li>  \t<li> Resources, Peace</li>  \t<li>Systemic capacity  </li>  \t<li>Wealth and inequality </li>  \t<li>Philosophical foundation of our civilization</li>  </ul>  <p>  \t    Holigent ® is a registered trademark • The Alliance to Retrofit America™ • Copyright © 2010, 2015  A. Nicholas Frank  </p>", 
    "end_date": null, 
    "title": "Holigent Solution: Building a Better Bridge to Our Future", 
    "price": 0, 
    "instructors": "Vanessa Finney, Nicholas Frank", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321660_7356_5.jpg", 
    "course_url": "https://www.udemy.com/the-holigent-solution/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T17:08:58Z"
}