{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Up until roughly 100 years ago, the government played very little role in the economy. &nbsp;It was generally believed that the economy worked best when directed by the autonomous forces of supply and demand. &nbsp;During the 18th and 19th Centuries, a consensus emerged on how the Capitalist economy worked; and that classical economic theory has been the foundation of economic teaching ever since.&nbsp;</p><p style=\"\">The economy no longer works the way it did during the 19th Century, however. &nbsp;Over the past 100 years the government&#039;s involvement in the economy has expanded so radically that the economic system itself has little left in common with Capitalism - at least, not at the Macro level. &nbsp;Yet Economics continues to be taught as if nothing has changed; and, for the most part, the public continues to believe that our economy is still driven by natural forces as it always was in the past. &nbsp;But that is very far from the truth. &nbsp;</p><p style=\"\">Today, the government manages - or directs - the economy using a variety of policy tools to ensure that Gross Domestic Product continues to expand. &nbsp;The implications of this fact are very far reaching. &nbsp;It is impossible to understand politics or economics in our era without grasping that the government is managing the economy. &nbsp;Moreover, it is particularly important that investors understand this new reality because government actions now impact the direction of asset prices far more than any other variable.</p><p style=\"\">This Course explains how the economy really works. &nbsp;</p>", 
    "end_date": null, 
    "title": "How The Economy Really Works", 
    "price": "50.00", 
    "instructors": "Richard Duncan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/70620_0c4b_5.jpg", 
    "course_url": "https://www.udemy.com/how-the-economy-really-works/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-28T03:29:08Z"
}