{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\"><p style=\"\">In this Psychological  Development course, you will learn how the past 50 years of research has informed  us about how we as human beings develop psychologically. That is; cognitively,  emotionally, and behaviorally. This course is designed for college students  studying the Psychology of Human Development as a supplement, for parents of  any ages, and for anyone who is interested Psychological Stages of  Development. It will cover the life period of Prenatal Development through  Adolescence. I teach this course at 2 universities, and it may be used for  transfer credit at some colleges and universities. See below.*</p>    <p style=\"\">This Psychological  Development course is about Human Development from the Prenatal to  Adolescent periods. At the end of this course, the student should be able to:  1.Identify the genetic factors that can influence an infant’s early  development. 2. Explain the various psychosocial and physical factors that can  influence development of the child. 3. Recognize a variety of developmental  theories. 4. Analyze the challenges to older developmental theories. 5. Learn  about what parts of theories and aspects of development have been verified in  the human development research over the past 50 years. 6. Recognize and  identify the relationship and continuity of developmental stages upon  succeeding ones.</p>    <p style=\"\">This is a self-paced  on-line course featuring 7 lectures on Psychological Stages of  Development featuring video textbook style lectures. The course will be  taught primarily through viewing (and reviewing) the 7 audio/video lectures on  Human Development, and reading the accompanying research summaries in the  Lecture/Supplemental Sections. There is a short quiz (10 questions – multiple  choice and/or true/false) after each lecture which will reinforce learning in  each Section. No additional materials are required unless you are taking this  class for college credit. See below.*</p>    <p style=\"\">Average time for completing  the course is 4 to 6 weeks.</p>    <p style=\"\">*Earning credit from MOOCS  (Massive Open Online Courses) is still under negotiation at most universities.  Currently Georgia State is accepting some MOOCS, and California is at work to  pass legislature to require universities to offer credit for MOOCS. You will  have lifetime access to this course and can request certification for taking  this class at anytime. If you are a student (or future student), and are  planning to take this course for credit, you will also need: Berk, L. (2010)  Development through the lifespan. (4th or 5th ed.) New York: Allyn and Bacon  (available at major on-line bookstores). You will also need to write 2 papers:  1.WHY IS SECURE ATTACHMENT SO IMPORTANT? 2. MY CHILD &amp; ADOLESCENT  DEVELOPMENTAL THEORY</p>    <p style=\"\">Directions and rubrics will  be sent to you in email on request of the Instructor of this course: Dr. Beth  Email: pbeth@charter.net Phone: 920-699-9150&nbsp;</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Human Development", 
    "price": "20.00", 
    "instructors": "Dr. Patti Beth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45125_fee3_6.jpg", 
    "course_url": "https://www.udemy.com/human-development-101/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-07T23:18:54Z"
}