{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t          Este curso pretende ser una <strong>introducción general a los derechos humanos internacionales</strong>, así como una <strong>visión general de algunos temas específicos del área.</strong>  </p>  <p>  \t          La primera mitad del curso consiste en: Una introducción a las nociones básicas de la ética pública, historia de los Derechos Humanos, instrumentos internacionales, categorías de derechos, violaciones de derechos humanos, la protección y la responsabilidad de los mismos.  </p>  <p>  \t          La segunda parte del curso trata de temas actuales en la agenda de los derechos humanos, tales como: Derechos de la mujer, derechos del niño, derechos de los pueblos indígenas, conflictos armados y el terrorismo, el medio ambiente, justicia transicional, y minorías sexuales, entre otros.  </p>  <p>  \t          El curso consta de 33 clases, cada una de unos 10 minutos, además de un quiz luego de cada clase para reforzar contenidos. Estimamos que para realizar el curso completo (ver todas las clases y responder todos los quizzes) se le debe dedicar unas 7 horas en total. El curso está hablado en inglés pero con subtítulos, cuestionarios y material adicional en español. No hay límite de tiempo para completarlo.  </p>  <p>  \t          Contamos con expertos de todo el mundo como profesores visitantes para algunas clases.  </p>", 
    "end_date": null, 
    "title": "Introducción a los Derechos Humanos", 
    "price": 0, 
    "instructors": "José Zalaquett, Juan Francisco Lobo", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334760_f803_4.jpg", 
    "course_url": "https://www.udemy.com/introduccion-a-los-derechos-humanos/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T12:52:07Z"
}