{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Finally I'm offering another free psychology course! My other free course, <em style=\"\">5 Amazing Psychology Experiments</em>, has more than 2000 students and 50 positive reviews.</p><p style=\"\">For ages, psychologists have wondered about the origins of thought and the structure of the mind. Using solid scientific methods and statistical analysis, we've started to get some answers.</p><p style=\"\">This course serves as a quick introduction to the fundamentals of social psychology. In this introductory course, you'll learn about three major areas of psychology:</p><p style=\"\">1. <strong style=\"\">Accessibility and Priming</strong><strong style=\"\">:</strong> How is the mind organized and how can our brains trick us into perceiving the world in biased ways? We cover the notion of a schema and look at several studies on the power of priming.</p><p style=\"\">2. <strong style=\"\">Heuristics and Biases</strong><strong style=\"\">:</strong> What are the shortcuts that are brain takes? Whenever we make a decision or form a judgment, we like to think we're being careful and rational, but our minds want quick answers. Sometimes, these shortcuts can lead us astray.</p><p style=\"\">3. <strong style=\"\">Attribution</strong><strong style=\"\">:</strong> When we see other people, we often wonder why they do the things they do. Are they responsible for their choices or do we think that they're subject to environmental pressures? Attribution theories try to make sense of it.</p><p style=\"\">In this series of lectures, you'll learn from a trained social psychologist and come to understand the essentials of social psychology. With quiz questions that reinforce your learning and examples that connect the research to your own life, this course is designed to help you quickly master this information. So enroll now and start learning about this fascinating field of social psychology!</p><p style=\"\">**Please note that this is one part of the full introduction to social psychology course (<em style=\"\">Be a People Expert with Social Psychology</em>) on Udemy. If you want to learn about psychology, and you're not ready to take the plunge for the full social psychology course, this is a great place to start!</p>", 
    "end_date": null, 
    "title": "Learn Social Psychology Fundamentals", 
    "price": 0, 
    "instructors": "Andrew Luttrell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544860_87b3_2.jpg", 
    "course_url": "https://www.udemy.com/learn-social-psychology-fundamentals/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T16:10:37Z"
}