{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Your life will change for the better once you better understand yourself and the people in your life. This course will teach you the ins and outs of human psychology in a fun and comprehensive guide to the mind.</p><p><strong>You'll Learn Psychology from Every Angle</strong><br></p><p>In this course, we cover five core areas of social psychology:</p><ol><li><strong>Thinking Socially</strong> - How we think about other people, make judgments, and explain others' behavior</li><li><strong>Thinking About Ourselves</strong> - How people come to know who they are, deal with information about themselves, and situate their self-concepts in the culture they've grown up</li><li><strong>Social Influence</strong> - How and when we conform to what other people think and do, how authority has such power, and the elements of effective persuasion</li><li><strong>Cognitive Dissonance</strong> - A classic topic in social psychology dealing with how people grapple with inconsistent beliefs</li><li><strong>Working with Othe</strong><strong>rs</strong> - How people deal with others in everyday interactions, including relationships, group decisions, aggression, and helping</li></ol><p>Through comprehensive videos, slide presentations, exercises, and quizzes, you will learn about the fascinating science of social psychology. This course is modeled on university curricula that <em>you could spend thousands of dollars on</em>. </p><p><strong>You'll Learn from an Expert</strong><br></p><p>This course was designed, top to bottom, by an <strong>experienced instructor</strong> who is an <em>expert </em>in the field of social psychology. The information is presented in an <strong>engaging, easy-to-understand format,</strong> and you will be able to connect these concepts to your everyday life. I'm also on call to answer any questions you have as you move through the course.</p><p>This course features more than 5 hours of video content, including helpful thought exercises, outside resources, and quizzes to keep you on track. </p><p><strong>It's Time to Change the Way You See People</strong><br></p><p>If you're interested in psychology, <em>this is the course for you</em>. If you are currently taking a social psychology class and want to see the same material from a different perspective, this is also the course for you! You're bound to come away with a new appreciation for for your social world after learning about the compelling research in this field of psychology.</p>", 
    "end_date": null, 
    "title": "Learn Social Psychology", 
    "price": "25.00", 
    "instructors": "Andrew Luttrell", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497736_5c54.jpg", 
    "course_url": "https://www.udemy.com/social-psychology/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T18:57:55Z"
}