{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t  Dear everybody! We’re starting a unique course in the psychology of people management. Available only at udemy! This course has been put together by psychology and neurolinguistic programming experts. Everything is presented as simply as possible. In our course you’ll learn how to manage people secretly. We’ll teach you the keys to the human soul, you’ll learn different types of human needs, we’ll talk about specific ways to influence people, how to use human foibles, the peculiarities of the psyche, and you’ll get to know all the secret management techniques, as well as how to protect yourself from manipulation!  </p>  <p>  \t  Everyone feels other people&#039;s influence upon themselves and, in their turn, tries to influence other people. Unfortunately, not everybody is gifted with the ability of handling people and a situation. So how can a person persuade anybody to do anything? Have you ever thought about it? There is only one way which is to make another person want to do it. Actually, hidden manipulation is no more than an acquired skill.  </p>  <p>  \t  The techniques of people management have long been studied by science, but the results and the methods have always been hidden... till now! Now we’re sharing all the secrets! You’ll learn how to use secret management in your everyday life, particularly:  </p>  <p>  \t  ·at work for communication and in negotiating with administration, subordinates or clients!  </p>  <ul>  \t<li>effecting sales – secret customer management for successful sales!</li>  \t<li>manipulation at home – do you want everything a certain way but don’t want the conflict? OK!</li>  </ul>  <ul>  \t<li>secret manipulation of your children or students!</li>  \t<li>secret manipulation in politics – brilliant methods!</li>  \t<li>using secret management to advertise your goods and services!</li>  </ul>  <p>  \t  Moreover, we know how to teach you that! We’ll upload materials step by step for you to master the skills in a comfortable way.  </p>  <p>  \t  Are you interested? Join the course right now!  </p>", 
    "end_date": null, 
    "title": "Learn Methods of Hidden Manipulation and Human Management", 
    "price": "20.00", 
    "instructors": "Victoria Chevela", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270098_1e84_2.jpg", 
    "course_url": "https://www.udemy.com/the-secrets-of-hidden-manipulation/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-28T10:27:35Z"
}