{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><em>The views expressed in this course are the instructor's alone and do not reflect the official position of the U.S. Government, the Intelligence Community, or the Department of Defense.</em></p>\n\n<p>Although anyone can claim the title of “intelligence analyst,” there are currently few commonly understood, standardized certifications available to confirm analytic skill and proficiency. Some may argue that each analytic assessment should be judged on its content and not on the certification or reputation of the author. However, an analytic product can often read well even though its analytic underpinnings are flawed. Also, it would be beneficial to have some objective measure of an analyst’s skill before selecting him for a task, rather than to discover afterwards that the analyst was unable to meet the task. Having addressed why certifications are needed and assuming certifications would provide a worthwhile benefit, the discussion then turns to how and in what areas should one attain certification. Through an analysis of the concept of analysis, the author proposes that three basic divisions should be created to train and certify one as either a descriptive, explanative, or predictive analyst. This course provides level 1 certification as a descriptive intelligence analyst.<br></p>\n\n<p>\n\n</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Level 1 Intelligence Analyst Certification", 
    "price": "25.00", 
    "instructors": "Robert Folker", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/832750_efb1_7.jpg", 
    "course_url": "https://www.udemy.com/level-1-intelligence-analyst-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-26T19:27:34Z"
}