{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Get very personal insights into how a young couple, newly married in 1943, dealt with decisions to enlist, to marry, to find housing, and to stay connected with an ocean in between them while World War 2 was raging.<br></p>\n\n<p>In this documentary-style course, you're treated to approximately two hours of video in which Vickie Maris, instructor, interviews her 93-year-old mom, Lucille Maris, about life as a young bride during World War 2 in the 1940s. Lucille's husband, Jim Maris, was a pilot of B-24 bombers who flew out Wendling, England in 1944.</p>\n\n<p>You'll also get to view presentations of photos, drawings, receipts, letters and other memorabilia that were archived by the couple during the war years. These are included as a slide show at the beginning of each section.</p>\n\n<p><strong>Student Testimonial Shared on Facebook</strong><br><em>\"This is a must-see. Vickie Maris, you have done a fabulous job of bringing this time period to life. I hope this inspires others to do the same. I fear we are losing previous generations' legacies as our elders pass on and take all the story telling with them. As I listened to your mother's stories, I kept thinking ... your dad sounded like a great husband and a great dad.\" L. Isenstadt</em></p>\n\n<p>This journey spans from Lucille's early life on an Illinois farm to the time in the late 1930s when she was dating Jim and taking her first flight in a plane with him. Next is the decision to enlist in the US Army Air Corps, and the young couple's decision to marry. The content focuses on the perspective of this aviator's bride, but you will also learn, via the photos in the slide decks and stories told by Vickie, of the pilot's experiences as he was in training and combat.</p>\n\n<p>Travel with them as they move from base to base during Jim's flight training, and then learn about Lucille's memories of saying goodbye to her young husband as he waved the wings of his B-24 to her as she stood atop the roof of the Hotel Jayhawk in Topeka, Kansas. </p>\n\n<p>The course includes photos and stories from Jim's life on base with the 392nd Bomb Group of the 578th Bombardment Squadron. He flew 30 missions out of England, his second being D-Day. Look at memorabilia from his time on a tow target base where he flew A-20s and other aircraft that towed targets for fighter pilots to use for in-air shooting practice.</p>\n\n<p>Jim Maris was a life-long pilot and educator. After 23 years of service in the US Air Force, he completed his career with 30 years of service at Purdue University. You'll hear Vickie and Lucille talk about his time at the university where he was called in to establish the department now known as the School of Aviation Technology. </p>\n\n<p>Come along for this journey through history of the USA home front and life on base in England as the lives of these 1943 newlyweds unfold from one course lecture to the next.</p>\n\n<p>To supplement the course, Vickie has been interviewing Lucille on Periscope to respond in more detail to the questions students are asking in the course. You can catch them on an upcoming Periscope broadcast. Just search on Vickie's name in Periscope and then follow Vickie to be notified of upcoming broadcasts.</p><p>Join the over 1000 students who have already enrolled in one of Vickie's Udemy courses.</p>", 
    "end_date": null, 
    "title": "Life of a Pilot's Wife During World War 2", 
    "price": "20.00", 
    "instructors": "Vickie Maris", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529476_32eb_2.jpg", 
    "course_url": "https://www.udemy.com/ww2-home-front/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T13:43:23Z"
}