{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">MACRO WATCH</strong>  </p>  <p style=\"\">  \t The nature of our economic system changed in 1968 when the United States stopped backing dollars with gold.  </p>  <p style=\"\">  \t In this new age of fiat money, credit growth drives economic growth, liquidity determines the direction of asset prices and the government controls both through aggressive policy intervention.  </p>  <p style=\"\">  \t <strong style=\"\">Macro Watch</strong> analyzes trends in credit growth, liquidity and government policy with the goal of anticipating economic developments and their impact on the financial markets.  </p>  <p style=\"\">  \t Richard Duncan, the course instructor, intends to publish four issues of <strong style=\"\">Macro Watch</strong> a year.  Each issue will contain original analysis pertaining to economic and financial developments as they unfold.  Each issue will be sold separately.  </p>  <p style=\"\">  \t <strong style=\"\">Macro Watch Fourth Quarter 2013</strong> is this first in this series.  It is comprised of five lectures and is over one hour in length.  </p>  <p style=\"\">  \t Lecture One considers the sources of the fundamental weakness in the US economy that have made Quantitative Easing necessary.  </p>  <p style=\"\">  \t Lecture Two explains why credit growth is likely to remain too weak to drive economic growth over the next few years.  </p>  <p style=\"\">  \t Lecture Three introduces the concept of Liquidity and looks at the impact that foreign-generated liquidity has on asset prices in the United States.  </p>  <p style=\"\">  \t Lecture Four addresses Quantitative Easing, the second major source of Liquidity, and uses scenario analysis to estimate how much QE will be required in 2014 and 2015 to make the economy grow.  </p>  <p style=\"\">  \t Lecture Five discusses the prospects for asset prices in light of the analysis presented in the preceding lectures.  </p>", 
    "end_date": null, 
    "title": "Macro Watch: Fourth Quarter 2013", 
    "price": "50.00", 
    "instructors": "Richard Duncan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/90860_e6c2_6.jpg", 
    "course_url": "https://www.udemy.com/macro-watch-third-quarter-2013/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-11T05:29:12Z"
}