{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t            O curso Mandalas e seu uso terapêutico é uma introdução ao universo da técnica terapêutica com mandalas, e tem como base o trabalho do psicanalista Carl Gustav Jung.  </p>  <p>  \t            Atualmente muitos profissionais de diversas áreas utilizam mandalas com fins terapêuticos, porém algumas vezes, desconhecem todo o seu potencial de cura e equilíbrio interior.  </p>  <p>  \t            Professores, terapeutas holísticos e outros profissionais da Área da Saúde e Educação utilizam mandalas, algumas vezes conjuntamente com outras técnicas, relatando diversos benefícios, entre eles: maior equilíbrio psíquico; melhoria nos relacionamentos interpessoais, comunicação e aprendizado; sensação de bem-estar, relaxamento e paz interior.  </p>  <p>  \t            Neste curso, você conhecerá as potencialidades desta técnica terapêutica.  </p>  <ul>  \t<li><span>Os usos mais comuns de mandalas, e efeitos terapêuticos percebidos em sua utilização.</span></li>  \t<li>Conhecerá também um pouco mais sobre o trabalho do mandalaterapeuta, assim como as posturas e as atitudes necessárias para utilizar a técnica de mandalas.</li>  \t<li>Aprenderá quais são os aspectos que devem ser observados para a realização da análise e interpretação de mandalas, assim como o significado psicológico atribuído em relação às cores, às formas, aos traços, aos números, aos símbolos, a localização do desenho no espaço disponível e a simetria em mandalas.</li>  \t<li>Descobrirá os cuidados que devem ser observados em sua utilização.</li>  \t<li><strong>Estrutura do curso:</strong>·As aulas foram elaboradas em diversos materiais para servir como suporte ao aprendizado do aluno: vídeos, slides, textos, material de estudo para download, testes e exercício de interpretação.</li>  \t<li><strong>Carga horária: </strong> 19 aulas com a duração de mais de 3 (três) horas de conteúdo.</li>  \t<li>  \t<p>  \t\t      Inscreva-se em nosso curso e descubra você também como utilizar mandalas para seu autoconhecimento!  \t</p>  \t</li>  </ul>", 
    "end_date": null, 
    "title": "Mandalas e seu uso terapêutico", 
    "price": "25.00", 
    "instructors": "Virgínia Fernandes", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/182790_d762_2.jpg", 
    "course_url": "https://www.udemy.com/mandalas-e-seu-uso-terapeutico/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-14T21:03:17Z"
}