{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">&quot;Mental Health Disorders in Infancy &amp; Early Childhood was an excellent course! The instructor was very engaging, and clearly is an expert on this subject. I learned many things I didn&#039;t previously know, and would highly recommend this course to anyone interested in learning more on this very important topic.&quot;</em></strong></p><p style=\"\"><strong style=\"\"><em style=\"\">&quot;The content of the the course is very informative and the grouping of lectures well done. The instructor is well prepared and the brevity of each lecture makes you want to go the next lecture. I think this course can be useful to most anyone; everyone has contact with a young child at some level: parent, grandparent, aunt, uncle, teacher, babysitter&quot; </em></strong></p><p style=\"\">Infant and early childhood mental health is a serious public health issue. Research illustrates the critical importance of early intervention in helping children to reach their potential and thrive.  By developing your knowledge of this topic, you will be helping to spread awareness and understanding of the challenges facing our nation&#039;s youngest citizens.</p>  <p style=\"\">  \t  Join over 300 other students who are benefitting from the material provided in this course.  By taking this course, you will receive:  </p>  <p style=\"\">  \t    * Lifetime access to high quality updated content  </p>  <p style=\"\">  \t    * Over 17 BRAND NEW lectures added in January 2015!  </p>  <p style=\"\">  \t      * Knowledge about common mental health disorders in infancy and early childhood  </p>  <p style=\"\">  \t  * The ability to recognize common symptoms of mental health disorders in early childhood  </p>  <p style=\"\">  \t  * Information about appropriate evidence-based practices for early childhood  </p>  <p style=\"\">  \t  *Adverse Childhood Experiences (ACES) study statistics and the implications for health and well-being throughout the lifespan  </p>  <p style=\"\">  \t  *An overview of early brain development and the importance of early experiences  </p>  <p style=\"\">  \t  *Concrete tools for building resilience in children  </p>  <p style=\"\">  \t  This class consists of video lectures and supplemental PDF files.  Quizzes are included to strengthen your learning and increase your retention of course materials.  </p>  <p style=\"\">  \t  This class is geared toward professionals or students working with young children.  This class is also intended to be taken by parents with young children.  However, the material in this course is suitable for and applies to everyone who has ever had or will ever have any contact with kids.  In other words, everyone! Increased awareness of the mental health challenges facing our nation&#039;s children is the first step in reversing this dangerous trend.  </p>", 
    "end_date": null, 
    "title": "Mental Health Disorders in Infancy and Early Childhood  ", 
    "price": "20.00", 
    "instructors": "Mary Allison Brown", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/272056_4ded_2.jpg", 
    "course_url": "https://www.udemy.com/mental-health-disorders-in-infancy-and-early-childhood/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-31T04:17:00Z"
}