{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Welcome to my course on basics of microeconomics : Behavior of Buyers and Sellers</p>\n\n<p>In this course, I will take you through the heart of Economics - Demand and Supply Mechanism (Determined by Buyers and Sellers ) and we will discuss the following topics : </p>\n\n<p>What is Demand?<br>Do you demand less when the price of a commodity rises.? Yes..? Think again..!<br>Is your Demand only a function of price?<br>What is supply?<br>What affects supply of a good in the market?<br>We, as buyers, want to pay as low a price as possible; sellers, on the other hand, want to charge as high a price as possible, seems like there  are opposite interests here, then who gets to decide the price?<br>How does this price mechanism function?</p>\n\n<p>This course is not only for the students of Economics but for anyone who has an interest in understanding this powerful mechanism of Demand and Supply. </p>\n\n<p>This course has 18 lectures and 1 hour of content.<br><br>It is a beginner level course and all the topics and concepts start from scratch, so even if you are not familiar with Economics , you may take this as your first step to understand this powerful subject.   <br></p>\n\n<p>All that said, if you would like to discuss something while you are learning, please feel free to start a discussion or PM me.</p>\n\n<p>Lets get started..!</p>", 
    "end_date": null, 
    "title": "Microeconomics : Behavior of Buyers and Sellers", 
    "price": 0, 
    "instructors": "Shubham Kalra", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737722_cffc_2.jpg", 
    "course_url": "https://www.udemy.com/economics-behavior-of-buyers-and-sellers/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T10:39:34Z"
}