{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Sunni or Sushi, Hamas or Hummus? The Middle East is a confusing place. Enemies are now friends and new radical groups seem to appear daily. The Middle East 101 course provides the means to understand in a quick and straight forward manner the challenges facing the region. Literally become an expert over night</p><p style=\"\"><strong style=\"\">Take a semester course in just over an hour and become an expert in Middle East Politics.</strong></p><p style=\"\">Participating in the course will enable you to converse intelligently whether in business or with journalists or friends. It&#039;s like taking a university semester course overnight!</p><p style=\"\">Iran,ISIS, Hamas, Israel, understand the Middle East Crisis in one straight forward course.</p><ul style=\"\"><li>Recognize how the invasion of Iraq lead to the inevitable rise of ISIS.</li><li>Discover why the Palestinian Israel conflict is becoming more violent.</li><li>Understand why the Obama Iran nuclear agreement is so far reaching.</li></ul><p style=\"\">Become an expert in the Middle East overnight.</p><p style=\"\"><strong style=\"\">Answer questions on the Middle East like an expert and win every discussion.</strong></p><p style=\"\">The course is uniquely easy to follow. I designed it for people who need to be in the know but only have a short amount of time to spare studying. </p><p style=\"\">It&#039;s  &quot;give it to me on a plate&quot; approach is original and fresh. It provides a big picture view rather than intricate history. Not everybody needs to be a historian, but everybody needs to be in the know. The course can be studied at different levels. You can also choose how much time to invest in taking the course.</p><p style=\"\">Be  introduced to major historical factors that created the political reality of today. These include the colonial legacy of the British,Turkish and French and the implosion of a region that was artificially created by the Sykes Picot agreement. The course then proceeds to examine some of the major political factors and players in the region. These include ISIS, Hamas, Iran Israel/Palestine, Iraq and Syria<br style=\"\"></p><p style=\"\"><strong style=\"\">The course is updated as events unfold. Once joined, you have a ticket for a life time.</strong></p><p style=\"\">I can promise you, the need for a course that will explain politics in a simple and easy to understand fashion has never more urgent.</p><p style=\"\">Politics may not be your primary interest, but I am sure succeeding in business, socially or job interviews is. In such a competitive world talking intelligently about major issues is no longer an option. </p><p style=\"\">Let me show you how.</p><p style=\"\">The Middle East 101 course is intended for anybody who needs to &#039;talk politics&quot; with knowledge whether socially or professionally.<br style=\"\"></p><p style=\"\">Packed with live interviews, maps and videoed classes you will be able to work alongside a leading expert in the field. Even more incredibly you will receive a verifiable certificate of completion upon finishing the course and knowledge to beat the competition and succeed in every interview.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Middle East 101. Become an expert overnight.", 
    "price": "45.00", 
    "instructors": "Neil Lazarus", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467556_3b0d.jpg", 
    "course_url": "https://www.udemy.com/middle-east-101-become-an-expert-overnight/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T19:06:43Z"
}