{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Most of us enjoying thinking about the possibilities of outer space travel. Yet, understanding astronautics seems hard, but it doesn't have to be. Thinkers, researchers and people who want to be involved something cutting-edge related to space can understand the processes involved with outer space development. The New Trends in Outer Space Development course is designed to enable any person to advance their knowledge about current emerging trends in astronautics.<br></p><p>The information detailed in the course content can be used as a step by step guide towards deepening one's understanding of key phenomena currently in place for those who just want to know more about this stuff. Or, this course can be used for those who want to learn about outer space development and share this knowledge with others. It can be viewed with a few hours, or it can be digested over time. Whether you are a space fanatic, or you are actively trying to figure out how you can get involved in some aspect of outer space development, this course provides important information that will enable you to understand key activities in outer space. The course will also for people who just love learning about things. </p><p>The course contains over 1.5 hours of video presentation content and 8 lectures on topics including a historical overview of space, space telescopes, asteroid mining, spaceports, spaceships, habitats and international space law. The course is distinct in that it allows any person to gain a mastery over a wide ranged blend of subjects including astronautics, international space law, business trends and high technology, politics and history. The course was created by a university professor who is also an author and leading international relations and space law scholar.</p><p>This course provides information and knowledge of key concepts to enable you to build seeds of knowledge within yourself. After completing the course, you will be in a position to <strong>become conversant enough to manage discussions about key facts and data related to spaceship trends, space law, asteroid mining, space habitats, space travel and space missions.</strong> The goal of providing this course is to enable you to be in a position to share the knowledge gained from the course with others. The course is <strong>for any person, irrespective of educational or professional background or age.</strong></p><p>Upon completion, students can contact instructor to become credentialed as a certified as an OuterSpaceDevelopment coach.</p>", 
    "end_date": null, 
    "title": "New Trends in Outer Space Development", 
    "price": "20.00", 
    "instructors": "Edythe Weeks", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577554_789f_7.jpg", 
    "course_url": "https://www.udemy.com/new-trends-in-outer-space-development/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T18:30:42Z"
}