{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>\"Nuclear South Asia: An Analyst's Guide to India, Pakistan, and the Bomb,\" the Stimson\nCenter’s inaugural open online course, seeks\nto provide an interactive and dynamic space where strategic analysts\ncan study and debate nuclear issues in South Asia. The course consists of filmed interviews with over 60 analysts,\nscholars, and former government officials from India, Pakistan, and the United States.</p>\n\n<p>This course addresses: key nuclear debates, nuclear history\nin South Asia, contemporary policy and posture, South Asia in the global\nnuclear order, nuclear crises, nuclear risk reduction measures, and South\nAsia's nuclear future.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course consists of seven sections. Each section\nincludes: lectures, special features, and reading material. The lectures are meant to provide participants with\nimportant background into the key\nissues facing nuclear South Asia. The special features are short clips where\nexperts share unique insights on specific subjects, such as the 1998\nIndia-Pakistan nuclear tests and the 1999 Kargil crisis. Participants also have access to Stimson publications and other suggested readings so that they\ncan explore these topics in greater depth.</p>\n\n\n\n\n\n\n\n<p>By the end of the course, our hope is that students will have a\ngreater appreciation for the many different perspectives on the challenges\nfacing nuclear South Asia—and the\nimportance of this issue for regional and international security. Students should leave this course with the ability to think critically about nuclear issues in\nSouth Asia, debate other analysts, scholars, and decisionmakers, and advance\npolicies that enhance nuclear deterrence and stability on the subcontinent. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Nuclear South Asia", 
    "price": 0, 
    "instructors": "Shane Mason, Travis Wheeler, Dr. Sameer Lalwani, Michael Krepon", 
    "commitment": null, 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/852254_e599_4.jpg", 
    "course_url": "https://www.udemy.com/nuclear-south-asia/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-17T18:51:34Z"
}