{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t                  If you want to better understand human behavior and the economic consequences of it, or if you want to take more control of decisions in your own life, you should have a solid understanding of economics.  </p>  <p>  \t                         Human beings are not robots or mindless automatons, and thus our behaviors cannot be predicted with mathematical formulas, so methods of physical sciences are not appropriate to explain human activity. That is why your previous economic study was probably meaningless to you and why you might run away from this subject like a building on fire.  </p>  <p>  \t                         In contrast, <strong style=\"\">Austrian economics fits nicely with common sense and the reality of everyday human behavior</strong> on the ground, and it is easy for the average person to understand. Conventional economics deals much more in the abstract and artificial, and only is meaningful to advanced practitioners. If economics is the study of human behavior, what kind of economics can’t be understood by the average person?  </p>  <p>  \t                         Correct choices taken in the real world are important to your well-being, and <strong style=\"\">when you finally understand proper economic principles, the world will make more sense to you</strong> in an exhilarating way. You will see things more clearly and think more independently.  </p>  <p>  \t                    In these times, economic understanding is more important than ever and knowing how things really work is priceless. That&#039;s why this course is packed with value.  </p>  <p>  \t              It features 30 video lessons of 5-8 minutes, <strong style=\"\">presented in compelling and informative visual style</strong>. You can finish the course material in about 3 hours, and at the end there is a comprehensive and challenging quiz (100 questions) to test your grasp of the material.  </p>  <p>  \t              The instructor welcomes questions and feedback from students.  </p>", 
    "end_date": null, 
    "title": "Of Markets & Men:A Visual Introduction to Austrian Economics", 
    "price": "25.00", 
    "instructors": "Fast Uptake", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189812_715c_3.jpg", 
    "course_url": "https://www.udemy.com/of-markets-and-men-visual-introduction-to-austrian-economics/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-27T17:18:12Z"
}