{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Through this course, students will learn how to use OpenSesame, an open source, experiment building software for the social sciences. OpenSesame allows you to easily create experiments, using a graphical interface, as well as add audiovisual elements to develop more complex experiments. OpenSesame also enables you to run multiple trials of your experiments with minimum effort and it also helps to manage and record data. This course aims at teaching students how to operate this useful software. Enrolled students can expect to gain a comprehensive understanding of the various features and functions of this software, such as adding audiovisual stimuli and incorporating feedback given to participants, as well as an opportunity to create an experiment, using these different elements. This course will take ? hours to complete, (including one contact hour with the course instructor after completion of the workshop.)? The course is divided into ? broad sections, which include ? lectures and ? quizzes. An understanding of this software is important because OpenSesame is applicable to varied disciplines and is indispensible to experiment designing for a contemporary researcher. OpenSesame also makes the process of conducting experiments easier because it allows the calculation of accurate reaction times and other dependant variables as well as automatically saves and arranges data in the form of easy-to-view tables for each trial. Moreover, the comprehensive nature of this course ensures that its participants will not only be able to understand, but also apply the course content. Therefore, by taking this course, students and professionals will be armed with a powerful research tool. </p><p>(For those studying at the University of Mumbai and or its affiliated colleges (Mithibai and National College), knowledge of OpenSesame is mandatory for the MA Psychology course at these institutes.)</p>", 
    "end_date": null, 
    "title": "OpenSesame: The Experiment Building Software", 
    "price": "20.00", 
    "instructors": "Monk Prayogshala", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364512_c3fd_2.jpg", 
    "course_url": "https://www.udemy.com/opensesame-the-experiment-building-software/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T08:19:08Z"
}