{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">Conceptualmente, la Ordenación Territorial es la Construcción planificada del Sistema Territorial a largo plazo<sup style=\"\"><sup style=\"\">[1]</sup></sup>.</p><p style=\"\">Se trata de una función de la Administración Pública, de carácter integral, que corta horizontalmente a todas las componentes del Sistema Territorial, orientada a conseguir el desarrollo sostenible de la sociedad mediante la previsión de sistemas territoriales armónicos, funcionales y equilibrados capaces de proporcionar a la población un marco satisfactorio para la calidad de vida.</p><p style=\"\">La Ordenación Territorial se hace operativa a través de un sistema coherente de planes, previstos en legislación específica y no específica, que se ejecutan en ciclos sucesivos de tres fases: Diagnóstico, Planificación y Gestión, cuyo impulso, elaboración, aprobación y aplicación corresponde a la Administración Pública, e implica la aproximación científico técnica, la participación pública y la concertación de los agentes socioeconómicos.</p><p style=\"\">En términos más directos, la Ordenación Territorial consiste en elaborar los planes previstos en la legislación y en ejecutarlos después, según un proceso, cíclico, continuo e iterativo, de diagnóstico, planificación y gestión.</p><p style=\"\">Y según lo dicho, cada plan identifica, distribuye, organiza y regula las actividades humanas, vehículo del desarrollo, en el territorio de acuerdo con ciertos criterios y prioridades para configurar un sistema armónico, funcional, bello y perdurable.</p><p style=\"\">Las reflexiones anteriores justifican el interés intelectual y, por tanto, formativo que tiene la Ordenación Territorial, pero, sobre todo, su papel como metodología para planificar el desarrollo sostenible, en lo económico, lo social y lo ambiental; y, lo que es más importante, orientado a la calidad de vida de la población.</p><p style=\"\">Asimismo, la Ordenación Territorial se interpreta en la actualidad como uno de los principales instrumentos de gestión ambiental, porque los conflictos e impactos ambientales son indisociables de la identificación, localización y regulación de las actividades, y éste es el objetivo básico de esta disciplina.</p> El curso que se presenta incorpora la conceptualización de la Ordenación Territorial, los instrumentos legales que la hacen operativa, la metodología y las técnicas para dar respuesta solvente a este interesante campo de conocimiento. <p style=\"\"><br style=\"\"> </p><hr style=\"\"> <div style=\"\"> <p style=\"\">[1] La idea anterior es aplicable en general a los instrumentos clásicos de planificación del desarrollo: <em style=\"\">Políticas, Planes, Programas y Proyectos,</em> que se pueden entender (con distinto alcance y extensión espacial) así: Evolución planificada de un sistema o Conducción planificada de la evolución de un sistema o Conducción planificada de un sistema hacia un futuro definido en un horizonte temporal o indefinido. <em style=\"\">Conducir</em>: gobernar la forma en que evoluciona un sistema. <em style=\"\">Planificar:</em> definir un curso de acción hacia el futuro. <em style=\"\">Sistema:</em> “entidad” o “unidad” formada por un conjunto de elementos en interacción dinámica, caracterizada por una estructura, un funcionamiento, una imagen y una evolución.</p></div>", 
    "end_date": null, 
    "title": "Ordenación Territorial", 
    "price": "50.00", 
    "instructors": "ITEPAS ITEPAS Instituto de Territorio, Paisaje, Ambiente, y Sostenibilidad", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482008_d9c5_3.jpg", 
    "course_url": "https://www.udemy.com/ordenacion-territorial/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T10:24:24Z"
}