{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t  Do you know how to write a research proposal and get funds or scholarship? Are you familiar with all the research tools developed by researchers and institutions? Can you use them to your benefit? In this outstanding free package all the tools and concepts covered in our courses are introduced. Moreover, you are provided with a unique and one of a kind video tutorial about writing successful academic proposals from a to z.  </p>  <p style=\"\">  \t  There are various tools developed by well-known institutes throughout the academic world to help improve the quality of research. These sets of tools are developed with great effort by elites in order to aid in researchers and using them in systematic ways leads to a valuable and high quality research project. And now we have gathered all these tools in our famous Research Tools box which currently contains more than 720 tools classified into 4 main categories: Literature-Review, Writing a Paper, Targeting Suitable Journals, and Enhancing Visibility and Impact Factor.  </p>  <p style=\"\">  \t  Plus, you are provided with a full course on writing academic research proposals. This course will expand your knowledge of the relevant research tools that can be used effectively for preparing your thesis and/or dissertation. You will also gain information on how look for relevant journal articles using keyword search, avoid plagiarism, and write journal articles and conference papers. You will also become familiar with terminologies such as H-index, high impact factor, ISI, WoS and learn the various approaches that could be used to facilitate the process of your research study.  </p>  <p style=\"\">  \tTCFEX &#039;s Research Department  </p>", 
    "end_date": null, 
    "title": "Overview of Research Tools & Writing a research proposal", 
    "price": 0, 
    "instructors": "TCFEX LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341164_cb59_4.jpg", 
    "course_url": "https://www.udemy.com/write-research-paper-and-thesis-with-research-tools-box/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T06:54:45Z"
}