{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Learn the three myths about violence that are being used to fuel the world’s current state of perpetual war, and be able to explain the transformative dynamics of People Power and Nonviolent Conflict to your peers, friends, and constituents. \n\n  </p>\n\n\n\n\n\n<p><strong>Understand How Civil Resistance Can Conquer Violent Oppression</strong>\n\n  </p>\n\n\n\n\n\n\n\n<p>Learn the terms, misconceptions, and assumptions about Nonviolent Conflict.\n\n  </p>\n\n\n\n\n\n<p>Understand the critiques and concerns about using Civil Resistance against a ruthless opponent.\n\n  </p>\n\n\n\n\n\n<p>Know the historical lineage Nonviolent Action and today’s community of scholars and activists.\n\n  </p>\n\n\n\n\n\n<p>Explain the theories, debates, and dynamics of People Power.\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>Gain the Knowledge Needed to Transform Your World </strong>\n\n  </p>\n\n\n\n\n\n<p>Nonviolent Conflict is the third, distinct, way the people can exercise their right to self-rule. \n\n  </p>\n\n\n\n\n\n<p>By it’s very nature it generates the massive public involvement required for healthy democratic societies.\n\n  </p>\n\n\n\n\n\n<p>When a country’s normal legislative channels no longer work, and a violent insurgency is not acceptable, Civil Resistance becomes the most powerful tool the people have to overcome oppression and transform their societies.\n\n  </p>\n\n\n\n\n\n<p>Using People Power and Nonviolent Action to counter violent oppression results in freer more democratic societies, a better chance of reconciliation between parties, and less chance of civil war.\n\n  </p>\n\n\n\n\n\n\n\n<p><strong>Content and Overview</strong>\n\n  </p>\n\n\n\n\n\n<p>This course offers a concise introduction to Nonviolent Conflict: the use of People Power, Civil Resistance, and Nonviolent Action to guarantee the people’s right to participate in how they are governed.\n\n  </p>\n\n\n\n\n\n<p>The material is designed for students, activists, and policy makers looking for nonviolent ways to meet the national and global challenges that are today increasing the conflict in our world.</p><p>The course begins by exposing the three myths being used to keep our world at war, and gives the student an overview of how nonviolent methods can be used to bring forth a freer, more compassionate, and more sustainable world system.</p>\n\n\n\n\n\n<p>After completing this course the student will be able to, 1) see through the many misconceptions and assumptions about nonviolent methods; 2) identify and counter the popular myths most people believe about war and violence; 3) understand the history, dynamics, and debates about People Power, and 4) explain to their peers, friends, and constituents the dynamic transformative power of Civil Resistance to bring forth a freer, more compassionate, and more sustainable world system. </p>", 
    "end_date": null, 
    "title": "People Power, Civil Resistance, and Social Transformation", 
    "price": "25.00", 
    "instructors": "Dr. Robert Kezer", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790126_b782_2.jpg", 
    "course_url": "https://www.udemy.com/people-power-civil-resistance-and-social-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T21:14:48Z"
}