{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong style=\"\"></strong><strong style=\"\">Benefits</strong></p><p>Benefit from actual course content used in online and face-to-face learning in accredited social work programs. Gain an understanding of the historical origins, salary projections, education, and licensure for the social work profession. Gain empathy for professional social work and insight about the case management and counseling skills offered by the profession.</p><p><strong style=\"\">What&#039;s Covered</strong></p><p>The course begins with frequently asked questions. It then covers the </p><ul style=\"\"><li>Historical Origins of the Profession, </li><li>Social Work Code of Ethics, </li><li>Educational Core Competencies, </li><li>Education Process and Duration, </li><li>Laws &amp; Licensing Requirements, and </li><li>Major Social Work Organizations. </li></ul><p>The content provides a solid basis for understanding the profession as it developed over time.</p><p><strong style=\"\">Skills that will be gained</strong></p><ul style=\"\"><li>Distinguish between social work and other helping professions.</li><li>Trace the history of social work as a profession.</li><li>Articulate the components of the social work code of ethics.</li><li>Map the requirements and opportunities of education for a career in social work.</li><li>Identify educational, legal, and organizational supports for the social work profession.</li></ul><p>If you are new to social work and just casually interested, you will gain<strong style=\"\"> insight </strong>into the value of the profession and the difference between social work and other helping professions.</p><p>If you are new to social work and are thinking of making it a career, you will gain salary information, education<strong style=\"\"> requirements</strong>, and a view of the typical career trajectory.</p><p>If you know social work already, you will benefit from<strong style=\"\"> learning</strong> origin elements, ethics training, and insight on professional organizations that you often wondered about. </p><p><strong style=\"\">Features of the Course</strong></p><p>This course is presented by a 16 year veteran social work professor. It features a basis in the science of the social work profession leading to a systematic view of professional practice. The course also presents exclusive illustrations you will only see in MAWMedia productions. Gain access to the course an the e-book version of the Introduction to Social Work text, Book 1 of 2.</p><p><strong style=\"\">Ideal Student</strong></p><p>You are the ideal student if you want a complete and thorough introduction to the profession of social work. If you are thinking about a career change or just starting out, this introduction can help. You may be evaluating multiple options. The content here will help you distinguish social work from other disciplines like sociology and psychology. </p><p>Note: Cover image by David Castillo Dominici</p>", 
    "end_date": null, 
    "title": "Professional Social Work in the United States", 
    "price": "20.00", 
    "instructors": "MAWMedia Group, LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576962_eacd.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-social-work-profession-practice/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T23:41:02Z"
}