{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong><em>**UPDATE: I just added 3 NEW BONUS VIDEOS to expand on and discuss some of the core experiments.</em></strong></p><p>If you've ever wanted a quick and easy way to know more about people and psychology,<strong> this is the course for you! </strong>More than <strong><em>11</em></strong><em><strong>,000</strong></em><strong> </strong>people have enrolled in my online psychology courses to learn more about the human mind and social behavior. You can be one of them!</p><p>Although you could read dense textbooks on psychological research, this <em>simple </em>and <em>engaging </em>course will give you quick access to some of the most interesting and unique studies in psychology.</p><p>When you finish this course, you'll have a new appreciation for human behavior, persuasion, and influence, and you'll quickly be able to <strong>impress your friends and family</strong> with your surprising knowledge of human psychology. Not only that, but you'll know exactly what science behind those findings was!</p><p>The studies in this course reveal…</p><ul><li>how we can <strong>persuade </strong>someone to do what we want<strong> </strong><strong>without even providing good persuasive reasons</strong></li><li>why people started to <strong>walk more slowly</strong> after solving a few word puzzles</li><li>why men were more <strong>attracted </strong>to a woman when they stood on a <strong>terrifying bridge</strong></li><li>why praising some kids for their intelligence vs. their hard work<strong> dramatically changed their test scores</strong></li><li>why people who held <strong>a hot cup of coffee</strong> instead of an iced coffee automatically started thinking a stranger was especially <em>generous </em>and <em>caring</em></li><li><em>…and much more!</em></li></ul><p>Carefully designed experiments tell us a great deal about the choices we make, the ways we behave, and why we think the way we do. Throughout this course, you'll learn about a bunch of these experiments and see exactly what they say about yourself and the people you meet every day.</p><p><strong>I'm a social psychologist </strong>myself, and I thought about which studies most interested me early in my education and which studies are my current favorites. I even reached out to my colleagues to ask them what studies have most inspired them and are important for everyone to know about.</p><p>This could be the beginning of your new-found interest in psychology. After taking my classes, many of my students have begun pursuing psychology themselves! But even if you just want an easy introduction to psychology, you'll want to check out these fascinating studies now.</p><p>So <strong>enroll </strong>in this fun introductory course and start seeing how simple research in psychology tells us amazing things about human thought and behavior!</p>", 
    "end_date": null, 
    "title": "Quickly Understand Social Psychology", 
    "price": "20.00", 
    "instructors": "Andrew Luttrell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508508_b2ca_2.jpg", 
    "course_url": "https://www.udemy.com/amazing-psychology-experiments/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T23:11:19Z"
}