{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "  <p><strong>As a researcher you’ll be only too familiar with the pressures of building your career – particularly when it comes to making your research count.</strong></p>  <p><strong>Drawing on more than 20 years’ research experience</strong>, this online programme introduces the essential elements in managing any type of research – at whatever stage of your career – so you’re able to:</p>  <ul><li>Identify the eight vital skills every research project/programme manager needs to develop</li><li>Understand the essential principles involved in effective research project management</li><li>Appreciate how successful research project management can benefit your career – both inside and outside of academia</li><li>Understand the four core stages of the research project lifecycle, so you'll be better prepared to manage every research project and programme for success.</li></ul>        <p>We’ll also show you:</p>  <ul><li>The most important activities to focus on at each of the four core stages, so you can deliver research objectives on time and on budget</li><li>Three of the most common mistakes researchers make when it comes to managing research and how you can avoid them</li><li>How to identify any research project’s most influential stakeholders, so you can prioritize their needs <u>and</u> better manage expectations </li></ul>      <p>…and more!</p>    <p><strong>Get started today and give research project management the attention it deserves at the top of your career development agenda. Just click the ‘Take this course’ button, top right of the page.</strong></p>  <p><strong>See you inside!</strong></p>", 
    "end_date": null, 
    "title": "Research Project Management: Getting Started", 
    "price": "50.00", 
    "instructors": "Dr Ruth Belling", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691986_6c56.jpg", 
    "course_url": "https://www.udemy.com/research-project-management-getting-started/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T12:24:38Z"
}