{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Course Description</strong></p>\n\n<p>If you are a university student, you very well know the struggle of writing an academic papers - especially, when it comes to the degree thesis. One has to understand and acknowledge large amount of methodological guidelines while writing.</p>\n\n<p>We are trying to make this process a lot simpler and less painful for you by summarising all of the concepts that are necessary to understand if one wants to write a solid research paper. Hence we do not only cover these, we will also have strong recommendations for you along the way with some pretty practical tips!</p>\n\n\n\n<p><strong>Learn and Master The Most Crucial Parts Of Writing A Research Paper</strong></p>\n\n<ul><li><p>Stating Research Aim, Questions and Objectives.</p></li><li><p>Identifying Research Rationale and Research Problem.</p></li><li><p>Choosing Research Approach, Design, Nature and Strategy.</p></li><li><p>Understanding Sampling Techniques and Sample Selection.</p></li><li><p>Choosing Data Collection Technique.</p></li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Making The Right Methodological Choices</strong></p>\n\n<p>Research is a long process that starts by identifying a problem and then selecting proper research methodology to analyse this problem. We will go through this process in a step-by-step manner, so you can just follow the videos and alongside write your research paper. </p>\n\n\n\n<p>We have really focused on giving an actual and practical recommendations for you, hence not just making an overview of all the choices you can make. For every choice that is there, such as research strategy, you are going to hear a recommendation of which alternative you should go for with your particular research idea.</p>\n\n\n\n<p>Lastly, if this is your first strive to write an academic paper, there is a special video in Module 2 where we present to you all the necessary writing tips - such as referencing, searching for academic articles etc.</p>\n\n<p><strong class=\"redactor-inline-converted\">Course Contents</strong></p>\n\n<p>In over 3 hours of content, this course covers all the necessary Research Methodology concepts. We strongly recommend you to follow the course while you are constructing your research paper alongside. As an extra help for you, each lecture has notes as an attachment while there are worksheets for each module that you can download and print. Finally, we added quizzes so that you can test your knowledge and get ready for exam from this topic.</p>", 
    "end_date": null, 
    "title": "Research Methods For Business Students", 
    "price": "20.00", 
    "instructors": "Robert Barcik", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815212_4cdb_3.jpg", 
    "course_url": "https://www.udemy.com/research-methods-for-business-students/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T07:12:58Z"
}