{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">INSIDER TIPS REVEALED</strong><strong style=\"\"> - how you are influenced in the shop.</strong>  </p>  <p style=\"\">  \t              Welcome to this “Shopper Psychology - Becoming a Smart Shopper” web-course - <strong style=\"\">the first online program designed to teach you everything you should know about your shopping behavior</strong>.  </p>  <p style=\"\">  \t              The reason we created the course is to make people feel good about their shopping trips, to give them insight into the shopping behaviors and teach how to become a Smart Shopper.  </p>  <p style=\"\">  \t              The web course is designed to be compact and easily understood. You can decide how you take the course. One of the commonly used learning techniques is splitting the course over the period of a week when each day you spend just 10 minutes on learning. This also helps to absorb the information better and gives a time to put your new knowledge in use. The good thing is that you will be able to access your course materials any time without any limitations and repeat the course whenever you want.  </p>  <p style=\"\">  \t              Though there have been different studies carried out around the world about different shopper influencers, the mind still remains a mystery and there are still many things to learn and it’s a never-ending process. In the following web course chapters you will learn the main things you need to know while shopping:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t              - At the beginning we will explore what shopping really is and how you see the products in shop;  \t</p>  \t<p style=\"\">  \t\t              - In the next sessions you will discover how your senses might be influenced while shopping;  \t</p>  \t<p style=\"\">  \t\t              - Understand Consumer Decision-making process;  \t</p>  \t<p style=\"\">  \t\t              - And will get the tips for smart shopping.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Shopper Psychology - Becoming A Smart Shopper", 
    "price": "35.00", 
    "instructors": "Kaya Kaya", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/64754_287c_3.jpg", 
    "course_url": "https://www.udemy.com/shopper-psychology-becoming-a-smart-shopper/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-10T12:03:14Z"
}