{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>The course provides a brief biography of Sigmund Freud, the father of Psychoanalysis. The course then continues on to describe Freud's major theories including Psychoanalytical Theory, Psychosexual Developmental Theory, Defense Mechanisms, and Dream Theory. The course then concludes with evaluating Freud's contributions to the field of Psychology. The course is intended to teach anyone who is interested in Sigmund Freud about his theories. This can be a refresher course for professionals in the field while also being an introductory course to beginners. The course includes lecture, power point, and quizzes to ensure that the information is understandable and clear for every student and participant with an understanding of psychology of all levels. The course should take approximately 45 minutes to an hour to complete with lecture, not taking, and completing the quizzes for each section. The course is structured so that you have a lecture followed by a quiz related to that section before moving on to the next lecture. Taking this course will increase your knowledge on Sigmund Freud, the contributions he made to psychology, as well as help to develop a better understanding for the field of psychology as a whole and for the branch of psychoanalysis. The course promises to be educational and informative leaving you with a strong sense of understanding of the topics of Freud and his theories. </p>", 
    "end_date": null, 
    "title": "Sigmund Freud's Theories", 
    "price": "20.00", 
    "instructors": "Kristin Bischoff", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776350_46c2.jpg", 
    "course_url": "https://www.udemy.com/sigmund-freuds-theories/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T21:17:44Z"
}