{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Overview</p><p>This course is an accessible introduction to the application of complexity theory to the social sciences, the course will be primarily focused upon the domain of sociology, but we will touch upon elements of psychology, anthropology, political science and economics. The aim of the course is to introduce you to the variety of models from complex systems and illustrate how they apply to these different domains.  This course is a first of its kind and somewhat experimental in nature, where we will be drawing upon research from many different areas and using complexity theory to contextualize it into a coherent paradigm, giving us a fresh perspective with which to interpret some of the core questions within the social sciences.</p>Content<p>The course is broken down into four main sections, in each section we will apply one of the major modelling frameworks from complexity theory to interpreting social phenomena. We will firstly give an overview to this area of social complexity before starting our first section on systems theory as we lay down a basic model of a social system, we will go on to use this model in helping us understand, social structure and institutions.</p><p>Next we will take an overview to nonlinear social science, as we discuss the process of self-organization, feedback loops, chaos theory and self-organized criticality. The third section to the course is dedicated to social network analysis, we will cover the main topics in this new area as we talk about the basics of social graphs, clustering, network structure and the process of diffusion. Finally we will be looking through the lens of complex adaptive systems theory, exploring the model of a fitness landscape, talking about adaptive capacity, social resilience and the process of evolution.</p>", 
    "end_date": null, 
    "title": "Social Complexity An Introduction", 
    "price": "20.00", 
    "instructors": "Complexity Academy", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/745844_9bc8_2.jpg", 
    "course_url": "https://www.udemy.com/social-complexity/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-29T12:43:41Z"
}