{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<h5 style=\"\">The Neuroscience of Habits</h5>  <p style=\"\">  \t      Learn the latest research coming out of neuroscience about how to rewire our brains for lasting habit change and creation.  </p>  <p style=\"\">  \t      If New Year’s resolutions haven’t worked for you in the past, and they don’t for most, it’s likely that the real problem is not you, rather the approach or thinking patterns you are using.  </p>  <p style=\"\">  \t      Our habits are real cornerstones for our happiness in ways that most people don’t realise : 40% of the actions/behaviours we perform each day aren’t actual decisions but habits – this is something research shows and a huge proportion of our brain activity is actually unconscious brain activity (95%).  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Is there something in your life you are trying to change or stop?</em></strong>  </p>  <p style=\"\">  \t      Neuroscience provides the answer. Scientific research proves that brain training rewires the brain.  </p>  <p style=\"\">  \t      The “Hard-Wiring” in your brain is your current level of programming or conditioning. You may not like it, but it’s the truth.  </p>  <p style=\"\">  \t      You can’t achieve more in your life without adding new and “better programming”.  </p>  <p style=\"\">  \t<em style=\"\">Here’s the good news:</em>  </p>  <p style=\"\">  \t      Using the latest in brain research we now have brand new ways to get “inside” your head to help you make the mental shifts you must make first, in order to see the changes in your life on the outside.  </p>  <p style=\"\">  \t      People have been using the wrong tools for making change and that is why it’s so frustrating when we can’t stick to our resolutions or create change in our lives.  </p>  <p style=\"\">  \t      Understanding the practical neuroscience behind making and keeping habits and resolutions is your key to success. It’s simply not enough to state an intention and believe that the change will miraculously occur. This is why most people fail.  </p>  <p style=\"\">  \t      In this course we delve into the neuroscience of our behaviors, the habit loop and how cravings are created. The real insight here is that habits are not broken, rather they are transformed. If you make your resolutions into habits then they become a part of your life  </p>  <p style=\"\">  \t      It has been scientifically shown that the brain is structurally altered by changes in your behavior patterns. You can conquer toxic thinking patterns and old limiting beliefs by conscious shifts in your views, having a new vision, reframing problems.  You get to <em style=\"\">consciously</em> choose what you will create or change.  </p>  <p style=\"\">  \t      The main objective for this course is to review the latest research coming out of neuroplasticity that relates to habits and behaviour, teach you how to develop your own positive, new habits and teach you the secrets of making New Year’s resolutions that stick.  </p>  <p style=\"\">  \t      Through our understanding of the neuroscience of habits, we can transform detrimental patterns and thereby develop healthier, more productive patterns of behavior that become new habits!  </p>  <p style=\"\">  \t<strong style=\"\">This is just some of what I’ll cover in this course:</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t      -Brain Training 101: the science of the brain.  \t</p>  \t<p style=\"\">  \t\t      -What neuroplasticity is, how it impacts habit formation and our behavior and how to change our brains using this knowledge. Scientific research proves that brain training rewires the brain.  \t</p>  \t<p style=\"\">  \t\t      -We can create and change neural pathways by altering them or establishing new ones. We’ll look at what neural pathways are and how to change the neural associations in your brain.  \t</p>  \t<p style=\"\">  \t\t      -Brain plasticity and the mechanisms of behavior change: taking on new patterns of behavior means overriding existing neural circuits.  \t</p>  \t<p style=\"\">  \t\t      -The foundations of habit: the anchor, the routine and the reward and how to build a habit.  \t</p>  \t<p style=\"\">  \t\t      -The practical steps involved in getting your brain on auto-pilot.  \t</p>  \t<p style=\"\">  \t\t      -How task avoidance is a habit, how it is created and reinforced and how we break the procrastination habit.  \t</p>  \t<p style=\"\">  \t\t      -What bad habits are, how to change our relationship to them and how we can rewire our brains to change bad habits.  \t</p>  \t<p style=\"\">  \t\t      -How to develop new positive habits without willpower and how to identify triggers of bad habits.  \t</p>  \t<p style=\"\">  \t\t      -How to focus on new behaviors to form new neural networks that will result in new habits.  \t</p>  \t<p style=\"\">  \t\t      -How to respond positively to change, turning potential stressors into opportunities for growth and success.  \t</p>  \t<p style=\"\">  \t\t      -The effects of negative self-talk and patterns of faulty thinking.  \t</p>  \t<p style=\"\">  \t\t      -The key role of dopamine (the reward molecule) in compulsive behavior.  \t</p>  \t<p style=\"\">  \t\t      -How a positive attitude affects our mind and health and tips to develop one.  \t</p>  \t<p style=\"\">  \t\t      -How compulsive behaviors are just habits.  \t</p>  \t<p style=\"\">  \t\t      -Internal and external motivation.  \t</p>  \t<p style=\"\">  \t\t      -The types of motivation that set high achievers apart and their 6 core beliefs.  \t</p>  \t<p style=\"\">  \t\t      -How awareness (mindfulness) relates to procrastination and how it affects self-regulatory behavior.  \t</p>  \t<p style=\"\">  \t\t      -The 5 facets of mindfulness that help us to break out of bad habits and create new ones.  \t</p>  \t<p style=\"\">  \t\t      -Get clear about why you’re pursuing a resolution – what is motivating you to make this lasting change?  \t</p>  \t<p style=\"\">  \t\t      -We’ll be thinking in terms of good habits rather than quitting something.  \t</p>  \t<p style=\"\">  \t\t      -What does your new habit look like and what behaviors are involved?  \t</p>  \t<p style=\"\">  \t\t      -We’ll look at how to identify the answers to these questions and many more in determining the right resolution.  \t</p>  \t<p style=\"\">  \t\t      -How focusing our mind on developing new skills, habits or insights, imprints new neural pathways to support the new habit.  \t</p>  \t<p style=\"\">  \t\t      -Preparation activities that help us break from our usual patterns of thought.  \t</p>  \t<p style=\"\">  \t\t      -The Five factors that can make or break the deal in terms of setting the stage for your brain to adapt to learning new ideas or behaviors.  \t</p>  \t<p style=\"\">  \t\t      -We learn to identify and replace reactive thinking patterns.  \t</p>  \t<p style=\"\">  \t\t      -How learning depends on your attitude toward the behaviour you want to change.  \t</p>  \t<p style=\"\">  \t\t      -The key habit breaking tips to take back control of your eating and spending.  \t</p>  \t<p style=\"\">  \t\t      -I discuss proven methods of rewiring the brain by altering current thought-response patterns  \t</p>  \t<p style=\"\">  \t\t      -How current patterns and problem behaviors can be learned and unlearned.  \t</p>  \t<p style=\"\">  \t\t      -How creating habits leads to goal achievement.  \t</p>  \t<p style=\"\">  \t\t      -Strategies to keep resolutions.  \t</p>  \t<p style=\"\">  \t\t      -How to shift away from bad habits of rumination and worry.  \t</p>  \t<p style=\"\">  \t\t      -Instead of relying on willpower we create the right environment and eliminate the distractions and cues that facilitated your bad habit.  \t</p>  \t<p style=\"\">  \t\t      -How mindful motivation for goals and willpower moves you step by step towards your goals.  \t</p>  \t<p style=\"\">  \t\t      -Mindfulness techniques and surfing the urge.  \t</p>  \t<p style=\"\">  \t\t      -Habit intentions and how to create positive statements to help build them.  \t</p>  \t<p style=\"\">  \t\t      -Changing negative thought patterns to relieve daily stress which undermines habit formation.  \t</p>  \t<p style=\"\">  \t\t      -Why are we so impulsive?  \t</p>  \t<p style=\"\">  \t\t      -How can we deal with unwanted thoughts more successfully.  \t</p>  \t<p style=\"\">  \t\t      -How our brains evolved to have a negativity bias that was essential for survival.  \t</p>  \t<p style=\"\">  \t\t      -The vagus nerve is, how it functions in our bodies and mind and how we can stimulate it to our benefit.  \t</p>  \t<p style=\"\">  \t\t      -The neurochemical effects of toxic thinking patterns.  \t</p>  \t<p style=\"\">  \t\t      -What neuroscientists have discovered about goal setting and why some of our best intentions fail.  \t</p>  \t<p style=\"\">  \t\t      -How the music we listen to engages the neurobiological systems that affect our psychology.  \t</p>  \t<p style=\"\">  \t\t      -Improve how we pursue our goals and ultimately increase our chances at success.  \t</p>  \t<p style=\"\">  \t\t      -Procrastination as an intention-action gap. We look at how task avoidance is a habit, how it is created and reinforced and how we break the procrastination habit.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "The Neuroscience of Habits", 
    "price": "50.00", 
    "instructors": "Brigitte Najjar", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/146676_f090_3.jpg", 
    "course_url": "https://www.udemy.com/the-neuroscience-of-habits/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-14T09:57:03Z"
}