{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong>JOIN THE 500+ STUDENTS WHO HAVE ALREADY USED MY SYSTEM TO GET ACCEPTED TO UC's LIKE BERKELEY, LA, AND DAVIS!</strong></p>\n\n<p>Every year, I help dozens of high school seniors get into the UC's of their choice. This comprehensive course will teach you how to get accepted by utilizing every inch of your application.</p>\n\n\n\n<p><strong>I was trained in College Admissions and Career Planning at UC Berkeley</strong>. For just $50, this Udemy course combines the most useful information from my training with my 5+ years of experience as a college admissions professional.</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>What Makes This Course So Much Different [and Better]</strong></p>\n\n\n\n<ul><li><strong>Details</strong>: While most instructors tell you to brainstorm, my course teaches you <em>how</em> to do that most effectively. I provide this level of detail in every section of my course, so that you aren't left guessing. Furthermore, my course is structured directly after the actual application.</li><li><strong>Interaction</strong>: By enrolling, you have unlimited access to me via Udemy Discussions. Simply post a question and I will answer it -- so long as it has to do with the UC application.</li><li><strong>Comprehensive</strong>: This course provides a holistic approach to your application because students are evaluated on everything -- not just essays or activities. Only by addressing a student's overall profile can one create an inspiring story worth admission.</li><li><strong>Results</strong>: My students, who typically range from 3.4-4.0, consistently earn admission into the UC's, with 98% of them accepted to either their target or top pick UC's.</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><em>Take it from me -- a UC Berkeley alumnus -- getting in is harder than it has ever been. And it's only going to get harder.</em></p>\n\n\n\n<p>So if you're interested in attending a UC...learn from my <strong>training</strong>, learn from my <strong>experience</strong>, and learn from my <strong>results</strong>.</p>\n\n\n\n<p><strong>ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "The UC Application Strategy Guide ", 
    "price": "30.00", 
    "instructors": "Dan Murray Zhou", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726540_35da_2.jpg", 
    "course_url": "https://www.udemy.com/theucapplicationstrategyguide/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T06:56:10Z"
}