{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t<strong style=\"\">---------------------------------------------------------------------------------------------------------------------</strong>  </p>  <p>  \t<strong style=\"\">First time on Udemy</strong>, course delivered by Nobel laureates themselves.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Here is what our students have to say about the course:</strong><br style=\"\">  \t<br style=\"\">  \t<em style=\"\">&quot;</em><span style=\"\"><em style=\"\">The specialty of the course being that you are with a Noble Laureate and getting into his views and ideas in a plain and simple mode just for layman term. One of the best course, indeed.&quot;</em> - Prabhakar<br style=\"\">  \t</span>  </p>  <p>  \t<span style=\"\"><em style=\"\">&quot;</em></span><span style=\"\"><em style=\"\">Amazing course. instructor was so knowledgeable and a details information on Industrial growth. highly recommended..&quot;</em> - Somenath<br style=\"\">  \t<br style=\"\">  \t<em style=\"\">&quot;</em></span><span style=\"\"><em style=\"\">It is really deep and global course will make you understand the advanced level of economic conditions of the global economies&quot;</em> - Mujahid<br style=\"\">  \t<br style=\"\">  \t<em style=\"\">&quot;</em></span><span style=\"\"><em style=\"\">I am very thankful that I become part of this course. Truly it&#039;s more than worth the amount of what it was offered to enroll in this course.</em>&quot; - Marvin</span>  </p>  <p>  \t<span style=\"\">And Many more..</span>  </p>  <p>  \t<span style=\"\"><strong style=\"\">---------------------------------------------------------------------------------------------------------------------</strong></span>  </p>  <p>  \t        In this masterclass Nobel laureate <strong style=\"\">Michael Spence</strong> presents the new economic players and the challenges of the global world.  </p>  <p>  \t        At the dawn of the third millennium, there are new players that have taken the economic stage: they are the <strong style=\"\">emerging economies</strong>, in particular, the so-called BRIC group (Brazil, Russia, India, China) and south-east Asia; the story of their overwhelming development, lights and shadows of the new dynamics of the global economy.  </p>  <p style=\"\">  \t<strong style=\"\">This course is for:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Anyone with inquisitive and open mind</li>  \t<li style=\"\">Everyone interested in economics and who would like to learn more about economic model of emerging countries</li>  \t<li style=\"\">Anyone with Interest in science</li>  \t<li style=\"\">Anyone with true passion for leaning and attaining true knowledge at an affordable price.</li>  \t<li style=\"\">Attending the course does not need any economic skill since it is presented in a clear and simple manner</li>  \t<li style=\"\">Anyone who appreciates and admires the knowledge brought to our race from Nobel Prize laureates&#039; works.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">With this course you will learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Over 20 lectures and 1.5 hours of content!</li>  \t<li style=\"\">17 masterclasses and 1 hour and more of content</li>  \t<li style=\"\">You will learn which the new emerging countries are at the dawn of the third millennium</li>  \t<li style=\"\">You will learn about economic phases of development and recession in the different historical periods</li>  </ul>  <p style=\"\">  \t      From literature to economics, art to philosophy, EdooTV and The Thought Flame gives voice to the world&#039;s leading experts, describing and sharing ideas and knowledge that are essential for all of us.  </p>  <p style=\"\">  \t      Don&#039;t wait, be a part of this amazing community now. Knowledge and ability to think with open mind is the <strong style=\"\">best gift</strong> you can give to yourself and your loved ones.  </p>  <p style=\"\">  \t      Feel free to contact us for bulk buying and corporate deals as well.  </p>", 
    "end_date": null, 
    "title": "The economic model of emerging countries - Michael Spence", 
    "price": "25.00", 
    "instructors": "EDOOTV -  The knowledge dispenser", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398980_ffe8.jpg", 
    "course_url": "https://www.udemy.com/the-economic-model-of-emerging-countries-michael-spence/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T08:59:15Z"
}