{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t  Do you not feel confident enough for writing academic papers? Are worried about citations, references and plagiarism? Do you want to save time by extracting relevant parts of papers and gathering data using online surveys? Our second package is tailored for your needs. Its purpose is fivefold: understanding systematic reference and citation management; organizing thoughts and brainstorming ideas; automatically summarizing and paraphrasing texts and extracting only relevant parts of papers (search indexing); understanding the crucial concept of plagiarism, its various types and checking your work for plagiarism using the tools we have introduced; and using online surveys for data collection and analysis. This package contains everything a researcher needs in order to write s scholarly paper.  </p>  <p style=\"\">  \t  There are various tools developed by well-known institutes throughout the academic world to help improve the quality of research. These sets of tools are developed with great effort by elites in order to aid in researchers and using them in systematic ways leads to a valuable and high quality research project.  </p>  <p style=\"\">  \t  Utilizing the instructions and tools introduced in this package gives you enough confidence to start writing your research project. Mind mapping tools, references and citation management tools, plagiarism detection softwares, auto summarizers and paraphrasers, search indexing, and online surveys; you can find everything you are going to need during your writing process in this package. Once you get to know these tools and become familiar with their features, you will know how to easily conduct a research and write academic papers systematically. This package is absolutely essential for all researchers.  </p>  <p style=\"\">  \tTCFEX &#039;s Research Department  </p>", 
    "end_date": null, 
    "title": "Transform your Research Paper Writing: Starting to Write", 
    "price": "20.00", 
    "instructors": "TCFEX LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341162_38db_2.jpg", 
    "course_url": "https://www.udemy.com/writing-a-high-quality-thesis-article-using-research-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T06:54:29Z"
}