{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t              The anti-bullying movement has become the most popular social movement in the world. Bullying awareness efforts have made bullying the number one fear of parents. Anti-bullying laws have made schools responsible for eliminating bullying. As a result, more kids than ever are being sent for help because they are being bullied. Adults, too, have become aware of bullying and are seeking help.  </p>  <p>  \t              If you are a counselor, psychologist, social worker, psychiatric nurse, life coach or other type of helping professional, there is a good chance you don’t know how to help clients who suffer from being bullied. You can’t rely on the popular bullying prevention programs to help them because research shows that they rarely produce more than a minor reduction in bullying and often result in an increase. If you employ common counseling or therapy methods, you can work with them for months or years and they may still see no relief from the bullying.  </p>  <p>  \t              This unique course will teach you a quick, powerful and fun system for teaching your clients how to stop being bullied without anyone’s help and without getting anyone in trouble. Many clients will experience a dramatic improvement after the first session. They will grow in self-confidence and –esteem, popularity, resilience, emotional maturity and  academic/work functioning. You may become a more effective counselor or therapist than you  have thought possible.  </p>  <p>  \t              Through video lectures, recorded role-plays, written material and assignments for practice, you will come to see bullying in a new way and discover how easy it is to help your clients. Your own personal relationships are likely to improve as well! You will also understand the problems with the orthodox approach to bullying, which is concerned with making bullies change, and why it doesn’t work very well.  </p>", 
    "end_date": null, 
    "title": "Treating Victims of Bullying", 
    "price": "50.00", 
    "instructors": "Israel Kalman", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176752_9711.jpg", 
    "course_url": "https://www.udemy.com/treating-victims-of-bullying/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-04T17:21:07Z"
}