{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><em>\"U.S. History 201</em>\" is a comprehensive introduction to United States History from Early Colonization to Reconstruction.  This self-paced online course combines the real world immediacy and intimacy of professionally-produced video with the free, open-source, peer-reviewed textbook \"U.S. History\" from OpenStax College. Hear from noted historians and scholars - including Stephen Aron, Bernard Bailyn, Helena Wall, Estelle Freedman, Samuel H. Beer, Barbara Oberg and others - who together provide a comprehensive and balanced examination of America's rich heritage.</p><p>The course covers everything you can expect to see in an introductory college or high school course in United States History:</p><ul><li>Early Colonization</li><li>Imperial Reforms and Colonial Protests</li><li>America's War for Independence</li><li>Creating Republican Governments</li><li>The Industrial, Market, and Transportation Revolutions</li><li>Jacksonian Democracy</li><li>Westward Expansion</li><li>The Antebellum South</li><li>The Civil War</li><li>Reconstruction</li></ul><p>Enjoy more than 200 professionally-produced and engaging video segments - each approximately three to five minutes in duration - that incorporate subject expert interviews, dramatic recreations, photographs and artifacts, and historic images and illustrations.</p><p><em>U.S. History 201 </em>can be adopted \"as is\" for use as a complete online course in Early American History, as a quality supplement to existing history courses, or as a media-rich resource for review, flipped instruction and test preparation.</p>", 
    "end_date": null, 
    "title": "U.S. History 201", 
    "price": "20.00", 
    "instructors": "Intelecom Learning", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242244_dff3_2.jpg", 
    "course_url": "https://www.udemy.com/us-history-201/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-12T17:30:36Z"
}