{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">- Content last updated: April 11, 2016</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">- Join 800+ students learning about this fascinating topic!</strong></p>\n\n<p><strong>- The information in this course will change the way you think about those around you - don't miss out on this chance to increase your knowledge about other people through the lens of psychology.</strong><br><strong class=\"redactor-inline-converted\"></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Delve into the psychological science of violence and aggression.</li><li>Explore the surprising factors that contribute to aggression.</li><li>Gain a deeper understanding of the way this dark and puzzling aspect of the mind works.</li><li>Learn to think more like a psychologist.</li><li>Change your understanding of people.</li><li>Understand the psychology behind the devastating events you read about in the news.</li></ul>\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n</p>\n\n<p>What makes humans violent and aggressive? This is perhaps the most important question about human behavior. Understanding the human tendency towards anger, violence, and aggression has the great potential to lessen human suffering and increase human flourishing. With 18 lectures and 1 hour of carefully selected content, this highly focused course reviews the psychology literature and synthesizes major theories, causes, and factors that promote aggression. In taking this course, you will learn to think more like a psychologist but without having to do a Ph.D.</p>\n\n<p>The primary goal of this course is to provide you with an understanding of the factors that cause and contribute to violence and aggression. The understanding you will gain from taking this course will serve as an  important tool; it will provide you with a rare scientific lens through which you can view and make sense of the behavior of those around you and the events you read about in the news. <strong>E</strong><strong class=\"redactor-inline-converted\">very single lecture is backed up by scientific research into the subject of violence and aggression. </strong>This cutting edge research was performed by psychologists, biologists, and neuroscientists. This course is for you if you are interested in learning more about psychology, human nature, the mind, the brain, emotions, and behavior. This course is also relevant to those who seek to improve their social interactions and understanding, those who have personal or professional goals to decrease violence, aggression, or negativity, or those who are curious about a dark and puzzling aspect of human nature. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p> <strong class=\"redactor-inline-converted\">If you are not satisfied with this psychology course, get your money back within 30 days of purchasing.</strong></p>", 
    "end_date": null, 
    "title": "Understand The Psychology of Violence and Aggression", 
    "price": "20.00", 
    "instructors": "Conor Steckler", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794956_61bd_3.jpg", 
    "course_url": "https://www.udemy.com/the-psychology-of-violence-and-aggression/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T18:05:45Z"
}