{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>People generally have a hard time understanding macroeconomics, but after 7 years of teaching this course at university level, I have mastered the best ways of explaining its concepts for students to be able to understand them and relate them to the real world.</p>\n\n<p>This course is ideal for university students who are struggling to make sense of their textbooks and lectures, and will allow them to get better grades. </p>\n\n\n\n<p>This course is also ideal for professionals and citizens who want to better understand the economic concepts they deal with in work and daily life, such as inflation, unemployment, monetary policy, and fiscal policy. This course will help you understand questions such as: Why does the government engage in expansionary fiscal policy? What is the motivation behind reducing taxes? What are the implications of a drop in interest rates? What determines the money supply? After taking this course, you will be able to better understand how macroeconomic events impact your life, and can make better-informed decisions.</p>\n\n\n\n<p>The course is composed of 12 lectures, totaling 2 hours and 40 minutes of video. Each lecture will come with detailed lecture notes that emphasize and explain the main ideas. There will also be several practice problems for students to complete. For best results, students are urged to read the notes, watch the video, re-read the notes, and then solve the practice problems.</p>", 
    "end_date": null, 
    "title": "Understanding Macroeconomics for University and Business", 
    "price": "25.00", 
    "instructors": "Dr. Saifedean Ammous", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/767836_a4d6_2.jpg", 
    "course_url": "https://www.udemy.com/understanding-macroeconomics-for-university-and-business/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-19T17:20:49Z"
}