{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<ul style=\"\">  \t<li>Study US Contract law with concise, accessible, animated videos.  You&#039;ll learn the fundamentals of contract law, the sources of contract law in the United States, and the very first element of the contract, the offer.</li>  \t<li>Educators in the United States and other countries have relied on USLawEssentials to teach US law to their students because the animations, illustrations, and examples make abstract concepts easily understandable.  </li>  </ul>  <ul style=\"\">  \t<li>This course is ideal for students who want a concise and clear presentation with visual aids.  Take a break from dry lectures.</li>  </ul>  <ul style=\"\">  \t<li>The course is especially suitable  for students whose first language is not English.</li>  </ul>  <p>  \t                  You will understand:  </p>  <ul style=\"\">  \t<li>Fundamental definitions and concepts.</li>  \t<li>Different types of contracts including bilateral contracts, unilateral contracts, express contracts, and implied contracts.</li>  \t<li>Sources of contract law, including the Uniform Commercial Code, the common law, and the Restatement of Contracts.</li>  \t<li>Application of the UCC and common law to hybrid or mixed transactions.</li>  \t<li>How offers are formed and how they can be terminated.</li>  \t<li>Irrevocable offers.</li>  </ul>  <p>  \t                  What you get:  </p>  <ul style=\"\">  \t<li>15 video lectures with pictures, animation, slides, bullet points, examples, summaries, and exam tips.</li>  \t<li>Video quiz</li>  \t<li>Ten-page comprehensive outline and summary of the course.</li>  </ul>  <p>  \t                  This is not a general overview of all US contract law. The course presents a brief but detailed look at some of the introductory topics that students studying contracts in the United States must understand in the first year of law school and for the bar examination.  </p>  <p>  \t                  Ourr next course will take us to the acceptance and consideration with an emphasis on the UCC battle of the forms.  Stand by for courses on other US law topics, too.  </p>", 
    "end_date": null, 
    "title": "USLawEssentials Introduction to US Contract Law", 
    "price": 0, 
    "instructors": "Daniel Edelson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363966_72b9_5.jpg", 
    "course_url": "https://www.udemy.com/uslawessentials-contracts1/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T23:29:07Z"
}