{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>El curso de iPad Básico te permitirá desarrollar competencias digitales para la inserción del iPad como un medio que puede dinamizar tu aprendizaje dentro o fuera del aula, y que te brindará muchas posibilidades para crear unidades interactivas, estimulantes y atractivas adaptadas a tus necesidades y gustos.</p><p>El curso se compone de 5 módulos, en el Módulo 1 podrás reflexionar sobre la importancia de usar el iPad en tus clases y algunos trucos para que inicies esta maravillosa aventura. Para ello se te explicará primero como realizar las actualizaciones del software iOS que es el sistema operativo que te permitirá interactuar con tu dispositivo y crear un ID de Apple que es un nombre de usuario para que puedas acceder a todos los servicios de almacenamiento y tienda de Apple.</p><p>En el Módulo 2 conocerás el servicio de almacenamiento iCloud en el que puedes guardar y acceder a documentos como fotografías, aplicaciones, contactos, notas, entre otras.  También conocerás el servicio de guardado en la nube iCloud Drive y la tienda de App Store donde encontrarás todas las aplicaciones exclusivas de Apple.</p><p>En el  Módulo 3  aprenderás sobre aspectos básicos de configuración del iPad para que puedas navegar en la web a través del Wi Fi o red inalámbrica, ya sea desde una red protegida con contraseña o una red oculta.</p><p>En el Módulo 4 conocerás las características para cada necesidad que te ofrece iOS como la función Voice Over para personas con problemas de vista o el asistente personal de Apple Siri para que te lea, te envíe mensajes o reciba dictado, la función Audio Mono para personas con problemas auditivos, entre otras.</p><p>En el Módulo 5 conocerás el espacio para escuchar y disfrutar música iTunes, en el cual puedes crear listas y escuchar todo tipo de género musical o pedirle a Genius que haga mezclas de canciones, así como conocer los 2 repositorios de contenidos y colecciones iTunes U y iBooks. </p><p>¡Te deseamos un excelente aprendizaje!</p>", 
    "end_date": null, 
    "title": "Uso básico del iPad", 
    "price": "20.00", 
    "instructors": "UNID Universidad Interamericana para el Desarrollo", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472270_9af2_4.jpg", 
    "course_url": "https://www.udemy.com/uso-basico-del-ipad/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T21:58:24Z"
}