{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t                     Desk research papers are widely assigned in college and university. This course gives you detailed guidance in creating a first quality desk research paper -- the kind of guidance that you may not get in any of your classes.  </p>  <p>  \t                     The course consists of 39 video lectures, starting with assignment analysis and ending with polishing the final paper. Crucial stages of the paper development process -- such as, for example, developing a narrow topic, writing an effective thesis statement or research question, identifying sources, carrying out targeted research, information analysis, proper citation, peer editing, revision, and rewriting -- are all explained and demonstrated in almost five hours of video. In addition, over 800 pages of supplementary materials are provided for download.  </p>  <p>  \t              The course is divided into six sections:  </p>  <p>  \t              1. Developing Your Research Question or Thesis Statement  </p>  <p>  \t              2. Carrying Out Your Research  </p>  <p>  \t              3. Analyzing Your Information  </p>  <p>  \t              4. Organizing Your Paper  </p>  <p>  \t              5. Qualities of Effective Academic Writing  </p>  <p>  \t              6. Editing and Revision  </p>  <p>  \t                     The skills you learn in this course will make the task of researching and writing a desk research paper more organized, more efficient, and less time consuming, resulting in a paper that meets the higher standards college and university instructors look for in student academic writing.  </p>  <p>  \t                     If you&#039;d like to sharpen your academic writing skills, this course is what you need. And, as a bonus, you&#039;ll find that the skills learned in this course on desk research writing are transferable to other forms of academic writing you&#039;ll be assigned.  </p>  <p>  \t                     This course makes it win-win all the way around!  </p>  <p>  \t          And, of course, you have 30 days to get a refund (no questions asked) if you are not entirely satisfied. That&#039;s another win-win!  </p>", 
    "end_date": null, 
    "title": "Writing an Effective Desk Research Paper", 
    "price": "40.00", 
    "instructors": "Leigh Faulkner", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295517_1662_9.jpg", 
    "course_url": "https://www.udemy.com/writing-an-effective-desk-research-paper/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-06T22:47:33Z"
}