{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t        Do you want to impress your professor and university with your research proposal?  </p>  <p style=\"\">  \t        Mastering proposal writing is the most important step for entering the academic world. Here you will learn how to write an academic research proposal by academic research tools.  </p>  <p style=\"\">  \t        Academic research tools not only help you be more efficient in proposal writing, they also increase the possibility of getting into a top university in addition to accessing research funds.  </p>  <p style=\"\">  \t        This tutorial course will utilize specific academic tools needed for completing your research proposal. We will equip you with practical tools to help you come up with a well-written, focused solution to a problem in a logical progression. The tools introduced here will help researchers minimize the time spent on writing the proposal.  </p>  <p style=\"\">  \t        What are these research tools?  </p>  <p style=\"\">  \t        The tools introduced here accentuate which subject is viable for research and what other researchers have discussed previously. They also conceptualize your field of study and help you select an appropriate keyword which will make it easier for you to draw upon the reserves of previous studies published in your subject field. The tools provided will help you select the most appropriate title, thus guarantee the impact your research will have on the scientific world.  </p>  <p style=\"\">  \t        Throughout this process, our tools help provide enhanced utilities for note-taking, index-searching, report writing, paraphrasing and editing.  </p>  <p style=\"\">  \t        Our research tools will take care of all your needs!  </p>  <p style=\"\">  \tTCFEX &#039;s Research Department  </p>", 
    "end_date": null, 
    "title": "Write a Research Proposal to Join Any University & Get Funds", 
    "price": "20.00", 
    "instructors": "TCFEX LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/323078_3b54_5.jpg", 
    "course_url": "https://www.udemy.com/write-academic-proposals-to-join-any-university-and-get-funds/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-20T11:09:55Z"
}