{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>  \t    <strong>++++++++++++++++++++++++++++++++++</strong>  </p><p><strong>LAST UPDATE</strong></p><p><strong>SEPTEMBER 7, 2015</strong><br></p><p><strong>NEW VIDEO - \"Sample Research Paper Topic Web Sites\"</strong></p>  <p><strong>(Scroll down to the UPDATES section) Here are some selected web sites offering a wide variety of sample research topics for your convenience. Use these idea-starters to develop them into a thesis statement and a hypothesis, as explained in this course.</strong></p>  <p>  \t  ++++++++++++++++++++++++++++++++++  </p>  <p>  \t  This step-by-step introductory-level course teaches how to  </p>  <ul>  \t<li>think about, </li>  \t<li>outline, </li>  \t<li>structure, </li>  \t<li>research, </li>  \t<li>write and </li>  \t<li>re-write a research paper.</li>  </ul>  <p>  \t          It is designed for high school juniors and seniors, and college undergraduates who want to excel in their studies and get good grades writing papers.  </p>  <p>  \t          Everything you need for this course is included in it. All you need to do is bring your mind to it and follow the instructions, do the exercises, answer the questions and quizzes, for a rich learning experience.  </p>  <p>  \t          The course consists of five major sections:  </p>  <ol>  \t<li>Think</li>  \t<li>Research</li>  \t<li>Write </li>  \t<li>Format</li>  \t<li>Review &amp; Rewrite</li>  </ol>  <p>  \t          The course takes a rather different approach to research paper writing. <strong>Instead of emphasizing formatting and research methods it stresses the importance of THINKING both the topic of the paper and the ways to outline and argue it.</strong>  </p>  <p>  \t          The course drills deep into the nature of independent and dependent variables in formulating an argument.  </p>  <p>  \t          Within a month or so of daily study, the students can learn how to think and argue better, to outline and structure the material better, which inevitably leads to a high-quality research paper.  </p>  <p>  \t<strong>You should take this course for two important reasons:</strong>  </p>  <ol>  \t<li>Your instructor is an professional Fortune 100 writer, experienced researcher and trainer with a long background of research-paper writing at college level, as explained in depth in the introductory video. He is confident that you will benefit from this course, end up lifting your academic skills up to a higher orbit, and as a result, be more successful in your school.<br>  \t</li>  \t<li>Unique to this course, your instructor will also be writing a paper and sharing his results with you so that you can see how some of the principles and techniques taught in this course are actually implemented in a real full-length paper.</li>  </ol>  <p>  \t<strong>*************************************************</strong>  </p>  <p>  \t<strong></strong><strong>And here is a THIRD REASON why you should take this course NOW:<br>  \t</strong><strong></strong>The course comes with our usual <strong>30 DAY NO QUESTIONS ASKED FULL MONEY BACK GUARANTEE</strong>. Take the course, and if you don;t like it, Udemy will return your every cent. There is nothing to hesitate or lose. I personally guarantee it.  </p>  <p>  \t<strong>QUESTION:</strong> if you are going to improve yourself sometime \"in the future\" by learning how to write better research papers, why not start NOW and give yourself a head-start? We all have only 24 hours in a day. Make the best of it.  </p>  <p>  \t<strong>*************************************************</strong>  </p>  <p>  \t        If you have any questions you can always write to me at writer111@gmail.com.  </p>  <p>  \t        Good luck!  </p>", 
    "end_date": null, 
    "title": "Write a Great Research Paper for Success in School!", 
    "price": "25.00", 
    "instructors": "Ugur Akinci, Ph.D.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333548_ad9c_2.jpg", 
    "course_url": "https://www.udemy.com/research-paper/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-01T18:37:13Z"
}