{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t  Are you looking for the most unique and worthwhile title for your research project to impress your supervisor or professor? Do you want to find and use only related and reliable sources thus avoid wasting your time? This package, which is the second in our series of research tools courses, is essential for all researchers, especially those at the beginning of their quest. Its purpose is fourfold: finding the most relevant and trending keywords; coming up with a unique and optimized title; finding, appraising and selecting the most relevant and authentic sources; and using online alert systems to keep yourself, as a researcher, up-to-date with the academic world. We have put these four concepts together because their effectiveness and the real value of the tools we have provided for each one manifests itself only when they are combined and used together systematically as they are integrally related to each other.  </p>  <p style=\"\">  \t  There are various tools developed by well-known institutes throughout the academic world to help improve the quality of research. These sets of tools are developed with great effort by elites in order to aid in researchers and using them in systematic ways leads to a valuable and high quality research project.  </p>  <p style=\"\">  \t  Utilizing the instructions and tools introduced in this package gives you an awareness of how research is done in different fields. You will be able to use these tools systematically to find keywords. Then you will learn how to use these keywords to search in the literature and find certain gaps or unanswered questions. These gaps will then lead you to a research topic/project which will fill those gaps. Finally, Combining all the new ideas and keywords you have generated, you will be able to come up with a unique and valuable title for your paper.  </p>  <p style=\"\">  \tTCFEX &#039;s Research Department  </p>", 
    "end_date": null, 
    "title": "Writing a Thesis, Paper or Research Project: Getting Started", 
    "price": "20.00", 
    "instructors": "TCFEX LLC", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339706_ad76_2.jpg", 
    "course_url": "https://www.udemy.com/write-a-high-quality-thesis-or-artice-using-research-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T08:20:20Z"
}