{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p>Добро пожаловать в наш курс <strong>«Я хочу учиться за рубежом»</strong>!</p><p>Мы специально подготовили этот курс для всех, кто когда либо задумывался об обучении за рубежом по программе магистратура. Этот курс для вас, если вы обучаетесь по программе бакалавриат и планируете продолжать свое обучение, если вы уже работаете, но думаете о повышении квалификации или о смене специализации, если вы начинающий предприниматель, и вам нужна магистратура для расширения своего круга потенциальных зарубежных партнеров,  или же вы просто хотите улучшить свой английский и получить зарубежный опыт! <br></p><p>Этот курс состоит из следующих частей:</p><p>1) определение целей поступления на магистратуру: какова ваша мотивация, соответствует ли это вашим целям</p><p>2) различия в системах образования США, Великобритании и Европы</p><p>3) Как выбрать подходящий вам и вашим целям вуз, на что обращать внимание и стоит ли полностью полагаться на мировые рейтинги университетов</p><p>4) подготовка необходимых документов для поступления: сроки и процесс подачи документов, и его составляющие. Например,  рекомендательные письма, написание мотивационного эссе, прохождение интервью и т.д.</p><p>5) Процесс подачи на стипендиальные программы, например Fulbright Foreign Student Program, British Chevening Scholarship</p><p>Мы обе учились за рубежом по программе Магистратура в США! Альмира обучалась в Гарвардском Университете по программе Эдмунда Маски, а Айгерим в SUNY, Albany по программе Fulbright! Мы работаем в сфере образования на протяжении более 5 лет, и нам доставляет огромное удовольствие делиться своими знаниями и опытом!</p><p>Мы очень надеемся, что этот курс будет вас мотивировать на пути поступления за рубеж. С нашей стороны мы постараемся сделать все возможное, чтобы этот процесс был полезным и осознанным этапом вашей жизни!</p><p>Ваши,</p><p>Альмира и Айгерим</p><p><br></p>", 
    "end_date": null, 
    "title": "Я хочу учиться за рубежом!", 
    "price": "25.00", 
    "instructors": "Aigerim Khafizova, Almira Zakiyeva", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649464_4c3b_3.jpg", 
    "course_url": "https://www.udemy.com/vqysdapg/", 
    "currency": "USD", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T10:06:17Z"
}