{
    "selfpaced": true, 
    "topic_name": [
        "Academics"
    ], 
    "description": "<p style=\"\">  \t  يقدم هذا التدريب لمحة شاملة عن الإسعاف النفسي الأولي  </p>  <p style=\"\">  \t\t  المقرر المشروح يعتمد على مطبوعات الأمم المتحدة حول الإسعاف الأولي و بعض من منشورات مفوضية الأمم المتحدة لشؤون اللاجئين و الهيئة الطبية الدولية</p><p style=\"\">يسعى التدريب لمخاطبة غير الاختصاصيين العاملين مع أشخاص تعرضوا لصدمات و رضوض نفسية جراء الحرب أو الصراعات المسحلة (أو لأسباب أخرى كالكوارث الطبيعية) و يقدم لأساسيات في التعامل مع هذه الشريحة من الناس ذات الخصوصية. كما يساعد التدريب على تطوير مهارات التواصل و الاستماع الفاعل لدى المتدربين<br style=\"\"></p>  \t\t<p style=\"\">  \t\t\t\t  يتكون التدريب من محاضرات تشرح الإسعاف النفسي الأولي باستخدام مقرر منظمة الصحة العالمية و لكن مع إضافات إغنائية لملائمة الثقافة في الشرق الأوسط و تلبية لمتطلبات العقود الأخيرة المليئة بالنزاعات المسلحة و الحروب التي نتج عنها آلاف النازحين, و اللاجئين ممن تعرضوا لرضوض نفسية</p><p style=\"\">يسعى التدريب إلى المساعدة في تطوير قدرات العاملين بالمجال الإغائي بالمنطقة العربية, و مشاركتهم في نقاش بنّاء حول تجربتهم كمقدمين للدعم النفسي و كيفية تطويرها</p><p style=\"\">هذا التدريب تم بناءا على مشروع شخصي لكل من حسام جيفي بهلول و أندريه بركيل أوتيو  و الجمعية السورية للصحة النفسية عن بعد و لا علاقة لجامعة ييل بانتاج و تقديم هذا المشروع</p><p style=\"\">Based on Psychological First Aid: Guide for field workers</p><p style=\"\">Authors: WHO, War Trauma Foundation and World Vision International<br style=\"\"></p><p style=\"\">Course Image credit for: Flo Smith/NurPhoto/ZUMA Press</p>", 
    "end_date": null, 
    "title": "الإسعاف النفسي الأولي | Psychological First Aid", 
    "price": 0, 
    "instructors": "Hussam Jefee Bahloul, Andres Barkil-Oteo", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267552_db09_3.jpg", 
    "course_url": "https://www.udemy.com/psychological-first-aid/", 
    "subject_name": [
        "Social Science"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T20:03:45Z"
}