{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><p style=\"\"><strong style=\"\">As more lectures will be added soon, the price of the course will go up  in March. Take your chance now to get &nbsp;life time access for the current  $16.&nbsp;</strong></p>  <p style=\"\">This ABC course will walk you through a landscape of design methods. A  quick tour, it will be. It will show your potential toolset in a series of 26+  selected verbs, all with their unique initial. Not too many words for an  introductory course as this one. Just the right amount, so they are distinctive  and you can easily remember them. </p>    <p style=\"\">Each of the selected verbs has tips and exercises with them. You are  encouraged to <strong style=\"\">exercise</strong> the  exercises, developing your selection criteria as well as your self-discipline. </p>    <p style=\"\">The aim of the course is to develop your creative skills by showing  methods and techniques that have proven their success in the past. The design  practices can assist you to reorganize your thoughts, to adjust your design  process. It can be a modest but dedicated coach to make you adapt your vision  on design. It also is a tool to convince potential customers and employers that  you know how a design process should be managed.</p>    <p style=\"\">Surprise yourself with new visions on what your design process can be  like.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "ABC for Designers: Tips & Exercises for the Design Practice", 
    "price": "20.00", 
    "instructors": "Petr van Blokland", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/33885_d530_5.jpg", 
    "course_url": "https://www.udemy.com/abc-for-designers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-30T09:22:56Z"
}