{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>5,300+ Students have already enrolled with 100+ Five-Star Ratings!</p>\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>Do you want to take your <strong>business and brand</strong> <strong>graphics </strong>to the next level? Have you ever wondered why some advertisements in social media stand out, while some you <strong>never even take a second look at</strong>? Do you want to <strong>catch your audience's attention</strong> so that you can promote your product?</p>\n\n<p><strong>What this course is about:</strong></p>\n\n<p><em>Canva Course: Graphic Design Theory in Social Media Intro</em> is the introduction in a series of courses that are aimed to help you understand simple design theory for your business or brand. These ideas can be applied across multiple platforms, including your brand, eBooks, websites, social media graphics, presentations and more.</p>\n\n<p>Canva is a very easy-to-use and free online software platform for creating stunning graphics in a very short amount of time. It's pre-made layouts and huge library of artwork make it the go-to graphics software for a lot of businesses and entrepreneurs.</p>\n\n<p><strong>What you will learn in this course:</strong></p>\n\n<p>This course will guide you through the basic principles and ideas that are in all sorts of visual media. You can expect to gain attention and an audience with your designs when you follow the simple procedures explained in these videos. The lectures include:</p>\n\n<ul><li>Information about Canva.</li></ul>\n\n<ul><li>Elements of design.</li></ul>\n\n<ul><li>Principles of design.</li></ul>\n\n<ul><li>Color Theory.</li></ul>\n\n<ul><li>Typography.</li></ul>\n\n<ul><li>Composition.</li></ul>\n\n<ul><li>Plus free updates and additions to the course in the future!</li></ul>\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>If you enjoy this course and want to learn more about the principles and theory behind great graphic design, than be sure to check out the other volumes in this series:</p>\n\n<p><strong>Canva Course: Graphic Design Theory in Social Media Volume 1</strong></p>\n\n<p><strong>Canva Course: Graphic Design Theory in Social Media Volume 2</strong></p>\n\n<p>For more information on using Canva, check out my other course:</p>\n\n<p><strong>Canva Course: <strong>Beginner's Guide to Canva for Graphic Design</strong></strong></p>\n\n<p>Jeremy Deighan</p>\n\n<p><em>p.s. I am here for my students and I always welcome any feedback, questions, discussions, or reviews on my courses. Please visit my profile to see how you can contact me in the most convenient way for you!</em></p>", 
    "end_date": null, 
    "title": "Canva : Graphic Design Theory Introduction", 
    "price": "20.00", 
    "instructors": "Jeremy Deighan", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521444_20f3_5.jpg", 
    "course_url": "https://www.udemy.com/canva-course-graphic-design-theory-in-social-media-intro/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-05T17:48:48Z"
}