{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>El<strong> \"Design Thinking\"</strong> y la Innovación están revolucionando el mundo del diseño de productos, servicios y resolución de problemas. En este curso el estudiante logrará adquirir herramientas y conocimientos que le servirán para desarrollar alta innovación en productos, servicios y modelos de negocios basados en el <strong>diseño centrado en el usuario. Regístrate ahora </strong>y descubre por qué la innovación es la disciplina que más valoran las empresas y organizaciones en el mundo.</p>\n\n<p><strong>Productos como el iMac y el iPhone</strong>, los audífonos Beats, Dropbox, SegWay o incluso las cámaras GoPro han revolucionado cada uno de sus mercados, adicionalmente <strong>servicios innovadores como el que ofrece la aerolínea Virgin a sus pasajeros, </strong>empresas como Netflix, iniciativas colaborativas como KickStarter, Uber, AirBnB y proyectos para mejorar la calidad de vida en Africa<strong> han sido y están siendo creados usando el Design Thinking.</strong> </p>\n\n\n\n\n\n<p>No importa si no tienes conocimientos de innovación o no te consideras una persona creativa. Inscribirse en este curso te ayudará a crear ese nuevo producto o servicio innovador que tienes en mente y que va a cambiar el futuro para siempre. Cada mes recibirás actualizaciones con contenido adicional y nuevas lecciones que fortalecerán tu conocimiento en Design Thinking. <strong>¿Estás preparado para asumir el reto? ¡Toma este curso ahora!</strong></p>\n\n\n\n\n\n<p><strong>Incluso si no estás satisfecho tienes hasta 30 días para solicitar la devolución del 100% de tu dinero sin hacer preguntas. Inscríbete ahora mismo!</strong></p>", 
    "end_date": null, 
    "title": "Curso de Innovación en Design Thinking", 
    "price": "25.00", 
    "instructors": "Hegel Eisenhower Gonzalez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545996_5430_8.jpg", 
    "course_url": "https://www.udemy.com/curso-de-innovacion-en-design-thinking/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T21:53:28Z"
}