{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tAre there web sites that have a design you really admire?  Do you wish you could create attractive and effective designs?  Are you &quot;design-challenged&quot; and need to know the basics of creating good-looking web sites, mobile apps or other digital media?  </p>  <p style=\"\">  \t<span style=\"\">You may never be a world famous designer, but you can design attractive, effective and high-quality digital media by understanding the foundations of design.  If you&#039;re a one-person shop and have to create interfaces even though you are trained as a developer. this course is for you!  If you&#039;re approaching design for the first time and need to be able to apply your new design skills quickly, you need to take this course.</span>  </p>  <p style=\"\">  \t<span style=\"\">In this exciting series of lectures and activities, expert designer Joesph Caserto will start with the foundations including line, shape, space, color and texture and apply the design foundations to every day digital work.  You&#039;ll learn to create beautiful typography, learn to understand your audience , create effective layouts and examine motion, sound and interactivity.</span>  </p>  <p style=\"\">  \t<span style=\"\">With over 30 fascinating video lectures, multiple lab exercises, and fascinating insight from your instructor, you&#039;ll be creating designs that everyone will be talking about. </span>  </p>", 
    "end_date": null, 
    "title": "Design For Coders", 
    "price": "25.00", 
    "instructors": "Joseph Caserto, LearnToProgram, Inc.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/79610_8942_8.jpg", 
    "course_url": "https://www.udemy.com/design-for-coders/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-16T14:46:19Z"
}