{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em><strong>LATEST: </strong>Course is updated for month of April<strong> 2016.</strong></em></p>\n\n<p><strong>THIS COURSE IS CREATED FOR ONE SIMPLE PURPOSE :</strong></p>\n\n<p>To help you develop innovative solution based ideas with no limits through the process of Design Thinking by solving  real world problems creatively in an organized and systematic manner.</p>\n\n<p>Whether you are - A total newbie on Design Thinking and clueless on how to get started:</p>\n\n<p><em>You will gain a</em><em> solid foundation on the WHATs and HOWs to </em><em>empathize with users,defining clear problem objectives,learning effective ideation techniques to generate great ideas, prototyping and testing ideas in real world scenarios and many more! This is a structured course that teaches you a systematic way to to become a Design Thinker  from scratch </em><em>that will save you years of time figuring things out on your own. </em></p>\n\n<p><em><strong>After taking this course, you'll be able to...</strong></em></p>\n\n<ul><li>Learn how to empathize and understand the needs and problems of users </li><li>Learn how to clearly define the problems and objectives of customers/users/etc.</li><li>Learn Ideation Techniques that will tremendously help you think of innovative solutions</li><li>Learn how to turn your ideas into tangible and working prototypes </li><li>Learn how to test ,iterate get feedback from your prototypes </li><li>Acquire Creative Confidence and learn how to utilize the Power of Observations</li><li>Acquire the basic foundational skills needed to become an effective Design Thinker</li></ul>\n\n<p><strong>About this course</strong></p>\n\n<ul><li>Over 20+ Lectures and 2+ Hours of Content</li><li>Full, free lifetime access</li><li>All future extra lectures and upgrades are always included for free</li><li>30 day money-back guarantee -- my personal promise to your success!</li><li>Monthly BONUS Lectures to enhance your Design Thinking Skills!</li><li>24/7 Instructor Chat Support -- I will personally help you</li></ul>\n\n<p>By enrolling in this course, you will also receive support from me and I will be personally answering your questions in the student discussion area.</p>\n\n<p>If you are willing to learn and put in the effort to implement what I teach you in this course, go ahead now and <strong>click the big blue button at the top to enroll </strong>yourself and start experiencing the results for yourself!</p>\n\n<p>I look forward to hear your personal success story and I'll see you on the other side!</p>", 
    "end_date": null, 
    "title": "Design Thinking 2016", 
    "price": "20.00", 
    "instructors": "Benjo Sabban", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498008_86bb.jpg", 
    "course_url": "https://www.udemy.com/design-thinking-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-10T03:09:47Z"
}