{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Document your thoughts like a genius. </strong></p>    <p>So why the title? </p>    <p>Well, take a close look at people we regard as ‘genius’ characters over the centuries. The way they documented their thoughts, took notes, drew and sketched for inspiration and the format they chose when putting pen to paper had a remarkable similarity to what we now call ‘mind mapping’. Doodles, sketches, linking-lines, pictures, images, groupings, relationships; big picture and fine detail. There was less color than the classic modern day mind map,  but crayons and felt tip pens were hard to come by,  so the humble quill had to sufice.</p>    <p>This course is about mind mapping - a slightly more formalised and researched form of note taking, that has huge benefits over traditional note taking or thought documenting techniques. </p><p>Mind mapping is being adopted in schools and universities by thousands of students who find this method of note-taking to be amazingly easy and beneficial. These same students take mind mapping into their professional lives to organize, memorize, manage and communicate. </p>    <p>Mind mapping is extremely fast , very intuitive and amazingly easy to re-visit and understand.</p>    <p>Mind mapping can be used by anyone who, at any point in their daily lives, needs to make a plan, take clear and readable notes, or explain concepts or projects to others - everyone including C level executives, management consultants, project managers, engineers, writers, poets, students, designers, teachers, stay at home moms or dads. </p>    <p>The uses for mind maps are only limited by imagination itself. Imagine documenting one of Shakespeare's plays - the plots, sub plots, characters, major and minor - the relationship between the characters within the play and even with characters in other of the bards plays. Maybe the relevance of the storyline to a particular time in the life of Shakespeare. To document all this information in a word document for example, might end up as a book in itself. Imagine having all this information on a single sheet, radiating out from a single central topic (i.e the name of the play) - all the information at a glance - imagine using this as the tool to explain every facet of the play to a class of students for example. </p>    <p>Mind maps have awesome power to map, distill and convey information, and explain relationships and ideas in a way the written word cannot. We are visual beings, and a good mindmap gives us an instant picture which is far easier to understand and remember than any other method.</p>    <p>This course covers the theory and principles of mind mapping and then gives you an in depth look into the fantastic market leading mind mapping software XMind.</p>    <p>The course consists of five hours of video tutorial and supplementary materials and the occasional quiz. Depending on your time commitments, the course can be completed anywhere between a day and a few weeks.</p>", 
    "end_date": null, 
    "title": "Document your thoughts like a genius - Mind mapping & Xmind", 
    "price": "35.00", 
    "instructors": "Colin Holding", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523190_b9ae_9.jpg", 
    "course_url": "https://www.udemy.com/document-your-thoughts-like-a-genius-mind-mapping-xmind/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T10:55:30Z"
}