{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>- Más de<strong> 1000 alumnos y alumnas han tomado ya mis cursos de Arte y Creatividad!</strong></p>\n\n<p>- Garantía del 100% de <strong>devolución de tu compra en 30 días</strong> <strong>si no quedas satisfecho/a</strong> con el curso.</p>\n\n<p>- Última actualización en <strong>Mayo de 2016</strong>.</p>\n\n\n\n<p>Este curso consta de <strong>clases teórico-prácticas</strong> donde se ahondará en conceptos como el <strong>Libro de Arte, Libro de Artista y Libro Objeto</strong>. También podrás realizar varios Libros de Artista con encuadernación incluida. Toda una experiencia intensiva de investigación multidireccional y experimentación con el creador y coordinador de varias <strong>Feria de Libros de Artista</strong> como LAEE (Feria del Libro de Artista y Ediciones Extrañas) y FALA (Feria Alicantina de Libros de Artista), así como de la editorial Cangrejo Pistolero Ediciones, además de Profesor y fundador de la Academia de Arte CREA 13, Conocimiento Compartido.  </p>\n\n\n\n<p>  \t  Este es un curso que<strong> puedes completar en pocos días</strong>, pero podrás desarrollar sus enseñanzas <strong>durante años</strong>. Hay muchos casos de éxito en los cuales alumnos de este taller han creado proyectos y asisten a Ferias convirtiendo sus creaciones en su modo de vida.  </p>\n\n\n\n<p>  \t  Empezaremos aclarando el concepto de Libro de Artista para pasar a ver ejemplos prácticos y seguir por la realización de los mismos. Realizaremos un recorrido por Ferias y otros espacios alternativos de exposición y venta y concluiremos con propuestas recientes. Finalmente añadiremos una interesante <strong>bibliografía</strong> y <strong>material extra como catálogos</strong> para que sigas aprendiendo.  </p>\n\n\n\n<p>  \t  Realiza este curso y encontrarás una nueva forma de entender el Libro que posiblemente se convierta en un pilar fundamental de tu <strong>proyecto de vida</strong>. Si te gusta el Dibujo, la Pintura, el Diseño, la Escultura o cualquier forma de arte plástico, este es tu oportunidad de aplicar tus conocimientos para conseguir otro nivel.</p>", 
    "end_date": null, 
    "title": "Fabrica y vende tu propio Libro de Artista. Arte creativo.", 
    "price": "20.00", 
    "instructors": "Antonio García Villarán", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341240_8c71.jpg", 
    "course_url": "https://www.udemy.com/el-libro-de-artista-concepto-fabricacion-y-venta/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T09:20:45Z"
}