{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This is what I would consider an advanced course for entrepreneurs because new entrepreneurs almost never do the strategies explained in this course. But once you start executing the strategies in this course, you will see your business grow.</p><p>Experienced entrepreneurs understand that it isn't enough to just create a product. Your product must delight your customers. And a part of delighting your customers is communicating with them that inspires positive reactions and emotions in your customers.</p><p>Once you inspire positive reactions and emotions in your customers, they will subconsciously feel that your product is better than it actually is. Your customers will also associate your business with their positive emotions.</p><p><strong>Personal experience</strong></p><p>Once I started applying the strategies presented in this course, it caused more positive responses from my customers, more sales, more repeat customers, more good reviews, and overall business growth. I rarely see other entrepreneurs apply these strategies, which is why I feel that they are only used by advanced and experienced entrepreneurs.</p><p><strong>More soft skills than hard techniques, but it works</strong></p><p>People often want formulas or practical blueprint for what to do. This course is more of a higher level thinking course that will help you think bigger and achieve more long-term. I personally feel that the techniques in this course caused an entire leg up in my own business, and that is why I am excited to share them with you.</p><p><strong>Enroll, and let's get your business to grow too</strong></p><p>Enroll in the course today, and let's get you thinking better about how to communicate with your customers to help you get more repeat sales, more happy customers, more friend referrals and long-term business growth.</p><p><br></p>", 
    "end_date": null, 
    "title": "How to find your \"voice\" that resonates with your customers", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/704144_bb16_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-your-voice-the-resonates-with-your-customers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-22T21:06:28Z"
}