{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course contains theoretical and practical classes which go into depth in concepts such as <strong>The Art Book</strong>, The Artist's Book and The Object Book. You will also be able to make Artist's books with the binding included. It is a complete and intensive experience of multidirectional investigation and experimentation with the creator and coordinator of various Artist's Book Fairs such as LAEE (The Fair of Artists' Books and Unusual Editions) and FALA (The Alicante Fair of Artists' Books), the Publisher \"Cangrejo Pistolero Editions\", as well as being a teacher at and the founder of the Art School \"CREA 13, Shared Knowledge\". </p><p>This s a course that you can complete in just a few days, but you can develop what you learn from it for years. There are many cases of success where the students of this workshop have created their own projects and taken part in Fairs, transforming their creations into their way of life. </p><p>We will start by clarifying the concept of the \"<strong>Artist's Book</strong>\" in order to move onto looking at practical examples of them and then how they are made. We'll explore the Fairs and other alternative exhibition and selling spaces and we'll conclude with recent designs. Finally we'll add an interesting bibliography so that you can carry on learning.</p><p>Take this course and you will encounter a new way of understanding the \"Book\" that might well become a fundamental pilar in your life project. If you like drawing, pinging, design, sculpture o any form of plastic arts, this is your opportunity to apply your knowledge in order to reach a new level.</p>", 
    "end_date": null, 
    "title": "Make and sell your own Artist's Book. Art and Creativity", 
    "price": "20.00", 
    "instructors": "Antonio García Villarán, Eloise Gillow", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520134_24d3_3.jpg", 
    "course_url": "https://www.udemy.com/the-artists-book-the-concept-making-and-selling/", 
    "currency": "USD", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T10:29:17Z"
}