{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">About The Apple Watch</strong></p><p style=\"\">The Apple Watch - <em style=\"\">#</em>taw is not the first wearable product; but, it is changing the game!</p><p style=\"\"> In this training, you are going to find out about the features that make the Apple watch unique, and how it compares to existing products.  This training is video based, with supporting text, audio and images. This multimedia support helps students to grasp new concepts rapidly and is based on educational research focusing on so-called learning styles. In a nutshell, this is a simple way for people to learn things rapidly without stress or strain.  As you watch these videos, you will gain an insight into the innovation which Apple brings to the table. </p><p style=\"\"><strong style=\"\"><em style=\"\">In just over 30 minutes, you will get an in-depth insight into this new product and how it fits into the marketplace. </em></strong></p><p style=\"\"><strong style=\"\">Learning About Innovation</strong> </p><p style=\"\">Apple is a revolutionary company, and they have had a massive impact on most aspects of the consumer electronics industry. They are rarely the first company to invent a new technology; but, what they do really well is work out how to make software and hardware easy to use and appealing to customers.  Here are a few examples of technologies that we all have seen Apple turn mainstream: </p><p style=\"\"> 1: Point and click operating systems - Did Apple invent this technology? No, Xerox did! But it took Apple to make it useful and user-friendly. Since then, all popular modern operating systems have been graphical. </p><p style=\"\"> 2: Portable mp3 players - Again, apple didn&#039;t invent the technology, but they definitely made it mainstream. The iPod was a revolutionary product, much more useful and user-friendly than the devices which existed prior, which had barely made a dent in the cd player market! </p><p style=\"\"> 3: The smartphone - Smartphones had been around for years before the iPhone, but the advanced features were difficult to use and people rarely even bothered with them. They just bought them because they looked cool. That all changed with the iPhone, and overnight &quot;app&quot; became a common word.  There are countless other examples. </p><p style=\"\"><em style=\"\"><strong style=\"\">The point is that if you want to know anything about successful product design, gadgets, or tech, you can learn a lot from Apple!</strong></em></p><p style=\"\"><strong style=\"\">Market Insights</strong></p><p style=\"\">One special lesson I hope you will gain is an understanding of the influence that Apple has on the consumer electronics industry. This is a valuable insight for consumers, marketers, and technologists. Apple doesn&#039;t always get it right (remember the Apple Newton?) but they are right more often than not.</p><p style=\"\">This is no accident - they have an excellent team of professional designers and developers who know the requirements of their customers inside out, and they have an almost uncanny ability to read the marketplace.  Even when you use a competitor&#039;s product, you will often benefit from features which were introduced by Apple. Therefore, there is great value in watching everything this company does because you can benefit from their insights and research in many different ways.  We are fortunate to have a marketplace that supports both the innovative features that a commercial company such as Apple can develop, and also the altruistic work of open source developers (such as the Android developers).  Although both of these business models are diametrically opposed, the synergy between the two is generating a lot of cool innovations for both end users and software / hardware developers alike. I hope you enjoy learning about these new innovations as much as I do!</p><p style=\"\"> <strong style=\"\">For App Developers</strong></p><p style=\"\">If you are planning to learn about app development, then you need to have a good grasp of the capabilities of a device and the expectations of the users. This type of basic information is often skipped in favor of complex technical details in courses aimed at developers, so my suggestion is that you start here before embarking on a more technical course.</p><p style=\"\">This training is appropriate for people with any level of background knowledge. This is not in itself a technical course, so if you have no interest in learning about how apps are made, that&#039;s fine too! </p><p style=\"\">This is great information if you are interested in gadgets, technology, marketing and product launches, or product design! Or even if you are only interested in The Apple Watch - <em style=\"\">#</em>taw because you think it looks nice, you enjoy innovation or you need another watch. </p><p style=\"\"> <strong style=\"\"><em style=\"\">Knowledge is power - it&#039;s up to you what you do with it!</em></strong></p>", 
    "end_date": null, 
    "title": "The Apple Watch - Review And Learn About Wearable Devices", 
    "price": 0, 
    "instructors": "Martin RAL", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477440_b1e0_2.jpg", 
    "course_url": "https://www.udemy.com/theapplewatchreviewcourse/", 
    "subject_name": [
        "Design Thinking"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T20:09:32Z"
}