{"selfpaced": true, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    It’s no secret that everyone wants and expects a great user experience. This leads to lower training costs, fewer errors, and happier users. SAP Fiori provides a great user experience (UX) for SAP software. It comprises hundreds of intuitive apps as well as a set of user experience design guidelines.\r\nThis course is all about taking those SAP Fiori design guidelines and showing you how to apply them to your own unique business needs. Or, put another way, building your own SAP Fiori app that’s just as delightful and user-friendly as any of the hundreds SAP has built directly.\r\nThe goal of this course is to introduce you to the tools, methodologies, and best practices for designing, creating, and enhancing your very own SAP Fiori app.\r\nCourse Requirements\r\n\r\nBasic understanding of business processes typically addressed by SAP\r\nBasic programming skills such as HTML and JavaScript\r\n\r\nDevelopment Systems\r\nTo simplify the development experience this course will use the SAP Web Integrated Development Environment (IDE), which is part of SAP HANA Cloud Platform (HCP). No installation is required. We’ll provide instructions for you to set up your own free trial account, which will be sufficient for the scope and duration of the course. You are welcome to participate without “going hands-on” with the SAP Web IDE; however, by contributing practically, you will be able to earn more points and will of course gain a fuller understanding of the scenarios covered.\n\n                                            Syllabus\n                        \r\nWeek 1: Get to Know SAP Fiori UX\r\nWeek 2: Design Your First SAP Fiori App\r\nWeek 3: Create Your First SAP Fiori App\r\nWeek 4: Enhance Your First SAP Fiori App\r\nWeek 5: Customize and Extend SAP Fiori Apps\r\nWeek 6: Build Your Own SAP Fiori App\r\nI Like, I Wish: We Love Your Feedback … And Want More\r\nFinal Exam: Final Exam, Submit Your Assignment for Peer Review, Conduct Peer Reviews\r\n\n                                    ", "end_date": "2016-04-06T00:00:00Z", "title": "Build Your Own SAP Fiori App in the Cloud", "price": 0, "instructors": "Dr Yoram Friedman and Bob Caswell", "institution_name": [], "commitment": "", "subject_name": ["Programming"], "course_url": "https://open.sap.com/courses/fiux2", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["openSAP"], "start_date": "2016-02-24T00:00:00Z"}