{"selfpaced": false, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    Este es el primer curso en una línea de especialización de Coursera que trata el desarrollo de aplicaciones Web. Este curso le dará los conocimienots básicos, la terminología y los conceptos fundamentales que son necesarios para construir aplicaciones web integradas modernas. Un desarrollador de aplicaciones web integradas está familiarizado con cada \"capa\" de las tecnologías de software que participan en una aplicación web, incluidas las tecnologías de modelado de datos y bases de datos, los componentes del entorno de servidor web y middleware, protocolos de red, la interfaz de usuario y diseño visual básicos, y los conceptos de interacción del usuario.\n\nEn este curso vamos a aprender practicando. Vamos a empezar por el aprendizaje de los principales componentes de las arquitecturas de aplicaciones web, junto con los patrones de diseño fundamentales y filosofías que se utilizan para organizarlos. El alumno construirá y perfeccionará continuamente una aplicación web integrada totalmente funcional a medida que avanzamos a través de los módulos de este curso. En el camino el alumno levará a cabo prácticas ágiles de desarrollo de softwar, numerosas herramientas que los ingenieros de software deben sabe cómo utilizar, y un marco de desarrollo de aplicaciones web integradas modernas.\n\n                                            Syllabus\n                        BienvenidoDesarrollo de Aplicaciones Web: Conceptos BásicosMódulo #1 - Aplicaciones Web en ContextoEste módulo describe el contexto de lo que vamos a estudiar en esta especialización proporcionando en primer lugar una perspectiva histórica de las aplicaciones informáticas y web. A continuación se proporciona un resumen de cómo funciona Internet, y luego se discute cómo las aplicaciones web han evolucionado a lo largo de las últimas décadas. Posteriormente discutiremos algunos de los elementos de software moderno, incluyendo las herramientas más habituales que los ingenieros de software usan en la actualidad y las prácticas de desarrollo ágil que llevan a cabo. Se introducirán nociónes de patrones de diseño de software, para pasar posteriormente a la presentación del patrón de diseño de la arquitectura de n niveles, fundamental para el diseño moderno de aplicaciones web. También se discutirán algunos de los temas de actualidad relacionados con el desarrollo de aplicaciones web. Por último, se mostrará cómo configurar el entorno de desarrollo de software que el estudiante va utilizará en el resto de los cursos.Módulo #2 - Marcos de Aplicaciones WebEn este módulo el alumno aprenderá acerca de los entornos de aplicaciones web. Vamos a empezar por hablar de la evolución de los lenguajes de programación y el software y, a continuación, acerca de los entornos de aplicaciones de software. La disyuntiva fundamental que vamos a tener en cuenta se refiere a la productividad del programador en comparación con la eficiencia del programa. A continuación, aprenderá acerca de los entornos de aplicaciones Web, así como el patrón de diseño modelo-vista-controlador, que es la columna vertebral de muchos de estos marcos. También tendremos en cuenta cómo estos marcos apoyan los principios de programación ágiles asociados con el desarrollo de software moderno. Esto incluirá una discusión de los sistemas de control de versiones distribuidas, y con el objetivo de que el alumno aprenda cómo utilizar el  popular sistema Git. También ejemplificaremos cómo utilizar Git con una aplicación Ruby on Rails. Se utilizará Git para presentar todas las aplicaciones de programación en esta especialización.Módulo #3 - Gestión de DatosUna aplicación web exitosa proporciona información a los usuarios que es (1) útil, y también (2) de fácil acceso y comprensión. Esta información es obtenida a menudo de los usuarios, así como de otras fuentes de información, y debe almacenarse de una manera que le permita ser manipulada por la aplicación web. El enfoque típico es almacenar estos datos en una base de datos relacional. En este módulo aprenderá algunos conceptos básicos asociados con el modelado de datos en una aplicación web, incluyendo cómo especificar las relaciones entre las diversas entidades de datos. También investigaremos cómo conectar una aplicación web con  un almacén de datos en el lado del servidor, junto con buenas prácticas de diseño que harán que los datos sean más fáciles de usar en sus aplicaciones web a través del mantenimiento de la coherencia en toda la pila web.Módulo #4 - MiddlewareUna capa de abstracción que oculta los detalles sobre los dispositivos de hardware y software de una aplicación. Los servicios de middleware implementan funciones específicas de dispositivos, de modo que los marcos de aplicaciones no tienen que ocuparse de  ... Apoya el acceso a bases de datos - ODBC, JDBC.Módulo #5 - La interfaz de usuarioEn nuestro último módulo vamos a discutir acerca de la interfaz de usuario. Veremos CSS y JavaScript, y cómo se utilizan para añadir estilo a la estructura y el diseño de documentos HTML. También vamos a aprender acerca de Ajax y cómo mejora la solicitudes de los usuarios.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Desarrollo de Aplicaciones Web: Conceptos Básicos", "price": 0, "instructors": "Greg Heileman and Manel Martínez-Ramón", "institution_name": ["University of New Mexico"], "commitment": "", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/learn/aplicaciones-web", "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}