{"selfpaced": true, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    API (Application Programming Interface) endpoints are the connections between your application and the rest of the developer community.  In this course you will learn about writing secure, developer-friendly APIs that will make your back-end application thrive and keep your users happy.  \n\nAt the end of this course you will create the back-end for a social application called \"Meet n' Eat\" that matches together users based on their location and food interests.Why Take This Course?A crucial skill for a back-end or full-stack web developer is the ability to make  applications that are easily accessible and understood for other developers .  Mobile developers, front-end developers and other back-end and full-stack developers all rely on API endpoints to enhance the functionality of their applications.\n\n                                            Syllabus\n                        **Lesson 1 - What's and Why's of APIs**\n\nIn Lesson one of this course you will learn about the basics of APIs, why they are important, and how to choose the appropriate technologies for implementing a modern web API.\n\n**Lesson 2 - Accessing Published APIs**\n\nIn lesson 2, you will explore published APIs from Foursquare and Google Maps to see how these companies implement their API endpoints and leverage some of this information for our own use.\n\n**Lesson 3 - Creating your own API Endpoints**\n\nIn lesson 3 you will use Flask to build your own web server with API endpoints  that follow the constraints to qualify as a RESTful API.  \n\n**Lesson 4 - Securing your API**\n\nIn lesson 4, you will learn about API security and add OAuth login, token-based authentication, and rate limiting to your API endpoints.\n\n**Lesson 5 - Writing Developer-Friendly APIs**\n\nIn Lesson 5 you will learn some API best practices using real-world examples and  take on the final project.\n                                    ", "end_date": "2015-11-21T00:00:00Z", "title": "Designing RESTful APIs", "price": 0, "instructors": "Lorenzo Brown", "institution_name": [], "commitment": "6 hours", "subject_name": ["Programming"], "course_url": "https://www.udacity.com/course/designing-restful-apis--ud388?utm_medium=referral&utm_campaign=api", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2015-10-31T00:00:00Z"}