{"selfpaced": true, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    Congratulations! You’ve made it through the Introduction and Next Steps in SAP HANA Cloud Platform, and now it’s time to move to the next level. You’ve already been introduced to SAP HANA Cloud Platform, and have explored some of the advanced features and services that the platform provides.\r\nThis course will show you another perspective - putting SAP HANA Cloud Platform into good use for extending various SAP products. You'll learn about some of the extension options that SAP products support, and explore the required technologies and tools that will help you to be productive. As part of the course, you’ll create your first extension to SuccessFactors, as well as experiment with different collaboration options in SAP Jam.\r\nTo follow all the units, you should have completed the openSAP courses Introduction to SAP HANA Cloud Platform and Next Steps in SAP HANA Cloud Platform.\r\nThe course content assumes that you’re already familiar with the concepts and technologies introduced there. Registration, learning content, required systems, and the final exam are free of charge to all participants.\r\nTarget Audience\r\n\r\nApplication developers\r\nSAP partners\r\n\r\nCourse Requirements\r\n\r\nParticipation in the openSAP course Introduction to SAP HANA Cloud Platform\r\nParticipation in the openSAP course Next Steps in SAP HANA Cloud Platform\r\nBasic programming skills\r\nBasic knowledge of how to use an Eclipse development environment\r\n\n\n                                            Syllabus\n                        \r\nWeek 1: Extending SAP Cloud Products\r\nWeek 2: Cloud Extension in Details\r\nWeek 3: My First SuccessFactors Extension\r\nWeek 4: My First SAP Jam Extension\r\nI Like, I Wish: We Love Your Feedback … And Want More\r\nFinal Exam: Good Luck!\r\n\n                                    ", "end_date": "2015-12-08T00:00:00Z", "title": "Extending SAP Products with SAP HANA Cloud Platform", "price": 0, "instructors": "Rui Nogueira", "institution_name": [], "commitment": "6-8 hours", "subject_name": ["Programming"], "course_url": "https://open.sap.com/courses/hanacloud3-1", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["openSAP"], "start_date": "2015-11-03T00:00:00Z"}