{"selfpaced": true, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    If you’ve never built a website before and you have no coding or design experience, this is the place to start. In this project, we learn how to build a modern portfolio website for desktops, tablets, and mobile devices. We start with basic HTML and CSS syntax. Next, we learn how to build custom web pages with an image gallery and contact page. Finally, we walk through how to share a website live on the web.\r\nWhat you'll learn\r\n\r\nHow to write basic HTML\r\nHow to style web pages with CSS\r\nHow to purchase a domain and hosting\r\nHow to upload files\r\n\n\n                                            Syllabus\n                        Beginning HTML and CSS \r\nIn this quick tutorial, we’ll check out an example of the final web project we’re aiming to build. Then, we’ll learn how to code our first HTML element, which will help form the structure of our website. Finally, we’ll finish up by styling our website with some simple CSS. These two languages, HTML and CSS, form the basic building blocks of any web project.\r\nHTML First\r\nHTML is a special computer language that describes the structure of a document. With HTML, we can build web pages that contain text, images, and many other types of content. First, we’ll get started with a quick history lesson. Then we’ll dig into the latest advancements in HTML by creating a simple page structure.\r\nCreating HTML Content \r\nWhen building websites, it's best to write as much of the HTML structure as possible before moving on to CSS. In practice, you'll move back and forth between HTML and CSS, but building most of the structure first will make it an easier process. First we will start by creating the navigation for our site. Then, we can move on to structuring the image gallery and other page content. Finally, we'll finish by including a CSS file into our HTML page.\r\nCSS: Cascading Style Sheets \r\nCSS is a language that allows us to make designs that are well organized and beautiful. While HTML describes the structure of information, CSS describes how that information should be visually presented. Before we start coding the CSS for our site, we will spend some time learning about the syntax of CSS.\r\nCustomizing Colors and Fonts\r\nColors in CSS require a special coded format called hexadecimal. We will first learn about hexadecimal numbers and then we can use them in our color values. Then, we’ll learn how to find licensed fonts as well as how to include fonts in a webpage.\r\nStyling Web Pages and Navigation\r\nThe techniques necessary for styling an image gallery as well as horizontal navigation are actually quite similar. First, we will learn how to style a group of images and convert them into rows and columns for our image gallery. Then, we will use a similar CSS technique to create horizontal navigation from an unordered list.\r\nAdding Pages to a Website \r\nWhen multiple web pages are linked together, the pages become collectively known as a website. The home page will serve as the template for both our contact page and about page. In both pages, we will learn some new CSS techniques.\r\nResponsive Web Design and Testing\r\nModern websites are built with mobile and desktop users in mind. By building our site with fluid percentages (instead of fixed pixels), we’re off to a good start. However, we can add special CSS rules called media queries to further enhance the experience. After adding responsive design, we will test the site on a few devices.\r\nSharing a Website\r\nWe're finished coding our website and now it's time to deploy it live to the web so that other people can see it. First, we will purchase our domain and hosting. Then, we will use the File Transfer Protocol (FTP) to put our files onto our server.\r\n \r\nDebugging HTML and CSS Problems\r\nWhen creating websites, problem solving skills are essential. First, we will learn how to access the developer tools to find problems with our code. Then, we will walk through some common HTML and CSS issues and how to fix them quickly.\r\n \n                                    ", "end_date": null, "title": "How to Make a Website", "price": 25.0, "instructors": "", "institution_name": [], "commitment": "8-9 hours", "subject_name": ["Programming"], "course_url": "http://treehouse.7eer.net/c/259799/289776/3944", "duration": null, "language_name": ["English"], "provider_name": ["Treehouse"], "start_date": "2016-06-07T00:00:00Z"}