{"selfpaced": false, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    In this course, we will show you exciting examples of collaborative, interactive web applications that use various types of media including sound, images and big data. \n\nWe will show you how to build sites that provide precisely this functionality, using Meteor. We will also provide fully working example application code that you can use for your own commercial web projects. \n\nThe course also provides a range of advice and suggestions about how to develop bespoke web applications which match the requirements of clients, where clients are people who commission the product or people who use the product.  \n\nWe will take you through the development of the following applications:\n\n1.\tA portfolio website with collaborative blogging functionality.\n2.\tAn interactive, realtime, multi user music remixing system.\n3.\tAn interactive, online graffiti wall where users can collaborate to create graphics.\n4.\tAn interactive data visualisation platform for exploring and plotting big data in exciting ways.\n\nAt the end of this course, you will be able to:\n\n•\tImplement animated data visualisations and graphics using advanced user interface libraries such as vis.js \n•\tWork with external data sources \n•\tCreate multi user, realtime, collaborative environments\n•\tUse media APIs such as the Web Audio API\n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes\n\n                                            Syllabus\n                        Responsive Website Tutorials and Examples outline: Course overviewCreating a Portfolio Website with a BlogWelcome to the first module of 'Responsive Website Tutorial and Examples!'. In this session we will be exploring a real-world web development task based on a common brief that web developers have to respond to every day – producing a portfolio website with both static and dynamic content features. I hope you enjoy the module! -MickCollaborative Apps 1 : Music MachineWelcome to the second module of 'Responsive Website Tutorial and Examples!'. Meteor is great at making collaboration simple. You can make collaborative sites in a day or so that work across many devices including mobile. By the end of this session you will understand how to structure and build collaborative, real-time applications, how to integrate the web audio API, and how to specifically set and get variables stored in the database using basic interface elements.Collaborative Apps 2 : Drawing MachineWelcome to the third module of 'Responsive Website Tutorial and Examples!'.Meteor allows us to make creative, collaborative apps that work in real-time. Both the Client and the Server can insert information into a Mongo collection. Ordinary web users can do this interactively, without having to program the database manually. In this session we will look at this approach through the lens of collaborative drawing. You will learn how to create a canvas using d3.js, change attributes of the canvas, create client code for inserting data into the database and how to render database entries as a drawing. Creating a Data Visualisation ApplicationWelcome to the final module of 'Responsive Website Tutorial and Examples!'.In this session we will be looking at how to use data from external sources to create interactive  visualisations for the purposes of creating an interactive data visualisation web app.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Responsive Website Tutorial and Examples", "price": 0, "instructors": "Dr Matthew Yee-King and Dr Mick Grierson", "institution_name": ["University of London International Programmes", "Goldsmiths, University of London"], "commitment": "", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/learn/responsive-website-examples", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}