{"selfpaced": true, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    Did you know that images account for more than **60%** of the bytes on average needed to load a web page?\n\nIn this course you will learn how to work with images on the modern web, so that your images look great and load quickly on any device.\n\nAlong the way, you will pick up a range of skills and techniques to smoothly integrate responsive images into your development workflow. By the end of the course, you will be developing with images that adapt and respond to different viewport sizes and usage scenarios.Why Take This Course?Quick load times and responsive content leads to higher conversions. There's much more to images on the web than ``. Attributes like `srcset`, markup techniques using CSS, fonts, and inline images, and the brand new `` element are now available to help you create the best possible experience for your users. This course will help you ensure that you deliver the highest quality images with the fewest possible bytes.\n\n                                            Syllabus\n                        ### Lesson 1 - Getting up and Running\n\nBefore you start working with responsive images, you need to start debugging on your mobile devices. This lesson will help you get started with Developer Tools and mobile debugging.\n\n###Lesson 2 - Units, Formats, Environments\n\nYou can't optimize what you can't measure. In this lesson, you will start with comparing different kinds of images on the web and getting familiar with different units you can use to scale them.\n\nYou will also get a chance to set up your development environment so that responsive images become a painless part of your workflow.\n\nAt the end of the lesson, you will start working on the responsive blog project, where you have a chance to apply responsive image principles in a real-world scenario!\n\nTopics covered:\n\n* Sizing Images\n* File Types\n* Automation Tools\n\n### Lesson 3 - Images with Markup\n\nNot all graphics need to be .JPGs or .PNGs. This lesson dives into using markup techniques like CSS and icon fonts to create responsive graphics. While markup techniques are awesome because they are natively responsive, they are often **extremely** lightweight, requiring a fraction of the bytes of traditional images!\n\nAt the end of the lesson, you will replace extraneous images with markup techniques and take advantage of font icons to add social media icons to the responsive blog project!\n\nTopics covered:\n\n* CSS Techniques\n* Inlining Images\n* Unicode\n* Icon fonts\n\n### Lesson 4 - Full Responsiveness\n\nHere comes the full monty! In this lesson, you will make your images fully responsive using the new `` element! Along the way, you will use the `srcset` and `sizes` attributes. You will also learn the importance of `alt` attributes for your visually impaired users.\n\nAt the end of this lesson, you will make the blog project fully responsive, as you implement `` to display beautiful images across a range of device widths and pixel ratios.\n\nTopics covered:\n\n* ``\n* `sizes` attribute\n* `srcset` attribute\n* `alt` attributes\n                                    ", "end_date": "2015-03-24T00:00:00Z", "title": "Responsive Images", "price": 0, "instructors": "Sam Dutton", "institution_name": [], "commitment": "6 hours", "subject_name": ["Programming"], "course_url": "https://www.udacity.com/course/responsive-images--ud882?utm_medium=referral&utm_campaign=api", "duration": "2 weeks", "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2015-03-10T00:00:00Z"}