{"selfpaced": false, "topic_name": ["Web Development"], "description": "\n\n                    \n                    \n                    In this course you will learn how to apply concepts from interaction design and human computer interaction in order to design and build an interactive, professional looking website. You will learn how to make your web page designs adapt to different screen sizes using responsive grid layouts. You will learn how to add navigation and other design elements, and you will learn how to separate data and display using JavaScript objects and templates. \n\nAt the end of the course, you will be able to:\n1. Explain why users need to know where they are, where they can go and what is on a web page\n2. Create wireframe mockups of web pages \n3. Identify the key functional elements of web pages\n4. Use Bootstrap components to realise page designs\n5. Use JavaScript data structures such as arrays and objects to define the data used in a web page\n6. Use the Handlebars template library to convert data to HTML \n7. Add interactivity to templates using JavaScript event listeners\n\nIn this course, you will complete:\n1 website design assignment taking ~1 hour to complete\n1 programming assignment taking ~1 hour to complete\n4 quizzes, each taking ~20 minutes to complete\nmultiple practice quizzes, each taking ~5 minutes to complete\n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes\n\n                                            Syllabus\n                        Responsive Web Design: Course overviewIn this course you will learn how to apply concepts from interaction design and human computer interaction in order to design and build an interactive, professional looking website. You will learn how to make your web page designs adapt to different screen sizes using responsive grid layouts. You will learn how to add navigation and other design elements, and you will learn how to separate data and display using Java\nScript objects and templates.Web design principles Welcome to the first module of 'Responsive Web Design'. By the end of this module you will be able to understand the basic concepts of usability and user experience and tell the user where they can go with navbars. In addition you will be able to tell the user what is here with effective layout and understand the high level requirements of creating an accessible website. We hope you enjoy the module! Realising design principles in code Welcome to the second module of 'Responsive Web Design'. By the end of this module you will be able to set up a basic Bootstrap site and build Bootstrap collapsible, responsive navbars using titles and breadcrumb trails and you'll also be able to build multiple layouts in one with a responsive grid. We'll also be looking at installing Bootstrap themes. Enjoy!Adding content to websitesWelcome to the third module of 'Responsive Web Design' By the end of this module, you will be able to separate page structure from page content, use JavaScript objects and implement JavaScript templates with Handlebars as well as being able to display different data with the same template and the same data with different templates. Finally we will be looking at using a Bootstrap modal. We hope you enjoy the module!Building a full gallery appWelcome to the fourth module of 'Responsive Web Design'. By the end of this module you will be able to store objects in an array and display them with a template, and dynamically display single images from an array. We will also be looking at implementing a search function, and by working with complex data structures, switching between different templates. Enjoy!\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Responsive Web Design", "price": 0, "instructors": "Dr Matthew Yee-King, Dr Kate Devlin and Marco Gillies", "institution_name": ["University of London International Programmes"], "commitment": "", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/learn/responsive-web-design", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}