{"selfpaced": false, "topic_name": ["History"], "description": "\n\n                    \n                    \n                    The discovery of the skeleton of Richard III in a Leicester car park - and the recent revelations of an infidelity within his family’s bloodline - have made headline news around the world.\n\nIn this free online course, a team of scholars from the University of Leicester address a broad set of themes about the England Richard would have inhabited in the 15th century and look back at his rediscovery and reinterment.\n\nExplore the Wars of the Roses\n\nThe political scene in the 15th century was dominated by savage dynastic warfare – the Wars of the Roses - in which allegiances and power shifted among an aristocratic clique, with devastating outcomes.\n\nThe century also saw the abandonment of many villages through general population decline, and a shift towards greater use of the land for pasture farming. But demand for labour meant that the prosperity of working people rose, and towards the end of the century, the introduction of printing transformed access to literacy and books.\n\nEach week, we’ll address a different perspective of this period:\n\n\n  medieval warfare\n  the lives of peasants and farmers\n  food and culture\n  death and commemoration\n  reading and the introduction of printing.\n\n\nThe rediscovery and reinterment of Richard III\n\nWe’ll look at how historians and archaeologists have reconstructed Richard’s road to Bosworth - the battle in which he died - and how one of England’s most famous kings came to be buried in Leicester.\n\nThis will help you understand Richard III’s reinterment, as his remains were taken to Bosworth, through the villages connected with his last battle, and finally laid to rest in Leicester Cathedral in March 2015.\n\n\n\n                                    ", "end_date": "2016-05-02T00:00:00Z", "title": "England in the Time of King Richard III", "price": 0, "instructors": "Deirdre O'Sullivan", "institution_name": ["University of Leicester"], "commitment": "", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/england-of-richard-third?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-03-07T00:00:00Z"}