{"selfpaced": false, "topic_name": ["History"], "description": "\n\n                    \n                    \n                    How did the State of Israel come to be? How is it that an idea, introduced in 19th century Europe, became a reality? And how does that reality prevail in the harsh complexities of the Middle East?\n\nPresented by Professor Eyal Naveh, with additional units from Professor Asher Sussers' \"The Emergence of the Modern Middle East\" course, This course will take you on a journey through the history of Modern Israel. In this 1st part of the course we will explore:\n\nHow did the 19th century idea of a Jewish state become a reality? \n\nSo the next time you hear about Israel in the news, you will be informed enough about the history of this area to comprehend the many sides and narratives that interact to shape the complex reality of Israel today.\n\nPlease also join us in the 2nd part of this course: Challenges of Israel as a sovereign state\n\n* This course uses media material from various archives, courtesy to Yad Vashem Archive for their help.\n* This course is self-paced. Once you register,  you can participate in the course anytime, as often as you wish and over any stretch of time\n\n                                            Syllabus\n                        The Emergence of ZionismThis module will discuss the major reasons for the rise of the Zionist movement as the national movement of the Jewish people, as a modern, European phenomenon at the last third of the nineteenth century. It will focus on the main features of the movement as well as its first projects in Palestine. The module will end with the impact of World War I on Jews in general and on the Zionist movement in particular, leading to the Balfour deceleration. The Jewish Community (Yishuv) in Palestine Under British Mandate, 1921-1939Focusing on the first two decades of the British Mandate in Palestine, this module will explore the relationship between British authorities, Jews, and Arabs in the area. It will characterize the nature of the Zionist society that developed during this time by characterizing it as a \"state in a process\". It will also point to the emergence of initial Palestinian nationalism and its struggle against both the British authorities and the continuation of Jewish immigration and national building.WWII, the Holocaust, the end of the Mandate and the Establishment of IsraelThis module will explore the most tragic event of the Twenties century, namely the Second World War and the Holocaust. It will discuss the impact of this event on the Jewish Zionist society in Palestine. The module will continue by looking at the Zionist struggle against the British Mandate following the years of the war, the British decision to leave the area, the UN suggestion to create two states, one Jewish and one Arab, the failure of this project and the break of the war between Jews and Palestinians. We will analyze the declaration of independence and the creation of Israel as a sovereign state that had to fight for its existence and succeed to defend itself against an invasion of neighboring Arab states. It will explain the Palestinian catastrophe and the tragedy of Palestinian refugees.\n                                    ", "end_date": "2015-11-30T00:00:00Z", "title": "The History of Modern Israel - From an Idea to a State", "price": 0, "instructors": "Eyal Naveh", "institution_name": ["Tel Aviv University"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/history-israel", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-11-09T00:00:00Z"}