{"selfpaced": false, "topic_name": ["History"], "description": "\n\n                    \n                    \n                    Did World War 1 make heroism meaningless or was it the conflict that gave it the most meaning? We’ve designed this course in partnership with the BBC to help you explore, discuss and challenge the ways in which World War 1 heroism has been remembered. Our experts will take you through the changing British, French and German views of heroism and discuss important similarities and differences.\n\nThrough discussion and analysis of art, literature, film and television, guided by our experts, you will explore the portrayals of heroism before, during and after the war. Drawing on rarely seen archive, you will be curating a mini exhibition, exploring a war memorial and writing a review of a representation of war.\n\nTogether we will examine the changing faces of heroism, from distant figureheads and brave warriors to the ordinary “Tommy” and front-line nurses. The emergence of alternative hero figures, including anti-war campaigners and vulnerable, shell shocked soldiers, is also covered. We hope you will join the University of Leeds and the BBC in a fascinating reflection on the place of heroism, in the centenary commemorations of World War 1.\n\nThis course is part of a series designed in partnership with the BBC to commemorate the war.\n\n\n  \n    World War 1: Paris 1919 - A New World Order? (University of Glasgow)\n  \n  \n    World War 1: Aviation Comes of Age (University of Birmingham)\n  \n  \n    World War 1: Trauma and Memory (The Open University)\n  \n\n\n\n                                    ", "end_date": "2015-11-16T00:00:00Z", "title": "World War 1: Changing Faces of Heroism", "price": 0, "instructors": "Alison Fell", "institution_name": ["University of Leeds"], "commitment": "4 hours", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/ww1-heroism?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2015-10-26T00:00:00Z"}