{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                    \n                    Each module in Designing Cities will focus on a different aspect of city design including: How Today’s City Evolved; The Ideas That Shape Cities; Tools for Designing Cities; Making Cities Sustainable; Cities in the Information Age; Preserving Older Cities; Designing New Cities, Districts and Neighborhoods; The Challenges of Informal Cities and Disadvantaged Neighborhoods; and Visionary Cities.  Materials will be presented by the instructors and guest faculty from PennDesign through a series of five or more lessons per module, each typically 10-12 minutes long.   \n\nThe first lesson in each module will be a roundtable discussion among professors Stefan Al, Jonathan Barnett, and Gary Hack introducing the big issues associated with the subject.  Each succeeding module will be a self-contained illustrated presentation of a set of ideas and images. There will be a list of suggested readings for those who wish to follow up on the ideas in each module.\n\nEveryone enrolled in Designing Cities will be expected to complete 3 assignments.  These will be posted on the course site and they will be in the form of peer assessments.  There will be a great deal to be learned from the ideas participants submit, reflecting cities of all sizes and circumstances across the globe so once you submit your assignment, you'll be able to see what your peers have done.\n\n                                            Syllabus\n                        How Today’s City EvolvedSometimes people talk about cities as if they are outside people’s control, like the weather. We are using the word designing in the name of our course, because everything that happens to shape cities is actually the result of decisions made by governments, business investors, and citizens. Our course is about understanding how and why these decisions get made, and how they can be organized and improved. In other words, the ways cities are designed, and ways people can design them to be better. \n\nAlmost everyone lives in or near a city, and some people taking this course will just want to find out more about the forces that shape where they live. Other people who enroll in our course will come from the design professions: architects, landscape architects, urban planners, or students in these subjects. Others may come from economics, engineering or the social sciences. We hope some will be government officials or people active in organizations that try to improve their communities. \n\nThere are courses on line in engineering, mathematics, or the sciences, where you can be tested about whether you have mastered the material. Other courses are about understanding and evaluating something like a book, a film, or a painting, where your responses are clearly shaped by what you are studying. Designing Cities draws on so many subjects, and responds to so many different geographical and social conditions, that we have structured our assignments to draw you into a conversation, or as close to a conversation as we can get with so many participants. We will be asking you to identify and evaluate situations in your own communities based on what you will be learning in our course. We will select a few representative assignments to discuss after each assignment is due, and we hope that you will continue the discussion in the Forums. \n\nAs you will see from the schedule on the course website, each week will have a theme, and there will be 4 or 5 modules related to that theme you should watch each week. There will be 3 assignments. In addition to the presentations we and our guest lecturers will be making, we will provide you with suggested reading assignments for each module. We think the presentations stand on their own; but, if you have access to the books we suggest, you will be able to deepen your understanding, and find ways to go beyond our course on subjects that particularly interest you. \n\nSo again, welcome. More and more people in the world are being drawn to cities. How to design cities so they are sustainable and provide a better life for everyone could not be more important: right now and in the future. Ideas That Shape CitiesDuring the opening week we have given you a very quick sketch of the evolution of cities from pre-industrial times to today’s multi-centered urban regions. Of course you understand that charting the development of cities encapsulates almost everything that has happened in the last 200 years. We can’t possibly tell the whole story, but we hope we have a provided a useful framework. In this second week we will be introducing you to some of the ideas that have shaped the design of cities. We start with Modernist City Design, which is not so modern any more as it began in the 1920s, but is still a major force. Then we discuss Traditional City Design which builds on ideas about public space that go back before the industrial revolution. Green City Design, our next topic, is increasingly important today because of the need to preserve natural resources and adapt to climate change – but some of the ideas about Green City Design go back thousands of years, particularly in China, Korea and Japan. Systems City Design also has deep historical roots, but big advances in systems thinking about cities have been made possible by computers. We present these ideas as being of equal importance in their different ways, and remind you that the distinctions we make are to some extent artificial: city designers may need to draw on all four, depending on the situation. But there are people who take sides. Modernists attack traditional design as unsuitable today; traditionalists say that modernism makes cities unlivable. Green urbanists say that landscape should be primary, not buildings; and systems designers can assert that other kinds of design are inefficient and not based on objective standards. You are free to take sides, yourselves, if you wish, and most people will have preferences for one kind of design over another. But we think that treating city design ideas as exclusive ideologies is a mistake; improving cities is difficult enough already. It is important, however, to understand where city design ideas come from, to be able to recognize them in your own communities, and to know how to draw on these ideas when you make your own designs. Tools for Designing CitiesWe have seen that powerful design ideas can have a big influence on cities: towers surrounded by open space, a tree-lined boulevard, houses set amid lawns and gardens, a corridor of denser buildings supported by a transit line. But city design is not an “act of will” by an individual designer. It is a complicated process involving government, private investment, and the public – acting as both consumers, and as concerned local citizens. \n\nDuring this week we will begin discussing some of the important ways to manage the design and development of cities, such as investments in infrastructure, writing codes and design guidelines, and creating financial incentives for better city design, plus negotiation as a means of resolving disagreements – and sometimes outright controversy. \n\nGovernments and utilities decide where to locate water and sewer pipes, electricity, phone and cable wires, highways and bridges, trains and transit, airports and ports – and all these decisions have a powerful shaping effect on cities. The inclusive name for all these services is infrastructure. We will make a preliminary presentation about them this week, but infrastructure issues will be a recurring theme as our course goes forward. Later on in the course we will also be discussing informal settlements which have grown up without much infrastructure. The issue then becomes how to retrofit these places and give them necessary support. \n\nGovernment regulation is another big shaping force for cities. Most development does not go forward without some kind of official permit. If the public is getting the development it is officially requiring, the question becomes: is this really the best development, and – if not – why not? How to write codes and regulations to produce the most desirable city is another big city design issue which we will begin discussing this week. \n\nReal-estate investment is obviously another powerful force shaping cities. Every city design concept raises questions about who benefits and who is going to pay. This week we will begin discussing the financial incentives which can help implement city designs. \n\nFinally, people often disagree about what is best for a city. Resolving these differences requires negotiation, sometimes after confrontation. In your own community you may well have seen zoning disputes about a new shopping center or a tall building; controversies about changes in highways or transit routes; or concerns about the preservation of landscape and open space. These are all city design issues, and they demonstrate how important achieving the right kind of city design is for everyone. Making Cities SustainableLast week we learned about tools that manage the design and development of cities, including infrastructure investments, codes and design guidelines, financial incentives for better city design, and negotiations for common goods between those who build cities and those who make sure the public interest is served. These tools are even more important today, since climate change poses an acute threat to our cities, and the way in which our cities have been designed has been part of the problem. \n\nThis week we will deal with some of the most important ways of making our cities more sustainable. We will discuss topics such as ecological urbanism, transportation as a growth armature, managing water -including floods and water scarcity, and green infrastructure and renewable energy. \n\nLandscape architecture has gained momentum lately as an important instrument of urban development. Landscape urbanism, ecological urbanism, and landscape infrastructure are some recent concepts about how to synthesize cities with nature. This is not simply about topography and trees, but more broadly about ecologically driven infrastructure, public space, and urbanization. \n\nTransportation is more than moving people from place to place. It has the ability shape the form, function, and quality of life of cities. We will look at some of the ways in which transportation can contribute to the creation and continuing viability of great urban centers, using fewer resources. \n\nAs temperatures are increasing, glaciers are receding, ocean levels are rising, and storms are intensifying, how should we rethink the design and location of cities, especially coastal cities? As global warming shrinks freshwater supplies while populations continue to grow, how can we improve cities’ provision of water? We will look at some of the most important ways for cities to manage water, including how to fight water scarcity and prevent or mitigate floods. \n\nUrban green spaces should not be seen just as places for leisure time, but also as a viable alternative to grey infrastructure. For instance, green roofs, bio swales, and constructed wetlands can perform such functions as storm water management and water purification. Finally, instead of using traditional energy sources in cities that contribute to heating up our atmosphere, we can achieve zero-carbon communities by using renewable energy from natural sources that are continually replenished, including solar power, wind, biomass and geothermal heat. Today, as the effects of climate change become apparent, cities around the world should increasingly build green infrastructure and use renewable energy. Cities in the Information AgeThis week we focus on the issue of communication in cities. The ability to communicate with others is becoming the central purpose of cities as they become more and more centered on service economies. It determines where people wish to live, their travel patterns, the needs for electronic networks and the need for public places. We explore here what designers can do to create modern information centered places. Week 4 ended with a discussion of green infrastructure and renewable energy. The first session of Week 5 follows up on this, focusing on how cities can manage energy consumption. Energy is the essential input for cities, and the form, layout and energy sources play a large role in determining how efficiently cities operate. The second session joins energy and communication, by focusing on the electronic networks that are an essential infrastructure of cities. Energy is not simply electrons operating within wires or over space, but also the vehicle for conveying meaningful information. We see how cities control their systems, protect from threatening incidents, and promote communication between their residents. While new electronic networks allow people to live at a distance from each other, they have also promoted face-to-face communication. The public and private spaces in cities provide the settings for people to meet, see others and interact. How they are designed can make a large difference in whether cities are considered sociable. Finally, we explore the desire by many people to live in places that are near their work, shopping and recreation. Some cities have always had such places, but many more recent cities were founded on the modernist idea of separating the functions of cities. We will look at examples of successful mixed use buildings and neighborhoods. We are also in the midst of the second assignment, which asks you to identify great places in your city. Keep in mind the lessons of this and the past week’s sessions as you take photographs of places that you value. Preserving Older CitiesWe ended last week describing how mixing home, work, culture and recreation, rather than separating them by regulation is the key to creating 21st century cities. Inherited environments almost always have part of that urban mix already. This week we will deal with some of the most important ways of preserving the valuable qualities of older cities. Historic preservation is the practice that conserves, redevelops and interprets these environments. We will discuss topics such as landmarks and historic districts, adaptive re-use of old buildings, and preserving the industrial heritage. The first session deals with landmarks and historic districts: recognizing and listing historic buildings, and the public policy and design tools that help city designers preserve and regulate historic environments. But historic preservation is not just about congealing a place in time. While a curatorial approach to preservation restores buildings to specific periods, the urbanistic tradition of preservation seeks to preserve the whole place and life, while promoting economic vitality. As we reduce, reuse and recycle waste, so we can give buildings a new life when their use expires. This is what we call adaptive reuse: to give a disused building a new purpose in order to help prolong its lifespan, instead of outright demolition. Adaptive reuse helps preserve a building’s heritage features and ensures them for future generations. How can we adapt historic structures such as churches, palaces, and houses to the needs of the present, without destroying their authenticity? Old industrial buildings are often unique spaces. Built to withstand heavy industrial processes, and to accommodate large equipment, they often have thick walls, high ceilings, and exposed structures that give this rugged industrial look that is now all too fashionable. But as cities move from an industrial to post-industrial economy, what to do with our historic factories, warehouses and power stations? We will look at some of the most important examples of preserving and adapting our industrial heritage. Finally, toward the end of this week we will select some of your second assignments and review them. Designing New Cities, Districts and NeighborhoodsLast week we focused on ways to maintain and capitalize on the unique aspects of a city’s past, through creating historic districts and designating historic buildings, and re-using and sometimes repurposing older structures. Preservation has cultural importance, as well as contributing to the identity of a city. This week we turn to the opportunities to create new portions of cities and new places. One longstanding proving ground for new ideas about designing cities has been the process of creating new towns. After our introduction, the first module this week is on new towns. It comes in two parts, because there is so much to say about this aspect of urban design. Then we turn our attention to how to think about the task of designing smaller new urban places. How can the special natural features of sites be reflected in what is built? How important is compatibility in the new additions to a city? These issues often preoccupy urban designers and those reviewing plans. In the final module of the week, we discuss the subject of how to create walkable neighborhoods. Many of the older neighborhoods of cities are walkable, and much loved for it, while many of the modernist areas of cities are difficult to navigate on foot, and are organized to make driving almost a necessity. What constitutes walkability, and how can it be designed into communities? Foot power is the oldest form of locomotion, and may be the most relevant for a future where we seek to minimize energy usage and carbon levels. We also begin the final assignment this week. It is an opportunity to apply the ideas you have seen and thought about over the past several weeks to an issue or area of your city that you could imagine being better designed. Think expansively, and see what you can come up with! The Challenges of Informal Cities and Disadvantaged NeighborhoodsMuch of our discussion to this point in Designing Cities has focused on more developed cities in Europe, North America and Asia. But over the next several decades, the rapidly multiplying cities of Latin America, Africa and South Asia will represent a large fraction of the World’s urbanization. As David Gouverneur describes in his module, much of the urbanization will occur as informal settlements that need to be provided with facilities and services later. These are a different kind of challenge for urban designers, and interesting models are emerging in Latin American Cities. Two modules are devoted to essential techniques for upgrading the quality of such settlements. The first focuses on adjustments to land tenure, to provide security for informal settlements, and to allow a better designed transition from rural to urban development. The second looks at how services and infrastructure can be inserted into ongoing living informal settlements. The approach is that of surgical urban design. Finally we address the issue of what role urban design can play in combating poverty and urban deterioration. We look at examples of upgrading efforts that elevate both the spirit and economic prospects of areas of cities. We see that design is much more than a cosmetic exercise of producing beautiful citiesVisionary CitiesSo far we have focused on city designs that were actually built. But throughout history, architects, artists and philosophers, have imagined and drawn up visionary cities. Many of these designs are what we call “paper” projects, since they were typically relegated to the drawing boards only, and never built. Despite this, some were very influential, and inspired generations of city designers. \n\nThis week we will look at visionary cities. A range of new historical conditions, whether technological progress, political situations, or environmental problems, have inspired designers to radically rethink the future of cities. We will focus on four kinds: technological visions, revolutionary visions, ecological visions, and self-organizing cities. \n\nWhat would it be like to live in a walking robot, a floating city, or a flying spaceship? Is this mere science fiction, or the shape of cities to come? In the first lecture we will look at the most experimental cities of the past century, conjured up by designers electrified by technological progress. \n\nWhat if our cities were covered with large domes to be more energy efficient, or if floating pods housed climate refugees and cleaned carbon-saturated air? In the second class we will look closer at some of the most visionary eco-cities. \n\nDesigning cities is also a form of colonization, a tool to help establish political control over a territory. In the third class we will look at visionary cities drawn up by designers armed with a radical political mission: to subvert or overthrow the establishment. \n\nIn reality, many parts of the world do not follow grand designs. As we have seen last week, informal settlements follow a different logic, often characterized by self-help housing construction. In the final lecture, we will see how some designers have tried to harvest some of the self-organizing processes in cities. \n\nAs you are handing in your third assignment this week, we hope that some of the examples shown will inspire you to rethink the way in which we organize our cities. \n Concluding CommentsWe have come to the end of our course, and while we could say much more, you need a break from our thoughts and images. As we have said in past reviews, the assignments submitted have spanned the globe, and brought to us very interesting observations about what makes cities great.But let us add a few thoughts now: Most of the video lectures of Designing Cities have focused on the ideas about how to design cities – in history, today, and in the future. These ideas have had currency across national boundaries, and it is hard to find any place today that isn’t the product of ideas that can be traced to other countries and societies. However, to put ideas into action, there are strong local traditions about how city design is carried out. Some cities are largely built by city or national governments, acting as developers. Many of China’s recent new towns fit this description, as do some of the national capitals we have shown. Other cities are largely the result of private actions, often influenced by development regulations that governments impose. This is the case in most North American cities, as we have noted. Many European cities guide development more strictly by creating urban design plans that private developers must respect. Still other areas are created by special purpose entities chartered for the purpose of carrying out important projects, as with the British new towns and Battery Park City in New York. Cities also differ in the role of professionals and citizens in influencing development. In many countries, procedures have been created that provide an avenue for citizens to react to development plans and projects. England’s planning inquiries, and the public participation and hearing procedures of many American cities are examples. Some American cities have created design commissions, with a membership of design professionals and informed citizens, who review plans and projects before they are considered for approval. But in other countries, decisions on controversial changes to cities are part of the electoral process, with political candidates or parties running on their positions on projects. And in still others, unfortunately, staging protests can be the only meaningful way for citizens to be heard. These differences reflect the unique political and governance traditions of societies. Even within countries, there can be considerable differences in how city design decisions are handled from city to city. There is no single best process for creating a good city. If you wish to see your ideas implemented, the first step is to understand the formal and informal channels of influence on city development issues. In most cities there are opportunities for involvement in city design for people who have good ideas about how to make cities better, grounded in a realistic assessment of what is needed and what is possible. We hope what you have learned in this course will not only help you understand city design, but inspire you to participate in improving cities. Finally, let us say how much we have enjoyed sharing our ideas with you in this course. \n                                    ", "end_date": "2016-08-22T00:00:00Z", "title": "Designing Cities", "price": 0, "instructors": "Gary Hack, Jonathan Barnett and Stefan Al", "institution_name": ["University of Pennsylvania"], "commitment": "4-6 hours", "subject_name": ["Engineering"], "course_url": "https://www.coursera.org/learn/designing-cities", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}