{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    structures2-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    En vous basant sur les connaissances acquises lors du premier cours, vous comprendrez le comportement des structures composées de treillis, de poutres, de dalles et de cadres.\n\nLa détermination des efforts dans les structures s'effectue au moyen\n de la statique graphique, ce qui donne une approche très visuelle du \nprocessus et ne requiert que des connaissances mathématiques de base.\n\nLes exercices hebdomadaires permettent d'approfondir la connaissance\n de la matière et d'appliquer les concepts vus à des exemples de \nstructures réelles.\n\nENGLISH subtitles will be available for all course videos !\n\n\n                                            Syllabus\n                        Introduction, treillisAnalyse spécifique et typologie des treillisTours et consolesPoutresPoutres et treillis avec consolesPoutes-cloisons et voilesGrilles de poutres et dallesCadres et stabilitéLe cours est annoncé sur 11 semaines. Certaines semaines sont groupées parce que la matière en est particulièrement abondante.\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "L'Art des Structures 2 : treillis, poutres, dalles et cadres", "price": 0, "instructors": "Olivier Burdet", "institution_name": ["École Polytechnique Fédérale de Lausanne"], "commitment": "4-6 hours", "subject_name": ["Engineering"], "course_url": "https://www.coursera.org/course/structures2", "duration": null, "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2015-02-13T00:00:00Z"}