{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                    \n                    Have you come across large piles of garbage in neighborhoods and streets, or smelly waste disposal sites polluting the environment of low and middle income countries? Are you also convinced that improvements are necessary and do you want to know what kind of sustainable solutions are appropriate to better manage waste and enhance recycling and recovery? If yes, this course is for you! \n\nThis course provides an overview of the municipal solid waste management situation in developing countries covering key elements of the waste management system, with its technical, environmental, social, financial and institutional aspects. Besides understanding the challenges you will learn about appropriate and already applied solutions through selected case studies. The course also covers strategic planning and policy issues discussing future visions for waste management and the aspect of a circular and green economy. Considering the importance of the organic waste fraction, the course covers several organic waste treatment technology options such as composting, anaerobic digestion, and some other innovative approaches. \n\nSTATEMENT OF ACCOMPLISHMENT \nThis course offers free Statements of Accomplishment (SoA) issued by Eawag. You can earn a SoA by successfully completing the quizzes and the final exam. Please be aware that this SoA is not a paid Course Certificate issued by Coursera &amp; EPFL.\n\nMOOC SERIES “SANITATION, WATER AND SOLID WASTE FOR DEVELOPMENT”\nThis course is one of four in the series “Sanitation, Water and Solid Waste for Development\". Please visit the course page for more information.\n\n                                            Syllabus\n                        Week 1: Introduction to Solid Waste Management in Developing CountriesThe course begins with an overview of the current waste situation in developing countries. We will introduce the Integrated Sustainable Waste Management (ISWM) framework that provides a general overview of SWM systems and will guide us though this course. The modules of this first week deal with the physical components of a SWM system. At the end of this week we expected you to understand the different steps in the municipal solid waste management chain, the key requirements for an appropriate management as well as the main challenges in developing countries. Real study case examples will be introduced to support the understanding.Week 2: Introduction to Solid Waste Management in Developing CountriesIn the second week, the course will focus on the governance aspects also referred as the “soft” aspects of a municipal solid waste management (MSWM) system. The different stakeholders and their roles and responsibilities will be explained as well as legislative issues and financial mechanisms. Week 3: Organic waste treatment technologiesThe third week will focus on the treatment of organic waste. In this week you will learn the basics of two very common organic waste treatment technologies: composting and anaerobic digestion. Study case examples will be presented as well as some practical exercises. This will help consolidate your knowledge to better understand the underlying treatment principles and processes, the key issues in operation and maintenance of such treatment facilities and the benefits of the value products from the treatment.Week 4: Organic waste treatment technologiesWeek four will continue with an introduction to other organic waste treatment technologies. Although currently less common in practice, the treatment by vermicomposting, Black Solider Fly larvae or options of thermochemical conversion are explained and their potential for waste management in developing countries are discussed. The week then ends with two modules on special waste types, hazardous and health care waste as well as electronic waste, explaining the key challenges and opportunities for improvement in a low and middle income setting. Week 5: Assessment and planning methods for Solid Waste ManagementDuring the last week, the modules will focus more on strategic aspects of MSWM. Methods on how to integrate organic waste management into the municipal SWM system will be explained. Furthermore a standardized method to evaluate and compare systems with regard to their performance will be presented as well as the relevance of waste management and its impacts on climate change. Finally, the course will conclude with some reflections on the future of waste management introducing the concept of circular economy.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Municipal Solid Waste Management in Developing Countries", "price": 0, "instructors": "Christian Zurbrügg and Imanol Zabaleta", "institution_name": ["École Polytechnique Fédérale de Lausanne"], "commitment": "4-6 hours", "subject_name": ["Engineering"], "course_url": "https://www.coursera.org/learn/solid-waste-management", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}