{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                    \n                    Concept of probability and statistics is very important to solve various civil engineering problems. In this course, basic probability concept and different probabilistic models will be discussed. Concept and definition of random variables and different functions of random variables will be covered in the initial part of the course. Afterwards, focus is given to commonly used probability distribution functions in civil engineering. Discussions on statistics and sampling are presented towards the last part of the course. In this part, goodness of fit tests, regression and correlation analyses, estimation of distribution parameters from statistics, hypothesis testing and their significance will be discussed. A brief introduction to copulas is also included in this course. Each topic is discussed with reference to different application problems and their solutions in different fields of civil engineering, such as Structural Engineering, Transportation Engineering, Water Resources and Environmental Engineering, Geotechnical Engineering etc. \n\n                                            Syllabus\n                        1.Introduction\r\n2.Random Events, Assignment/Quiz\r\n3.Random Variables – Discrete and Continuous\r\n4.Probability Distribution Functions, Cumulative Distribution Functions, Assignment/Quiz\r\n5.Functions of Random Variables, Assignment/Quiz\r\n6.Expectation and Moments \r\n7.Joint and Marginal Probability Distribution\r\n8.Conditional Probability \r\n9.Functions of Multiple Random Variables, Introduction to Copulas, Assignment/Quiz\r\n10.Common Probability Models, Assignment/Quiz\r\n11.Probability and Statistics, Assignment/Quiz\n                                    ", "end_date": "2016-04-11T00:00:00Z", "title": "Probability Methods in Civil Engineering", "price": 0, "instructors": "Rajib Maity", "institution_name": ["Indian Institute of Technology, Kharagpur"], "commitment": "3-4 hours", "subject_name": ["Engineering"], "course_url": "https://onlinecourses.nptel.ac.in/noc16_ce03", "duration": "12 weeks", "language_name": ["English"], "provider_name": ["NPTEL"], "start_date": "2016-01-18T00:00:00Z"}