{"selfpaced": false, "topic_name": ["Civil & Environmental Engineering"], "description": "\n\n                    \n                    \n                    Cities are incubators of innovation and opportunities but they also face great challenges such as rapid urbanisation, climate change and inequality. How can smart cities address these challenges and become more resilient? And what role will people play in the design and planning of our smart cities?\n\nThis free online course will help you to navigate your own path through the complex landscape of smart cities. You’ll hear from smart city innovators and entrepreneurs, city leaders, communities and business, connecting with learners from around the world to reflect on issues facing smart cities of different sizes and situations.\n\nYou’ll explore what it’s like to live in a smart city, the role of systems thinking, living labs, open data, crowdsourcing and roadmaps. You’ll debate challenges of privacy, ethics and security, and weigh up the value of leadership, standards and metrics. You’ll learn how to co-create a smart city project where you live.\n\nGet started by capturing an image of what a ‘smart city’ means to you and share it with your fellow learners in the Smart Cities pre-course Padlet activity. It can be a photo, drawing or digital image.\n\nThe course has been developed as part of MK:Smart, a £16 million collaborative smart city initiative partly funded by a grant from the Higher Education Funding Council for England (HEFCE) and led by  The Open University, which will develop innovative solutions to support the economic growth of Milton Keynes.\n\nYour educators are Dr Lorraine Hudson who is developing the MK:Smart citizen education strand and Professor Gerd Kortuem, one of the lead academics of the initiative.\n\n\n                                    ", "end_date": "2016-11-07T00:00:00Z", "title": "Smart Cities", "price": 0, "instructors": "Gerd Kortuem and Lorraine Hudson", "institution_name": ["The Open University"], "commitment": "3 hours", "subject_name": ["Engineering"], "course_url": "http://www.futurelearn.com/courses/smart-cities?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-09-26T00:00:00Z"}