{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>O celular pode ser uma ferramenta muito interessante em fotografia se bem utilizado. Além de conferir alta mobilidade, com o olhar certo, os apps corretos e boas técnicas você pode transformar seu celular em uma câmera profissional e tirar fotos inusitadas e com altíssima qualidade. Ticiana Porto, Paulo del Valle e Gal Oppido vão te ajudar nessa empreitada viajando pelas ruas do Rio de Janeiro e São Paulo ensinando-o como fazer muito mais com o que carrega no bolso!<br><br>Acompanhe a fotógrafa Ticiana Porto durante uma visita a famosas locações cariocas, como a Pedra do Arpoador e a Praia do Leme, e confira maneiras de produzir imagens únicas e originais de paisagens previsíveis, ao colocar em prática treinos de composição que utilizam a perspectiva, a iluminação natural e a edição final de forma criativa.<br><br>Através de um passeio pela cidade do Rio de Janeiro, o fotógrafo e instagrammer profissional Paulo del Valle compartilha sua experiência para ensinar como é possível utilizar o seu celular como uma câmera fotográfica. Descubra porque o registro do inusitado pode se tornar o seu diferencial, e aprenda a tirar o melhor proveito de cada foto pelo domínio de aplicativos, truques e técnicas facilmente aplicáveis nos cliques do dia a dia.</p>\n\n<p>Acompanhe Gal Oppido pelas ruas de São Paulo para entender como a captação e o processamento de imagens pelo celular pode tornar a fotografia mobile extremamente vantajosa em termos de mobilidade, experimentação, e desenvolvimento do olhar. Conheça aplicativos e ferramentas capazes de fazer de seu celular um equipamento fotográfico tão relevante quanto às câmeras profissionais.</p>\n\n\n\n<hr>\n\n\n\n<p><em><br></em></p><p><em><em></em>Trailer - Créditos: <br>Something Elated by Broke For Free<br>Creative Commons — Attribution 3.0 United States— CC BY 3.0 US<br></em></p><em>\n\n</em><p><em></em></p>", 
    "end_date": null, 
    "title": "Curso Completo de Fotografia Mobile", 
    "price": "30.00", 
    "instructors": "Saibalá - Escola Online de Economia Criativa", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801114_53e4.jpg", 
    "course_url": "https://www.udemy.com/pacote-completo-de-fotografia-mobile/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T18:37:41Z"
}