{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>In this course you will learn how to take high-quality product photographs with your iPhone or any other Smartphone.</p><p>Taking product photos should be one of the most important things you do when opening an online e-commerce store. To turn visitors into buyers, you need to show them how great your products are, and the best way to do that is with great pictures. </p><p>Good product photography is important. It increases the perceived value of your products and makes your website appear more trustworthy.</p><p>But what if you aren't a photographer and don't have the funds to hire a pro? </p><p>That's why I put together the ultimate DIY guide to beautiful product photography, so that you too can shoot some gorgeous pictures just by using your iPhone.</p><p>In this course we offer a ton of tips to help you take product photos that sell. If you follow these steps in this course you can pull together incredible product photos for as little as $50.</p><p>I will show you how to get the most out of your product photography using the tools you already have. You'll learn how to get the best from your phone's camera, how to set up product photos from scratch, lighting tips, and how to process the images in post-production.</p><p>.You will also learn about some apps that can turn your iPhone into an even more powerful machine and many more tips!</p>", 
    "end_date": null, 
    "title": "Easy Product Photography with your iPhone or Smartphone", 
    "price": "20.00", 
    "instructors": "Dave B.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497308_b770.jpg", 
    "course_url": "https://www.udemy.com/product-photography-with-iphone-or-smartphone/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T03:30:48Z"
}