{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Why take this course?</strong></p><p>Do you want to photograph food like a pro? </p><p>Imagine being able to use your smart phone to photograph like a pro. </p>  <p>Would you like to learn the same lighting skills the pros use to make your photos look professional?</p><p>This course is for the social media expert who works with restaurants and the food industry.</p><p>This is also a good course for the food blogger, the foodie traveler and the food photographer enthusiast and anyone who enjoys going to different restaurants and photographing their delicious meals!</p><ul><li>Learn the same techniques that food photographers use in their studios.</li><li>Learn how to use natural light in different ways.</li><li>Learn how to change the exposure without having to edit with a software.</li><li>Discover how to use certain props to make the food look tasty in a photograph.</li><li>Learn about color and textures to enhance your images.</li><li>You will find out how to use editing tools to tweak your mobile images and make them look remarkable.</li></ul><p><strong>How Long is this course?</strong></p><p>This course will take you about 2 hours to watch.</p><p>It will take much longer to do the assignments.  Some assignments are more elaborate than others.</p><p><strong>What will I get from this course?</strong></p><p>How to light for food photography.</p><p>How to work with dark food and lighter food.</p><p>How to do photo sets.</p><p>How to work with shiny surfaces.</p><p>How to create a visual story.</p><p>At the end of the course you will know how to take top quality food photos with your smartphone!</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Food Photography: How to take Mouth Watering Photos of Food", 
    "price": "20.00", 
    "instructors": "Marguerite Beaty", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151570_5f17_2.jpg", 
    "course_url": "https://www.udemy.com/yummy-food-photo-course/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T19:16:25Z"
}