{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">iPhone Selfie Portrait Photography</strong></p>\n\n<p>Have you ever wanted to know how to take a high quality selfie portrait on your iPhone?</p>\n\n\n\n<p>Have you ever wanted a nice profile picture for your social media sites or for websites like dating websites?</p>\n\n\n\n<p>What if you could do that with just a couple of simple pieces of equipment?</p>\n\n\n\n<p>What if you could learn how to pose and light yourself, just using simple window light and create compelling portraits?</p>\n\n\n\n<p>And what if you could edit those portraits and create that “dslr”, professional camera look with free software on your iPhone?</p>\n\n\n\n<p><em>If you would like to learn all of the above, then this course is for you!</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Topics Covered In This Course</strong></p>\n\n\n\n<ul><li>Equipment - we will show you what equipment you need - on a budget - to take good selfies</li><li>Camera - we will help you to understand the limitations of your iPhone camera and how you can overcome them</li><li>Off Set Lighting - we will show you how to light a male subject the best way</li><li>Front Lit Lighting - we will show you how to light a female subject in the best way</li><li>Setting The Exposure - we will share simple techniques so that your images are always exposed well</li><li>Posing The Face - we will show you simple commercial photographer tricks to help you pose your face to its optimum</li><li>Editing A Male Portrait - we will show you how to edit a mail portrait</li><li>Editing A Female Portrait - you will learn how to edit a female portrait</li><li>Friend And Family Portraits:</li><li>In addition to all of that, you will also learn the basics of portrait photography, so you will be able to take beautiful images of your friends and family.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Enroll Now:</strong></p>\n\n<p>So join me on the other side and learn how to take powerful and compelling portraits on your iPhone that will bring out your absolute best side on social media sites!</p>", 
    "end_date": null, 
    "title": "iPhone Selfie Portrait Photography For Social Media", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/860740_f3f5.jpg", 
    "course_url": "https://www.udemy.com/iphone-selfie-portrait-photography-for-social-media/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-26T17:03:34Z"
}