{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Money Back Guarantee.....   What do you have to lose????</strong></p><p><strong>Updated April 30, 2016</strong></p>\n\n<p><strong>Use These Techniques and Tips for all Smartphone Photography not only just the iPhone 6.</strong></p>\n\n<p><strong>Make Money Selling Photos Taken with your iPhone or mobile device</strong></p>\n\n<p><strong>Learn the Top Sites to Sale your iPhone Photographs.  Make a monthly income selling photos</strong></p>\n\n<p>We skip all the fluff and take you <strong>straight to the important aspects for learning photography</strong>.  We hope you find the course engaging and helpful foremost. Learn to take <strong>photos and video just as good as DSLR cameras</strong> can take using only the iPhone 6.  In order to reach this level of <strong>professional photography with the iPhone 6</strong> users will need additional applications.  This course will require students to buy other applications in the App Store to follow along.</p>\n\n<p>Edit Your Photos to look like a professional did it right on your iPad or iPhone. You will be amazed how easy this can be done using applications we recommend.</p>\n\n<p>Students will learn how to manipulate Exposure and Focus to change the overall look of their photo.  Students will learn how to manually adjust White Balance using 3rd party apps.  The iPhone 6 is an extremely capable camera in the right hands for taking high quality photos and video.  It can take photos and videos with just as good of quality as many SLR cameras today.</p>\n\n<p>Enroll in my course and <strong>shock all your family and friends</strong> during the next family gathering showing them just how good of a photographer you can be equipped with only an iPhone.  It's my personal experience to take better photos with an iPhone 5 or later.  We are using an iPhone 6 in the course videos.</p>\n\n<p>Users can take great quality video using the iPhone 5 or later too.  This course will show you some of the best apps to use for the best results when shooting video.  We also do a section on our favorite accessories such as tripods and the Olloclip.  These can add lots of different looks to your photography.</p>\n\n<p>What Students can expect to learn from this course.</p>\n\n<p>1.  How to improve overall photo and video quality.</p>\n\n<p>2.  Several different apps for editing photos, taking better video, and photos overall.</p>\n\n<p>3.  Which accessories will improve the quality of the video and photos the most.</p>\n\n<p>4.  Learn how to change the settings in the stock camera app</p>\n\n<p>5.  Learn how to lock Exposure and Focus</p>\n\n<p>6.  Understand the Five Different Elements of Composition.</p>\n\n<p>7.  Best iOS Apps For Editing Photos</p>\n\n<p>8.  Accessories for taking photos and video</p>\n\n<p>We hope you find your time here helpful.  We invite you to leave any thoughts you may have about the course in the review section of the course.</p>", 
    "end_date": null, 
    "title": "iPhone 6 Photography Course 2016: Take DSLR Quality Photo", 
    "price": "20.00", 
    "instructors": "Mitch Stevens", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/451498_486b_7.jpg", 
    "course_url": "https://www.udemy.com/iphone-photography-tips-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-19T19:09:08Z"
}