{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">This is a thorough class where you'll learn the tools, techniques, and <strong style=\"\">photography tips</strong> to create gorgeous  iPhone photographs (using an iPod Touch or iPad as well). </p>  <p style=\"\">With more than 80 short video lessons - which you can access and review  anytime, forever... you will learn the information and techniques to take your  mobile photography to the next level.  </p>  <p style=\"\">Learn to use 'the camera that's always with you' -- whether it's for  travel, for business, for family, or just for fun with friends.  View the short (3:00) video above for an  overview &amp; introduction to this course.</p>  <p style=\"\"><strong style=\"\">Comments from folks enjoying this  class: </strong></p>    <p style=\"\"><em style=\"\">Very comprehensive, great pacing and  instruction.</em></p>    <p style=\"\">Seth</p>  <p style=\"\"><em style=\"\">Love the enthusiasm &amp; professionalism  of Chet Davis already...can't wait to learn more</em>. </p>    <p style=\"\">Farnoosh</p>  <p style=\"\"><em style=\"\">Chet has created a concise, easy to  follow, set of lectures for the iPhone... To sum up, the course hits all bases  and has taught me some new tricks, which makes using my new iPhone even more  enjoyable! </em></p>    <p style=\"\">Chris</p>  <p style=\"\"><em style=\"\">As someone technologically challenged I  appreciate how the viewer is walked through all the lessons. Very helpful and I  highly recommend!</em></p>    <p style=\"\">Annette</p>  <p style=\"\"><strong style=\"\">What You Will Learn in this  iPhone Photography Course</strong></p>    <p style=\"\">We start with the the settings and options in the iPhone camera app.  You'll see up close and personal the Apps (iPhone Applications) that will give  you great results - both in capturing photos, and in processing &amp; editing  photos right on your iPhone.</p>  <p style=\"\">Together we'll cover several techniques to improve your camera composition  -- and hone your creative eye.  And I'll  share with you the easy ways to connect to a computer for sharing and archiving  of your iPhone photographs.</p>    <p style=\"\">You can participate in this class via your desktop or laptop computer,  but you can also enjoy learning using the Udemy App on your iPad. This free App  is available in the App Store here: <a class=\"external-link\" href=\"https://itunes.apple.com/us/app/udemy/id562413829?mt=8\" rel=\"nofollow noreferrer\" style=\"\" target=\"_blank\">Udemy free App for iPad</a></p>        <p style=\"\"><strong style=\"\">Comments from those who have  learned from Chet Davis:</strong></p>    <p style=\"\"><em style=\"\">\"I REALLY enjoyed your class. YOU  make the class enjoyable and fun and you are so easy-going and an AMAZING  teacher.</em>\"</p>  <p style=\"\"><em style=\"\">\"Chet is an amazing teacher. His  clarity, knowledge, patience and warm personality are such a gift to any person  lucky to be learning from him\"</em></p>  <p style=\"\"><em style=\"\">\"I wish I had you as a teacher in  High School!\"</em></p>  ", 
    "end_date": null, 
    "title": "iPhone Photography Secrets", 
    "price": "35.00", 
    "instructors": "Chet Davis", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23738_98e6_3.jpg", 
    "course_url": "https://www.udemy.com/creating-great-photos-on-your-iphone/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-28T06:42:46Z"
}