{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>This course that teaches you how to apply professional photography techniques using your iPhone. You will be amazed how easy it is to take photographs like a pro!&nbsp;<br>  <br>   5 Star Review from one of our students:</p>    <p>&quot;This is brilliant. Not only does it show what the iPhone camera can do but it&#039;s a great course on how to get the best out of your photos too. It&#039;s so easy to follow and to navigate directly to the section you want as well. Highly recommended.&quot;</p>    <p><strong>This is the only iPhone photography course that takes you out in the field and lets you see what the camera sees! There is no better way to learn.</strong></p>    <p><span>It is a comprehensive video training course that will show you how to take stunning photographs that you never thought possible.</span><br>  <br>   With over 30 video training tutorials we teach you how to use all the functions of the standard iPhone camera that most people never knew existed as well as showing you how to frame a photo with the eye of a professional photographer.<br>  <br>   == LEARN HOW TO ==<br>  <br>   ● Use advanced features <strong>most people don’t know</strong> about in the iPhone camera<br>   ● Apply techniques used by professionals to <strong>capture stunning shots</strong><br>   ● Understand what makes a <strong>brilliant</strong> photo AND what doesn’t<br>   ● Work with lighting to highlight your subject matter for <strong>dramatic effects</strong><br>   ● Utilise the <strong>colour wheel</strong> to make your photos pop<br>   ● Compose photos using the rule of thirds and <strong>advanced compositional</strong> guidelines<br>   ● Edit and enhance your photos - the <strong>magic beyond</strong> the capture!<br>   ● Use specific apps for <strong>certain types</strong> of photographic effects<br>   ● Add accessories to the camera, which allow you to <strong>get more creative</strong><br>   ●<strong>Take a better photograph every time!</strong><br>  <br>   With practical advice taught through real life scenarios by professional photographer Matt Kemp this iPhone camera training course has been broken into easy to follow sections.&nbsp;</p>    <p><strong>Matt demonstrates different approaches to taking photos, and shows you how using some simple techniques can have a dramatic effect on your photography.</strong><br>  <br>   Watch and learn as Matt takes you through a variety of practical scenarios including:&nbsp;<br>  <br>   ● Landscapes<br>   ● Children<br>   ● Portrait<br>   ● Close up<br>   ● Panoramics<br>   ● and more ...<br>  </p>", 
    "end_date": null, 
    "title": "iPhone Photography Pro", 
    "price": "35.00", 
    "instructors": "Matt Kemp", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/55288_088b_9.jpg", 
    "course_url": "https://www.udemy.com/iphone-photography-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-20T14:06:42Z"
}