{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t  Start making high quality videos with your iPhone. No additional pricy video editing software is required - just your iPhone!  </p>  <p>  \t<strong style=\"\">Do you want to make professional videos using your iPhone?</strong>  </p>  <p>  \t<strong style=\"\">Do you want to impress your friend and your family with your videos?</strong>  </p>  <p>  \t<strong style=\"\">Do you have hundreds of video files on your iPhone and you don&#039;t know how to make a movie out of them?</strong>  </p>  <p>  \t<strong style=\"\">Did you ever try to make a movie from your videos, but it was to complicated or the video was so boring it didn&#039;t look professional?</strong>  </p>  <p>  \t  Well, fortunately you don’t need fancy computers and cameras to shoot and edit professional looking videos any more, you can do it all on your iPhone.  </p>  <p>  \t  Your iPhone can be used as a high quality video production suit, you can use it to produce videos for yourself or business use.  </p>  <p>  \t  If you like taking videos using your iPhone, you probably have quite a bit of videos on it, but what now? how do you make a short movie out of all the pieces of video? do you have to move your videos over to your computer to edit them? and what if you just shoot your kids birthday and want to edit it and post it to youtube and send to your family?  </p>  <p>  \t  Based on my last 13 years experinace from shooting and editing videos for a living, I invite you to look over my shoulder as I edit my own videos that I shoot using the iPhone, I&#039;ll show you precisely all the editing tips and tricks that I use on my job everyday and all the secrets the Pros like Steven Spielberg, Ridley Scott and Michael Bay use to trigger viewers emotions and the formula of getting aesthetic looking videos, and a lot more tricks I use on my job.  </p>  <p>  \tVideo is about triggering your viewers emotions. this is caused by both the editor and camera men doing something very precise.  </p>  <p>  \t  In this course You&#039;ll learn:  </p>  <ul style=\"\">  \t<li>Video shooting basics technics</li>  \t<li>How to get aesthetic shoots</li>  \t<li>What are the tools the pros use to make an engaging video</li>  \t<li>Editing your videos including - trimming, adding sound, adding voice over</li>  \t<li>How to add transitions,</li>  \t<li>How to import videos &amp; photos</li>  \t<li>How to animate pictures,</li>  \t<li>How to capture slow motion video on your iPhone</li>  \t<li>Importing and editing slow motion video.</li>  \t<li>... and much more!</li>  </ul>  <p>  \t  In short - everything you will need to make beautiful videos.  </p>  <p>  \t  Click on the &quot;take this course&quot; button and start making amazing videos!  </p>  <p>  \t  I will see you in the course.  </p>  <p>  \t  Uri Soglowek  </p>", 
    "end_date": null, 
    "title": "Make iPhone Video Like a Pro", 
    "price": "20.00", 
    "instructors": "Uri Soglowek", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324188_38b3_3.jpg", 
    "course_url": "https://www.udemy.com/professional-shooting-editing-video-on-the-iphone-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T14:52:33Z"
}