{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t    Want to make some extra Cash? This course shows you how to make money from photos you take every day, while on vacation, traveling, anywhere and everywhere!  </p>  <p>  \t                                I love taking photos. I use my phone all the time. Little did I know  that I can get paid for the photos right off my phone! It&#039;s a money  making machine!  \t  \t                                                    This is how it works. You take photos of everyday stuff. Upload them to the applications I show you, people buy them, and you get paid in your paypal account.  \t  \t                                                    The start ups are booming with mobile stock photography applications and the best part of it all is you can upload the same photo across all platforms and still make money off of it! It&#039;s your photo! <strong style=\"\">That&#039;s 5Xs the exposure to make 5Xs amount of money! </strong>  </p>  <p>  \t  Companies are looking for REAL LIFE IMAGES! Real pictures from real people, that&#039;s you and me. No more fake stock photography with expensive lighting or paying models.  </p>  <p>  \t  \t<strong style=\"\">Who uses and buys them? </strong>  \t  \t                                                    Big Companies like <strong style=\"\">Uber</strong>, <em style=\"\"><strong style=\"\">Sony</strong>, <strong style=\"\">Heineken</strong>, <strong style=\"\">Master Card,</strong> <strong style=\"\">Puma</strong>,</em> and more! They&#039;ll use them in their digital campaigns, brochures, catalogs, websites, everything!   \t  \t                                                    I will actually show you what to do <strong style=\"\"></strong>to make money. You&#039;ll have visuals of me, in action, on my phone, showing you my accounts and what to do. A <strong style=\"\">step by step guide </strong>showing you how to make money in mobile photography by photographing, editing, and uploading photos to the mobile market places. Learn how to make up to $4000/mo or more! This course is for everyone who owns a mobile smartphone.   \t  </p>  <ul style=\"\">  \t<li><strong style=\"\">5 Star Ratings!</strong></li>  \t<li>                  Course is for all ages!</li>  \t<li>                  Hours of content and materials.</li>  \t<li>                  I&#039;ll take you through my personal accounts to show you what to do to succeed</li>  \t<li>                  You&#039;ll see live updates </li>  \t<li>                  Complete this course at your pace!</li><li>Enter Contests to Win a Amazon Gift Card</li>  </ul>  <p>  \t                                                    Technique works for both Android and Apple devices!  </p>  <p>  \t                                  Just by selling a couple of photos will pay for this course!! I also launch contests and give out Gift Card (real money) to YOU THE STUDENT. Yes, I&#039;m paying YOU to take the class. So, what are you waiting for? Sign up! </p>  <p>  \t  \t<strong style=\"\">*EVERY PHOTO YOU DELETE IS LIKE THROWING AWAY MONEY! Seriously, you&#039;re deleting $$. Sign up today!*   \t</strong>  </p>", 
    "end_date": null, 
    "title": "Making up to $4000 a Month With Everyday Mobile Photography!", 
    "price": "20.00", 
    "instructors": "Graphic Designer & Photographer  Michael Lemma", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319606_1370_13.jpg", 
    "course_url": "https://www.udemy.com/making-money-mobile-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T17:35:51Z"
}