{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Are your images flat and lifeless? Filmmakers and photo journalists know that an awareness of light, atmosphere, moment, and connections are the keys to capturing engaging images.<br></p>\n\n<p>In this hands-on course you will learn how to film, edit and share images that tell stories.</p>\n\n\n\n<p>Who is this for? Instagrammers and creative people who want to make more cinematic photos and videos.</p>\n\n\n\n<p><strong>Stay tuned! You will learn how to make your first professional movie project with your mobile phone in 5 easy steps. And a whole lot more!</strong><br></p>\n\n\n\n<p>Use your iPhone to make your first real movie: The apps and techniques to help you produce a professional movie clip.<br></p>\n\n\n\n<p>Taught by the world expert on mobile video storytelling (7,500 students and more than 130 ★★★★★ Udemy reviews!)<br></p>\n\n\n\n<p>Elizabeth Shean says:</p>\n\n\n\n<p><strong>\"Great course! This was a terrific and easy-to-understand course on video production with an iPhone. I hadn't realized the video capabilities of the iPhone, along with the selected apps. Robb has created an engaging course and shows how easy it can be to create compelling and interesting videos using minimal equipment.\"</strong></p>\n\n\n\n<p>Enroll now and get started making incredible cinematic movies and video stories.</p>\n\n\n\n<p>What you will learn:<br></p>\n\n\n\n<ul><li>The best apps for making and editing video</li><li>How to build great visuals for your videos</li><li>How to plan an execute special shots like time-lapse and motion shots</li><li>What gear helps make the best pictures</li><li>Best practices for sharing your video stories with friends and family</li></ul>\n\n\n\n<ul><p><br>Tommy Kalman writes:<br></p><p><strong>“The right course for all iPhone photo geeks!<br></strong></p></ul>\n\n\n\n<p><strong>A wonderful course from a dedicated lecturer! The content fits to all types of audience, from absolute novices to more advanced users.\"</strong></p>\n\n\n\n<p><strong></strong>Enroll now and get started making incredible stories to impress your family and friends.</p>\n\n\n\n<ul><li>These step-by-step tutorials will introduce you iPhone photo and video storytelling.</li><li>These lessons are drawn from the top-selling Smart Film School courses on making pro video with an iPhone.</li><li>Learn how to find, film and tell a video story with your smartphone</li></ul>\n\n\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Mobile storytelling: Shoot and edit videos with iPhone, iPad", 
    "price": "20.00", 
    "instructors": "Robb Montgomery", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385238_ed40_4.jpg", 
    "course_url": "https://www.udemy.com/turn-your-iphone-into-the-ultimate-travel-camera-multimedia-video/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T01:17:40Z"
}