{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\">UPDATED: Over 1150+ students have enrolled! </strong><strong style=\"\">T</strong><strong style=\"\">his course is already making sales a few weeks old. See why. Great instructor support.</strong></p><p style=\"\"><strong style=\"\"></strong>I respond quickly to questions and create new materials based on what you ask for so you&#039;ll have the best support available to get the most from this course. This isn&#039;t just another <br style=\"\"></p><p style=\"\">Have you ever lost your phone or had it stolen? What was on your phone that you&#039;ll never get back? Apps, sure, but those are backed up in your account usually. What about your photos? You&#039;ll never see them again. Don&#039;t let that happen.</p><p style=\"\">This course will show you how simple it is to get your phone setup with the best protection on the planet for free.</p><p style=\"\">Here&#039;s what you get from this course:</p><ul style=\"\"><li>How to use Amazon and Microsoft&#039;s stable infrastructure to keep your media safe</li><li>How to use online cloud sync services</li><li>Setup sync on Windows, Mac, and Linux computers</li><li>Full step by step instructions for Dropbox and OneDrive</li><li>Sync options for iPhone and Android phones (OneDrive works with Windows Phone too)</li><li>How to configure for wifi only/unlimited data plans to disable sync over your cellular data</li><li>How to get 100 GB Free space of online storage space from Microsoft for one year</li><li>How to get another 15GB free space on OneDrive for life, (total of 130GB max)</li><li>How to free up space on your iPhone so it is usable again.</li></ul><p style=\"\">Americans lose their phone about one a year, or get it stolen. This does not include getting broken or upgraded. Phones are lost or stolen every hour in the US as well. It is a problem in many countries all over the world. <br style=\"\"></p><p style=\"\">I have many friends and family members who have lost their phones or broken them, so I wanted to create a simple quick course to help at least save the photos and videos that you can never get back.</p><p style=\"\">Another big issue I&#039;ve seen with iPhones especially is that the phone gets full and makes you have to delete photos to continue using it. This course shows you how to never have that issue again.</p>", 
    "end_date": null, 
    "title": "Never Lose Photos Again: Cloud Sync w/ Dropbox & OneDrive", 
    "price": "20.00", 
    "instructors": "Ryan Carter", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449876_80e7_5.jpg", 
    "course_url": "https://www.udemy.com/never-lose-your-mobile-photos-videos-again/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T22:43:28Z"
}