{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>*** BONUS ***</strong></p><p><span>Full source code of the camera stickers app INCLUDED as a <strong>FREE BONUS</strong>. All you have to do is join the course and it's yours.</span></p><p><span>***************</span><br></p><p>Hello my name is Yohann, I will be your instructor.</p><p>In this course, you will learn how to build your very own iPhone camera application and publish it in the iTunes app store.</p><p>The camera app lets the user take a picture, or a selfie or choose from the image gallery then the user can add stickers and frames onto the pictures and then share it on social networks or by text messages.</p><p>You will get to customize the app by creating your very own stickers and frames, and by customizing the look and feel of the camera app to your own taste.</p><p>Now I will show you every single steps you need to make it happen as I will be demonstrating you how i take the original app and make it into a Cat stickers camera app.</p><p>I came up with a system so that you don't need to know how to program and you won't have to write no even one single line of code. You also don't need to be an artist to create the stickers and the frames for i will show you tips and tricks to follow along. </p><p>Also you won't need to break the bank because all the tools and assets we use in this course are free to use* (free trial for Photoshop or use Gimp totally free)</p><p><strong>As a bonus, I give you the full source code</strong> of the camera app with lots of stickers for <strong>free</strong>! By the way, a source code like this would cost you thousands of dollars to get it built, and it could be yours just by taking the course..</p><p>By the end of this course, you will end up with your very own iPhone camera app published in the iTunes app store. and then you can brag to your family and friends!</p><p>Invest in yourself, invest in your education.</p><p><strong>Join the course now.</strong></p><p><strong><br></strong></p><p><strong><br></strong></p><p><strong><br></strong></p><p><strong><br></strong></p><p><strong>WHAT YOU WILL GET AFTER COMPLETING THE COURSE ?</strong></p><p>You will have your very own Camera iPhone app published and ready for sale in the iTunes app store, ready to bring in revenues from each sale.</p><p>You will be able to get all free resources, including the source code with an unlimited license.<br></p><p>You can publish apps every weekend, using the same source code, included within this course as a bonus, for free.</p><p>You will have the potential to make a lot of passive income, it's time to awaken the entrepreneur in you.</p><p><strong>************ READ ON ! **************<br></strong></p><p>Looking to boost your income as a App developer? Or maybe you're seeking a career change that gives you more free time and flexibility?</p><p>Then this is the right course for you.</p><p><strong>YOU CAN BECOME AN APP DEVELOPER</strong></p><p>iOS has a huge platform where you can sell your apps and potentially make a lot of money . This course will take you from the very basic concepts of game development using the free software given by Apple.</p><p><strong>HOW MUCH DO YOU HAVE TO SPEND?</strong></p><p>There is actually no more expenses except signing up besides getting the iOS developer license ($99/year). And we will show you the places from where you can get the resources we want without spending a single dollar.</p><p><strong>*********** HOW MUCH YOU CAN EARN *******</strong></p><p>You can earn more than you think. I am the one example of that after studying this method i could create and publish game app every week . So i could make a lot of money without putting more effort . Join this course and follow me and you will make a lot money than you think.</p><p>ENROLL THE COURSE NOW AND PUBLISH YOUR VERY FIRST iPHONE CAMERA APP, all it takes is one free afternoon.</p>", 
    "end_date": null, 
    "title": "Publish your own iPhone Camera Stickers app without coding", 
    "price": "20.00", 
    "instructors": "Yohann Taieb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688542_0601.jpg", 
    "course_url": "https://www.udemy.com/publish-your-own-iphone-camera-stickers-app-without-coding/", 
    "currency": "USD", 
    "subject_name": [
        "Mobile Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T01:30:04Z"
}