{"selfpaced": false, "topic_name": ["Law"], "description": "\n\n                    \n                    \n                    The main objective of this course is to help students understand the basic knowledge of international criminal law. We will learn through 20 chapters to achieve this goal, including from the United States, Germany, Britain, Sweden and the Islamic countries of the international criminal law scholar mainstream views and perspectives. This is an interest in international criminal law for concern, especially basic course students develop the Chinese criminal justice system offered to provide a more complete knowledge of international criminal law system. This course will show students the knowledge system of international criminal law. The main contents include: property and history, the birth of the International Criminal Court and the jurisdiction of the international criminal law, extradition and international cooperation, the general concept of the general principles of international criminal law, criminal responsibility and defenses, international crime, the provisions of the International Criminal Court Statute of the International Crime and other important international crime, international criminal law in the rules of evidence and procedure. \n\nThe main materials used in the course of \"the principles of modern international criminal law\" (Chinese People's Public Security University Press published in 2009), the book is the construction of the Ministry of Justice and the rule of law theory of law and ministerial research achievements, won the Beijing Higher outstanding teaching Award. Finishing the book in the United States system, basic Germany, Britain, Sweden and the important Islamic scholar of international criminal law perspective, the system shows the ownership of the modern discipline of international criminal law, historical development, the International Criminal Court, the International Criminal Tribunal of the domestic and international criminal law jurisdiction, extradition and international cooperation issues, the general principles of international criminal law, criminal liability and defense issues, international general concept of crime of genocide, \"the Statute of the International Criminal Court\" provisions and, crimes against humanity, war crimes, the crime of aggression as well as other important international crime, litigation system and the rules of evidence in international criminal law.\n\n \n\n                                    ", "end_date": "2014-12-22T00:00:00Z", "title": "02930106x: 国际刑法学 | International Criminal Law", "price": 0, "instructors": "Wang Shizhou", "institution_name": ["Peking University"], "commitment": "3-4 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.edx.org/course/guo-ji-xing-fa-xue-international-pekingx-02930106x", "duration": "14 weeks", "language_name": ["Chinese"], "provider_name": ["edX"], "start_date": "2014-09-15T00:00:00Z"}