{"selfpaced": false, "topic_name": ["Law"], "description": "\n\n                    \n                    \n                    Crime and criminal justice are vast and fascinating issues that highlight the complexity of defining and solving social problems.\n\nWhat traditional and innovative responses to crime and victimisation work? Why do people stop offending? Which interventions are seen by the community as being fair, lawful and effective?\n\nThe age of austerity in which we currently find ourselves has made these issues all the more significant and politically sensitive.\n\nJoin us as we explore the criminal justice system, from crime to desistance\nThrough this free online course you’ll develop an understanding of, and critical perspective on, the role of the state in the regulation of criminal behaviour and the key parts played by those involved in the criminal justice system.\n\nTogether, we’ll explore key themes of classic criminological research, contemporary debates on criminal justice institutions and processes, and international developments in policy and practice, focusing in particular on:\n\n\n  crime and criminal justice;\n  policing;\n  victims and victim support;\n  restorative justice;\n  prisons and places of confinement;\n  community sanctions and measures;\n  and desistance.\n\n\n​Learn with criminal justice academics and professionals\nOver seven weeks, you’ll learn with a team of specialists from the Centre for Criminological Research in the School of Law at the University of Sheffield.\n\n​As well as academics, we’ll talk to those with firsthand experience of the criminal justice system, including probation officers,  former prisoners and criminal lawyers. We’ll visit the police service in situ, witness a victim mediation session and even travel to Italy to learn about Cesare Lombroso, the father of modern criminology.\n\nYou’ll be invited to share your experiences and debate the key issues with other learners. What should the role of the police be? What are victims’ experiences of criminal justice and how can we support victims? Are there alternative responses to crime instead of prosecution and conviction?\n\n\n\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Crime, Justice and Society ", "price": 0, "instructors": "Matthew Bacon", "institution_name": ["The University of Sheffield"], "commitment": "3 hours", "subject_name": ["Social Sciences"], "course_url": "http://www.futurelearn.com/courses/crime-justice-society?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-05-30T00:00:00Z"}