{"selfpaced": false, "topic_name": ["Law"], "description": "\n\n                    \n                    \n                    Au plus tard en février 2016, le droit des contrats français aura été réformé par voie d’ordonnance, ainsi que le prévoit la loi du 16 février 2015 relative à la modernisation et à la simplification du droit et des procédures dans les domaines de la justice et des affaires intérieures. Un projet d’ordonnance a été soumis à consultation publique au début de l’année 2015, ce qui a suscité de nombreuses observations, dont une partie a été rendue publique. A l’heure où le MOOC débutera, le texte définitif de la réforme sera connu et pourra donc être étudié.\r\nCette réforme du droit des contrats est extrêmement importante, en ce que la matière concernée, qui n’a jamais connu depuis 1804 une refonte de cette ampleur, constitue le cœur de notre droit privé. Le droit des contrats est en effet d’application quotidienne et essentielle pour tous les citoyens et pour toutes les entreprises. Des contrats de consommation aux contrats de travail, tous les secteurs de l’économie sont concernés, de la banque à l’industrie, en passant par les services à la personne, les activités de bienfaisance, l’agriculture, les activités libérales. Le contrat est même employé en dehors de la vie économique (contrat de transaction mettant fin à un litige par exemple).\r\nAu sein de la collection « MOOC Sorbonne Droit », le MOOC Droit des contrats, proposé par l'Université Paris 1 Panthéon-Sorbonne avec le concours de l'Association française des juristes d'entreprise (AFJE), permettra d’appréhender cette évolution de notre droit sous ses différents aspects, en abordant le cadre général de la réforme, puis la formation du contrat, son exécution, et la fin de la relation contractuelle.\n\n                                            Syllabus\n                        Semaine 1 : le cadre général de la réformeLes objectifs de la réforme - ses lignes directrices – la méthode employée – l’entrée en vigueur des nouveaux textes et leur impact sur les contrats existants.\r\nSemaine 2 : la formation du contratL’encadrement du processus de formation - Incidences pratiques – Focus sur les contrats préparatoires – Les autres nouveautés, de l’obligation générale d’information à la suppression de la cause.\r\nSemaine 3 : l’exécution du contratLe renforcement de l’exécution en nature du contrat - L’admission de la théorie de l’imprévision – Les remèdes à l’inexécution. \r\nSemaine 4 : la fin du contrat et les autres questionsLa formalisation de règles sur la durée des contrats – les différentes formes de résolution – la nullité et la caducité du contrat.\n                                    ", "end_date": "2016-04-07T00:00:00Z", "title": "Droit des contrats", "price": 0, "instructors": "Bruno Dondero", "institution_name": ["Université Paris 1 Panthéon-Sorbonne"], "commitment": "3 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.france-universite-numerique-mooc.fr/courses/Paris1/16003/session01/about", "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["France Université Numerique"], "start_date": "2016-03-10T00:00:00Z"}