{"selfpaced": true, "topic_name": ["Law"], "description": "\n\n                    \n                    \n                    -- About the Course --\n\nFrom the Nuremberg trial to the case against Saddam Hussein, from the prosecution of Al-Qaeda terrorists to the trial of Somali pirates – no area of law is as important to world peace and security as international criminal law.  Taught by one of the world’s leading experts in the field, this course will educate students about the fundamentals of international criminal law and policy.  We will explore the contours of international crimes such as genocide, war crimes, terrorism, and piracy.  We will examine unique modes of international criminal liability and specialized defenses.  And we will delve into the challenges of obtaining custody of the accused and maintaining control of the courtroom.\n\n-- Course Syllabus --\n\nThis course comprises eight units (or \"modules\"). Each will include an assigned reading, typically an article or book chapter, as well as a simulation designed to bring the readings to life.\n\nI will also offer video lectures on each of the topics, accompanied by slides.  In addition, there will be online role-play exercises and debates, enabling the students to share their own insights. \n\nThe order of class sessions will be:\n\n(1)     History: From Nuremberg to The Hague\n\n(2)     International Crimes Part 1: War Crimes, Genocide, Crimes against Humanity, and Torture\n\n(3)     International Crimes Part 2: Terrorism and Piracy\n\n(4)     Special modes of liability: command responsibility, co-perpetration, and incitement\n\n(5)      Special defenses: insanity, obedience to orders, duress, and head of state immunity\n\n(6)      Gaining custody of the accused: extradition, luring, abduction, and targeted killing\n\n(7)      Pre-Trial Issues: plea bargaining, self-representation, and exclusion of torture evidence\n\n(8)      Maintaining control of the courtroom    \n\n-- Recommended Background --\n\nYou don’t have to be a lawyer and there are no prerequisites for this course. However, the course will be conducted at the level expected of advanced undergraduate students. Therefore, for all participants, reading and writing comfortably in English at the undergraduate college level is desirable. \n\n-- Suggested Readings --\n\nStudents should read the assigned online materials for each unit in advance of the class session.  \n\nIn addition, students are invited to subscribe to “War Crimes Prosecution Watch,” a free bi-weekly e-newsletter that summarizes the latest developments in the field of international criminal law.\n\n-- Course Format --\n\nThis course is made up of eight content units. Each unit is based on an online reading assignment, a video lecture of about one hour in length, and one or more role play exercises to stimulate on-line discussion. The course also offers in-video enrichment quizzes (ungraded) for each unit, a ten question multiple choice midterm diagnostics exam (ungraded), and a ten question True/False Final Exam.   \n\n-- FAQ--\n\nHow will this course be graded? \n\nThis course is graded on completion. In order to complete the course each student must: (1) finish each module (or “lesson”); (2) write at least one essay response of 200 words or more for at least one simulation throughout the course; and (3) get a score of 6 out of 10 or better on the Final Exam.\n\nWhat resources will I need for this course?\n\nFor this course, all you need is an Internet connection, and the time to read and discuss the exciting materials available online.\n\nWhat is the coolest thing about this course?\n\nThe topics we will be discussing are ripped from the headlines.  The topics are often controversial and thought-provoking, and always exciting.\n\n                                            Syllabus\n                        IntroductionThis introduction will give the learner a brief outline as to how the course is structured, how it will be graded and the ideal pace at which the course should be completed. This module includes a primer on international law that will introduce students with limited backgrounds on international law to the basic foundations of the field. This lesson also includes a video lecture and readings that outline the brief history of international criminal law starting with the Nuremberg Trials. Lastly, this module explores the legacy of the Nuremberg Court and lets students apply the lessons learned from Nuremberg to a fictional fact pattern through a set of simulations.Peace Versus JusticeThis lesson includes a video lecture and readings that elaborate on the tensions between peace and justice in international law and diplomacy. This lesson specifically explores the limits placed on the international duty to prosecute certain crimes and surveys the breaches of international law that require a duty to prosecute.Terrorism and PiracyThis lesson includes a video lecture and readings that discuss the international definition of terrorism and why reaching such a definition has become a divisive issue in international law. This lesson further discusses the intricacies of the modern international classifications of piracy.  Lastly, this lesson includes a simulation that allows students to apply the issues discussed in the readings and lecture to a fictional UN conference.Unique Modes of LiabilityThis lesson contains a video lecture and readings that explore the unique attributes of different forms of criminal responsibility in international law including command responsibility, joint criminal liability, control of the crime doctrine and incitement. This lesson also involves a simulation that allows students to apply the issues discussed in the readings and lecture to a fictional fact pattern.Specialized DefensesThis lesson includes a video lecture and readings that discuss the different defenses that exist for accused persons tried under international law. This lesson specifically explores the defenses of mental defect, intoxication, obedience to orders and head of state immunity. This lesson also includes a set of simulations that allow students to apply the issues discussed in the readings and lecture to two real life scenarios.Gaining Custody of the AccusedThis lesson includes a video lecture and readings that explore the options countries have in attempting to gain custody over an accused person under international law. Specifically, the lesson discusses countries’ use of tactics like abduction, luring, extradition and targeted killing. This lesson also includes a set of simulations that allow students to apply the issues discussed in the readings and lecture to one fictional fact pattern and one real life scenario.Pre-Trial IssuesThis lesson includes a video lecture and readings that examine the major pre-trial issues that are presented in international courts.  Specifically, this lesson analyzes the problems that come from self-representation, plea-bargaining and the exclusion of evidence. This lesson also includes a set of simulations that allow students to apply the issues discussed in the readings and lecture to two real life issues that have come before international tribunals.Maintaining Control of the CourtroomThis lesson includes a video lecture and readings on how, in the face of the problems discussed in the previous lesson, order is maintained in modern international courtrooms. The lesson also includes a simulation that allows students to apply the issues discussed in the readings and lecture to a fictional fact pattern.\n                                    ", "end_date": "2014-12-29T00:00:00Z", "title": "Introduction to International Criminal Law", "price": 0, "instructors": "Michael Scharf", "institution_name": ["Case Western Reserve University"], "commitment": "3-4 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/international-criminal-law", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-11-03T00:00:00Z"}