{"selfpaced": true, "topic_name": ["Law"], "description": "\n\n                    \n                    \n                    Le cours porte sur les usages généralement admis en matière de rédaction de contrats commerciaux, dans leur forme continentale ou anglo-saxonne. Les principales clauses de ces contrats sont examinées, à l’aide d’exemples tirés de contrats classiques.\n\n                                            Syllabus\n                        Semaine 1Ce cours introductif porte sur la façon d’aborder un contrat, les domaines dans lesquels les ordres juridiques prévoient en règles générale des dispositions impératives, et les documents qui précèdent la conclusion du contrat.Semaine 2Ce cours porte sur les relations entre des contrats distincts, en particulier les contrats en chaîne (contrat principal et contrats de sous-traitance). Les nécessités de coordination des contrats, et les clauses de jonction entre les différents contrats, y seront examinées. Le cours continue avec ce qui constitue les premiers éléments d’un contrat, à savoir la désignation des parties, et le préambule du contrat. Ces parties très standardisées du contrat peuvent parfois poser des difficultés imprévues, qui seront analysées en cours.Semaine 3L’essentiel du contrat est l’accord des parties sur les prestations réciproques qui devront être échangées. Les juristes ont peu de prises sur cet accord, qui relève avant tout de la volonté des parties. Selon le type de contrat, certaines précisions peuvent utilement être apportées par les parties sur les modalités d’exécution des prestations prévues. Ces prestations peuvent également faire l’objet de garanties diverses, qui seront examinées pendant ce cours. Semaine 4Le système juridique prévoit un régime de la responsabilité, qui peut être modulé par le contrat. Les parties peuvent ainsi limiter leur responsabilité, en modifier les conséquences, l’exclure en cas de force majeure, prévoir une clause d’adaptation en cas de hardship, ou encore utiliser diverses clauses pénales. Le cours porte sur ces différentes clauses et leur formulation standard.Semaine 5L’exécution du contrat peut donner lieu à des transferts d’actifs dont les parties veulent transférer ou pas la propriété. Diverse clauses standard permettent de clarifier la volonté des parties à ce propos. Le cours portera notamment sur les clauses de réserve de propriété permettent de conditionner le transfert de la propriété à l’exécution de la contreprestation.  Les ordres juridiques appréhendent cependant de façon très diverses la validité et les effets de cers clauses. Dans un deuxième temps, le cours portera sur la gestion de la durée du contrat, avec les clauses de résiliation ordinaire ou extraordinaire, et les clauses de liquidation du régime contractuel qui doivent être prévues dans les contrats de durée.Semaine 6Le dernier cours reviendra sur quelques clauses standard (Boiler plate clause) que l’on trouve dans tous les contrats sans que les parties ne soient toujours conscientes de leur utilité et de leurs effets. Le cours se conclura avec les clauses de résolution des litiges, en particulier les élections de droit et de for, et les clauses de règlement alternatif des litiges, qui se trouvent en règle générale à la fin du texte du contrat. \n                                    ", "end_date": "2015-03-30T00:00:00Z", "title": "Rédaction de contrats", "price": 0, "instructors": "Sylvain Marchand", "institution_name": ["University of Geneva"], "commitment": "3-4 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/contrats", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2015-02-16T00:00:00Z"}