{"selfpaced": false, "topic_name": ["Law"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/surveillance\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/surveillance-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    surveillance-001\n                                                                    surveillance-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    It’s easy to be\ncynical about government surveillance. In recent years, a parade of Orwellian\ndisclosures have been making headlines. The FBI, for example, is hacking into\ncomputers that run anonymizing software. The NSA is vacuuming up domestic phone\nrecords. Even local police departments are getting in on the act, tracking cellphone location history and intercepting signals in realtime.\n\nPerhaps 2014 is\nnot quite 1984, though. This course explores how American law facilitates electronic\nsurveillance—but also substantially constrains it. You will learn the legal\nprocedures that police and intelligence agencies have at their disposal, as well as the security\nand privacy safeguards built into those procedures. The material also provides\nbrief, not-too-geeky technical explanations of some common surveillance\nmethods.\n\n                                            Syllabus\n                        I. Introduction\nWe will begin with a brief overview of how surveillance fits into the American legal system. We will also discuss how surveillance issues can be litigated.\n\n\nII. The Basics of Surveillance Law\nNext, we will review established police surveillance procedures. Using telephone technology as a simple starting point, we will work through various sorts of data that investigators might seek to access—and the constitutional and statutory safeguards on that data.\n\nIII. Applying Surveillance Law to Information Technology\nHaving learned the basics, we will turn to more modern technologies. We will discuss snooping on email, web browsing, and mobile phone location, as well as hacking into devices.\n\nIV. Compelled Assistance to Law Enforcement\nWhat happens when data is technically protected? In this section, we will talk about the government’s (limited) ability to mandate backdoors and to require decryption.\n\nV. The Structure of Foreign Intelligence Surveillance Law\nThe law that applies to foreign intelligence activities runs parallel to the law that applies to police activities. We will compare the two systems of law and review key distinctions. The section places particular emphasis on Section 215 of the USA PATRIOT Act, Section 702 of the FISA Amendments Act, and Executive Order 12333.\n\nVI. Controversial NSA Programs\nIn the final section, we will review the conduct and legality of controversial National Security Agency programs. We will discuss in detail the domestic phone metadata program, PRISM, and “upstream” Internet monitoring.\n                                    ", "end_date": "2015-03-03T00:00:00Z", "title": "Surveillance Law", "price": 0, "instructors": "Jonathan Mayer", "institution_name": ["Stanford University"], "commitment": "1-3 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/course/surveillance", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-01-20T00:00:00Z"}