{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><h5 style=\"\"><strong style=\"\">Otorga un Certificado de Finalización a todos los estudiantes que desarrollen este curso y 24 PDUs en Categoría A a quienes poseen certificación del PMI.</strong></h5><p style=\"\"></p><p style=\"\">24 horas completamente orientadas a las mejores prácticas y a la comprensión de los <strong style=\"\">Fundamentos en Gerencia de Proyectos</strong>.</p><p style=\"\">Este curso es el mejor de su clase, dictado por uno de los más reconocidos gerentes de proyecto y conferencistas en Colombia y buena parte de Latinoamérica:</p><p style=\"\">Mauricio F. Morales R., PMP, MCP. Con más de 15 años de experiencia en gerencia de proyectos y consultor en algunas de las más importantes compañías en Colombia, como: Citibank, Unisys, Banco Agrario, Colpatria, Boehringer-Ingelheim, Codensa, Grupo Empresarial Bavaria, Projection Core, Ministerio de Defensa Nacional.</p><p style=\"\">Certificado como Project Management Professional (PMP) por el Project Management Institute y Microsoft Certified Professional (MCP) en Project 2010 Managing Projects.</p><p style=\"\">Tomando este curso usted <strong style=\"\">podrá aplicar, inmediatamente</strong>, las herramientas, conceptos, formatos e información entregadas, directamente a sus actuales proyectos, garantizando que tendrá un cambio total hacia la calidad, la oportunidad y la satisfacción de sus clientes internos y externos.</p><p style=\"\">Otorga <strong style=\"\">24 PDUs en categoría A</strong> para quienes poseen una certificación del PMI.</p><p style=\"\">Este curso presenta, de una forma sencilla, didáctica y amena, todo el camino que un administrador o gerente de proyectos debe recorrer con el fin de lograr cumplir los objetivos del mismo.</p><p style=\"\">El curso se estructura en cinco secciones principales, así:</p><p style=\"\"></p><ol style=\"\"><li style=\"\">Principios Fundamentales de la Gerencia de Proyectos</li><li style=\"\">Inicio del Proyecto</li><li style=\"\">Planeación del Proyecto</li><li style=\"\">Administración y Control del Proyecto </li><li style=\"\">Cierre del Proyecto.<br style=\"\"></li></ol><p style=\"\"></p><p style=\"\">Este curso le ayudará a definir cuál es el mejor esquema para gerenciar o administrar su proyecto, de una manera organizada, clara y <strong style=\"\">centrándose en los aspectos que se convierten en los factores clave de éxito para proyectos exitosos</strong>.</p><p style=\"\">Acompáñenos en este espectacular viaje, lleno de enseñanzas, casos reales, talleres, retroalimentación en vivo y sabios consejos en cuanto a proyectos se refiere.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Administre Proyectos Efectivamente - Curso de Fundamentos", 
    "price": "30.00", 
    "instructors": "Mauricio Morales", 
    "commitment": "25 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26336_a231_8.jpg", 
    "course_url": "https://www.udemy.com/fundamentosengerenciadeproyectos/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-09T16:19:22Z"
}