{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Based on extensive related hands-on practical experience, this course provides you with the skills and knowledge to effectively and efficiently discover skills and knowledge needed to provide valuable solutions for business and IT.</p><p>Learn Agile SCRUM Development for Project Managers course authored by Chuck Morrison, MBA, PMP with over 25 years Program Management and Business Architecture experience in Silicon Valley California.  </p> <p>Agile development offers a lightweight framework for supporting teams given constantly evolving functional and technical landscape. </p><p>The Agile approach maintains focus on the rapid business value delivery. The result is organization teams with significant overall risk reduction associated with traditional software development. Agile development accelerates delivery of required business value. Through a process of continuous planning and feedback value is continuously maximized throughout the development process.   </p><p>All affected stakeholders including sponsors, subject matter experts, and other resources must be involved in collaborative development viable solution based on Agile Methodology and Methods for any executive decisions. This requires the leadership, skills, and knowledge or experienced analyst and architects capable of supporting an effective business solution needed to return business systems to proper operation.</p><p>Critical processes emphasized during this course are collaboration, listening, analysis, and modeling techniques needed for effective and efficient system operations solutions. This course helps you develop the skills and knowledge needed to support effective solutions and decisions regardless of your role.</p><p>If you find my course useful, please consider leaving a review and rating. Your review is much appreciated. You can go directly to the review page for this course then click and enter your review and rating.</p><p>Thank You and Best Regards, </p><p>Chuck Morrison, MBA, PMP</p>", 
    "end_date": null, 
    "title": "Agile SCRUM: Learn Agile Development for Project Managers", 
    "price": "25.00", 
    "instructors": "Chuck Morrison", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572700_d298_5.jpg", 
    "course_url": "https://www.udemy.com/learn-agile-scrum-development-for-project-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T19:24:31Z"
}