{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Founded in 2012, Master of Project Academy taught 50,000+ IT &amp; Business professionals in more than 170 countries around the world.</strong></p><p><strong>Now, Master of Project Academy's exclusive &amp; premium courses are in Udemy!</strong></p><p><strong>Go through an overview of Agile &amp; Scrum in 30 Minutes! Get the details and prerequisites of the MOST POPULAR Agile &amp; Scrum Certifications.</strong></p><p>Change of technology is at the pace of it was never before. Market conditions, harsh competition and time-to-market are biggest concerns of today's organizations, especially for technology companies. In order to adapt this fast changing environment, most of the organizations adapt Agile Project Management methodologies. This enables the organizations to produce valuable outputs faster. And Scrum Framework is the most popular Agile Methodology. </p><p>Because of this shift in project management methodology, organizations seek for Agile Practitioners, Scrum Masters, Agile and Scrum Professionals to manage their software development projects. Take this opportunity to learn Agile Project Management and Scrum Framework, earn a new skill, get an Agile &amp; Scrum Certification and take a head ahead in your career. </p><p><strong>You will get an overview for Agile Project Management-Scrum Framework-Certification Prep course. </strong></p><p>Course includes agenda, list of agile methodologies and framework. Most popular agile methodologies and frameworks are described briefly: Extreme Programming, Lean, Kanban. Then, the most popular Agile framework, Scrum Framework is described briefly. Finally, agile &amp; scrum certifications are described. <br></p>", 
    "end_date": null, 
    "title": "Agile & Scrum Overview - Certification Info", 
    "price": 0, 
    "instructors": "Master of Project Academy", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794804_d6b1.jpg", 
    "course_url": "https://www.udemy.com/agile-scrum-overview-certification-info-course/", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T15:29:59Z"
}