{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>“Finally! A Step-By-Step Course Created Specifically For New Project Managers Like Yourself Who Want To Run Projects Effectively Right From Day One!”</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">AMAZING Project Management: </strong>\n<em class=\"redactor-inline-converted\">Project Management For New Project Managers</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>AMAZING Project Management is a complete training course dedicated to helping new project managers learn how to <em class=\"redactor-inline-converted\">effectively and efficiently</em> manage their own projects. This unique course is led by an expert Project Manager who’ll not only walk you through the complete life cycle of a project in detail, but you’ll also be given advice and tips on how to start off on the right foot from day one. These tips and steps will help you no matter the size of your overall project, big or small. You’ll also learn everything about the different roles in a project, how to give your project a boost when momentum comes to a standstill, learn good practice techniques and processes, and even learn how to finish a project by closing it down in the right way.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why you should enroll:  </strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Successfully manage large and small projects, and anything in between, by applying the right amount effort following AMAZING Project Management– an authoritative approach and blueprint to project management</li><li>Follow the step-by-step roadmap of the project lifecycle so that you know what to do and when to do it</li><li>Use ready-made templates to help document, track and manage your projects efficiently </li><li>Save time producing project plans by following the specific planning checklists </li><li>Apply proven techniques to keep your project pro-actively managed and on track</li><li>Support, motivate and influence your team and stakeholders by using the complete set of role descriptions provided</li></ul>\n\n\n\n<p><strong>The AMAZING Project Management training course contains:</strong><br></p>\n\n\n\n\n\n<ul><li>17 EASY TO FOLLOW VIDEOS with over 2.5 hours of content. These are created from an experienced, accredited and trusted Project Manager</li><li>18 PRACTICAL ACTIVITIES that’ll help you put everything you learn into practice right away</li><li>22 RESOURCES that are easily downloadable and customisable to use again and again on all your current and future projects</li></ul>\n\n\n\n<p><em class=\"redactor-inline-converted\"><br></em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">“This breakthrough course is meant to help instruct and simplify the processes of being a new Project Manager, and to take away the stress and frustrations that are normally associated with being a new manager.”</em><br></p>", 
    "end_date": null, 
    "title": "AMAZING Project Management", 
    "price": "20.00", 
    "instructors": "Susan Tuttle", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702810_fc67_7.jpg", 
    "course_url": "https://www.udemy.com/amazing-project-management/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T10:51:04Z"
}