{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t This is a basic project management course that will provide attendees with a good understanding of the basic concepts related to planning projects, although aimed at students who are new to projects and planning it has some elements that will reinforce planning processes for more seasoned project professionals.  </p>  <p style=\"\">  \t We will discuss concepts like  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t ·Gantt Charts  \t</p>  \t<p style=\"\">  \t\t ·Dependencies  \t</p>  \t<p style=\"\">  \t\t ·Baselines  \t</p>  \t<p style=\"\">  \t\t ·Progress Tracking  \t</p>  \t<p style=\"\">  \t\t ·Work Breakdown Structure  \t</p>  \t<p style=\"\">  \t\t ·Top Down Planning  \t</p>  \t<p style=\"\">  \t\t ·Critical Path Analysis  \t</p>  </ul>  <p style=\"\">  \t Explaining and then using these concepts and approaches to build a simple example project plan in Microsoft Project 2010.  The steps discussed can be applied to any version of MS Project and are also valid in other project planning software tools.  It is not necessary to have MS Project 2010 installed but using the examples covered in some form of planning tool will aid the students.  </p>  <p style=\"\">  \t Students are guided through each of the concept areas building layers of understanding and introducing context to each subject discussed; starting from the Gantt Chart and a review of Henry Gantt’s idea to communicate plans, confirming how modern planning approaches seek to represent and control the dependencies between tasks.  Moving on to discuss how the project plan is a valuable and useful communications tool both within the project team and outwardly to stakeholders and senior management.  </p>  <p style=\"\">  \t Students will take a look at how the plan when effectively tracked can improve estimating and delivery for future stages and what steps might be taken to re-plan the project as a result of items tracked.  </p>  <p style=\"\">  \t Once the basic concepts have been covered students can see how these might be applied to an example but simple project, using a top down planning approach and giving a simple and easy assemble of the project plan.  The resulting plan shows how resources are assigned and provides an outline cost profile for the project.  </p>  <p style=\"\">  \t The material covered will provide a solid foundation for future project planning, and further training in project management, leaving students with enough knowledge to build and track plans in their own projects.  </p>", 
    "end_date": null, 
    "title": "Basics of Project Planning", 
    "price": "20.00", 
    "instructors": "Mike Harkin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164178_804f_9.jpg", 
    "course_url": "https://www.udemy.com/basics-of-project-planning/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-14T10:56:30Z"
}