{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t In today working environment, project management has become an integral part of modern day business operations. Understanding and applying the project management concepts is now an obligatory requirement for all progressive organizations today.\r\n</p>\r\n<p>\r\n\t This course has been designed for everyone; entry level, project management enthusiasts, those wishing to enhance their project management skills, especially professionals in the field and for those preparing for project management certification tests.\r\n</p>\r\n<p>\r\n\t The course relies on the Project Management Institute (PMI) project management document; <strong><em>A Guide to the Project Management Body of Knowledge (PMBOK Guide, 5<sup>th</sup> Edition).</em></strong>\r\n</p>\r\n<p>\r\n\t This course has been designed to help you acquire all the necessary earned value management skills in project management in 30 minutes.\r\n</p>\r\n<p>\r\n\t <strong>&ldquo;Become Earned Value Management (EVM) Expert in 30 minutes&rdquo;</strong> has been designed in a simple way by providing simple introduction to project management and EVM. The course identifies and explains EVM core and secondary components. By the time you complete the course, you will be able to identify, explain, calculate, interpret and write precise project performance report.\r\n</p>\r\n<p>\r\n\t The course contains practical exercises that will help you retain all the necessary skills to be proficient in using Earned Value Management on your project. It will also expose you to modern tools that will simplify roles in generating EVM values.\r\n</p>\r\n<p>\r\n\t Lastly, the course provides practical hints on lucrative career opportunities open to you as project management expert.\r\n</p>", 
    "end_date": null, 
    "title": "Become Earned Value Management (EVM) Expert", 
    "price": "20.00", 
    "instructors": "Maxwell Owolade", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138090_0e11_8.jpg", 
    "course_url": "https://www.udemy.com/become-earned-value-management-evm-expert-in-30-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-26T12:38:23Z"
}