{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      Traditional project management techniques are no longer keeping up with the speed and sophistication needed to succeed in today&#039;s fast-paced world.  Software development has been shifting to &quot;Agile&quot; project methods for about a decade now, but very few projects are purely about software.  Commitment-Based Project Management (CBPM) is an Agile project management method that can be applied in any project environment.  </p>  <p>  \t      CBPM evolved in the mid-1990&#039;s to help high tech teams that absolutely needed to meet aggressive deadlines.  It has since been used with success on a very diverse range of projects.  There are two key differences between CBPM and other project management approaches: 1) CBPM focuses on deliverables vs tasks at all levels of organization to ensure clear expectations and leave room for innovation, and 2) CBPM teaches a slight shift in the language used to plan and monitor projects to help teams operate from strong deliverable commitments to each other.  </p>  <p>  \t      Team members like CBPM because it is participative and creates greater clarity and transparency about what is going on on projects.  Teams that follow CBPM, have a greater sense of control and avoid painful &quot;panic mode&quot; down the stretch.  Project Managers like CBPM because it facilitates more responsibility and accountability from all team members and because when used correctly, it prevents painful surprises and rework.  </p>  <p>  \t      The instructor, Timm Esque, is an award winning author and consultant who along with others created this approach to projects and has been helping teams use it since 1996. Timm has been cited as an expert on performance under pressure in the Wall Street Journal. He has published over 50 articles and book chapters, 3 books, and has presented or consulted in over 15 different countries.  </p>  <p>  \t      As Managing Partner of Ensemble Management Consulting, Timm is hoping to use these Udemy courses to get the word out about CBPM and create a broader community of CBPM practitioners.  </p>  <p>  \t      This first course is an introduction suitable to anyone who has experience working on or leading projects at any level.  It contains about 45 minutes of lectures.  There are some reflection questions and a couple activities designed to give you a sense of how CBPM is different.  The purpose of the first course is to provide an introduction to CBPM and help you decide if it would make sense to continue to Course 2.  <span>However, it will also point you to other CBPM resources, several of which are free online.</span>  </p>  <p>  \t      If you decide to continue to the second CBPM Course on Udemy, you will learn a new structure, language and techniques for running regular status review meetings.  Those who implement these techniques should see very quickly how CBPM can add value to your current practices, and help any team be more productive and more predictable.  </p>  <p>  \t      Those who learn to implement CBPM fully, can earn performance-based CBPM certifications, offered by Ensemble in partnership with the International Society of Performance Improvement.  </p>", 
    "end_date": null, 
    "title": "CBPM Course 1: Creating Agile and Accountable Project Teams", 
    "price": 0, 
    "instructors": "Timm Esque", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315894_bad3_48.jpg", 
    "course_url": "https://www.udemy.com/cbpm_course1/", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T15:49:31Z"
}