{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">While Course 1 was intended as an overview, this course is intended to help you get started implementing Commitment-Based Project Management on the teams you lead. The course focuses on your regular team meetings. It provides what is likely a little different structure and agenda for those meetings, intended to produce increased clarity about who needs to deliver what to whom, and if commitments are being met.We expect and hope that after applying the CBPM approach to regular team meetings as part of this course, you continue this approach and want to learn even more about CBPM. Like Course 1, the target main target audience is what we call embedded project managers - those who manage projects in organizations that have formal project processes. But anyone that has lead responsibility for at least part of a project can utilize the practices taught in this course. Course 1 is pre-requisite to Course 2, as it provides a larger context for the specific practices in this course.</p><p style=\"\">The course contains a little less than an hour of lectures, but you should expect to take a few weeks to complete the course if you are implementing the lessons as you go which is intended. This course also offers a free 30 minute phone or teleconference (e.g. Skype) consultation you can schedule with an Ensemble consultant. You will be prompted in the course when it is about the right time to use this consultation. We had planned to charge for this course and we may still, but we have decided to offer it free for now.</p><p style=\"\">The instructor, Timm Esque, is an award winning author and consultant who along with others created this approach to projects and has been helping teams use it since 1996. Timm has been cited as an expert on performance under pressure in the Wall Street Journal. He has published over 50 articles and book chapters, 3 books, and has presented or consulted in over 15 different countries.As Managing Partner of Ensemble Management Consulting, Timm is hoping to use these Udemy courses to get the word out about CBPM and create a broader community of CBPM practitioners.</p>", 
    "end_date": null, 
    "title": "CBPM Course 2: Improving Project Performance - FAST", 
    "price": "30.00", 
    "instructors": "Timm Esque", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494266_08c3.jpg", 
    "course_url": "https://www.udemy.com/cbpm-course-2-improving-project-performance-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T15:13:16Z"
}