{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>We are a PMI Registered Education Provider:</em></strong><br></p>\n\n<ul><li><strong>Instructingcom, LLC #4082</strong></li><li><strong>CAPM Exam Prep; Activity ID 13826112</strong></li><li><strong>26.50 PDU hours</strong></li></ul>\n\n\n\n<p><em><strong>Not all trainers on Udemy are part of the PMI REP program - we are! We have passed a quality audit, a business review, and we completely abide by the PMI REP program. </strong></em></p>\n\n\n\n<p><strong><em>Don't risk a PMI Exam application audit failure</em><em>! Learn from a PMI REP and study with confidence knowing that your educational hours are pre-approved from PMI.</em></strong></p>\n\n\n\n<p>You need to pass the CAPM® exam and you need quality training that'll help you in your role as a project manager. You also want to learn from an authority in project management, in an online environment with plenty of exercises, videos, and concise explanations. This course provides 35-contact hours of project management education and is taught by project management author and expert Joseph Phillips.</p>\n\n\n\n<p>Our CAPM® Exam Prep course provides complete coverage of the CAPM® exam objectives for the<em> PMBOK Guide, Fifth Edition</em>. Start today, invest in your career, and begin working to clear your exam. Here's what's included in our CAPM® Exam Prep Online Seminar:<br></p>\n\n\n\n<p>►Complete coverage of the entire PMBOK® Guide, fifth edition</p>\n\n\n\n<p>►Complete coverage of the entire exam objectives</p>\n\n\n\n<p>►26.5 contact hours of project management education</p>\n\n\n\n<p>►400 CAPM® practice exam questions and answers on all exam objectives</p>\n\n\n\n<p>►11 module exams (220 practice questions) covering every CAPM exam objective</p>\n\n\n\n<p>►Videos of all concepts, formulas, theories, and project management practices</p>\n\n\n\n<p>►Lectures on the entire CAPM® exam objectives</p>\n\n\n\n<p>►Math and concept worksheets for CAPM® exam formulas</p>\n\n\n\n<p>►Worksheet of the 47 processes and their ITTOs</p>\n\n\n\n<p>►24 x 7 Web and mobile access</p>\n\n\n\n<p>►Flashcards of every term used in the PMBOK Guide, Fifth Edition, and this course</p>\n\n\n\n<p>►CAPM® Memory Sheets (PDF document) for printing, review, and on-the-go learning</p>\n\n\n\n<p>►All exams are distributed in PDF format for easy printing and studying on-the-go</p>\n\n\n\n<p>►Course discussions with the Instructor and peers</p>\n\n\n\n<p>►30-day satisfaction guaranteed</p>\n\n\n\n<p><strong>Who's the instructor?</strong></p>\n\n\n\n<p>Joseph Phillips, PMP, Project+, is a leader in the project management discipline. He has written several books on project management, managed and consulted on high-profile projects, and taught for organizations around the world. He has led multi-million dollar projects for technical, pharmaceutical, insurance, health care, manufacturing, and architectural industries among others. Phillips has served as a project management consultant for organizations creating project offices, maturity models, and best practice standardization. Phillips is a member of the Project Management Institute and is active in local project management chapters. He has spoken on project management fundamentals, project management certifications, and project methodologies at numerous trade shows, PMI events, and employee conferences.</p>\n\n\n\n<p>Phillips has worked in adult education since 1993 and is the author of the highly-popular <em>The CAPM/PMP All-in-One Book</em>. He has taught for the Project Management Institute, Columbia College Chicago, Vincennes University, the US Navy, JP Morgan Chase, Eli Lilly, Ball State University, and many others. As a leader in adult education, Phillips has taught organizations how to successfully implement project management methodologies, information technology project management, risk management, and other courses. He is a Certified Technical Trainer and has taught over 10,000 professionals. Phillips has contributed as an author or editor to more than 30 books on technology, careers, and project management.</p>\n\n\n\n<p><strong>Phillips is currently certified as:</strong></p>\n\n\n\n<ul><li>Project Management Professional</li><li>Certified Technical Trainer</li><li>CompTIA Project+ Professional</li><li>CompTIA Network+ Professional</li><li>CompTIA A+ Professional.</li></ul>\n\n\n\n<p>In past years Phillips earned his Microsoft Certified Systems Engineer, Microsoft Certified Trainer, and Lotus Notes Professional certifications. His author website is here.</p>\n\n\n\n<p><strong>Phillips is the author of these books:</strong></p>\n\n\n\n<ul><li><em>The CAPM/PMP All-in-One Book</em></li><li><em>The PMP Study Guide</em></li><li><em>The PMP Lab Manual</em></li><li><em>Project Management for Small Business</em></li><li><em>Certified Technical Trainer+ All-in-One Book</em></li><li><em>Vampire Management: Why Your Job Sucks</em></li><li><em>The Lifelong Project</em></li><li><em>IT Project Management: On Track from Start to Finish</em></li><li><em>Software Project Management for Dummies</em></li></ul>", 
    "end_date": null, 
    "title": "Certified Associate in Project Management: CAPM Exam Prep", 
    "price": "50.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "26.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552086_1046.jpg", 
    "course_url": "https://www.udemy.com/certified-associate-in-project-management-capm-exam-prep/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T22:05:40Z"
}