{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Half of unsuccessful projects fail due to ineffective communication. How to prevent your project from falling into this shameful statistic? </p>\n\n<p>Learn best practices of project communiction management and make a positive change in your career.</p>\n\n<ul><li>Identify communication requirements</li><li>Discover best technologies</li><li>Choose proper methods</li><li>Build a great plan</li><li>Manage day to day communications </li><li>Control effectiveness of project communications</li></ul>\n\n<p>Professional methods and tools at your fingerprint!<br></p>\n\n<p>Communications management is not a secret knowledge restricted to project management experts. You can learn it on your own and make a use of it in practice.</p>\n\n<p>This course will give you a deep understanding of the communications management aspect of projects. You will learn how to plan in advance the project communications, and how to apply best tools and methods to manage communications effectively throughout the project.</p>\n\n<p>The course is driven by the best practices recommended by PMBOK5® Guide, which is the globally recognized standard for the project management profession. Learn their best practices and join the community of project management professionals.</p>\n\n<p>Do you want to pass PMP exam? This course is for you! It covers all processes in project communications management and can perfectly prepare you to the exam through our challenging quiz questions. </p>", 
    "end_date": null, 
    "title": "Communication for project managers and PMP candidates", 
    "price": "20.00", 
    "instructors": "Justyna Blajerska", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634358_0288_2.jpg", 
    "course_url": "https://www.udemy.com/project-communication-management-pmp-exam-pmbok/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T03:23:21Z"
}