{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Looking to boost your income as a project manager? Or maybe you're seeking a career change that gives you more responsibility &amp; accountability? Or Looking to get certified as a project manager.</p><p>Whatever your motivation to become a project manager, you've come to the right place.</p><p>The Complete project management crash Course is THE most comprehensive, cost-effective and career-enhancing course you'll find on Udemy – or your money back.</p><p>It's a one-stop-shop for everything you need to start managing your projects   that engage teams, call them to deliver and ultimately - make you money!</p><p>This fast, effective course takes you easily from zero skills to expert level project manager in just 1 hour.</p><p>Not only that but you'll get unlimited access for lifetime.  </p><p>What's involved?</p><p>You'll gain immediate access to 18 painstakingly-designed chapters, each developed with ease of learning in mind. Using my background as a certified Project manager and professional trainer I've created crystal-clear, original content which you'll find easy to understand - and more importantly - to absorb.</p><p>You'll find learning both quick and fun. And, I've used techniques proven to effortlessly lock that knowledge in, as you gallop through each comprehensive chapter.</p><p>If you're looking for a genuinely effective course that equips you to build your CV that will start landing into your dream project manager role, I personally guarantee this is the number one course for you.</p><p>Don't believe me? I offer a full money back guarantee, so long as you request it within 30 days of your purchase of the course.</p><p>Are you ready to transform your world and become a confident, cash-earning project manager?</p><p>Here's what you get with The Complete Project Management Crash Course:</p><p>You'll get access to 18 chapters that will give you a deep understanding of each topic.</p><p>Each chapter is explained using Mind Maps which are easy to absorb.  </p><p>All at your fingers tips. Instantly.</p><p>·The course starts with the basics. I'll show you the tips and tricks to work effortlessly   </p><p>·As Richard Branson says, 'The best way of learning is by doing,' so you'll complete the mind maps for your projects and you can share it to me for a quick review/feedback.  </p><p>Over 18 chapters you will learn all aspects of project management:</p><p>What else will you get?</p><p>·A friendly, informal community to support you every step of the way. Join My Facebook Page.</p><p>·Personal contact with me, the course tutor. Link with me through LinkedIN </p><p>·Lifetime access to course materials</p><p>·Hands-on MindMap</p><p>·A deep understanding of Project concepts.</p><p>You'll never have to waste your time and hard-earned cash learning from books, expensive online courses and YouTube videos. With The Complete Project Management Crash Course you get everything you need, all under one convenient, easy to navigate platform. Plus, you will get fast, friendly, responsive support by email, Twitter and on the Udemy forums.</p><p>I will never leave you hanging!</p><p>Check out my LinkedIN bio to see how I was able to continue my successful career and contribute in teach others to become project managers. Since making that decision, I've never looked back.</p><p>It doesn't matter how old you are or what you do professionally. I guarantee that ANYONE can benefit from this course, whether it's earning a bit of extra cash on the side or changing career altogether.</p><p>So what are you waiting for? Transform your world and sign up now to contact me to become eligible to get a free copy of my exclusive course 'Make Money Online Through Freelancing'.</p>", 
    "end_date": null, 
    "title": "Complete Project management crash course", 
    "price": "20.00", 
    "instructors": "Premanand Doraiswamy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/273100_f51b_3.jpg", 
    "course_url": "https://www.udemy.com/mind-maps-for-it-project-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-01T19:27:40Z"
}