{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>We are a PMI Registered Education Provider:</em></strong></p><ul><li><strong>Instructingcom, LLC #4082</strong></li><li><strong>CompTIA Project+ Exam Prep; Activity ID 796320126</strong></li><li><strong>27 PDU hours</strong></li></ul><p>You need to pass the CompTIA Project+ exam and you need quality training that'll help you in your role as a project manager. You also want to learn from an authority in project management, in an online environment with plenty of exercises, videos, and concise explanations. This course provides 35-contact hours of project management education and is taught by project management author and expert Joseph Phillips.</p><p>Yes, we are a PMI Registered Education Provider! Our provider number is 4082.</p><p>Our Project+ Exam Prep course provides complete coverage of the exam objectives CompTIA Project Exam PK0-003. Start today, invest in your career, and begin working to clear your exam. Here's what's included in our Project+ Exam Prep Online Seminar:</p><p>►Complete coverage of the entire PMBOK® Guide, fifth edition</p><p>►Complete coverage of the entire Project+ exam objectives</p><p>►35 contact hours of project management education</p><p>►400 practice exam questions and answers on all exam objectives</p><p>►14 module exams (280 practice questions) covering every project management knowledge area</p><p>►Videos of all concepts, formulas, theories, and project management practices</p><p>►Lectures on the entire Project+ exam objectives</p><p>►Math and concept worksheets for Project+ exam formulas</p><p>►Worksheet of the 47 processes and their ITTOs</p><p>►24 x 7 Web and mobile access</p><p>►Flashcards of every term used in the PMBOK Guide, Fifth Edition, and this course</p><p>►Project+ Memory Sheets (PDF document) for printing, review, and on-the-go learning</p><p>►All exams are distributed in PDF format for easy printing and studying on-the-go</p><p>►Course discussions with the Instructor and peers</p><p>►30-day satisfaction guaranteed</p>", 
    "end_date": null, 
    "title": "CompTIA Project+ Exam Prep", 
    "price": "40.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "27 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579158_1c02.jpg", 
    "course_url": "https://www.udemy.com/comptia-project-exam-prep/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T15:48:26Z"
}