{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Das Business Model Canvas ermöglicht Ihnen den Business Plan Ihrer Unternehmung auf einer Seite darzustellen.</strong></p><p>In diesem Kurs zeige ich Ihnen, was das <strong>Business Model Canvas</strong> ist. Dieses Element aus dem <em>Business Model Generation von Alex Osterwalder</em> erlaubt es, den <strong>klassischen Business Plan</strong> auf einer Seite darzustellen. Sie lernen im Kurs:</p><ul><li>Was das <strong>Business Model Canvas</strong> ist</li><li>Welche <em>9 Kernelemente</em> hinter dem <strong>Business Model Canvas</strong> existieren und wie diese zusammen hängen</li><li>Wie Sie am Besten mit dem <strong>Business Model Canvas</strong> beginnen</li></ul><p><strong>Meinen Kurs sollten Sie unbedingt belegen, wenn Sie</strong></p><ul><li>sich über Ihr aktuelles Geschäftsmodell Gedanken machen und es übersichtlich darstellen wollen</li><li>Gedanken hegen, ein neues Unternehmen / Start-Up zu gründen und sich noch nicht sicher sind, wie Sie am besten den Wert Ihres Unternehmens herausarbeiten</li><li>noch nie etwas von dem Business Model Canvas gehört haben, aber eine Grundlage für die Diskussion mit anderen Kollegen / Kunden / Partnern / ... benötigen</li><li>ein Business starten wollen, sich aber nicht klar sind, welche Elemente Sie betrachten sollen, um ein stimmiges Business Model zu erstellen</li><li>ein neues Produkt auf den Markt bringen wollen, und Sie die Kunden, Kosten, etc. übersichtlich und schnell auf den Punkt bringen wollen</li></ul><p>Das <strong>Business Model Canvas</strong> erlaubt es Ihnen, den Business Plan übersichtlich auf einer Seite darzustellen. Schon innerhalb einer viertel Stunde bekommen Sie so die <strong>Stärken und Schwächen</strong> Ihres eigenen Business Modells heraus.</p><p><em>Mein Kurs ist schnell und auf den Punkt gebracht: Ich führe Sie in das Thema ein, beschreibe den Inhalt kurz und knapp, zeige an einem Beispiel wie es geht und gebe ein paar Tipps für den Start. Wenn Sie noch keine oder nur geringe Kenntnisse über das Business Model Canvas haben, dann ist der Kurs genau der richtige für Sie!</em></p><p>Schreiben Sie sich noch heute in meinen Kurs ein und bestimmen auch Sie noch die weitere Fahrtrichtung mit! Sie haben <strong>30 Tage Rückgaberecht</strong> und bekommen <strong>jede Aktualisierung kostenfrei</strong> dazu. <em>Ich freue mich auf Sie - bis gleich :-)</em></p><p><em>P.S.: Wenn Sie bereits Experte sind und sich mit dem Business Model Canvas gearbeitet haben, dann bringt Ihnen der Kurs wenig Neues. Prüfen Sie bitte gegen die drei Fragen zu Beginn, ob Sie einen Mehrwert für sich entdecken!</em></p>", 
    "end_date": null, 
    "title": "Das Business Model Canvas für Einsteiger", 
    "price": "20.00", 
    "instructors": "Sebastian Schneider", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603524_2255_3.jpg", 
    "course_url": "https://www.udemy.com/das-business-model-canvas-fur-einsteiger/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-05T21:17:06Z"
}