{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">New Course Published May 17, 2016 </strong>Hi I’m Empowerment Expert Louise Anne Maurice and today I would like to help you <strong>become an Empowered Project Manager who knows precisely how to deal with gossip in the workplace.</strong></p>\n\n<ol><li>Are you frustrated with Team Members who gossip in the workplace and create division among the team?</li><li>Do you fear that their gossiping will impact your ability to get the project done on-time and under-budget?</li><li>Do you struggle with knowing how to deal with the Team Member who gossips and creates workplace scandals?</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then You Are In the Right Place because my <strong class=\"redactor-inline-converted\">BRAND NEW COURSE</strong> is for you! \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>REALITY - Sometimes you have no control over selecting your team – you walk into the unknown. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I have helped many Project Managers, just like you, feel competent working with a diverse, and sometimes unknown, Team. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>With me as your guide, you will experience less stress and more confidence dealing with difficult team members \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>2 parts high-level training seminar and 3 parts hands-on workshop, I developed this course to be a $199 value \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You learn part six of my GET RESULTS Soft Skills Training Program \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By the end of course 6, you’ll know how to implement proven techniques plus much more. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I show you how to deal with team members who gossip and divide the team without sacrificing what you are successful at – Managing Projects from start to finish   \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The usual approach to developing a motivated and cohesive team doesn’t work with certain team members \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course I walk you through my two part in-depth Chain Reaction Framework for dealing with gossipers  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I then show you exactly how to apply this framework to my motivation methods \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My motivation methods work even with the toughest team members – you learn about the 2 most challenging. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is ideal if you want the simple blueprint and an easy step-by-step plan to follow \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Plus you receive my empower formula to help you develop an engaged productive team. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As a bonus, you walk away with a 57 page manual to keep as your guide plus lifetime access to coaching and consulting – all from your one-time low course enrollment fee.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Remember, this course is NO RISK.  There is a 30 Day 100% MONEY BACK REFUND.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Check out some of the FREE PREVIEWS available to learn more about how this course turns you into a highly sought-after Project Manager. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then click on the “Take This Course” button and start learning instantly how to turn gossipers into engaged productivity superstars.</p>", 
    "end_date": null, 
    "title": "Empowered Project Manager6: New Part 6 Soft Skills Training", 
    "price": "25.00", 
    "instructors": "Louise Anne Maurice", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/838838_f084_2.jpg", 
    "course_url": "https://www.udemy.com/empowered-project-manager-part-6-soft-skills-training/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-03T20:31:59Z"
}