{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Can you relate?</strong> Paul started with the organization straight out of college.  He has been diligent throughout his career and learned on-the-job skills to excel at whatever was thrown at him.  Paul’s career dreams are now coming true and he is finally being recognized for all his hard work.</p>\n\n<p>Paul has been given a 6 month contract position with a considerable increase in pay and the new unofficial title of “Project Manager”.  If he proves himself, his pay will increase even more as he will be “First Consideration” for all new projects.  He is also in charge of leading a diverse team of 10 highly skilled individuals.  He is told that this team will help him achieve his mandate to “get the project done on-time and within budget”.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Thrilled with the new title, Paul goes home that night and shares the great news with his wife and 3 kids that he is now a Project Manager.  They are more excited about the pay raise and are already spending the extra money.  The next day Paul shares the news with colleagues who “laugh” and then share with him that the 10 team members have been labeled as the “difficult people to manage”.  They stressed-out the last Project Manager and drove him to quit.  Paul is a little nervous because he has no formal Soft Skills or People Management Training and what will his wife and kids think if he fails?</p>\n\n\n\n\n\n\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Whether you are like Paul and have been thrown into the unknown and given the unofficial title of “Project Manager” or you are a new graduate, you are in the right place because this soft skills training course is for you. <br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>REALITY - Sometimes you have no control over selecting your team.  As a Project Manager, you usually walk into the unknown. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I have helped many Project Managers, just like you, feel competent working with a diverse, and sometimes unknown, Team. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>With me as your guide, you will experience less stress and more confidence dealing with difficult team members. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I developed this course to sell for $129 but that is not what you are paying.  It is delivered as a high-level training seminar with hands-on activities and exercises in each section.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You are expected to think in this course, implement what you learn and you are encouraged to interact with the Empowered Project Manager Community to receive extra support.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course gives you the foundation piece to my GET RESULTS Soft Skills Training Program. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>By the end of this soft skills training course, you’ll know how to implement proven techniques for dealing with the 10 most difficult people to manage.  You learn precisely:\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>How to deal with lazy team members who procrastinate.</li><li>How to deal with narcissists who create drama.</li><li>How to deal with disengaged employees who are uncommitted to the Project mission.</li><li>How to deal with negative people who have a bad attitude.</li><li>How to deal with people who lie and make excuses about why they can’t do the work you are asking them to do.</li><li>How to deal with gossip in the workplace that divides the team.</li><li>How to deal with workplace bullying and harassment.</li><li>How to deal with difficult people who complain about everything that you do or don’t do.</li><li>How to deal with moody people who create tension among the team.</li><li>How to deal with workplace conflict and drama.</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>************************************************************************************************************** \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>I show you the mistakes to avoid in dealing with the 10 most difficult team members and then what you need to do instead.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The usual approach to developing a motivated productive team doesn’t work with the difficult team members. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course I give you my 11 part EMPOWERMENT SOFT SKILLS STRATEGIES so you can be proactive in your approach to dealing with difficult people before they delay your budget and stress you out.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I then give you activities and show you exactly how to apply these strategies in your team meetings. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>My EMPOWERMENT methods work even with the toughest team members – you learn about the 10 most challenging. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is ideal if you want the simple blueprint and an easy step-by-step plan to follow. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Plus you receive my Empowered Project Manager Musings to help you develop an engaged productive team. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>As a bonus, you walk away with a <strong class=\"redactor-inline-converted\">127 page downloadable manual complete with usable team building and team meeting activities </strong>to keep as your guide plus lifetime access to coaching and consulting – all from your one-time low enrollment fee.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Then click on the “Start Learning Now” button and start the process of becoming known as the “Superstar Project Manager” who took the difficult team members and turned them into a highly focused and productive team.</p>", 
    "end_date": null, 
    "title": "Empowered Project Manager: Soft Skills Training for New PMs", 
    "price": 0, 
    "instructors": "Louise Anne Maurice", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/855290_9832_3.jpg", 
    "course_url": "https://www.udemy.com/empowered-project-manager-soft-skills-training-for-new-pms/", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T20:41:26Z"
}