{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>New Course Published May 17, 2016 </strong><strong>- </strong>Hi I’m Empowerment Expert Louise Anne Maurice and today I would like to help you<strong> become an Empowered Project Manager who knows precisely how to deal with lazy co-workers.</strong></p>\n\n<ol><li>Do you struggle with lazy people on your team who aren’t engaged or motivated to work?</li><li>Do you fear that their lack of productivity will negatively impact you?</li><li>Do you leave work every day feeling drained or stressed out from dealing with difficult people who constantly procrastinate?</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then You Are In the Right Place because my <strong class=\"redactor-inline-converted\">BRAND NEW COURSE</strong> is for you!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>REALITY - Sometimes you have no control over selecting your team.  As a Project Manager, you usually walk into the unknown. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I have helped many Project Managers, just like you, feel competent working with a diverse, and sometimes unknown, Team. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>With me as your guide, you will experience less stress and more confidence dealing with difficult team members \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>2 parts high-level training seminar and 3 parts hands-on workshop, I developed this course to be a $199 value \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course gives you part one of my GET RESULTS Soft Skills Training Program \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By the end of this soft skills training course, you’ll know how to implement proven techniques plus much more. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I show you how to deal with lazy team members without sacrificing what you love to do – Manage Projects from start to finish   \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The usual approach to developing a motivated team doesn’t work with certain team members \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course I walk you through my two part in-depth Chain Reaction Framework for dealing with procrastinators  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I then show you exactly how to apply this framework to my motivation methods \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My motivation methods work even with the toughest team members – you learn about the 2 most challenging. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is ideal if you want the simple blueprint and an easy step-by-step plan to follow \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Plus you receive my empower formula to help you develop an engaged productive team. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As a bonus, you walk away with a 57 page manual to keep as your guide plus lifetime access to coaching and consulting – all from your one-time low course enrollment fee.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Remember, this course is NO RISK - There is a 30 Day 100% MONEY BACK REFUND</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Check out some of the FREE PREVIEWS available to learn more about how this course can turn you into a highly sought-after Project Manager.    \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then click on the “Take This Course” button and start learning instantly how to turn lazy team members into engaged productivity superstars. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n  </p>", 
    "end_date": null, 
    "title": "Empowered Project Manager1: New Part 1 Soft Skills Training", 
    "price": "25.00", 
    "instructors": "Louise Anne Maurice", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833918_51d0_2.jpg", 
    "course_url": "https://www.udemy.com/empowered-project-manager-part-1-soft-skills-training/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T22:06:25Z"
}