{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Este treinamento apresenta uma abordagem para o gerenciamento de projetos com base nas práticas propostas pelo PMI (Project Management Institute), cujo conteúdo está alinhado com a 5ª edição do guia PMBOK.</p><p>Este treinamento oferece, por meio de uma abordagem prática,  o que deve ser realizado do inicio ao encerramento do projeto em uma visão sistêmica que poderá ser utilizada como um guia na execução de suas atividades.</p><p>Apesar de cobrir os principais processos de Gerenciamento de Projetos, este treinamento não é o suficiente para preparar o aluno para certificação PMP® do PMI®. Contudo, este treinamento pode ser utilizado como apoio inicial aos estudos preparatórios desta certificação.</p><p>Desde 1981, o PMI (Project Management Institute) mantém um guia de projetos, intitulado Project Management Body of Knowledge (PMBOK), que contém os padrões e as linhas mestras das práticas usadas nesta disciplina. O guia PMBOK tem ampla aceitação, e milhares de gerentes de projetos no mundo todo adotam as práticas sugeridas por este guia. Estas práticas são o resultado de um consenso entre profissionais experientes neste tema.</p><p>Pesquisas realizadas pelo Standish Group, nos EUA, mostram que um grande percentual dos projetos nas empresas passa por sérios problemas, como atrasos no cronograma e aumento de custos. Uma boa parte dos projetos acaba nem sendo concluída. Apenas cerca de 35% dos projetos são entregues com sucesso.<br><br>Por isso, é importante adquirir e aprimorar seus conhecimentos na gestão de projetos, utilizando técnicas e processos para gerenciar melhor seus projetos e aumentar as suas chances de sucesso.<br><br>Quando se conduz um projeto sem apoio de metodologias, conhecimentos e práticas, as atividades são realizadas sem planejamento e a probabilidade de insucesso no projeto é muito grande. Quando um projeto é executado de forma descoordenada, é mais provável que se tenha de realizar uma gestão de crise ao invés de uma gestão de projetos.<br></p>", 
    "end_date": null, 
    "title": "Fundamentos em Gestão de Projetos com PMBOK 5a edicão", 
    "price": "25.00", 
    "instructors": "André Bernardo", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626022_4e17_4.jpg", 
    "course_url": "https://www.udemy.com/fundamentos-em-gestao-de-projetos-com-pmbok-5a-edicao/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T16:38:17Z"
}