{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Resumo: </strong>curso preparatório completo e gratuito, aceito pelo <strong>PMI®</strong> como educação formal, para a <strong>certificação CAPM®</strong>. Criado pelo professor Frederico Aranha e distribuído oficialmente pelo <strong>Site Campus</strong> - a sua escola de gestão na internet. <em>Você pode obter seu certificado com horas de estudos pela plataforma EAD do <strong>Site Campus</strong></em>.</p>  <p>  \t    Este é um curso introdutório e que pavimenta o caminho para duas das certificações mais importantes do mercado de <strong>gerenciamento de projetos</strong>: <strong>CAPM® </strong>e <strong>PMP®</strong>. O curso apresenta os elementos fundamentais do gerenciamento de <strong>projetos</strong>, o <strong>PMI®</strong> - Project Management Institute - e também o guia <strong>PMBoK® </strong>- Project Management Body of Knowledge. Afinal de contas, o que é um projeto e o que faz o gerente de <strong>projetos</strong>? Esta é apenas uma das questões que buscamos responder com este curso. Talvez mais importante do que isso, <strong>v</strong><strong>ocê está pronto para entrar no mundo do gerenciamento de projetos?</strong>  </p>  <p>  \t    Entenda como as estruturas organizacionais impactam a gestão de <strong>projetos</strong>. Você sabe o que é uma parte interessada? Entenda como as partes interessadas devem ser tratadas em um <strong>projeto </strong>e porque é tão importante tê-las junto do trabalho de planejamento para que as mudanças necessárias sejam feitas a um custo menor antes de o produto em si estar em desenvolvimento. Independente de como você optar por gerir seus <strong>projetos</strong>, com certeza este curso vai lhe ajudar a construir uma visão holística a respeito da área.  </p>  <p>  \t    Integração, escopo, tempo, custos, qualidade, recursos humanos, comunicações, riscos, aquisições, partes interessadas. Áreas do conhecimento que compõe o elemento central do guia de gerenciamento de projetos <strong>PMBoK®</strong>, principal fonte utilizada na construção deste curso. Descubra os cinco grupos de processo que irão lhe ajudar a estruturar melhor seus <strong>projetos</strong>, o ciclo de vida dos projetos e como aplicar a lógica da elaboração progressiva versus a elaboração preditiva.  </p>  <p>  \t    Embora possa ser utilizado como primeiro passo para a <strong>certificação PMP®</strong>, este curso aborda com mais ênfase a <strong>certificação CAPM®</strong>. Para ser um <strong>PMP®</strong> é preciso experiência e isso não se pode ensinar. A <strong>certificação CAPM®</strong> é voltada para profissionais que atuam em equipes de <strong>projetos</strong>, não como gerentes, mas como parte da equipe de suporte ao trabalho de gestão. <strong>Você está pronto para começar?</strong>  </p><p><strong>E não se esqueça: </strong><em>você pode fazer este curso online pela plataforma EAD do <strong>Site Campus</strong>, onde poderá gerar seu certificado de conclusão de curso com horas, que é válido para realização do exame <strong>CAPM®</strong>. <strong>Site Campus</strong> é o distribuidor dos cursos do professor Frederico Aranha. <strong>Site Campus</strong> - a sua escola de gestão na internet.</em></p>", 
    "end_date": null, 
    "title": "Gerenciamento de Projetos e Preparatório Certificação CAPM", 
    "price": 0, 
    "instructors": "Guilherme Calabria Etcheverry, Site Campus, Frederico de Azevedo Aranha", 
    "commitment": "29.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/278000_a9e9_6.jpg", 
    "course_url": "https://www.udemy.com/introducao-a-gestao-de-projetos-e-a-certificacao-capm/", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-10T04:32:43Z"
}