{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Este curso es un compendio de pautas sencillas para mejorar la gestión de sus proyectos.  </p>  <p style=\"\">  \t  Son aspectos puntuales del sistema conocido como CCPM Critical Chain Project Management con la característica de que aportan beneficios inmediatos siendo fáciles de entender y aplicar. Destaca temas del project management que se abordan desde la óptica de CCPM sin necesidad de disponer de una formación específica en esta metodología.  </p>  <p style=\"\">  \t  Las 10 claves tienen dos denominadores comunes: la gestión del tiempo y el proceso de planificación.  </p>  <p style=\"\">  \t  Respecto del primer denominador común, se centra en una de las aportaciones básicas de CCPM: cómo enfrentarse a la presión del tiempo y de su incertidumbre. Los profesionales del project management viven en carne propia lo que esto representa:  </p>  <p style=\"\">  \t  ·Sienten la presión constante del &quot;time to market&quot;, de que todo cada vez ha de ser más rápido: ¡velocidad! ¡velocidad!  </p>  <p style=\"\">  \t  ·Tienen enormes dificultades por estimar duraciones de las tareas: ¿cómo saber cuánto tardaremos si son proyectos y por tanto incluyen grandes dosis de incertidumbre?  </p>  <p style=\"\">  \t  ·Viven los permanentes retrasos en la ejecución de los proyectos.  </p>  <p style=\"\">  \t  8 de las 10 claves se centran en estos temas relacionados con la gestión del tiempo:  </p>  <p style=\"\">  \t  ·Nuestras conductas a veces responden a concepciones erróneas de cómo aprovechar bien el tiempo. Hablamos así del síndrome del estudiante (Clave 1), la multitarea (Clave 2), la ley de Parkinson (Clave 3) y el efecto &quot;adelantos no informados&quot; (Clave 4).  </p>  <p style=\"\">  \t  ·Aporta también conceptos para obtener foco en nuestro trabajo. Conocer por dónde se cuela la incertidumbre a lo largo del proyecto (Clave 8) y qué tareas son más críticas por carecer de holgura (Clave 5) son dos temas cruciales para saber en qué enfocarse.  </p>  <p style=\"\">  \t  ·Se explican también criterios de trabajo para plantearse cómo obtener buenos datos de seguimiento (Clave 9) y cómo minimizar los impactos entre proyectos y conseguir sincronía conteniendo los lanzamientos (Clave 7)  </p>  <p style=\"\">  \t  Y respecto del segundo denominador común, el proceso de planificación, lo aborda partiendo de una realidad, la de que por desgracia existe demasiada cultura de que &quot;planificar es un esfuerzo inútil&quot;. Los profesionales del project management suelen empezar su andadura profesional con mucha ilusión y ganas de planificar, pero poco a poco la vida les hace dejar esto de lado. Parece que estemos en un círculo vicioso: si la planificaciones no se hacen bien no son útiles y si no son útiles no las utilizamos. Al final o dejamos de hacerlas o las hacemos &quot;burocráticamente&quot; por cumplir.  </p>  <p style=\"\">  \t  Y para salirse del círculo existen dos temas de vital importancia: plantearse quién tiene que estar implicado en la planificación (Clave 10) y disponer de criterios para decidir con que grado de detalle se debe planificar (Clave 6).  </p>  <p style=\"\">  \t  A través de un total de 13 documentos, entre vídeos y documentos pdf, que representan unas dos o tres horas de estudio se explican de forma clara y fácil estas 10 claves para que, de forma inmediata, se puedan aplicar.  </p>", 
    "end_date": null, 
    "title": "Gestión de Proyectos: 10 claves para mejorar rápidamente", 
    "price": "20.00", 
    "instructors": "teocé ·, Xavier Tusquets, Pau Servera", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151268_423b_5.jpg", 
    "course_url": "https://www.udemy.com/10-claves-para-mejorar-rapidamente-sus-proyectos/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T09:34:18Z"
}