{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>With growing volatility in business environment, software development process has to be responsive enough to ensure that it enables the business agility rather than becoming a bottle neck. The fast adaption of agile based processes shows that software development groups are responding to the need of business. Most of the recent surveys show growing adaption of Kanban processes and in this program you will learn how to apply Kanban for solving your software development problems.</p><p>This program first looks at the problem we face in software development and then gets into the details of how Kanban can solve them, in the process, one gets introduced to Kanban principles and understand how they work in real project environment.</p><p>Happy Learning!</p><p><strong>What are the requirements?</strong></p><ul><li>Anyone in the role of Team Lead or Project manager will find this course useful.</li><li>You should have experience of working in project teams </li></ul><p><strong>What am I going to get from this course?</strong></p><ul><li>6 Video lectures (approx 35 min of content, learning time for average learner is approx 1.5 hours)</li><li>One Quiz</li><li>Learning to apply Kanban in software development projects</li><li>List of important Kanban Principles and terms</li><li>1 Professional Development Unit (PDU) for PMI Certified Professionals</li></ul><p><strong>What is the target audience?</strong></p><ul><li>Anyone interested in learning about Software Project Management </li><li>Delegates preparing for PMI's PMI-ACP Certification</li></ul><p>To access the additional material on Project Management and agile like chapter study guides, additional chapter test, simulated test, Podcast, PMP exam tips, please visit iZenBridge homepage.</p>", 
    "end_date": null, 
    "title": "Getting Started with Kanban for Software Development", 
    "price": 0, 
    "instructors": "iZenBridge Consultancy", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569464_75e8_6.jpg", 
    "course_url": "https://www.udemy.com/izenbridge-getting-started-with-kanban-for-software-development/", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T17:50:58Z"
}