{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Student Guide for Diploma of Project Management</strong>. This is to be the companion to students when they enrol in the actual diploma. This will explain all of the 12 Units of Competency that make up this Diploma and looks at the study requirements. You can then go on to purchase each of the 12 Units of Competency from Exner&#039;s Course Page <a href=\"https://www.udemy.com/collection/exner-education\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">www.udemy.com/collection/exner-education</a>. Each of the 12 Units has a guidelines video you can watch beforehand which covers the exact content of each Unit.  </p>  <p>  \t   This Diploma is endorsed by the Australian Qualifications Framework as a learning pathway, and endorsed by Australian Institute of Project Managers where successful completion would receive 40 CPD points, satisfy the requirements for their CPPP initiative when applying for Associate membership at same time.  </p>  <p>  \t   Project management is the discipline of organizing and managing resources in such a way that they deliver all the work required to complete a project within defined scope, time, cost and quality constraints and at acceptable levels of risk. In short, ensuring project success.  </p>  <p>  \t                  This course is based on the nine core knowledge areas of the Project Management Body of Knowledge as set by the Project Management Institute. Students are introduced to the principles and applications of project management. Completion of the program will enable you to demonstrate a strong understanding of the background, principles and applications of project management.  </p>  <p>  \tWe recommend that students purchase a copy of &quot;A Guide to the Project Management Body of Knowledge&quot;, Fifth Edition (<em style=\"\">PMBOK® Guide</em>) ©2013 <strong style=\"\">Please note that &quot;PMBOK&quot; is a registered mark of the Project Management Institute, Inc</strong>.  </p>  <p>  \t                  You will gain the knowledge and skills to effectively lead a project through from start to finish. You will learn skills in managing all aspects of a project from costs, to communications and human resources.  </p>  <p>  \t                  This qualification reflects the role of individuals who apply project management skills and knowledge. They may manage projects in a variety of contexts and across a number of industry sectors. They have project leadership and management roles and are responsible for achieving project objectives. They possess a sound theoretical knowledge base and use a range of specialised, technical and managerial competencies to initiate, plan, execute and evaluate their own work and/or the work of others.  </p>  <p>  \t<strong style=\"\">The 12 Areas of study include (and can be studied in this order)</strong>  </p>  <p>  \t         Manage Project Cost (Core)<br style=\"\">  \t         Manage Project Procurement (Elective)  </p>  <p>  \t         Manage Project Quality (Core)<br style=\"\">  \t         Manage Project Scope (Core)  </p>  <p>  \t         Manage Project Human Resources (Core)<br style=\"\">  \t         Manage Project Information &amp; Communication (Core)<br style=\"\">  \t         Manage Project Risk (Core)<br style=\"\">  \t         Manage Project Time (Core)  </p>  <p>  \t         Ensure Team Effectiveness (Elective)<br style=\"\">  \t         Facilitate Continuous Improvement (Elective)  </p>  <p>  \t         Manage Personal Work Priorities &amp; Development (Elective)<br style=\"\">  \t         Manage Project Integration (Core)  </p>  <p>  \t<strong style=\"\">Career Outcomes</strong>  </p>  <p>  \t                  The Diploma of Project Management will give you the necessary skill set to undertake roles such as:  </p>  <ul style=\"\">  \t<li>Project manager (generic)</li>  \t<li>Project manager (industry specific)</li>  \t<li>Project leader</li>  \t<li>Project coordinator</li>  \t<li>Project management officer</li>  \t<li>Project team leader</li>  \t<li>Project contract manager</li>  \t<li>Project vendor manager.</li>  </ul>  <p>  \t<strong style=\"\">Learn from experienced teachers from industry</strong>  </p>  <p>  \t                  The Diploma of Project Management is taught by experienced instructors who will ensure you gain current skills and knowledge in project management practices you can apply to your workplace.  </p>", 
    "end_date": null, 
    "title": "Guide to Diploma of Project Management  BSB51413", 
    "price": "20.00", 
    "instructors": "Exner Education", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/77788_228f_8.jpg", 
    "course_url": "https://www.udemy.com/diploma-of-project-management-engineering-construction/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-13T00:08:44Z"
}