{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\">Latest Update: Section 6 - Revised Study Plan, Schedule &amp; Suggested Resources (April 2015)</em></p><p>A <strong style=\"\">PMP credential</strong> after you name symbolizes a real potential to <strong style=\"\">bring calm to chaos</strong>. It signifies a methodical and systematic person <strong style=\"\">capable to work on any project in any field</strong>. It could well lead to the first impression to motivate potential employers to review your resume among hundreds of others in your field. Best of all, a PMP credential could earn a six-figure salary <strong style=\"\">anywhere in the world</strong>.<br style=\"\"></p>  <p>  \t<strong style=\"\">     If you have limited time and money to pass the PMP</strong>®<strong style=\"\">exam, this course should be your first start</strong>. We provide a study plan to prepare for and pass the PMP® exam in <strong style=\"\">10 days at a total cost of less than $300</strong>.This course will teach you 1) a study technique, and provide 2) recommended study plan &amp; schedule, 3) a list of approved required and recommended study materials and 4) a set of overview and review exercises.  </p>  <p>  \t        This Udemy course can be completed in 10 days, and is structured with three phases:  </p>  <ol style=\"\">  \t<li>4-and-a-half-day intensive reading and watching video lectures</li>  \t<li>5-day review and taking 5 practice exams</li>  \t<li>A-half-day to sit and pass the PMP exam</li>  </ol>  <p>  \t An example implementation of the study plan may start after work on a late Friday afternoon, studying from Friday evening to Tuesday evening, returning to work on Wednesday, reviewing and taking one practice exam daily starting on Wednesday to Sunday, and siting for the real exam on the following Monday.  </p>  <p>  \t         To apply to take the PMP® exam you must have at least one of the following criteria:  </p>  <ul style=\"\">  \t<li>A university degree and at least 3 years of project management experience, with 4,500 hours leading and directing project tasks and 35 hours of project management education (e.g. academic course in project planning, scheduling, cost estimation, project risk analysis etc., or PMP exam preparation course)</li>  \t<li>A secondary diploma (high school or global equivalent) and at least 5 years of project management  experience, with 7,500 hours leading and directing project tasks and 35  hours of project management education (e.g. academic course in project  planning, scheduling, cost estimation, project risk analysis etc., or  PMP exam preparation course)</li>  </ul>  <p>  \t   If you still need the 35 hours of project management education, the 10-day schedule may still be applicable (given that you are not audited when you submit your application). Based on the example schedule above starting on a Friday afternoon, you&#039;d have earned enough hours by Sunday evening to submit your PMP® exam application online. You can schedule the exam once you received PMI&#039;s confirmation with 5 business days. At any large city with multiple test centers, you could indeed sit and pass the exam within a 10-day period.  </p>  <p>  \t<em style=\"\">PMI, PMP and PMBOK are trademarks of the Project Management Institute, Inc. PMI has not endorsed and did not participate in the development of this course.</em>  </p>", 
    "end_date": null, 
    "title": "How to Pass PMP® Exam in 10 Days", 
    "price": "20.00", 
    "instructors": "Dr. Rapik Saat, PhD, PMP", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/227056_3528_3.jpg", 
    "course_url": "https://www.udemy.com/pm-prep10days/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-23T03:20:22Z"
}