{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>So you want to be a PMP? Great! First know that not everyone can take the PMP or the CAPM exam—you have to\nqualify first. I think this is great.</p><p>We, and soon you, don’t need the market\nflooded with the “paper certifications” that other industries have experienced.\nThis certification is special—it proves that the certified professional has\ndocumented project management experience, education, and has passed a tough,\nrigorous exam. If it were easy, everyone would do it.</p><p>Let’s face the facts: This isn’t much fun. Learning is hard work. PMI’s book, <em>A Guide to the Project Management Body of Knowledge, Fifth edition (</em>PMBOK <em>Guide</em>), is not an easy read. </p><p>You don’t want this studying-to-pass effort  to last any longer than necessary, and your goal should be—it better be—to pass your certification exam on your first attempt. So don’t think of “taking the exam,” but focus instead on “passing your exam.” You will pass your exam, not just take it. You’re scheduling a time to pass the exam, not take it. And so on. Pass the thing and get back to your real life.<span><br></span></p><p><span>This course aims to help you do just that. It defines:</span></p><ul><li>What you must have in order to qualify for the PMP</li><li>How much you'll pay for the PMP examination privilege</li><li>Exactly what you'll be tested on</li><li>How to study to pass the PMP exam - not just take the PMP exam</li><li>How you can develop a four-week strategy to knock out the PMP</li></ul><p><span>No more stalling! Let's get into this course and begin creating a strategy to earning the PMP. There are lots of good, good things ahead!</span></p>", 
    "end_date": null, 
    "title": "How to Earn the Project Management Professional (PMP)", 
    "price": 0, 
    "instructors": "Joseph Phillips", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757588_82df_2.jpg", 
    "course_url": "https://www.udemy.com/pmpinfocram/", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T20:22:18Z"
}