{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li>Over 10,000 students in my courses!</li><li>Over 300 5-star reviews in my courses!</li><li>This course updated in February 2016</li></ul><p>Learn how to prepare for PMI-ACP certification in a way that will go beyond simply passing the certification exam and prepare you to take on a high-impact, real-world Agile Project Management role!</p><p><span></span>The use of Agile methodologies is growing at an incredible rate, the basic way we do traditional plan-driven project management hasn't changed significantly since the 1950's and 1960's and the rate of technology change today is making a pure plan-driven approach very cumbersome and impractical to implement in many real-world situations. That doesn't mean that traditional plan-driven project methodologies are obsolete and no longer useful; however, within a relatively short amount of time, a project manager who only knows how to use traditional plan-driven methodologies will be at a serious disadvantage in the job market.  </p><p>That's a big challenge for many project managers who have been schooled and indoctrinated in a plan-driven project management approach because Agile changes the very nature of how we do project management in many environments.  PMI has recognized the importance of this trend and has created the Agile Certified Practitioner (PMI-ACP<strong>®</strong>) certification to recognize project managers who have developed an understanding of Agile knowledge and skills.  The PMI-ACP certification is a step in the right direction and has some fairly rigorous requirements but it doesn't go far enough in my opinion to address some of the challenges that project managers face in a real-world Agile environment today. </p><p>This course is not a PMI-ACP \"exam prep\" course.  This course is designed to help you develop a plan to go beyond simply passing the PMI-ACP exam, develop a clear understanding of the potential career paths for an Agile Project Manager, and prepare yourself for a high-impact Agile Project Management role in addition to achieving PMI-ACP certification.  Understanding this real-world perspective will not only help to prepare you for a real world role, it will also make the information required for the PMI-ACP exam much more meaningful and easier to retain and it will also make you a much stronger project manager!</p><p><strong><u>Earn PDU's:</u> Students who complete this course are eligible to receive 2.0 PDU's in PMI continuing education credits. Instructions for claiming PDU's are provided with the last lesson in the course.</strong></p><p><strong></strong></p><p><strong></strong><br></p>", 
    "end_date": null, 
    "title": "How to Prepare for PMI-ACP Certification", 
    "price": 0, 
    "instructors": "Chuck Cobb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627174_81aa.jpg", 
    "course_url": "https://www.udemy.com/how-to-prepare-for-pmi-acp-certification/", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T16:23:09Z"
}