{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Taking charge of one’s career options, future competencies, and strategic career paths empowers individuals to redeploy their talents and potential, advances opportunities and promotes mobility in the workforce ladder. Through a systematic process of assessment of current skills and interests, identifying desirable gals, learning a statement of purpose based on the gap between the current situation and the desired outcome and revising career objectivities, this course helps to direct learning so that one can keep up with the rapid demands of different knowledge and skills in the work environment. The training materials enable the professional to self assess various skills, values and aspirations, and to develop a realistic personal career strategy to manage changes.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">The course include following topics:</strong>  </p>  <p>  \t  1. Course content.  </p>  <p>  \t  2. Ethical aspects related to job application  </p>  <p>  \t  - Always ready to apply  </p>  <p>  \t  - Time to talk about yourself  </p>  <p>  \t  - Understand what they need  </p>  <p>  \t  - The system  </p>  <p>  \t  - Rehearse questions  </p>  <p>  \t  3. The 3 step approach - prepare - Apply - Meet  </p>  <p>  \t  4. Sales materials, search for offers and interview process  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">A few word about the author of this course Asen Tsonev:</strong>  </p>  <p>  \t  - 9 years project management experience in multinational companies (IT, Management Consulting, Banking, Insurance)  </p>  <p>  \t  - Deliver in-house trainings on Project Management, Process Improvement and Lean Six Sigma  </p>  <p>  \t  - Interested in “Value creation/Business Models”, “Efficient and Effective” “Education, Learning, Application”, “Business Trends”  </p>  <p>  \t  - PDMS, BIS, Health Management, PMP, Lean Six Sigma  </p>  <p>  \t  And his motto is:  “I try more ways, more frequently and persist longer than average”  </p>", 
    "end_date": null, 
    "title": "How to get a better job as a Project Manager", 
    "price": "20.00", 
    "instructors": "Slavi Slavov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409958_2f5d_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-a-better-job-as-a-project-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T14:51:57Z"
}