{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Successful projects range from reorganizing your office to building a rocket ship that will take you to the moon and beyond. </p><p style=\"\">The topics covered in this presentation <strong style=\"\">&quot;How to be A Winner in Today&#039;s Project Management World&quot; </strong>covers the six cornerstone concepts of <strong style=\"\">“Soft Skills”</strong> as they are integrated into the discipline of Project Management:</p><p style=\"\"><strong style=\"\"> Motivation/Value-Based Goals</strong></p><p style=\"\"><strong style=\"\"> Art and/or Science</strong></p><p style=\"\"><strong style=\"\">Project Rescue</strong></p><p style=\"\"><strong style=\"\"> Ethics &amp; Integrity</strong></p><p style=\"\"><strong style=\"\"> Teams</strong></p><p style=\"\"><strong style=\"\">  Attitude</strong></p><p style=\"\">The lecture will give you a clear insight and enable you to better understand what is required for project success in order to define your individual destiny. Additionally you will learn what happens in the “Real World” of Project Managers who are leading projects in today&#039;s organizational and operational environments.</p><p style=\"\"> A Bonus Lecture is also provided to you on the subject of <strong style=\"\">“USERcentric Systems”</strong>, my Trademarked Methodology which details for you the very important concept of developing systems with Users in order to ensure your success in the Application Development discipline.</p><p style=\"\">The course takes about 40 minutes to complete. Course is mixed with lecture and supporting visual materials that will lucidly guide you through the content. </p><p style=\"\">The course prepares you to perceive Project Management from multiple view points, understand the strengths of such dispositions and prepares you to choose the right approach in order to become a winner in today&#039;s highly complex &amp; competitive scenario. </p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "How To Be A Winner in Today's Project Management World?", 
    "price": "20.00", 
    "instructors": "Allen M. Price", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464358_9ead_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-winner-in-todays-project-management-world/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T20:55:31Z"
}