{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tAstound your project steering team when you include Earned Value Analysis into your project status reports  </p>  <p style=\"\">  \tEarned Value Management and Analysis is a process for monitoring and reporting the true health of a project  </p>  <p style=\"\">  \tBy combining the planned scope, schedule and cost with the actual work complete you can assess project performance, estimate the cost at completion and a probable completion date based on current project performance  </p>  <p style=\"\">  \t<strong style=\"\">Learn How to Introduce Earned Value Metrics Into Your Project Today</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Identify negative trends before thy become a problem</span></li>  \t<li style=\"\"><span style=\"\">Estimate the true project cost at completion</span></li>  \t<li style=\"\"><span style=\"\">Measure the efficiency of your project teams</span></li>  \t<li style=\"\"><span style=\"\">Gain the respect of your Stakeholders by knowing the true progress of your project</span></li>  \t<li style=\"\"><span style=\"\">Learn and Master the Process of Measuring and Reporting the Real Health of Your Project Using Earned Value Management</span></li>  </ul>  <p style=\"\">  \tEarned Value Management was developed by the US Department of Defence way back in the 1990’s. However the real benefits of using the technique were not fully realised. Maybe because the DoD contractors considered it just another requirement that needed to be fulfilled.  </p>  <p style=\"\">  \tNowadays most US Government contractors, DoD, Dept Energy, NASA, etc, include EVM as standard in their project communications  </p>  <p style=\"\">  \tEarned Value Analysis can be complex or relatively simple depending on who you ask.  </p>  <p style=\"\">  \tBy following the practical steps outlined in this course you will be able to introduce EVA into your project and extract the real meaningful metrics that will allow you to keep your project on track and maybe ahead of the game.  </p>  <p style=\"\">  \tThe course content is based on short videos; with some multiple choice quizzes to keep you awake.  </p>  <p style=\"\">  \t<strong style=\"\">There is also a downloadable excel worksheet that you can use to record your project&#039;s progress and calculate the key EVM metrics.</strong>  </p>  <p style=\"\">  \tWhat This Course is <strong style=\"\">NOT</strong>:  </p>  <p style=\"\">  \tThis course does not teach you short-term memory techniques to enable you to answer multiple-choice questions  </p>  <p style=\"\">  \tThe course content is not influenced by the outcome of examination exit polls and previous examination questions  </p>  <p style=\"\">  \tAlthough the course content is relevant to any certification examination it is not designed to prepare you to take a certification exam  </p>  <p style=\"\">  \tI’ve been there, done that!  </p>  <p style=\"\">  \tPlenty PMP Prep courses available on Udemy if that is your want…  </p>  <p style=\"\">  \tWhat this course <strong style=\"\">IS</strong>:  </p>  <p style=\"\">  \tThis course is designed for practical project managers, project team members and stakeholders who want a solid, repeatable solution to their project controlling and status reporting needs  </p>  <p style=\"\">  \tBy the end of this course you will become a valued member of your project team by demonstrating your knowledge of Earned Value Management and Analysis by introducing EVM into your projects  </p>  <p style=\"\">  \tWell done!  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "How to Calculate Earned Value for Your Project the Easy Way", 
    "price": "20.00", 
    "instructors": "Jeb Riordan", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354330_bb98_2.jpg", 
    "course_url": "https://www.udemy.com/earned-value-analysis-for-practical-project-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T08:11:47Z"
}