{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    This Course<strong style=\"\"> </strong>has 4+ Hours of Udemy Video and Document Content<strong style=\"\"></strong>  </p>  <p style=\"\">  \t   You will receive a <strong style=\"\">Course Completion Certificate.<br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\">Plus: 59 Word &amp; Excel documents</strong> to download that contain field guides—and project templates for you to edit and personalize.  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\">Plus: Links to over 300</strong> development documents, handbooks and specialized sites.  </p>  <p style=\"\">  \t<strong style=\"\">Proof of concept:</strong> My development courses have been taken by people from <a href=\"http://www.csd-i.org/student-countries-ngos/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">151 different countries and 500 organizations who have created projects impacting over 360,000 people</a>.  </p>  <p style=\"\">  \t <strong style=\"\">Just for fun </strong>you can learn about their projects here: <a href=\"http://www.csd-i.org/field-project-news-compilation/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">100 Projects: The Best of 3 Years of Partner Field Projects</a><br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\">What is the course about?</strong>  </p>  <p style=\"\">  \t         It may feel overwhelming to try launching an impact oriented development project. Where can you turn to for information on design and project management? What practical tools are working today? How do you convey development concepts to a community? Together, through this course, we will explore the full process that will allow you to design a successful development project.  </p>  <p style=\"\">  \t         The course has been developed so that YOU can design a real, international development project, in real time, and package it in preparation for sharing with a donor. So you won&#039;t just be learning how to do this, you will complete this course with a proposal and ready to seek funding.  </p>  <p style=\"\">  \t         The goal of this course is to increase the number of people positively impacted by well designed projects.  </p>  <p style=\"\">  \t <strong style=\"\">We hope to do this in two ways. </strong>  </p>  <p style=\"\">  \t         One: by leverage. If we can get sound tools and techniques into your hands, you and your NGO will be better prepared to develop impact oriented projects for increasingly greater numbers of people.  </p>  <p style=\"\">  \t         Two: Encouraging you to engage community members in project design and implementation will increase the likelihood that positive impact will be sustained by communities for the long-term.  </p>  <p style=\"\">  \t         You will finish the course with a project design based upon community need, sustainability, solutions that use best practices, and sound project management tools such as log frames, budgets and schedules.  </p>  <p style=\"\">  \t <strong style=\"\">What the Course Will Provide You.</strong>  </p>  <p style=\"\">  \t I will provide solutions to the challenges that I&#039;ve seen in the form of documents and handbooks that you can download. You are free to use all of the templates, examples and handbooks that I&#039;ve developed to get your organization running efficiently, develop donor relationships, get your projects running on track, and improve the lives of your community members.  </p>  <p style=\"\">  \t<strong style=\"\">You can use these course materials to:</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t                                - develop a brand-new project from scratch in response to a donor request for a proposal  \t</p>  \t<p style=\"\">  \t\t                           - help a new staff member inherit and launch a project designed by a former staff member  \t</p>  \t<p style=\"\">  \t\t                                - get a current project with challenges back on track.  \t</p>  </ul>  <p style=\"\">  \t <strong style=\"\">What kind of projects have students worked on? </strong>  </p>  <p style=\"\">  \t         Global warming, the environment, deforestation, indigenous communities, humanitarian aid, poverty, food security, hygiene, hunger, health, gender, education, water—and <a href=\"http://www.csd-i.org/field-partner-project-activity/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">270 other types of projects</a>.  </p>  <p style=\"\">  \t <strong style=\"\">How long will it take to complete the course?</strong>  </p>  <p style=\"\">  \t         There are two ways to take this course. You can actually work with a real community in the field and use each of the assignments in a step-by-step progression to develop a real development project on the ground. If that&#039;s the case, and if you were to work between one and two hours a week, and do one assignment per week you could complete this course in approximately 10 to 12 weeks. This includes 2 weeks to set up an appointment with a community and conduct a needs assessment.  </p>  <p style=\"\">  \t         Or—you can develop a virtual project which would speed the process up quite a bit because you wouldn&#039;t need to make time for meetings with community members.  </p>  <p style=\"\">  \t<strong style=\"\">How is the course structured?</strong>  </p>  <p style=\"\">  \t <strong style=\"\">I provide you with two kinds of resources:</strong>  </p>  <p style=\"\">  \t         1. Word and Excel documents which can Download and you uses templates. You take my example template for each assignment, and simply edit it so that it matches the context of your very own project. I also provide detailed workshop plans for doing things such as leading a participatory needs assessment.  </p>  <p style=\"\">  \t         2. Handbooks and manuals which you can download. You can scan the list of handbooks in order to find hands-on information about the subject matter of your project.  </p>  <p style=\"\">  \t         Each assignment represents one sequential step in developing a project. If you do one assignment a week, you simply download that week&#039;s discussion, that week&#039;s homework instructions, and my example template of the finished assignment in order to complete the assignment. Each assignment builds on the previous one. Much of the work is simple copy and paste from last week&#039;s assignment into this week&#039;s assignment—speeding up the process tremendously.  </p>  <p style=\"\">  \t         You will receive a Course Completion Certificate when you are all done.  </p>  <p style=\"\">  \t         If you&#039;d like to learn more about the course, simply watch the two introductory videos: an introduction to OL 101 and about the courses facilitator—Tim Magee.  </p>", 
    "end_date": null, 
    "title": "How To Design & Fund International Development NGO Projects", 
    "price": "45.00", 
    "instructors": "Tim Magee", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220914_be93_3.jpg", 
    "course_url": "https://www.udemy.com/designing-and-funding-international-development-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T21:01:48Z"
}