{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em></em><strong></strong><strong></strong><strong></strong></p>\n\n<p><strong>Updated April 2016! - </strong>This is what Students say about this Course:</p>\n\n\n\n<p><strong><em>\"What I like the most is the way you present information, especially the Secret Tips&amp;Tricks where even I had learnt new things (and I've been active in this field for a long time now!) - If I weren't a PMP already I would look forward to your Upcoming Course for my Exam Prep for sure!\" </em><em>- </em>Markus K.</strong></p>\n\n\n\n<p><strong><em>\"Very Good Guide for people who want to start with their PMP!\"</em> - Bruno</strong></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>NOTE: So far this course is just an Introduction to the PMP Exam, BUT it will build over the next few months (mid 2016) as a Full Preparation Course with 35 Contact Hours included (or 35 PDUs if you're already a PMP Certified!)... GET ON BOARD NOW at such a bargain price!<br></strong></p>\n\n\n\n<p><em><strong><br></strong></em></p>\n\n\n\n<p><em><strong>PMP® Certified Project Managers earn 20% more than their Non-Certified Peers. </strong></em><em>Companies get <strong>more of their Projects done</strong> when they have PMPs</em><em> on board...</em></p>\n\n\n\n<p>Do you work in a Project Management environment and want to<strong> give a Twist To Your Career?</strong></p>\n\n\n\n<p><strong>The PMP®</strong><strong> Certification will be the Turning Point of Your Professional Life!</strong></p>\n\n\n\n<p><br></p>\n\n\n\n<p>In this Course I share with You my Experience as a <strong>PMP®</strong> and as a <strong>Member of the Project Management Institute</strong> to Guide You through <strong>the Most Essential Steps</strong> needed to get you in the right direction and become soon a PMP® Certified!<br></p>\n\n\n\n<p>With Engaging and Dynamic Lessons and with Quizzes that serve as \"<em>Clarification Checkpoints</em>\" we'll navigate through PMP Eligibility Requirements, Contact Hours, PMP Applications, Audits, Exam Scheduling, Setting up an Agile Study Plan... and more!</p>\n\n\n\n<p><em><strong><br></strong></em></p>\n\n\n\n<p><em><strong>Besides, Do you want to know what has changed in the PMP Exam Update of January 11th, 2016? Follow the Discussions inside the Course and you're SET!</strong></em></p>\n\n\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong>The Course is targeted at both experienced Project Managers</strong> who want to understand if they still need to fill some gaps before applying for the PMP® Certification, <strong>and at Project Team Members</strong> who want to know what steps they can start taking, <em>right now</em>, to become PMPs when they will have accrued the required project management experience.<br></p>\n\n\n\n<p>My teaching style here on Udemy is already known for the <strong>High Level of Interaction with my Students</strong>. Make questions, open discussions, send me private messages... I'll be happy to help you find out the right answer and support your decisions!</p>\n\n\n\n<p><br></p>\n\n\n\n<p><strong>Again, Please Note</strong> that so far this Course is just an <em>Introduction to the PMP Exam</em>, BUT <strong>it will build over the next few months (mid 2016) to become a </strong><em><strong>Full Preparation Course with 35 Contact Hours included! (or 35 PDUs if you're already PMP Certified!)</strong></em></p>\n\n\n\n<p><strong></strong><strong>Jump in and enjoy its introductory price! ;)</strong></p>\n\n\n\n<p><br></p>\n\n\n\n<p><em><strong>Enroll Now, Start with the Basics, and Be Ready to Rock Your PMP® Exam! </strong></em></p>\n\n\n\n<p><em><strong>See You Inside!</strong></em></p>\n\n\n\n<p><em><strong><br></strong></em></p>\n\n\n\n<p><strong>PS: Everything To Gain, Nothing To Lose - <em>I'm so confident that you'll get so much tremendous Value from the inside Information (that no other Introductory Course will ever tell you!) </em></strong><em><strong>that I offer my own Personal 30-Days Guarantee - If you're not 100% happy with the materials, feel free to ask a full refund and get your money back. No. Question. Asked. Enjoy!</strong></em></p>", 
    "end_date": null, 
    "title": "Introduction to PMP® - Project Management Professional Exam", 
    "price": "20.00", 
    "instructors": "Danilo Tambone, PMP, ITIL, PMI-ACP, Agile Productivity Expert", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626296_aea8_3.jpg", 
    "course_url": "https://www.udemy.com/unlockpmp/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T20:57:12Z"
}