{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tIf you are thinking to transition into project management or just want a refresher in project management tools and techniques, this course is for you.  Discover how  to lead a team and manage project constraints such as scope, time and resources.  The  course will enhance your proficiency in project management. Key  topics include:  </p>  <ul>  \t<li>Overview of popular frameworks, e.g. PMI-PMP速, PRINCE2速, Agile, SDLC, Lean etc.</li>  \t<li>Developing a project charter</li>  \t<li>Defining a business case</li>  \t<li>Gathering requirements</li>  \t<li>Planning schedule, costs and communication</li>  \t<li>Reporting progress and managing stakeholders</li><li>Differentiating between risks and issues</li>  \t<li>Managing your team, schedule, costs and quality</li>  \t<li>Transitioning or closing a project</li>  </ul>  <p>In addition to video lectures, the course also includes quizzes and supplementary material such as ready-to-use templates and forms.  </p>  <p>  \t                    This course is an introduction to project management concepts and tools.  If you are an experienced project manager or want to prepare for the<strong><strong> </strong></strong>PRINCE2速 or PMP<strong><strong>速<strong><strong></strong></strong></strong></strong> certification exam we recommend to use additional resources to cover exam relevant knowledge areas more in-depth. </p><p>Completion of this course may count toward certification or continuing education recertification.  Please review the website of your professional association for further<strong><strong> </strong></strong>details on how to report professional development units (PDUs).</p>  <p>  \t                    Sign up for this course to learn the fundamentals of project management today!  </p>", 
    "end_date": null, 
    "title": "Introduction to Project Management", 
    "price": 0, 
    "instructors": "Martin V., PSM, PMP, CSSBB", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50132_9732_17.jpg", 
    "course_url": "https://www.udemy.com/project-management/", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-16T23:25:30Z"
}