{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">What is the course about?</strong> This course provides an introduction to transportation risk analysis.  </p>  <p style=\"\">  \t<strong style=\"\">What kind of materials are included?</strong> It covers risk management framework, and risk assessment concepts and methodologies using examples based on railroad hazardous materials transportation risk.  </p>  <p style=\"\">  \t<strong style=\"\">How long will the course take to complete?</strong> The lectures can be completed in about 3 hours. Students are highly encouraged to complete optional assignments specified in the lectures. This would require additional 2-10 hours, depending on the level of complexity of the student-chosen transportation risk scenario.  </p>  <p style=\"\">  \t<strong style=\"\">How is the course structured?</strong> There are a set of 5-15 minute video lectures with optional assignments. Students are encouraged to publish their assignments online (e.g. using Google Doc) and share the link using the Q&amp;A board for specific lectures.  </p>  <p style=\"\">  \t<strong style=\"\">Why take this course? </strong>This course will provide an ultralight, express  introduction to transportation risk. This course is particularly suitable for managers, planners, engineers, other professionals or students who are or will be involved in transportation supply chain.  Upon completion of this course, students will feel comfortable to support a transportation risk analysis project. Additional resources are specified throughout the lectures if students want to learn more.  </p>  <p style=\"\">  \t<strong style=\"\">Level of instructor involvement/availability</strong>: Students are highly encouraged to post questions and comments, and respond to those from other students using the Q&amp;A board. Instructor will check and address unanswered questions/comments at least weekly.  </p>", 
    "end_date": null, 
    "title": "Introduction to Transportation Risk Analysis", 
    "price": "20.00", 
    "instructors": "Dr. Rapik Saat, PhD, PMP", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45619_eecb_5.jpg", 
    "course_url": "https://www.udemy.com/transportation-risk-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-12T14:52:15Z"
}