{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"></strong>This course is aimed at providing <strong style=\"\">an introduction to project management by PMBOK5 to all risk managers</strong>. If you intend to certify or maintain PMI certification you will get, including practice, 6 PDU&#039;s.</p><p>At the end of this course you will be ready to take advanced risk management for project professionals courses and you will have an essential foundation of project management, which includes the following:</p><ol style=\"\"><li>Project and project management,</li><li>Project processes and knowledge areas,</li><li>Project integration management,</li><li>Project scope management,</li><li>Project time management,</li><li>Project costs management,</li><li>Project quality management,</li><li>Project human resources management,</li><li>Project risk management,</li><li>Project communications management,</li><li>Project procurement management, and</li><li>Project stakeholder management.</li></ol>The course was initially developed as an introduction to project management for risk managers, but is equally useful and necessary for all interested in heaving a project management overview, <strong style=\"\">without spending 35 hours</strong> on it.This is also included in the longer Risk Management for Project Professionals course, so if you took that course you don&#039;t need it, unless you want to reinforce your learning.The course includes video lectures and quizzes to test your knowledge, but also practical exercises presented in the WorkBook. These exercises are optional but highly recommended.So, if you want to build a project management foundation, this course is a good choice. Thank you! And, see you inside the course!", 
    "end_date": null, 
    "title": "Introduction to Project Management for (Risk) Managers", 
    "price": "20.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520246_7897_4.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-project-management-for-risk-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T13:02:21Z"
}