{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn to how to run projects that deliver <strong><em>lasting business value </em>NOT <em>a meaningless list of milestones.</em></strong></p><p>Don't be one of the regular crowd, whose projects fail to deliver what was expected, running late and over budget. Instead of the daily grind and stress of trying to keep things on course, imagine running projects that <strong>surprise customers by delivering regular value that customers can use</strong>, <strong>earlier than they expected.</strong></p><p>I have devised this approach, from over 20 years experience of delivering complex projects and from in-depth research into project success and failure. It's <strong>my personal recipe for success and you will not find it anywhere else</strong>, either in courses or in books.</p><p>Conventional project management approaches pretend that projects are predictable. They focus on delivering lists of milestones or software releases that don't actually deliver any real, usable business value. In contrast, <strong>Lean Project Management recognises that projects are inherently unpredictable</strong> and structures your project to deliver, regular, usable business value throughout the project, not just at the end.</p><p>The approach that I teach in this course is <strong>applicable to all types of projects</strong> but is <strong>particularly useful for IT-based projects</strong>. This is because the output of an IT-based project is less tangible and less easy to define than something like a bridge. But equally, IT is more flexible than a bridge and thus lending itself to a lean approach.</p><p>The course is delivered as series of bite-sized videos, with accompanying notes and references. </p><p>In total there is around 2 hours of video lectures and 17 straightforward exercises that ask you to apply what you have learned to “your own project\". For those without a project they can used, a suggested \"case study\" is provided. </p><p>There are also 4 optional lectures that add an additional 35 minutes of value to keen learners.</p><p>Ask yourself this questions: how do projects get to be a year late? </p><p>The answer is: one day at a time.<br></p><p><em><strong>Don't let tomorrow be one of those days - sign up now and take advantage of the the 30-day money back guarantee.</strong></em><br></p>", 
    "end_date": null, 
    "title": "Lean Project Management", 
    "price": "50.00", 
    "instructors": "Gary Lloyd", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287474_31de_2.jpg", 
    "course_url": "https://www.udemy.com/lean-project-management/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-25T15:38:24Z"
}