{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Lean BPM</strong></p><p>Lean BPM - learn how to use lean business management techniques to reduce waste and increase profits</p><p><strong>Processes Affect Profits</strong></p><p>Business profits are directly affected by how good or bad your business processes are.</p><p>Good processes can reduce waste.</p><p>Bad processes cost a business money.</p><p><strong>Efficient Processes Creates Opportunity</strong></p><p><strong></strong><strong></strong>It is a known fact that if a business improves on its processes it can create massive opportunity.</p><p>Brands like McDonalds are pure process driven businesses that have changed whole sectors because they recognised this!</p><p>Improving your processes will directly improve your profitability.</p><p><strong>What You Will Learn In This Course</strong></p><p>But how do you change processes?</p><p>What are the things you need to learn and implement?</p><p>In this course you will learn the concepts of process management change.</p><p>You will also be guided through a simple process change project, so you can see how it works with a specific example.</p><p>You will also receive free documents and resources for your own process project!</p><p><strong>Teaching Method</strong></p><p>What method will you be teaching?</p><p>This course is a collaboration between myself and Stephen Matther.</p><p>Stephen has developed the ProPeC system of business improvement after spending many years in the business improvement sector.</p><p>It is a revolutionary, yet simple system, that will give you business improvements fast.</p><p>It is this system that we will use to help you improve your own business processes.</p><p><strong>Who This Course Is For:</strong></p><p>If you answer YES to any of the following questions, then this course is for you.</p><ul><li>Are you a business that wants to improve your profitability by reducing waste using LEAN processes and Lean managment techniques?</li><li>Are you a manager that needs to improve your management skills and deliver improvements in the business?</li><li>Are you a manager that needs to increase the value of their employability be learning how to implement continuous improvement processes?</li><li>Are you a CEO or Director who wants to understand the LEAN process so that it can be delivered effectively in the business?</li><li>Are you a professional manager or work in the HR industry and want to improve your employment viability?</li></ul><p><strong>Course Description:</strong></p><p>This course will guide you through the whole process of LEAN improvement methods and show you how to implement a continuous improvement cycle.</p><p>Understanding LEAN business processes is a key driver in improving business performance at any level.</p><p>In this course we will teach you the ProPeC Simple Improvement Process, which takes state of the art business improvement principles and lays them out in a very simple to understand step by step process.</p><p>You will understand and learn how to run a current state analysis of your business processes that will enable you to identify key areas of improvement.</p><p>You will also learn how to tie improvements to high end business goals, so that they meet core business objectives.</p><p>Identifying and implementing an action plan is a key component of strong change management and you will be shown how to do this in this course.</p><p>You will be able to identify the different TIM WOODS wastes in a business.</p><p>Creating a process flow is a core skill in any continuous improvement cycle, which you will understand once you have been through the course.</p><p>Writing SMART goals ensures that what you are trying to achieve is actually based in reality, in this course we will teach you how to create them.</p><p>Maybe you need help running efficient business meetings, in this course we take you through the process of setting up a meeting that achieves its end goal.</p><p>By the time you have completed this course, you will know how to review a continuous improvement project and indeed lead a team through that project.</p><p>You will also finish with a solid overview of modern business improvement processes that you can then implement in your organisation.</p><p><strong>Take The Course:</strong></p><p>So join the course and learn how to increase profitability, how to reduce waste and how to manage and implement a continuous improvement cycle.</p>", 
    "end_date": null, 
    "title": "Lean BPM - Lean Business Process Management", 
    "price": "40.00", 
    "instructors": "Mark Timberlake, Stephen Mather", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573526_1cbf_2.jpg", 
    "course_url": "https://www.udemy.com/business-improvement-improve-profits-with-lean-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T13:53:02Z"
}