{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        Become a Project Management Ninja. You can go from managing projects in your email to managing them in Basecamp-used by companies like NIKE, FOX, ADIDAS, TWITTER and more to manage their projects.  </p>  <p>  \t        You will be SURPRISED how easy it is to manage your project from beginning to end and deliver it on-time and successfully.  </p>  <p>  \t        I will guide you through utilizing Basecamp online project management software to get better organized and deliver projects with success that will impress everyone involved! Impress your boss, team and/or clients!  </p>  <p>  \t            This course is 100% video based tutorial so you that you can see in real time how to add people, create a project and project manage from scratch. Included is a &quot;5 Steps for Successful Project Management&quot; PDF so that you can keep that with you as a way to kickoff every project.  </p>  <p>  \t            You&#039;ve always wanted to learn how to successfully manage a project. Now you can. Start becoming a successful Project Manager TODAY!  </p>  <p>  \t            Some of the things you&#039;ll be learning here are:  </p>  <ul>  \t<li>5 Steps to Successful Project Management</li>  \t<li>Adding People to Basecamp</li>  \t<li>Creating Projects in Basecamp</li>  \t<li>Managing your Project Calendar</li>  </ul>  <p>  \t        ENROLL today and become a Project Managing Ninja tomorrow. My goal is to help everyone involved so feel free to leave my questions. My goal is for those who enroll to give feedback, ask questions and get advice on becoming an expert PM!  </p>  <p>  \t      Sign up today -- this course will only be $29 for a limited time. I will be increasing the price by February 1.  </p>", 
    "end_date": null, 
    "title": "Learn Project Management with Basecamp", 
    "price": "20.00", 
    "instructors": "Charlie Craine", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/291224_cf13_2.jpg", 
    "course_url": "https://www.udemy.com/learn-online-project-management-with-basecamp/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-31T16:07:55Z"
}