{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        Are you apprehensive about all the math problems on the PMP exam? Like thinking about doing math <em style=\"\">instantly</em> transports you back to being an awkward high school student that dreaded going to algebra class?  </p>  <p>  \t        It’s not particularly pleasant to think about. But, for many folks taking the PMP, having to do math causes a lot of anxiety.  </p>  <p>  \t        Why is this? <strong style=\"\">Because many people just freak out thinking that the math on the PMP is upper-level, calculus designed to make us feel stupid.</strong>  </p>  <p>  \t        But that is not the case. In fact, if we were to do an analogy showing what PMP math is really like it would probably look something like this:  </p>  <p>  \t        PMP Math : Calculus :: Easy Mac : Cooking Pasta from Scratch  </p>  <p>  \t        In fact, all of the math on the PMP exam is basic arithmetic. Addition. Subtraction. Multiplication. Division. There is nothing complex about the math, it is just knowing the tricks of what they are looking for.  </p>  <p>  \t        This course is designed to help you relax when it comes to math on the PMP exam, in particular focusing on the Earned Value Management (EVM) analysis. Since becoming a PMP in 2010, I have taught the EVM section to many different students. I start the lecture the same way, telling the students to take a deep breath in and to realize that the math questions are <strong style=\"\">actually something that they should look forward to seeing on the exam</strong>.  </p>  <p>  \t        Why? Because the math problems have a black-and-white answer that can be determined. There is not some abstract, choose-the-best-option type of answers that drive me crazy as a test taker. There is <em style=\"\">one answer</em> that is the <strong style=\"\"><em style=\"\">right answer</em></strong> and I can prove it out with a pen and paper.  </p>  <p>  \t        This EVM course is the first of a series of PMP Math courses I plan on releasing to Udemy. My goal is to not just demystify the PMP math problems, but to also give you the confidence to solve them without having to clutter your mind with a bunch of formulas. Trust me. You will have plenty of other facts and information to memorize for the test that will take up valuable space in your brain.  </p>  <p>  \t        By the end of this course, you’ll know all about EVM including:  </p>  <ul style=\"\">  \t<li>The difference between Earned Value and Planned Value</li>  \t<li>How to answer the question as to whether the project is over/under budget</li>  \t<li>How to answer the question as to whether the project is behind/ahead of schedule</li>  \t<li>The difference between variances and indexes (and how to calculate them without having to fret too much about the formulas)</li>  \t<li>How to estimate the final cost of the project at various points in the life cycle</li>  </ul>  <p>  \t        Rather than having a boring slideshow with a voiceover telling you about EVM, I filmed this entire course where you can see me explain each of the concepts and work through examples on a white board. Yeah, I apparently had a bad hair day with my cowlick sticking up—don’t make too much fun of me in the comments. Additionally, there is a PowerPoint file with each of the questions and answers that can help you follow along.  </p>  <p>  \t        If you want to stop worrying about the math questions and <strong style=\"\">start crushing them</strong>, this course is for you.  </p>  <p>  \t        There is a ton of useful information in this course, and in just 60 minutes from now you can have mastery on how to answer all the EVM questions.  </p>  <p>  \t        Not convinced? Udemy offers a money back guarantee, so you can get your cash back if you aren’t satisfied. Sounds like a can’t lose deal to me. Enroll in this course now to gain the confidence you need to answer all PMP EVM Math questions.  </p>  <p>  \t        Garrett Heath, PMP  </p>", 
    "end_date": null, 
    "title": "Learn PMP Math EVM Concepts in 1 Hr to Dominate the PMP Exam", 
    "price": "40.00", 
    "instructors": "Garrett Heath", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/283196_7385_6.jpg", 
    "course_url": "https://www.udemy.com/pmp-exam-math-prep-earned-value-management-evm/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-18T17:04:42Z"
}