{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><br></p>\n\n<p><em>\"We took this course, organised our first event and 35 persons paid to assist</em>\". – Founders of YaT<br></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">MORE THAN 1000 OUR STUDENTS PLANNED THEIR FIRST EVENT. </strong></p>\n\n\n\n\n\n\n\n<p>Event planning course is a proven system that's been used by over 1000 (offline) students, in 11 countries and tested in more than 20 industries. This is the first time it comes online.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">WHAT IS IT ABOUT?</strong></p>\n\n\n\n\n\n\n\n<p>This course will show you how to plan, promote and sell an event. From scratch.</p>\n\n\n\n\n\n\n\n<p>However, if you would like to make a business from your events, you will need to know must do steps and different techniques to sell one event. Each event could bring you from 1k to 8k.</p>\n\n\n\n\n\n\n\n<p>This course is interactive. If you are expecting to just to download all templates and only watch the rest of the course without doing real work this course won't be for you. You are expected to put your time and effort. However, if you choose to plan an event which makes you feel good, then you can turn your hard work into dream job.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Want to plan and organize an event from scratch and understand a whole process while doing it?</strong></p>\n\n\n\n\n\n\n\n<p>Do you want to make your own business in event planning industry?</p>\n\n\n\n\n\n\n\n<p>This course will teach you how to plan one event to the detail and will show you at least 10 tactics on how to sell your event, even before planning it.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Event planning course consists of 4 modules:</strong></p>\n\n\n\n\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">First module:</strong></em></p>\n\n\n\n\n\n\n\n<p><em>Will show you how I have launched various businesses in the event industry, how I have sold all events and how you can do the same. This module is going to be proof that each tip, tutorial and technique from this course works.</em></p>\n\n\n\n\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">Second module</strong></em></p>\n\n\n\n\n\n\n\n<p><em>Is going to teach you how to plan and organize almost any type of an event. It will get you through the whole process of event planning. It will show you clear steps, it provides templates and will teach you how to use useful online and offline tools.</em></p>\n\n\n\n\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">Third module</strong></em></p>\n\n\n\n\n\n\n\n<p><em>Is about promotion of the course. Your event is real if your guests are there. If you want to make extra income, or full-time job as an event planner, this section will provide you with everything you need to know and try. This module will show you how to promote and sell your event, by using proven marketing techniques. Proven</em><em>- means that our team sold one event with the exact steps.</em></p>\n\n\n\n\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">Fourth module:</strong></em></p>\n\n\n\n\n\n\n\n<p><em>How to find a fantastic</em><em>idea for your event. </em></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">FOR THE ONES WHO WANT TO EARN EXTRA INCOME FROM EVENT PLANNING:</strong></p>\n\n\n\n\n\n\n\n<p>Consider this course as <strong class=\"redactor-inline-converted\">The 30-Day Challenge</strong></p>\n\n\n\n\n\n\n\n<p>If you enroll, follow the steps and try at least 3 selling techniques you will be able to sell at least 70% of your event. This course is interactive. If you can't commit few hours per week to work on it, then please choose Udemy's 30-day money back guarantee.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">FAQ</strong></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This one is number 1: “Is this course works for me?\"</strong></p>\n\n\n\n\n\n\n\n<p>But before I get to the questions, let me quickly go over 6 people this event planning course is designed for:</p>\n\n\n\n\n\n\n\n<p>1. If you would like to run a business which is going to create and sell events, this course will show you how to plan an event to the detail, how to market it and how to sell it</p>\n\n\n\n\n\n\n\n<p>2. If you would like to organize meetings, parties, fundraisers, camps, concerts, weddings, forums, product launches, retreats or many other types of gatherings Event planning course will teach you how to do it by using simple examples, new tools and prepared templates ready to be used</p>\n\n\n\n\n\n\n\n<p>3. If you want to organize any type of gathering which involves from 1 to 800+ guests, you'll receive clear steps to follow while understanding a whole process</p>\n\n\n\n\n\n\n\n<p>4. If you are small business owner who would like to sell own product, this course will teach you how to create an event, bring people and have an opportunity to sell the product</p>\n\n\n\n\n\n\n\n<p>5. People who are interested in getting a job as an event planner</p>\n\n\n\n\n\n\n\n<p>6. Anyone interested in planning events part-time to earn money</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">If your question is: \"I'm coming from a <em>hard to understand /weird/ boring</em>niche, so will Event planning course work for me?\"</strong></p>\n\n\n\n\n\n\n\n<p>Event planning course is a proven system that's been used by over 1000 students in 11 countries and tested in more than 20 industries.</p>\n\n\n\n\n\n\n\n<p>Even artisans who had difficulties to sell own products, completed this course, created open air markets and fairs and started selling own stuff. Our students organized 10 days training courses, made concerts and various camps.</p>\n\n\n\n\n\n\n\n<p>Do not forget:</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Event planning course comes with Udemy's 30-day guarantee. That means you can try the program today risk-free. If you find that it's not a good fit for you or your business, simply get your money back.</strong></p>\n\n\n\n\n\n\n\n<p>Our comprehensive and professional event planning courses are structured around videos, well-designed lessons, guides, templates and action steps.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">HOW IT WORKS</strong></p>\n\n\n\n\n\n\n\n<p>Our comprehensive and professional event planning courses are structured around videos, well-designed lessons, guides, templates and action steps.</p>\n\n\n\n\n\n\n\n<p>After enrolling in this course, you will be able to access video content, course guides, lesson texts, templates and action steps.</p>\n\n\n\n\n\n\n\n<p>This course is interactive. After the each tutorial and important lesson, you can follow clear action steps which are going to turn your idea to organize one event into reality.</p>\n\n\n\n\n\n\n\n<p>\"Can I enroll in Event planning course later this year?\"</p>\n\n\n\n\n\n\n\n<p>Of course. This course will be online on this link and you may join it when you feel ready.</p>\n\n\n\n\n\n\n\n<p>Over the last 3 months, I've added new and valuable lectures to the course. And I plan on adding even more soon.</p>\n\n\n\n\n\n\n\n<p>With that added value comes a higher price. It means that you can invest in the course today and have lifetime upgrades at no extra cost to you. However, you may enroll in the course later this year at higher price, of course. I am sure that both options should be fine for you, as you will need to follow the steps from the course and after organizing first event, you will return this investment and earn a salary.</p>\n\n\n\n\n\n\n\n<p>There are few Coming soon lessons.</p>\n\n\n\n\n\n\n\n<p>During the course, you can send me a message in case you have any questions.</p>", 
    "end_date": null, 
    "title": "Learn Event Planning From Scratch - Earn 7k Per Event ", 
    "price": "25.00", 
    "instructors": "Edo Sadikovic", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413566_1fb9_7.jpg", 
    "course_url": "https://www.udemy.com/eventplanning/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T21:59:09Z"
}