{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tAt the end of this course, you will have the essential knowledge of the fundamental concepts of Project Management. You will learn:  </p>  <ul style=\"\">  \t<li>The definition of project management </li>  \t<li>To identify the distinguishing characteristics of a project</li>  \t<li>How to employ commonly used techniques for selecting projects from a list of candidate projects</li>  \t<li>Determine how the PMI's knowledge areas can be used to improve project performance</li>  \t<li>Name the key stakeholders in a project and determine ways of keeping them \"on task\" during the phases of the project</li>  \t<li>Effectively use the components of a Project Charter</li>  \t<li>Write SMART project objectives that will help define the project's scope</li>  \t<li>Document and clearly communicate project assumptions</li>  \t<li>Develop a procedure for managing changes in the project once it's under way</li>  \t<li>Create a Work Breakdown Structure (WBS)</li>  \t<li>Estimate activity duration</li>  \t<li>Understand the \"Triple Constraint\" in project management and how each one affects the other</li>  \t<li>Calculate the critical path for a project and develop a strategy for keeping the project on track, identify, quantify, and prioritize risks in managing projects</li>  \t<li>Create a communications plan for reporting project progress and issues</li>  \t<li>How to use tools to measure project progress in terms of time, cost and deliverables</li>  \t<li>Develop a strategy for managing project resources by using a responsibility matrix (RACI) for assigning project activities to resources</li>  \t<li>Capture valuable lessons learned and use them to define and improve project management practices for future projects.</li>  </ul>  <p>  \tThis course is a 10,000 view of the Project Management topic. It is NOT a PMP certification course, although areas that the PMI teach are covered. If you are already a PM and are looking for certification type of courses, this course will be too basic for you. This course is intended for an audience of people who already do project management as a role or are newbies getting into the area. It provides an overall look at the different topics so that you can understand the jargon thrown around in the industry. It will help explain the tools used and the processes to follow.  </p>  <p>  \tIf you are looking for a deeper dive into any of the areas of this course or anything Project Management related, shoot me an email, as I can do a one-on-one session with you or create an entire course specifically on that topic.  </p>", 
    "end_date": null, 
    "title": "Learn the Basics of Project Management", 
    "price": "35.00", 
    "instructors": "Natalie Disque", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50564_f703_3.jpg", 
    "course_url": "https://www.udemy.com/project-management-training/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-19T18:20:41Z"
}