{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Based on extensive related hands-on practical experience, this course provides you with the skills and knowledge to effectively and efficiently discover Logical Troubleshooting and Root Cause Analysis (RCA) operations needed to provide valuable solutions for business and IT.</p><p>Logical Troubleshooting &amp; RCA: Learn What You Need to Know course authored by Chuck Morrison, MBA, PMP with over 25 years Program Management and Business Architecture experience in Silicon Valley California.</p><p>Logical troubleshooting is a systematic and well-structured methodology for determining the root cause(s) of complex system problems and issues resulting from related symptoms and malfunctions. Logical troubleshooting is a structured approach used in program/project management, engineering, business and IT administration, diagnostic medicine, telecommunications, and training development to identify and eliminate possible causes to discover root cause then return systems to proper functional operation.</p><p>All affected stakeholders including sponsors, subject matter experts, and other resources must be involved in collaborative development viable solution based on root cause for any executive decisions. This requires the leadership, skills, and knowledge or experienced analyst and architects capable of supporting an effective business solution needed to return business systems to proper operation.</p><p>Critical processes emphasized during this course are collaboration, listening, analysis, and modeling techniques needed for effective and efficient system operations solutions. This course focuses on helping you develop the skills and knowledge needed to help you support effective solutions and decisions regardless of your role.</p><p>If you find my course useful, please consider leaving a review and rating. Your review is much appreciated. You can go directly to the review page for this course then click and enter your review and rating.</p><p>Thank You and Best Regards, </p><p>Chuck Morrison, MBA, PMP</p>", 
    "end_date": null, 
    "title": "Logical Troubleshooting & RCA: Learn What You Need to Know", 
    "price": "25.00", 
    "instructors": "Chuck Morrison", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483642_3838_10.jpg", 
    "course_url": "https://www.udemy.com/learn-to-analyze-business-application-issues-root-causes/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T19:44:28Z"
}