{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Have you ever wanted to make great money, have free time</strong> and work only with clients you like? Being a successful business consultant is a dream for thousands of Americans. </p>  <p>But how could you possibly compete with consulting firms as McKinsey and BCG? </p>  <p>Well, just for a second, imagine that you could. Imagine you could put yourself in a position to <strong>earn a</strong> <strong>six-figure salary</strong>, not to mention <strong>maximize the efficiency of any business that interests you</strong>. Imagine you could do something big in management consulting industry, something great. </p>  <p>Great job imagining! Now let’s make it happen.</p>  <p><strong>The Management Consulting Project Essentials is developed to give you insights on how to help a corporation get back on its feet, grow and achieve (and exceed) all its goals</strong>. Who wouldn’t want to hire you if you know all that? </p>  <p>We’ll dive in and address business opportunities and challenges from a real management consulting project, which is to develop a full-length corporate strategy for a multi-million business to revive sales, streamline operations and cut costs. You will receive step-by-step guides, in-depth case studies, templates, toolkits, and methodologies. </p>  <p>The Management Consulting Project Essentials Pro topics include: </p>  <ul><li>Management consulting fundamentals</li><li>Understand how management consulting client engagement works</li><li>Essential skills for project managers</li><li>Develop the corporate strategy for a multi-million company to stop its declining profitability</li><li>Top interpersonal skills in the work space</li><li>Qualities that make a great leader</li><li>Tips to train your brain on analytical thinking</li><li>How to write a winning project proposal</li></ul>                <p>My name is Simon Richardson and I am the person behind Management Consulting Project Essentials course. I have years of experience on high-level management positions in huge corporations, where I worked with top-notched consultants as their client. Later on, I became a consultant myself. </p>  <p>I discovered that consulting is not only about tools, templates and mythologies that are used exclusively in the top consulting firms. It’s also about powerful mindsets, leadership and interpersonal skills which you can apply every day to accelerate your influence. <strong>A good consultant can really make a difference in the way corporations are managed.</strong> That’s why if you feel that’s your calling, then you owe it to yourself and to businesses everywhere to make it happen! </p>  <p>Let’s create your success story together! <strong>Click bellow and sign up for the course that will change your life and give you the tools to make the world a better place.</strong> </p>  <p>Act Now!</p>  <p>[Yes! Make Me A Successful Business Consultant!] </p>  <p><strong></strong></p>  <p><strong></strong></p>  <p><strong></strong></p>  <p><strong></strong></p>", 
    "end_date": null, 
    "title": "Management Consulting Project Essentials Pro", 
    "price": "25.00", 
    "instructors": "SAP BRIEF", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747756_accc_2.jpg", 
    "course_url": "https://www.udemy.com/management-consulting-project/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-31T12:23:48Z"
}