{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tIn guiding a project, particularly one in the building and construction industry, an intricate knowledge of Project Cost Management is critical in determining the project’s outcome. In reality, people practice many of the concepts involved in Project Cost Management however our course will allow students to fully utilise and benefit from such a detailed understanding of Project Management Diploma theory.  </p>\n\n<p>Please note that this course is priced in US dollars. <br></p>\n\n<p>Duration of Study </p>\n\n<p>The pace at which each student studies is different. The nominal hours for this course are 40 hours, however, this can vary greatly depending on your previous experience and study techniques. Student support is available by asking a question online or visiting our website.</p>\n\n<p>We offer our support as a Registered Training Organisation (Provider number 22450)</p>\n\n<p>As a RTO (Provider number 22450), Exner Education is responsible for delivering quality training and assessment.</p>\n\n<p>Exner Education’s Project Cost Management course serves to provide an understanding of the theory and practice of project management in the building and construction industry.  </p>\n\n<p>  \t                            This Udemy course also enables the student to attain a nationally accredited professional certificate in the unit of BSBPMG514A - Manage Project Cost.  </p>\n\n<p>This course\nor unit of competency is selected from an Australian Nationally endorsed\nbusiness services training package. It is also one of the 12 units that make up\nthe Diploma of project management.</p><p>\n\nIf you are an\nAustralian student and would like to be assessed for this unit of competency,\nplease visit our website for more information. Upon successful completion of\nthe assessment, you will qualify to be awarded a Nationally accredited\ncertificate of attainment within the VET sector.</p><p>\n\n We recommend that students purchase a copy of \"A Guide to the Project Management Body of Knowledge\", Fifth Edition (<em>PMBOK® Guide</em>) ©2013<strong> Please note that \"PMBOK\" </strong><strong>is a registered mark of the Project Management Institute, Inc.</strong>  </p>\n\n<p>  \t                          Upon the successful completion and submission of the Unit's assessment task, participants will be awards a Statement of Attainment for Unit of Competency Manage Project Cost BSBPMG514A.  </p>", 
    "end_date": null, 
    "title": "Manage Project Cost BSBPMG514", 
    "price": "20.00", 
    "instructors": "Exner Education", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/103944_5d2a_13.jpg", 
    "course_url": "https://www.udemy.com/manage-project-cost/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-10T01:57:32Z"
}