{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t             In guiding a project, particularly one in the building and construction industry, an intricate knowledge of Project Quality Management is critical in determining the project’s outcome. In reality, people practice many of the concepts involved in Project Quality Management however our course will allow students to fully utilise and benefit from such a detailed understanding of Project Management Diploma theory.  </p>\n\n<p>  \t             Whilst a Project Quality Management is not a new concept for teaching, Exner Education, drawing on their 25 years of experience in the construction industry have tailored this course to address many of the challenges facing Construction Projects and their Project Managers today.  </p>\n\n\n\n\n\n\n\n<p>Please note that this course is priced in US dollars. <br></p>\n\n\n\n\n\n\n\n<p>Duration of Study </p>\n\n\n\n\n\n\n\n<p>The pace at which each student studies is different. The nominal hours for this course are 40 hours, however, this can vary greatly depending on your previous experience and study techniques. Student support is available by asking a question online or visiting our website.</p>\n\n\n\n\n\n\n\n<p>We offer our support as a Registered Training Organisation (Provider number 22450)</p>\n\n\n\n\n\n\n\n<p>As a RTO (Provider number 22450), Exner Education is responsible for delivering quality training and assessment.</p>\n\n\n\n\n\n\n\n<p>  \t             Typically, these projects have the greatest risks associated with them and as such are far more susceptible to deliver outcomes where large financial losses are experienced or the project be delivered late or to a lower quality than expected.  </p>\n\n\n\n\n\n\n\n<p>Exner Education’s Project Quality Management course serves to provide an understanding of the theory and practice of project management in the building and construction industry.  </p>\n\n\n\n\n\n\n\n<p>This course\nor unit of competency is selected from an Australian Nationally endorsed\nbusiness services training package. It is also one of the 12 units that make up\nthe Diploma of project management.</p>\n\n\n\n<p>\n\n</p>\n\n\n\n<p>If you are an\nAustralian student and would like to be assessed for this unit of competency,\nplease visit our website for more information. Upon successful completion of\nthe assessment, you will qualify to be awarded a Nationally accredited\ncertificate of attainment within the VET sector.</p>\n\n\n\n<p>\n\nWe recommend that students purchase a copy of \"A Guide to the Project Management Body of Knowledge\", Fifth Edition (<em>PMBOK® Guide</em>) ©2013 <strong>Please note that \"PMBOK\" is a registered mark of the Project Management Institute, Inc.</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t             </p>\n\n\n\n\n\n<p>If you would like to discuss being assessed for this course, visit our website.<br></p>\n\n\n\n<p>  </p>", 
    "end_date": null, 
    "title": "Manage Project Quality BSBPMG513", 
    "price": "20.00", 
    "instructors": "Exner Education", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104438_99cf_11.jpg", 
    "course_url": "https://www.udemy.com/manage-project-quality/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-11T02:46:35Z"
}