{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        In guiding a project, particularly one in the building and construction industry, it is of great benefit to know how to manage work priorities. These are important skills to have if you want to become a great project manager.  </p>\n\n<p>  \t       In this course, Exner draw on their 25 years of experience in the construction industry and have tailored this course to address many of the challenges facing Construction Projects and their Project Managers today.  </p>\n\n\n\n<p>Please note that this course is priced in US dollars. <br></p>\n\n\n\n<p>Duration of Study </p>\n\n\n\n<p>The pace at which each student studies is different. The nominal hours for this course are 60 hours, however, this can vary greatly depending on your previous experience and study techniques. Student support is available by asking a question online or visiting our website.</p>\n\n\n\n<p>Our Support is provided as a Registered Training Organisation (Provider number 22450)</p>\n\n\n\n<p>As a RTO (Provider number 22450), Exner Education is responsible for delivering quality training and assessment. </p>\n\n\n\n<p>  \t        Typically, many projects have great risks associated with them and as such are far more susceptible to deliver outcomes where large financial losses are experienced or the project is delivered late or to a lower quality than expected.  </p>\n\n\n\n<p> Exner Education’s Manage Personal Work Priorities and Professional Development course serves to provide an understanding of the theory and practice of project management in the building and construction industry.  </p>\n\n\n\n<p>This unit of competency is taken from the Australian VET sector Business services Training Package. If you are an Australian student and would like to be assessed for this unit, please visit our website for more information.</p><p>Upon successful completion of the assessment you will be awarded with a Nationally accredited certificate of attainment. This unit also forms part of the Diploma of project management.</p>\n\n\n\n<p><br></p><p>  </p>", 
    "end_date": null, 
    "title": "Manage Personal Work Priorities BSBWOR501", 
    "price": "20.00", 
    "instructors": "Exner Education", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/104454_c429_8.jpg", 
    "course_url": "https://www.udemy.com/personal-work-priorities-prof-development-bsbwor501b/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-11T03:22:03Z"
}