{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li>Over 14,000 students in my courses!</li><li>Over 400 5-star reviews in my courses!</li><li>This course updated in June 2016</li></ul>\n\n\n\n<p><strong><u>Earn PDU's:</u></strong><strong> </strong><strong>Students who complete this course are eligible to receive 8.25 PDU's in PMI continuing education credits. Instructions for claiming PDU's are provided with the last lesson in the course.</strong></p>\n\n\n\n\n\n\n\n<p><strong><u>Money-back Guaranty:</u></strong><strong> </strong><strong>Try this course and if you are not satisfied with the value you received from the course, just send an email to Udemy support and they will give you a 100% refund within 30 days.</strong></p>\n\n\n\n\n\n\n\n<p><strong></strong>\n\n<strong><u>Course Summary:</u></strong>\n\n<br></p>\n\n\n\n\n\n\n\n<p>Learn how to  blend Agile and traditional plan-driven project management principles and practices in the right proportions to fit any situation!</p>\n\n\n\n\n\n\n\n<p>The concept of Agile Project Management is very rapidly evolving and will have a significant impact on the project management profession; however, we are in the early stages of that transformation and there is a lot of confusion about what impact it has on project managers. This course will help you unravel a lot of the confusion that exists; develop a totally new perspective to see both Agile and traditional project management principles and practices in a new light as complementary to each other rather than competitive; and learn to develop an adaptive approach to project management to blend those principles and practices together in the right proportions to fit any situation.<br></p>\n\n\n\n\n\n\n\n<p>The course goes covers most of the knowledge required for PMI-ACP® certification but presents it in a very practical, real-world context to provide a much deeper understanding of the principles behind it and the course includes a number of case studies to show how to apply this knowledge in a typical real-world situation.</p>\n\n\n\n\n\n\n\n<p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Mastering Agile Project Management for Project Managers", 
    "price": "50.00", 
    "instructors": "Chuck Cobb", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/281672_dc96_10.jpg", 
    "course_url": "https://www.udemy.com/agile-project-management-overview-for-project-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-15T19:05:57Z"
}