{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>We are a PMI Registered Education Provider:</em></strong></p><ul><li><strong>Instructingcom, LLC #4082</strong></li><li><strong>Master Project Risk Management; Activity ID 16825424170</strong></li><li><strong>5 PDU hours</strong></li></ul><p>Risk is an uncertain event or condition that may have a negative or positive effect on the project objectives. Not all risks are negative; some risks, called opportunities, are positive events that can bolster the project budget, schedule, and even the project scope.</p><p> In project management, risks must be:</p><ul><li>Identified</li><li>Planned for</li><li>Pass through Qualitative Analysis</li><li>Quantified with Quantitative Analysis</li><li>Responded to accordingly</li><li>Monitored and Controlled</li></ul><p>In this course you’ll learn all of the risk management processes, the nuances of project risk management, and the approach you should take as a project manager to control risks within a project. We’ll discuss the importance of risk management and how the project manager leads the charge in risk management. Communication with stakeholders, stakeholder management strategies, and teamwork are key ingredients for successful risk management.</p><p>This course, offered by Instructingcom, LLC (a PMI Registered Education Provider) offers five Professional Development Units (PDU) for your PMI certification education. This course is based on the PMI book <em>Risk Standard for Project Management </em>and <em>The Guide to the Project Management Body of Knowledge</em> (PMBOK Guide, fifth edition).</p>", 
    "end_date": null, 
    "title": "Master Project Risk Management - 5 PDUs", 
    "price": "20.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/729486_6233_2.jpg", 
    "course_url": "https://www.udemy.com/project-risk-management-5-pdus/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-15T21:52:53Z"
}