{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>It’s been said that 90% of project management is communication. When you consider all the people project managers must communicate with it’s easy to believe that statistic. In this course, you’ll learn the complete approach to effective project management. We’ll discuss project communications, body language, conflict management, and we’ll look at what the<em> PMBOK Guide</em> has to say about project communications.</p>\n\n<p>Managing project communications is all about the creation, collection, distribution, storage, and handy retrieval of project information. It’s what the project manager does day in and day out. The project manager is at the hub of communications and works with the project team, the project stakeholders, the sponsor, the vendors, and often the public to send and receive communications about the project. It can be exhausting because somebody always needs to tell you something, or you need to tell somebody else something. The key, of course, is to plan how to communicate, and then to share that plan and those expectations at the launch of the project.\n\n  </p>\n\n<p>Communications is central to project management and, as part of communications management, works with and through all of the other knowledge areas. A poor job of communicating ensures that the other knowledge areas will likely suffer. Communications management is also linked to project stakeholder management – without stakeholders who would we talk with? Stakeholders need and want the project manager to provider project information. Stakeholders will also provide information to the project manager.\n\n  </p>\n\n<p>Communication is a project manager’s most important skill. Project managers have to communicate with management, customers, the project team members, and the rest of the stakeholders involved with the project. The project manager’s foundation is communication. Without effective communication, how will work get completed, progress reported, and information dispersed?\n\n  </p>\n\n<p>This course is worth five Professional Development Units (PDUs) from PMI.\n\n  </p>\n\n", 
    "end_date": null, 
    "title": "Mastering Project Communications Management- 5 PDUs", 
    "price": "20.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/816622_49e0.jpg", 
    "course_url": "https://www.udemy.com/project-management-communications-5-pdus/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-08T19:10:39Z"
}