{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>It’s been said that project management is 90 percent communication – and it can certainly feel that way when you consider all of the people you have to communicate with everyday. Well, did you know that you can use Microsoft Excel to help you communicate more effectively, define your project charter, build out the project scope, and even the work breakdown structure? You sure can!</p>\n\n<p>It’s paramount that project managers work with the project team to plan and define the project scope. Then, when the team is executing the project work, the project manager needs to monitor and control the work. Part of monitoring and controlling is to record what’s happening in the project. Based on this work performance data, you’ll process the project’s successes (and possibly failures) and report to the project stakeholders accordingly.</p>\n\n<p>Microsoft Excel can help you with so much of that! In this course we’re going to explore lots of things that Microsoft Excel can do for project management. We’ll dive into formatting, charting, conditional formatting, and building a custom dashboard and report. If you don’t have a more advanced project management software, that’s okay, you can do much of that business right in Microsoft Excel.</p>\n\n<p>This course is worth five (5) Professional Development Units with the Project Management Institute. Take this course at your leisure, learn more about Microsoft Excel and project management, keep your PMI certification going, and most importantly, manage your projects with better control and communication.</p>", 
    "end_date": null, 
    "title": "Microsoft Excel for Project Management", 
    "price": "20.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806710_db47.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-for-project-management/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-29T00:06:33Z"
}