{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Course Updated May 14, 2016</strong></em><br></p>\n\n<p>Now you can finally learn Microsoft Project and get familiar with\nhow to perform Project Scheduling.  With this course, you will learn\nthe <strong>essential beginning skills</strong> for Project Managers to understand\nwhat functions can be performed using Microsoft Project and how to\nnavigate the program.</p>\n\n<p>In this course, you will learn the basics of creating a Microsoft\nProject scheduling using Gantt charts. </p>\n\n<p>We will cover such topics\nas:</p>\n\n\n\n\n\n<ul><li>\nHow to create a <strong class=\"redactor-inline-converted\">Work Breakdown\n\tStructure</strong> for use within Microsoft Project scheduling</li><li>\nHow to create <strong class=\"redactor-inline-converted\">Tasks and Summaries</strong> within Microsoft Project</li><li>\nHow to Use Microsoft Project for managing <strong class=\"redactor-inline-converted\">Project Resources</strong></li><li> How to <strong class=\"redactor-inline-converted\">add Durations and Effort to Tasks</strong> and see the complete Project Work</li><li>\nHow to <strong class=\"redactor-inline-converted\">Link Tasks</strong> together in Microsoft Project to create a full project schedule</li></ul>\n\n<p>As part of this course, <strong class=\"redactor-inline-converted\">we will also cover best practices for Project Scheduling</strong> and what a good Project Schedule should contain.</p>\n\n<p>At the end of this course, you will be totally familiar with Microsoft Project so that you will be able to create, review, and\nrevise Microsoft Project schedules all on your own.\n\n</p>\n\n<p><strong class=\"redactor-inline-converted\">Also, for those seeking PMI Certification (such as the PMP Certificate), if you complete this course you may receive credit for 1 PDU applicable to PMI Certification.</strong></p><p><em>This course includes additional materials (Microsoft Project files) that are downloadable for your own practice.  Also included for free is a White Paper on Best Practices for Project Scheduling.</em><br></p>", 
    "end_date": null, 
    "title": "Microsoft Project Basics - How to Create Your First Project", 
    "price": "20.00", 
    "instructors": "Tony Agront", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685058_e063_4.jpg", 
    "course_url": "https://www.udemy.com/microsoft-project-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T15:19:27Z"
}