{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>**Best Value PMP Exam and CAPM Exam Prep Training**</p><hr><p><strong>Course fully updated for 2015:</strong></p><p><strong><em>This is a self-paced version of our live instructor led courses that are taught both online and in-person. We are known for providing educational, engaging, and motivating courses to government and corporate employees, along with professionals seeking best value training solutions.</em></strong></p><p><strong><em>Well over 1,000 professionals have taken PMP Exam Prep courses taught by our seasoned instructors. <em>Our training classes are taught with a **clear American accent** and appeal to a global audience. </em>Now you can take </em></strong><strong><em>the official BOBCAT Academy complete PMP Exam and CAPM Exam Prep</em></strong><strong><em> training at your own pace.</em></strong></p><hr><p><strong>Enroll in this course</strong> and get access to -</p><p>   ➤  Over 9+ hours of high quality content</p><p><span></span>   ➤  Lectures conducted in a clear  American accent</p><p><span></span>   ➤  Access to 105+ lectures (and growing)</p><p><span></span>   ➤  15+ downloadable handouts</p><p><span></span>   ➤  10+ challenging quizzes</p><p><span></span>   ➤  Confidence needed to pass the PMP  Exam the 1st time</p><p><span></span>   ➤  Certified proven PMP instruction</p><p><span></span>   ➤  Convenient 24/7 self-paced learning</p><p><span></span>   ➤  Proprietary tools and aids to help  you study</p><p><span></span>   ➤  Customizable and proven test taking  strategies</p><p><span></span>   ➤  Earn contact hours to sit for the  exam</p><p><span></span>   ➤  Lifetime access to updates and  bonuses</p><hr><p><em><strong>What this course is:</strong> </em></p><p>This PMP and CAPM Exam Prep course is specifically designed to help you pass these exams on your 1st attempt. The course includes 14 Modules. Each one has quiz with answers and explanations at the end to see if you grasp the lecture. The material is fully compliant with the Project Management Institute (PMI) and its Project Management Body of Knowledge (PMBOK) 5th Edition.<br></p><p>14 Modules:</p><ul><li>Introduction to PMBOK 5th Edition</li><li>Foundational Concepts</li><li>Project Management Processes</li><li>Project Integration Management</li><li>Project Scope Management</li><li>Project Time Management</li><li>Project Cost Management</li><li>Project Quality Management</li><li>Project Human Resource Management</li><li>Project Communications Management</li><li>Project Risk Management</li><li>Project Procurement Management</li><li>Project Stakeholder Management</li><li>Professional Responsibility</li></ul><p>5 Process Groups:</p><ul><li>Initiating Process Group</li><li>Planning Process Group</li><li>Executing Process Group</li><li>Monitoring &amp; Control Process Group</li><li>Closing Process Group</li></ul><p>Additional Content:</p><ul><li>Guidance applying for the exam</li><li>Proprietary tools and aids to help you study</li><li>Customizable and proven test taking strategies </li></ul><hr><p><em><strong>What this course is not:</strong></em><br></p><p><em><strong></strong></em>#1 - This is not a project management course. However, you will learn project management best practices, along with valuable tools and techniques that will assist you.</p><p>#2 - The information distilled in this course should not be interpreted as project management methodologies. How you and your organization implement projects is a dependent on the types of projects you complete, along with your specific industry.</p><p><em><strong>This course does qualify for contact hours to sit for the PMP Exam and CAPM Exam.</strong></em><br></p><hr><p><strong><em>Here are some of the instructor's testimonials:</em></strong></p><p><strong><em></em></strong><em>Oliver is an amazingly knowledgeable and personable training professional. He has a unique mix of technical and soft skills that helped all of the class attendees clearly understand the subject matter. Oliver used his personal experiences and tips learned through his time as a trainer to prepare us with invaluable information that helped me pass the PMP exam just weeks after attending his course.</em></p><p><em>- J. Avellan, PMP®</em></p><p><em></em><em>I passed the PMP exam on my 1st attempt after attending Oliver's Project Management Professional (PMP) Exam Prep Course and I would recommend him as a trainer/instructor. He had a fresh approach and maintained a clear well-thought out curriculum. He inspired me with his confidence and \"can do\" mentality.</em></p><p><em>-A. Sewell, PMP®</em></p><p><em></em><em>After taking Oliver's PMP prep class I passed the PMP exam on my first attempt. Oliver provides a road map to the material and personal insights that aided in my understanding. I would highly recommend any class taught by Oliver.</em></p><p><em>- T. Jones, PMP®</em></p><p><em></em><em>If everyone listens and pays attention during Oliver's PMP Prep Exam class then follows through and uses his study exam guidelines, everyone will pass the PMP exam their first time.</em></p><p><em>- D. Lopez, PMP®</em></p><hr><p><strong>Register today</strong> for this educational, engaging, and motivating course from the leader in online Exam Prep! <br></p>", 
    "end_date": null, 
    "title": "Pass the Project Management Professional (PMP®) Exam 5th Ed", 
    "price": "20.00", 
    "instructors": "BOBCAT Academy", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433562_e677_5.jpg", 
    "course_url": "https://www.udemy.com/pass-the-project-management-professional-pmp-exam-5th-ed/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T00:11:36Z"
}