{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>**DON'T LOOK FURTHER!!** </strong></p><p>This is the only PMP Exam Prep course out there, that will make sure you pass the PMP exam, as well as, you get a complete understanding of project management know-how. Preview the first lecture to know why <br><br></p><p>Did you know that, according to Standish Group and other reports?! <br><br></p><p>-Only 16.2 % of software projects completed on time and on budget, <br></p><p>-31% of projects will be cancelled before they start <br></p><p>-Over half of all projects will cost more than 189% of original estimates <br></p><p>Stand out of the crowd as a Project Management Professional (PMP) <br></p><p>Comprehensive PMP Exam Prep course with the following characteristics:<br></p><ul>\n<li>Complies with <em><strong>PMBoK  5</strong></em></li>\n<li>35 PDUs/ Contact hours fulfilled</li>\n<li>More than 35 project management documents templates (and updating)</li>\n<li>18 quizzes including more than 160 questions (and updating)</li>\n<li>Free supplementary lecture on tips and hints to pass the PMP exam</li>\n</ul><p>Eng. Bayhas Al Sawady, CEO and Founder of BRIDGE Consulting Co, PMI REP ID: 3472, will make sure you PASS the PMP exam and BE ACTUALLY able to practice what you have learned, to land your dream job and join the elite project management professionals club.</p>", 
    "end_date": null, 
    "title": "PMBOK 5 - Project Management Professional (PMP) Exam Prep", 
    "price": "20.00", 
    "instructors": "Bayhas Al Sawady", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670198_402c_2.jpg", 
    "course_url": "https://www.udemy.com/pmbok-5-project-management-professional-pmp-exam-prep/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T07:50:46Z"
}