{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Project environment is becoming ever more complicated. Project Managers are expected to be able to deliver complex projects, to be able to report accurately on their projects and to know when to take action to address a project which is starting to fail.</p><p>Project Managers are also expected to be PMP certified, and to be able to apply the knowledge that they have learnt through the PMP certification process.</p><p><strong>Learn and master the concepts and techniques of Earned Value Management in this comprehensive course. </strong></p><p><strong>Contents and Overview</strong></p><p>The course contains five video lectures to cover the following topics:</p><p><em></em>                  </p><ul><li>An Introduction to Earned Value Management – Scope; Schedule; Resources; Earned Value; Planned Value</li><li>Four Key Concepts – Earned Value, Planned Value, Actual Cost, Budget at Completion</li><li>Variances – Schedule Variance; Cost Variance; Variance at Completion</li><li>Indexes – Schedule Performance Index; Cost Performance Index; To Complete Performance Index</li><li>Estimating – Estimate to Complete; Estimate at Completion<span></span></li></ul><p>There is also a Final Exam which contains replica PMP questions covering all the Earned Value Management topics.</p><p>Please note that this course has been narrated by a professional voice-over artist. </p>", 
    "end_date": null, 
    "title": "PMI Earned Value Management for Project Managers and the PMP", 
    "price": "20.00", 
    "instructors": "Adrian Boniface", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699612_87f7_2.jpg", 
    "course_url": "https://www.udemy.com/pmi-earned-value-management-for-project-managers-and-the-pmp/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T02:17:51Z"
}