{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to the <strong>PMI-ACP Certification Agile Project Management for Beginners</strong>. This course includes the already popular course 1 and 2 of that will form the <em>Agile Project Management - The PMI-ACP</em> (Agile Certified Practitioner) Certification Program.<span></span></p><p>Course 1 of 8: <strong>The Agile Project Management Essentials</strong></p><p>This is the first course of a series of eight that will form the Agile Project Management - The PMI-ACP (Agile Certified Practitioner) Certification Program.<br></p><p><strong>Why Agile Project Management?</strong></p><p>If you have followed a traditional project management approach and find yourself spending a lot of time fine tuning the design to accommodate changing requirements, you may want to consider a different approach. In this course, you will be introduced to agile project management, including the core values and principles outlined by the Agile Manifesto.</p><p>Agile projects are characterized by the use of short work iterations and incremental development of products, made possible by focusing on business priorities and customer value. The course provides an introduction to common agile methodologies, describes the relationship between defined and empirical processes, and highlights the key difference in regard to the triangle of constraints of agile versus traditional methods.</p><p>Who is your instructor?</p><p>My name is Sorin, and I will be your instructor. I am a trainer and project manager with more than 10 years of experience. Before Udemy, I trained hundreds of people in a classroom environment – civil servants, managers, project workers, aid workers and many more. And I managed projects in the fields of justice, corrections, regional development and human resources development.</p><p>How will you benefit?</p><p>And, this course is intended for project managers, program managers, or anyone who wants to efficiently participate in agile projects. It is aligned with the Agile Certified Practitioner exam objectives developed by the Project Management Institute® and Certified ScrumMaster learning objectives.</p><p>The course includes training videos, examples, exercices and quizes. And, if you take your time to go through all the learning materials this will entitle you to claim 5 PDU’s for the PMI certification exams and to maintain your PMI certification.</p><p>Course 2 of 8: <strong>Adopting an Agile Approach</strong></p><p>This course provides guidance on how to take steps towards adopting an agile project management approach for those who currently use a traditional, plan-driven methodology.</p><p>It discusses some common myths and misconceptions about agile development approaches, identifies factors to consider when deciding whether to adopt agile practices, and explains the general agile practices that a company may want to adopt.</p><p>The Adopting an Agile Approach to Project Management Course provides project leaders with general guidelines on how to develop an agile way of thinking, one of the first steps in transitioning a team. The course also looks at some guidelines for obtaining buy-in from organizational stakeholders so they also embrace agile practices.</p><p>Adopting an Agile Approach to Project Management is intended for project managers, program managers, or anyone who wants to efficiently participate in projects that experience frequent change in the project requirements.</p><p>After completing this topic, you will be able to:</p><ul><li>understand and correct common misconceptions about agile project management;</li><li>determine whether your organization should adopt agile practices;</li><li>identify factors to consider when deciding whether to adopt agile practices; and</li><li>recognize and apply the key principles of agile practices.</li><li>You will be also able to:</li><li>develop and champion an agile mindset; and</li><li>facilitate the buy-in of stakeholders in implementing agile practices.</li></ul><p>The course duration is not more than 3 hours and you will have video lectures, written materials, quizzes, examples and exercises, to lear and practice, but also a small optional course project if you are interested in getting the most out of this course.</p><p>The course includes training videos, examples, exercices and quizes. And, if you take your time to go through all the learning materials this will entitle you to claim 5 PDU’s for the PMI certification exams and to maintain your PMI certification.<br></p><p>Thank you for considering my course. If you are interested, please register now. Or, just try some sample videos and make a decision after you have a better picture.</p>", 
    "end_date": null, 
    "title": "PMI-ACP Certification Agile Project Management for Beginners", 
    "price": "40.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783758_c3fd_3.jpg", 
    "course_url": "https://www.udemy.com/pmi-acp-certification-agile-project-management-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-06T05:46:11Z"
}