{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Agile is the most powerful project-management approach that gets you consistently amazing results when you do it right. To DO Agile right, you need to BE agile and to have a solid understanding of Agile principles and how to use them.</p>\n\n<p>In this course you'll master the principles of agile project management with this ideas-packed course.  Prepare for the Project Management Institute's Agile Certified Practitioner exam.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>After you take and complete this course, you'll be able to: </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Explore, embrace, and apply agile principles and mindset within the context of the project team and organization. </li><li>Succeed with any question of Domain I of PMI-ACP exam. (Agile Principles and Mindset)</li><li>Enhance your leadership skills.</li><li>Clearly explain Agile to others.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Content and Overview</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course, you’ll begin with a quick PMI-ACP certification overview. Our next step will be to turn on the “beginner’s mind” and think about what it means to be agile and why it’s very important.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Then, you’ll continue to learn about the world of Agile management and explore various agile methodologies and approaches, such as Scrum, Kanban, Extreme Programming (XP), Feature Driven Development (FDD), Dynamic System Development (DSD), and Crystal. It will help you understand and clarify many Agile concepts.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Finally, we will focus on the concept of Leadership and think about why it is important in an Agile environment. The video lectures and quizzes will not only help you learn, but also reinforce your learning and understanding, as well as prepare you for the Agile Certified Practitioner exam.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is the first and the most important one in a series of seven courses dedicated to the Agile Certified Practitioner material. Each of the seven courses will cover one domain from the PMI-ACP exam content outline.<br></p>", 
    "end_date": null, 
    "title": "PMI-ACP Agile Principles and Mindset", 
    "price": "50.00", 
    "instructors": "Igor Ovchinnikov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703258_773d_3.jpg", 
    "course_url": "https://www.udemy.com/pmi-acp-agile-principles-and-mindset/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T20:52:43Z"
}