{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to the <strong>Agile Project Management Essentials </strong>course. This is the<strong><em> first course of a series of eight</em></strong> that will form the Agile Project Management - The PMI-ACP (Agile Certified Practitioner) Certification Program.</p><p><strong>Why Agile Project Management?</strong></p>  <p>If you have followed a traditional project management approach and find yourself spending a lot of time fine tuning the design to accommodate changing requirements, you may want to consider a different approach. In this course, you will be introduced to agile project management, including the core values and principles outlined by the Agile Manifesto.</p>  <p>Agile projects are characterized by the use of short work iterations and incremental development of products, made possible by focusing on business priorities and customer value. The course provides an introduction to common agile methodologies, describes the relationship between defined and empirical processes, and highlights the key difference in regard to the triangle of constraints of agile versus traditional methods.</p><p><strong>Who is your instructor?</strong></p>  <p>My name is Sorin, and I will be your instructor. I am a trainer and project manager with more than 10 years of experience. Before Udemy, I trained hundreds of people in a classroom environment – civil servants, managers, project workers, aid workers and many more. And I managed projects in the fields of justice, corrections, regional development and human resources development.</p><p><strong>How will you benefit?</strong></p>  <p>And, this course is intended for project managers, program managers, or anyone who wants to efficiently participate in agile projects. It is aligned with the Agile Certified Practitioner exam objectives developed by the Project Management Institute® and Certified ScrumMaster learning objectives.</p>  <p>The course includes training videos, examples, exercices and quizes. And, if you take your time to go through all the learning materials this will entitle you to claim 5 PDU’s for the PMI certification exams and to maintain your PMI certification.</p>  <p>So, thank you for condidering this course! Now, go ahead, and hit that \"Take This Course\" button. And, see you on the inside.</p>", 
    "end_date": null, 
    "title": "PMI-ACP Certification: Agile Project Management Essentials", 
    "price": "30.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/758538_3b23_3.jpg", 
    "course_url": "https://www.udemy.com/pmi-acp-certification-agile-project-management-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T15:44:16Z"
}