{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course provides guidance on how to take steps towards <strong style=\"\">adopting an agile project management approach</strong> for those who currently use a traditional, plan-driven methodology.</p><p style=\"\">It discusses some common myths and misconceptions about agile development approaches, identifies factors to consider when deciding whether to adopt agile practices, and explains the general agile practices that a company may want to adopt. </p><p style=\"\">The Adopting an Agile Approach to Project Management Course provides project leaders with general guidelines on how to develop an agile way of thinking, one of the first steps in transitioning a team. The course also looks at some guidelines for obtaining buy-in from organizational stakeholders so they also embrace agile practices.</p><p style=\"\"><strong style=\"\">Adopting an Agile Approach to Project Management</strong> is intended for project managers, program managers, or anyone who wants to efficiently participate in projects that experience frequent change in the project requirements.</p><p style=\"\">After completing this topic, you will be able to: </p> <ul style=\"\"> <li style=\"\">understand and correct common misconceptions about agile project management; </li> <li style=\"\">determine whether your organization should adopt agile practices;</li> <li style=\"\">identify factors to consider when deciding whether to adopt agile practices; and </li> <li style=\"\">recognize and apply the key principles of agile practices. </li> </ul> <p style=\"\">You will be also able to: </p> <ul style=\"\"> <li style=\"\">develop and champion an agile mindset; and</li> <li style=\"\">facilitate the buy-in of stakeholders in implementing agile practices.</li></ul><p style=\"\">The course duration is  not more than 3 hours and you will have video lectures, written materials, quizzes, examples and exercises, to lear and practice, but also a small optional course project if you are interested in getting the most out of this course.</p><p style=\"\">Thank you for considering my course. If you are interested, please register now. Or, just try some sample videos and make a decision after you have a better picture.</p>", 
    "end_date": null, 
    "title": "PMI-ACP Certification: Adopting an Agile Approach", 
    "price": "40.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529326_439c_3.jpg", 
    "course_url": "https://www.udemy.com/adopting-an-agile-approach-to-project-management/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T09:39:28Z"
}