{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course discusses in details on the organizational influence on project and project management, influence of stakeholders on the project, project&#039;s governance, the project team&#039;s structure and membership. Also discussed on different approaches to the phasing and relationship of activities within the project&#039;s life cycle and various types of project life cycles. </p><p style=\"\">You will have complete view on how organization influences the Project and also Project Life cycles, an important topic and need to be aware for clearing PMP exam and have successful career as Project Manager.</p><p style=\"\">You can use PMP or Organizational Behavior and Project life cycle for PMP  to search and find this course.</p><p style=\"\">This course contains elaborate lectures more than 100 minutes structured in such a way that gives an holistic view on of the topic and makes your learning approach extreamly  structured.</p><p style=\"\">Course also contained 100+ quiz questions which makes your conceptual understanding sound.</p><p style=\"\">Course has very dynamic, engaging slides with suitable alerts wherever you need to give extra stress and expect questions in PMP Certification exams.</p><p style=\"\">Why you need to take this course?</p><p style=\"\">Projects and project management take place in an environment that is broader than that of the project itself.</p><p style=\"\">What is meant by Broader than that of the Project?</p><p style=\"\">It means, it is not only the activity within start and end date which we are focussing but much more than that.</p><p style=\"\">What it means?</p><p style=\"\">It means work is carried out in alignment with the organization&#039;s goals and managed in accordance with the organization&#039;s established practices.</p><p style=\"\">It is important to know about this broader aspects which is precisely organizational influences in terms of its goals and effects on the methods used for staffing, managing, and executing the project.</p><p style=\"\">These are the key parameters of Project&#039;s success. Project&#039;s success is your success.</p>", 
    "end_date": null, 
    "title": "PMP : Organizational Influences  and Project Life Cycle", 
    "price": "20.00", 
    "instructors": "Global Learning Labs, Excellence in Learning", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305698_33c8_6.jpg", 
    "course_url": "https://www.udemy.com/pmp-organizational-influences-and-project-life-cycle/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-22T22:06:36Z"
}