{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p class=\"MsoNormal\" style=\"\">  \t    Are you studying to take the Project Management Institute&rsquo;s PMP certification (Project Manager Professional) or CAPM (Certified Associate in Project Management)? Are you finding the study process challenging because of the number of PMBOK 5 processes and their relationships? If you are, you are not alone.It is a challenge to memorize the 47 processes, and learn their relationships with the 10 knowledge Areas and 5 Process Groups.When I was studying for the PMP exam back in 2007 I faced the same problem.That is until I resorted to an old school study method, flashcards. By using flashcards in multiple ways I was able to connect the dots.Why, because just reading text alone will not guarantee comprehension.Recall and application is needed to increase retention and learning.  </p>  <p class=\"MsoNormal\" style=\"\">  \t    This course is designed after the flashcard method I used to successfully earn my PMP certification on the first attempt. Fortunately for you, you will not have to run out and buy index cards to make flashcards.  This course uses animation to enhance the learning experience. Each course section includes a definition review, flashcard review to reinforce memorization, and a quiz to measure learning.  </p>  <p class=\"MsoNormal\" style=\"\">  \t    There are a combination of 23 lectures and Flashcard Challenges ranging from two-six minutes. The course is designed to be viewed multiple times, so you can repeat any section to increase your retention of the material.  Depending on how soon you plan to take the exam, I recommend reviewing as often as needed to increase absorption and understanding of the material.  </p>  <p class=\"MsoNormal\" style=\"\">  \t    This course is also recommended for students (high school to post graduate) who are studying project management.Because the course is based on the PMBOK 5, this is a tool that can accompany any project management Lesson Plan or Syllabus.  </p>  <p class=\"MsoNormal\" style=\"\">  \t<strong style=\"\">Upcoming PMP Study Buddy Learning Series Course</strong>  </p>  <p style=\"\">  \t    This is the first Flashcard course from the PMP Study Buddy Learning Series. Upcoming courses will focus on PMBOK processes&rsquo; Inputs, Outputs, and Tools and Techniques.  </p>", 
    "end_date": null, 
    "title": "PMP CAPM Exam Prep Flashcard Course- Learn PMBOK 5 Processes", 
    "price": "35.00", 
    "instructors": "Designation C. Alex Morris", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/83162_671b_10.jpg", 
    "course_url": "https://www.udemy.com/pmp-exam-prep-flashcard-course-learn-pmbok-5-processes-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-24T15:49:23Z"
}