{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                YOU DO NOT NEED to SPEND LOT of MONEY. Take this course save money and get 35 PDUs. (Ask us how?) .  </p>  <p>  \t    I have trained more than 1200 students in the past 1 year only and this course will make you understand and review PMP very quickly.  </p>  <p>  \t                      In this world lot of projects are being run and there is huge demand of project managers. Professional certifications ensure that project managers are ready to meet the growing needs with world class knowledge on project management skills.  </p>  <p>  \t                      If you are looking forward to be part of best world class certified professional you have come to the right place. In our course you will quickly review the key critical topics and earn PDUs. Our course is designed to make you understand concepts through videos and real exam like quizzes.  </p>  <p>  \t                      This course has been designed by professional with over 25 years of experience in the industry. The instructor has worked in different industries and has worked on large and complex projects. The instructor is teaching project management and related subjects across the globe. He is mentor and consultant for various organizations. He is author of many online courses on project management and IT security.  </p>  <p>  \t                       This course is for quick review and you can learn the critical concepts at your pace. The videos are on specific topics and have examples. When you answer quizzes you understand the concepts and terms and are confident to crack the examination. The quizzes have explanation on the correct answer.  </p>  <p>  \t                      Benefits of PMP Certification.  </p>  <ul style=\"\">  \t<li>Globally recognized certification</li>  \t<li>Demonstrates Project Management skills to potential employers</li>  \t<li>Better job opportunities in this global village</li>  \t<li>PMI certification gives you edge over other professionals</li>  \t<li>Better salary</li>  \t<li>Demonstrates your commitment towards project management profession</li>  </ul>  <p>  \t                      If you are PMP/CAPM/RMP this course will strengthen your knowledge on key concepts and earn you 12 PDUs. After completing this course you can claim the PDUs on PMIs site.  </p>  <p>  \t          PMP<sup style=\"\">®</sup> is a registered trademark of the Project Management Institute and we acknowledge the same.  </p>", 
    "end_date": null, 
    "title": "PMP Quick Review", 
    "price": "50.00", 
    "instructors": "Sandeep Sehgal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338150_4dd7_8.jpg", 
    "course_url": "https://www.udemy.com/pmp-quick-review/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T03:15:58Z"
}