{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">12 Hours of Content, 449 Pages of Course Slides, <strong style=\"\">9</strong><strong style=\"\">50 PMP® Quiz Questions Included IN the course.</strong> This is simply the BEST and MOST complete PMP® Preparation Course Available on Udemy.</p><p style=\"\">This course is administered by Innate Images, LLC<strong style=\"\"> an official PMI® REP (Registered Education Provider)</strong> and enables you to claim 35 Contact Hours or PDUs for PMP® re-certification (changing in Dec 2015 - hurry up and earn those PDUs soon!). In fact our course has so many quiz questions and such in-depth content, that this course<strong style=\"\"> qualified for an EXTRA 10 Contact Hours or PDUs - so you get 45 instead of just the standard 35.</strong></p><p style=\"\">Why fly somewhere, stay in a hotel, take a week off from work, sit in a classroom and incur all the costs associated with such a trip…</p><p style=\"\">When you can <strong style=\"\">prepare for the PMP® Exam AND earn 45 PDUs from the comfort and convenience of your own personal surroundings</strong>. Accessing exactly what you need to pass the PMP® exam has never been so easy.</p><p style=\"\">Our Course is designed by a BetterPM Assistant Instructor who has over 10 years of experience leading actual projects at major corporations across the US and a professional educational course designer who specializes in distance learning.</p><p style=\"\">BetterPM&#039;s streaming video, audio and printed material “hits the mark&quot; on “exactly&quot; what you&#039;ll need to pass your exam. <strong style=\"\">We do this by leveraging our years of experience with thousands of students…</strong></p><p style=\"\">We know what the “most challenging areas&quot; of the test are, so we highlight and emphasize those areas for you as you go through the training, making it the most time leveraged and efficient process possible.</p><p style=\"\">Our Course has been downloaded over <strong style=\"\">100,000 times online at our other sites, it has been tried and tested by many people over the last 5 years!</strong> Come and take the best!</p>", 
    "end_date": null, 
    "title": "PMP® Preparation - REP Approved 35 Contact Hours", 
    "price": "20.00", 
    "instructors": "Innate Images LLC", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497322_a555_4.jpg", 
    "course_url": "https://www.udemy.com/pmp-preparation-rep-approved-35-contact-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T03:59:13Z"
}