{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Founded in 2012, Master of Project Academy taught 50,000+ IT &amp; Business professionals in more than 170 countries around the world.</strong></p><p><strong>Now, Master of Project Academy's exclusive &amp; premium courses are in Udemy!</strong></p><p><strong>Do Not Waste Your Time and Money! Enroll in the most comprehensive online PMP® training.</strong></p><ul><li><strong>More than 20,000 students enrolled in this course and passed the PMP exam.</strong></li><li><strong>35+ Hours of Comprehensive Content</strong></li><li><strong>Course Completion Certificate is provided.</strong></li><li><strong>Up-to-date for Exam Change in January 2016</strong></li></ul><ul><li>30 Days FULL REFUND of your money is guaranteed if you will not be satisfied of this course</li></ul><p><strong>By enrolling in this course, you will be able to:</strong></p><ul><li><strong></strong>Earn 35 PDU (Contact Hours) requirement of PMI to enroll in PMP Exam</li><li>Learn theoretical concepts with real-world project examples</li><li>Learn how to apply for PMP exam without having a PMI audit!</li><li>Test yourself with a FULL PMP Exam at the end of the course</li><li>Get prompt answers &amp; support from the instructor within 24 hours!</li><li>Practice with more than 750 questions</li><li>Practice questions by knowledge area and rationales</li><li>Participate in active discussions with other PMP candidates &amp; participants became PMP.</li><li>Get downloadable handouts and materials during course</li></ul><p><strong>You do not have to pay a lot for PMP training. By taking this course, you will enroll in the training based on your schedule anywhere and anytime you wish.</strong></p><p><strong>You will be able also meet the 35 PDU Hours Requirement of PMI to get PMP certification.</strong></p><p>This course includes concepts of project management. By taking this course, you will be very well prepared for PMP (Project Management Professional) exam. This course tells the theoretical concepts of project management in detail as other PMP courses. <strong>What differs this course from other PMP courses is its examples and real-life samples for the concepts described during the course.</strong></p><p><strong>YOU WILL BE ABLE TO UNDERSTAND THE PROJECT MANAGEMENT CONCEPTS EASILY WITH REAL-LIFE EXAMPLES.</strong></p><p>In each section, information and definition of the topics are covered and followed by real-life project examples in order to illustrate the concepts better.</p><p>Each section includes several questions and these questions are answered with explanations in videos. Also quizzes are available at the end of each section.</p><p>This course covers 10 project management areas and 5 process management groups defined by Project Management Institute (PMI) and compliant with Project Management Body of Knowledge (PMBOK5).</p><p><strong>5 Project Management Process Groups:</strong></p><ul><li>Initiating Process Group</li><li>Planning Process Group</li><li>Executing Process Group</li><li>Monitoring &amp; Controlling Process Group</li><li>Closing Process Group</li></ul><p><strong>10 Knowledge Areas:</strong></p><ul><li>Integration Management</li><li>Scope Management</li><li>Time Management</li><li>Cost Management</li><li>Quality Management</li><li>Human Resources Management</li><li>Communications Management</li><li>Risk Management</li><li>Procurement Management</li><li>Stakeholder Management</li></ul><p>Besides, course also provides tips and tricks for passing the PMP exam.</p><p>Although the course is designed for passing the PMP Exam, anyone who wants to excel in Project Management can take this course. Course content is also valid for preparing and passing PRINCE2 as well.</p><p><em>This course is qualified for Continuing Education Credit by AAPM</em></p><p><em>Disclaimer: PMI, PMBOK, and PMP are registered trademarks of Project Management Institute.</em></p>", 
    "end_date": null, 
    "title": "PMP® Exam Complete Training-35 Hours Ultimate PMP® Course", 
    "price": "20.00", 
    "instructors": "Master of Project Academy", 
    "commitment": "32.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/795040_ad2b.jpg", 
    "course_url": "https://www.udemy.com/pmp-exam-complete-training-35-hours-ultimate-pmp-course/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T19:28:12Z"
}