{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>Do you need to manage a project?</strong></p><p><em><strong>And do you want to deliver it on time, on budget, and to requirement?</strong></em></p><p>If you are new to project management - or just want a refresher, this course will give you all the basics and more.</p><p>Project management has become a vital element of business life. Success for both you and your organisation will depend on good project management skills.</p><p>How do you set up to succeed? This seminar shows you the practical tools, techniques and advice you need.</p><p><strong>What will I get?</strong></p><p>You will get over two and a half hours of high quality video - not just a PowerPoint with a voice over. </p><p>It is based on Mike's best selling three-hour live seminar and contains over two and a half hours of video, and a wealth of additional templates for you to download and adapt to your work. These will help you to manage your projects practically, for greater control and more success.</p><p><strong>If you want to deliver your next project on time, on budget and to specification, you can't afford not to take this course.</strong></p><p><br></p><p><strong>What people say about Mike's live seminar...</strong></p><p><em>“This did what it said on the box – a great deal of practical ideas for planning and managing tasks, along with understanding of key principles for successful delivery\"</em></p><p>Andrea Duncan, PDP Co-ordinator – University of Northampton</p><p><em>“One of the best seminars I've attended in the last 17 years. Enjoyable practical and useful. I would highly recommend this course\"</em></p><p>Diane Massey – DSM Legal Solicitors</p><p><em>“If you've never had formal training in project management – you'll learn a huge amount about processes and the secrets to succeeding in your projects\"</em></p><p>Paul Foxall, Senior Project Officer – Sandwell MBC</p><p><em>“Excellent seminar. I have been on previous project management course. This one seemed very different and much better due to brilliant examples Mike gave.\"</em></p><p>Emma Oliver, Marketecture</p><p><em>“Excellent content, clearly delivered. Really enjoyed Mike's course and found it exceptionally useful.\"</em></p><p>Nick Osborn, Fenland RP Ltd</p><p><em>“Very useful. Many excellent strategies to help guide project managers.\"</em></p><p>Rob Simpson, Basis (Registration) Ltd</p><p><em>“A great overall introduction to project management. I learnt a lot and have a lot I can start to implement tomorrow!\"</em></p><p>Catherine Mendham, Content Consultants</p><p><em>“Very practical, very useful. Gives confidence in knowing what is important and what is not. Mike is a very engaging speaker.\"</em></p><p>Louisa Davison, Secret Agent Marketing</p><p><em>“An excellent introduction and reminder of some of the fundamentals of project management.\"</em></p><p>Chris Price, Pulse PM Ltd</p><p><strong>Dr Mike Clayton</strong></p><p>Mike is on of the UK's leading project delivery experts. He has many years experience of managing projects and integrating change in many companies of varying sizes. Mike has had key roles in managing multi-million pound projects for Vodafone, General Motors, BAA and Transport for London. Organisations of all sizes have benefited from his skills in integrating complex change. You will get real results as his highly practical approach simplifies complex ideas.</p><p>Mike also has over 20 years' experience of training project managers, throughout the UK and in Europe and the US. He is the author of thirteen top-selling business, management, and personal effectiveness books, including four on project management topics:</p><ul><li><strong><em>How to Manage a Great Project </em></strong>   <em>On budget. On target. On time.</em>   (Pearson, 2014) </li><li><strong><em>The Influence Agenda </em></strong>   <em>A systematic approach to aligning stakeholders in times of change</em>   (Palgrave Macmillan, 2014)</li><li><strong><em>Brilliant Project Leader</em></strong>   <em>What the best project leaders know, do and say to get results, every time</em>   (Pearson, 2012)</li><li><strong><em>Risk Happens! </em></strong>   <em>Managing risk and avoiding failure in business projects</em>   (Marshall Cavendish, 2011)</li></ul><span></span><p><strong>Your Unconditional, No-questions, 30-Day Guarantee</strong></p><p>The best way to assess how valid this material is in you culture is to try it out. I am so confident that this course will change your life that I offer you an unconditional, no questions asked, full 30 day money-back-in-full guarantee. If you don't think this will give you a real sense of understanding and being in control of your project, then just ask me for your money back.</p><p><strong>What if you have questions?</strong></p><p>I will be on hand to answer your questions if you get stuck, puzzled, or just want to know more. As a professional trainer, this is what I do, and I promise to respond within 24 hours of your question arriving with me from Udemy. </p><p><strong>Enroll Now</strong></p><p>Enroll for this course now, so you can start to gain control of your projects straight away.</p>", 
    "end_date": null, 
    "title": "Practical Project Management for Managers and First Time PMs", 
    "price": "35.00", 
    "instructors": "Dr Mike Clayton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/505136_007c_5.jpg", 
    "course_url": "https://www.udemy.com/practical-project-management/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-18T12:37:23Z"
}