{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>PRINCE2 AGILE™: WHERE CONTROL MEETS INNOVATION, COLLABORATION AND FLEXIBILITY</strong></p><p>PRINCE2 Agile, the world's most complete project management solution, combining the flexibility and responsiveness of Agile with the clearly defined framework of PRINCE2®. PRINCE2 Agile is a new extension module tailored for forward-thinking organizations and individuals already benefiting from PRINCE2 that would like further guidance on how to apply Agile methods to the world's most recognized project management method.</p><p><strong>Accredited by EXIN on behalf of AXELOS</strong></p><p>The course consists of:</p><ul><li>40 video lessons, lasting 8 hours 20 minutes</li><li>22 quizzes (approximately 2 hours)</li><li>2 sample examinations (2.5 hours each)</li></ul><p>The course covers the entire exam syllabus including:</p><p>Agile Approaches:</p> <ul><li>Scrum</li> <li>Kanban</li> <li>Lean Startup</li></ul> <p>Blending PRINCE2® and Agile:</p> <ul><li>The Hexagon</li> <li>The 5 Targets</li> <li>Balance and Prioritisation</li></ul> <p>Tailoring PRINCE2 to an Agile project environment:</p> <ul><li>Principles</li> <li>Themes</li> <li>Processes</li></ul> <p>Areas of Particular Focus:</p> <ul><li>The Agilometer</li> <li>Requirements and User Stories</li> <li>Rich Communication</li> <li>Agile Contracts</li> <li>Frequent Releases</li></ul> <p><strong>SUCCESSFULLY MANAGE YOUR CAREER WITH PRINCE2 AGILE</strong></p> <ul><li>Improved position in the job market and career progression within project and programme management by being at the forefront of Practitioners achieving the new PRINCE2 Agile qualification</li></ul><ul> <li>Recognized globally with an international qualification which demonstrates your ability to apply best practice approaches to managing any and every kind of project – no matter the size or scale</li></ul><ul> <li>A broad understanding of all of the key Agile concepts and how these blend seamlessly into the PRINCE2 methodology</li></ul><ul> <li>Flexibility to work with an ever-evolving solution or, alternatively, one that is clearly defined in detail</li></ul><ul> <li>Completing your PRINCE2 Agile qualification will earn you 15 continuing professional development (CPD) points towards a professional membership, maintaining your PRINCE2 qualification other than through re-sitting the exam</li></ul><ul> <li>All AXELOS certified candidates will be asked if they want their names to appear on AXELOS' Successful Candidate Register where employers will be able to verify an individual's certification.</li></ul><p><br></p><p><strong>PRINCE2® is a registered trade mark of AXELOS Limited.</strong></p><p><strong>PRINCE2 Agile™ and The Swirl logo™ are trade marks of AXELOS Limited.<br></strong></p>  <p><strong>Copyright © Zindiak Limited and AXELOS Limited 2015. All rights reserved.</strong></p>  <p><strong>Material in this course has been sourced from the PRINCE2 Agile™ guide 2015 Edition</strong></p>", 
    "end_date": null, 
    "title": "PRINCE2 Agile™ Practitioner (AXELOS Accredited)", 
    "price": "50.00", 
    "instructors": "Zindiak Limited", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611078_dce2_10.jpg", 
    "course_url": "https://www.udemy.com/prince2-agile-practitioner/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T22:06:38Z"
}