{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>PRINCE2® (PRojects IN Controlled Environments) is a widely used project management method that navigates you through all the essentials for running a successful project. PRINCE2® is a flexible method and is aimed at all types of projects.</p><p>Companies and organizations often have difficulty organizing projects efficiently, resulting in increased costs, delays and failures. The time constraints, risks and complexity of many projects puts pressure on project managers and team members. PRINCE2® (Projects in Controlled Environments), the default standard for project management, is the solution to take projects to a higher level.</p><p><strong>This course is accredited by EXIN on behalf of AXELOS</strong></p><p>The course consists of:</p><ul><li>45 video lessons, lasting 8 hours 50 minutes</li><li>2 sample foundation exam papers (1 hour each)</li><li>7 Case Studies</li><li>3 White Papers</li></ul><p>The course covers the entire foundation exam syllabus including:</p><ul><li>seven PRINCE2 Principles</li><li>seven PRINCE2 Processes</li><li>seven PRINCE2 Themes</li></ul><p> <strong>Better prospects for the professional and the organization</strong> </p><p>A PRINCE2 certificate from AXELOS proves the professional has the required skills, knowledge and competence to successfully manage projects. That's why more and more companies around the world demand project managers who have a PRINCE2 certificate. An AXELOS certificate for PRINCE2 takes the skills of professionals to a higher level, thereby strengthening the organization he or she works for.</p><p><strong>PRINCE2® is a registered trade mark of AXELOS Limited.</strong></p><p><strong>The Swirl logo™ is a trade mark of AXELOS Limited.<br></strong></p><p><strong>Copyright © Zindiak Limited and AXELOS Limited 2015. All rights reserved.</strong></p><p><strong>Material in this course has been sourced from Managing Successful Projects with PRINCE2<span>®</span> manual 2009 Edition</strong></p>", 
    "end_date": null, 
    "title": "PRINCE2® Foundation (AXELOS Accredited)", 
    "price": "50.00", 
    "instructors": "Zindiak Limited", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556652_13c2_13.jpg", 
    "course_url": "https://www.udemy.com/prince2-foundation/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T20:21:08Z"
}