{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>PRINCE2® – THE WORLD’S MOST PRACTICED PROJECT MANAGEMENT METHODOLOGY</strong></p>  <p>PRINCE2 (Projects IN Controlled Environments) is a de facto standard developed and used extensively by project managers around the world.</p>  <p>Embodying established and proven best practice in project management, PRINCE2 is a flexible method that guides you through the essentials for running a successful project, regardless of type or scale. It can be tailored to meet your organization or industry-specific requirement.</p>  <p><strong>This course is accredited by EXIN on behalf of AXELOS</strong></p>  <p>The course consists of:</p>  <ul><li>26 video lessons, lasting 4 hours 20 minutes</li><li>2 sample practitioner exam papers (2.5 hours each)</li><li>7 Case Studies</li><li>3 White Papers</li></ul><p>The course covers the entire practitioner exam syllabus including:</p><ul><li>7 PRINCE2 Processes</li><li>7 PRINCE2 Themes</li></ul><p><strong>SUCCESSFULLY MANAGE YOUR CAREER WITH PRINCE2</strong></p><ul><li>Recognized around the world with a global qualification which demonstrates your ability to apply best practice approaches to managing projects.</li><li>Improved position in the job market and career progression within project and programme management by gaining recognized and regarded qualifications.</li><li>Effective methodology that works well with ‘knowledge based’ practices such as PMBOK – common in all projects around the world.</li><li>Clear role governance responsibilities, including the triggers, inputs and expected outputs.</li><li>Structured approach with controls to provide a delivery methodology that works repeatedly and will enable you to successfully deliver projects.</li><li>Manageable deliverables on each project, with stages to ensure that decisions are undertaken using an Agile approach</li><li>Protected project assets by knowing how to close your projects well to ensure lessons are captured.</li><li>Improved delivery confidence as everyone understands their role in delivering what the business expects.</li><li>Successful and consistent delivery to achieve the expected benefits by always starting your projects well.</li></ul><p><strong><br></strong></p><p><strong>PRINCE2® is a registered trade mark of AXELOS Limited.</strong></p><p><strong>The Swirl logo™ is a trade mark of AXELOS Limited.<br></strong></p><p><strong>Copyright © Zindiak Limited and AXELOS Limited 2015. All rights reserved.</strong></p><p><strong>Material in this course has been sourced from Managing Successful Projects with PRINCE2® manual 2009 Edition</strong></p>", 
    "end_date": null, 
    "title": "PRINCE2® Practitioner (AXELOS Accredited)", 
    "price": "50.00", 
    "instructors": "Zindiak Limited", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622042_91a6_8.jpg", 
    "course_url": "https://www.udemy.com/prince2-practitioner/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T08:31:36Z"
}