{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>*** Over 1800 Students Enrolled and Counting ***</strong><br></p>\n\n\n\n\n\n<p>Take a listen to what people are saying about my course:</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The course content is great. It is structured in a manner that makes understanding complex aspects very easy. The practice questions and quizzes are what helped me the most in this course. The lectures were clear, short and to the point. <em>William Benoist</em></strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Project management</strong><strong class=\"redactor-inline-converted\"> – </strong>discipline of planning, organizing, securing, managing, leading, and controlling resources to achieve specific goals. A project is a temporary endeavor with a defined beginning and end (usually time-constrained, and often constrained by funding or deliverables), undertaken to meet unique goals and objectives, typically to bring about beneficial change or added value. The temporary nature of projects stands in contrast with ongoing business operations.<br></em></p>\n\n\n\n<p>Welcome to project management essential training. I'll be teaching you how to manage your project effectively from beginning to end.</p>\n\n\n\n\n\n<p>we'll begin by taking a closure look at the general concept of project management. I'll then take you to defining a project starting with identifying the problem to solve and how you're going to solve it.</p>\n\n\n\n\n\n<p>Next, we'll discuss planning your project. We'll take a look at identifying the work that needs to be done, building a schedule and defining the grand rules for how you run your project</p>\n\n\n\n\n\n<p>Finally I'll provide tips for launching your project and monitoring and controlling its performance so that you stay on time, and within budget.</p>\n\n\n\n\n\n<p>Having the proper tools in your project toolbox is critical to running a successful project. I'll introduce you to this tools and how to use them effectively in project management essential training.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Project Management Essential Training", 
    "price": "20.00", 
    "instructors": "El mustapha Ben Bihi", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517506_d0e7_9.jpg", 
    "course_url": "https://www.udemy.com/project-management-essential-training/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T22:09:45Z"
}