{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Project Management: Executing Phase</strong> is designed for aspiring project managers, project team members and technical team members wanting to get more involved in project managing the implementation phase of a project.</p>\n\n<p>This <em>project management course </em>is a follow-on course from <strong>Project Management: Planning,</strong> and is structured around the premise that all projects have a beginning, a middle and an end, and that all successful projects follow a <em>standardised project management methodology</em>.</p>\n\n\n\n\n\n<p>Learn how to implement, monitor and control your projects using simple, repeatable project management processes guided by an easy to use project management methodology.</p>\n\n\n\n\n\n<p><strong>Supercharge your career, build on your project management skills and deliver the product of your project on time, under budget and to the absolute delight of your key stakeholders.</strong></p>\n\n\n\n\n\n<ul><li>Learn all the project management processes and methods needed to complete the execution phase of your projects making sure all deliverables are completed, documented and accepted</li><li>Discover my Practical Project Management Methodology - making your projects easy to manage and control</li><li>Download a complete set of the only project management document templates and checklists you will ever need to manage the execution phase of your project successfully</li></ul>\n\n\n\n\n\n<p><strong>Become a successful and practical project manager by introducing my Practical Project Management Methodology today so that you can plan, implement and bring all your projects to a successful conclusion</strong></p>\n\n\n\n\n\n<p>In this project management course you will learn:</p>\n\n\n\n\n\n<ul><li>My Practical Project Management Methodology</li><li>What project integration management is all about</li><li>How to manage stakeholders during the execution phase</li><li>How to manage and control changes to scope, cost and schedule</li><li>How to control your project scope</li><li>How to control your project schedule</li><li>How to develop your project team</li><li>How to manage and control your project budget</li><li>How to develop a risk response plan and take care of risk events</li><li>How to introduce quality assurance and quality control into your projects</li><li>How to select suppliers and manage the agreements made</li><li>How to produce and distribute effective communications to your stakeholders</li></ul>\n\n\n\n\n\n<p>The project management course consists of:</p>\n\n\n\n\n\n<ul><li>Video presentations</li><li>Complete set of downloadable project management document templates and checklists</li><li>Easy to do quizzes</li></ul>\n\n\n\n\n\n<p>And</p>\n\n\n\n\n\n<ul><li>Me - students can ask and comment on questions in the discussion area and I will be available to advise on any aspects of the execution phase of a project</li></ul>\n\n\n\n\n\n<p>See you on the inside…</p>\n\n\n\n\n\n<p>Jeb Riordan, PMP</p>", 
    "end_date": null, 
    "title": "Project Management: The Executing Phase", 
    "price": "20.00", 
    "instructors": "Jeb Riordan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/553370_9a0e_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-successful-project-manager-part-2-execution/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-13T14:45:18Z"
}