{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Description</strong><br></p>\n\n<p>This professional development course covers the strategy, tactics, and processes needed in a Project Management Office (PMO).</p>\n\n<p><strong>What you will learn</strong></p>\n\n<p>In this course, we will learn how to setup and run a Project Management Office (PMO) that is based on the best practices, tools, techniques and templates used in PMBOK, PRINCE2, AGILE and other popular project management best practices.</p>\n\n<p>This is a rich, self-paced online development course that covers the identification of risks and delays, project resource conflicts, the theory of constraints, managing multiple projects, throughput, behavioral management and other critical areas that everyone involved in Project Management should master in order to deliver value to their organization. </p>\n\n<p>As well, a road map to improve project management and a detailed plan to implement strategic planning and a PMO that can be measured.</p>\n\n<p><strong>Best practices are taken from successfully established PMO in USA, Canada, UK and Australia. As well, unsuccessful implementation of PMO as case study to enhance our knowledge.</strong></p>\n\n<p><strong></strong><strong>What you will learn:</strong></p>\n\n<ul> <li>How to recognizes ROI opportunities</li> <li>How to identify threats to project delivery</li> <li>Behavior Management Techniques</li> <li>Project Throughput</li> <li>How to implement a PMO</li> <li>Type of PMO models</li> <li>How to gain value from a PMO</li></ul>\n\n<p>Many extra materials are available for download related to this course.</p>", 
    "end_date": null, 
    "title": "Project Management Office (PMO): Essentials and Tactics", 
    "price": "20.00", 
    "instructors": "MSc, PMOC, PMP®, PRINCE2®, ITIL® Ramzi Abou Rahal", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585694_b699_17.jpg", 
    "course_url": "https://www.udemy.com/project-management-office-pmo/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T19:03:24Z"
}