{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t           This course is based on these three knowledge areas of the Project Management Body of Knowledge as set by the Project Management Institute. Students are introduced to the principles and applications of time, cost and quality management as they relate to the construction and engineering industry - so a combination of theory and practice. Completion of the program will enable you to demonstrate a strong understanding of the background, principles and applications of these subjects and can be used in progress towards a full Diploma of Project Management.  </p>\n\n<p>Please note that this course is priced in US dollars. <br></p>\n\n<p>Duration of Study </p>\n\n<p>The pace at which each student studies is different. The nominal hours for this course are 120 hours, however, this can vary greatly depending on your previous experience and study techniques. Student support is available by asking a question online or visiting our website.</p>\n\n<p>Our Support as a Registered Training Organisation (Provider number 22450)</p>\n\n<p>As a RTO (Provider number 22450), Exner Education is responsible for delivering quality training and assessment. </p>\n\n<p>  \t   The Units of competency covered in this course are  </p>\n\n<p>  \t   1. Manage Project Cost BSBPMG514A  </p>\n\n<p>  \t   2. Manage Project Time BSBPMG512A<br>  \t   3. Manage Project Quality BSBPMG513A  </p>\n\n<p>  \t   and represents 3 units of the 12 required to complete a full Diploma of Project Management.  </p><p>If you are an Australian student and would like to be assessed for a Nationally accredited statement of attainment within the VET sector, please visit our website for further information.</p><p>You may also be interested in qualifying for the Diploma of project management. The project management essentials course makes up 25% of the diploma.</p>", 
    "end_date": null, 
    "title": "Project Management Essentials Cost, Time, Quality ", 
    "price": "50.00", 
    "instructors": "Exner Education", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135886_daee_8.jpg", 
    "course_url": "https://www.udemy.com/project-management-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-20T00:39:20Z"
}