{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Learn how to close projects according to the PMBOK® Guide, globally recognized standard for the project management profession.  </p>  <p>  \t<strong>Close Your Projects Like A Professional Project Manager And Pass PMP® exam. </strong>  </p>  <ul>  \t<li>Close Procurement and Close Project or Phase</li>  \t<li>Premature project termination</li>  \t<li>Project Closure Document</li>  \t<li>Lessons Learned</li>  </ul>  <p>  \t<strong>Professional methods and tools at your fingertips!</strong>  </p>  <p>  \t  Learning the fundamentals of PMBOK® Guide closing processes gives you a deep understanding of key points in a project closure. PMBOK® Guide is the globally recognized standard with over 500 000 certification holders and PMI serves as an unbiased endorsement of your project management expertise and professional experience on a global level. At the end of this course you will be able to <strong>finish your projects</strong> in a <strong>professional</strong> way, sending a strong message to the stakeholders that <strong>you are a project management professional</strong>.  </p>    <p>  \t  Content and Overview:</p>  <p>  \t  The course is divided into four sections. After the summary in the first section, you will recognize the fundamentals of PMBOK® Guide knowledge in section two. You will understand what are project closing processes, what tools and methods you should use, and what are the inputs and outputs of each one of them.  In section three  you will find answers to frequently asked topics - a practical project manager's checklist, advices for project premature termination, Project Closure Document with ready-to-use template and tips on Lessons Learned session.  </p>", 
    "end_date": null, 
    "title": "Project closure guide: complete project like a master (PMP)", 
    "price": "20.00", 
    "instructors": "Justyna Blajerska, PMwars.com Ltd", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402168_4f5e_3.jpg", 
    "course_url": "https://www.udemy.com/project-closure-capm-pmp/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T13:19:12Z"
}