{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to <strong>Project Management Professional</strong> from LearnSmart. </p><p>LearnSmart is<strong> Project Management Institute (PMI) Global Registered Education Provider (REP 3577)</strong>. This course qualifies for the above credit hours toward the PMP or CAMP training contact hours or toward maintaining your current certification. Thus meeting the<strong> 35 Contact Hours </strong>requirement necessary to register for the PMP exam or for experienced project managers wanting to brush up on their education.</p><p> In this course, you will learn the skills you need to be an effective project manager as well as the knowledge you will need to pass the PMP certification exam. Upon completing this course's final exam you will be eligible to print your Certification of Completion for submission to PMI for this purpose. </p><p><strong>Course Overview:</strong></p><p>If you're interested in becoming an accomplished project manager, this training will establish your understanding of all the fundamental concepts, processes, and procedures necessary to become an effective project manager. You will spend time concentrating on each knowledge area, and studying the tools and techniques, inputs, and outputs associated with each knowledge area. Specifically, you will cover the project management life cycle, project scope, project scheduling, team dynamics, and more. From there, you will build on that understanding so that you know how to effectively implement the strategies and practices discussed. All in all, you will gain all the skills to be competitive in your career as a project manager.</p><p><strong>Course Breakdown:</strong></p><p><strong>Section 1: </strong>In the pre-assessment quiz you'll face questions from all sections of this PMP Certification training. Test your current knowledge and know your strengths and weaknesses.</p>  <p>  \t<strong>Sections 2-4:</strong> Spend time learning about Project Integration Management. Through these lessons, you are provided with details on the activities encompassed in the Integration processes.  </p>  <p>  \t<strong>Sections 5-6:</strong> Focus on Project Scope Management as you learn the ins and outs of identifying project requirements, creating the WBS, and establishing project metrics.  </p>  <p>  \t<strong>Sections 7-9:</strong> Delve into the inputs, tools and techniques, and outputs encompassed within Project Time Management. Make time your asset as you learn how to work with a project schedule, focus on creating realistic deadlines, and observe how to effectively distribute project resources.  </p>  <p>  \t<strong>Sections 10-11:</strong> Go step-by-step through Project Cost Management as you study budget constraints, and the relationship between quality, scope, and resources.  </p>  <p>  \t<strong>Sections 12-13:</strong> Dig into Project Quality Management. The practices and tools you learn here will help you to maintain the project's quality standards, while balancing financial and time sacrifices.  \t<strong>Sections 14-15:</strong> Study to learn more about Project Human Resources Management. It's important to have the appropriate resources at the right time. Discover the tools and techniques needed to gain those resources.  </p>  <p>  \t<strong>Sections 16-17:</strong> Explore Project Communications Management. Increase team communication to ensure project success as you gain a deeper understanding of how to plan and execute communications internally and externally.  </p>  <p>  \t<strong>Sections 18-21:</strong> Learn about Project Risk Management. There are two types of risk that you need to learn how to respond. Find out ways to identify and analyze risk, as well as how to quantify and mitigate risk.  </p>  <p>  \t<strong>Sections 22-23:</strong> Concentrate on Project Procurement Management. You will study the seller-buyer relationship, and how to acquire the products you need to complete the project deliverables.  </p>  <p>  \t<strong>Sections 24-25:</strong> Avoid stakeholder problems as you get into Project Stakeholder Management. You will learn how to incorporate stakeholders at the appropriate time, how to work with their opinions and needs, along with observing how to respond to them.  </p>  <p>  \t<strong>Section 26:</strong> Final Exam  </p>  <p>  \t            The content in this course comes from PMI's PMBOK Version 5</p><p>Contact Hours: 35 Hours</p><p>**Purchasing this <em>complete</em> Project Management Professional (PMP)® training module offers you an <strong>18% discount </strong>over purchasing each individual PMP® module.</p><p><strong>Recommendations: </strong></p><p><strong></strong>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li><em>This course is of high quality - This course will let you become a PMP and CAMP master and it will explain you every concept from scratch. The instructor is highly engaging and highly motivating. Can't be better. Thank you -- Saber Tlili</em></li><li><em>I enjoyed learning every bit of this course - worth every bit - This is the first time I sat thru the entire course lectures, listened very carefully and assimilated a lot of PM knowledge. This method of education is of prime value because you don't have to tax your eyes reading - just sit back and listen to any lecture you want. This helps in learning faster than reading. I am glad I took this course - the lectures and the 83 quizzes that really challenged my brain - <em>Khurshid Khan</em><br></em></li></ul>", 
    "end_date": null, 
    "title": "Project Management Professional (PMP)® - 35 Contact Hours", 
    "price": "50.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "31 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328266_ad33_3.jpg", 
    "course_url": "https://www.udemy.com/pmp-certification-complete/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T16:27:34Z"
}