{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Project is a big risk. And it's full of smaller ones. Would you like to learn how to get a project under control, instead of being in a control of a project? </p><p>Learn best practices of project risk management and make a positive change in your career.</p><ul><li>Plan Risk Management</li><li>Identify Risks</li><li>Perform Qualitative and Quantitative Risk Analysis</li><li>Plan Risk Responses</li><li>Control Risks</li></ul><p>Risk management is not a secret knowledge restricted to academic professors. You can learn it on your own and make a use of it in practice!</p><p>This course will give you a deep understanding of the risk management aspect of projects. You will learn how to plan in advance the processes of risk management, and how to apply best tools and methods to identify and assess risks, plan risk responses and control the risk throughout the project.</p><ul><li>use risk breakdown structure and probability and impact matrix</li><li>avoid, mitigate, transfer or accept threats</li><li>exploit, enhance, accept or share opportunities</li><li>calculate expected completion date and costs</li></ul><p>Professional methods and tools at your fingerprint!</p>The course is driven by the best practices recommended by PMBOK5® Guide, which is the globally recognized standard for the project management profession. Learn their best practices and join the community of project management professionals.<p>Do you want to pass PMP exam? This course is for you! It covers all processes in project risk management and can perfectly prepare you to the exam by practicing challenging quiz questions.</p>", 
    "end_date": null, 
    "title": "Project risk management for PMP® certification", 
    "price": "20.00", 
    "instructors": "Justyna Blajerska", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480956_b0af_3.jpg", 
    "course_url": "https://www.udemy.com/project-risk-mangement-pmbok-pmp-capm/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T07:58:02Z"
}