{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Project Planning and Scheduling is one of the most important activities for a Project Manager when starting and managing any type of project. Many mistakes are made during the first few weeks shaping the project scope, leading up to a plan and a schedule. During my career as Project Manager and Manager of Project Management Offices I have come across many emerging and junior Project Managers who were lacking the initial understanding of what was important for the lead up to building a schedule.</p><p>This course is written for beginners and Project Management juniors, so that you will learn what Project Planning and Scheduling is about. </p><p>After completion of this course </p><ul style=\"\"><li>you will have an understanding of various Project Management methodologies;</li><li>you will be able to discuss the difference between planning and scheduling;</li><li>you will know what it takes how to create a workable schedule, </li><li>you will know what you need to do to establish good and meaningful Project Performance Reporting; and</li><li>you will learn about tools for scheduling and Project Portfolio Management on a high level.</li></ul>My teams over the years have compiled a number of tips and tricks to make life of a Project Manager more predictable. I have added a number of them in this course, so you will be well prepared to start your first project and avoid doing rookie mistakes.The course takes just under 2 hours and is filled with great material for you to learn about the basics of Project Management Methodologies; how to derive a plan and schedule from the project scope and objectives, create a schedule that you can work with, what you should look out for when monitoring and controlling project performance and finally, which scheduling tool or Project Portfolio Management tool would be suitable.If you want to successfully manage your first few projects and get a head start following what seasoned Project Managers already do, this course is for you! You will no doubt grasp the concepts of Project Planning and Scheduling and apply them straight away in your career as a Project Manager.", 
    "end_date": null, 
    "title": "Project Planning and Scheduling for Beginners", 
    "price": "30.00", 
    "instructors": "Bodo Frost", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486428_18a4_5.jpg", 
    "course_url": "https://www.udemy.com/project-planning-and-scheduling-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-26T02:34:18Z"
}