{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>We are a PMI Registered Education Provider:</em></strong></p><ul><li><strong>Instructingcom, LLC #4082</strong></li><li><strong>PMP Exam Prep Online; Activity ID 145641</strong></li><li><strong>36.50 PDU hours</strong></li></ul><p><strong><em>Not all trainers on Udemy are part of the PMI REP program - we are! We have passed a quality audit, a business review, and we completely abide by the PMI REP program. </em></strong></p><p>You need to pass the PMP® exam and you need quality training that'll help you in your role as a project manager. You also want to learn from an authority in project management, in an online environment with plenty of exercises, videos, and concise explanations. This course provides 36.5-contact hours of project management education and is taught by project management author and expert Joseph Phillips.<br></p><p>The 36.5 contact hours of project management education are earned by completing all of the course videos AND all the interactive video sessions in the course. You must complete all of the videos and all of the interactive video sessions to claim the educational hours for your PMP exam application. The Learning Management System tracks your completion of the course.</p>  <p>Our PMP® Exam Prep course provides complete coverage of the PMP® exam objectives for the PMBOK Guide, Fifth Edition. Start today, invest in your career, and begin working to clear your PMP® exam. Here's what's included in our PMP® Exam Prep Online Seminar:<br></p>  <p>  \t    ►Updated for the 2016 PMP Exam Objectives</p><p>►Complete coverage of the entire PMBOK® Guide, fifth edition  </p>  <p>  \t    ►Complete coverage of the entire PMP® exam objectives  </p>  <p>  \t    ►35 contact hours of project management education</p>  <p>  \t    ►400 PMP® practice exam questions and answers on all exam objectives  </p>  <p>  \t    ►14 module exams (280 practice questions) covering every chapter of the PMBOK® Guide, fifth edition  </p>  <p>  \t    ►323-page PDF course workbook; entire course for note-taking and following along  </p>  <p>  \t    ►Videos of all concepts, formulas, theories, and project management practices  </p>  <p>  \t    ►Lectures on the entire PMP® exam objectives  </p>  <p>  \t    ►Math and concept worksheets for PMP® exam formulas  </p>  <p>  \t    ►Worksheet of the 47 processes and their ITTOs  </p>  <p>  \t    ►24 x 7 Web and mobile access  </p>  <p>  \t    ►Flashcards of every term used in the PMBOK Guide, Fifth Edition, and this course  </p>  <p>  \t    ►PMP® Memory Sheets (PDF document) for printing, review, and on-the-go learning  </p>  <p>  \t    ►All exams are distributed in PDF format for easy printing and studying on-the-go  </p>  <p>  \t    ►Course discussions with the Instructor and peers  </p>  <p>  \t►30-day satisfaction guaranteed</p>", 
    "end_date": null, 
    "title": "Project Management Professional:  Prep for PMP", 
    "price": "50.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "49 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/349678_b46e_3.jpg", 
    "course_url": "https://www.udemy.com/pmp-exam-prep-everything-you-must-know-to-pass-the-pmp-exam/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T15:11:35Z"
}