{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                           The Project Management Professional (PMP®) certification awarded by the Project Management Institute (PMI®) is truly a globally recognized qualification.  </p>  <p>  \t                           In today’s challenging job market many candidates are turning to the PMP® certification to advance their careers. In addition many employers are now requiring Project Managers and Team Leads to be PMP® certified.  </p>  <p>  \t                           At 1st Choice Project Management Training we will help you every step of the way to ensure your success and make sure you pass the exam the first time. Unlike many other classes we don&#039;t just simply teach you &#039;the syllabus&quot;. We don&#039;t just simply teach you course materials. But moreover we concentrate on HOW to pass the exam by giving you tips and tricks along the way, and showing you what to look out for in exam questions.  </p>  <p>  \t                           Put simply, knowing the course materials is not enough to pass the exam. You also need exam technique and it is this exam technique that we like to concentrate on while teaching the materials. All through these video courses you will find many tips and tricks that the instructor will be pointing out.  </p>  <p>  \t<strong>Benefits of taking this class</strong>  </p>  <ul>  \t<li><strong></strong>13+ hours of videos over 87 lectures.</li>  \t<li>Detailed explanations of Critical Path and all Formulas (it&#039;s not enough to just memorize formulas, you also need to UNDERSTAND them).</li>  \t<li>Breakdown of exam questions showing you what to look out for and how to identify key words and phrases.</li>  \t<li>Access to live help.</li>  </ul>", 
    "end_date": null, 
    "title": "Project Management Professional (PMP®) Exam Preparation", 
    "price": "50.00", 
    "instructors": "1st Choice Project Management  Training", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/274124_180d_11.jpg", 
    "course_url": "https://www.udemy.com/pmp-exam-preparation/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-03T23:40:06Z"
}