{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Project Management</strong></p><p>Build a free intranet / project management dashboard using Google Sites software for completely free!</p><p><strong>Intranet Project Management Dashboard</strong></p><p>Do you want to learn how to create your own business intranet / project management dashboard absolutely free?</p><p>Help your teams share important information and stay connected with powerful social functions</p><p>How about creating an internal project management site for a client project?</p><p>And do you want the same system that many large corporates use for free?</p><p><strong>Build A Project Management Dashboard</strong></p><p>In this course we will show you how to setup and use Google Sites to create an intranet that functions as a project management dashboard with a free gmail account!</p><p>We will take you step by step through that process and help you create a simple yet powerful business tool that is only limited by your imagination…</p><p>We will also show you how to set your intranet up so that you can decide who sees what - giving you complete control over company data!</p><p><strong>No Coding Required</strong></p><p>We will use a simple project based lesson structure for this course</p><p>And all this with no coding…</p><p>So just need to follow along and copy what we are doing!</p><p><strong>Who Is This Course For?</strong></p><p>This course is for businesses or entrepreneurs that want to build an intranet or project management dashboard with no budget.</p><p>This course is suitable for anyone who wants to learn how to use Google Sites.</p><p><strong>What Will You Be Able To Do After Taking The Course?</strong></p><p>By the end of the training you will know how to:</p><p>Build a project management dashboard using Google Sites</p><p>Build a company intranet for free</p><p>Set permissions for security so you choose who accesses content</p><p>Add Google resources like spreadsheets, documents and reports</p><p>Create a social layer to your company's intranet</p><p><strong>What Is Covered In The Course?</strong></p><ul><li>Site Design Layout</li><li>Using A Mind Map For A Site Design Layout</li><li>Example Site Build</li><li>Creating A Site</li><li>Styling A Site</li><li>Building Ar Home Page</li><li>Creating Announcement Pages</li><li>Creating List Pages</li><li>Creating Task Lists</li><li>Importing A Company Calendar</li><li>Styling A Page</li><li>Adding Side Bar Content</li><li>Building A Project Page</li><li>Creating A Company Forum</li><li>Creating A Training Page</li><li>Creating A Contact Page</li><li>Linking The Navigation</li><li>Setting Permissions</li></ul><strong>30 Day Money Back Guarantee</strong>If you are not happy with the course for any reason whatsoever, you are entitled to a 30 day Udemy money back guarantee.<strong>Join Us On The Other Side</strong>So join us on the other side and learn how to build your own Intranet / Project Management Dashboard.", 
    "end_date": null, 
    "title": "Project Management Dashboard Build It Free With Google Sites", 
    "price": "25.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536424_7b56_6.jpg", 
    "course_url": "https://www.udemy.com/intranet-for-project-management-google-sites/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T18:40:18Z"
}