{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Major corporations are adopting A Guide to the Project Management Body of Knowledge (<em>PMBOK® Guide</em>) 5th Edition, from the Project Management Institute, and the related Project Management Professional (PMP) Certification, as the primary sources of competency in the field of Project Management.</p><p>Market research indicates that employers want to hire project management practitioners who have real experience leading and directing projects. To better meet this need, PMI is incorporating in the certification application process the requirement to document experience leading and directing the various tasks required in effective project management. In addition, PMI is placing increased emphasis on situational questions in the testing process for the PMP Certification to better evaluate applicant skill in actually using their <em>PMBOK® Guide </em>knowledge. This has made the PMP Certification test harder than it was in the past, and increases the value of preparation course work prior to taking the test. This course, along with the review of materials and repeated practice testing, will more than adequately prepare student to take the PMP Certification Exam. For those individuals who cannot qualify for the PMP Certification Exam, this course will amply prepare them to sit for the CAPM Certification Exam.</p><p><strong>***** THE MOST RELEVANT CONTENT TO GET YOU UP TO SPEED *****</strong></p><p><strong></strong>***** <strong>COURSE UPDATED:</strong> <strong><em>February 2016 </em>*****</strong><strong></strong></p><p><strong>***** CERTIFICATE OF COMPLETION *****</strong></p><p><em><strong></strong>\"Great course content and great instructor. Larry answered all my questions and I now feel that studying for the PMP exam will be a lot less of a daunting task than I originally thought.\" - Mary W. </em></p><p><em>\"I liked the way the course addressed the interaction between the Process Groups and the Knowledge Areas in the PMBOK Guide. I think I understand the big picture a lot better now and I know it will be easier to prepare for the exam.\" - Chris K. </em></p><p><em>\"I really enjoyed the class and have a new appreciation for project management and for the importance of PMP certification. Rich course content and an excellent instructor were a real plus for me.\" - Anne S. </em></p><p><em>\"Excellent course. A lot of very useful material that I can review as needed, as I prepare for the PMP exam. Instructor was a big help.\" - Jean B.</em></p><p>According to Eric Bloom there are 10 reasons you should get the highly prestigious PMP certification:</p><p>1. Will expose you to mainstream thinking on project management standards, techniques, best practices, and current trends </p><p>2. You will learn great new tricks and techniques to assist you in your project management activities </p><p>3. When hiring, many companies are now giving preference to project managers that are PMP certified </p><p>4. It's a formalized display of your professional ability </p><p>5. If working for a consulting firm, your PMP credential may help your company win business, making you more valuable to your firm </p><p>6. Will provide networking opportunities with other PMPs </p><p>7. Will impress your friends at cocktail parties </p><p>8. Will provide potential teaching opportunities by teaching PMP classes to future PMP candidates </p><p>9. Illustrates personal drive to further your credentials, knowledge, and professional abilities </p><p>10. Helps to distinguish you from other project management professionals in this tough job market </p><p>You'll have<strong> lifetime online access</strong> to watch the videos whenever you like, and there's a Q&amp;A forum right here on Udemy where you can post questions.</p><p>We are so confident that you will get<strong> tremendous value</strong> from this course. <strong>Take it for the full 30 days and see how your work life changes for the better.</strong> <strong>If you're not 100% satisfied</strong>, we will gladly refund<strong> the full purchase amount!</strong></p><p>Take action now to take yourself to the next level of professional development. Click on the <strong>TAKE THIS COURSE </strong>button, located on the top right corner of the page, NOW…<strong><em>every moment you delay you are delaying that next step up in your career…</em></strong></p>", 
    "end_date": null, 
    "title": "Project Management Professional (PMP/CAPM) Exam Preparation", 
    "price": "50.00", 
    "instructors": "Optima Train", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532498_8303_3.jpg", 
    "course_url": "https://www.udemy.com/project-management-professional-pmpcapm-exam-preparation/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T21:31:01Z"
}