{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Money. Cash. Greenbacks. Dead presidents. It’s all the same thing when you get down to it: Projects require finances to get from start to completion, and it’s often the project manager’s job to estimate, control, and account for the finances a project demands. Projects consume the project budget during execution, when all of those project management plans we’ve discussed are put into action, and the project budget is monitored and controlled during, well, the monitoring and controlling processes.</span>  </p>  <p style=\"\">  \tWhat’s that you say? You don’t have any control over the monies your project requires? Management gives you a predetermined budget, and it’s up to you to make it all work out? Yikes! While this book centers on your Certified Associate in Project Management (CAPM) and Project Management Professional (PMP) examinations, that’s always one of the scariest things I hear. Or is it? If management’s decision is based on previous projects, business analysts’ research, or should-cost estimates from experts, then it’s not so scary. I’ll give you this much: A predetermined project budget is always a constraint, and it’s rarely fun for the project manager.  </p>  <p style=\"\">  \tAnd what about those projects that don’t have any monies assigned to the project work? You know… the projects where the project scope is completed just by the project team’s work, and there really aren’t any materials or items to purchase. That’s okay—there are still costs associated with the project, because someone, somewhere, is paying for the project team’s time. Salaries can also be considered a project cost. After all, time is money.  </p>", 
    "end_date": null, 
    "title": "Project Management: Cost Management for Project Managers", 
    "price": "20.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382522_93bf_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-project-costs-for-project-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T23:00:00Z"
}