{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you looking for Simple Tools and Techniques on How to Manage Multiple Projects using a Very Simplified and Effective Approach.</strong></p><p><strong>Whether you are New or Experienced to Project Management, you would find this course useful. </strong></p><p>In this course, I would teach you, How to Manage, Projects for your Clients or to Improve the Productivity of your Business, using some simple tools, that I share in this course.</p><p>In this course, I would be sharing with you, on How to Manage your Projects by making use of the following tools.</p><ol><li>Trello</li><li>Basecamp</li><li>Zoho</li><li>Insightly</li></ol><p>By the end of the course, you would learn to choose the right platform for Managing your Business or your Projects. </p><p>You would also learn, How to Eliminate the Hustle of Managing Multiple Projects at the same time, more effectively.</p><p><strong>Upon completion of this course, I would assure you that, Project Management Won't be a Boring Stuff Any More. I would show you How to Manage the Projects Creatively and Have FUN with it.</strong></p><p>I will be sharing creative tactics to help you plan your projects more creatively using images and colors and by utilizing Mind Mapping. </p><p><strong>What are you waiting for? Enroll into this COURSE NOW and unleash the Project Manager hidden within you.</strong></p>", 
    "end_date": null, 
    "title": "Project Management Using Simple Tools", 
    "price": "20.00", 
    "instructors": "Nour Tarzi", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589884_ec82_4.jpg", 
    "course_url": "https://www.udemy.com/choosing-the-right-project-management-software-for-you/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T21:22:50Z"
}