{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p></p>  <p>  \t            Project Management has been in existence since 1950s. However with the industrial boom, more organizations are looking for an able project manager to lead their projects. This discipline has been and will be an important one irrespective of the industry and technology.  </p>  <p>  \t        Project management has been proven to be the most effective method of delivering products within cost, schedule, and resource constraints.  </p>  <p>  \t              This course packs the vital ingredients of Project Management in a small package.  </p>  <p>  \t              This course contains:  </p>  <p>  \t<strong>- Fundamentals of Project Management</strong>  </p>  <p>  \t<strong>- Walk through the Processes of Project Management</strong>  </p>  <p>  \t<strong>- ITTO (Input / Tools and Techniques / Output) diagrams</strong>  </p>  <p>  \t<strong>- Calculations used in Project Management</strong>  </p>  <p>  \t<strong>- Has chapters with Focus on PMP Exams</strong>  </p>  <p>  \t<strong>- Quiz based on PMP Exam </strong>  </p>  <p>  \t              Project Management is one of the fastest growing, lucrative and awarding career. And its not that tough as it is usually portrayed. Yes! You read it right, Project Management is not that complex if you have understood the basic very clearly.  </p>  <p>  \t                          This course will give an overview of Project management and its fundamentals.  </p>  <p>  \t                          This course has been designed to make you understand the basic of project management. Whether you are experienced professional or a new bee trying to get hang of project management, this course is apt for you! For fresher's, this course will set you on the right path and for professionals it will refresh your brains!  </p>  <p>  \t            At the end of this course you will:  </p>  <p>  \t<strong>- get fundamentals of Project Management right</strong>  </p>  <p>  \t<strong>- be able to answer PMP exam</strong>  </p>  <p>  \t<strong>- be able to create a project plan</strong>  </p>  <p>  \t<strong>- be able to evaluate your project status</strong>  </p>", 
    "end_date": null, 
    "title": "Project Management made Simple - BASIC - Based on PMBOK 5 ", 
    "price": "20.00", 
    "instructors": "Warren Prasad", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312720_c2d0_10.jpg", 
    "course_url": "https://www.udemy.com/project-management-made-simple-basic-pmbok5/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T07:00:43Z"
}