{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Based on extensive related hands-on practical experience, this course provides you with the skills and knowledge to effectively and efficiently discover PMO operations needed to provide valuable solutions for business and IT.</p><p>Learn How the Project Management Office (PMO) Operate course authored by Chuck Morrison, MBA, PMP with over 25 years Program Management and Business Architecture experience in Silicon Valley California.</p><p>The primary goal of a PMO is achievement of benefits of standardizing and following project management policies, processes, and methods. PMOs generally become the source for guidance, documentation, and metrics related to managing practices in implementing projects within the organization. A PMO is often involved in project-related tasks and follow up on project activities from initiation through completion. PMOs report project activities, problems and requirements to executive management as a strategic tool for ensuring implementers and decision makers move toward consistent, business- or mission-aligned goals and objectives.</p><p>All affected stakeholders including sponsors, subject matter experts, and other resources must be involved in collaborative development viable solution based on PMO operations and processes for any executive decisions. This requires the leadership, skills, and knowledge or experienced analyst and architects capable of supporting an effective business solution needed to return business systems to proper operation.</p><p>Critical processes emphasized during this course are collaboration, listening, analysis, and modeling techniques needed for effective and efficient system operations solutions. This course helps you develop the skills and knowledge needed to support effective solutions and decisions regardless of your role.</p><p>If you find my course useful, please consider leaving a review and rating. Your review is much appreciated. You can go directly to the review page for this course then click and enter your review and rating.</p><p>Thank You and Best Regards,Chuck Morrison, MBA, PMP</p>", 
    "end_date": null, 
    "title": "Project Management Office: Learn How the PMO Functions", 
    "price": "25.00", 
    "instructors": "Chuck Morrison", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572706_f7c6_6.jpg", 
    "course_url": "https://www.udemy.com/learn-how-the-project-management-office-pmo-functions/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T19:25:51Z"
}