{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>*** VORBESTELLER-ANGEBOT: 20 EURO - KAUFE JETZT GÜNSTIG, BEVOR ALLE INHALTE DA SIND! ***</strong></p>\n\n<p><strong>*** DER KURS WIRD LAUFEND ERWEITERT -&gt; 4-8 neue Lektionen jeden Monat! Der Preis wird in Zukunft erhöht. ***</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Steig in den Kurs ein und lerne einen völlig neuen Projektmanagement-Ansatz kennen!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Dieser Kurs wird Dir hunderte Stunden Frustration ersparen, die Du normalerweise mit den alten, traditionellen Projektmanagement-Methoden hast. Insbesondere, wenn Du schon herausgefunden hast, dass PMP, PRINCE2 und IPMA Zertifizierungen nicht unbedingt helfen, Projektziele zu erreichen. Die klassischen Methoden sind nämlich oft entweder in der Praxis so nicht anwendbar, oder es wird Dir zumindest nicht verraten, wo genau der Knackpunkt liegt.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Der Schlüssel zum erfolgreichen Projektmanagement liegt nicht darin, Dutzende von Modellen und Prozessen auswendig zu lernen: Der Schlüssel ist es, Dich selbst zu organisieren und dabei mit Anderen zu kommunizieren und sie zu motivieren.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Das Konzept dieses Kurses sind praktische und bewährte Methoden, um Projekte aufzusetzen und hinterher pünktlich abzuliefern. Ich werde Dir genug von meinen \"Best Practices\" beibringen, um die meisten altgedienten Projektleiter, die Du kennst, hinter Dir zu lassen.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Ich arbeite seit fast 10 Jahren als Projektmanager und habe Dutzende von Projekten zeitgerecht - und zur Zufriedenheit aller Kunden - abgeliefert. Ich habe außerdem Dutzende von Schulungen besucht und Zertifizierungen im Projektmanagement gemacht (PRINCE2), aber auch in verwandten Disziplinen (ITIL, TOGAF).</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Mit der Zeit wurde mir immer klarer, daß die Unterschiede zwischen Theorie und Praxis teilweise unüberbrückbar groß sind. Mit anderen Worten: Im Seminar klang es noch ganz gut, hat aber dann in der Praxis keine Chance.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Dieser Kurs ist für Projektmanager/Projektleiter, Entwickler, Manager, Softwareentwickler, Teamleiter und Team-Mitglieder geeignet. Also Menschen, die Verantwortung im Projekt tragen und substantielle Erfolge in ihrer Projektarbeit erzielen wollen.</p>", 
    "end_date": null, 
    "title": "Projektmanagement: Produktivitätstricks für alle Projekte", 
    "price": "20.00", 
    "instructors": "Sebastian Glöckner", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802806_387a_2.jpg", 
    "course_url": "https://www.udemy.com/projektmanagement/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T12:14:53Z"
}