{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>It's a new economy, the possibilities are endless, it's the best moment in the history when you can become an entrepreneur and turn your ideeas to life. Moreover we can get even great business and profits out of doing so and also we can get funded for creating projects and implement ideas that impact the community, the enviroment or transform lives.</p><p><strong><em>When it comes to which project are successfull and what ideas get funded it all comes down to good project management.</em></strong></p><p><strong></strong>You can easly get your project to stand out in front of investors, banks, institutions or possible partners if you get it planned right. <strong><em>But the most important fact is that this is also the key to get your project funded.</em></strong></p><p>Why do you think there are people that wonderful and amazing ideas that don't get funded and implemented and other people who have ideas that maybe won't result in the same impact into society but get funds for implementing them? </p><p><strong><em>The answer it's putting together a good plan realized by using proven project management startegies. This is the secret and crucial factor of transforming your idea into a project that gets funded and implemented.</em></strong></p><p>Knowing how to define your project, write your objectives, identify problems, manage human resources and risk, implementing everything and evaluating the results are all phases that you have to consider and that will get your project successfull.</p><p><strong><em>If you want to know the key elements that we have looked for when writing and geting multiple projects funded in the EU by public institutions and companies than this is the right course for you.</em></strong></p><p><strong><em>So in this course you will learn:</em></strong></p><ol><li><strong><em>What to include in your plan for your next project.</em></strong></li><li><strong><em>How to define your project so you are setup for success.</em></strong></li><li><strong><em>Which are the phases in the lifecycle of a project.</em></strong></li><li><strong><em>How to use a SWOT Analysis for your project.</em></strong></li><li><strong><em>How to define your objectives for the project.</em></strong></li><li><strong><em>How to use the Gantt Diagram for organizing and planning.</em></strong></li><li><strong><em>What to consider when writing a budget.</em></strong></li><li><strong><em>How to use Brainstorming for finding better solutions.</em></strong></li><li><strong><em>Different key approaches of risk management.</em></strong></li><li><strong><em>What to avoid so that your team has success.</em></strong></li><li><strong><em>How to implement your project by puting everything planned in practice.</em></strong></li><li><strong><em>How to monitor and evaluate your project.</em></strong></li></ol><p><strong><em>and much more...</em></strong></p><p><strong><em><br></em></strong></p><p><em><strong>Other Benefits</strong></em></p><ul><li>Lifetime Access to all other updates!</li><li>Surprise Bonuses!</li><li>New Methods and Systems introduced in the course!</li><li>FULL Support through the discussion area of the course!</li><li>30 Day Money Back GUARANTEE if you feel this course didn't help you at all and you can't apply anything...that is how dedicated we are to your success!</li></ul><p><span></span></p><p><strong>Time To Take ACTION!</strong></p>So, what are you waiting for? Click the \"take this course\" button, top right now and we wil see you on the inside.<p><br></p><p><strong><strong><em></em></strong></strong></p>", 
    "end_date": null, 
    "title": "Project Management Hacking: 5 Steps to achieving your goals", 
    "price": "20.00", 
    "instructors": "Sorin Constantin, Manuela Constantin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/652424_21d2_3.jpg", 
    "course_url": "https://www.udemy.com/project-management-hacking-5-steps-to-achieving-your-goals/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-27T15:49:35Z"
}