{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>¿Te has preguntado cómo lograr el éxito de un proyecto? ¿Necesitas que los resultados de tus esfuerzos se concreten rápidamente? ¿Has sentido que haces malabares entre tantas tareas, compromisos, reuniones y tiempos de entrega de tus proyectos?</p><p>¡Acompáñanos en el curso <strong style=\"\">Resultados inmediatos = Proyectos exitosos</strong> y sorpréndete con un modo eficiente y organizado de realizar tus proyectos! Sumérgete en el fascinante mundo de la Administración de Proyectos y conoce las estrategias para dirigir tus esfuerzos hacia el logro de experiencias y proyectos exitosos.</p><p><strong style=\"\">Nuestra Oficina de Proyectos es dirigida por la Lic. Graciela Bárcenas P., quien actualmente ocupa también la Presidencia del <em style=\"\">Project Management Institute</em> Capítulo México.</strong> Con el apoyo de nuestra oficina de proyectos, hemos creado para ti este curso que presenta ágiles sesiones de video y útiles recursos que podrás descargar para que inicies la gestión exitosa de tus proyectos. </p><p>Con este curso comprenderás las responsabilidades y competencias de un Administrador de Proyectos y <strong style=\"\">contarás con guías de referencia</strong> para crear documentación crítica como el Acta de Constitución del Proyecto y el Plan para la Dirección del Proyecto. También comprenderás los retos que enfrenta todo proyecto y <strong style=\"\">contarás con recursos para el logro de proyectos exitosos</strong>, como <em style=\"\">job aids</em> para gestionar a los interesados, para un inicio de proyecto satisfactorio y para minimizar el número de cambios en tus proyectos. Dentro de las lecciones <strong style=\"\">encontrarás ejercicios para comprobar lo que has aprendido y resúmenes</strong> que podrás consultar para sintetizar las ideas más importantes.</p><p>Inscríbete ahora y estudia desde cualquier lugar y a tu propio ritmo, con un acceso ilimitado para que puedas llevar tu aprendizaje ¡al siguiente nivel!</p>", 
    "end_date": null, 
    "title": "Resultados inmediatos = proyectos exitosos", 
    "price": "20.00", 
    "instructors": "Universidad UMeL", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499014_0227.jpg", 
    "course_url": "https://www.udemy.com/resultados-inmediatos-proyectos-exitosos-umel/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T14:46:51Z"
}