{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tThis course on Risk Management is <strong style=\"\">designed to meet the requirements </strong>of project professionals and of those of you who are interested in taking the PMI Certification exams such us Risk management professional.</p>  <p style=\"\">  \t                                The focus of this course is on<strong style=\"\"> developing skills</strong> and for this reason practice materials cover at least 15 hours of exercise and work on risk management tools and techniques, risk management documents and risk response.  </p>  <p style=\"\">  \t                            This course on Risk Management for Project Professionals includes <strong style=\"\">more than 7 hours of video materials</strong> on:  </p>  <ol style=\"\">  \t<li>Project management (overview)</li>  \t<li>Project risk management</li>  \t<li>Plan risk management</li>  \t<li>Identify risks</li>  \t<li>Qualitative risk analysis</li>  \t<li>Quantitative risk analysis</li>  \t<li>Plan risk response, and</li>  \t<li>Risk Control</li>  </ol>  <p style=\"\">  \t                                                                    After each video lecture you will have a practical activity. You will receive instructions for each exercise and, if needed, templates. This is your <strong style=\"\">investment in your risk management <u style=\"\"><em style=\"\">actionable skills</em></u></strong>.  </p>  <p style=\"\">  \t                            And, After each section you will have a quiz that will <strong style=\"\">reinforce your knowledge</strong> on risk management and its tools and techniques.  </p>  <p style=\"\">  \t                              All instructional activities will earn you<strong style=\"\"> a total of 24 PDUs</strong> necessary for PMI certification and credential maintenance if you already are a certified PMI Risk Management Professional or Project Management Professional.  </p>  <p style=\"\">  \t                                                                If you are a <strong style=\"\">project professional</strong> and you want to improve your risk management skills, this course is for you. If you are an <strong style=\"\">entrepreneur, a student, a manager</strong> or, you just want to learn and develop risk management skills, this course is for you.  </p>  <p style=\"\">  \t                                                                You will learn how to manage successfully threats and opportunities in your projects.  </p>", 
    "end_date": null, 
    "title": "Risk Management for Project Professionals", 
    "price": "50.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382182_09be_7.jpg", 
    "course_url": "https://www.udemy.com/risk-management-for-project-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T14:30:51Z"
}