{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Based on extensive related hands-on practical experience, this course provides you with skills and knowledge needed for effective and efficient Project Management of safety and security operations needed to provide valuable solutions for business and IT.</p><p style=\"\">The \"Learn CISSP Safety and Security Domains for Project Managers\" course is authored by Chuck Morrison, MBA, PMP with over 25 years Program Management and Business Architecture experience in Silicon Valley California. Chuck has also authored and published other Udemy courses and Amazon eBooks.</p><p style=\"\">Information security is the protection of information and information systems from unauthorized access, use, disclosure, disruption, modification, perusal, inspection, recording or destruction. Information security, computer security and information assurance are concepts frequently used interchangeably. The concepts are interrelated and share critical information protection goals: Confidentiality, Integrity, and Availability (CIA).</p><p style=\"\">The key to business and IT security and protection is due diligence through user account management; activity tracking, monitoring, and control; access rights/permission management.</p><p style=\"\">All affected stakeholders including sponsors, subject matter experts, and other resources must be involved in collaborative development viable solution based on Safety and Security operations and processes for any executive decisions. This requires the leadership, skills, and knowledge or experienced analyst and architects capable of supporting an effective business solution needed to return business systems to proper operation.</p><p style=\"\">Critical processes emphasized during this course are collaboration, listening, analysis, and modeling techniques needed for effective and efficient system operations solutions. This course helps you develop the skills and knowledge needed to support effective solutions and decisions regardless of your role.</p><p style=\"\">If you find my course useful, please consider leaving a review and rating. Your review is much appreciated. You can go directly to the review page for this course then click and enter your review and rating.</p><p style=\"\">Thank You and Best Regards,</p><p style=\"\">Chuck Morrison, MBA, PMP</p>", 
    "end_date": null, 
    "title": "Safety and Security: Learn CISSP Domains for Project Manager", 
    "price": "25.00", 
    "instructors": "Chuck Morrison", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607408_e842_5.jpg", 
    "course_url": "https://www.udemy.com/learn-cissp-safety-and-security-domains-for-project-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T22:28:37Z"
}