{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">*** SPECIAL PRICING!  ONLY $19!!  The price of this course will go up on March 15!  Get this course now! ***</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Learn the basic concepts of scheduling ANY project to:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Finish projects on time and meet deadlines</li>  \t<li style=\"\">Identify the most critical activities you need to complete</li>  \t<li style=\"\">Make the best use of your time</li>  \t<li style=\"\">Effectively manage unforeseen delays and STILL complete you project on time</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Become More Productive and Finish Your Projects On Time</strong>  </p>  <p style=\"\">  \t        At the end of this course, you will have a strong scheduling foundation that you can use to schedule and manage any type of project (professional or personal).  Learn how to focus your time on the most critical activities in your project and impress clients and your boss with your expertise on managing projects!  </p>  <p style=\"\">  \t<strong style=\"\">  Content and Overview  </strong>  </p>  <p style=\"\">  \t        This course will provide step-by-step guidance on using the critical path method to schedule any project.  We will cover:  </p>  <ul style=\"\">  \t<li style=\"\">How to break down a project into manageable pieces</li>  \t<li style=\"\">Define activities and their relationships</li>  \t<li style=\"\">Develop a network logic diagram to describe a project</li>  \t<li style=\"\">Schedule a project using the Critical Path Method (CPM)</li>  \t<li style=\"\">How to develop a baseline schedule and manage a schedule</li>  </ul>  <p style=\"\">  \t<strong style=\"\">No Prior Scheduling Knowledge Necessary!</strong>  </p>  <p style=\"\">  \t        This course assumes you do not have any prior scheduling knowledge.  We will go step-by-step through the process.  At the end of each section there is a case study that builds on each section for you to follow.  This course also has quizzes and practice problems to make sure you understand each concept.  </p>", 
    "end_date": null, 
    "title": "Scheduling Made Easy: How Finish Any Project On Time", 
    "price": "20.00", 
    "instructors": "Peggy Yee", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426556_2cd1_3.jpg", 
    "course_url": "https://www.udemy.com/scheduling-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T03:00:21Z"
}