{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Construir uma ponte, implantar um novo software corporativo, fabricar um novo modelo de avião são tarefas complexas e abrangentes para um profissional que vem sendo muito valorizado nos últimos anos: o gerente de projetos. É dele a responsabilidade de garantir que tudo será entregue no prazo prometido, dentro do orçamento previsto, utilizando os recursos certos e com o mínimo de risco possível.<br></p>\n\n<p>E com a crescente concorrência no mercado, não basta apenas ser um bom gerente de projetos. A certificação (PMP<sup>®</sup>) do PMI<sup>®</sup> se tornou um pré-requisito caso você queira evoluir em sua carreira.</p>\n\n<p><strong>Nossos diferenciais são:</strong><br></p>\n\n<ul><li>O curso foi estruturado para que você aprenda todos os processos do Guia PMBOK<sup>®</sup> na <strong>verdadeira ordem que um projeto é construído</strong>, ou seja, partiremos da Iniciação, passaremos pelo Planejamento, Execução, Monitoramento e controle e por fim abordaremos o Encerramento. Essa é, na nossa opinião, a melhor forma de se abordar os processos de gerenciamento de projetos, pois segue um encadeamento, coerente, lógico e estruturado de aprendizagem.</li><li>Teremos <strong>mais de 150</strong> <strong>vídeo-aulas</strong> que versam em sua totalidade sobre os tópicos do exame de certificação</li><li>Serão disponibilizadas <strong>mais de 500 páginas de material de estudo</strong>, distribuídas em apostilas <strong>detalhadas </strong>que cobrem todos os itens para a sua preparação. <em><strong>Obs: NÃO são \"prints\" de slides</strong></em>...nosso material foi desenvolvido para ser sua principal referência  de estudo juntamente com o Guia PMBOK<sup>®</sup>.</li><li>Estarão disponíveis também <strong>planos de estudos</strong> elaborados especialmente para ajudá-lo a seguir pelo caminho da certificação de maneira mais tranquila.</li><li>Teremos <strong>mais de 600 questões simuladas</strong> para que você possa estar totalmente preparado para o exame.</li><li>Tendo concluído o curso com sucesso você receberá o certificado com a comprovação das <strong>35 PDU’s</strong> exigidas para o\nexame de certificação.</li></ul>\n\n<p><strong>Mais algumas ótimas razões para estudar conosco na Udemy:</strong><br></p>\n\n<ul><li>Você terá acesso vitalício ao curso, embora seja recomendável que você o termine antes disso...</li><li>Você não perderá aquele capítulo especial da novela ou daquela série fantástica, já  que poderá estudar a hora que quiser...</li><li>Você não precisará enlouquecer ou “criar” vagas para estacionar o seu carro...</li><li>Você não precisará se entupir de salgados ou refrigerantes na lanchonete da escola...</li><li>Você poderá assistir às aulas de pijama (ou até sem...)...</li><li>Você não se afundará em dívidas astronômicas para se matricular no curso...</li><li>E se, além disso, chegar à conclusão de que não gostou do curso, seu investimento será devolvido sem complicações.</li></ul>", 
    "end_date": null, 
    "title": "Seja PMP®: Curso preparatório completo para certificação", 
    "price": "20.00", 
    "instructors": "Pilar Sanchez Albaladejo, PMP, CSM, CST, MSc, MBA", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607226_c22e_2.jpg", 
    "course_url": "https://www.udemy.com/seja-pmp-curso-preparatorio-completo-para-certificacao/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T19:17:25Z"
}