{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Are you interested in software project management ? Do not waste your time and money ! Enroll in the most COMPLETE sofware project management training! </strong></p><ul style=\"\"><li style=\"\"><strong style=\"\">Remember 30 Days of MONEY BACK is guaranteed if you will not be satisfied</strong></li><li style=\"\"><strong style=\"\">You will have LIFE TIME ACCESS for this course. </strong></li></ul><p style=\"\">Have you ever wondered how it is like to work as a sofware project manager in a large enterprise ? <strong style=\"\">Do you want to become an outstanding software project manager in IT industry ?</strong>With this course you will learn how software project management is done step by step in <strong style=\"\">a large bank, telecom operator, tecnhology giant company or any company of your dreams </strong> with real world examples !</p><p style=\"\"><strong style=\"\">Learn and Master the Software Project Management For Large Enterprise Practically</strong></p><ol style=\"\"><li style=\"\">You will consolidate theoratical software project management knowledge with practical applications</li><li style=\"\">You will learn characteristics of large enterprises and where the IT function corresponds in the organization.</li><li style=\"\">You will understand the importance of software for large companies with a strategic perspective</li><li style=\"\">You will gain technical and behavioral competencies about software project management</li><li style=\"\">You will learn advantages and disadvantages of different software project management methodologies and learn to choose the most appropriate one regarding the organization and the project type</li><li style=\"\">You will learn to manage a software project step by step</li><li style=\"\">You will understand the tricky situations, pitfalls, do&#039;s and don&#039;t from software project initiation to software project closure</li></ol><p style=\"\">As a result of the Technology age, IT investments made by large enterprises are increasing with tremendeous momentum. Nowadays software is not a support function but the most powerful weapon which determines the business strategies and brings success in business world. </p><p style=\"\"><strong style=\"\">By enrolling this course, you will be able to :</strong></p><ul style=\"\"><li style=\"\">Learn software project management for Large Enterprise</li><li style=\"\">Take a big step for you career to work in a Large Enterprise!</li><li style=\"\">Gain the soft skills and technical skills for software project management</li><li style=\"\">Learn pitfalls and do&#039;s and don&#039;ts for each phase of software project management!</li><li style=\"\">Practice with more than 100 questions!</li><li style=\"\">Get downloadable handouts for each session</li><li style=\"\">Get support from the instructor within 24 hours!</li><li style=\"\">Benefit from the harmonization of theory and real life experience</li><li style=\"\">Learn different software project management methodologies</li><li style=\"\">Earn 3 PDUs to maintain your PMP certificate if you have already one!</li></ul><p style=\"\"><strong style=\"\">At this point, do you want to take a big step in your career and become a software project manager who makes a difference ? </strong>This is why I am here to help you achieve this purpose. Unlike other courses I will share real experiences in an enjoyable way just like a pill. At the end of this course you will feel like you have worked in a large enterprise as a software project manager and find a lot of answers of questions in mind.</p>", 
    "end_date": null, 
    "title": "Software Project Management For Large Enterprise", 
    "price": "20.00", 
    "instructors": "Mustafa Karaoz", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420680_c8c6_4.jpg", 
    "course_url": "https://www.udemy.com/software-project-management-for-large-enterprise/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T23:42:18Z"
}