{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>We live in a project-based world. Chances are, you go from project to project at work. Project management is a high-demand skill. Companies are more and more managed by projects and require PMI certifications. It is more and more essential to <strong style=\"\">learn how to succeed on projects</strong>.</p><p>Have you ever wondered if it is possible to succeed with every single project? Why are some projects successful and others - not? How come, some project managers deliver results consistently and others - only occasionally? Is there <strong style=\"\">a secret formula</strong> that can <strong style=\"\">help you succeed</strong>?</p><p>By taking <strong style=\"\">this Strategic Project Management </strong>course you will learn some <strong style=\"\">powerful ideas</strong> that you can try at work in order to significantly increase your chances of success with any project that you and your company undertakes.</p><p>This course will help you understand <strong style=\"\">your project environment</strong>. It will give you tips about how to <strong style=\"\">take the maximum advantage</strong> of any environment.</p><p>This course is a <strong style=\"\">strategic-thinking course</strong>. It is designed to help you develop your <strong style=\"\">independent strategic thinking</strong>. You will learn both age-old and modern principles of strategic thinking and strategic behavior.</p><p>After you take and complete this course, you will have a better understanding of Agile project management and how to apply the principles behind Agile manifesto to any types of projects.</p><p>By the end of the course, you will be able to <strong style=\"\">practice strategic project management</strong> concepts at work and will achieve clarity about what it means to manage strategically. Hopefully, you will also feel that you are more and more strategic in your behavior as a person and as a leader.</p>", 
    "end_date": null, 
    "title": "Strategic Project Management - Be Agile on Every Project", 
    "price": "50.00", 
    "instructors": "Igor Ovchinnikov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292614_9b42_4.jpg", 
    "course_url": "https://www.udemy.com/strategic-project-management-agile/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T19:32:53Z"
}