{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>I have spent hours and hours putting this course together for you in <br>hopes that it assists you on your path to becoming a Project Management <br>Professional or PMP for short.  The PMP certification exam is an <br>extremely difficult exam that requires preparation - how much <br>preparation depends on your prior knowledge and test taking skills.  <br>This course focuses on the latter - test taking skills.  Here I present <br>you some exams based on the ten knowledge areas of the 5th edition of <br>the Project Management Body of Knowledge or PMBoK by the Project <br>Management Institute (also the administrators of the PMP exam).  With <br>each exam, I introduce the topic to you as well as debriefing every <br>single question.  Over the ten years I have been instructing PMP <br>certification courses, I have discovered that many of my students are <br>very good at taking tests, while others struggle.  And since taking an <br>exam is required in order to become a project management professional, I<br> felt that there are a lot of people out there that could benefit from <br>my advice and the content I have curated over the years.  The exams I <br>authored and have chosen to use in this course come from a large <br>collection of exam questions I have written, used, edited, amended, <br>updated, and discussed in my PMP preparation courses throughout the <br>years.  I tried to pick out a few of my favorites, a few that I know <br>that some past students have struggled with, and others simply to round <br>out a topic.  I avoided the easy questions or the ones relying on strict<br> memorization of PMI terms and concepts.  Instead, I felt that you would<br> benefit more from those PMP styled questions that really make you think<br> or at least present the content in a more contextual setting, story, or<br> situation.  From time to time, I do throw a generic question meant to <br>test your knowledge on a term or concept, but for most of the questions I<br> pulled out ones that requires you to consider some of the concepts a <br>little deeper and/or see how you might face the concept in a somewhat <br>realistic scenario.  Obviously, these situations I have to create for <br>you in only a few sentences, while still giving you enough information <br>to adequately answer the questions without giving away too much or <br>having you know non-PMP specific content (e.g. knowledge from a certain <br>industry or project</p>", 
    "end_date": null, 
    "title": "Success! Project Management Professional PMP Exam Questions", 
    "price": "30.00", 
    "instructors": "Neal Rowland", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814706_de14_3.jpg", 
    "course_url": "https://www.udemy.com/pmpanswers/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T17:36:06Z"
}