{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  All project failures can be traced back to when they started. If you miss something vital, are unsure or underestimate what needs to be done, then your project is certain to run into difficulties.  </p>  <p style=\"\">  \t      If you take this course from beginning to end, then you will understand what needs to happen at the beginning of a project and avoid major disasters later on.  </p>  <p style=\"\">  \t      This course is an absolute must for anyone working on a web project. The small investment in taking this course, could avoid making very expensive mistakes.  </p>  <p style=\"\">  \t      With 25 years of project experience and working with companies from startups to global corporations, this course is built based on what actually works in the field.  </p>  <p style=\"\">  \t      The advice given is not overly prescriptive. Instead, it provides options so you can decide which techniques and tools fit best with your environment and the way that you work. No prior knowledge is needed; we&#039;ll explain the background and what to do, step by step.  </p>  <p style=\"\">The Definitive Guide to Web Project Requirements Gathering has been adopted and is endorsed by Cambridge University Press. The course was adopted before embarking on a significant digital project. Chris Fell, the Publishing Director has this to say about the course. </p><p style=\"\"><strong style=\"\">&quot;The Definitive Guide to Web Project Requirements Gathering&quot; highlights many of the issues, best practices and pitfalls that can be encountered in a digital development. We have found it a very helpful introduction for business users.&quot; </strong><br style=\"\"></p><p style=\"\">  \t      Enrol in this course now.</p><p style=\"\">*  We&#039;ll teach you how to spend time &amp; money only working on the most important things.</p><p style=\"\"><span style=\"\"></span>*  Learn where to look for requirements and who you need to speak to</p><p style=\"\"><span style=\"\"></span>*  Learn how to run the requirements discovery process</p><p style=\"\"><span style=\"\"></span>*  Understand how the process varies when using different project approaches</p><p style=\"\"><span style=\"\"></span>*  Get inspired by understanding the benefits of using collaboration techniques.</p>    <p style=\"\">  \t      If there is one most significant factor that differentiates a successful project from an unsuccessful one - it is the quality of the requirements that matters. And industry research backs up this claim. Lessons from this course can help prevent expensive project mistakes.  </p>  <p style=\"\">  \t                                         This might just be the essential course that you never knew you needed. Who knows, if you acquire these skills you may even find yourself a new job or be able to offer a valuable new service to your company or for new and existing clients.  </p>  <p style=\"\">  \t                                                                  Ian will be happy to answer any questions you have when taking this course.  </p>  <p style=\"\">  \t                                         Please be aware that the course looks best viewed in HD.  </p>", 
    "end_date": null, 
    "title": "The Definitive Guide to Web Project Requirements Gathering", 
    "price": "25.00", 
    "instructors": "Ian Sharp", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/108600_54b5_13.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-a-web-project-the-right-way/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-21T10:33:01Z"
}