{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>THIS IS A UDEMY FEATURED COURSE!<br><br>This course has been designed using a visually-rich format so you can learn the PMBOK 5 the way your brain actually works. not with a boring, lecture heavy approach that puts you to sleep!<br></em></strong></p><p><strong><em><em><em></em></em></em></strong></p>\n\n\n\n\n\n<p><strong><em><em><em><strong></strong></em></em></em></strong><strong><em>STOP WASTING YOUR MONEY AND TIME! </em></strong>Other PMP courses charge BIG $ and give you a boring presentation full of bullet points, or an unprofessional video of someone recording themselves with their webcam. We are confident that you will enjoy and learn from this course and we<strong> </strong>stand behind our 30 day <strong><em>NO-HASSLE, MONEY BACK GUARANTEE!</em></strong><em><strong></strong></em></p>\n\n\n\n\n\n<p><strong><em>YOU DON'T NEED TO SPEND HUNDREDS OF DOLLARS TO EARN 35 CONTACT HOURS and PDU's! </em></strong>In this course, we'll show you how to<strong> <em>GET THEM FOR FREE</em></strong><strong><em>! </em></strong>If other courses are not giving you this information, then<strong><em> they are ripping you off.</em></strong></p>\n\n\n\n\n\n<p>Have you taken a PMP course and found the instructor hard to understand? Unlike those other PMP courses, <strong><em>this course has been created and is instructed BY A  PMI CERTIFIED PMP and native English Speaker. </em></strong>Unlike those other PMP courses,<strong><em>This course is updated EVERY WEEK with new content to maximize your user experience! </em></strong></p>\n\n\n\n\n\n<p><strong><em>Don't be fooled by those other courses with all those \"fake\" reviews!</em></strong>  </p>\n\n\n\n\n\n<p>  \t<strong><em>These are 5 Star reviews from REAL people:</em></strong>  </p>\n\n\n\n\n\n<p>  \t<strong><em>\"</em></strong><em>Well paced, informative and affordable...\" -JT</em>  </p>\n\n\n\n\n\n<p>  \t<em>\"</em><em>Concise, clear and complete...\" -DT</em>  </p>\n\n\n\n\n\n<p>  \t<em>\"Excellent explanation of the PMBOK5...\" -PB</em>  </p>\n\n\n\n\n\n<p>  \t<em>\"Excellent support from the course creator...\" -YC</em>  </p>\n\n\n\n\n\n<p>  \t<em>\"Fun to watch, easy to follow...\" -MW</em>  </p>\n\n\n\n\n\n<p>  \t<em>\" Interesante e informativo...\"  -MA</em>  </p>\n\n\n\n\n\n<p>  \t<em>\"Clearly explained with visual aids - excellent course!\" -JH</em>  </p>\n\n\n\n\n\n<p>  \t<em>\"Great course! highly recommended...\" -TMP</em>  </p>\n\n\n\n\n\n<p>We strive to make this the most comprehensive Project Management course on Udemy. Unlike other courses, <em>THIS COURSE IS UPDATED DAILY WITH NEW LEARNING MATERIAL! </em>The PMBOK-5 can be confusing, but this VIDEO GUIDE TO THE PMBOK 5  will help you understand the concepts, theories, formulas and terminology YOU MUST KNOW to pass the PMP Exam on your first attempt!</p>\n\n\n\n\n\n<p>  \t<strong><em>We are available 24/7 to answer questions and are here to help you pass the PMP Exam on your first attempt.</em></strong></p>\n\n\n\n\n\n<p>  \t                                                   <strong><em>\"The Common-Sense Approach to Learning PMP Project Management\"</em></strong> covers every process, knowledge area and all the ITTO's in the PMBOK-5. It's a comprehensive look at project management done the way the professionals do it. It's been designed as a common-sense approach for anyone who wants to learn how to:</p>\n\n\n\n\n\n<p>  \t                                                   -Learn proper and professional \"Waterfall Methodology\" Project Management  </p>\n\n\n\n\n\n<p>  \t                                                   -Manage costs, time, risks and resources  </p>\n\n\n\n\n\n<p>  \t                                                   -Manage teams and individuals  </p>\n\n\n\n\n\n<p>  \t                                                   -Achieve personal and professional goals  </p>\n\n\n\n\n\n<p>  \t                                                   -Complete successful projects  </p>\n\n\n\n\n\n<p>  \t                                                   This course can also help you:  </p>\n\n\n\n\n\n<p>  \t                                                   -Pass the PMP or CAPM exams and become a Certified Project Manager. If you hope to pass either of these exams, <em>YOU MUST KNOW AND UNDERSTAND THE PMBOK GUIDE! <strong>There are no shortcuts!</strong></em>    </p>\n\n\n\n\n\n<p>  \t                                                   If you are a PMP Certified Project Management Professional, this course can update your skills and knowledge-base with the new concepts and processes presented in the new 5th Edition of the PMBOK GUIDE.  </p>\n\n\n\n\n\n<p>  \t                                                   From baking a cake to building a skyscraper, life is full of projects. Even life is like a project! The simplest task can become a big problem if not properly planned and executed.  </p>\n\n\n\n\n\n<p>  \t                                                   Every day you start projects. They can be as simple as making a list when you go to a grocery store or planning and executing large-scale strategies to guide a business towards success.  </p>\n\n\n\n\n\n<p>  \t                                                   All of the most successful people and professionals use Project Management in one way or another during their professional careers and while working towards their personal goals.</p>\n\n\n\n\n\n<p>  \t                                                   This course is an upbeat and fun approach to learning Project Management, but don't let that fool you, this course presents all the things you will need to know in order to manage large and small projects like a professional!<br> </p><p><strong><em>***WARNING***<br>Beware of other courses that offer 10 or more PDU's/Contact Hours for free, but only offer 1 hour of content! This is a PMI Code of ethics violation! According to PMI, 1 hour of instruction is equal to 1 PDU. Enroll in them at your own risk!</em></strong></p><strong>\n\n</strong><p><strong></strong><strong><em>-DON'T BE FOOLED by the FAKE reviews on those other courses!</em></strong></p>\n\n<p><strong><em>- THIS IS AN ORIGINAL UDEMY FEATURED COURSE!</em></strong><br><strong><em>- THIS COURSE COVERS THE COMPLETE PMBOK-5</em></strong></p>\n\n\n\n\n\n<p><strong>THE PMP® CERTIFICATION TRACK</strong></p>\n\n\n\n\n\n<p>  \t<strong>    What is a PMP?  </strong>  </p>\n\n\n\n\n\n<p>  \t                                                   Project Management Professional (PMP®) is a credential offered by the Project Management Institute (PMI®). It is globally recognized and currently there are 500,000+ active PMP certified individuals and 270 PMI chartered local chapters in 193 countries.  </p>\n\n\n\n\n\n<p>  \t                                                   The PMP certification establishes a common terminology and framework among project managers. In order to earn the PMP credential, you must demonstrate your knowledge of the terminology, processes, tools and techniques as described within the Project Management Body of Knowledge (PMBOK®) framework.  </p>\n\n\n\n\n\n<p>  \t<strong>    Why should I get certified?  </strong>  </p>\n\n\n\n\n\n<p>  \t                                                   The PMP Certification is the most well-known and sought-after certification in both business and industry today. Project Management is a growing profession and the salaries for those who hold the certification continues to grow at a considerable rate.  </p>\n\n\n\n\n\n<p>  \t                                                   According to the 7th Edition of PMI's Project Management Salary Survey, which polled over 30,000 Project Managers from 29 countries, the median salary for a Project Management Professional is $92,000.  </p>\n\n\n\n\n\n<p>  \t                                                   In order to lead you in passing the PMP examination, this comprehensive course will explain in-depth:  </p>\n\n\n\n\n\n<p>  \t                                                   -The Project Lifecycle  </p>\n\n\n\n\n\n<p>  \t                                                   -The 5 Process Groups  </p>\n\n\n\n\n\n<p>  \t                                                   -The 10 Knowledge Areas  </p>\n\n\n\n\n\n<p>  \t                                                   -The 47 Processes  </p>\n\n\n\n\n\n<p>  \t                                                   -The 620 Inputs, Outputs, Tools and Techniques (ITTOs)  </p>\n\n\n\n\n\n<p>  \t                                                   -The Concepts and Formulas  </p>\n\n\n\n\n\n<p>  \t                                                   As described in the Guide to the Project Management Body of Knowledge 5th Edition (PMBOK-5)  </p>\n\n\n\n\n\n<p>  \t                                                   This course also has an Affinity Diagram Project that you can complete simultaneously as you progress through the course. The Affinity Diagram is a business tool used to organize ideas and data, and is one of the Seven Management and Planning Tools.  </p>\n\n\n\n\n\n<p>  \t                                                   This is a tool which is commonly used within project management. It allows large numbers of ideas to be sorted into groups for review and analysis, based on their natural relationships.  </p>\n\n\n\n\n\n<p>  \t<strong>    What is in the PMP exam?  </strong>  </p>\n\n\n\n\n\n<p>  \t                                                   The PMP exam consists of 200 multiple choice questions written against the PMBOK specifications. The test-taker is only graded on their proficiency on 175 of the questions.  </p>\n\n\n\n\n\n<p>  \t                                                   Twenty-five of the questions are 'sample' questions and are placed randomly throughout the exam. These sample questions are used to fine-tune the degree of difficulty and precision of the exam. They are not counted for-or-against the test-taker.  </p>\n\n\n\n\n\n<p>  \t                                                   Many of the questions are situational, meaning you will be asked how you would respond and/or what Input, Tool &amp; Technique and Output you would use, given a certain project management scenario.  </p>\n\n\n\n\n\n<p>  \t                                                   Each exam is unique; the test is computer generated and each individual test is populated from a database of over a thousand questions.  </p>\n\n\n\n\n\n<p>  \t                                                   Because of this, YOU MUST have a thorough understanding of the PMBOK 5. Simply reading online material and taking commercially available tests will hardly help you in attaining the PMP credential.  </p>\n\n\n\n\n\n<p>  \t                                                   This course was created as a COMPANION to the PMBOK 5. It is designed so as you progress through the course, so will you progress through every chapter in the Project Management Body of Knowledge.  </p>\n\n\n\n\n\n<p>  \t                                                   Think of it as your “Video guide through the PMBOK 5\"  </p>\n\n\n\n\n\n<p>  \t                                                   In this course, all 5 Processes Groups, 10 Knowledge Areas and 620 ITTO items (Inputs, Tools and Techniques, Outputs) are explained in simple-to-understand terms. In addition, this course is updated with glossary terms, questions, concepts and formulas from the PMBOK 5 every day in the discussion and announcement areas within the course module.  </p>\n\n\n\n\n\n<p>  \t                                                   According to PMI, there are 5 Domains in the PMP exam framework. The percentage of each identifies the proportion a question from that domain should appear in exam:  </p>\n\n\n\n\n\n<p>  \t                                                   1. Initiating the Project: 13%  </p>\n\n\n\n\n\n<p>  \t                                                   2. Planning the Project: 24%  </p>\n\n\n\n\n\n<p>  \t                                                   3. Executing the Project: 31%  </p>\n\n\n\n\n\n<p>  \t                                                   4. Monitoring and Controlling the Project: 25%  </p>\n\n\n\n\n\n<p>  \t                                                   5. Closing the Project: 7%  </p>\n\n\n\n\n\n<p>  \t                                                   This course comprehensively covers each of the domains according to the PMBOK 5. Armed with this information, it is up to you to decide how much time you want invest in learning each domain.  </p>\n\n\n\n\n\n<p>  \t<strong>    How do I register for the PMP Exam? </strong>  </p>\n\n\n\n\n\n<p>  \t                                                   In order to apply for the PMP examination you must meet certain education and experience eligibility requirements. For complete details regarding the PMP eligibility requirements, please view the PMP Handbook from PMI.  </p>\n\n\n\n\n\n<p>  \t                                                   If you find you do not meet the PMP eligibility requirements, you may consider the Certified Associate in Project Management (CAPM) certification which can be a ladder-step towards the PMP Credential.  </p>\n\n\n\n\n\n<p>  \t                                                   To apply for the exam, you must register and log into PMI's Online System to get started. Within this system, a printable application form is also available.  </p>\n\n\n\n\n\n<p>  \t<strong>    How long does a PMP certification last?  </strong>  </p>\n\n\n\n\n\n<p>  \t                                                   As part of PMI's Continuing Certification Requirements program, a PMP credential holder will need to earn 60 Personal Development Units (PDUs) during every three-year cycle.  </p>\n\n\n\n\n\n<p>  \t                                                   Fortunately, PDUs can be earned in many ways, including E-learning, attending chapter meetings and seminars and SELF-DIRECTED LEARNING.  </p>\n\n\n\n\n\n<p>  \t                                                   This course may also be submitted for PDUs once you have earned the PMP credential.  </p>\n\n\n\n\n\n<p>  \t                                                   PMI will recognize activities that involve personally conducted research or study, including discussions and coaching sessions with colleagues or clients. Such activities should make use of informational materials like articles, books, and videos like the ones in this course. Within this course, we offer daily discussions that you may choose to join.  </p>\n\n\n\n\n\n<p>  \t                                                   To learn more about PDUs, how to earn and claim them as well as step-by-step instructions on how to renew your certification, you can reference the PMP handbook found at the PMI .org website.  </p>\n\n\n\n\n\n<p>  \t                                                   PMBOK® PMP® CAPM® and PMI® are Registered Trademarks of the Project Management Institute.  </p>", 
    "end_date": null, 
    "title": "The Common Sense Approach to Learning PMP Project Management", 
    "price": "20.00", 
    "instructors": "Marcos Garcia, PMP", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121890_6402_21.jpg", 
    "course_url": "https://www.udemy.com/commonsensepm/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-19T05:16:56Z"
}