{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">The entire Top Project Management series is focused specifically on <strong style=\"\">the business side </strong>Project Management. </p><p style=\"\">There are many resources that can help you study for your certification exams, or hone your technique and project management skills. There is very little guidance available for how to turn those skills into dollars. </p><p style=\"\">New and developing project managers are left to figure out for themselves how to build a sustainable career. Very few organizations have dedicated Project Management career tracks. In most cases, the best most PM&#039;s can hope for is a new assignment.</p><p style=\"\"><strong style=\"\">If you:</strong><br style=\"\"></p><ul style=\"\"><li>- Are making less than you are worth as a PM</li> <li>- Making less than your peers</li> <li>- Currently negotiating your salary or bill rate </li> <li>- Know that you are at risk of being out of work</li> <li>- Are currently between projects</li></ul><p style=\"\">The <strong style=\"\">you need to understand your value</strong> in the market place and how to compare yourself to your peers when competing for an open position.</p><p style=\"\">Negotiating your best deal starts with understanding and <strong style=\"\">maximizing your market value</strong>.<br style=\"\"></p><p style=\"\">The Top Project Management series of courses and lectures is designed to fill that gap. This first module is the foundation and an important baseline in understanding the value that we bring to the market and how to position this value for your best financial compensation. </p><p style=\"\">This course is taught by a highly sought after consultant, who has managing high profile and critical projects for some of the largest corporations in the world.  Mark Malone brings over 20 years of experience in the consulting business to this course.</p><p style=\"\">Mark has been billing top dollar as a consultant for many years and his background in staffing and consulting gives him a unique perspective on high value consultants.<br style=\"\"></p><p style=\"\">This is a risk free investment for you, if you are unsatisfied you are protected by a 30 day guarantee.</p>", 
    "end_date": null, 
    "title": "Top Project Manager Module1: Increasing Your Billable Value ", 
    "price": "30.00", 
    "instructors": "Mark Malone", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469456_65b4_4.jpg", 
    "course_url": "https://www.udemy.com/top-project-manager-module1-increasing-your-billable-value/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T00:28:34Z"
}