{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <span class=\"txt0\" style=\"\">This course in Translation Project Management (TPM) is designed to train you to become a project manager and/or operations manager with a translation agency, multinational company, or to work as a freelance consultant.</span>  </p>  <p style=\"\">  \t <span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\">It is an intensive, short course created to provide professional development in managing multilingual translation projects. You are free to work at your own pace so completion time depends on you.</span></span>  </p>  <p style=\"\">  \t <span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\">Anyone with keen multi-cultural interests and/or some language skills can benefit from this course in pursuit of employment as a project manager in the translation industry. Although a knowledge of foreign languages, or of a particular language set, is not a pre-condition in applying for project management roles within the industry, the course appeals to persons with language skills and students enrolled in language courses, translation studies, or linguistics. </span></span></span><a href=\"http://www.uk-weblink.com/udemy/u_testimonials.html\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Testimonials</a>  </p>  <p style=\"\">  \t<span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\">You will be working on projects in a step-by-step approach; the information you need in order to perform as a translation project manager is contained in the Knowledge Base with forms an integral part of the course; and you will be able  to measure your progress through quizzes and other tests, with feedback on your outcomes.</span></span></span>  </p>  <p style=\"\">  \t <span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\">There is no doubt that the translation market is facing a dramatic increase as the figures demonstrate: In 2012 the projections from the “Language Services Market 2012″ report states the industry will reach US $33.5 billion shared by over 26,104 suppliers of translation and interpreting services across the globe; Microsoft alone executes over 1,000 localization projects a year. it is certainly true that project management has lately gained a name in the translation profession due, mainly, to market growth and virtual teams. When translation is subcontracted to teams communicating through the Internet, productivity becomes the focus and it is in the area of planning, tracking, and measuring for volume and quality where project management offers essential tools for translation providers.</span></span></span>  </p>  <p style=\"\">  \t <span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\"><span class=\"txt0\" style=\"\"></span></span></span>  </p>", 
    "end_date": null, 
    "title": "Translation Project Management", 
    "price": "20.00", 
    "instructors": "Mr Daniel Marion", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/161258_280c_11.jpg", 
    "course_url": "https://www.udemy.com/translation-project-management/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-10T15:43:04Z"
}