{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This basic course will cover everything you need to know so you can start and work with Trello and boost your productivity.</strong></p><p>Student review:<br></p><p><strong>***** \"Terrific Tips on Trello. I have to admit I've had this project management app for a few months now and never really understood the full functionality. I can't think of any other questions I would have after this thorough course. Great, quick, succinct.”</strong> - Naketa Thigpe, Student review</p><p><strong>***** \"A Great Way To Get Up And Running Quickly With Trello. I've looked at Trello a few times over the past year, but never really had the time to spend to get to grips with it. This course, is just the right length and has enabled me to finally start using Trello and working more efficiently.”</strong> - Chris O'Connor, Student review</p>  <p style=\"\">  \t        If you were looking for a solution to help you manage and speed up the progress of your projects, or you're running several projects with people based in different locations and you want to be able to keep tab of everything going on, or you just want to increase the productivity of your business - you've reached the right place.  </p>  <p style=\"\">  \t        If you ever worked as part of a Team, you know that collaboration and synchronisation are the key factors for the activity to be a success or a total failure!  </p>  <p style=\"\">  \t        Everyone needs to know what everyone else is doing, when each action starts and stops. and sometimes the activity looks so complex that you don't even see the whole picture and can really get confused.  </p>  <p style=\"\">  \t<strong>Meet Trello! </strong>  </p>  <p style=\"\">  \t<strong>Trello is a web based Free application that can boost your output dramatically. companies like Adobe, Tumblr, Trip Advisor and the New York Times are using Trello to manage their projects. </strong>  </p>  <p style=\"\">  \t        Trello is an amazing application, that improves your personal productivity.  </p>  <p style=\"\">  \t<strong>Use it to manage and track your own tasks or use it with your team to improve collaboration. </strong>  </p>  <p style=\"\">  \t        With Trello you can build your projects, assign tasks to different users, assign each task a due date, build checklists, transfer files, interact with your team regarding the tasks and be informed of everything that's going on, and do all that while your team members aren't even in the same continent!  </p>  <p style=\"\">  \t<strong>In this course I'm going to show you everything you need to know to get up and running with Trello.</strong> in just a little over an hour you'll be able to set up your account, build your projects, assign tasks and be able to manage an effective team, increase your productivity and as a direct result you will have more time to start a new project, or maybe ,just maybe, a little bit more R&amp;R (Rest and Relaxation) time.  </p>  <p style=\"\">  \t<strong>If you are ready to learn how to use Trello to make your project more efficient, less time consuming and have more free time - this course is for you.</strong>  </p>  <p style=\"\">  \tI'll see you there!  </p>", 
    "end_date": null, 
    "title": "Trello Project Management: Complete Course", 
    "price": "20.00", 
    "instructors": "Uri Soglowek", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280012_1f82_3.jpg", 
    "course_url": "https://www.udemy.com/effective-project-management-with-trello/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T08:36:56Z"
}