{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   The BIG DIFFERENTATION to this Cartoon Format is; its catered for Delegates and Students that love Concepts, Big Picture and Fun. It is bite-sized and easy to consume. The content is simplified and focused. I recommend you to pair this Cartoon format with the other for fine details.  </p>  <p>  \t   The Ultimate Skills (TUSK) Program are main skills and competencies required for the current workforce and leaders to excel in modern jobs and organizations. It has been developed based on creative and intelligent understanding of the organization challenges and its aspirations to become adaptive to change in the &quot;new normal&quot; environment. The four main skills are: Project Management Skills, Consulting Skills, Selling Skills and Leadership Skills.  </p>  <p>  \t     Here is one of the TUSK Program: WINNING PROJECT MANAGEMENT  </p>  <p>  \t     Winning Project Management program has only one goal; to give you the know-how to get your project launched (take-off) and sustaining it. A lot of project failed because they failed to launch; sadly everything is wasted. :( You will learn the winning Project Management Framework here.  </p>  <p>  \t       Our focus is by taking a hard look at the Project Manager himself/herself. The target groups are Business and Community Leaders, Young Executives (The Millennials) and Students. This group represents the large-base of aspiring and growing project managers who run little projects that make big impact to societies; e.g. outreach and engagement programs, corporate responsibility (CR) events, product launches, budget and new business pitch, concerts and contests, internship, lifelong learning and so on.  </p>  <p>  \t       My commitment as follows:  </p>  <p>  \t       a) Live Session (minimum 10 delegates or when necessary)  </p>  <p>  \t       b) Email reply within 48 hours  </p>  <p>  \t       c) Project Management Coaching  </p>  <p>  \t       d) All Access and Downloadable Guides and Templates  </p>  <p>  \t       e) Additional Contextual Contents and Materials (Lifetime)  </p>  <p>  \t       f) Personal Effectiveness Mastery  </p>  <p>  \t       g) Digital Certificate of Accomplishment will be awarded upon completion  </p>  <p>  \t       Methods used are Accelerated Learning and Hands-On Training. I have prepared the narrative lecture which some of you have enrolled titled &quot;TUSK - PROJECT MANAGEMENT FOR LEADERS, EXECUTIVES AND STUDENTS&quot;  </p>  <p>  \t       Well, I hope you&#039;ll sign up this program and learn the key concepts in Project Management.  </p>  <p>  \t       Cheerz!  </p>", 
    "end_date": null, 
    "title": "TUSK - Animated Project Management Framework for Executives", 
    "price": "50.00", 
    "instructors": "Khairul Anwar Kamarudin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/91096_05d0_8.jpg", 
    "course_url": "https://www.udemy.com/tusk-comprehensive-project-managementexecutives-students/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-11T16:28:09Z"
}