{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t          The Ultimate Skills (TUSK) Program are main skills and competencies required for the current workforce and leaders to excel in modern jobs and organizations. It has been developed based on creative and intelligent understanding of the organization challenges and its aspirations to become adaptive to change in the &quot;new normal&quot; environment. The four main skills are: Project Management Skills, Consulting Skills, Selling Skills and Leadership Skills.  </p>  <p style=\"\">  \t        Here is one of the TUSK Program: WINNING PROJECT MANAGEMENT FRAMEWORK  </p>  <p style=\"\">  \t    Winning Project Management Framework program has only one goal; to give you the know-how to get your project launched (take-off) and sustaining it. A lot of project failed because they failed to launch; sadly everything is wasted. :( You will learn the winning Project Management Framework here.  </p>  <p style=\"\">  \t          Our focus is by taking a hard look at the Project Manager himself/herself. The target groups are Business and Community Leaders, Young Executives (The Millennials) and Students. This group represents the large-base of aspiring and growing project managers who run little projects that make big impact to societies; e.g. outreach and engagement programs, corporate responsibility (CR) events, product launches, budget and new business pitch, concerts and contests, internship, lifelong learning and so on.  </p>  <p style=\"\">  \t          My commitment as follows:  </p>  <p style=\"\">  \t          a) Live Session (with minimum 10 delegates or when necessary)  </p>  <p style=\"\">  \t          b) Email reply within 48 hours  </p>  <p style=\"\">  \t          c) Project Management Coaching/Advisory  </p>  <p style=\"\">  \t          d) All Access and Downloadable Guides and Templates  </p>  <p style=\"\">  \t          e) Additional Contextual Contents and Materials (Lifetime)  </p>  <p style=\"\">  \t          f) Personal Effectiveness Mastery  </p>  <p style=\"\">  \t          g) Digital Certificate of Accomplishment will be awarded upon completion  </p>  <p style=\"\">  \t          Methods used are Accelerated Learning and Hands-On Training. You will get to do real project and real time training. I have scheduled 12 Lectures, 10 minutes - 20 minutes each. I really pray that you have a good internet connection.  </p>  <p style=\"\">  \t          Well, I hope you&#039;ll sign up Winning Project Management Framework program. See you in class.  </p>  <p style=\"\">  \t          Cheerz!  </p>", 
    "end_date": null, 
    "title": "TUSK - Winning Project Management Framework for Executives", 
    "price": "50.00", 
    "instructors": "Khairul Anwar Kamarudin", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/92670_435e_6.jpg", 
    "course_url": "https://www.udemy.com/tusk-project-management-leaders-executives-and-students/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-15T15:50:20Z"
}