{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>I recently got married! This workshop is based on the journey I went on whilst organizing my wedding. I have organized many events in my life but planning my own wedding day was a whole new ballgame. All of the sudden every decision became very personal.</p><p>Every wedding is unique but you can definitely learn from someone else's experience. I hope you will learn from my experiences, good and bad, and organize the wedding of your dreams. </p><p>This workshop is for you if someone recently proposed to you. Or you are hoping someone will propose to you very soon. This workshop is also for you if you are a wedding planner and you just want to get some new ideas.</p><p>This 90-minute workshop consists of 9 bitesized sections and are mainly video recordings and presentations. Sections include:<br></p><ul><li>Your brilliant wedding ideas: when dreams meet reality</li><li>Your dream location: make the venue work for you</li><li>Your budget: how to save some money</li><li>Planning your wedding day: become the perfect bride or groom</li><li>Getting married: the legal issues</li><li>Your wedding celebration: organize the party of the year</li><li>Your speech: how to write and deliver an amazing speech</li></ul><p>Throughout this workshop I will explain to you how I went about planning and organizing my wedding day. I hope that at the end of the workshop you feel inspired and confident in planning your own fairy tale wedding. </p>", 
    "end_date": null, 
    "title": "Wedding Planning", 
    "price": "30.00", 
    "instructors": "Jarno Stegeman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632354_4dec_3.jpg", 
    "course_url": "https://www.udemy.com/wedding-planning/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T13:13:55Z"
}