{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Over 700 students enrolled in the first month!  </p>  <p style=\"\">  \t  Join them, setting yourself up for success before you write a novel, start a blog series, or create an indie film.  </p>  <p style=\"\">  \t<strong style=\"\">Take Your Creative Work to the Next Level Through My Simplified Project Planning Method</strong>  </p>  <ul style=\"\">  \t<li style=\"\">analyze the resources you already have</li>  \t<li style=\"\">break a project down into manageable chunks</li>  \t<li style=\"\">create a schedule that you know you can stick to</li>  \t<li style=\"\">keep your project on track - and recover when life happens.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Write More With Less Stress</strong>  </p>  <p style=\"\">  \t  Project planning isn&#039;t just for corporate teams. The best and most prolific indie creatives use project planning to analyze their ideas, solve potential problems before they become crises, and keep their projects on schedule.  </p>  <p style=\"\">  \t  Professional writers, bloggers, and other creatives don&#039;t let writer&#039;s block stop them - because they know that successful planning is the key to beating writer&#039;s block before it has a chance to start.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t  This course is designed for creatives - not full-time project managers. I&#039;ll introduce you to all of the concepts and terms you&#039;ll need to know. You&#039;ll be able to get started quickly, and apply the lectures, worksheets and templates included in this course to your current work-in-progress.  </p>  <p style=\"\">  \t  As you work through the 8 projects in this course, you&#039;ll analyze your current resources - including time and energy, then break your project down into a step-by-step task list.  </p>  <p style=\"\">  \t  You&#039;ll use that information to create a realistic project schedule that you know you&#039;ll be able to stick to. And if life happens, you&#039;ll learn how to recover and get back on track.  </p>  <p style=\"\">  \t  This course will help you <strong style=\"\">do more of what you love</strong>, and will give you the tools you need to stand above the crowd in today&#039;s creative marketplace.  </p>", 
    "end_date": null, 
    "title": "Write More With Less Stress: Project Planning for Writers", 
    "price": "20.00", 
    "instructors": "Tricia Ballad", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404634_66c1_2.jpg", 
    "course_url": "https://www.udemy.com/project-planning-for-writers-and-other-creatives/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T19:21:15Z"
}