{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">    האם אי פעם סיימת פגישה ושכחת מהן המשימות שאתה צריך לבצע?  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">    או שכתבת לך על דף לגבי משימה חשובה שאתה צריך לבצע ושכחת לבצע אותה?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">או שאולי איבדת מעקב אחר משימות חשובות שאתה צריך לבצע ובסוף מצאת את עצמך מבצע את הכל בדקה התשעים?  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">    או שאולי יש לך כל כך הרבה פגישות עם העובדים והצוותים כדי לסנכרן את כולם ובסוף היום אתה מגלה שלא הספקת לסיים אף משימה שלך...  </strong>  </p>  <p style=\"\">  \t      אם אתה מחפש פתרון שיעזור לך לנהל ולשפר את מהירות ההתקדמות של הפרויקטים שלך, או שאתה מריץ מספר פרוייקטים שמשלבים עובדים שנמצאים במשרדים במקומות שונים ואתה רוצה לשמור מעקב מסודר של הכל, או שאתה רק רוצה להזניק את היעילות בעסק שלך - הגעת למקום הנכון.  </p>  <p style=\"\">  \t      אם אי פעם עבדת כחלק מצוות, אתה בוודאי יודע ששיתוף פעולה וסנכרון הם הבסיס להצלחה של כל פעילות.  </p>  <p style=\"\">  \t    כל אחד צריך לדעת מה כל אחד אחר בצוות עושה, מתי כל פעולה התחילה והסתיימה. לפעמים הפרוייקט נראה כל כך מורכב שאתה אפילו לא רואה את התמונה המלאה וזה יכול להיות מבלבל.  </p>  <p style=\"\">  \t    ברוך הבא לטרלו!  </p>  <p style=\"\">  \t<span class=\"GINGER_SOFTWARE_mark\" style=\"\">טרלו זאת אפליקצית רשת חינמית שמאפשרת לך להזניק את היעילות של העסק שלך בצורה דרמטית. חברות כמו אדובי, טמבלר, טריפ אדוויזור, והניו יורק טיימס משתמשים בטרלו כדי לנהל את הפרויקטים שלהם.</span>  </p>  <p style=\"\">  \t<span class=\"GINGER_SOFTWARE_mark\" style=\"\">טרלו זאת תוכנה מדהימה שיכולה לשפר את היעילות האישית של כל אחד.</span>  </p>  <p style=\"\">  \t    השתמש בה כדי לנהל ולבצע מעקב אחר המשימות שלך או השתמש בה עם הצוותים בעסק שלך כדי לשפר את שיתוף הפעולה.  </p>  <p style=\"\">  \t    בעזרת טרלו אתה יכול לבנות פרויקטים, לשייך משימות למשתמשים שונים, לשייך תאריכי יעד, לבנות דף בדיקה, שליחת קבצים ולתקשר עם הצוות שלך בנוגע למשימות ולקבל התראות לגבי כל מה שקורה וכל זה בזמן שאתה וחברי הצוות בכלל לא חייבים להיות באותו המקום!  </p>  <p style=\"\">  \t    בקורס הזה אני הולך להראות לך כל מה שאתה צריך לדעת כדי להתחיל לעבוד עם טרלו כבר עכשיו. בעוד קצת יותר משעה אתה תוכל להגדיר את החשבון שלך, להגדיר את הפרויקטים שלך, להגדיר את המשימות שלך ולשייך אותן לעובדים שלך על מנת שתוכל להגביר את יעילות העסק שלך.  </p>  <p style=\"\">  \t    כתוצאה מהשיפור ביעילות יהיה לך יותר זמן להתחיל פרויקטים חדשים, או אולי יותר זמן פנוי למנוחה ולמשפחה.  </p>  <p style=\"\">  \t    אם אתה מוכן ללמוד איך להשתמש בקורס הטרלו כדי להפוך את הפרויקטים שלך ליעילים ומהירים יותר ולהשיג יותר זמן פנוי בשביל עצמך - זה הקורס בשבילך!  </p>  <p style=\"\">  \t    נתראה בקורס!  </p>", 
    "end_date": null, 
    "title": "ניהול פרויקט בצורה אפקטיבית - בעזרת טרלו", 
    "price": "20.00", 
    "instructors": "אורי זוגלובק", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342476_bad8_2.jpg", 
    "course_url": "https://www.udemy.com/effective-project-management-with-trello-hebrew/", 
    "currency": "USD", 
    "subject_name": [
        "Project Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T15:58:04Z"
}