{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>GO FROM TOTAL BEGINNER TO SAVVY PHOTO EDITOR</strong></p>\n\n<ul><li>Want to improve your photos but feel intimidated by the complexity of photo editing software like Affinity Photo, Photoshop &amp; Lightroom?</li><li>Upgraded to a DSLR and want to do more than just click on filters?</li><li>Want to learn how to use Affinity Photo but didn’t know where to start or what the tools do?</li></ul>\n\n<p><br></p><p>In this introductory course to Affinity Photo we’ll take you from absolute photo editing beginner to savvy Affinity Photo user!<br></p>\n\n<p><strong>You’ll learn the fundamentals of Affinity Photo's Develop Persona</strong> — from navigating the interface, personas and the canvas; to bringing out the best in your raw images using:</p>\n\n<ul><li>basic image adjustments like exposure, contrast, clarity, saturation, vibrance, shadows and highlights;</li><li>cleanup tools like noise reduction, chromatic aberration and defringe, red-eye removal and blemish removal;</li><li>tonal adjustment and toning tools like curves, black and white, and split toning.</li></ul>\n\n<p><strong>Don’t know what all those words mean? Then this is the course for you!</strong></p><p><strong></strong>______________</p>\n\n<p>This course is designed for anyone just starting out with editing images in professional editing software:</p>\n\n<p><strong>We’ve made the course so it is simple to follow.</strong> This course will guide you through through the powerful image-editing tools available in Affinity photo, and you’ll see how we can use each of them to enhance our photos.</p>\n\n<p><strong>Along the way you’ll also learn best practices and potential gotchas</strong>, so it’s easy for you to enhance your photos, instead of struggling with options and feeling confused about why things don’t work.</p>\n\n<p>You’ll learn how to:</p>\n\n<ol><li>Navigate the Affinity Photo interface: personas, toolbars, panels, and the canvas.</li><li>Work with images, including resizing, cropping, etc.</li><li>Use the Develop Persona to get the best from your raw images.</li><li>Learn fundamental image editing concepts such as: non-destructive editing, tonal distribution with the histogram, clipping, resizing and resampling, DPI, and more.</li></ol>\n\n<p>______________<br></p>\n\n<p><strong>UPDATES INCLUDED FREE</strong></p>\n\n<p><strong></strong>We have updates planned for this course, and if there is major content added we likely will increase the price too. But if you buy now you will lock in the current price, and <strong><em>any additional content or updates will be included free</em></strong>.</p>\n\n<p>We're also always listening to what you need so once you sign up you'll get access to a <strong><em>student-only e-mail address</em></strong> where you contact us for help, or to show us the great work you've done!</p>\n\n<p><strong>MONEY-BACK GUARANTEE</strong></p>\n\n<p>Affinity Photo Tips and Udemy want to make sure you only get what's useful to you, so there's a <strong><em>30-Day Money Back Guarantee</em></strong> on any courses you purchase. </p>\n\n<p>______________<br></p>", 
    "end_date": null, 
    "title": "Affinity Photo 101: Master The Develop Persona", 
    "price": "30.00", 
    "instructors": "Affinity Photo Tips", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622034_2855_3.jpg", 
    "course_url": "https://www.udemy.com/affinity-photo-101/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T08:14:22Z"
}