{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"> This course is designed for those students who are interested in learning how to use a digital signal lens reflex (DSLR) and want to get the most out of the features inside.</p><p style=\"\">The course is made up of 26 videos with transcripts for each video. </p><p style=\"\">Section 1 introduces the course. </p><p style=\"\">Section 2 contains two videos. One explores Ansel Adam&#039;s zone system and how this helps to gauge the tonal range within an image. The other looks at techniques used to get good composition. </p><p style=\"\">Section 3 looks at the different types of cameras; types of sensors used; image resolution; how to use iris, shutter speed and iso; what camera modes are used; a discussion on white balance; and an exploration of different light metering modes.</p><p style=\"\">Section 4 goes through the workings of a camera lens; explores different focusing methods; how different lenses work and when to use them; how to do close-up work and use extension tubes; and a discussion on four types of filters.</p><p style=\"\">Section 5 examines lighting situations with the first video cover daylight and the second going through artificial lights.</p><p style=\"\">Section 6 concludes the course, with a bibliography to help you explore further sources of information. </p><p style=\"\">I see this as a starting point for the course as each area has the potential for more discussion and examples, so I intend to build on the material already included so far.<br style=\"\"></p><p style=\"\"> Course Structure: </p> <ul style=\"\"><li style=\"\">Course introduction</li><li style=\"\">Fundamentals of photography </li><li style=\"\">All about cameras</li><li style=\"\">How to use lenses on a digital camera</li><li style=\"\">How to use daylight and artificial lights</li><li style=\"\">Course Conclusion</li></ul> <p style=\"\"> Currently, the course contains about 1 hour of video tutorials. </p>", 
    "end_date": null, 
    "title": "Anatomy of Digital Photography", 
    "price": "20.00", 
    "instructors": "George Kingsnorth, Michael N. Kingsnorth", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463294_46b9.jpg", 
    "course_url": "https://www.udemy.com/anatomy-of-digital-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T19:22:11Z"
}