{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">You&#039;ll learn the basics of using the Sony Alpha A6000 mirrorless camera so you can get out and shoot <strong style=\"\">great images</strong> and <strong style=\"\">high quality video</strong>.</p><p style=\"\">The lectures are high quality HD videos ready  to watch and learn. I spent the quality time recording the video lectures so you don&#039;t have to waste moments reading the boring black and white <em style=\"\">instruction manual.</em></p><p style=\"\">The videos cover important things like intelligent auto, focus peaking, focus magnifier, auto drive speed and more. The most important things one will know to start shooting their Sony A6000 right away with <strong style=\"\">stellar results </strong>has been documented.</p><p style=\"\">The exercises are explained fully for ease of use and easy duplication. If you are a beginner to shooting a mirrorless Sony Alpha a6000 this course will help you tremendously. The class is simple to follow and very informative.</p><p style=\"\">Course also includes the visual power and function of the Sony A6000&#039;s <strong style=\"\">dynamic range, awesome video and clear digital image zoom.</strong></p><p style=\"\">This course is for absolute beginners and for people with some knowledge of how their mirrorless camera works. </p><p style=\"\">After spending the time to watch the short and well filmed videos you can go out and shoot your camera with <strong style=\"\">confidence</strong>.</p>", 
    "end_date": null, 
    "title": "Beginner Sony Alpha A6000 (HD) Tutorial Guide", 
    "price": "20.00", 
    "instructors": "Calvin Hill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538290_c484.jpg", 
    "course_url": "https://www.udemy.com/sony-alpha-a6000/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T22:01:15Z"
}