{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Master the Color and Black &amp; White workflows in Photoshop for making dramatic and powerful images that lift off the page or screen, and engage the viewer's eye. Go far beyond the image as it came out of your camera and gain complete control over the look and feel of your photographs.</p><p>For <em>Color</em> photography, after touching on color theory and color themes as they apply to making powerful images, you will work with <em>multiple</em> methods to apply those techniques in Photoshop, including a complete <em>color look</em> workflow. For <em>Black-and-White</em> photography, after briefly exploring traditional toning and why Black-and-White images <em>need</em> toning, Steve guides you through the most important Black-and-White workflows in Photoshop. Those workflows serve as a preamble to applying toning and split-toning techniques using Photoshop's feature set - including the step-by-step technique Steve used to create Photoshop's <em>Photographic Toning</em> presets. Throughout all the lectures Steve provides you with thorough, clear, and detailed step-by-step instructions. Any questions you have will be answered by your instructor via the course dashboard.</p><p>Because not all students learning these techniques will be familiar enough with Photoshop to dive into the more advanced sections right away, Steve guides you through a tour of Photoshop basics, and Photoshop's most important <strong>adjustments and panels</strong>, and <strong>layer and channel workflows</strong>. Experienced Photoshop users may pick up a trick or two from those sections but can dive in at Section 2, where Steve first provides a visual guide for color optimization, and then takes you along the journey of mastering the powerful photographic features available in Photoshop, including Blending Modes and Blending Options, the Camera Raw filter, Curves as a color adjustment, Layer Masks, Calculations, Gradient Map, Color Lookup (3DLUT) exports, and hidden yet powerful features.</p><p>As you work alongside Steve, you'll be amazed at the stunning Color and Black-and-White looks, styles and effects you will be able to apply to your images. And that is the best way to take the course - work along with the instructor. Watch a lecture and try out that lecture's techniques in Photoshop, either with the provided samples or your own photography - that is <strong>hands-on learning</strong>. Steve always tells his students, \"there is no such thing as a stupid question\", and will answer any questions you have as you work through the course to master Color and Black-and-White in Photoshop.</p><ul><li>Create custom color looks and <strong>develop a unique style for your photography</strong></li><li>Comprehensive Color and Black-and-White workflows and techniques to <strong>add atmosphere and depth to your photography</strong>.</li><li>Steve's personal technique for creating Black-and-White <strong>Gradient Map presets</strong></li><li>Use <em><strong>hue contrast</strong></em> and <em><strong>saturation contrast</strong></em> to draw in the eye of the viewer.</li><li>Control the <strong>blending</strong> of colors and tints into specific tonal regions of your photographs.</li><li>Use the color style from any artwork or photograph to <strong>create color themes and styles</strong> in Photoshop that can be applied to your photography, or packaged to share or sell.</li><li>Use the color theme from an artwork like the Mona Lisa, and apply that color style to your photography.</li><li>Create a Black-and-White look based on a vintage <strong>Gold-toned Albumen print</strong> and apply that to your images.</li><li>Explore the Color and Black-and-White tinting and toning features Photoshop's Camera Raw module</li><li>For photographers owning Lightroom, or having the Creative Cloud Photography Package which includes Lightroom, Steve includes a 2-part 30 minute lecture on Black-and-White toning techniques using Lightroom, including covering the 3 ways to make Black-and-White images in Lightroom.</li></ul>", 
    "end_date": null, 
    "title": "Color and Black & White Photography in Photoshop", 
    "price": "45.00", 
    "instructors": "Steve Weinrebe", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471944_7ef4_41.jpg", 
    "course_url": "https://www.udemy.com/toning-color-and-black-and-white-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T14:41:06Z"
}