{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Alexander Heinrichs und Matthias Schwaighofer in Action – inspirierend, unterhaltsam, lehrreich, live! Dieses Training verrät alles, was Sie für kreative Fotoshootings wissen sollten: Ideenfindung, Planung, Location-Suche, Set-Aufbau, Kameratechnik und Equipment, Blitzpraxis, RAW-Entwicklung und Fotofinish am Rechner. Schauen Sie den Top-Fotografen über die Schulter und erfahren Sie aus erster Hand, wie auch Sie Fotos machen, die begeistern</p>\n\n<ul><li>2 Fotografen, 6 spannende Locations, viele kreative Foto-Shootings\n</li><li>Mit Profi-Tipps zu Equipment, Licht-Setups und Kameratechnik\n</li><li>Umfassende Praxisworkshops zum Fotofinish mit Adobe Photoshop\n</li></ul>\n\n<p><br>Matthias Schwaighofer ist Meisterfotograf, Restaurateur und Photoshop-Künstler. In seine Arbeiten fließt neben höchster Professionaliät auch immer eine gute Portion Humor ein. Sein Faible gilt vor allem hochwertigen Porträtfotos, aufwändigen Composings und humorvollen Collagen, in denen er sich gerne selbst stiliisiert.<br></p>\n\n<p>Alexander Heinrichs ist Profi-Fotograf und Fotodesigner mit eigenem Studio über den Dächern von Aschaffenburg. Seine Schwerpunkte sind hochwertige Porträt-, Produkt- und Werbefotos, aber auch fotorealistische Montagen und Composings. Er ist als Berater für Sigma tätig und veröffentlicht regelmäßig Artikel und Tutorials in Fachmagazinen und auf seinem Foto-Blog.</p>", 
    "end_date": null, 
    "title": "Creative Shooting: Live am Set mit den Foto-Profis", 
    "price": "50.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822932_023d.jpg", 
    "course_url": "https://www.udemy.com/creative-shooting-live-am-set/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T16:29:30Z"
}