{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Family and friends love to know what's happening with you, so\n why not create a personalised video that you can easily share with \neveryone?</strong></p><p>In this course I will show you how to make a unique timelapse of your\n family decorating your Christmas tree.  Plus, how to add a festive \nsoundtrack, greetings and the years updates on your family''s \nachievements.</p><p>This course takes you even if you are a novice through all the steps neccessary to create a timelapse video of you decorating your Christmas tree that you can then share with your family and friends. You will learn how to add titles and a festive soundtrack to give it more polish and then you will learn how to publish your new timelapse video to YouTube.</p><p><strong>You will  learn:</strong><br></p><ul><li>What an Intervalometer is</li><li>Where to find your festive soundtrack</li><li>The important things to consider when setting up your scene</li><li>What the best camera settings are</li></ul><p><strong></strong></p><p><strong>You will also learn how to:</strong></p><ul><li><strong></strong>Download a free version of Lightworks ( powerful video editing software)</li><li>Add titles</li><li>Add a soundtrack</li><li>Take a series of pictures and create a timelapse video</li><li>Convert a YouTube video into an mp3</li><li>Easily choose your Intervalometer settings</li></ul><p><br></p><p>You would want to take this course if you are interested in sharing something unique this Christmas and you would like to learn how to use your camera to create something new and exciting.</p>", 
    "end_date": null, 
    "title": "Create A Unique Christmas Video: A Christmas Tree Timelapse", 
    "price": "20.00", 
    "instructors": "Stephen Bezant", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678058_eb75_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-timelapse-video/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T09:48:25Z"
}