{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t      Teilnehmer am Kurs &quot;Digitale Kameras verstehen - Digitale Fotografie lernen&quot; besitzen bereits eine digitale Kamera oder möchten sich eine Kamera zulegen. Neueinsteiger erhalten einen Überblick über die verfügbaren Kamerasysteme von Kompakt bis Spiegelreflex. Diese Informationen dienen als Grundlage für eine vernünftige Kaufentscheidung. Anhand des technischen Überblicks erfahren die Kursteilnehmer, welche Vor- und Nachteile verschiedene Kamerasysteme haben.  </p>  <p>  \t      Digitalkameras besitzen eine Vielzahl an Funktionen, die nicht auf den ersten Blick verständlich sind. Deshalb wird vor allem drauflos geknipst, ohne zu wissen, wie man seine Ergebnisse verbessern kann. Man erhält halbwegs gute Bilder, weiß aber auch, dass die Kamera eigentlich viel mehr Potential hat.  </p>  <p>  \t      Die Kursteilnehmer haben nur wenig Fachwissen und Praxiserfahrung in der Digitalfotografie. Aber sie möchten das Potential der Digitalfotografie im Allgemeinen und der Kamera im Speziellen kennenlernen und sich weiterentwickeln.  </p>  <p>  \t      Der Kurs beinhaltet ca. 105 Minuten an Lehrvideos in 10 Hauptkapiteln. In den einzelnen Lektionen werden neben den Schulungsvideos vor allem Abbildungen und Fotografien gezeigt, welche einerseits die technischen Details, Schalter und Knöpfe einer Kamera zeigen, andererseits als praktische Fotobeispiele zu sehen sind.  </p>", 
    "end_date": null, 
    "title": "Digitale Kameras verstehen - Digitale Fotografie lernen", 
    "price": "30.00", 
    "instructors": "Christian Haasz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307756_567c_3.jpg", 
    "course_url": "https://www.udemy.com/digitalfotografie-01/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-25T17:10:30Z"
}