{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Master the most important settings on your Canon or Nikon DSLR camera and learn how to look at your surroundings through new, more creative eyes, so that you too can take magazine-quality photographs of your friends, family, vacations, events and anything else that is beautiful and important to you.</p><p><strong>Learn how to take Beautiful Photographs with your DSLR Camera</strong></p> <ul><li>Learn what equipment is necessary and how to use it correctly</li><li>Master all the most important camera settings</li><li>Become aware of different light sources and how they influence the look of your photos</li><li>Develop and eye for striking composition</li><li>Learn to look at your surroundings with more creative eyes</li></ul><p><strong>Develop the ability to capture moments and memories</strong></p><p>Ever wonder how the pros get those stunning shots? Believe it or not, most of the breathtaking photographs you see in magazines and online every day are photographed with DSLR cameras just like yours. DSLR cameras are powerful tools that give you the ability to take stunning photographs that capture all those special things you see and moments you experience – photos that you will cherish for the rest of your life. The key to success is to use the camera correctly and that's what you will learn in this course. </p><p>As a beginner, you may feel overwhelmed and intimidated by all the camera's dials, buttons and settings, but that will be a thing of the past once you've completed this course. My goal is to fill you with confidence, not only when it comes to choosing good settings, but also when you compose your images. By the end of this course, you too will take stunning photos with your DSLR camera. </p><p><strong>Content and Overview</strong></p><p>This course is divided into two broad components: first we cover all the <strong>technical aspects</strong>, like camera equipment and support, as well as the camera's most important settings. After that we look at the <strong>artistic side</strong> of photography, which focuses on light, composition and creativity.</p><p>It has been structured in such a way that you won't ever feel overwhelmed by technical jargon, complicated camera functions or obscure principles. The aim is to keep everything as clear and simple as possible, and this was achieved by tackling each important photographic element separately in short and concise lectures that last between 2 and 5 minutes each. The majority of lectures consist of both teacher-style video clips (where I explain a setting, principle or tip) and slides, both of which contain photographic examples and audio (where I interpret each photographic example). </p><p><em>THIS IS WHAT YOU WILL LEARN FROM THIS COURSE:</em></p><p>How to use your Camera Equipment:</p> <ul><li><strong>How to</strong> <strong>hold your camera correctly</strong>, which helps you to get sharp photos every time.</li><li>Which <strong>lenses</strong> to use for which photos, so that you can best capture a specific subject or scene.</li><li><strong>How to change lenses</strong> correctly in order to prevent irritating dust spots from forming on each photograph.</li><li>What your DSLR <strong>camera's limitations</strong> are and how to compensate for them when you're photographing scenes with high contrast.</li><li>Why and when you should <strong>support your camera</strong> on tripods and bean bags.</li></ul><p>How and when to change Camera Settings:</p><ul><li>Different <strong>Shooting modes</strong> (which allows you to be more creative).</li><li><strong>File size and format</strong> (ensuring that you take the best possible quality shots).</li><li><strong>White balance</strong> and <strong>Metering mode</strong> (which allows you to influence the 'warmth' or 'coolness' of your photos and the way that the camera exposes what it sees.</li><li><strong>Drive mode</strong> (which allows you to shoot like a pistol or like a machine gun).</li><li><strong>Auto focus mode</strong> (which tells the camera whether you're photographing something standing still or something that is moving).</li><li><strong>Auto focus point selection</strong> (which allows you to focus on either the whole subject or scene, or on a very specific part of it).</li><li><strong>ISO</strong> (which allows you to take sharp photos in low light conditions)</li><li><strong>Exposure compensation</strong> (which allows you to quickly make a photo lighter or darker).</li><li>How to <strong>influence the depth of field</strong> in your photos in Aperture Priority.</li><li>How to <strong>freeze action</strong> or <strong>capture movement</strong> in Shutter Priority.</li><li>How to use the little pictures, or <strong>Scene selections</strong>, on your camera's Shooting mode dial.</li></ul><p>How Light influences your photos:</p><ul><li>How to take colourful, representative images in <strong>front light</strong>.</li><li>How to highlight detail and texture in <strong>side light</strong>.</li><li>How to capture dramatic <strong>back light</strong> images that contain silhouettes and golden rim light.</li><li>How to take photos in <strong>diffused light</strong> on overcast days.</li><li>How to use your camera's built-in <strong>flash</strong> effectively.</li></ul><p>What perfect Composition is:</p><ul><li>When to change the <strong>camera orientation</strong> from horizontal to vertical.</li><li>How to <strong>blur the background</strong> of a perfect portrait photos in 4 easy steps.</li><li>How to <strong>apply the Rule of thirds</strong> to ensure beautifully balanced photos.</li><li>Where to leave the correct amount of <strong>space</strong> in your photos.</li><li>How to draw your viewers' eyes into your photos with the help of <strong>leading lines</strong>.</li><li>How to compose striking images by <strong>changing your angle</strong>.</li><li><strong>5 simple steps to perfect composition!</strong></li></ul><p>How to become a more Creative photographer:</p><ul><li>How to use <strong>reflections</strong> in your photos.</li><li>What a <strong>natural frame</strong> is and how to find and use it in your images.</li><li>How to incorporate different <strong>complimentary colours</strong> in your photos.</li><li>How to use <strong>repetition</strong> effectively in your photos.</li><li>How to highlight the size of something by incorporating and element of <strong>scale</strong>, and finally,</li><li>How to <strong>tell a story</strong> with your photos.</li></ul><p>Take a moment to view the course Promo Video, as well as those lectures that have been made available as a sample of what you can expect and remember to activate HD on your Udemy viewer by clicking on \"HD\" below the video clip. </p><p>Keep in mind, if you're not happy with the material, there's a 30-day no-questions-asked full money back guarantee! So don't hesitate and enrol today, and watch as photography quickly becomes your new favourite hobby…!</p><p><em>“Villiers's presentation skills are superb and better than anything else I've attended or enrolled in before. Not only is his technical knowledge of his subject outstanding, but he is also willing to share practical advice accumulated over years.\"</em></p><p><strong><em>Helgard de Preez – South Africa</em></strong></p>", 
    "end_date": null, 
    "title": "Digital Photography for Beginners with DSLR cameras", 
    "price": "30.00", 
    "instructors": "Villiers Steyn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387536_ca0e_5.jpg", 
    "course_url": "https://www.udemy.com/digital-photography-for-beginners-with-dslr-cameras/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T10:20:17Z"
}