{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>\n\nPhotography for Kids: is a beginners digital photography\ncourse where kids will have fun learning about photography and their cameras.\nIn this fun photography, course kids will learn to create amazing photographs.\nBeginning with a flash- back through photo history. Then explore how to choose\nthe best settings on their camera. Kids will also discover how to compose and\ncreative unique images using camera angles and the zoom. </p>  <p><strong>\n\n<strong>This Lively, Fun, and Informative Beginners Digital\nPhotography Course For Kids Is Designed for Children Between The Ages of 7 to\n12. Kids Will Find Inspiration and Lessons to Help Learn and Create Amazing\nPhotographs With a Digital Camera, Tablet, or Camera Phone. </strong></strong></p>  <ul><li>Discover      how photography changed the world</li><li>Learn      to use common camera icons: such as portrait, landscape, and motion </li><li>Practice      creating sharp in focus photographs</li><li>Create      amazing photographs by varying angles</li><li>Recognize      technical photography terms and understand their meanings</li><li>Select      the best resolution on your camera</li><li>Express      your emotions and your feeling with your photographs</li></ul>  <p><strong>Imagine, Learn &amp; Create</strong></p>  <p>An entertaining and easy to understand digital photography course where, children will explore new ideas and complete practice activities to develop their creative photography skills</p>  <p><strong>Content and Overview</strong></p>  <p><strong><em>Do you know a child who loves photography, but you lack the creative skills or technical knowledge to explain the camera settings?</em></strong> <strong><em>Why not learn from a fun - loving animated photography expert?</em></strong></p>  <p>A captivating beginner’s photography course that is designed for kids. This course is perfect for the child who loves to take photographs, or would just like to learn. The course was developed with a mixture of engaging animation, captivating graphics, and inspirational digital photography to entertain while learning. Kids will create amazing photographs, explore their camera settings, and discover photo history. In addition, I‘ll challenge them with questions and give them activities to motivate and practice their new skills. \n\nThere are also colorful fun printable certificates at the\nend of each section to acknowledge their progress and accomplishments. By the end of the course, their photographs will scream WOW! And they will be on their way to becoming an awesome photographer. </p>", 
    "end_date": null, 
    "title": "Digital Photography for Kids", 
    "price": "20.00", 
    "instructors": "Jeannie Taylor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559918_6fab_3.jpg", 
    "course_url": "https://www.udemy.com/fun-with-photography-a-course-for-kids/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T00:56:29Z"
}