{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>This course will take you through all of the steps to create unique paintings from your pet photographs. Step by step, I break down all the things you need to know and understand in Photoshop to move your images out of a photographic appearance into a more painterly one.</p><p>Although, I do break everything into simple steps a basic understanding of Photoshop is highly suggested. This course is perfect for intermediate to advanced users.</p><p>Not an artist? Never painted before? That&#039;s OK.</p><p>You CAN learn to paint digitally and with a lot less expense and mess!</p><p>Whether you are a professional photographer looking to rise above your competition by offering paintings as a unique product to your clients, or you are simply a hobbyist who enjoys editing images creatively, you will find everything you need here to get started and create amazing art. After completing this course you should be able to turn any pet photograph  into a digital painting that you will be proud to show your family and friends.</p><p>Digital art can be created from just about any image, even low resolution ones from phone cameras. As a matter of fact, there is no requirement at all to even own a camera in order to benefit from this course. </p><p>In this course you can watch me paint as I go over everything I&#039;m doing, step by step.</p><p>In the supplemental material sections, I have included the image I use throughout the course for you to download and practice along side me, but you will learn the skills needed to create a painting out of ANY pet image.</p><p>Enroll today, I&#039;d love to help you learn this fun way to create art!</p>", 
    "end_date": null, 
    "title": "Digital Pet Paintings Using Photoshop ", 
    "price": "40.00", 
    "instructors": "Lori Jill", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373674_8ece_2.jpg", 
    "course_url": "https://www.udemy.com/digital-pet-paintings-using-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-19T05:15:16Z"
}