{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">About the course:</strong>  </p>  <p style=\"\">  \tIn this course you will learn how to create a video montage out of your photos, videos and music. You will learn how to control almost every aspect of the final movie, how to add captions, how to spot important moments, how to fit the video montage to your needs, how to export your video montage to various video formats – as well as sharing it online.  </p>  <p style=\"\">  \t<strong style=\"\">Why you should take this course?</strong>  </p>  <p style=\"\">  \t  I bet somewhere in your computer or on CDs around the house, you have tons of photos you took in different occasions: in birthdays, holidays, trips, photos of your dog, your parents, your kids, maybe even a whole album with photos of different flowers.  </p>  <p style=\"\">  \t    Imagine you could take all of those old, unused and untouched albums, and re-live everything in a special, entertaining way, share it with your friends and on social media and get numerous reactions, from &quot;wow that was beautiful&quot; to &quot;did you do it by yourself?!&quot; or even &quot;who made this for you? I&#039;d like to create one for my upcoming reunion event&quot;.  </p>  <p style=\"\">  \t    Wouldn&#039;t it be great to just enjoy all those memories in a little different way than the usual? Instead of uploading another photo album to your favorite social network, or send a huge email with heavy images to all your relatives, create a video montage and let everyone enjoy it by just sitting and watching, without the need to click on the mouse, with nice background music and without the need to download a big amount of data to their computer.  </p>  <p style=\"\">  \t    Other than the fact that you will bring your old (or new) footage to life again, you will have a blast while creating your montage.  </p>  <p style=\"\">  \t    And it&#039;s not over just here – you can even use the software for your own business; If you&#039;re running an online store, you could be unique and present your products as short video montages – your customers will appreciate the professional way of introducing your products. You can use a video montage in various businesses, and you will learn not just how to put all of the content together in a nice, professional way – but also to include a watermark, so no one will be able to take the credit of it. You can even add a &quot;call for action&quot; text and help your future customers reach you easily.  </p>  <p style=\"\">  \t<strong style=\"\">Who should take this course?</strong>  </p>  <p style=\"\">  \t    You don&#039;t need special technological skills other than knowing how to download and install a software. You don&#039;t need any editing skills – I will take you through all the steps you need in order to create a video montage from 0, and as written before – it&#039;s easy and fun working with it. I will show you how to get a 15-day trial which is enough for you to explore and decide if you want to pay for the full version, which costs less than 80$.  </p>  <p style=\"\">  \tSo basically - anyone who thinks they can use a photo montage for their personal andqor commercial use - should take this course!  </p>  <p style=\"\">  \t    I invite you to join me in this short 40-minute course, and open up to a whole new, exciting world of video montages! Be aware – it&#039;s addictive!  </p>", 
    "end_date": null, 
    "title": "Do so much more with your photos and videos - video montage!", 
    "price": 0, 
    "instructors": "Maya Bielik", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366069_8ab9_4.jpg", 
    "course_url": "https://www.udemy.com/create-a-video-montage/", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T19:57:51Z"
}