{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><p style=\"\"><strong style=\"\">Introduction to DSLR Photography for Beginners (newly updated with  new examples, original image download and much more)</strong></p>    <p style=\"\">Master your camera  and&nbsp;understand the basics of digital SLR photography with this Photography Course Online.</p>    <p style=\"\">Recent comments from Diane Bell <em style=\"\">&quot;<strong style=\"\">I  enjoyed this course. The tip I benefited from the most was how to hold the  camera. Camera shake can be a big issue. Thanks for the course. I got a lot out  of it.&quot;</strong></em></p>    <p style=\"\"><strong style=\"\">Photography can be Frustrating in  the Beginning</strong></p>    <p style=\"\">Are you frustrated with the average  shots you&#039;re getting with your DIGITAL SLR camera?  Are you stuck in automatic mode? Do the words &quot;aperture&quot;,  &quot;shutter speed&quot;, &quot;ISO&quot; and &quot;exposure&quot; sound like  a foreign language, but one you would like to speak?</p>    <p style=\"\"><strong style=\"\">Learn  the basics of photography in 120 minutes..... Guaranteed.</strong></p>    <p style=\"\">This downloadable step-by-step video  series covers the basics of photography, from how your camera works, exposure,  shutter speed and aperture, all the way to what inspires you and how to compose  your images for maximum impact.&nbsp;</p>    <p style=\"\"><strong style=\"\">Short &amp; Sweet Videos Lessons</strong></p>    <p style=\"\">Brent goes into detail and  demonstrates each essential photographic ingredient in these fun, casual and  easy-to-learn videos.</p>    <p style=\"\"><strong style=\"\">Easy Self-Paced Learning</strong></p>    <p style=\"\">Take this course at your own pace,  come back and re-watch sections if you like, or watch the entire course in  one-go. It&#039;s recommended that you watch one section at a time and then go out  and practice what you have learned.</p>    <p style=\"\"><strong style=\"\">Photograph On-Location &amp;  In-Studio</strong></p>    <p style=\"\">Join Brent as he photographs  portraits in the studio and outdoors as well as go on location to capture landscapes  and sunset pictures.</p>    <p style=\"\">You will never have to shoot in auto  mode again.</p>    <p style=\"\"><strong style=\"\">Popular Photography eBook Included</strong></p>    <p style=\"\">Included is a full manual (Essential  Photography Skills eBook 2nd edition) that  goes with these videos, Print it out, especially the Exposure Chart, plus 2  bonus videos will help you shoot like a Pro.</p>    <p style=\"\"><strong style=\"\">Download the Original Images</strong></p>    <p style=\"\">Download the full resolution  original images from the lectures; follow along on your computer. For example:  The lecture on shutter speed - check out the fast shutter speed images and  compare them to the slow shutter speed images - zoom right in. Awesome!</p>&lt;/p&gt;<p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Essential Photography Skills - Beginner Digital SLR Training", 
    "price": "30.00", 
    "instructors": "Brent Mail", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22145_6a8c_9.jpg", 
    "course_url": "https://www.udemy.com/essential-photography-skills-beginner-digital-slr-training/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-01T22:55:16Z"
}