{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>This\ncourse will teach you how to shoot and stitch HDR panoramic photos\nthat are suitable for IBL lighting in 3D software.  Parts of the\nworkflow can be skipped such as dropping the HDR aspect to simply\ncreate stunning panos.</p><p>The\nterminology used here is basic photography concepts and a minimum of\nVisual Effects ideas.</p><p>The\ncourse is broken into 3 main sections, including Overview and\nPreparation, Shooting the Panorama, and Processing your photos.</p><p>Included\nmaterials will be 4 complete sets of wedged photos used to make example panoramic images.  Also there will be introductions to\nalternative free and shareware software that one can use to achieve\nthe same result without any additional purchasing.</p><p>Depending\non the level of the student this course could take from 2 to 4 weeks.\n The reason it could take longer is because it takes time to get\noutside and shoot lots of photos, and there will be a learning curve\nthe first couple of times as the student gets familiar with the\nprocess that fits his or her camera equipment.</p><p>Any\nvisual effects TD who wants to take their skill and knowledge to the\nnext level will surely advance professionally by learning how to\nshoot and process high dynamic range panos.  Also any experienced\nphotographer can add a completely new and striking type of image\ncapture to their portfolio with always stunning panoramic\nphotography.</p>", 
    "end_date": null, 
    "title": "HDR 360 Panorama Photography", 
    "price": "20.00", 
    "instructors": "Jon Tojek", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612778_3c5f_2.jpg", 
    "course_url": "https://www.udemy.com/hdr-360-pano/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T14:49:34Z"
}