{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>If you are  getting blurry, dark, or just plain old, ordinary pictures of your kids with  your digital SLR camera, this course will be perfect for you. Mary Buck, the  photography instructor, will teach you how to optimize the settings on your  digital SLR camera and combine it with some creative tips so you can improve  your photography.  She will walk you through each of the twelve lessons of “Kids Photography Ideas  &amp; Techniques”, step-by-step with hands-on learning.&nbsp; </p>    <p>In just a  few short weeks, you will be shooting amazing pictures of your kids. Your  photography will improve so much that you will be the envy of your friends when  they see your photographs.&nbsp; You need to  sign up for this course because you deserve great photos of their kids.&nbsp; Do it now, before it is too late. All you  need is a digital SLR camera, a memory card, tripod, a lens and that’s  all.&nbsp; Oops, don’t forget your kid!</p>    <p>Mary has  been teaching photography classes for ten years.&nbsp; Her most  popular request from her students is how to take better kid’s photos, which is  why this Kids Photography Ideas &amp; Techniques course was created. As  a mom, she knows how important it is to have pictures of every milestone of a  child’s life, plus the unexpected, candid moments.&nbsp; You will have the best of both worlds with  this course; a dynamic and experienced photography teacher who is also a parent  that knows first-hand the importance of great family photos.</p>    <p>Take this Kids Photography Ideas &amp;  Techniques course and learn how to take better photos of your kids.</p>  ", 
    "end_date": null, 
    "title": "How to Take Better Photos of Your Kids", 
    "price": "45.00", 
    "instructors": "Mary Buck", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23640_21d6_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-take-better-photos-of-your-kids/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-26T22:34:22Z"
}