{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>¿Estas aburrido/a de hacer siempre las mismas fotos? ¿no entiendes qué parámetros aparecen en la pantalla de tu cámara ni porque te salen oscuras las fotos, o porque les falta nitidez? ¿Quieres mejorar tu técnica, dejar de ser un fotógrafo/a del montón y empezar a evolucionar ya de una vez como fotógrafo/a? ¿Sabes algo de fotografía pero no tienes claro los conceptos y te gustaría que alguien te los explique de forma clara y sencilla? Si las respuestas a estas preguntas es si, éste curso es para ti.</p><p> El curso está hecho de tal manera que cualquier persona pueda entenderlo fácilmente, bien seas una persona con experiencia en relación a la fotografía, o bien seas alguien que acaba de comprar una cámara y te gustaría saber cómo funciona y cómo exprimirla.<br style=\"\"></p><p><em style=\"\"></em>Con éste curso de fotografía vas a poder aprender e interiorizar los conceptos más importantes de este fascinante mundo. Irás aprendiendo poco a poco y desde el principio, desde los tipos de cámaras que existen, sus componentes, cómo funciona una cámara etc... hasta saber qué es la velocidad de obturación, la apertura, la ISO, los modos de enfoque, modos de disparo y muchos más conceptos....llegando a ser capaz de hacer fotografías en modo manual, tomando tú el control de la foto y sabiendo qué es lo que haces y porqué lo haces. Puedes echar un vistazo al curriculum del curso para saber en profundidad qué temas vamos a tratar. Durante el curso, cualquier duda que tengas, puedes consultármela bien via email o bien a través de la plataforma, estaré encantado de responderte.</p><p>Éste curso está diseñado y creado directamente desde mi propia experiencia, una experiencia que he ido adquiriendo durante más de 12 años como fotógrafo aficionado. A mi me ha llevado 12 años aprender todo lo que sé sobre fotografía. A ti sólo te costará unas semanas ya que todo lo que sé lo he condensado en éste curso ordenándolo con una lógica práctica y añadiendo muchísimos ejemplos del día a día para que lo entiendas fácilmente y lo interiorices para siempre. No te voy a enseñar a hacer una foto en concreto o a utilizar una cámara en concreto, te voy a enseñar <strong style=\"\">a hacer fotos</strong><strong style=\"\">,</strong> con cualquier cámara, en cualquier situación y para siempre. Mi lema es:<em style=\"\"> &quot; Si das pescado a un hombre hambriento, le nutres durante una jornada. Si le enseñas a pescar, le nutrirás toda su vida&quot; ( Lao Tse).</em></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Iníciate con éxito en la fotografía", 
    "price": "20.00", 
    "instructors": "Iker Uranga", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358554_2541.jpg", 
    "course_url": "https://www.udemy.com/iniciate-con-exito-en-la-fotografia/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T18:06:32Z"
}