{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t<strong>LATEST:</strong> The course is updated to summer 2016.</p>\n\n<p>  \t<strong>NEW:</strong> I'm now posting news about the iOS photography <strong>apps that are free</strong> on specific dates. Don't miss one of these great freebies.  </p>\n\n<p>  \t        ----------------------------------------------------------------------------------------------------------  </p>\n\n<p>  \t                If you want to take photos that are so awesome people won't believe you shot them with an iPhone, this course is for you. Using a combination of easy-to-learn photographic techniques and a variety of iPhone apps, you'll quickly learn how to compose dynamic images, then tweak them to perfection using great shooting and post-production apps.  </p>\n\n<p>  \t                Course includes videos that show the best iPhone apps, the features of each, and examples of how to best use each of the applications.  </p>\n\n<p>  \t<strong>What you'll learn</strong>  </p>\n\n<ul>  \t<li>exposure - why exposure is so important in getting that great shot (avoid blown out skies or ultra-dark shadows)</li>  \t<li>composition - subject placement is everything; learn how to place your main subject at the intersection of a \"rule of thirds\" grid</li>  \t<li>native iPhone camera features - why it's fine to shoot with the native iPhone camera and then do post-processing with other apps</li>  \t<li>want more control over your original shot than you can get with the native iPhone camera? Learn the apps that give you pro-level control.</li>  \t<li>my favorite apps to explode color saturation</li>  \t<li>post-production apps that will get you a ton of Instagram followers</li>  </ul>\n\n<p>  \t                Just because you shoot with an iPhone doesn't mean you can't get outstanding photos of people, places and things. In fact, once you delve into iPhone photo apps you'll be surprised at the masterpieces you create.  </p>\n\n<p>  \t<strong>Why you should listen to me . . . </strong>  </p>\n\n<p>  \t    Although I'm \"an amateur\", my photographs have appeared in the pages of Sky &amp; Telescope, Astronomy, History Magazine,Travelog, and many more. Good news for students - you don't have to be a fulltime \"pro\" to get your work seen by raving fans or paying publications and websites.  </p>\n\n<p>  \t<strong>What students are saying…</strong>  </p>\n\n<p>  \t          \"Love this course and am so glad I joined it. I have never had any confidence in my ability to take photos. What I found really useful about this course were the examples Nancy uses. When she explains what's good or bad about her own photos it helps with understanding her instructions about composition, lighting, etc. I'd heard about the rule of thirds before but hadn't got why it was so important untilshe showed the photo of the bird and it clicked! I hadn't heard about the golden ratio before but that's super helpful and easy to understand too. I also love that she recommends helpful apps. There are so many on the App Store that you could spend a fortune before you find the ones you really need. All in all this is an excellent course, highly recommended for anyone who doesn't want to schlep a big camera around yet still take good photos\" - Michelle  </p>\n\n<p>  \t            Click the “<strong>Take This Course</strong>\" button up top because you don't want to miss another moment taking high quality pictures with your iPhone.  </p>\n\n<p>  \t<strong>Scroll up and enroll now</strong>  </p>", 
    "end_date": null, 
    "title": "iPhone Apps for High Quality Photos", 
    "price": "20.00", 
    "instructors": "Nancy Hendrickson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337018_a1f0_7.jpg", 
    "course_url": "https://www.udemy.com/photography-for-iphones-best-apps-for-great-photos/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T22:57:40Z"
}