{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t  Do you have a good camera but just can’t seem to take those amazing <strong style=\"\">professional shots</strong> you see posted on the internet and selling on sites like <strong style=\"\">Getty Images</strong>.  </p>  <p>  \t  This course is dedicated to showing you exactly what separates a<strong style=\"\"> pro</strong> from an <strong style=\"\">amateur</strong>, the <strong style=\"\">settings</strong> they use and the <strong style=\"\">tricks</strong> to get that <strong style=\"\">perfect shot</strong>.  </p>  <p>  \t  This course is an <strong style=\"\">Amazon Best seller</strong> and also a <strong style=\"\">Udemy </strong>best selling course, we have helped thousands of people just like you to become <strong style=\"\">professional photographers</strong> and start to charge for your work. Think of the extra cash you can make in wedding photography, stock photographer and modelling portfolios.  </p>  <h5><strong style=\"\">So What will you learn in our Photography Course?</strong></h5>  <ul style=\"\">  \t<li>This complete SLR Digital Photography course has everything you need to start shooting quality professional photos in a few hours.</li>  \t<li>It’s complete with professional settings; find out how the pro’s set up their camera so you are shooting with exactly the same settings.</li>  \t<li>This course is suitable for all SLR camera models, Canon, Nikon, Sony ect..</li>  \t<li>The course encompasses these subjects delivered over DVD.</li>  \t<li>How to achieve those tack sharp photos</li>  \t<li>The fundamentals of a good shot, if you abide by these simple rules you will always have great shots.</li>  \t<li>How to reduce Camera Shake, (one of the biggest problems in photography</li>  \t<li>How to shoot in Raw</li>  \t<li>How to hold your camera properly to shoot handheld in low light situations.</li>  \t<li>How to compose your picture properly using the rule of thirds</li>  \t<li>How to compose using leading lines</li>  \t<li>ISO and which settings are best</li>  \t<li>Aperture how to use it properly to achieve professional results.</li>  \t<li>How professionals use cropping to improve their photos.</li>  \t<li>How to remove unwanted items from your photo.</li>  \t<li>Correct use of timers and remote controls.</li>  \t<li>Reflectors, how to use them to get that professional look in portraits.</li>  \t<li>How the pros use exposure bracketing to always get the right exposure</li>  \t<li>Using exposure compensation to get the right exposure in tricky situations.</li>  \t<li>Camera modes explained and how to use each one correctly.</li>  \t<li>Metering modes explained and how you can use them to make sure you always the perfect shot</li>  \t<li>How to frame your picture properly, filling the frame and using natural frames</li>  \t<li>How professionals use burst/continuous mode to always get that perfectly times shot.</li>  \t<li>Corrrect use of focus lock and its use in composition.</li>  \t<li>Proper settings for compression and quality</li>  \t<li>Camera sensors explained and which ones are best for landscape or portraits.</li>  \t<li>Noise and the best ways to reduce it</li>  \t<li>And much more…</li>  </ul>", 
    "end_date": null, 
    "title": "Learn Digital Photography, Canon , Nikon, Sony, Best Seller", 
    "price": "50.00", 
    "instructors": "Steven Riley", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/105708_742e_9.jpg", 
    "course_url": "https://www.udemy.com/the-complete-digital-photography-course-amazon-top-seller/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-14T14:17:46Z"
}