{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Have you been unhappy with the way your photographs look? Do you see other photographers work and wonder how they get the colors to look so good? This course will teach you how to get the color results you've always wanted with your photographs.</p><p>You will learn how color works within photoshop, the tools to master color correction and color editing, and how to implement this into your photographic editing workflow. <br></p><p>The course begins with an understanding of how color functions inside photoshop and then flows into how each of the most important tools work. Then I show you how I use these tools to edit my own photographs.</p><p>This course is essential for any photographer who wants to have great looking color photos.<br></p><p>I have been a successful photographer, retoucher, and full time color corrector for over 10 years.  I will teach you the tools you need to master color correction and color editing in an easy to understand way.</p><p><br></p><p>How color works within Photoshop</p><p>Essential color tools in Photoshop</p><p>Adjustment layers and how to use them in combination with each other to get the results you want.</p><p>How to achieve creative color looks for any photo situation.</p><p>Learn all the tools you need with examples in 2 hours!</p><p>See how I color edit my photos in real time.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Master Color Retouching in Photoshop", 
    "price": "30.00", 
    "instructors": "Greyson Collins", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582550_dafe_3.jpg", 
    "course_url": "https://www.udemy.com/master-color-retouching-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T23:02:39Z"
}