{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Let me show you how easy it is to get started with Adobe Lightroom. How simple and fast you can make your pictures perfect.<br></p><p>My\n Masterclass Fast Guide takes you step-by-step through all the basics \nand more. If you want some advanced stuff you'll get that, too.</p><p><strong>What are the requirements?</strong><br></p><ul><li>All you need to get started is to have a copy of Adobe Lightroom CC or 6 (5 is fine, too). </li><li>It doesn't matter if you're on a PC or Mac. </li><li>Also, having basic knowledge of your computer would be required so that you can save files and find them.</li></ul><p><strong>Is this course for me?</strong><br></p><p>This\n course is targeted towards beginners as well as users who have used Lightroom in the past but found it too complex and confusing and are \nlooking for an easier way to learn how to accomplish tasks using Adobe \nLightroom. You don't need any knowledge of Lightroom to start the \ncourse. I will explain everything as we move along the lessons.<br> </p><p>Choose how and where you want to learn. At home, in the garden, on your travels or in the office.</p><p><strong>What am I going to learn in this course?</strong></p><ul><li>Understanding how Lightroom works and where to store images</li><li>Importing Images</li><li>Cropping and Straightening Images</li><li>Best practices for developing images</li><li>How to edit/enhance images</li><li>Adjusting tonal range of images</li><li>How to create beautiful photo books</li></ul>The course will give you more confidence as a Lightroom user and will help <p>you become a Lightroom power user. Every lesson is a step-by-step process guiding you through complexities of image editing in Lightroom CC / Lightroom 6.</p>", 
    "end_date": null, 
    "title": "Master Lightroom in Easy Steps", 
    "price": "25.00", 
    "instructors": "Marek Mularczyk", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644140_97b8.jpg", 
    "course_url": "https://www.udemy.com/master-lightroom-in-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-18T20:51:40Z"
}