{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">This Adobe Lightroom training course from Camera Stupid is designed to get you started using Adobe Lightroom to organize, edit, and backup your photos as quickly as possible. Adobe Lightroom is a fantastic tool for amateur or professional photographers looking to streamline their workflow and produce professional photographic results for their clients or personal enjoyment. In this digital age, many photographers struggle to maintain the thousands of photos they take each month. Adobe Lightroom solves the problem of photo organization with a robust collection system and keyword tagging features. Never misplace a digital photo again!</p><p style=\"\">No prior Adobe Lightroom knowledge is required to benefit from this course. You can apply what you learn in this course to your existing workflow. This course is designed to get to the point quickly and clearly, giving you more time to do what you love. Each lesson is recorded in High Definition and allows students to follow along on the instructor's screen. </p><p style=\"\"><span style=\"\"></span>The training will begin by demonstrating the basic steps to import photos, group them into collections, and tag them with relevant keywords. The course will cover backup strategies and offer advice for keeping your photos secure. From there we will dive deeper into editing techniques, presets, tethering, tone curve, panoramas, and file formats. </p><p style=\"\">By the end of this video based training course on Adobe Lightroom you will be able to successfully manage your own growing photo portfolio using a tool that many photographers consider to be the industry standard. You'll be able to create and manage your own presets, and export them to share with friends or fellow photographers. You'll be able to apply non-destructive edits to your photos that will drastically improve them and get the look you desire. Most importantly, you'll be able to rest assured knowing that your photos are safe, organized, and accessible with just a keystroke. </p>", 
    "end_date": null, 
    "title": "Master Adobe Lightroom Fast", 
    "price": "20.00", 
    "instructors": "Mark Richardson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/448878_c3c4.jpg", 
    "course_url": "https://www.udemy.com/masterlightroomfast/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-16T21:03:13Z"
}