{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>  \t  Do you want to move from the automatic mode on your digital SLR camera but you a bit too nervous to take the big step to move into manual? Then this is your course. In this course you will <strong style=\"\">master the aperture mode on your digital SLR camera</strong> and you will learn everything that there is to learn about it.  </p>  <p>  \t  This course is taught in a <strong style=\"\">dynamic way, with exercises and quizzes</strong>, to make sure you find it informative but entertaining.  </p>  <p>  \t  This course explains step by step all the terms that you need to know to master the aperture mode. This is a great base to then move into more advanced modes.  </p>  <p>  \t<br style=\"\">  </p>  <p>  \t<strong style=\"\">You will be able to take the pictures that you really want </strong>and not the pictures that your camera decides to take. Have you ever wondered how other photographers manage to get big parts of the image out of focus? It is all about understanding the aperture of your camera, and that is exactly what this course is about.  </p>  <p>  \t  You may be wondering why you need a course on aperture. If you are just using the automatic mode all the time, but you would like to improve your pictures or have more control over the pictures you take, <strong style=\"\">the aperture mode is the best mode to have more control over your picture without having to go straight ahead to manual mode.</strong>  </p>  <p>  \t  Let’s say that you want to take a close up as you can see in this image, and you just want to have the front flower in focus and all the rest of flowers out of focus as you can see here. You try over and over again with the automatic mode but you can’t get it like that, well, the aperture mode will let you have control of what you have in focus and what you don’t want in focus. That is why it is so great to learn about this mode first of all and it’s the best mode to leave automatic at a side and if you don’t want to do the manual mode straight ahead, learning how to use the aperture mode is the best.  </p>  <p>  \t  In this course also you will learn about all those terms like f<strong style=\"\">-stop, or depth of field, aperture range,</strong> etc., that can be a bit confusing at first but that are necessary to keep improving as a photographer.  </p>  <p>  \t  So if you are a beginner and you have only been using the automatic mode, then this course is great for you because as I just said it will let you <strong style=\"\">be creative, be confident and to take control of the pictures you are taking.</strong>  </p>  <p>  \t  At the end of it you will be able to say that you are a master on the aperture mode.  </p>", 
    "end_date": null, 
    "title": "Master the Aperture Mode on your Digital SLR Camera", 
    "price": "20.00", 
    "instructors": "M2 Visuals", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412164_409d_2.jpg", 
    "course_url": "https://www.udemy.com/master-the-aperture-mode-on-your-digital-slr-camera/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T12:16:02Z"
}