{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong><u>*******FREE FOR LIMITED TIME ONLY************</u></strong></p><p><strong><u>PHOTO TO ANCIENT GRUNGY ART IN ADOBE PHOTOSHOP</u></strong></p>\n\n<p><strong></strong>\n\n  </p>\n\n\n\n<p>Welcome to the course <strong>‘Photo to Ancient Grungy Art in Adobe Photoshop for Beginners’</strong>\n\n  </p>\n\n\n\n<p><strong>DO YOU LOVE ART?</strong>\n\n  </p>\n\n\n\n<p><strong>DO YOU LOVE PHOTOSHOP EFFECT?</strong>\n\n  </p>\n\n\n\n<p><strong>DO YOU LOVE PAINTING EFFECT IN ADOBE PHOTOSHOP?</strong>\n\n  </p>\n\n\n\n<p><strong>DO YOU WANT TO TURN YOUR IMAGES INTO PIECE OF ART?</strong>\n\n  </p>\n\n\n\n<p><strong>DO YOU WANT TO LEARN THE ART OF TRANSFORMING SIMPLE IMAGES INTO STUNNING ARTWORK?</strong>\n\n  </p>\n\n\n\n<p><strong>DO YOU WAN TO GIVE YOUR IMAGES A NEW ARTISTIC LOOK?</strong>\n\n  </p>\n\n\n\n<p>IF ANSWER TO ANY OF THE ABOVE QUESTION IS <strong>‘YES’, </strong>THEN YOU ARE AT THE RIGHT PLACE!\n\n  </p>\n\n\n\n\n\n<p><strong>WHAT AM I GOING TO LEARN IN THIS COURSE?</strong>\n\n  </p>\n\n\n\n<p>In this COURSE You are going to Learn:-\n\n  </p>\n\n\n\n<p>·        THE COMPLETE AND EASY PROCESS TO TURN YOUR IMAGES IN STUNNING ART WORK IN ADOBE PHOTOSHOP\n\n  </p>\n\n\n\n<p>·        HOW TO TURN SIMPLE IMAGES INTO PENCIL SKETCH IN ADOBE PHOTOSHOP USING SIMPLE METHODS?\n\n  </p>\n\n\n\n<p>·        HOW TO ADD OR BLEND TEXTURE TO THE IMAGES IN ADOBE PHOTOSHOP?\n\n  </p>\n\n\n\n<p>·        HOW TO COLOUR TONE YOUR IMAGES IN ADOBE PHOTOSHOP?\n\n  </p>\n\n\n\n<p>·        HOW TO COLOUR GRADE YOUR IMAGES IN ADOBE PHOTOSHOP-SIMPLE AND FAST TECHNIQUE?\n\n  </p>\n\n\n\n<p>·        HOW TO ADD EXTRA DEPTH &amp; DETAILS TO YOUR IMAGES IN ADOBE PHOTOSHOP?\n\n  </p>\n\n\n\n<p>·        HOW TO CREATE ART EFFECT MOCK-UP IN ADOBE PHOTOSHOP-TO CHANGE THE ORDINARY IMAGES INTO ARTISTIC WORK?\n\n  </p>\n\n\n\n<p>These techniques are not only helpful for creating STUNNING FINE ART IMAGES in Adobe Photoshop but also useful for any kind of POST-PROCESSING OR EDITING WORKFLOW.\n\n  </p>\n\n\n\n\n\n<p>This is a FUN PROJECT based COURSE which is divided into BITE-SIZE lectures which are easy to DIGEST &amp; UNDERSTAND!\n\n  </p>\n\n\n\n\n\n<p><strong>WHAT ARE THE REQUIREMENTS?</strong>\n\n  </p>\n\n\n\n<p>·        YOU NEED TO HAVE ADOBE PHOTOSHOP INSTALLED ON YOUR PC\n\n  </p>\n\n\n\n<p>·        YOU NEED TO HAVE LITTLE-BIT KNOWLEDGE OF ADOBE PHOTOSHOP\n\n  </p>\n\n\n\n<p>·        EVEN IF YOU DON’T HAVE PREVIOUS KNOWLEDGE OF ADOBE PHOTOSHOP, YOU CAN EASILY FOLLOW THE COURSE AS I HAVE EXPLAINED EACH AND EVERYTHING \n\n  </p>\n\n\n\n\n\n<p><strong>WHAT AM I GETTING WITH THIS COURSE?</strong>\n\n  </p>\n\n\n\n<p>·        7 FULL HD LECTURES\n\n  </p>\n\n\n\n<p>·        EASY TO FOLLOW WITH ZOOM-IN EFFECT SO THAT YOU DON’T MISS ANYTHING\n\n  </p>\n\n\n\n<p>·        ALL THE KEYBOARD SHORTCUTS PROVIDED TO SPEED UP YOUR WORKFLOW NOT JUST FOR THIS COURSE BUT ALSO FOR FUTURE EDITING WORK IN ADOBE PHOTOSHOP\n\n  </p>\n\n\n\n<p>·        PREMIUM ACCESS TO THE ASSETS FILE\n\n  </p>\n\n\n\n\n\n<p><strong>WHAT IF I HAVE A QUESTION?</strong>\n\n  </p>\n\n\n\n<p>·        SINCE YOU ARE GETTING EXPERT SUPPORT WITH THIS COURSE \n\n  </p>\n\n\n\n<p>·        YOU CAN ASK THE QUESTION ANYTIME DURING OR AFTER THE COURSE WHICH COMES TO YOUR MIND\n\n  </p>\n\n\n\n<p>·        I GUARANTEE TO ANSWER YOUR QUESTION RELATED TO THE COURSE\n\n  </p>\n\n\n\n\n\n<p><strong>WHAT IF I DON’T LIKE THE COURSE?</strong>\n\n  </p>\n\n\n\n<p>·        SINCE THIS COURSE COMES WITH 30 DAYS MONEY BACK GUARANTEE \n\n  </p>\n\n\n\n<p>·        YOU CAN ALWAYS CLAIM BACK YOUR 100% MONEY WITHIN FIRST 30 DAYS OF JOINING THE CURSE\n\n  </p>\n\n\n\n<p>·        NO QUESTION WOULD BE ASKED\n\n  </p>\n\n\n\n<p>·        WHICH MEANS YOU HAVE ZERO RISK TRYING THIS COURSE\n\n  </p>\n\n<p>GO AHEAD AND JOIN THIS COURSE NOW! </p>\n\n<p>I WILL SEE YOU INSIDE THE COURSE!</p>", 
    "end_date": null, 
    "title": "Photoshop-Photo to Ancient Grungy Art in Photoshop", 
    "price": "25.00", 
    "instructors": "Harsh Vardhan", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/872472_8233_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-photo-to-ancient-grungy-art-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-08T15:56:10Z"
}