{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Photography Course </strong></p><p>Shoot your DSLR in manual mode like a professional photographer - improve your photography fast!</p><p><strong>Who Is In Control Of Your Photography?<em></em></strong></p><p>Did you know that your dslr camera is in charge of your photography?</p><p>That a little chip inside that camera is replacing your brain?</p><p>And it is preventing you becoming a better photographer?</p><p><strong>The Best Photographers Shoot In Manual Mode</strong></p><p>And this is also the skill that most casual photographers never learn.</p><p>What if you could control the camera, rather than leaving it in auto mode?</p><p>What if you could use your camera like a professional photographer does?</p><p><strong>Becoming A Better Photographer</strong></p><p><strong></strong>Relying on the camera to set exposure will mean you will never become a good photographer.</p><p>Mastering manual mode will open up a world of amazing image opportunities that will impress your friends and family.</p><p><strong>What You Will Learn In This Photography Course</strong></p><p>In this course we will teach you how to master your camera in a simple and easy to understand manner.</p><p>We will show you how to use your camera like the professionals and improve your photography. </p><p><strong>100% Money Back Guarantee</strong></p><p><strong></strong>Remember, if you are not happy with the course for any reason, you can get your money back in the first 30 days, no questions.</p><p><strong>What the course will cover:</strong></p><ul><li>Finding your exposure using the built in light meter</li><li>How the histogram works</li><li>How to use the blinkies</li><li>The exposure triangle</li><li>Understanding stops of light</li><li>ISO, shutter speed and aperture</li><li>Lens recommendations</li></ul><p><strong>Who Is This Course For?</strong></p><p>Have you purchased a DSLR lately and want to learn how to use it like a professional photographer?</p><p>Have you wondered what the manual mode does?</p><p>Do you want to deepen your understanding of photography?</p><p>Then this course is for you.</p><p>Please note, this is a beginners course and suitable for new photographers.</p><p>This is not suitable for experienced amateur photographers.</p><p><strong>Join us…</strong></p>So join us on the other side and learn how to take control of your DSLR camera and take images like the professionals!", 
    "end_date": null, 
    "title": "Photography - Photography DSLR Skills", 
    "price": "20.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/557104_0016_5.jpg", 
    "course_url": "https://www.udemy.com/understanding_exposure_using_manual_mode_dslr/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T11:35:15Z"
}