{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">Being a photographer is more than taking great photos. It is editing photos in such a way that your family members (or your paying clients) are amazed at how you can get group shots so perfect. This course gives you opportunities to make extra money (or impress the socks off people) by doing swaps. The author of the course, Dr. Dave Harris, has been photographing groups for more than 10 years and uses the art of the swap to earn extra money by charging a premium for each one. Families love perfect group pictures, and this course teaches you how to make perfect group photos.</p><p style=\"\">This course will teach you how to edit images of groups so that the best shot of each individual in the group is used in the finished image. The course teaches eye, head, and body swaps. Using the swapping techniques, you can change reality and make each shot perfect.</p><p style=\"\">This course uses Photoshop and is for students who have a working knowledge of opening photos in Photoshop. At the end of this course, you will make some magic with these photos.</p><p style=\"\">The course teaches the basics of swapping by doing an eye swap. It then progresses from a head swap to a far more advanced body swap that requires rebuilding portions of the subject&#039;s arm in order to pull off the swap. You will literally be rebuilding someone&#039;s body.</p><p style=\"\">The course then moves into teaching how to color correct and highlight photos for rich color reproduction at the printer. Finally, it focuses on cropping and rebuilding missing image areas to pull off the perfect crop.</p><p style=\"\">As a bonus, the course includes instructions for making a custom collage. These collages have been used to make more money after the shoot using just an hour&#039;s worth of work in the edit.</p>", 
    "end_date": null, 
    "title": "Photoshop Magic: Changing Reality in Your Photos", 
    "price": "20.00", 
    "instructors": "Dr. Dave Harris", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441660_42ac.jpg", 
    "course_url": "https://www.udemy.com/photoshop-magic-changing-reality-in-your-photos/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T02:43:16Z"
}