{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\">** Voted by students as one of Udemy&#039;s outstanding instructors of 2014 **<br style=\"\"></strong></p><p style=\"\"><strong style=\"\"><em style=\"\">&#039;Bernie does it again&#039;</em></strong><br style=\"\"><em style=\"\">... another brilliant course by one of the very best instructors on Udemy. </em>(thanks Marie)</p><p style=\"\"><strong style=\"\"><em style=\"\">&#039;Worthy of Ten Stars&#039;</em> </strong>(thanks Diane)</p><p style=\"\">  \t            Learn the fundamental principles and advanced concepts of using off-camera flash to take stunning portraits. This is a very comprehensive, practical photography course that covers everything you need to know.</p><p style=\"\">Just because there is enough light in a room or outside to take a photo, doesn&#039;t mean that it&#039;s great light....  </p>  <p style=\"\">  \t<strong style=\"\">Learn how to create beautiful light using small flashes.</strong>  </p>  <ul style=\"\">  \t<li>Follow me on 19 photo shoots, indoors and out</li><li>Take stunning images on a small budget and in a small room.</li>  \t<li>Learn the easy steps to getting your flash off your camera</li>  \t<li>Discover the inexpensive equipment you need, with links to the gear</li>  \t<li>Learn what modifiers do, and how they can make a significant difference.</li>  \t<li>Understand the various triggering methods and which one suits you best</li>  \t<li>Learn and understand the 5 aspects of off camera flash exposure</li>  \t<li>Understand why Manual mode is best, and what makes it so easy</li>  \t<li>Learn advance techniques, controlling backgrounds / multiple flashes / gels / light patterns / balancing ambient and flash light etc...</li><li>Learn how High Speed Sync and ND filters can help to get better backgrounds outside</li>  \t<li>Everything explained in detail, with a fun teaching style</li>  \t<li>Be amazed at the results from my &#039;bonus&#039; product photo shoot using a DIY box<br style=\"\"></li></ul><p><strong style=\"\">A powerful skill at your fingertips</strong>  </p>  <p>  \t          Advanced and professional photographers do not generally use any of the semi-automatic modes (e.g Aperture / Shutter Speed priority etc..) when shooting in a studio environment. This course will demonstrate why, and show you just how easy it is to use Manual modes for consistent exposures and how it can aid the learning process.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview  - </strong><strong style=\"\"><span>Downloads are ENABLED for this course!</span></strong></p>  <p style=\"\">  \t        The course goes right back to basics, but also covers advanced topics. You&#039;ll learn about the equipment, what to buy and what not to buy if on a tight budget. It demonstrates how to put the gear together, how to modify it, and shows various ways of triggering the flashes, Exposure is covered in great details, with one video on each of the 5 aspects of exposure.  </p>  <p style=\"\">  \t        Come with me on these photo sessions, and watch as I talk through the camera and flash settings and take (mostly) great photos with (mostly) gorgeous models, using a fun teaching style.  </p>  <p style=\"\">  \t<strong style=\"\">A bonus video on product photography is included, a DIY setup that can provide spectacular results.  Great for eBay or just making some money on the side.</strong>  </p>  <p style=\"\">  \t      Designed for beginners (although not complete beginners), through to enthusiasts and professionals, on completing this course you&#039;ll have the knowledge and confidence to start taking beautifully lit portraits that will wow your family and friends.</p><p style=\"\"><strong style=\"\">This is a brand new course so not many reviews yet<br style=\"\"></strong>Modesty almost forbids me publishing some comments about my teaching style, taken from reviews of my other two courses, but I overcame that, so here they are:-</p><p style=\"\"><em style=\"\">Bernie is really easy to listen to, and his videos were really entertaining and kept you listening. (I also like his accent!)<br style=\"\"></em></p><p><em style=\"\">Many online courses suffer from over prepared, monotonic boring voice overs but Bernie&#039;s style is a bit like having your mate round to show you how to do something. This even goes to leaving some bloopers in which makes it human and fun. </em></p><p><em style=\"\">Bernie is a hoot! He knows his material, presents it well, and is witty to boot. It&#039;s a great combination in a teacher.</em></p><p><em style=\"\">I love Bernie&#039;s approach. Such a great instructor,</em></p><p><em style=\"\">Bernie is an excellent teacher and his enthusiasm for photography is contagious. </em></p><p><em style=\"\">Bernie  is a fantastic tutor, </em></p><p><em style=\"\">Love it, love it, love it!!</em></p>", 
    "end_date": null, 
    "title": "Photography - The Ultimate Guide to Using Off-Camera Flash", 
    "price": "20.00", 
    "instructors": "Bernie Raffe AMPA", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419262_f69b_5.jpg", 
    "course_url": "https://www.udemy.com/photography-off-camera-flash-using-speedlights/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T13:56:02Z"
}