{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\"> <em style=\"\">*** In 2013 CBS Miami voted Crea8fotos (my company) as best photo class in South Florida***</em><br style=\"\"></strong></p><p style=\"\"><strong style=\"\">Why take this course?</strong></p><p style=\"\">Are you a photo enthusiast who has just upgraded to a DSLR camera? Are you a mom or dad with a new family member; who wants to document your family life? Is photography a new hobby?</p><p style=\"\">Are you using photography for your social media campaigns or for your business? Do you want to learn how to use your camera in the manual mode to get better photos? </p><p style=\"\"><strong style=\"\">If you have a DSLR camera and are wondering which button to press and what that dial does… This course is for you. </strong></p><ul style=\"\"><li>Lets demystify the manual mode! You will learn step by step how to start a photo shoot using the manual mode.</li><li>Learn about exposure and how to tweak the exposure.</li><li>You will learn how to enhance a person or an object by using the shallow depth of field technique.</li><li>You will learn how to create unique photos about movement: Learn how to control motion by doing panning, blurring and freezing motion.</li><li>Change the mood and the environment will change too: You will learn how to use the white balance to add an atmosphere to your photos and to correct the color of light.</li><li>Learn how to make your images more dynamic by using 3 different composition techniques.</li><li>Upon completing the course you will create a photo portfolio.</li></ul><p style=\"\"><strong style=\"\">How long is this course?</strong></p><p style=\"\">The videos will take a bit over 1 hour to watch. It will take longer to do the photography exercises. Watch the video and then duplicate what you see. </p><p style=\"\"><strong style=\"\">What will I get from this course?</strong></p><ul style=\"\"><li>How to use the important features in the camera so that you can photograph in the manual mode with confidence.</li><li>How to use color, lines and composition techniques to create unique compositions.</li><li>How to create your own unique photo style.</li><li>How to create a photography project.</li></ul>", 
    "end_date": null, 
    "title": "Photography: Learn how to use your camera in the Manual Mode", 
    "price": "20.00", 
    "instructors": "Marguerite Beaty", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465080_d0bb_2.jpg", 
    "course_url": "https://www.udemy.com/photography-create-exceptional-photos-learn-manual-mode/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T15:38:20Z"
}