{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong><em class=\"redactor-inline-converted\">'These courses are among the best values in Udemy'</em></strong> - Don</p>\n\n<p> <strong><em class=\"redactor-inline-converted\">'I guarantee that you will go over this course again and again as you progress and each time you do you'll get more and more out of it. Thank you Bernie.' </em></strong>- Stephen</p>\n\n\n\n<p><strong><em>'This is a fantastic course filled with so much useful information. I am a big fan of Bernie's and he sure came through with this course. You won't be disappointed.'</em></strong> - Diane</p><p><strong>_________________________________________________________________________</strong></p>\n\n\n\n<p>  \t              Today's DSLR and Mirrorless cameras are fantastic aren't they?  </p>\n\n\n\n<p>  \t<strong>The great thing is... </strong><em class=\"redactor-inline-converted\">they have an enormous number of features and settings<br></em><strong>The problem is.........</strong><em class=\"redactor-inline-converted\">they have an enormous number of features and settings!!</em></p>\n\n\n\n<p>  \t             And it is a problem, because although there are some real hidden gems amongst all those features, they can seem confusing or intimidating, and so a lot of photographers simply ignore or shy away from them (you know who you are!!)  </p>\n\n\n\n<p>  \t            This course, aimed at beginner and intermediate photographers, covers DSLR and Mirrorless basic settings, but also explains your camera's more advanced features and settings. You probably already know about some of these settings but not entirely sure how and when to use them, and there may even be some that you're not even aware of!  </p>\n\n\n\n<ul>  \t<em class=\"redactor-inline-converted\">  \t<li>Watch photos being taken and compared using different settings</li>  \t<li>Real life examples filmed in the real world</li>  \t<li>Clear, concise and effective photography training that works</li>  \t<li>See immediate improvements in your photos</li>  \t<li>Easy to follow and understand, with a fun teaching style</li>  \t<li>All boring bits removed (well, most of them anyway!)</li>  \t</em>  </ul>\n\n\n\n<p>  \t             Here are just some of the topics covered in this course, new ones will be added over the next few months:-  \t  \t<strong>Basic settings:-</strong>  </p>\n\n\n\n<ul>  \t<li>Learn about the Exposure Triangle</li>  \t<li>Understand the difference between exposure modes, Aperture / Shutter Speed priority etc..</li>  \t<li>Learn when and how to use Exposure Compensation</li>  \t<li>Tips for getting tack sharp images of stationary subjects</li>  \t<li>Learn about White Balance and how to get better colours</li>  </ul>\n\n\n\n<p>  \t<strong>More advanced settings:-</strong>  </p>\n\n\n\n<ul>  \t<li>Understand depth-of-field and give your images that wow factor</li>  \t<li>When and how to use the Evaluative, Spot and Center Weighted Metering, and which is best?</li>  \t<li>How to take sharp images of moving subjects</li>  \t<li>Understanding Histograms</li>  \t<li>What's the difference between Full Auto and the 'P' mode?</li>  \t<li>Understand the advantages of full Manual exposure mode</li>  \t<li>Learn about Auto ISO and an exciting new exposure mode.</li>  \t<li>RAW vs JPG, which is best, and which one should you be using?</li>  \t<li>... and more</li>  </ul>\n\n\n\n<p>  \t<strong>Real World Settings:-</strong>  </p>\n\n\n\n<ul>  \t<li>Best settings for photographing inside a church or cathedral</li>  \t<li>Best settings for natural light portraiture</li>  \t<li>Best settings for landscape photography (walkthrough with Colin Mill)</li>  </ul>\n\n\n\n<p>  \t<strong>Flash Settings:-</strong>  </p>\n\n\n\n<ul>  \t<li> Learn the best basic flash settings to use</li>  \t<li> When and how to use fill flash?</li>  \t<li> Understand your flash max sync speed with this great shutter animation.</li>  \t<li>Flash 'High Speed Sync', learn how this incredible feature can help you.</li>  </ul>\n\n\n\n<p>  \t<strong>Important</strong> please note that for completeness,about half a dozen lectures are repeated from the Part I course, mainly the ones on 'Basic Settings'. This is so that students only taking this course still have access to those videos.</p>", 
    "end_date": null, 
    "title": "Photography - Become a Better Photographer - Part II", 
    "price": "20.00", 
    "instructors": "Bernie Raffe AMPA", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65809_6a05_7.jpg", 
    "course_url": "https://www.udemy.com/ultimate-guide-to-dslr-camera-settings/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-16T07:44:31Z"
}