{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Master a Professional Portrait Photography Method In This Comprehensive Portrait Photo Course.</strong><br></p>\n\n\n\n\n\n<ul><li>Build hundreds of photo poses from memory</li><li>Discover great portrait light with ease</li><li>Master professional photo editing</li><li>Find your creativity as a photographer and artist</li></ul>\n\n\n\n\n\n\n\n<p><strong>Professional tips and tricks to improve your photography</strong></p>\n\n\n\n\n\n\n\n<p>Learning the foundations of portrait photography from this course.  This training will put a powerful and very useful skill at your fingertips.  Portraits have been one of the most enduring disciplines of photography and one of the most powerful.</p>\n\n\n\n\n\n\n\n<p>Being a skilled portrait photographer (and there really aren't many of them out there) opens many doors.  Freelance portrait photography and wedding photography are prime jobs for a talented portrait photographer.</p>\n\n\n\n\n\n\n\n<p><strong>Photography Class Content and Overview</strong></p>\n\n\n\n\n\n\n\n<p>Suitable for beginners and intermediate photographers, in this course of over 130 lectures and 12 hours you'll learn the fundamentals of portrait photography and portrait photography editing.  You'll build a strong foundation as a photographer that you can use to break into other disciplines of photography such as street photography or wedding photography.  </p>\n\n\n\n\n\n\n\n<p>Starting with a practical application section of lighting, posing, editing, and working with clients, you'll move to key theory lessons and some practical experiences from the field.</p>\n\n\n\n\n\n\n\n<p>With these basics mastered we'll also explore sunset portraits, some studio lighting, and backlit silhouettes so you can build variety into your portfolio.</p>\n\n\n\n\n\n\n\n<p><strong><em>You will have the skills to setup, shoot, edit, and professionally deliver portraits when the course is complete photography class.</em></strong></p>\n\n\n\n\n\n\n\n<p>Then, put your skills to use as we enjoy a monthly photo contest where you can enjoy other students work, learn from their images, ask questions, and have a chance to win your first photo contest while you cheer on your fellow students.</p>\n\n\n\n\n\n\n\n<p>Complete with over 300 sample images that clearly show shutter speed, aperture, and ISO you can work alongside the instructor as you earn your verifiable certificate of completion.  </p>\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n<p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Photography: Knockout Portraits and Inspired Art!", 
    "price": "30.00", 
    "instructors": "Jon Haase", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/309908_dc4e_18.jpg", 
    "course_url": "https://www.udemy.com/photography-posing/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-29T09:31:25Z"
}