{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong></p><p style=\"\">This course starts with an introduction into what Layers are in Photoshop Elements and how they work. You&#039;ll discover that you can actually understand Layers even if they&#039;ve always been a complete mystery to you.</p><p style=\"\"><strong style=\"\">Master the Use of Layers in Photoshop Elements from the Clear Explanations and Presentations provided in this Course.</strong></p><ul style=\"\"> <li style=\"\">Simple descriptions of all the ins-and-outs of Layers</li> <li style=\"\">How to use <strong style=\"\">Layer Styles</strong> to achieve special effects</li> <li style=\"\">What <strong style=\"\">Layer Masks</strong> are and how to use them</li> <li style=\"\">What <strong style=\"\">Adjustment Layers</strong> are and how to use them</li> <li style=\"\">How to <strong style=\"\">Save</strong> Layered files</li> </ul><p style=\"\"><strong style=\"\">At Last You Can Have a Complete Understanding of How, When, and Why to Use Layers in PS Elements!</strong></p><p style=\"\">Layers are the heart of Photoshop Elements. A full understanding of Layers is the cornerstone for achieving exceptional results with your digital photos. Layers are used for everything in PS Elements from non-destructive photo editing to making composite photos.</p><p style=\"\">Layers allow your creative ideas to flow freely by giving you the ability to try different ideas. Put each idea on a separate Layer and you can compare or combine items in multiple ways. Knowing how to use Layers will definitely bring your abilities in PS Elements to the next level.</p><p style=\"\"><strong style=\"\">Content and Overview </strong></p><p style=\"\">I&#039;ll give you clear explanations for all the different functions of Layers one-by-one and show you exactly how they work. Once you know how to use Layers, you&#039;ll be able to achieve much more in Photoshop Elements.</p><p style=\"\">Each of the short lectures is packed with valuable information that will deepen your understanding of how to use Layers. You&#039;ll bring your skills to a whole new level as you eliminate the frustration of not knowing how to work with Layers.</p><p style=\"\">You have the opportunity to gain mastery over Photoshop Elements by breaking through this barrier and becoming proficient at using Layers. You&#039;ll know how to use what I believe is <strong style=\"\">the one thing you must grasp</strong> to use PS Elements to its potential.</p><p style=\"\">In preparing for this course I asked my audience what they most wanted to know about Layers. I received hundreds of replies. Their questions became the basis for what to include in this course. Many admitted that they didn&#039;t know enough about Layers to even ask questions. They just wanted to start at the beginning and have Layers explained in an easy-to-understand, detailed format.</p><p style=\"\">I present the material in a manner that people tell me again and again they find most helpful. That includes not going too fast, giving simple explanations using everyday language, not assuming prior knowledge, and clearly showing what to do.</p><p style=\"\">By the end of this course you&#039;ll know how to use Layers with confidence. You won&#039;t have to wonder if you&#039;re doing it the best way or what to do to get the results you want.</p><p style=\"\">Start now to break through the feelings of doubt and uncertainty that are common when you don&#039;t understand how to navigate Photoshop Elements. Layers are the key to using Elements to its full capacity and mastering Layers will help to eliminate much of your confusion and frustration.</p><p style=\"\"><strong style=\"\">What are the requirements?</strong></p><ul style=\"\"> <li style=\"\">A copy of Photoshop Elements software installed on your computer. For this course I use PSE 13. If you have PSE 11 or newer, the interface will look the same. To get the most from this course you should be using PSE 9 or newer.</li> </ul><p style=\"\"><strong style=\"\">What will you get from this course?</strong></p><ul style=\"\"> <li style=\"\">Over 30 lectures and 4 hours of content.</li> </ul><p style=\"\"><strong style=\"\">Who is the target audience?</strong></p><ul style=\"\"> <li style=\"\">Photoshop Elements users who want to understand how to use Layers.</li> <li style=\"\">Basic enough for beginners but complete enough to fill in any gaps for experienced users</li></ul>", 
    "end_date": null, 
    "title": "The Essential Guide To Photoshop Elements Layers", 
    "price": "30.00", 
    "instructors": "Rick Peterson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483372_cad2.jpg", 
    "course_url": "https://www.udemy.com/the-essential-guide-to-photoshop-elements-layers/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T15:42:07Z"
}