{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Approach Model Photography With Confidence.</strong></p><p>Join photographer and brand expert Corey Reese for an introduction to creating, running, and growing a successful photography career working with On Camera Talent.</p><p>Throughout this class, Corey will break down the process of starting and running a successful photography business working with talent into clear, simple steps. You’ll develop a foundation for your business based on your unique skill set, values, and vision as a photographer. Corey will guide you through each stage of an effective photoshoot with a prospective client and teach you how to approach the photoshoot with confidence. He’ll also show you how to maximize your profit with effective marketing strategies. You’ll learn about the importance of a personal website, social media and create marketing strategies for attracting and keeping the right clients engaged with your brand.</p><p>Whether you’re just beginning to approach model photography as a career or a long-time professional photographer that has never worked much with on camera talent, you’ll come away from this course with the inspiration and knowledge to create a business that’s just dynamic as what you imagined! </p><p><strong>Contents and Overview</strong></p><p>This course is aimed at teaching photographers what it takes to perfect working with Models. </p><p>You'll start with the Pre-Production Planning Process, Putting together Concepts for the Shoot, learning how to decide the equipment you'll need for accomplishing your goals. You'll then dive into the tools working with a virtual studio, learning your way around the flash. </p><p>You'll learn about finding a team Models, Makeup Artist, Wardrobe Stylist for Free to work with. You'll go live on set to complete photo shoot and learn how to communicate with the talent. </p><p>So that you can book paying jobs, you'll learn how to brand yourself, create a portfolio and website, and find interested people that want to work with you. By the end of this course, your confidence as a photographer will be on another level because your knowledgeable on the process to create success.</p><p><strong><em></em></strong></p><p><strong>What are the requirements?</strong></p><ul> <li>No fancy camera is required, but some sort of camera would help you learn.</li> <li>A computer is also ideal if you want to follow along using Adobe Lightroom, Photoshop, and Set-A-Light 3d Virtual Studio. Free trials are okay to follow along.</li> <li>Students need to be excited about learning the process of creating great photography, which will help in being able to execute idea's form start to finish. </li> </ul><p><strong>What am I going to get from this course?</strong></p><ul> <li>Over 25 lectures and 2 hours of content!</li> <li>Students will know the key to great photo's starts within</li> <li>Students will know how to plan concepts</li> <li>Students will know how to photograph and work with talent</li> <li>Students will know how to market themselves</li> <li>Students will have better understanding of lighting</li> <li>Students will know how to use basic flash</li> <li>Students will know how to chose the correct lens for the job</li> <li>Students will know how to light their subjects</li> </ul><p><strong>What is the target audience?</strong></p><ul> <li>This course is for Photographers who want to become a skilled at working with On Camera Talent. </li> </ul>", 
    "end_date": null, 
    "title": "The Art and Business of Model Photography", 
    "price": "20.00", 
    "instructors": "Corey Reese", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571854_f55a_10.jpg", 
    "course_url": "https://www.udemy.com/dslr-photography-modelshoot-101/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T20:44:24Z"
}