{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><b>Using Your GoPro Hero3+: Learn to Shoot Better Photos and Videos</b> is an instructional video course that introduces viewers to the power, capabilities and versatility of the GoPro Hero3+ camera. Photographer and author, Jason R. Rich, explains exactly how to set up and use the GoPro Hero3+, offers easy-to-implement photography strategies for shooting in a wide range of situations, plus explains how to transfer, edit, enhance and share images and videos shot using the camera. This course also offers tips for selecting, and then using, many of the most popular mounts and accessories available for the GoPro Hero3+ camera. As explained within this video, mounts and accessories help the user overcome various obstacles when shooting in low-light, underwater, or in otherwise less than optimal shooting conditions.</p>This course also teaches the GoPro Hero3+ user how to achieve visually stunning results when shooting people, landscapes or things, or in high-action activity situations, plus take full advantage of the camera's built-in shooting modes. The GoPro Hero3+ camera is powerful and versatile, but there is a learning curve for discovering how to use it, even if someone is already an accomplished photographer. Thus, this instructional video helps the viewer shorten this learning curve, and discover how to get the most out of this camera in the fastest, most easy-to-understand, and least technical way possible. Throughout the video are sample images and short video clips (shot using a GoPro) to show the viewer exactly what this camera is capable of. Screen shots from the GoPro app and software, as well as third-party photo and video editing apps and software, are demonstrated to emphasize useful tips for taking, editing and sharing awesome looking photos or videos.<p><b>Author Bio</b>Jason R. Rich is the author of more than 55 books, as well as a frequent contributor to numerous national magazines, major daily newspapers and popular websites. He's also an accomplished photographer.  He also frequently lectures about digital photography and teaches photography workshops aboard Royal Caribbean, Princess Cruise Lines, Celebrity Cruise Lines and Norwegian Cruise Lines cruise ships, as well as through several Adult Education programs in New England. In addition to his photography being featured within his books and articles, he also shoots portfolios and headshots for well-known actors and models, plus specializes in event, travel and animal photography. </p>", 
    "end_date": null, 
    "title": "Using Your GoPro Hero3+ ", 
    "price": "30.00", 
    "instructors": "QUE Videos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/583010_1966_2.jpg", 
    "course_url": "https://www.udemy.com/using-your-gopro-hero3/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T12:56:26Z"
}