{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Do you take tons of photos on vacation, family events etc. and find that you're still unhappy with the photographs you've taken?  </p>  <p>  \t      It's very simple to see why using a flash during the day can make for a much better photograph.  It's also wonderful to understand what it means to create a great composition using the Rule of Thirds.  Also, are you really using your Zoom lens correctly to keep objects or people in perspective?  </p>  <p>  \t      There is so much more to your camera. Get off the Auto-Mode and free yourself to a more creative adventure in photography. This course was created from the ground up, for the beginner who wants to know the real fundamentals, of what it means to think like a photographer.  </p>  <p>  \t      Digital 1 to 1 is for anyone wanting to create a better photograph. We offer easy to follow video-lectures, letting you take creative control of your camera, and to feel proud of your photographs. Our goal is to help you gain \"confidence\" with you camera and your photography; becoming more consistent with your creativity. We guarantee your next level to move forward, as a photographer.  </p>  <p>  \t<em>- Digital 1 to 1 is Ken Pivak and Santino Zafarana, who are two seasoned veterans in both the commercial photographic industry and as educators.  Their expert knowledge of over 30 years experience each, will help you expand your abilities in becoming a better, and more accomplished photographer.</em>  </p>      Here's what a few are saying about Digital 1 to 1:  <p>  \t      \"Digital 1 to 1 - Putting an End to Bad Photos!\"  </p>  <p>  \t<em>- Mike McEnaney - CES/Editor TELL Magazine/TechnologyTell [dot com]</em>  </p>  <p>  \t      \"First of all, these tutorials are terrific!  Plus it is even MORE fun for me to see you both, \"appearing as yourselves\", in giving instructions and lessons.  I have enjoyed photography as a simple hobby for 60 years beginning with a pinhole camera as a pre-teen and now using digital cameras. The only time that photography was not solely a hobby for me was during the two space missions I made in the early 1980's aboard Shuttle Spacecraft when I served the role of \"ship's photographer\". With luck, two of my photographs from these journeys appeared on the covers of national magazines.  But all of my photos would have been far better, had I had access to your photo tutorials.\"  </p>  <p>  \t<em> - Joe Allen - Apollo Mission Control Capcom-1970's and Space Shuttle Astronaut-1980's (NASA) / Ship Photographer</em>  </p>  <p>  \t      \"Digital 1 to 1 simply GREAT!!!!! I have improved so much, that I am feeling like a professional photographer. Now, I am always using my Manual-Mode instead of Auto just as the \"Photo Guys\" suggested and this has helped me a lot. My husband and friends are always complementing my pictures, and they are so much clearer than before. THANK YOU!! MERCI!! GRACIAS!!!\"  </p>  <p>  \t<em> - Patricia Patron - Digital 1 to 1 member</em>  </p>  <p>  \t      \"Digital 1 to 1 answers most - if not all - of the questions I get asked nearly every day. We all start somewhere, and I can't think of a better place to learn the basics. Even as a lecturer, I've found these tutorials to be informative and helpful. It's one thing to know the information; it's another thing altogether to teach it. There are lots of sites where pros can go to learn about the latest techniques or the latest gear, but Digital 1 to 1 is the only one I know that begins with basic concepts and takes you to the next level. Whether it's an iPhone, a point-and-shoot, or a more advanced digital camera, this is the go-to site that keeps it simple, so you don't have to look through a hundred page manual.\"  </p>  <p>  \t       - Eric Meola / Photographer, Lecturer, Author and Canon Explorer of Light  </p>  <p>  \t      \"I'm thrilled to have discovered Digital 1 to 1! I've never been one to take pictures due to a lack of technical know-how. Each of their how-to videos demystifies and has built my confidence in the process. They've inspired me to carry my camera with me wherever I go, and I'm capturing more of life's moments. I'm really looking forward to applying what I've learned on an up coming trip on Safari!\"  </p>  <p>  \t       - Lisa Rogerson - Digital 1 to 1 member  </p>  <p>  \t      \"I love photography, and love to create images where I can make everyone look as beautiful as possible. I had given up traveling with my larger cameras, since I got my cool point and shoot Cannon 850SD. I love Digital 1 to 1's easy to understand and \"user friendly\" tips. These guys are especially fun to watch, and remind me of my cousin in New York. I love getting such useful information on quick segments.\"  </p>  <p>  \t       - Caara Shayne / Actress - Los Angeles  </p>", 
    "end_date": null, 
    "title": "We Help Ordinary People Take Extraordinary Pictures", 
    "price": "50.00", 
    "instructors": "Digital 1 to 1", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/66374_b298_6.jpg", 
    "course_url": "https://www.udemy.com/digital1to1/", 
    "currency": "USD", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-17T22:25:43Z"
}