{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\">Are you stuck operating your Camera in Auto Mode?</p><p style=\"\">Do you have a camera ready to learn but can&#039;t seem to find the right training that makes photography simple?</p><p style=\"\">This Free Course is dedicated to simplifying the 3 elements that will put you in creative control over every shoot that you have. Aperture, Shutter Speed, and ISO. What I found is that most times starting out, photographers think they understand the concept on how to use aperture, shutter speed, and iso until their put in a dark room and asked to take photos. Not good right????  In this training, I help you understand when to use the 3 and what part of the image that decision effects. </p><p style=\"\">Feel free to follow along with your camera to truly retain the instructions. I suggest you watch the training video&#039;s first and then follow along so that you will fully get the concept. If your able to focus in and follow along the first time that will be A Okay. </p><p style=\"\">In this 30 minute course I will make sure to give you a clear understanding on how to control the lighting in any situation. Taking you from Automatic mode to fully manual mode in no time. Practice is the key to learning and creating a truly wonderful experience for yourself. </p><p style=\"\">Class includes 4 video lessons, 2 field assignments with a Bonus Photoshop Retouching Tutorial to practice the techniques learned in the training. Once you understand you will be able to create very nice photo&#039;s with any camera.  Within 2 of the assignments, I challenge you, to use just your cell phone that forces you to not get overwhelmed with the tool or camera used but allowing you to focus in on the message of what your looking to convey to your audience. </p><p style=\"\">You should take this course if you want easy to understand concept of controlling lighting better.</p><p style=\"\">This course is for Beginners to Photographers still struggling with the concept of how to control the Aperture, Shutter Speed, and ISO.</p>", 
    "end_date": null, 
    "title": "Your Road to Better Photography", 
    "price": 0, 
    "instructors": "Corey Reese", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566064_a070.jpg", 
    "course_url": "https://www.udemy.com/your-road-to-better-photography/", 
    "subject_name": [
        "Digital Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T13:43:45Z"
}