{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled ' <strong>14 Tips To Effectively Increase Your Productivity Now.' </strong> By Pradeep Aggarwal you will learn 14 powerful and effective tips to increase your creativity and your productivity at your workplace and in your daily life.</p><p>Almost all of us want to increase our productivity in both our personal and professional lives. However, not all us are capable of using our time effectively. Our inability to use our time effectively affects their productivity greatly.<br></p><p>This video course is designed to help you how to use your time effectively so that your productivity goes up and you find peace and happiness.</p><p>You will also Learn how to organize your life and your daily activities to maximize your productivity in both personal and professional life<br></p><p>You will also learn how to enhance your creativity to the maximum to increase your productivity in your personal and professional life<span><br></span></p><p><span>This course is ideal for those who are unable to utilize their time effectively to gain maximum productivity both in their personal and professional lives.<span><br></span></span></p><p><span><span>It is also very useful for those who work under serious stressful conditions and lack time management skills<span><br></span></span></span></p><p><span><span><span>This course contains 9 live recorded lectures in English.</span></span></span></p>", 
    "end_date": null, 
    "title": "14 Tips To Effectively Increase Your Productivity Now ", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699868_4847.jpg", 
    "course_url": "https://www.udemy.com/14-tips-to-effectively-increase-your-productivity-now/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-17T09:40:26Z"
}