{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">During this Tech Tips for students video training course, we will review a number of short tips to help you learn and stay organized. It does not go into detail on browsers or eBooks as these are separate courses that would also be beneficial to students. Most students are already aware of many shortcuts, tips and links. Hopefully this course will cover a number of tips that many students don&#039;t know from WiKi shortcuts and a great Science YouTube channel to a great place to get a fantastic price for a spare pare of glasses.</p><p style=\"\">This course is designed to be short and offer some powerful but less commonly know tips for students. It includes a few tips on saving money and I have no affiliation to any referenced companies or discounts. The focus is for Middle and High School students and their parents. All of the tips should help a student of any level and many of the tips such as Custom Search, once setup can provide great on-going benefits. </p><p style=\"\">It&#039;s recommended that you have a computer with the Chrome browser installed and having access to a Android or iPhone would be helpful when discussing apps for these devices.</p><p style=\"\">As with all my courses the focus is getting to the bottom line in under an hour. If you have specific questions or more detailed issues, feel free to message me and I will do my best to answer. </p><p style=\"\">There is a brief video introduction and several video sections, they are followed by a recap, a short quiz and a documents section at the end which has a copy of the slides and a few additional materials.</p><p style=\"\">This course includes a quiz and certificate of completion.</p><p style=\"\">This course was made in high-definition and is best viewed with the DH setting on and with the videos enlarged. Feedback is a critical part of an online course. Once you have completed the course, providing comments helps improve the course and benefits everyone, so let me know what you think.</p>", 
    "end_date": null, 
    "title": "2015 Tech - Tech Tips for Students", 
    "price": 0, 
    "instructors": "Tom Lahey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582518_b0e0_2.jpg", 
    "course_url": "https://www.udemy.com/2015-tech-tips-for-students/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T22:14:48Z"
}