{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">All college students are welcome to take this class. However, it is designed with particular groups of students in mind. My classes, which start with this orientation, have changed people&#039;s lives in addition to educating them on a particular topic when they are in one of these situations:</p><p style=\"\">- Are you at a crossroads in your life, trying to get on a positive path toward your goals? This course will help you. </p><p style=\"\">- Have you been surviving in life with little to no positive mentoring, trying to figure things out as you go, but still struggling to find your way? This course will help you. </p><p style=\"\">- Are you fresh out of high school thinking you know everything you need to know to succeed in college? Please take this class - it will help you. </p><p style=\"\">- If your life is right on track with your goals, you have a healthy and positive balance in most all aspects of your life, you are totally organized and consistently manage your time wisely, this course is probably not going to be a life changer for you, but you will likely learn a few things that will help you be even more of an Academic Rock Star! This category of student enjoys my classes because I validate what they are doing that works and they enjoy my teaching style. However, if you are in this category, your best bet may be to enroll in my other upcoming courses: Mastering A Positive Attitude, and Essential Communication Skills For Life (due out Fall 2015). </p><p style=\"\">By applying these college success tips, you will be an above-average student in every class you take. Wanting good grades isn&#039;t enough. This course will teach you the consistent behaviors that will get you noticed as a positive student who adds value to the academic experience. </p><p style=\"\"><strong style=\"\">Develop Skills To Take You From Average Student to Academic Rock Star!</strong> Instructors and other students appreciate people who have the self-awareness and interpersonal skills required in a college environment - it&#039;s important to get your money&#039;s worth from the investment in your education. This class is based on my orientation, which has supported student achievement for more than 15 years of teaching at Butte College. Students repeatedly tell me they wish they had this orientation their first semester in college.</p><p style=\"\">The 25 tips plus bonus tip sheet are organized into four sections:</p><p style=\"\">- preparing before the class</p><p style=\"\">- winning moves the first two weeks of class</p><p style=\"\">- maintaining success throughout the class</p><p style=\"\">- communicating after the class</p><p style=\"\">Every section includes lectures which coincide with your learning summary. </p><p style=\"\"><strong style=\"\"><em style=\"\">This is the information you are expected to know when you attend college, but how can you know if you don&#039;t take this class?</em> </strong></p><p style=\"\">You will learn how to:</p><p style=\"\">-manage relationships with the people you live with so they can be supportive of your college commitment</p><p style=\"\">-organize your life through tools and planning that have proven track records for creating excellence at work and at college</p><p style=\"\">-interact with other students and instructors so you are a person other people actually enjoy being around</p><p style=\"\">-actively participate in class so you can take ownership for outcomes, assignments, and the grades you earn</p><p style=\"\"><strong style=\"\">Some of the most surprising FAILs</strong> I&#039;ve observed were those students who already thought of themselves as academic rock starts, so they ignored my orientation guidelines, only to find themselves struggling and earning grades below their potential. Students take my classes with the goal of transferring to University or the workplace, so you can count on these tips supporting whatever life plan you have in mind. </p><p style=\"\"><strong style=\"\">Enroll now, why wait?</strong> I promise you will learn something useful in this course because so many students before you have benefitted from this content. </p>", 
    "end_date": null, 
    "title": "25 Tips For Succeeding In College Classes", 
    "price": "25.00", 
    "instructors": "Catherine Goggia", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310548_d1a3_7.jpg", 
    "course_url": "https://www.udemy.com/25-tips-for-succeeding-in-college-classes/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T05:39:44Z"
}