{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Mind map is a “special map\" that supports you in taking note, memorizing and recalling information. Different from normal note-taking method, Mind map leverages on the working mechanism of our neuron network and both hemisphere to facilitate the communication process to your brain, which makes information processing becoming easier, more interesting and effective.</p><p><strong>Contents &amp; Overview</strong></p><p>30 days to Mind map Mastery provides you a comprehensive set of knowledge and skills in order to apply Mind map immediately in note-taking, summarizing, brainstorming and managing knowledge. The course will cover:</p><ul><li>Overall understanding about Mind map</li> <li>The science behind</li> <li>Mind map application with practical examples</li> <li>How to draw mindmap – the golden rules</li> <li>Common pitfalls and how to overcome</li> <li>Master the art of drawing</li></ul><p>You will receive full-support with detailed comments &amp; suggestion on each exercise (if you send your masterpiece to me:) ). I will also address common concerns regarding using mind map such as “I am a bad artist\", “this is time-consuming\", “how do I apply this\" to ensure your confidence, understanding and capability of drawing &amp; applying mind map adequately at the end of the course.</p><p>You will get:</p><ul><li>Over 30 lectures and 3+ hours of video contents</li> <li>Step-by-step technique &amp; process to draw mind map</li> <li>Practical exercises from starting to mastering drawing technique</li> <li>Detailed comment and unlimited support from instructor to master mind map in your own preference</li> <li>Practical case studies on mindmap application in real-life</li></ul>", 
    "end_date": null, 
    "title": "30 days to Mind Map Mastery- Productivity boost for everyone", 
    "price": "25.00", 
    "instructors": "Zoe Hoang", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409912_0472_5.jpg", 
    "course_url": "https://www.udemy.com/mindmap-mastery-productivity-boost/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T13:47:51Z"
}