{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Why Don&#039;t You Achieve Your Goals?</strong>  </p>  <p>  \t<em>Here are the sad facts about goals...</em>  </p>  <ul>  \t<li>Even though most people say they believe goal-setting is important, 8 out of 10 people believe their life lacks an overall goal.</li>  \t<li>Of the people who DO create a goal, only 1 in 5 actually write their goals down.</li>  \t<li>Writing down a specific, measurable goal will increase your odds of achieving it by TEN times.</li>  \t<li>1 in 4 people make the same New Years Resolutions each year….and fail to achieve them.</li>  \t<li>Only 8% per year feel like they have met their yearly goal. And usually these are folks who set goals that are almost impossible NOT to achieve.</li>  </ul>  <p>  \t  Why don&#039;t more people achieve their goals? It&#039;s not like we set out to fail. It&#039;s not that there aren&#039;t plenty of plans.  </p>  <p>  \t<strong>2 Out of 5 Is Bad</strong>  </p>  <p>  \t  When it comes to goals most people take 2 out of the 5 steps critical for achievement.  </p>  <p>  \t  Step 1: Set the goal and write it down.  </p>  <p>  \t  Step 2: Create a plan and follow it.  </p>  <p>  \t  That&#039;s not enough. It never has been.  </p>  <p>  \t  It sounds like enough. It&#039;s logical. It makes sense. But it simply doesn&#039;t work for most people.  </p>  <p>  \t<strong>Why?</strong>  </p>  <p>  \t  Steven Pressfield calls it  resistance.  </p>  <p>  \t<em>“Most of us have two lives. The life we live, and the unlived life within us. Between the two stands Resistance. Resistance cannot be seen, touched, heard, or smelled. But it can be felt. Late at night have you experienced a vision of the person you might become, the work you could accomplish, the realized being you were mean to be? Are you a writer who doesn&#039;t write, a painter who doesn&#039;t paint, an entrepreneur who never starts a venture? Then you know what Resistance is.”</em>  </p>  <p>  \t  Resistance is what keeps us from our goal.  </p>  <p>  \t  And get this...  </p>  <p>  \t  Writing the goal down &amp; making a plan will NOT defeat it.  </p>  <p>  \t  Introducing...  </p>  <p>  \t<strong>5 Stones : Slay Your Giant Goals!</strong>  </p>  <p>  \t  This program is designed to help you tap into the power of the 3 goal achievement components that have been virtually ignored.  </p>  <p>  \t  With 5 Stones you will...  </p>  <ul>  \t<li>Discover the FIVE essential stones of achievement.</li>  \t<li>Tap into the strength of the 3 essential stones that every program on the planet ignores.</li>  \t<li>Learn the three roadblocks you face with ever goal you pursue.</li>  \t<li>Face the #1 reason you and billions of others may never reach a particular goal. Conquer this and every goal is virtually guaranteed.</li>  \t<li>Use a simple system to stay focused and on fire.</li>  \t<li>Anchor your Firestones so you can generate motivation and momentum at will. </li>  </ul>  <p>  \t  Let&#039;s admit that within a few days of setting a goal our passion drifts. What will happen when it doesn&#039;t?  </p>  <p>  \t  Finally set, track and accomplish the goals you set out to reach.  </p>", 
    "end_date": null, 
    "title": "5 Stones: Goal Setting & Achievement Intensive", 
    "price": "25.00", 
    "instructors": "Paul Evans", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356068_4237_3.jpg", 
    "course_url": "https://www.udemy.com/achieve-results-goal-setting/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T11:50:25Z"
}