{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>There are 8 productivity hacks that can help you get more done in one day, than most entrepreneurs get done in a whole week! These are the same 8 hacks that today’s top entrepreneurs and CEO’s are discreetly using to grow faster, and have more time to enjoy a balanced life.</p><p><em>“There's a delicate balance in business that keeps us sane, productive, happy and constantly moving forward. It's normally only evident in high growth individuals, and it allows them to achieve more in one year than most entrepreneurs, executives and CEO's accomplish in a lifetime. Those who understand these skills, speed past their counterparts. Those who disregard them... always seem to struggle.”</em></p><p>It doesn’t make a difference whether you’re an overworked, home-based businessperson, like a plumber or landscaper; or a busy professional like a doctor, dentist, or accountant; or an entrepreneur, executive or upper level manager…</p><p>Inside you’ll see what’s been holding YOU back, what’s slowing down your growth, and what’s reducing your productivity. But more importantly - you'll be handed a simple, proven system to <strong><u>re-boot your effectiveness</u></strong> and <strong><u>boost your productivity</u></strong>.</p><p>After just the first day, you’ll look back in amazement at how much more productive you are and how much more balanced you feel.</p><strong></strong><br><strong></strong><p><strong>What You Get From This Course?</strong><br></p><p><span></span></p><ul><li>Proven strategies to become <u>noticeably</u> more effective and productive</li><li><em>Standard Operating Procedures</em> (SOP’s) for better productivity for you and your team</li><li>Step-by-step workbooks that provide checklists and bullet points to make this super fast to understand and implement</li><li>Bonus material on building support teams for both business and personal life</li><li>Lifetime updates so you’ll never be left in the dark</li></ul><p><strong><br>Who Does This Program Work For?</strong><br></p><ul><li>Busy entrepreneurs</li><li>CEO’s and executive managers</li><li>High growth individuals</li><li>Overworked, home-based business owners</li></ul><p><br>This is not just a course; this is literally a <em>battle-tested profit-proven fail-safe blueprint to make you more productive and more balanced in life...</em>.<br></p><p>My name is Donald Wong and I’m an executive coach. In my books, keynotes and consulting I focus on <strong><u>proven, practical steps</u></strong> you can take to improve your effectiveness, and the effectiveness of your staff and your company.</p><p>All of my programs are straightforward and focused on helping you understand EXACTLY what works to make you <strong><u>more effective</u></strong> at work, happier at home, and immune to burnout and stress - keeping your company growing faster - while enjoying a more balanced life.</p><p><strong>So, if you want to:</strong></p><ul><li>Quickly boost your productivity using simple systems that are proven to work every time</li><li>Understand how to recharge quickly after stress</li><li>Get more done in 1 day than most people get done all week</li><li>Know exactly who to hire, and how to find them (step-by-step SOP included)</li><li>Save relationships that might have been hurt by your past overwork</li><li>Finally enjoy a balanced, highly productive life</li></ul><p>Then join me in this course today. Within just the first day, you’ll easily increase your productivity and feel more balanced!<strong></strong><em></em><u></u><sub></sub><sup></sup><br></p><p><strong>*On top of that, this course is backed by Udemy’s </strong><u><strong>30 day money back guarantee</strong></u><strong>.*</strong><br></p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "8 Productivity Hacks For High Growth Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Donald Wong", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776588_c017_3.jpg", 
    "course_url": "https://www.udemy.com/8-productivity-hacks-for-high-growth-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-28T05:08:12Z"
}