{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>QUESTION: What If You Could Get Twice As Much Done Tomorrow As You Have Any Day This Year?</strong></p>\n\n<p>Six years ago, I was sitting in the passenger seat of a car with my friend. </p>\n\n<p>My friend turns to me and says \"It's incredible how much I've gotten done in this year! So much has changed.\"</p>\n\n<p>And all I could do is smile. Because for me, almost nothing had changed.</p>\n\n<p>The truth is that we all want to use your time well. But in order to do so, you need to know certain principles you'll never learn in school.</p>\n\n<p>I didn't want to face another year where nothing changed. That's why I went after the answers. And it's also why I made this course.</p>\n\n<p>Inside, I'm going to share with you 7 specific steps you can take today to become more productive, taken from my course How To Double Your Productivity By Tomorrow Morning. If you take these ideas and apply them, I think you'll become more productive than you ever have before.<br></p>\n\n<p>Here's a sample of what you'll learn inside:</p>\n\n<ul><li><strong>These two words from a 2,000 year old book completely changed how I look at Time Management. Here's what they are, and how to use them [Lecture 2]<br><br></strong></li><li><strong>The \"Time Management Trap\" - If you don't know what it is, chances are you're making it [Lecture 3]<br><br></strong></li><li><strong>What to do every morning to skyrocket your productivity [Lecture 4]<br><br></strong></li><li><strong>How you can do 3 hours of work in 1 hour [Lecture 5]<br><br></strong></li><li><strong>How to always know what to work on [Lecture 6]<br><br></strong></li><li><strong>Why you need to make these 3 plans to manage your time well [Lecture 7]<br><br></strong></li><li><strong>The 80/20 Rule no one talks about and is more important to productivity [Lecture 8]<br><br></strong></li><li><strong>My Time Management Worksheets - I'll give them to you so you can use them now      [Lectures 9 &amp; 10]<br><br></strong></li><li><strong>Why achieving your goals is like filling a water bucket [Lecture 11]</strong></li></ul>\n\n<p>And more...</p>\n\n<p>To start the course, just click the \"Start Learning Now\" button. It's short, and free...</p>\n\n<p>See you inside,</p>\n\n<p>Brandon</p>", 
    "end_date": null, 
    "title": "A Mini Course on Time Management", 
    "price": 0, 
    "instructors": "Brandon Hakim", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/797156_d7dd_4.jpg", 
    "course_url": "https://www.udemy.com/manageyourtime/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-18T17:39:58Z"
}