{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\"> Just imagine being able to get 4 hours work done in less than an hour. </strong><strong style=\"\">Yes, improving productivity by that margin is very much possible.</strong> </p><p>It is an illusion that the speed of time is fixed. We are not as enslaved by time as we think.  </p><p>  \t  The passage of time, the speed of our breath and the state of our consciousness are all interlinked. <br style=\"\">  \t<br style=\"\">  \t   So, if you feel there are not enough hours in the day, or that time is speeding up, a solution is at hand. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">This course is time management training but not-as-we-know-it !!</strong><br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">By changing your thoughts, you change your mind and change your relationship with time as a result.</strong><br style=\"\">  \t<br style=\"\">  \t   This training consists of four sections containing over three and a half hours of mind expanding audio tracks and some simple Mind Mapping exercises.<br style=\"\">  </p>  <p>  \t<strong style=\"\">NEW MODULE : This course now contains a brand new lecture to help reduce the effects of jet lag !!!</strong>  </p>You can complete the whole training over a period of four days but you may find taking a section on a week gives better results.    <p>  \t At the end of the training, you will learn how to manage your time more efficiently. You will realize productivity improvements.  </p>  <p>  \t <strong style=\"\">Some unexpected byproducts of completing this course are an increase in your luck, your vitality, your overall well being and even your attractiveness - in both a business and personal context.</strong>  </p>  <p>  \t <strong style=\"\">NOTE : THIS COURSE CONSISTS LARGELY OF AUDIO TRACKS THAT TAKE YOU INTO ALTERED AND RELAXED STATES OF CONSCIOUSNESS. IT IS BEST ENJOYED WITH HEADPHONES AND IN  A QUIET ENVIRONMENT.<br style=\"\">  \t</strong>  </p>  <p>  \t <strong style=\"\">WARNING : DO NOT LISTEN TO ANY OF THE AUDIO VISUALIZATIONS IN THIS COURSE WHILE DRIVING OR OPERATING MACHINERY<br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "A Mindful Approach to Time Management", 
    "price": "30.00", 
    "instructors": "Tom Evans", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30981_f911_5.jpg", 
    "course_url": "https://www.udemy.com/bending-time/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-30T16:06:42Z"
}