{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you are someone who procrastinates, you will be fully aware of the negative impact it can have on your life. </p>    <p>This course will teach you a highly effective, tried and tested method for eliminating your problem of procrastination and helps you to begin living a happier and more productive life.</p>    <p>You will learn a simple yet powerful way to remove the mental and physical blocks that cause you to procrastinate and begin working in a way that will leave you feeling refreshed, in control and will lead to you getting a lot more work done.</p>      <p><strong>Learn the successful method that has helped many people to stop procrastinating instantly</strong></p>    <ul><li>Learn the secret to taking control of your pending tasks</li><li>Discover how to plan your whole day in less than 2 minutes</li><li>Uncover the simple tricks to never procrastinating again</li><li>Successfully complete tasks and never miss another deadline</li><li>Become someone your colleagues view as reliable and hardworking</li></ul><p><br><strong>Contents and Overview</strong></p>  <p>The course guides you step-by-step how to quickly regain control of your life and eliminate the temptation to procrastinate.</p>    <p>First, we will ensure you understand exactly what procrastination is and what causes us to delay and put off certain tasks. There is a focus on the various types of procrastination and the effect this has on our day to day work and personal life.</p>    <p>We then move on to the creator of this course and learn about his own personal battle as a procrastinator and the steps taken to overcome and defeat his demons. </p>    <p>The course itself combines the knowledge and skills learned during Carl’s own path to eliminating his own problem as a procrastinator to provide you with a strategy you can learn and follow, step-by-step.</p>    <p>You will create a magnificent plan in real time as you are guided from one video to the next, taking small but crucial actions. </p>    <p>By following the simple actions you will easily identify the most prevalent tasks that need to be done and discover a great way to prioritise your list.</p>    <p>As you near the end of the course, you will have a workable solution and strategy mapped out in front of you, ready to begin as soon as you arrive to work.</p>    <p>Finally, you will created a plan that can be used every day in order to get the important tasks done, all the time building momentum and driving yourself forward. </p><p>By following the steps, you will have everything you need to end your misery of procrastination and begin directing your life down a path that makes you happier, more productive and in full control of your life.</p>", 
    "end_date": null, 
    "title": "A Modern Day Guide To Stop Procrastinating", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Carl Radley", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706234_16c9_2.jpg", 
    "course_url": "https://www.udemy.com/a-modern-day-guide-to-stop-procrastinating/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-25T08:00:57Z"
}