{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn how to live a more balanced and intentional life by accomplishing your New Year’s resolutions and any other goals that you set for yourself.</p>  <p><strong></strong></p>  <p><strong>Master your New Year’s resolutions and become an expert on the mechanics of accomplishment</strong><strong></strong></p>  <ul><li>Escape the 3 accomplishment-killer traps</li><li>Learn how to use the 3 tools of effective accomplishment</li><li>Become an expert in habit development</li><li>Master the Habit Based Achievement (HBA) approach</li><li>Optimize your energy at work and during the mornings</li></ul>          <p><strong></strong></p>  <p><strong>A more balanced and intentional life… Made simple.</strong><strong></strong></p>  <p>Only 8% of the people who make New Year’s resolutions, accomplish them. In today’s fast and busy world leading a balanced an intentional life has become a privilege of few. It is common that we know what we want, but we struggle too much to make it happen. I believe this happens, partly, because the mechanics of accomplishment are shown to the world in a very chaotic and complex way. </p>  <p>In this training I translate the mechanics of accomplishment for them to be <strong>simple, actionable, fun</strong>, and easily understood by absolute beginners. Additionally, you will be able to learn and grow along my side; I will be available as your friend and your mentor, and I will be participating actively in the forums.</p>  <p><strong>Imagine how happy and fulfilled you would live if you could accomplish all your New Year’s resolutions!</strong> This course is my way of sharing with you some of the main foundations, the most common traps and the most effective approaches to making your aspirations, your goals, your New Year’s resolutions… come true. </p>  <p>You will walk away from this course with the golden ticket to live the balanced and intentional life that you have been longing for. <strong>But this training is not only about you.</strong> It’s also about the people you love: By the end of this course I will encourage you to do a very fun and “delicious” project for you to share this golden ticket with your loved ones, enjoy your “accomplishing” process to a whole new level, and strengthen your interpersonal relationships.</p>  <p><strong>Let the accomplishing begin!</strong></p>", 
    "end_date": null, 
    "title": "Accomplish New Year’s Resolutions! Live an Intentional Life.", 
    "price": "50.00", 
    "instructors": "Camilo Russi", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651798_7ce8_4.jpg", 
    "course_url": "https://www.udemy.com/accomplish-new-years-resolutions-live-an-intentional-life/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T22:46:14Z"
}