{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Update 5-27-16</strong></p>\n\n<p>Lecture 2, all external links are now downloadable files. Read the research. </p>\n\n<p><strong>***All lectures are downloadable***</strong></p>\n\n<p><strong></strong>This course will teach you how to achieve more in less time. By learning how to use <strong>SMART Goals</strong> you will gain a concise, structured method to help keep you motivated and on track. In the course I will take you through how to ensure that your goals are; </p>\n\n\n\n<ol><li><strong>Specific</strong></li><li><strong>Measurable</strong></li><li><strong>Actionable</strong></li><li><strong>Relevant</strong></li><li><strong>Time Bound</strong></li></ol>\n\n\n\n<p>In addition, throughout the course I provide a practical way for you to relate the <strong>SMART</strong> technique to your current goals as well as demonstrate my personal system for keeping on top of my goals. I also cover some of the most common errors people make when establishing their goals and I provide a bonus lecture on time management. Last, at the end of the course I give you the opportunity to answer a question to win a free course. </p>\n\n\n\n<p>Topics in the course include, but are not limited to;</p>\n\n\n\n<ul><li><strong>The difference between a vision, goal or resolution. </strong></li><li><strong>When setting specific goals can be a bad thing. </strong></li><li><strong>Why I use </strong><em><strong>Actionable</strong></em><strong> instead of <em>Achievable</em>.</strong></li><li><strong>The importance of Action/Feedback loops. </strong></li><li><strong>How to juggle multiple goals at the same time.</strong> </li></ul>\n\n\n\n<p>This is now my <strong>6th course</strong> on Udemy, so when you enroll you also get access to my announcements that include free tips, hacks and techniques on productivity, innovation, motivation and problem-solving. As a dedicated instructor with a PhD in educational psychology, I will share the latest research with you to keep you a step ahead and motivated to achieve more.</p>\n\n\n\n<p>My course is designed for leaders, entrepreneurs, innovators and anyone that wants to achieve more in less time. If this sounds like you, enroll right now. Life is short and I guarantee even if you are familiar with the <strong>SMART</strong> method, you will learn something new in this course. If not, send me a message and I will make it right. </p>", 
    "end_date": null, 
    "title": "Achieve More in Less Time Using SMART Goals", 
    "price": 0, 
    "instructors": "Dr. Richard Feenstra", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580342_b14d_2.jpg", 
    "course_url": "https://www.udemy.com/goal-setting/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T17:25:18Z"
}