{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">I&#039;d like to invite you to what I believe is the most <strong style=\"\">effective</strong>, most <strong style=\"\">uplifting </strong>training program for <strong style=\"\">finding, setting, and achieving meaningful goals.</strong></p><p style=\"\">If you are ready to take the next step in your development, if you want to have more fun experience more meaningfulness feel that life is actually incredibly good and that the world is basically wishing you well and you want to find more passion and joy in your life.</p><p style=\"\">The training is a series of<strong style=\"\"> 8 sections containing video lessons and exercise material </strong>so you can start implementing everything you learn right away.</p><p style=\"\">_________________________________________________________________________<span style=\"\"></span></p><p style=\"\">In the <strong style=\"\">first section</strong> we are looking at your current situation. Where you are right now so you are clear about your starting point. You will learn, among other things:</p> <ul style=\"\"><li style=\"\">How to avoid that your old results determines your new results.</li> <li style=\"\">The answer to why different people get different results even though they have the same circumstances - and how you can use this knowledge to your advantage.</li> <li style=\"\">You are not paid for what you know, but for what you do – So here you learn how to quickly become a person who gets paid, instead of just knowing things.</li> <li style=\"\"> You are often closer to a breakthrough than you think – when most other people give up, do this instead.</li></ul>_________________________________________________________________________The <strong style=\"\">2nd section</strong> is about the magical word that separates the wheat from the chaff and the most important reason for why you have the results you have today. You will also learn:<ul style=\"\"><li style=\"\">What is the primary cause of the results you have today? Here are the answers.</li> <li style=\"\">With this method you are able to see completely new possibilities that appeared to not exist before. </li> <li style=\"\">We humans think in pictures. In this way you can use the “Stick man&quot; to think in new ways, which will turn into new results.</li> <li style=\"\">How you manage to keep your focus long enough on what&#039;s important to be able to succeed.</li></ul>_________________________________________________________________________In <strong style=\"\">section 3 </strong>I teach you what a goal really is (and what it isn&#039;t) and how you, in an enjoyable and simple way, can find your meaningful goals. It shows you: <ul style=\"\"><li style=\"\">The biggest mistake most people make when they attempt to find their meaningful goals</li> <li style=\"\">To get to where you want to be, you need to think, feel and act differently – this is how you do it</li> <li style=\"\">Here you get the answers to the important questions: How do I set a goal? How do I know what I really want?</li> <li style=\"\">How to re-evaluate what you think is possible for you and get rid of your perceived limitations</li></ul> <p style=\"\">Here you will also find <strong style=\"\">exercises </strong>that will help you crystallize what is worthy of having you spend your valuable time on it.</p><p style=\"\"><strong style=\"\">_________________________________________________________________________Section 4 </strong>is about the invisible force... </p><p style=\"\">…you will get a key that most people miss when they are getting started.</p><p style=\"\">A key that saves you from getting stuck, be frustrated that nothing happens, and instead allows you to discover how easy it can be to get going. I&#039;ll show you:</p><ul style=\"\"><li style=\"\">If you find it difficult do move towards your goal, it is almost always because of . . . this!</li> <li style=\"\">How a team that I coached went from mediocrities to those with the best results in the whole company in just 3 weeks.</li> <li style=\"\">How you learn to make critical decisions, under uncertainty and without having all facts.</li> <li style=\"\">The formula that keeps you on track toward you goal, and the art of being able to say no.</li></ul><strong style=\"\">_________________________________________________________________________Section 5 </strong>is about how easy it is to win - why you do what you are doing. Here are some of the things you will find in this module:<ul style=\"\"><li style=\"\">How to find simpler solutions with the help of your &quot;inner map&quot;.</li><li style=\"\">There is a gap between what you know and what you do – this is how you bridge it</li><li style=\"\">How you quickly and easily can program your subconscious mind and get over obstacles easier than ever before.</li></ul><p style=\"\">_________________________________________________________________________The next <strong style=\"\">section, number 6</strong>, is about how you can use your imagination in a conscious way. Here are some of the things you will find in this section:</p><ul style=\"\"><li style=\"\">To turn on your built-in &quot;radio&quot; - so you do not miss out on the opportunities and solutions that are right in front of you.</li><li style=\"\">How to avoid painting horrible pictures in your mind. Pictures of a reality that does not exist and that keeps you stuck where you are today.</li><li style=\"\">According to researchers, we have about 60,000 thoughts every day – this way you can focus on the best and make them grow.</li><li style=\"\">The method I use to go straight for the real target. For example, how to get an order straight away intead of having to go back to the office to write a proposal.</li></ul><p style=\"\"><strong style=\"\">_________________________________________________________________________Section 7</strong> teaches you how to handle risks instead of avoiding them. If you take more smart risks (it is not about being reckless or irresponsible) you can win big.</p><p style=\"\">Here are some of the things you will find in this module:</p><ul style=\"\"><li style=\"\">We are often told to get out of the comfort zone - but how do you actually do to get access to all the solutions that are outside the &quot;box&quot;?</li><li style=\"\">If you just go with the flow you will only go in one direction - unfortunately, this direction is not UP. How do you change it, you&#039;ll learn here.</li><li style=\"\">How the story of &quot;The Tiger&quot; can help you to get rid of fears and uneccesary stress.</li><li style=\"\">How to become a natural risk taker. So you can enjoy the good life that are closed to all others whos biggest aim is to avoid risks at all costs.</li></ul>_________________________________________________________________________The last <strong style=\"\">section </strong>is about getting started. About getting a running start that keeps you on track all the way across the goal line. Here are some of the things you will find in this module:<ul style=\"\"><li style=\"\">If you have these three things in place when you get started, you can often achieve even faster progress than you have planned.</li><li style=\"\">Do not wait for circumstances to be perfect when you want to start something new - Do this instead.</li><li style=\"\">A simple way to reduce stress and pressure when you start something new.</li><li style=\"\">And here you will finally have access to your &quot;magic card&quot;</li><li style=\"\">And much more!</li></ul><p style=\"\">_________________________________________________________________________You also get a book with exercises with these sections. Since <strong style=\"\">the quality of the answers we get in our lives are determined by the quality of the questions we choose to ask</strong>, we have put together a number of quality questions for you, so you can find your quality answers. </p><p style=\"\"><strong style=\"\">So what is training like this worth?</strong></p><p style=\"\">One way to look at it is that I have, over the years, spent hundreds of thousands of dollars and thousands of hours learning as much as possible about our thoughts, minds, and their connection to our results in all areas of life.</p><p style=\"\">A lot of that time and money went to testing things that didn&#039;t work.</p><p style=\"\">But you don&#039;t have to spend all that time and hundreds of thousands or even tens of thousands of dollars to get access to the same knowledge. If you had selected to participate in one of our webinars trainings you would have paid $900.</p><p style=\"\">If you had selected to participate in one of our 4-hours goal setting workshops you would have paid $350 to get a fun and energy filled four hours presentation and a book - but not a complete training program.</p><p style=\"\"><strong style=\"\">Now you get 8 sections with video lessons and complete exercise workbooks</strong>. </p><p style=\"\"><strong style=\"\">For only $197.</strong></p><p style=\"\"> All this, which you can use again and again and again. And you will notice that it is not like any other training. I am convinced that you will discover that you are thinking differently than before. What you would perceive as huge or impossible will all of a sudden feel comprehensible and within reach.</p><p style=\"\"><strong style=\"\">Go ahead and get started today!</strong></p><p style=\"\">Hope to talk to you soon.</p><p style=\"\">Regards</p><p style=\"\">Ola Wallstrom</p><span style=\"\"></span><span style=\"\"></span>", 
    "end_date": null, 
    "title": "Achieving Your Goals 2015 - The Right Way", 
    "price": "35.00", 
    "instructors": "Ola Wallström", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/488458_450b_3.jpg", 
    "course_url": "https://www.udemy.com/achieving-your-goals-the-right-way/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-28T11:24:04Z"
}