{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Achieve Productivity</strong> will help you become a human time machine!  </p>  <p>  \t  You will discover how to master the clock and use it to your advantage.  </p>  <p>  \t  This course is direct and to the point. <em>Why in the world would you spend hours upon hours learning how to be more productive?</em> <strong>That counters the entire concept</strong>.  </p>  <p>  \t  In just a few short videos, a couple of cheatsheets and cool piece of included software, you will get your life back and become more productive than ever before.  </p>  <p>  \t<em>Here’s something you may not believe, in fact, you probably won’t…</em>  </p>  <p>  \t<strong>Becoming a human time machine is the most important &quot;skill&quot; you can ever gain.</strong>  </p>  <p>  \tWhat?  </p>  <p>  \tYep. Because <strong>time is leverage.</strong> When you can do in one hour what takes others eight, you have huge leverage. When you are able to focus for thirty honest minutes, you can literally lap the field in your niche.  </p>  <p>  \tAlmost everyone is wandering around in a fog. In a daze. <strong>In a cess pool of mediocrity.</strong>  </p>  <p>  \tWhen you step out into clarity by controlling your time, you control your destiny.  </p>  <p>  \t<strong>You see the only thing that matters is RESULTS. What you get DONE.</strong>  </p>  <p>  \tAnd you get more done by… yeah, you’re sick of hearing it… by taking charge of the clock. <strong><em>Compressing hours to minutes, days to hours and weeks to days</em></strong>. And it CAN be done!  </p>  <p>  \tYou’re probably thinking…  </p>  <p>  \t“Yeah, well Paul, you’re probably one of those naturally focused and scheduled ‘freak’ types. You probably have all your pens and pencils aligned in order in your pocket protector.”  </p>  <p>  \t<strong>Not even close!</strong>  </p>  <p>  \tMy <strong>DNA is scattered</strong>. In school I couldn’t sit still. Couldn’t stay focused. Was always watching the clock. Amazed and how fast time could go on a date and how time could creep in the classroom.  </p>  <p>  \tI was always losing assignments and forgetting others altogether. And on top of that I said yes to way too much. Over extended myself and never really finished anything. O… I started in a flurry and faded fast.  </p>  <p>  \tThere’s no doubt that I disappointed a lot of people along the way.  </p>  <p>  \tWell, I didn’t learn my lesson and<strong> brought the same identity into business</strong>. When I first got started I couldn&#039;t get profitable because I couldn&#039;t get focused.  </p>  <p>  \tThen frustration moved to anger and anger into action.  </p>  <p>  \tOne thing I knew for sure. <strong>What I was doing wasn’t working</strong>. Change had to be made and I had to find the source of all my issues. I mean get to the root!  </p>  <p>  \t(<em>It’s so easy to cover up the real problem. I could have blamed everyone else. But somehow I knew the real problem was something within me. And if I could correct it then things would change… massively.</em>)  </p>  <p>  \tTurns out I have A.D.D. <strong>Hold on it’s not what you think.</strong>  </p>  <p>  \tWhile I might have the actually disorder (especially since baby sitters and barbers said “Never bring him back!”), it’s not Attention Deficit Disorder. I had…  </p>  <p>  \t<strong>Attention </strong><strong><em>Discipline</em></strong><strong> Disorder.</strong>  </p>  <p>  \tI had no focus. No plan.  No schedule. No structure.  </p>  <p>  \tIn the &quot;real world&quot; people tell you what to do and when to do it.  </p>  <p>  \tIn the rest of life YOU call the shots. No one tells you what and when. Even if you do get what to do, there’s no WHEN to do it.  </p>  <p>  \t-YOU have to control your TIME.  </p>  <p>  \t-YOU have to make the plan and stick with it.  </p>  <p>  \t-YOU have to create the schedule and structure.  </p>  <p>  \tAnd most do not have a clue… because they suffer from A.D.D. too!  </p>  <p>  \tThis course will turn you into a human time machine, so you get more done in less time with extreme focus!  </p>", 
    "end_date": null, 
    "title": "Achieve Productivity : How to Become a Human Time Machine", 
    "price": "20.00", 
    "instructors": "Paul Evans", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/351532_7978_6.jpg", 
    "course_url": "https://www.udemy.com/achieve-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-20T03:14:38Z"
}