{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>***************************************************************</strong></p><p><strong><br></strong></p><p><strong>***************************************************************</strong></p><p><strong>Be As Effective As You Can Be - Save Hours Per Week By Automating  (Almost) Everything Boring in Your Life.</strong></p><ul><li><strong>How long per week do you spend doing boring repetitive tasks? What is you could put these tasks on 'auto-mode'? </strong></li><li><strong>What is you would save just 5 hours per week. </strong></li><li><strong>If so that would add-up to about 269 hours per year, that's about 10 days a year, that over a weeks away or time to work on a project or even more times with loved-ones. </strong></li><li><strong>Just by putting repetitive tasks on auto-mode.</strong></li></ul><p>An outline of productivity to help you optimise everyday tasks and even outsource almost everything in your life and be a lot more effective (and maybe more happy:)</p><p>Email for example is great productivity tool. However, it can often take over you life.  Pinging here and there as soon as an message comes in.  What if you could but 90% of your email on auto-mode? Just think how much of the working day this could save.  <strong>Well this course will help you do just that!</strong></p><p>_____________________________________________________</p><p>Think about your  day-to-day tasks such as emails you have to answer or preparing a meal for yourself and/or loved ones day in-and-day-out.  <strong>By the end of this course you would have freed yourself from neededing to do a great deal of these tasks yourself.</strong> You will make a list of these day-to-day tasks and have either but them on auto-mode (such as emails) or got someone else to do them for you (such as meal prep).</p><ul><li><strong>Section 1 - Integrate Your Favorite Apps</strong></li><li><strong>Section 2 - Food Without Thinking</strong></li><li><strong>Section 3 - Auto Save Money (Nice:)</strong></li><li><strong>Section 4 - Get Someone Else To Do Your Work (Get A Low Cost Personal Assistant)</strong></li></ul><p>An outline of productivity to help you optimise everyday tasks and even outsource almost everything in your life and be a lot more effective and possibly happy :)</p><p>Another amazing tool is IFTTT. This is an automation tool that gets your various web services working for you, instead of the other way around. All of those tasks that you say \"just take a minute\" but you do them dozens of times each day, can be completely automated out of your life. </p><p>Once you've optimised and automated these process, if there is anything left over, you can look at outsourcing it.</p><p>This course will give you the resources you need to make Optimising and Outsourcing your keys to great productivity and effectiveness.</p><p>With this easy to follow video course, Paul will show you some of the ways you can start to automate the parts of your life that you really wish you could!</p>", 
    "end_date": null, 
    "title": "Automate Boring Parts of Life: Gain Over 5 Hours Per Week", 
    "price": "20.00", 
    "instructors": "Paul Tilley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558752_610e_3.jpg", 
    "course_url": "https://www.udemy.com/automating/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-19T16:44:13Z"
}