{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">You can accomplish anything you set your mind to. By starting exactly where you are today, using the resources that you already possess, you can create a life you love.  Start with your own determination, creativity, and hard work and then add in the inspirational advice and practical strategies you will learn in this course to help you move toward your goals.  You have the power within yourself to create your own future.  </p><p style=\"\">By the end of this course, you will have: </p><ul style=\"\"><li style=\"\">Identified your own personal definition of success</li><li style=\"\">Brainstormed a master list of goal ideas </li><li style=\"\">Determined which of your goals align most closely with your values </li><li style=\"\">Focused clearly on which goals are most important to you </li><li style=\"\">An understanding of why success can be threatening to others </li><li style=\"\">Created measurable, time sensitive goals </li><li style=\"\">Broken your goals down into manageable action steps</li><li style=\"\">Learned practical steps to reflect on your progress and adjust goals as needed </li></ul><p style=\"\">Success is a frame of mind and this course will help you understand how to BE to create success in your life.   In addition to video lectures, this course contains valuable PDF resources and a FREE motivational quote e-book filled to the brim with great wisdom for your journey.</p><p style=\"\">This course is for anyone who wants to make their goal setting process more practical and efficient.  The resources contained within the lectures will help you get to work setting and reaching your most important goals.  </p>", 
    "end_date": null, 
    "title": "Be Inspired: Practical Goal Setting Strategies ", 
    "price": "20.00", 
    "instructors": "Mary Allison Brown", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503040_bdca.jpg", 
    "course_url": "https://www.udemy.com/be-inspired-practical-goal-setting-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T16:35:45Z"
}