{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In the \"Be More Organized, Productive, and Creative with a MindMap\" course students will learn the basic of MindMapping. This course is meant for beginners who want to explore what MindMapping is and who want to create their first MindMaps. </p><p>In the course, I will walk you through the five steps that are usually needed to create a MindMap. I say \"usually\" because sometimes not all the steps are required. </p><p>I will also show you which tools you can use to create your MindMap. This course includes a project that you should complete in order to really learn the content. I provide an example of a MindMapping project that was created in Mindomo to make sure you understand what you should work on. Moreover, I will include projects of past students and will pick more projects to showcase what is possible to achieve with the knowledge learned in this course. You can be one of the lucky ones featured within the students projects if you sign up, go through the lectures and complete your project! </p><p><strong>WHO NEEDS MIND MAPPING?</strong></p><p>Anyone, from first-grader to CEO, can use and benefit from this versatile technique. Here are a few examples:</p><ul><li>Project managers wanting to present their ideas clearly to their team</li><li>Students studying for exams, wanting to boost their learning capacity</li><li>Event planners wanting to organize every aspect of an event</li><li>Entrepreneurs wanting to create a dynamic business plan</li><li>Marketers exploring potential avenues for promoting a product or service</li><li>Consultants and advisors trying to visualize their clients’ situations</li><li>Writers wanting to create original stories, articles and jokes</li><li>Collaborative teams working on a project together</li><li>Parents wanting to aid their child’s learning</li><li>Teachers looking to improve teamwork and communication in the classroom</li></ul><p><em>…and you!</em></p>", 
    "end_date": null, 
    "title": "Be More Organized, Productive, and Creative with a MindMap", 
    "price": "20.00", 
    "instructors": "Michaela Pacesova", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/740514_0f23_2.jpg", 
    "course_url": "https://www.udemy.com/be-more-organized-productive-and-creative-with-a-mindmap/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T02:39:55Z"
}