{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Math is often taught in a very boring and tedious manner in classrooms. Its often presented as a set of rigid rules which leave very little room for fun and creativity. But from this course you will learn that there are often several ways to solve the same problem. Bigger calculations can often be broken into simpler and manageable components.</p><p>Most of us are convinced that people who perform math tricks and who calculated long problems within seconds without using any aid like pen or paper are GOD BORN GENIUSES.  But I am here to tell you that your are WRONG based on my years of teaching experience I have learnt that rapid math skills just like any other skill can be learned.</p><p>Just like another skill it needs practice and dedication which is a long time consuming process. But if want to accelerated this process of learning it is important that you the right approach. <strong>“I am here to show you how thats done”</strong></p><p>In this course you will learn to do math in your head without using any AID like pen or paper. Methods shown here will even surprise you at how good can you be with calculation and why didn't you learn these simple skills in school. Not only will you speed but your accuracy will also improve dramatically. Without continuous practice you will be so fast that you will able to beat even a calculator in getting to the answer.</p>", 
    "end_date": null, 
    "title": "Become a Mathemagician and perform astounding Magic tricks ", 
    "price": "20.00", 
    "instructors": "Er. Pranav Manhas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640708_4c7a.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-mathemagician-using-mental-math/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T19:37:42Z"
}