{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Why take this course?</strong></p><p>Are you an academic feeling stressed out because of the increasing demands placed upon you to work harder and produce more? </p><p>If so, you are not alone. The intense pressure of graduate, post-doctoral study, and early-career academia leading to mental health problems is now well-known. </p><p><em>Publish or perish!</em></p><p>It is well known that writing productivity is a key factor for success in academia. </p><p>Yet, there is lack of support and structured guidance available to many academics seeking to achieve sustained and steady levels of writing productivity.<br></p><p>Based on a synthesis of research on faculty development as well as business and time management strategies, this course addresses the key writing challenges and various kinds of resistances experienced by academics wanting to be successful with their scholarly output, and presents proven strategies to overcome them. </p><p><strong>How is this course structured?</strong></p><ul><li><strong>Section 1 </strong>introduces you to the course and the various topics covered</li><li><strong>Section 2</strong> examines the writing challenges often reported by academics and dismantles the writing myths</li><li><strong>Section 3</strong> reveals some major self-imposed limiting beliefs such as perfectionism and the accompanying “inner critic”, and some key strategies to do away with them</li><li><strong>Section 4</strong> introduces the idea of setting S.M.A.R.T. writing goals and creating To-Do lists to overcome academic writing procrastination and frustrations in dealing with complex writing projects</li><li><strong>Section 5</strong> teaches you the most important writing productivity advice (i.e., write daily). It is further expanded upon with time management strategies such as the Pomodoro technique and ways of tracking one’s writing progress</li><li><strong>Section 6</strong> discusses how external and internal distractions can interfere with our writing productivity and offers implementable solutions to eliminate distractions</li><li><strong>Section 7</strong> wraps up the course </li></ul><span></span><span></span>", 
    "end_date": null, 
    "title": "Becoming a Productive Academic Writer", 
    "price": "30.00", 
    "instructors": "The Productive Academic", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/781418_be6d_3.jpg", 
    "course_url": "https://www.udemy.com/becoming-a-productive-academic-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-03T19:37:09Z"
}