{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Learn how to ditch the distractions, focus on the important stuff and rock your goals.<br>  </p>  <p>  \t  During this course I will share with you the most effective time management and productivity techniques I have discovered over the last 3 years. I will share with you the techniques that I use every day to ensure that I make progress on my goals. I will share with you how I have implemented the actions too and the difference they have made. By the end of this course you will know;  </p>  <ul>  </ul>  <ul>  \t<li>      Where your time goes now and what you do with it</li>  </ul>  <ul>  \t<li>      How to improve your time management by using scheduling and other tools  </li>  \t<li>      How to get more done in a day and reduce work spilling over to home  </li>  \t<li>      How to boost your productivity by focussing on key actions  </li>  \t<li>      How to dramatically reduce the impact of distractions on your time  </li>  \t<li>      How to structure your day to get the most done  </li>  </ul>  <p>  \t      You will learn transferable skills that you can easily use in other work situations such as projects  </p>  <ul>  </ul>  <p>  \t            This course if ideal for you if you have goals but don't feel you are making as much progress with them as you would like.  </p>  <p>  \t            For you to get the most benefit this course requires some additional work outside of the course itself. This additional work varies - most of it is under 30 minutes, with work on values requiring the most extra effort of several hours.  </p>  <p>  \t      The course is comprised of 3 minute videos. Each video gives an estimate of the time to implement the activity described, alongwith an estimate of the time saved/gained or the increase in productivity. Text versions accompany all the videos.  </p>  <p>  \t      The course also includes worksheets for completing activities as well as additional articles and reading that is useful to the course.  </p>  <p>  \t      At the end of this course you will have improved your time management, learned to focus on the really important stuff, be able to minimise distractions and get much more done than previously, plus you will be making more progress on your goals.  </p><p><strong>The course also comes with my own full value and moneyback guarantee. If, within a week of implementing these tools you haven't had at least twice the value of this course, I will refund all your money and apologise.</strong><br></p>", 
    "end_date": null, 
    "title": "Become a Productivity Wizard - For Busy People With Goals", 
    "price": "50.00", 
    "instructors": "Melanie Newdick", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332656_5fc2_4.jpg", 
    "course_url": "https://www.udemy.com/become-a-productivity-wizard/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T14:13:08Z"
}