{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t <em style=\"\">This course will teach you the most cutting-edge tips and tricks for productivity, automation, and efficiency, so that you can do more work in less time and have more time for the things that matter in life. </em></p>  <p style=\"\">  \t <strong style=\"\">  What would you do to have just <em style=\"\">one more</em> hour in the day? Two hours? How about 3?</strong>  </p>  <p style=\"\">  \t       The sad truth is that most of us simply don&#039;t have enough time in our daily lives to get through everything we need to do. Much less the things we <em style=\"\">want</em> to do.  </p>  <p style=\"\">  \t       In this course from best-selling instructor Jonathan Levi, author of the blockbuster course &quot;<em style=\"\">Become a SuperLearner,</em>&quot; you will learn how to reclaim enough time to do just that - and so much more.  </p>  <p style=\"\">  \t       For the last 10 years, your instructor Jonathan Levi has developed a series of techniques, tips, tricks, and strategies to overcome a near superhuman workload. From juggling a multimillion dollar business while engaged as a full time student, to running multiple companies at the same time, to leading a jam-packed travel, social, and educational calendar that would make some people&#039;s heads spin. </p><p style=\"\">How is this possible, and how can you, too, learn to Become a Speed Demon?  </p>  <p style=\"\">  \t       The course starts out with a great foundation in theory, training you on the philosophies behind efficiency, productivity, and &quot;speeding up.&quot;  </p>  <p style=\"\">  \t       Armed with these theories and strategies, the course then dives into more nuts-and-bolts recommendations on how to speed up some of the most time-intensive activities we each do every day; working at the computer, cooking and fitness, interactions with others, and other general inefficiencies.  </p>  <p style=\"\">  \t       The course takes a holistic approach to productivity and efficiency, arming you with the mindset to kick butt and speed up every aspect of your productive and creative life, in order to make time for the things that <em style=\"\">really</em> matter. With that said, this course, as with the instructor&#039;s other courses, will evolve, grow, and improve based on your feedback, so get your front-row seat today!  </p>", 
    "end_date": null, 
    "title": "Become a SpeedDemon: Productivity Tricks to Have More Time", 
    "price": "20.00", 
    "instructors": "Jonathan Levi", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177706_44e7_3.jpg", 
    "course_url": "https://www.udemy.com/become-a-speeddemon-hack-automation-focus-efficiency-to-have-more-time/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-06T07:00:27Z"
}