{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Let me ask you a question.</p>\n\n<p><strong class=\"redactor-inline-converted\">*** Who has a shorter attention span? An average person or an average goldfish? ***</strong></p>\n\n<p>Before I reveal the answer I would like to share some interesting news.\n\n  </p>\n\n<p>Technology is making our lives much easier. But as a side effect we are living in a fast paced world and we get more disruptions in our lives now than ever before.\n\n  </p>\n\n<p>And our brains are literally rewiring themselves to adapt for this new lifestyle. Studies have shown that we are slowing losing our ability to focus.\n\n  </p>\n\n<p>Now more than ever before more people are finding it hard to sit and focus on one task and get it done. </p><p><strong class=\"redactor-inline-converted\">Productivity is at an all-time low.</strong> \n\n  </p>\n\n<p>So to answer the question who has a shorter attention span? ***Well as of 2015 it is official. We have a shorter attention span then a Goldfish. **\n\n  </p>\n\n<p>And despite these new statistics the situation is still getting worst.\n\n  </p>\n\n<p>But imagine for a second that…\n\n  </p>\n\n<ul><li>You could double your productivity in half the time!</li><li>Or that you became immune to the distractions of everyday life!</li><li>And that you could always sit down and get to work without any mind blocks!</li></ul>\n\n\n\n\n\n<p>Sounds too good to be true?\n\n  </p>\n\n<p>That is the power of time management.\n\n  </p>\n\n<p>It is a skill and everyone can learn it!\n\n  </p>\n\n<p>Because time management is really life management. And as Peter Drucker used to say you cannot manage time you can only manage yourself. And the most successful people are the ones who are best at managing themselves.\n\n  </p>\n\n<p><strong>I have created the Boost Your Productivity Training where you will learn how to “Double Your Productivity”.</strong>\n\n  </p>\n\n<p>You will learn the secrets that the most successful people use to manage their time:\n\n  </p>\n\n<ul><li>So you never feel overwhelmed by work and always get it done on time…</li><li>So you get more free time to relax and enjoy yourself…</li><li>And so you can get back control over your daily schedule and of your life…</li></ul>\n\n\n\n\n\n\n\n<p>Go ahead. Click the “Take this Course” button now.\n\n  </p>\n\n<p>You have nothing to lose and everything to gain\n\n  </p>\n\n<p>I’ll see you on the inside.</p>", 
    "end_date": null, 
    "title": "Boost Your Productivity: Essential Time Management Skills", 
    "price": "50.00", 
    "instructors": "Tom Wiztek", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841068_9be5.jpg", 
    "course_url": "https://www.udemy.com/boost-your-productivity-essential-time-management-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-06T06:21:06Z"
}