{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                                    ----------------------------------------------------------------------------------------------------------------  </p>  <p>  \t<em>THOUSANDS OF STUDENTS ARE TAKING THIS COURSE RIGHT NOW!</em> - Learning how to be more confident, happier, productive and successful. Take this course today and start learning.  </p>  <p>  \t<strong>\"I have started already! Brilliant course, very easy to follow and implement, I have already done my first 11 minute session with surprising results!\" - (Student)</strong>  </p>  <p>  \t<strong>\"I highly recommend this course for anyone looking to widen their thinking perspectives and creative power.\" </strong><strong>- (Student) </strong>  </p>  <p>  \t<strong>\"I'm excited to start applying the concepts in this course. AHA is right!\" - </strong><strong>(Student) </strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t                                    -----------------------------------------------------------------------------------------------------------------  </p>  <p>  \t                                    Do you want to be smarter?  </p>  <p>  \t                                    Do you need to solve problems more efficiently?  </p>  <p>  \t                                    Do you feel like you're struggling to find your creative voice?  </p>  <p>  \t                                    Is there a mystery you need to conquer, a job you need to master, or a language you need to learn?  </p>  <p>  \t                                    How come it looks like some people tap into endless pools of intelligence, creativity, and insight?  </p>  <p>  \t                                    Are they genius… and what would you accomplish when you think like a genius, too?  </p>  <p>  \t<strong>The key isn't who you are, where you were born, or what you do for a living. <em>The key is how you THINK</em><em>.</em></strong> How you use your mind is the door to your experience. Geniuses are people who encourage certain processes in their mind. Ultimately, they <em>create time and space for richer mental connections to form.</em>  </p>  <p>  \t                                    Look at Einstein's brain, and you'll see that his brain wasn't any bigger than yours or mine, but it had more neural connections than average. Some areas of his brain packed more punch because of how he used his mind, his thoughts, and his imagination.  </p>  <p>  \t                                    He wasn't born that way either. <strong>Genius thinking increases your intelligence to problem solve, create, focus, and perceive. </strong><em>These are the keys to transforming life (and the world!) from the inside out.</em> That's where your brain training comes in.  </p>  <p>  \t                        With this concise course to productive brain training you:  </p>  <ul>  \t<li><em>Gain mental clarity in work and      play</em></li>  \t<li><em>Reduce stress and remove      self-doubt</em></li>  \t<li><em>See a number of possibilities      where most people only see one</em></li>  \t<li><em>Connect with your deep      intuitive knowledge</em></li>  \t<li><em>Exercise mental mastery in      real-life scenarios</em></li>  \t<li><em>Advance your mind in the      directions you choose</em> (from physics, patents, parenting, writing your book, teaching a course,  academic excellence, skill building, life hacking, world peace,  autodidactic titillation, character development, to developing apps or  building your business... You decide.)</li>  </ul>  <p>  \t                                    To rise above overwhelming \"uh-oh's\", and start getting <strong>on demand epiphanies</strong>, you only need 11 minutes a day for the technique plus 11 minutes for review for a minimum of 11 days.  </p>  <p>  \t<em>You could easily spend $1,000's of dollars</em> searching for solutions... or you can <strong></strong>get right to the heart of the matter in this<strong><em> laser-focused course.</em></strong><br>  \t<br>  \t                                     Genius problem-solving and creativity is not restricted from you. Genius thinking is yours if you're daring enough to:  </p>  <ul>  \t<li>Embrace your potential</li>  \t<li>Seize your passion</li>  \t<li>Trust your self</li>  \t<li>Think bigger</li>  \t<li>And overcome obstacles in a      bold way. </li>  </ul>  <p>  \t<strong>In just a few hours</strong>, you will be thinking in extraordinary, new ways with simple, but wildly effective brain training.  </p>  <p>  \t                                    I understand if you think maybe it works for some people... but I personally guarantee this course will eliminate your self-doubt. You will discover your inner genius. Test it out 11 minutes at a time for 11 days. If you aren't amazed by your personal development and increase in creativity, your problem-solving abilities, and I.Q. boost ..you have a full 30 days to tell Udemy you want a refund.  </p>    <p>  \t<em>Stimulate Your Inner Genius and t</em>ake this course today.  </p>", 
    "end_date": null, 
    "title": "Brain Training Productivity Genius", 
    "price": "20.00", 
    "instructors": "Bodhi Horne", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369812_70b8_8.jpg", 
    "course_url": "https://www.udemy.com/genius-brain-training/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-14T15:05:38Z"
}