{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Based on the latest research and cutting-edge insights from psychology, neuroscience and medicine, this course distills it all into practical lessons and tools to build your self-control.</p><p style=\"\">  <strong style=\"\">Use self-control to improve your health, happiness and productivity</strong></p><ul style=\"\"><li style=\"\">Learn how to train the brain areas in charge of self-control</li><li style=\"\">Get a wide variety of willpower hacks that you can apply right away</li><li style=\"\">Learn to switch from the emotional to the rational brain system</li><li style=\"\">Increase your willpower energy reservoir</li><li style=\"\">And much more</li></ul><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Willpower is a skill, not an innate virtue. This course will teach you how to build it</strong></p><p style=\"\">Self-control affects your life almost constantly. Whether it&#039;s going for a run after work, writing another job application or resisting the temptation of watching another episode Big Bang Theory. All of these decisions depend on your self-control.</p><p style=\"\">When it comes to success, self-control is more important than intelligence. It&#039;s more important than the education you got or how ambitious you are. Research shows that your willpower affects your income, how successful your career is and how healthy you are – both physically and mentally. </p><p style=\"\">This course will teach you to learn and apply the insights psychologists and neuroscientists have had over the last decades. And it will take you on a journey towards understanding and mastering willpower. To maximize your success, health and happiness.</p><p style=\"\"> One more thing: You have a totally unconditional money back guarantee. It allows you to study the course for 30 days and if you are in any way unhappy with it, you will get a full refund, no questions asked! Enrolling in the course is absolutely risk free.</p><p style=\"\"><em style=\"\">Click the &quot;Take This Course&quot; button now and enroll!</em></p>", 
    "end_date": null, 
    "title": "Build your Willpower - The Science of Self-Control", 
    "price": "30.00", 
    "instructors": "Manuel Kraus", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463888_3a71.jpg", 
    "course_url": "https://www.udemy.com/science-of-willpower/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-31T09:14:33Z"
}