{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    Are you SUPER busy &amp; don&#039;t have time to spend hours meditating every day - this is for you. &amp; it works better than most meditation practices.  </p>  <p>  \t            Are you struggling to get into a quiet meditation zone?  </p>  <p>  \t            Is your mind in overdrive? Is your body struggling to relax?  </p>  <p>  \t        This MINDFULNESS TOOL works even better than a &quot;hour&quot; meditation practice.  </p>  <p>  \t<u>The 7 benefits of the 7 minute classes</u>  </p>  <p>  \t  1. The techniques are EASY &amp; VERY QUICK to learn and beneficial for everyone.  </p>  <p>  \t  2. Classes are only 7 minutes and you can do them anywhere, anytime.  </p>  <p>  \t  3. It’s a new way to physically relax your body, &amp; calm your mind to increase happiness.  </p>  <p>  \t  4. Many of the breaths classes can be done in public – when YOU need them most!  </p>  <p>  \t  5. These NEW techniques gives you the tools to cope with everyday stresses.  </p>  <p>  \t  6. The breaths classes really work – they do what they say, and you will feel instant relief!  </p>  <p>  \t  7. You will feel in control of your body and mind.  </p>  <p>  \t  This clever guided technique will get you into a blissful mental and physical zone almost effortlessly, within minutes. It includes a triangle visualisation ensuring your mind feels peaceful and your body relaxes deeply. Includes:  </p>  <ul>  \t<li>Immediately Accessible Fully Guided Video with extra setup tips</li>  \t<li>Fully Guided  Audio with extra setup tips</li>  \t<li>Fully Guided Audio for Repeating if you want to do a longer class</li>  \t<li>Downloadable PDF’s with set up tips and extra information that will help you get the most out of your new skill</li>  </ul>  <p>  \t  YOU KNOW how this goes;  </p>  <p>  \t            Some days are so difficult - you feel annoyed that your mind is too chatty…  You can’t get rid of the mental noise and the more you try, the louder the mind chatter becomes.  </p>  <p>  \t            Or, you become infuriated at noises inside the room or outside… even a ticking clock can be maddening! Your body feels fidgety and some parts of your body refuse to relax. You get more and more frustrated as the bliss you anticipated seems impossible to achieve.  </p>", 
    "end_date": null, 
    "title": "Cant get into Meditation ? Mindfulness is BETTER ! in 7 mins", 
    "price": "35.00", 
    "instructors": "Millie Swann", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/296043_594f_6.jpg", 
    "course_url": "https://www.udemy.com/7-minute-classes-cant-meditate-mindfulness-is-better/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-08T00:51:18Z"
}