{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will provide you with extensive knowledge of the change process. You will not only learn about the need for change, and how people respond to it, but also about both the vision and the mission associated with change.</p>  <p>In order to change the direction or the focus of any organization, we first need to establish a corresponding procedure that will help us make informed decisions. The eight lectures that constitute this course suggest that by using an agreed strategic thinking model, initiators of change can achieve their agreed objectives through the use of a sound methodology.</p>  <p>The course is designed for senior managers, strategists, and business owners who need to re-position. Furthermore, it will help organizations in restructuring elements of their process, and new business startups that are considering entering a market.<br> <br> Upon completion of the lectures you will have gained the following skills:</p>  <ul><li>Understanding      of the need for change</li><li>Strategic      thinking</li><li>Understanding      of how people respond to change</li><li>Knowledge      on how to implement change</li></ul><p><br></p>    <p>Mr. Hunt’s style is often described as ‘inspirational’. His goal is to always create positive change in people with whom he works. He has significant experience in successfully operating at all organizational levels—from the induction phase, through first line management, and right up to board level. Additionally, he is able to strike the appropriate level of debate on every occasion.</p>  <p>Mr. Hunt is the MD and principal facilitator of UK Seminars. His work is well known in many countries, e. g., in Europe, in the USA, in the Middle East, and in India. His delegate evaluations are excellent, averaging 9.0 on a 10 point scale.</p>", 
    "end_date": null, 
    "title": "Change Management Training: Master the Change Process!", 
    "price": "50.00", 
    "instructors": "Lecturio GmbH", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/671208_fdfe.jpg", 
    "course_url": "https://www.udemy.com/change-management-training-lecturio/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-16T15:32:52Z"
}