{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        En este curso aprendes que herramientas necesitas para manejar tus horarios en forma eficiente. Cómo hacer para tener tiempo para ser excelente, y además divertirte, salir con tus amigos, compartir con tu familia y hacer las cosas que te gustan sin estres.  </p>  <p>  \t         Aprendes a manejar las herramientas que te permiten visualizar tu tiempo de una nueva manera muy dinamica y ordenada  </p>  <p>  \t        Esta organizacion podras aplicarla en todo lo que hagas de aqui en adelante en tu vida  </p>  <p>  \t<strong style=\"\">Qué dicen mis alumnos y sus padres?</strong>  </p>  <p>  \t  Diego Fernández Mariaca - Ing. Comercial Universidad de Chile  </p>  <p>  \t  El penúltimo año de clases mis notas empezaron a bajar, los requerimientos del colegio eran más altos que los años pasados y yo tenía déficit atencional. Claramente necesitaba alguna solución.<br style=\"\">  \t  Estudiando las posibilidades decidí ir a probar una clase donde Esther. Al principio estaba muy escéptico pero varios de mis amigos me la recomendaron a ciegas y me dijeron que ella definitivamente era la persona que me podía ayudar.<br style=\"\">  \t  Apenas llegué donde Esther empezó el cambio, no solo me enseñaba física, matemáticas o química si no que al mismo tiempo me enseñaba como estudiar.<br style=\"\">  \t  Después unas semanas decidí hacer un análisis de lo que había aprendido; me di cuenta de que había aprendido a hacer resumes eficientes, plantear problemas de manera correcta, sabia las mañas de los ejercicios, me enfrentaba a los exámenes mejor que antes, aprovechaba mi tiempo mucho mejor que antes y lo principal, mis notas habían subido considerablemente. Todo esto me motivó a seguir estudiando y el problema de la concentración se volvió mínimo ya que disfrutaba lo que hacía.<br style=\"\">  \t  Fue entonces que decidí tomar clases con Esther de manera regular puesto que si bien había aprendido mucho todavía quedaba mucho por perfeccionar. Además el ambiente de estudio era muy agradable con ella y el tiempo rendía muchísimo más.<br style=\"\">  \t  Si alguien me preguntara como es una clase con Esther yo le diría: “Sera una hora extremadamente productiva, donde te exigirán orden y rigurosidad y lo mejor de todo es que saldrás con la confianza de saber perfectamente lo que viste con ella”.<br style=\"\">  \t  Ya creo haber mencionado las aptitudes que aprendí con Esther que aunque parezca extraño me están sirviendo aun más ahora que estoy en la universidad que cuando estaba en el colegio. Es por eso que recomiendo a ciegas a Esther tal como me la recomendaron mis amigos. Sin duda, si conozco a alguien con virtudes para enseñar esa es Esther.  </p>  <p>  \t  ----------------------------------------------------------------------------------------  </p>  <p>  \t  Catalina GONZALEZ DECKER - Institut d&#039;Etudes Politiques de Paris  </p>  <p>  \t  Collège Universitaire d&#039;Études Ibériques et Latinoméricaines  </p>  <p>  \t<br style=\"\">  \t  Cuando busqué a Esther, pensé que iba simplemente a tomar clases de matemáticas. Para mi sorpresa, no fue así. Supe que no era una clase común y corriente desde las primeras consignas: “Lo único que necesitas es un lápiz, una goma, ser ordenada con tus cálculos y divertirte”.<br style=\"\">  \t  Nunca había tenido problemas en ninguna materia en el colegio, y por primera vez me sentía incapacitada a entender. Esa frustración se solucionó con rapidez. Al empezar las clases con Esther, mis notas en matemáticas ascendieron inmediatamente. Logré notas por las que ya me había dado por vencida. Pero independientemente de las notas, logré comprender y disfrutar de lo que estudiaba. Le estuve agradecida a Esther hasta el día en el que salí bachiller, pues con ella había superado el primer obstáculo al que me vi enfrentada académicamente.<br style=\"\">  \t  Sin embargo, tuvieron que pasar unos años más para que me diera cuenta de que lo que de verdad le agradezco a Esther no son solamente las notas alcanzadas en matemáticas. Creo que lo diferente de la experiencia con Esther, es que ella no sólo logra efectos inmediatos, sino también siembra en sus alumnos cosas que se hacen tangibles una vez que estos ya la han dejado.<br style=\"\">  \t  El día de hoy, ya universitaria, las bases con las que trabajo son aquellas que adquirí en esas clases de matemáticas para el colegio. El simple hecho de ser ordenada en mis cuadernos y de saltar líneas entre cada cálculo, hacen que hoy sea organizada a la hora de trabajar y estudiar en cualquier materia. Hoy soy capaz de estudiar con rigor, pero también de manera dinámica y sobre todo con placer. Aprendiendo de la mano de Esther, me hizo también ser consiente de que siempre hay una goma para volver a escribir en el papel, pues si se comenten errores al aprender, siempre hay una vuelta atrás: perdí los miedos a atreverme a lograr cosas por más riesgos que corra. Asimismo, hoy estoy segura de que los obstáculos se presentan en nuestro camino para sobrepasarlos y no para darnos por vencidos…<br style=\"\">  \t  Por eso y mucho más Esther, ¡Te voy a estar eternamente agradecida!  </p>  <p>  \t  ----------------------------------------------------------------------------------------  </p>  <p>  \t  Macri Bastos. Madre y psicóloga clínica.  </p>  <p>  \t  Macri Bastos - Intercambios Culturales Bolivia  </p>  <p>  \t  “Esther Iberkleid, no es sólo una extraordinaria profesora de ciencias exactas, especialmente de matemáticas, es un Maestra que sabe inculcar en sus estudiantes, el Amor por lo exacto, los números, el razonamiento lógico. Ella es muy respetuosa de las limitaciones con las cuales sus estudiantes llegan, trabaja en ellos la auto-confianza, la alegría de aprender aquello que siempre han temido o no les gustaba.<br style=\"\">  \t  He tenido el gusto y el privilegio de que Esther sea la profesora de mis hijos. Ambos esperaban con entusiasmo asistir a sus clases, y llegaban con la dicha de haber aprendido cosas nuevas.<br style=\"\">  \t  No sólo mis hijos han sido recomendados para tomar clases con ella, también los hijos e hijas de mis amigas. Uno paga la hora en Oro, pues sus clases no tienen precio, debido a la experiencia que los chicos reciben de desarrollar el gusto por la ciencia y la lógica.<br style=\"\">  \t  ----------------------------------------------------------------------------------------  </p>  <p>  \t  Sergio Hernán Rovira - La Paz, Bolivia:  </p>  <p>  \t  Gracias a ti Esther sé que todo puede ser posible en esta vida y a veces miramos con nuestros ojos y no asi con el corazón como será en el futuro cercano. Me cambiaste la vida desde la primera clase. Me sientí y me siento revitalizado, grande que puedo hacer cosas que creia que eran literalmente imposibles, pero una charla contigo es un cambio de universo. Una realidad (esta) donde nada es inalcanzable, donde todo es posible y especialmente: DONDE NO EXISTEN LOS LÍMITES Gracias  </p>", 
    "end_date": null, 
    "title": "Como organizar tus horarios con óptima eficiencia", 
    "price": "50.00", 
    "instructors": "Esther  Coronel de Iberkleid", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191544_1ab9_3.jpg", 
    "course_url": "https://www.udemy.com/como-organizar-tus-horarios-con-optima-eficiencia/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-31T07:20:44Z"
}