{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>1. Save you money. </strong>  </p>  <p>  \t<strong>2. Ensure you reach your educational goals. </strong>  </p>  <p>  \t<strong>3. Help you enjoy e-learning.</strong>  </p>  <p>  \t     These are the three outcomes of this comprehensive approach to navigating the complex education environment students <em>of all ages </em>face today.  </p>  <p>  \t     This course provides clear explanations of the state of higher education in the U.S. - all forms of it - and how to navigate and sort that education to find the right programs, courses, and styles of teaching that <strong>speak to your learning needs and goals</strong>.  </p>  <p>  \t     Using recent research into neuroscience and experimental psychology, the course also shows you how to find programs that complement your learning style as well as your pace and level of learning. In short, this course <strong>gives you the tools to customize all of education, including online learning, to you, <em>the learner</em></strong>.  </p>  <p>  \t    Using humorous and polished videos, guided tasks, and quick review quizzes, <strong>this seven hour course will transform you from a novice to an expert on e-learning</strong>. Packed with insider tips, phenomenal organization, and clear guidance, you&#039;ll find this course teaches you to tell <strong>when, how, where, why, and when </strong>you <em>should</em> learn online, and how to <em>enjoy it</em> and <em>succeed at it</em> when you do so.  </p>", 
    "end_date": null, 
    "title": "Cracking the Code: Online Learning for Paper & Pencil People", 
    "price": "20.00", 
    "instructors": "The Learning Lab @ Open Door Ed The Learning Lab @ Open Door Education", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256194_271f_5.jpg", 
    "course_url": "https://www.udemy.com/virtuallearningrealpeople/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-05T19:04:15Z"
}