{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Deja de sufrir tu falta de concentración.</strong>  </p>  <p style=\"\">  \t      ¿El vuelo de una mosca te distrae y saca de tus tareas? ¿Te pones a pensar en otra cosa cuando tienes que estudiar? Mantener la concentración es indispensable para el éxito en tus estudios y trabajo. Saber cómo hacerlo  es la clave para sacar lo mejor de ti. Pero, ¿te ha enseñado alguien cómo hacerlo?  </p>  <p style=\"\">  \t<strong style=\"\">Claves, Acciones y Hábitos.</strong>  </p>  <p style=\"\">  \t      Con esta Píldora Formativa aprenderás a a detectar, evitar y prevenir los elementos que minan tu atención y descubrirás  5 claves para aumentar tus niveles de atención en tus sesiones de estudio. Conocerás nuevos hábitos de estudio que te ayudarán a aprovechar el tiempo al máximo. Y para terminar descubrirás una nueva forma para organizar y trabajar en tus sesiones de estudio que mantendrán los despistes a raya y tu nivel de atención a un nivel más que óptimo.  </p>  <p style=\"\">  \t<strong style=\"\">Directo al grano, Claro y Sencillo</strong>  </p>  <p style=\"\">  \t      En esta píldora formativa te lo cuento todo con ejemplos sencillos, directo al grano y casos prácticos para que la aproveches de verdad. Tu Reflexionarás  y Tomarás  Acción y yo te diré cómo hacerlo.  </p>  <p style=\"\">  \t<strong style=\"\">Además:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">No tendrás que tomar apuntes</li>  \t<li style=\"\">Ni esperar  para aplicarlo</li>  \t<li style=\"\">Ni comerte la cabeza</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Eliminarás Tus Distracciones</strong>  </p>  <p style=\"\">  \t      En la 1º parte de la clase aprenderás a <strong style=\"\"><em style=\"\">detectar y elimina</em>r</strong> todos aquellos elementos que lastran tu atención y concentración. Te explicaré uno a uno cuáles son y qué estrategia puedes desarrollar para librarte de ellos de una vez por todas.  </p>  <p style=\"\">  \t<strong style=\"\">Potenciarás tu Atención</strong>  </p>  <p style=\"\">  \t      En la 2º Parte conocerás los <strong style=\"\"><em style=\"\">5 elementos clave que potencian especialmente tus niveles de atención</em></strong> y elaboraremos juntos una fórmula para estudiar y aprovecharlos al máximo. Tus sesiones de estudio cambiarán por completo.  </p>  <p style=\"\">  \t<strong style=\"\">Principio Clave</strong>  </p>  <p style=\"\">  \t      En la última parte de la clase aprenderás a explotar el principio de la limitación temporal en tus sesiones de estudio.  Verás como de de forma casi mágica nos permite combinar lo aprendido en las dos partes anteriores y disparar nuestros niveles de concentración al máximo.  </p>  <p style=\"\">  \t<strong style=\"\">Qué obtendrás con la clase:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"> 1 hora de clase en 7 vídeos en HD directos al grano y sin material de relleno.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Un Pack de hojas de Trabajo que contiene lo necesario para que pongas en practica lo aprendido:</li>  \t<li style=\"\">Una hoja de trabajo para para detectar los enemigos de tu atención.</li>  \t<li style=\"\">Una hoja de chequeo de distractores para tu sesión de estudio</li>  \t<li style=\"\">Una hoja de chequeo con los potenciadores de atención</li>  \t<li style=\"\">Un mapa mental a todo color con los enemigos de tu atención (para imprimir)</li>  \t<li style=\"\">Un mapa mental a todo color con los potenciadores de tu atención (para imprimir)</li>  \t<li style=\"\">Un mapa mental  a todo color con todo el contenido del curso (para imprimir)</li>  \t<li style=\"\">Una hoja de enlaces interesantes dónde puedes recabar más información</li>  </ul>", 
    "end_date": null, 
    "title": "Cómo Mejorar La Concentración", 
    "price": "25.00", 
    "instructors": "Raúl Laso", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266366_5963_2.jpg", 
    "course_url": "https://www.udemy.com/como-mejorar-la-concentracion/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T10:38:47Z"
}