{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Overcome procrastination, lack of focus and motivation</strong><span style=\"\"><strong style=\"\"> </strong></span>to make the daily choices to achieve success in life. Discover that you have the ability to <strong style=\"\">select profitable choices</strong> and follow through on them.</p><p style=\"\">Your life situation is a reflection of all the choices you have made. I<strong style=\"\">f you want a different result, make difference choices.</strong></p><p style=\"\">Choice Point Consequences is going to help you have your choices reflect your hopes, not your fears. </p><p style=\"\">Every video lecture has an accompanying worksheet to reinforce what you learned. </p><p style=\"\">You must have Microsoft Excel to utilize one of the tools. This Excel worksheet is completely automated, so you don&#039;t have to know how to use Excel</p><p style=\"\">You must take this course if you are feeling frustration by your lack of direction in life. If you are not making the progress you want, than you need the self-accountability tools included in this program. </p><p style=\"\">The barrier between where you are today, and where you want to end up, is made up of the daily choices you make. It&#039;s time to make profitable choices that will impact your life and achieve staggering results. </p>", 
    "end_date": null, 
    "title": "Daily Choices can create Radical Profit", 
    "price": "20.00", 
    "instructors": "Michael Reeves", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582304_e2d8_5.jpg", 
    "course_url": "https://www.udemy.com/choice-point-consequences/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T16:30:57Z"
}