{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*** COURSE FULLY UPDATED FOR JANUARY 2016 ***</strong><br><br>Hi everyone,</p><p>Welcome to the course How To Be Super Focused and Productive in No Time!</p><ul>\n<li>Does your mind often wander in the middle of conversations? </li>\n<li>Do you go to Facebook for just 5 minutes, but find yourself still on it 2 hours later?</li>\n<li>At the end of the day, do you often feel like you have been busy but haven’t really accomplished  anything?</li></ul><p><br></p><p>If your answer to one or more of these questions is yes, then <strong>this</strong> is the course for you!</p><p>What if I told you that you could radically change all of this TODAY?! </p><ul>\n<li>You could have a <strong>razor sharp focus</strong> </li>\n<li>You could be <strong>highly productive</strong> every single day</li>\n<li>And most important of all: <strong>ACHIEVE ALL YOUR GOALS</strong>.</li>\n</ul><p><br></p><p>Imagine: how great would you feel at the end of a day during which you were super focused and  productive?</p><p>You can make this change RIGHT NOW, by taking this course.</p><p>In this course you will learn:</p><ul>\n<li>What focus is</li>\n<li>Why you need focus</li>\n<li>That the capacity to focus can be trained</li>\n<li>The foundation of focus</li>\n<li>The BEST techniques I know to make your focus razor sharp</li>\n<li>Smart tools to use your focus efficiently to become super productive</li>\n<li>How to GET STUFF DONE</li></ul><p><br></p><p>Over the past years, I have personally tested all the techniques and tools that you will be learning in this course. And I can tell you that each of them is a jewel in its own right!</p><p>So don’t wait any longer. Click on the <strong>Take This Course</strong> button to the right. Let’s get started. I will see you inside!</p>", 
    "end_date": null, 
    "title": "Develop Super Focus and Boost Your Productivity in No Time!", 
    "price": "25.00", 
    "instructors": "Peter Cook", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651260_b55d_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-super-focused-and-productive-in-no-time/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T14:16:17Z"
}