{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>I'm Dragos Stefanescu - a Top Udemy Instructor with 12 successful courses, 10,000+ students and 450+ Five Star Reviews - and I'm looking forward to teaching you this course.</strong></p>\n\n<p>Digital Productivity - Or how to make technology work for you in the most efficient manner possible. </p>\n\n<p>I created this product because for a long time I'd been struggling with my efficiency levels, especially when working on digital devices and being around them all the time. I thought \"Why not share all the apps I use?\" - from Note-taking to Email &amp; Social Media Productivity - so that people can replicate the processes I use to stay productive and keep efficiency levels high.</p>\n\n<p>If you're like, then you've had situations where you looked back at your workday and thought you haven't realised much. This is completely normal - we can get distracted by so many things that it's hard to stay organised and focused. But what if you could indeed squeeze in those 2 extra hours of productive work every day? Does that sound like something you'd want to be able to do?</p>\n\n<p>On\naverage, we spend more time using electronic devices than we do sleeping. Most\nof our working hours  revolve around\nchecking emails, browsing the web, doing spreadsheets or participating in\nconference calls, whether on our laptops or smartphones. But how much of this\ntime do we spend being productive and how much of it is wasted on Facebook,\nwatching cat videos or listening to music?</p>\n\n<p><strong>The Content</strong></p>\n\n<p>Here are a few things that we will be covering in this course:</p>\n\n<ul>\n <li><strong>Digital Note\n     Taking 101:</strong> Save\n     precious minutes on a daily basis, be more organised &amp; have a go-to\n     place for notes, tasks &amp; content creation. We'll look at software such as OneNote and Evernote.</li>\n <li><strong>Email\n     Productivity Hacks: </strong>Use Gmail and other tools and eliminate 30 painful minutes of\n     email checking every day</li>\n <li><strong>Procrastination\n     Killers: </strong>Productivity\n     apps to eliminate bad habits when working on your laptop or phone</li>\n</ul>\n\n<p>The\ncourse also includes bonus topics such as Social Media Productivity, Managing\nTeams &amp; Tasks  and Other Productivity\ntools and hacks.</p>\n\n<p><strong>The Guarantee</strong><br></p>\n\n<p>There is\na 30 day Money-back guarantee that comes with this course, but given the\nquality of the content you won't even consider it. If you want to become a\nDigital Productivity Guru, then enrol in this course now and I'll see you in\nthe virtual classroom.</p>", 
    "end_date": null, 
    "title": "Digital Productivity", 
    "price": "20.00", 
    "instructors": "Dragos Stefanescu, Richard Korbut", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634676_065c_3.jpg", 
    "course_url": "https://www.udemy.com/digital-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T10:21:17Z"
}