{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em style=\"\">Kennen Sie das? Sie haben wieder zuviel Aufgaben und nur zu wenige davon geschafft? Da sind Sie nicht alleine! Aber es gibt Hilfe, einfache Hilfe, die Ihnen diese Last nehmen kann! In diesem Kurs lernen Sie, wie Sie Ihre Aufgaben mit Wunderlist in den Griff bekommen können.</em></p><ul style=\"\"><li><strong style=\"\">Wie werde ich Herr von zu vielen Aufgaben?</strong></li><li><strong style=\"\">Wie kann ich diese Priorisieren?</strong></li><li><strong style=\"\">Wie arbeite ich Aufgaben ab?</strong></li><li><strong style=\"\">Was mache ich mit zu großen Aufgaben?</strong></li></ul>Ich <strong style=\"\">selbst</strong> nutze Wunderlist und die dahinterstehen Konzepte für mein <strong style=\"\">digitales Zeitmanagement</strong> schon eine lange Zeit. Es hilft mir, und das jeden Tag. Dieser Kurs ist einfach, nicht besonders lang, aber effizient. Er zeigt, wie Sie mit Wunderlist ein digitales Zeitmanagement aufsetzen, in dem Sie Ihre Aufgaben effizient abarbeiten. Jeder hat Aufgaben zu erledigen, <strong style=\"\">auch Sie</strong>! Oft wird das aber nicht zielführend getan.<p>Nehmen Sie an diesem <strong style=\"\">digitalen Zeitmanagement Kurs mit Wunderlist teil</strong>, wenn Sie die folgenden <em style=\"\">technischen</em> Kriterien erfüllen!</p><ul style=\"\"><li>Sie benötigen Zugang zum Internet</li><li>Sie benötigen mindestens einen PC mit aktuellem Browser</li><li>Sie benötigen (optional, aber empfohlen) ein mobiles Endgerät, auf dem Wunderlist läuft</li></ul><p>Und dann betrachten Sie einmal Ihre Arbeit:</p><ul style=\"\"><li>Haben Sie viele Aufgaben und wissen nicht immer, welche Sie machen sollen?</li><li>Vergessen Sie des öfteren Aufgaben?</li><li>Sehen Sie die wichtigen Aufgaben vor lauter anderen Aufgaben nicht?</li><li>...</li></ul>Dann sind Sie der perfekte Kandidat für meinen Kurs - jetzt schnell anmelden :-)", 
    "end_date": null, 
    "title": "Digitales Zeitmanagement mit Wunderlist", 
    "price": "20.00", 
    "instructors": "Sebastian Schneider", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560106_8606.jpg", 
    "course_url": "https://www.udemy.com/digitales-zeitmanagement-wunderlist/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T06:41:56Z"
}