{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong></strong><strong></strong></p><p><strong>Do you want to quickly complete your next goal or project? </strong></p><p><strong>This course has a 4.8/5 Star rating with 51 Reviews and over 1800 students!</strong><br></p><p><strong>Students who take this course complete 65% more lectures than students in similar Productivity Courses</strong><strong> offered on Udemy. </strong>(This is an Engagement metric only shown to instructors.)</p><p>Stop going from project to project and never finishing one. Get the satisfaction and relief that comes with completing what needs to get done in your life. The best part is when you realize you have more time to enjoy your life.<br></p><p><strong><em>\"The Instructor spoke well and had a way of speaking that is engaging...This is one of the very few good online courses that I actually finished because the instructor wasn't boring. Highly recommended!!!!!!\"</em> Ralph Guichette</strong></p><p>This course doesn't just give you some principles and tell you to \"just go do it.\" It is a hands-on action course where you will learn specific strategies and take the steps to get you from point A to point B.<br></p><p><strong>UPDATE March 14, 2016</strong><br>Added: <em><strong>BONUS - Communication Worksheet</strong></em><br></p><p>I have designed several proprietary downloadable forms just for this course:</p><ol><li>STEP 1 - DO IT NOW FOCUS</li><li>STEP 2 - DO IT NOW ACTION</li><li>STEP 3 - DO IT NOW ADJUST</li><li>Do It Now Step By Step</li><li>Do It Now Sample Questions</li></ol><p><strong><em>\"This course was designed for me. I'm always starting something and never finish it. Well I finished this course and have started using it to help finish a project I started weeks ago.\"</em> John L</strong></p>You can learn to use the exact same strategies that I used to complete the many projects and goals in my life, including:<ul><li>Earned an Optics Engineering Degree from the University of Rochester.</li><li>Started an International Film Festival in Atlantic City, NJ.</li><li>Wrote and published a nonfiction book about fixing the world.</li><li>Created and launched a relationship app (Android/Apple).</li><li>Opened a themed coffee house and sold it a year later.</li><li>Invented a poker product and sold it to Spencer's Gifts.</li><li>Created three Udemy Courses and much more!</li></ul>...all while being a single parent since my son was 2 years old.<p><br><strong><em>This class was exactly what I needed. I needed to know that I was not the only one not completing courses , but I had the power to change. Very well done!</em><em> </em>Ann-Marie Wedderburn</strong><br></p><ul><li>This course has a 30 Day Money Back Guarantee - Full Refund - No Questions Asked!</li><li>Once you enroll, you have unlimited lifetime access!</li><li>You will have instant and free access to all future updates.</li><li>I am here to help. I offer my full support to whatever questions or needs you may have. My goal is to see you get things done!</li><li>You can check out a few lectures for free before you make a financial commitment. Lectures: 1, 3, 29 &amp; 36.</li></ul><p><strong>Signup now and start completing projects this week! Make a positive change in your life.</strong></p>", 
    "end_date": null, 
    "title": "Do It Now: Become A Person Who Finishes What They Start", 
    "price": "20.00", 
    "instructors": "Joe Fedison", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/470398_44f4_12.jpg", 
    "course_url": "https://www.udemy.com/do-it-now-become-a-person-who-finishes-what-they-start/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-08T02:09:07Z"
}