{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                      THOUSANDS OF SUCCESSFUL STUDENTS HAVE ALREADY ENROLLED IN MY COURSES, GIVING THEM TONS OF 5-STAR REVIEWS.  </p>  <p>  \t      LATEST: 7 new lectures was added to the course on the 31st of October 2014. New short lecture in concept mapping was added on the 4th of November 2014.  </p>  <hr style=\"\">  <blockquote style=\"\">  \t<em style=\"\">“It is not that often that I get to see things in a new light like this, but now I get to rethink everything I know about my field in this whole new light. That is so exciting!” - A Student</em>  </blockquote>  <hr style=\"\">  <p>  \t                    Do you know the top three skills employers are looking for in potential employees?  </p>  <ol style=\"\">  \t<li>The      ability to communicate effectively, orally and in writing (89%)</li>  \t<li>Critical      thinking and analytical reasoning skills (81%) </li>  \t<li>The      ability to analyze and solve complex problems (75%)</li>  </ol>  <p>  \t                    More specifically, do you know what Google rates as top qualities when hiring people?  </p>  <p>  \t                    These are words from Laszlo Brooks, Senior Vice President People Operations at Google: “<em style=\"\">Analytical training</em> gives you a skill set that differentiates you from most people in the labor market” and “We recruit for <em style=\"\">aptitude, for the ability to learn new things</em> and incorporate them.”  </p>  <p>  \t                    Do you know which major that outperforms all other majors on the Verbal Reasoning and Analytical Writing tests on the GRE?  </p>  <p>  \t<strong style=\"\">PHILOSOPHY!</strong>  </p>  <p>  \t                    Do you know what Former HP CEO Carly Fiorina, investor Carl Icahn, Hedge fund manager George Soros, Flickr co-founder Stewart Butterfield, PayPal co-founder Peter Thiel, LinkedIn co-founder Reid Hoffman have in common?  </p>  <p>  \t<strong style=\"\">They all majored in ... PHILOSOPHY! </strong>  </p>  <p>  \t                    In this course I am going to teach you 2 500 years of philosophy in just 3 hours.  </p>  <p>  \t<strong style=\"\">Why? To propel your career! You will get a competitive edge in almost any job situation! </strong>  </p>  <p>  \t                    Not fully understanding how the key foundations of thought, language, human constructions and the natural world hang together results in so many errors, bad judgments, misunderstanding and terrible communication. More than you can imagine.  </p>  <p>  \t                    I am not a quote machine just throwing fancy quotes from famous philosophers. I am going to give you the essentials from a number different theories and tie them together for you in an easy to understand framework. If some areas are a little bit hard to grasp, then you can just listen to it again and again or post a new discussion in the forum.  </p>  <p>  \t                    The course is divided in about 30 short high quality video lectures and quizzes which cut to the chase about the key foundations of modern philosophy.  </p>  <hr style=\"\">  <p>  \t                                About the course  </p>  <ul style=\"\">  \t<li>Full, lifetime access</li>  \t<li>All future extra lectures and upgrades are always included for free</li>  \t<li>Unconditional Udemy 30 day money-back guarantee – but you will not need it!</li>  \t<li>Over 30 high-quality video lectures and quizes to enjoy wherever you are and from a multitude of devices</li>  </ul>  <hr style=\"\">  <blockquote style=\"\">  \t<em style=\"\">&quot;I consider this a FAR better value for the price than most college courses I’ve taken, and I took a rigorous engineering course of study, so that is all the more impressive.&quot; - A student</em>  </blockquote>  <hr style=\"\">  <p>  \t<strong style=\"\">          Click the “take this course” button, top right, now to get the winning competitive edge in your working life or career development!</strong>  </p>  <hr style=\"\">", 
    "end_date": null, 
    "title": "Do Like The Pros: Learn Philosophy To Get The Winning Edge", 
    "price": "20.00", 
    "instructors": "Per Emanuelsson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322002_0601_6.jpg", 
    "course_url": "https://www.udemy.com/learn-philosophy/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T09:08:27Z"
}