{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul>  \t<li><em><strong>Over 40,500 people from 179 countries enrolled in my courses</strong></em></li>  \t<li><em><strong>Featured as one of the Best courses on Udemy</strong></em></li>  \t<li><em><em><em><strong>Overall, 1100+ TOP </strong></em><em><strong>Reviews from very happy students</strong></em></em></em></li>  </ul>\n\n<p>This course will dramatically increase your level of Productivity. It is comprised of solid mindset strategies, but it will also equip you with proven techniques and simple methods that will boost your Productivity and help you Get Things Done in a very short period of time.  </p>\n\n<p>  \t                  Moreover, it is constantly updated with bonus material and I always answer all your questions in a comprehensive way. Congratulations for your commitment to become more productive, improve yourself and let our journey begin! Double your productivity and change your life.  </p>\n\n<p><strong>What students say about this course:</strong><em>\"Great material and very professional presentation\"</em><em> - <strong>Sebastian Maloro<br></strong></em></p><p><em><em>\"T</em><em>he best!! </em><em>Jimmy's courses are the best!!! very high quality...\"</em> - <strong>S</strong><strong>andy </strong></em><strong><em>Allan<br><br></em></strong></p><p><em>\"Good for anyone. </em>Jimmy did great job explaining things and giving us his experience. Only thing that may need bit tweaking is outsourcing section as it mainly focus on West Countries. It would be good to hear opinion on this from perspective of people from East countries (e.g. Bangladesh, India, Ukraine, Serbia, Bulgaria, Taiwan, etc.). <em>But in any case I rate this one with 5 stars as it helped me a lot. Good work Jimmy\".</em> - <strong>Alexander Varicak</strong></p>\n\n<p><em>\"Wonderful Course! There are many many points mentioned during the course. Some of them simple points but very important ones that we usually ignore in life. I would recommend this course to all the people for whom their time is important and also to those that may have always suffered from procrastination or running out of time, those who can not manage to work with 100% of their energy and concentration\".</em> - <strong>Shiva</strong>\"Very Good Course. Great course, enjoyed watching the videos. I think that everybody can find some useful point over the course to change himself or some bad habits\". - <strong>Svetoslav Marinov</strong></p>\n\n<p><em>\"A great course which can help anyone. </em><em>I expected quite a lot from this course and I have to say that it surpassed every expectation. The lectures were really useful for me and they also will be in the future. </em><em>The videos are all of a really high quality and the lectures are told by someone who is really enthusiastic about what he does and what he learns us. </em><em>Thank you for this great course!\"</em> - <strong>Kevin Voetelink</strong></p>\n\n<p><strong>\"</strong>Very good course, extraordinary production. <em>This course provides a lot of tools to increase productivity. I already knew a few of them, but many others were new to me, and besides that, I always appreciate a refresh. </em><em>I appreciated the delivery, very friendly and down-to-Earth, very different from Tim Ferriss' blunt and smug approach, even when they talk about the same things. </em><em>The production quality is great, probably the top you can find in Udemy. </em><em>The course is also frequently updated, so it is likely to remain current for the upcoming future.\" </em>- <strong>Andrea Gini</strong></p>\n\n<p><em>\"</em>Worth every Penny. This was my first Course I bought from Jimmy. Since I want to start as an Entrepreneur, I began to search for advices to improve my productivity and found this course. I assure you, buying this course was one of my best ideas. Thanks for the awesome content, Jimmy. <em>Greetings from Germany\" </em>-<strong> Enis Tola</strong></p>\n\n<p>\"Jimmy is the best. Jimmy makes the best courses about development of your personality. Lots of examples, nice flow, very easy to understand language, great humor. Just buy this course it is worth every penny.\" - <strong>Arkadiusz Wlodarczyk</strong></p>\n\n<p><strong><em>\"</em></strong><em>I feel my productivity has more than doubled.</em><em>I'm also a Udemy instructor and entrepreneur, and even though I've always been extremely productive, I felt by the end of 2014 that my productivity had drastically decreased compared to previous years, up to the point where I was worried I had lost my ability to be productive altogether. </em><em>After taking a good holiday and watching this course in it, I've come back to work more productive as I ever was. I'm putting in place many of the techniques I learned in this course like morning rituals, critical tasks of the day and distraction-free hours, also batching work and identifying time wasters and bottle necks...</em><em>\"</em> - <strong>Pablo Farías Navarro</strong></p>", 
    "end_date": null, 
    "title": "Double Your Productivity and Get Important Things Done", 
    "price": "25.00", 
    "instructors": "Jimmy Naraine", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203536_4142_3.jpg", 
    "course_url": "https://www.udemy.com/double-your-productivity-and-get-important-things-done/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-22T23:20:50Z"
}