{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Descripción y contenidos del curso</strong></p>  <p>Este curso online te muestra de forma práctica los comandos que yo utilizo en Adobe Acrobat, PDF Converter y PDF PW remover, para agilizar la escritura de los manuscritos que planeo publicar en revistas o capítulos de libros con calidad internacional.</p>  <p>En estos videos, te comparto mis secretos para asegurar tu éxito en la publicación científica / escritura académica utilizando las herramientas de software disponibles en la actualidad.</p>    <p>Aprenderás los aspectos prácticos para utilizar comandos específicos, en cada uno de los o fuerzas presentados, para poder realizar tareas especializadas. Éstas son funciones que los profesionales usualmente se guardan como sus “secretos para el éxito”:</p>    <p><em><strong>Adobe Acrobat profesional, edición de archivos PDF.</strong></em></p>  <ol><li>Ejemplo real de solicitud de edición PDF con Adobe.</li><li>Insertar, reemplazar y remover texto.</li><li>Resaltar texto, dejar notas o comentarios.</li><li>Reconocimiento de caracteres en idioma español.</li><li>Reconocimiento de caracteres en idioma inglés.</li><li>Recortar el tamaño de las páginas de un archivo PDF.</li><li>Creación de un archivo PDF utilizando Microsoft Word.</li></ol>                <p><strong><em>P</em><em>DF Converter, para transformar archivos PDF.</em></strong></p>  <ol><li>Convierte archivos PDF a formatos Word, Excel o PowerPoint.</li></ol>    <p><em><strong>PDF PW remover, edición de archivos PDF protegidos.</strong></em></p>  <ol><li>Remoción de la protección de un archivo PDF.</li><li>Reducción del tamaño de un archivo PDF con Adobe Acrobat.</li></ol>        <p><br><strong></strong></p><p><strong>Dinámica de enseñanza y recursos educativos </strong></p>    <p>La enseñanza lo largo del curso se basa en la presentación de vídeos que pueden visualizarse en cualquier equipo electrónico con conexión a Internet.</p>  <p>Algunas secciones (grupos de vídeos para un software específico), pueden acompañarse de archivos complementarios los cuales podrás descargar a tu computadora utilizando los links específicos para cada archivo.</p>  <p>Esos archivos pueden contener ejemplos que se utilizaron en los diferentes videos para reproducir los ejercicios presentados; o bien pueden ser guías de estudio, o tablas de contenido en formatos PDF, con el propósito que lleves un control de tus avances en el curso.</p>  <p>En cualquier momento el alumno puede reproducir los ejemplos mostrados utilizando sus propios escritos.</p>    <p><em>Duración del curso</em></p>  <p>El curso tiene una duración aproximada de 60 minutos (1 hora), distribuida en 12 vídeos cortos; el orden de los temas presentados puede modificarse de acuerdo a tus conocimientos previos y necesidades de revisión de temas específicos.</p>  <p><strong> </strong></p>  <p><strong> </strong></p>  <p><br><strong></strong></p><p><strong>Beneficios</strong></p>  <p>Al terminar este curso serás capaz de utilizar por ti mismo los comandos seleccionados, para cada uno de los software.</p>  <p>Observarás un aumento en tu productividad y en la calidad de los manuscritos que generas día con día.</p>  <p>Habrás aprendido un conjunto de habilidades/destrezas altamente especializadas que te darán una ventaja competitiva para el desarrollo de tus actividades laborales y/o académicas incluso para competir con profesionales en cualquier parte del mundo.</p>    <p><strong> </strong></p>  <p><br><strong></strong></p><p><strong>Porque deberías registrarse en este curso</strong></p>    <p>Éste curso está diseñado para ser una herramienta de aprendizaje indispensable para personas en cualquier área del conocimiento interesadas en empezar a escribir, o bien para aquellos que ya escriben quiere llevar sus escritos a un nivel de calidad superior.</p>  <p>Empezará a incrementar tu productividad de forma inmediata al terminar cada vídeo.</p>  <p>Los comandos avanzados que se utilizan, son los mismos que emplean las empresas o escritores profesionales para producir escritos de alta calidad, tanto en revistas especializadas o incluso en capítulos de libros alrededor del mundo.</p>  <p>El curso es una herramienta de apoyo para aquellos que tienen que realizar un escrito, bien sea por motivo de trabajo (profesionales que se dedican a escribir: escritores literarios, periodistas, etc.), o porque tienen que realizar algún reporte para propósitos de titulación (escritura de una tesis) en niveles de licenciatura y posgrado (maestría, doctorado, posdoctorado) en cualquier área del conocimiento.</p>  <p><strong> </strong></p>", 
    "end_date": null, 
    "title": "Edition de PDFs con|Acrobat|PDF-Converter|Password-Remover.", 
    "price": "20.00", 
    "instructors": "Ernesto Roldan Valadez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/762730_5ba0_2.jpg", 
    "course_url": "https://www.udemy.com/adobe-acrobat-pdf-converter-y-pw-remover-para-publicacion/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-15T01:53:13Z"
}