{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Die nächste Klausur oder mündliche Prüfung steht an oder die Abschlussprüfung ist nicht mehr lange hin? Fast automatisch macht sich die Frage in uns breit: „Wie soll das nur alles in meinen Kopf passen?“</strong></p><p>Wenn es um Prüfungen geht, für die Sie lernen müssen, ist es egal, ob es sich um eine Klausur in der Oberstufe handelt, die Abiturprüfungen, die Prüfungen im Rahmen einer Ausbildung oder einer Fortbildung oder Klausuren und Prüfungen im Studium. Das Gefühl ist das gleiche – ebenso wie die <strong style=\"\">Lerntechniken</strong>.</p> Aber was sind Lerntechniken? Lerntechniken sind wissenschaftlich erforschte Methoden, um Fakten und Zusammenhänge kurz-, mittel oder langfristig zu erlernen, also abrufbereit zu speichern. Effektives Lernen besteht in der Regel aus einer Kombination verschiedener Lerntechniken, wobei nicht jede Lerntechnik für jeden Lerntyp gleich effizient ist.<br style=\"\"><br style=\"\"><p>Dieser Kurs wird Ihnen helfen, zu verstehen, welcher Lerntyp Sie sind und mit welchen Lerntechniken Sie am besten lernen und sich auf Ihre Prüfungen vorbereiten.</p><p>Ich zeige Ihnen die Grundlagen für effektives Lernen, stelle Ihnen verschiedene Lerntechniken vor und wie Sie diese erfolgreich anwenden und gebe Ihnen wichtige Tipps und Tricks an die Hand, wie Sie mit Schwierigkeiten und Problemen beim Lernen am besten umgehen.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Effektives Lernen", 
    "price": "20.00", 
    "instructors": "Jürgen Wulff", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605042_5c2c_2.jpg", 
    "course_url": "https://www.udemy.com/effektiveslernen/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T17:47:00Z"
}