{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Se você tem a sensação de que as 24 horas do seu dia não são suficientes para fazer tudo o que você precisa, se você está sempre atrasado, não consegue dar conta dos seus compromissos, se não consegue arranjar um tempinho para se divertir nem dar atenção à sua família, e se você quer terminar as coisas que você começa e parar de procrastinar, esse treinamento definitivamente é para você.</strong></p>  <p>Você vai aprender passo a passo como organizar sua rotina para ter mais tempo livre, energia e tranquilidade para concluir as coisas que você começou e se dedicar ao que você realmente quer fazer.</p>  <p>Você vai aprender a focar nas coisas certas e eliminar tudo aquilo que atrapalha seu desempenho e impede você de evoluir.</p>  <p>Se tornar uma pessoa mais produtiva e conseguir aproveitar melhor a vida é uma questão de escolha. E nesse curso, com um pouco de empenho e disciplina você vai aprender a:</p>  <ul><li>Pensar de forma mais produtiva</li><li>Preparar seu corpo e sua mente para ter mais energia e disposição</li><li>Eliminar as distrações que só te atrapalham e consomem seu tempo</li><li>Descobrir o que é importante e eliminar o que não é</li><li>Formular metas detalhadas e criar um plano de ação</li><li>Criar novos hábitos e corrigir os vícios</li></ul><p><span></span></p><p><span></span>Não existe nenhuma exigência para fazer esse curso, pois qualquer pessoa é perfeitamente capaz de se tornar mais produtiva desde que se comprometa a aplicar as lições do curso.</p>            <p>As dicas que você vai ver aqui estão totalmente FOCADAS EM AUMENTAR E MELHORAR seus níveis de planejamento, foco e ação.</p><p><strong><strong>Você vai conhecer algumas soluções para resolver seus problemas decorrentes da falta de tempo, e ainda mais importante do que isso, você vai aprender a criar suas próprias soluções.</strong></strong><br></p><p>E você pode aprender tudo isso quando e onde você quiser, acessando o curso do seu computador, tablete ou smartphone. Além disso, você tem 30 dias de garantia, ou seja, se por qualquer motivo você não gostar do curso é você pode solicitar o reembolso</p><p><strong>Clique no botão fazer este curso para descobrir como eliminar a\nprocrastinação e se tornar mais produtivo. Nos vemos no curso, até lá!</strong><br></p>", 
    "end_date": null, 
    "title": "Elimine a Procrastinação e Aumente sua Produtividade", 
    "price": "20.00", 
    "instructors": "Ismar Souza", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641398_5f75_7.jpg", 
    "course_url": "https://www.udemy.com/produtividade/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T14:24:30Z"
}