{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        Me encanta escribir. Si supiera escribir bien lo haría más a menudo.  Son frases habituales del entorno de la escritura. ¿Siempre has pensado  que escribías, pero que todo quedaba ahí, en las hojas donde apuntas tus  ideas?, o ¿estás pasando por un momento personal delicado y quieres  superarlo? Aprender a escribir puede ser la solución.  </p>  <p>  \t        ¿Cuál es la  diferencia entre escribir para uno mismo y hacerlo para los demás? Que  la experiencia personal se convierte en literatura. Escribir es un acto  de confidencia que saca a la luz la intimidad del autor, persiguiendo un  objetivo concreto: que la escritura le haga libre. Este es el objetivo  de Escritura productiva, empezar a escribir desde el primer momento.  </p>  <p>  \t        Aquí aprenderás a convertir tus ideas en texto, a corregirlo y a valorar su alcance en el lector. Además observarás la diferencia entre escribir un texto literario y una carta, o entre una carta personal y una profesional. Sabrás crear contenido de blog, Twitter, medios escritos, con la técnica más sencilla posible: la escritura espontánea.  </p>  <p>  \t        Si escribes, te gusta escribir, pero nunca nadie te ha dicho si está bien lo que escribes o nadie te señala el camino a seguir para publicar lo que escribes, no debes perderte este curso.  </p>  <p>  \t    Además, todos los alumnos de este curso publicarán sus textos en el blog <strong>Interés productivo</strong>, que tiene, al lanzamiento de este curso, cerca de 300.000 visitas.  </p>", 
    "end_date": null, 
    "title": "Escritura Productiva, escribe y socializa tus sentimientos", 
    "price": "20.00", 
    "instructors": "Robertti Gamarra", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326416_7b86_2.jpg", 
    "course_url": "https://www.udemy.com/escritura-productiva-escribe-y-socializa-tus-sentimientos/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T14:04:51Z"
}