{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Whether you're an entrepreneur, a designer, a writer, or a leader of an organization, you have to be brilliant every day in order to thrive. You must decide which kind of value you’ll create, solve complex problems in order to do it, and deal with the pressures of the marketplace, all while making it  look easy to your boss or clients. However, over time all of that pressure can begin to wear on you, and cause to burn out, or experience frustration and a lack of passion for your work. </p><p>In this course, you will learn about the unique pressures creative pros like you face each day, and how to build practices into your everyday life to help you not only deal with them, but use them to your advantage. </p><p><strong>Always running out of time? </strong>I’ll teach you how to use your time more effectively.</p><p> <strong>Struggling to find inspiration for your project?</strong> I’m going to show you how to tap a deep source of inspiration that will keep the ideas flowing. </p><p><strong>Feeling like you’re always running on empty?</strong> I’ll show you how to prioritize your creative work so that you always have momentum in the right places at the right time. <br></p><p>Through this course, you will obtain clearer thinking, more focus, better relationships, increased energy, and more high-quality ideas when you need them most. In short, you’ll learn to thrive under the very pressures that often cause others to throw in the towel.</p>", 
    "end_date": null, 
    "title": "Everyday Brilliance: Productivity For Creative Pros", 
    "price": "40.00", 
    "instructors": "Todd Henry", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605802_ef85.jpg", 
    "course_url": "https://www.udemy.com/everyday-brilliance-productivity-for-creative-pros/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T11:49:06Z"
}