{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>Over 1400 students enrolled!</li><li>Last updated April 2016</li><li>Can be completed and put into action in just a few hours !</li></ul>\n\n<p>Sample student messages and reviews:</p>\n\n<p><em><strong>I love your organizing method. I'm in the process of downsizing, moving from a larger house to a smaller apartment, and your course makes it feel more doable. Thanks again. Feel free to use this note as a review. Christine H.</strong></em></p>\n\n<p><em><strong>Great intro to Productivity Processes: This was my first Udemy course. It gave me a chance to understand the Udemy learning process, and I picked up several wonderful nuggets to help me to be more productive. Michel S.</strong></em></p>\n\n<p><strong><em>------------------</em></strong></p>\n\n<p>You will learn simple but powerful tools to increase your personal productivity- without increasing your workload. This is a great beginner course for those wanting to increase productivity-<strong>in just a few hours you will take control of your weekly schedule and accomplish more with less stress using the strategies and tools in this personal productivity tutorial :</strong></p>\n\n<ul><li>Mini-motivators</li> <li>Time management tools</li> <li>Planning strategies</li> <li>Personalized Time Tracker Tool</li> <li>Focus Projects</li></ul>\n\n<p><br></p>\n\n<p>Together, we take a step-by-step approach to this course. You will create your own mini-motivators, memorize time- management tips and learn planning strategies for your weekly schedule. You will also receive an easily -personalized time-tracker tool. As you learn to identify your priorities and to develop weekly focus projects, you will start to see immediate results in your ability to achieve what is important to you.</p>\n\n<p>You can try this course without risk- there's a 30 day money-back guarantee. You can only become more productive and satisfied with what you are able to accomplish each week!</p>\n\n<p>Enroll now and I'll see you in the course.</p>", 
    "end_date": null, 
    "title": "First Steps to Productivity: Get More Done Next Week !", 
    "price": "20.00", 
    "instructors": "Carol Harvey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510944_58e7_4.jpg", 
    "course_url": "https://www.udemy.com/first-steps-to-productivity-get-more-done-next-week/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T15:05:28Z"
}