{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>To have fun and enjoy life, or settle down and get a lot done?</p>\n\n<p><em>What if you could do both?</em></p>\n\n\n\n<p>Between the 3 of us, we have written and published 23 books, spoken to thousands of people, and created dozens of workshops and training courses.</p>\n\n\n\n<p>And we did it all while enjoying the heck out of life...travelling to over 100 countries...and having lots of time to spend with friends and family. </p>\n\n\n\n<p>Join me for a few minutes and learn how myself, Björn Ühss, and Esther Jacobs have been able to accomplish an incredible amount all while travelling, 'living the life', and having a ton of fun.</p>\n\n\n\n<p>You'll learn how you can get 25-200% more accomplished all while having more free time to spend with your family, your friends, and your self.</p>\n\n\n\n<p>Whether you're an ultra-organized and always working type like Björn...</p>\n\n\n\n<p>An energetic creative who hates organization type like Esther....</p>\n\n\n\n<p>Or an over-anxious ADHD entrepreneur like myself...</p>\n\n\n\n<p>You'll Learning From 3 Experts From 3 Different Countries, so...</p>\n\n\n\n<p><em></em><em>There is something in this course for you and your unique personality!</em></p>\n\n\n\n<p><em><em>\"This era needs people who think outside the box, cross borders and create new opportunities. Esther Jacobs is such person.\" </em>-Herman Wijffels (Dutch captain of industry)</em></p>\n\n\n\n<p><em><br></em></p><p><em>Why You’re Learning From 3 Experts From 3 Different Countries…</em></p>\n\n\n\n<p>This November I boarded a one-way cruise from the Canary Islands to Salvador, Brazil. </p>\n\n\n\n<p>This cruise was rather unique, in that it had us spending 9 days on the open Ocean, from the coast of Africa to the tip of Brazil. And as such, it attracted a rather unique group of passengers, including over 100 entrepreneurs, digital nomads and writers who used Facebook to spontaneously organize the trip together...because a vacation is only as good as the people you spend it with. </p>\n\n\n\n<p>On route I met Björn, and then Esther. </p>\n\n\n\n<p>About a week later and we found ourselves all staying at the same hotel in Brazil, a few steps away from one of the best urban beaches in the world.</p>\n\n\n\n<p>And it was here, while eating acai ice cream, drinking coconut water, and sipping caipirinhas, that we discussed our struggles and successes around productivity.</p>\n\n\n\n<p>And it was here where we realized something special...despite all of us being naturally wired to have some some serious struggles with productivity...each of us had managed to achieve a tremendous amount of output and success...and on our own terms. </p>\n\n\n\n\n\n<p>We were able to do all this <em>while</em> living life on our own terms, including living in multiple countries and travelling the world.</p>\n\n\n\n<p><strong>I'm Ready To Get Shit Done! Now, Let Me In!</strong></p>\n\n\n\n<p><em>\"A new perspective on our way of working. Esther always inspires our teams with her innovative ideas, drive and energy.\" </em>-Capgemini Europe</p>\n\n\n\n<p><em>\"This is a fun course that also taught me not to overthink, to just get started and let the words flow and trust the process. Would highly recommend it especially if getting started/procrastinating holds you back.\" </em>-Bren.Hamilton (reviewing Dan's productivity course for writers)</p>\n\n\n\n<p><em>In this course you’ll learn how to Get Shit Done! Clear your mind, have more time and energy for fun, family and friends, AND have one of your most productive years ever.</em></p>\n\n\n\n<p><em></em></p>\n\n\n\n<p><br></p><p>Is This Course For You? </p>\n\n\n\n<p>● Week after week, do you feel like your days don’t have enough hours?</p>\n\n\n\n<p>● Have you been “working on” a new project, book, course, or business for what seems like forever and yet you still haven’t got it done?</p>\n\n\n\n<p>● Do you get caught up in your day to day work and struggle to find the time to complete the things you really want to do?</p>\n\n\n\n<p>● Have you tried all kinds of different techniques and organization systems to \"get things done\", but nothing has seemed to stick for more than a few months? Hint: <em>T</em><em>hese other systems you've tried were never designed for creative or entrepreneurial types...that's why we created this course!</em></p>\n\n\n\n<p><em></em>● Do you always feel like you’re catching up, and if you do get things done, it’s always last minute?</p>\n\n\n\n<p>● Are phone addiction, social media, notifications, and constant noise draining your energy, or even making you physically ill?</p>\n\n\n\n<p>● Does it feel like you used to be better able to focus and concentrate…but these days it seems you just can’t focus enough to get shit done?</p>\n\n\n\n<p>● You know you need to stay motivated and focused but you just can’t get yourself do it.</p>\n\n\n\n<p>● Has your boss or clients lost faith in your ability to deliver...and is this putting your financial future at risk?</p>\n\n\n\n<p><em>Do you ever wonder, if you keep doing what you’re doing, and things keep going how they’re going, what will your life, health, family life, or finances look in 5, 10 and 20 years?</em></p>\n\n\n\n<p><em></em>● Do you put others and their needs first, so you have no time or energy left for your own plans and projects?</p>\n\n\n\n<p>● Do you often feel like you wasted the whole day doing nothing</p>\n\n\n\n<p>● Do you find it difficult to say NO, overcommit to others, and never take care of yourself and your projects?</p>\n\n\n\n<p><em>What if you learnt to be more efficient and effective, so you could have more free time for the people and things you love, while getting more done.</em></p>\n\n\n\n<p><u>Perhaps you’re already financially successful, but </u><u>you can’t seem to stop working and it’s taking a toll on your health or family life...</u></p>\n\n\n\n<p>● You reached most of your business goals but you aren’t actually enjoying life...</p>\n\n\n\n<p>● You’re always working, unable to disconnect, distancing yourself from friends and hurting your family life...</p>\n\n\n\n<p>● Your work habits are creating anxiety and eroding your once bulletproof confidence…taking a toll on your mental and physical health.</p>\n\n\n\n<p><em>You’ve worked really hard to accomplish your goals and, by all means, are now “successful”. Yet, you wonder, is this all there is? Perhaps you feel trapped by your success and your obligations, like you lack the freedom to do what you enjoy. </em>If you ask me, this is bullshit. You worked your ass off to get where you are. Don't you <em>deserve</em> to enjoy life now?</p>\n\n\n\n<p><strong>I'm Ready To Get Shit Done! Now, Let Me In!</strong></p>\n\n\n\n<p>So that's a lot of bullet points! My overall point here is that there are two groups of people who will learn a lot from this course. If you have ambitions but are an underachiever, falling short of finishing books or launching projects, you'll gain a lot from this course that will help you actually get more accomplished. </p>\n\n\n\n<p>Remember, accomplishment and productivity are not the same as being busy.</p>\n\n\n\n<p>On the other hand, if you're pretty good and working 10 hour days and getting a lot done, building a financially successful life for yourself, but you feel overworked, under-appreciated, and stretched to your limits...well, then this course will be a breath of fresh air for you. Inside you'll find strategies...and permission...to take more time for yourself and add more joy back into your life...without necessarily sacrificing your success or finances. </p>\n\n\n\n<p><br></p><p>Inside You’ll Discover:</p>\n\n\n\n<p>● How to be productive and at the same time have balance and fun in your life!</p>\n\n\n\n<p>● A new approach to taking action: Learn how you can take big risks without fear of failure, or feeling bad if things don’t work out.</p>\n\n\n\n<p>● A bulletproof technique for beating procrastination.</p>\n\n\n\n<p>● The weird psychological tricks that allowed Dan to publish 12 books and create 7 highly rated online courses in 2 years…all while living in multiple countries and travelling to 20 or so others.</p>\n\n\n\n<p>● Bjorn’s methodology for validating your business or marketing idea quickly and getting started within weeks instead of months or years. Companies pay him handsomely for his consulting on this methodology.</p>\n\n\n\n<p>● The mindset that allowed Esther to raise €16 million for charity, without an organization, network, or budget.</p>\n\n\n\n<p>● Learn how to create the perfect “work” environment, unique for you, to maximize your productivity and happiness anywhere in the world.</p>\n\n\n\n<p>● You will get a unique and diverse collection and toolbox of proven productivity hacks that have helped us make shit happen - pick the ones that work best for you!</p>\n\n\n\n<p>So if you're tired of sloughing along in life, always feeling busy or stressed, but never really getting the important things done...I'd like to ask you join us inside for a chance to finally change things and, starting in 2016, to start Getting Shit Done! </p>", 
    "end_date": null, 
    "title": "From Idea to Income:  No-Excuses Productivity For Creatives", 
    "price": "35.00", 
    "instructors": "Dan Johnston, Esther Jacobs, Björn Ühss", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635168_6ad1_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-productive-and-get-things-done/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T19:23:38Z"
}