{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>La Gestión del Tiempo se ha vuelto una herramienta fundamental para ser exitoso hoy en día. Las múltiples actividades en las que estamos inmersos compiten permanentemente entre sí y se apoderan de nuestro tiempo sin darnos tregua.<br><br>En este curso compartiré contigo estrategias y técnicas que han tenido alto impacto en cientos de profesionales a lo largo de más de 20 años de asesoría y coaching. Estoy segura que a ti también te ayudarán a potenciar tu productividad, liberarte del estrés y lograr tus metas.</p><p>De modo que si deseas elevar tu productividad en el trabajo o en los estudios, si deseas hacer espacio en tu agenda para tu deporte favorito, para aquella afición que tienes postergada, para la familia, o simplemente para descansar tranquilo, te recomiendo este curso que te llevará paso a paso por todas aquellas técnicas que dan mejor resultado.</p><p>Al final de cada sección hay una ronda de preguntas y respuestas de la vida real, de nuestros clientes a los cuales les hemos brindado esta asesoría, personas como tu que necesitaban una pequeña ayuda para ordenarse y empezar a lograr sus metas.</p><p>Adicional al curso, ofrecemos como complemento:</p><p>1. Acceso permanente e ilimitado a nuestro grupo privado en Facebook donde podrás realizar preguntas a  nuestra instructora y a todas las personas que han llevado este entrenamiento.</p><p>2. Una encuesta en linea que te permitirá autoevaluar tu actual capacidad de gestión del tiempo.</p><p>3. Un resumen en formato en PDF que puedes imprimir y usarlo como guía en tu día a día.</p><p>4. Canal abierto con nuestra instructora para que realices cualquier consulta por correo electrónico por un periodo de 60 días.</p>", 
    "end_date": null, 
    "title": "Gestión Estratégica del Tiempo", 
    "price": "35.00", 
    "instructors": "Iris Reyna", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/716210_f524_2.jpg", 
    "course_url": "https://www.udemy.com/gestion-estrategica-del-tiempo/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T22:33:47Z"
}