{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Note: This course represents the trainer&#039;s experience with the Getting Things Done® methodology, and that they are not trained by, associated or affiliated with the David Allen Company.</strong>  </p>  <p>  \tAccording to Harvard University researchers Matthew Killingsworth and Daniel Gilbert – “about 47 percent of people&#039;s waking hours are spent doing anything except being in the moment and focusing on the current activity…”  </p>  <p>  \tAnother current research study shows that over the past 30 years, procrastination at least occasionally has quadrupled with a whopping 95% of those polled. Also 52% procrastinate regularly with 20% of all students saying they are chronic procrastinators.  </p>  <p>  \tThis means you’re not alone, but it’s not good news either…  </p>  <p>  \tToo many a time do we read general solutions about how to focus our mind.  However, we cannot truly tackle these problems until we look at you and how you tick.  Want to learn how you can finally tackle both yourself and your habits by digging into your own brain?  </p>  <p>  \tThere is really no ‘one size fits all’ solution until you can tackle YOURSELF.  </p>  <p>  \tThat&#039;s right, and that&#039;s what we&#039;re going to do in this video training course.  </p>  <p>  \tFocus can be lost in many ways, and in this video training course you will learn how to focus your mind on how to get things done in relation to you and how you tick.  </p>  <p>  \t&lt;/p&gt;&lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "Get Things Finished", 
    "price": 0, 
    "instructors": "Roy Brown", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25030_5950_3.jpg", 
    "course_url": "https://www.udemy.com/focus-to-getting-things-done/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-18T22:30:30Z"
}