{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Time is a funny thing - an abstract concept, yet it plays such an important role in all of our lives. It&#039;s one of those rare things that cannot be bought, bartered, traded or negotiated for - at least not in an absolute sense. Yes, we can trade portions of our time for other things - this is something that most of us already do by working. However, the total amount of time a person has to live his or her life is finite and fixed. Period. Yet, it is something that we all long to have in greater abundance.<br style=\"\"></p><p style=\"\">Myths and legends abound with tales of men who wasted their entire lives on the hopeless quest of trying to cheat Father Time. Reality, however, also has similar stories to tell; one good example is that of Juan Ponce de León, a Spanish conquistador and explorer in the 15th century, who, it is rumoured, spent a great deal of his life searching for the Fountain of Youth - some even claimed that he found it.</p><p style=\"\">Albert Einstein, on the other hand, believed that the past, the present and the future all exist simultaneously. For him, time was a relative concept and existence was the only thing that mattered</p><p style=\"\">The man we felt got it right was Henry David Thoreau when he said that <em style=\"\"><strong style=\"\">&quot;I cannot make my days longer so I strive to make them better.&quot; </strong></em><strong style=\"\"></strong><em style=\"\"><strong style=\"\"></strong></em></p><p style=\"\"><strong style=\"\">Building on the premise set forth by Thoreau, that is exactly what this course aims to teach you; How to make your days better by utilising your time more efficiently.</strong></p><p style=\"\"> In the first part of the course you are introduced to <strong style=\"\">50 simple, yet effective time management tips</strong> that you can implement in your everyday life.</p><p style=\"\">In the second part of the course you are <strong style=\"\">taught how to overcome procrastination</strong> - that great enemy of efficient time management. Here, you are firstly provided with a series of <strong style=\"\">lectures that focuses on getting you into the right mindset for getting things done</strong> in a timely manner on  a consistent basis. Secondly, as a <strong style=\"\">special bonus</strong>, you are provided with your own <strong style=\"\">personal 12-month goal achievement system </strong><strong style=\"\">that will help you to transform your life. </strong><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">What are you waiting for? Come join MindMekka in this course and start making your days better. Why not start today?</strong></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Get More Done in Less Time with Effective Time Management", 
    "price": "20.00", 
    "instructors": "MindMekka ®", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421918_f8f0_5.jpg", 
    "course_url": "https://www.udemy.com/50-top-tips-for-effective-time-management/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T17:09:05Z"
}