{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Is this your situation?</strong></p>\n\n<ul><li>You don't know what are the important tasks that you should complete now.</li><li>You have a lot of things to do, but you don't know how to solve them.</li><li>You usually miss the deadline which you had committed with your customer.</li><li>You usually miss important events.</li><li>You are always in the multitasking state which reduces your productivity.</li><li>You don't know how to make your work better.</li><li>You are stressed. You don't know how to avoid and control stress.</li><li>You don't know how to elevate your productivity and efficiency at work.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Do you know that:</strong></p>\n\n\n\n\n\n<ul><li>Stress not only reduces your productivity but also harms your intellectual and physical health.</li><li>With unplanned works, 80% of your efforts will return only 20% valuable results.</li><li>With multitasking, 40% of your efforts are wasted in switching tasks.</li><li>A good goal will increase your chance for success 10 times as without goal.</li><li>The best way to improve your productivity and quality of work is Limit Work In Progress.</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Why this course can help you?</strong></p>\n\n\n\n\n\n<p>After taking this course, you will be able to master the 2 important principles of the Personal Kanban method: (1) Works and Workflow Visualization and (2) Limit Work in Progress. This method will help you to be able to improve your personal productivity, get things done and control stress.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Who designed the course?</strong></p>\n\n\n\n<p>The course is designed by the Agilead Global group - an organization with more than 10 years of experiences working on designing, tranning, coaching agile proccess. This course is our first step to spread out the agile techiques and theories to organizations and individuals arround the world.</p>\n\n\n\n<p><strong><br></strong></p>\n\n<p><strong>How the course is designed?</strong></p>\n\n\n\n<p>The course is consisted of 5 short sections. Each section focus on present one or more technique which you can apply immediately to your current work. </p>\n\n\n\n<p>The videos are short, concise and practical which you don't need to spent a lot of time watching bored videos. Instead, each section will deliver to you a REAL value by applying the learned technique to your current situation.</p>", 
    "end_date": null, 
    "title": "Getting Things Done with Kanban", 
    "price": "20.00", 
    "instructors": "Agilead Learning", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/784628_1c1e_2.jpg", 
    "course_url": "https://www.udemy.com/getting-things-done-with-kanban/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T03:59:20Z"
}