{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Life presents us daily with a myriad of choices. The more successful ones are those that more often than not make the right choices.  </p>  <p>  \t      However given the complexity of the situations, are these decisions easy. Especially when the decisions are not independent. Lets say your child has a school assignment that she needs help with. You plan to spend the evening with her working on that, but suddenly get a call from an important client for an urgent discussion. Is this an easy choice between the two? Definitely not. The choice you make depends on several factors which you consciously and unconsciously process. That is context.  </p>  <p>  \t      Context is having the necessary information to make an informed decision. But with so much stuff going on in our minds with activities and emotions, it&rsquo;s very clouded in there. It&rsquo;s difficult to see things clearly. This is where the power of Kanban starts its magic.  </p>  <p>  \t      By mapping our value stream, it visually provides us the context. A picture is worth a thousand words. Visualizing the stuff that we need to get done helps us see the big picture. It&rsquo;s an important first step in de-cluttering the mind. It helps us to decide better.  </p>  <p>  \t      However it&rsquo;s not just about de-cluttering. We need to get things done. A to-do list can do that. Get all your tasks and tick them off as you finish. A to-do list is better than having nothing, but it&rsquo;s still lacks something important.  </p>  <p>  \t      It lacks that connection to value. To build that connection we need a system that has value based thinking inherent in it. A system that does not just help us finish tasks, but helps us to create value. Value is the ultimate goal. isn&rsquo;t it?. All the myriad tasks we do are to create value for ourselves, our loved ones and for society in general.  </p>  <p>  \t      Also, this is also not a one time project. The system needs to be a long-term one, a one that can sustain and evolve with us and our changing needs.  </p>  <p>  \t<strong style=\"\"><em style=\"\">Personal Kanban is not just about getting organized. It&rsquo;s not just about getting things done. Personal Kanban is about creating value in a sustainable way using your continuously evolving system.</em></strong>  </p>  <p>  \t-------------------------------------------------------------------------------------------  </p>  <p>  \tPersonal Kanban&reg; is a registered trademark of <a href=\"http://www.personalkanban.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Modus Cooperandi, inc.</a>  </p>", 
    "end_date": null, 
    "title": "Getting started with Personal Kanban", 
    "price": "25.00", 
    "instructors": "Value Magic", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144632_68d5_6.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-personal-kanban/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-09T16:48:51Z"
}