{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>300 Students in the first 24 hour </em></p><p><em>Course Updated March 2016</em>  </p><p><strong><em>Goal Setting: Learn Goal Setting and achieve any Goal</em></strong></p>  <p>Learning to set goals is much different than just setting out and doing something without a plan. The brain is asked to access information that it may have no idea about, and this can quickly overwhelm us. This course aims to overcome this challenge, by introducing a step by step plan for not just creating but achieving a goal.</p>  <p><strong><em>Master Goal Setting Quickly Using this Step by Step Method </em></strong></p>  <p>*Course Assignments and Quizes included</p>  <p>*Simple Action Plan </p>  <p>*Learn This Skill Once and Use it In Every Area of Your Life</p>  <p><strong><em>Master Goal Setting by Learning Step by Step Techniques </em></strong></p>  <p>There are many benefits to knowing how to set goals. You can become a more valuable worker in a variety of industries, especially since these skills can be replicated and taught to others. </p>  <p>But mastering this skill will allow you a plan to master any other skill that can be confusing and difficult. That's why there are programs available to teach you how to train you to grasp and understand how to set and achieve goals. The information in this course is not new, but it is a step by step plan that will get you from vision to conception with as little confusion as posible. </p>  <p><strong>Contents and Overview </strong></p>  <p>This course contains over 25 lectures and is only 1.5 hours of content. It's designed for anyone, regardless of experience level, who wishes to improve their life and learn to set goals at the same time. </p>  <p>In this course, you will learn a step by step method, and you'll understand what and why we set goals. </p>  <p>You'll go deep into the reasons behind a particular goal and how to do this for every part of your life. </p>  <p>And, finally, you'll use your new skills with included assignments and quiz.</p>  <p>By the end of this course, you'll have valuable skills that will help you quickly set goals, regardless of what it is. This course is never finished. There will be new lectures added often</p>  <p>You'll also receive bonus material that reinforces the concepts. With these lessons, you'll find that you're able to set, plan, and achieve your goals in a reasonable period of time. </p>  <p><strong><em> Enroll Now And Change Your Life Today !!!</em></strong></p>", 
    "end_date": null, 
    "title": "Goal Setting:Learn Goal Setting, make any Dream a Reality ", 
    "price": "20.00", 
    "instructors": "Mrs. Aisha Perry", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741308_d373_2.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-goal-setting-make-any-dream-a-reality/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T18:54:46Z"
}