{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">My name is Arina, I’m a mom of three children and three stepchildren,  and I’ll be leading you through this course.</span>  </p>  <p style=\"\">  \tI’ve been teaching goal setting and productivity since 2003, but <strong style=\"\">after I got married several tears ago and had children, my approach to goal setting has drastically changed</strong>! I no longer had time for my business and my projects, I couldn’t devote uninterrupted blocks of time to my goals, so I had to find new solutions and new techniques to goal getting.  </p>  <p style=\"\">  \tCurrently I’m a stay-at-home mom and I run my part-time business teaching others the advanced productivity and goal getting techniques.  </p>  <p style=\"\">  \t<strong style=\"\">Who is this course for?</strong>  </p>  <p style=\"\">  \tThis course is especially designed for busy moms, who can’t find enough time in a day to devote to themselves and their projects, but who want to achieve more and accomplish their ambitious goals while being a great mother and wife at the same time!  </p>  <p style=\"\">  \tThe ideal student for this course is a stay-at-home mom, who wants to start her own project, a freelancing career, or a home business.  </p>  <p style=\"\">  \t<strong style=\"\">What you will learn?</strong>  </p>  <p style=\"\">  \tAfter taking this course you will have  a foolproof system that will allow you to reach for your goals, you will know how to avoid procrastination, fuel your motivation, and most importantly find time to work on your project!  </p>  <p style=\"\">  \tI will be teaching you advanced goal getting strategies that are based on Positive Psychology research and that are proven to work. I will also cover the outer game of goal getting and <strong style=\"\">how to set up your environment to achieve your goals on autopilot</strong>!  </p>  <p style=\"\">  \t<strong style=\"\">How to start?</strong>  </p>  <p style=\"\">  \tThere are no requirements necessary to enroll, I only ask to come open-minded and be willing to apply the techniques I share with you to your daily life!  </p>  <p style=\"\">  \tI look forward to seeing you inside!  </p>", 
    "end_date": null, 
    "title": "Goal Getting Skills For Busy Moms", 
    "price": "20.00", 
    "instructors": "Arina Nikitina", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411076_7bcd_3.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-for-busy-moms/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T16:42:15Z"
}