{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>UPDATE — AUGUST 1ST, 2015 </p><ul><li>Thanks for the amazing feedback! </li><li><span></span><em>625 Students in the first 100 hours!</em></li></ul><p>Goals built the Pyramids in Egypt, the Great Wall in China, and the double-decker couch a few of us built in college!</p><p>That power is the result of setting goals in the most effective way possible. Wanting something and knowing you can get it is <strong>one of the most powerful feelings in the world</strong>.</p><p>Being more effective at setting goals will immediately improve the trajectory of your life. Poor goal setting isn't only affecting your outcome; it's affecting your enthusiasm, time, and your dignity!</p><p>Most people are terrible at setting goals. They fire off hundreds of random ideas, passionately jump into one, and quickly forget about it a month later. Then they repeat the process and wonder why they never make any <em>real</em> progress! </p><p>What if I told you there was a mindset that the highest achievers naturally performed whenever they want something…and this mindset made them ridiculously effective at achieving it….and that this step-by-step approach and its incredible powers came directly from goal setting?</p><p><strong><em>Good news - This is the truth!</em></strong></p><p>This course provides the blueprint to rewire the way you approach setting goals so that you can go beast-mode on any obstacle in your way. My surveys show that there are 4 Major Frustrations of Goal Setting. Turn each obstacle into an ally!</p> <ul><li>Angst » Motivation</li> <li>Distractions » Clarity</li> <li>Doubt » Belief</li> <li>Failure » Grit</li></ul> <p>All of the tactics and techniques in this course are the product of years of practice by thousands of people – including some of the highest achievers I know. </p><p>And guess what...all of these frameworks I teach can be applied in hundreds of situations to: write a book, lose 20 pounds, earn a promotion, earn secondary income, re-connect with friends and family, build a triple-decker couch — and become the best self you know you have the potential to be! </p><p><strong># Being able to effectively achieve you goals isn't a skill; it's a superpower! #</strong></p>    <p>Still doubtful?</p><p>My company has given the exact same framework as this course to over 4,000 individuals. I've been contracted for hundreds (and even thousands) of dollars an hour by sports teams, student bodies, and teaching staffs to teach the things you'll learn in this course like “what comes before 'What'\" and how to create an inspiring goal with practical actions.</p><p>But don't just listen to me. Here's what a few others have said about this 4-step program:</p> <ul><li><em>“Thank you for going the extra mile. You helped me bring insight to another block in my life and boosted me up over it, when I just wanted to slump next to it in defeat.\"</em><ul><li> – Tashia, actress</li></ul></li> <li><em>“I've had countless staff members approach me and tell how they appreciated your course. Without hesitation, I would recommend your course to anyone.\"</em> <ul><li>– Craig Barringer, Superintendent</li></ul></li> <li><em>“Helped me regain control and stopped my weight from skyrocketing.\"</em> <ul><li>– Ann, college student</li></ul></li></ul> <p>A few of the things you'll learn in this course:</p> <ol> <li>A step-by-step process to setting effective goals</li> <li>Why SMART goals, aren't</li> <li>How your unique personality type is helping and hurting your goal setting effectiveness </li> <li>What a Greek god can teach us about proper timing</li> <li>Dealing with distractions in the Age of the Internet</li> <li>Emotionally-charged Visualization</li> <li>How to follow up effectively when no one responds to your email</li> <li>How to “memory proof\" your goal so you don't lose focus</li> <li>How to quickly create a “Napkin Plan\" to get you taking action fast</li> <li>The 23 questions to craft a ridiculously effective goal gameplan</li> <li>Receive the 14-page Goal Setting Guide</li> </ol> <p>That's just a tiny taste of what you'll receive. By the end of the course, you'll have skills and confidence to <em>effectively, meaningfully, and immediately</em> start achieving your goals.</p><p>I guarantee that no matter who you are, you'll learn at least one thing from this course.</p><p><strong>I will personally respond to any questions you may have</strong> as you go through the material. So if you're not sure how to apply all the gold in the course, just ask. </p><p>Take action now. Devote 3 hours of your life now to improve the next 3 years – and beyond!</p><p>So sign up now!</p><p>Talk soon,</p><p>Nick Milodragovich</p><p><strong>P.S.</strong> The ≈ $100 price was an initial offering to build the students and positive reviews. (That was only 25 cents a day for the next year!) It'll go back up in the future. But... since I love sharing and want to reach more people, it's going to be $29 for a limited time.</p><p><em>PS: There is no doubt that all the heartache, lost goals, lost time, and lost enthusiasm, is worth way more</em>, so I plan on raising the price soon. If you want to take advantage of this deal, you should really sign up now!</p>", 
    "end_date": null, 
    "title": "Goal Setting for Entrepreneurs", 
    "price": "30.00", 
    "instructors": "Nick Milodragovich", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533612_9f8c_2.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-21T18:19:48Z"
}