{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  This course distills research from psychology and neuroscience from all over the world into lessons and steps that you can take to set goals that really lead to success.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Master Goal-Setting to Set Yourself Up for Success</strong><br style=\"\">  </p>  <ul style=\"\">  \t<li>  Define your goals to make them stick</li>  \t<li>  Learn how to build a detailed goal system</li>  \t<li>  Understand why SMART goals aren&#039;t enough</li>  \t<li>  Discover all the factors behind successful goal-setting</li>  \t<li>  Set yourself up for success</li>  </ul>  <p>  \t<br style=\"\">  \t<strong style=\"\">Get a full-fledged goal-setting course that covers every single factor that will contribute to successfully reaching your goals.<br style=\"\">  \t</strong><br style=\"\">  </p>  <p>  \t  Among all the factors affecting our lives, none has as much potential influence as our ability to set goals. Goal-setting is such an important factor for success. When you set the right goals the right way, you take the single most important step to reach it. In this course you&#039;ll learn how to set goals the right way – based on the scientific research on goal setting of the last four decades.  </p>  <p>  \t  At the beginning, we&#039;ll briefly cover the Why? of goal-setting before we learn which factors distinguish a good goal from a bad goal. Then we&#039;ll set the basis for successful goal pursuit: finding the right goal. The next step will be defining long-term goals, like life missions and life goals. We then explore how to properly define short-term goals and which factors are crucial for success later on. In the final section, we&#039;ll use worksheets, checklists and other materials to put it all into practice. I&#039;ll lead you through the exact steps you need to consider when you want to set goals successfully.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Content and Overview</strong><br style=\"\">  \t<br style=\"\">  \t              You will get understanding of how to set goals and what contributes to you achieving your goals. We&#039;ll cover all the tricks and insights that come from research in psychology and neuroscience. Right goal-setting is much more than using the widely known SMART framework – there is research on goal-setting from all over the world, including psychology labs from the best universities of the world. <br style=\"\">  \t<br style=\"\">  \t              We look at research that shows what makes successful goals stand out and which factors are often overlooked when people set goals. You also learn why it&#039;s often best to avoid do-your-best goals and how you can use thinking errors for your benefit. We look at how to prime your unconsciousness, at intention implementations and much, much more.<br style=\"\">  \t<br style=\"\">  \t              The second major part of this course is the section on Mapping for Goal-Success. There you learn how to best set goals by actually doing it. We present a wide range of exercises that are the ideal preparation for achieving your goals, there are more than ten worksheets, a couple of quizzes and a variety of other ways of learning and putting the insights into practice. <br style=\"\">  \t<br style=\"\">  \t              Among other things, you&#039;ll be able to tap into your True Self, measure and increase commitment to your goal, define the various kinds of resources and obstacles in your way and again much, much more.<br style=\"\">  \t<br style=\"\">  \t              At the end of the course, you will have learned what factors are important for successful goal-pursuit. You will have a thorough understanding of how to approach any goal you will set yourself in the future. And you will have the tools and resources you need to set yourself up for success.  </p>  <p>  \t                                    One more thing: You have a <strong style=\"\">totally unconditional money back guarantee.</strong>  It allows you to study the course for 30 days and if you are in any way  unhappy with it, you will get a full refund, no questions asked!  Enrolling in the course is absolutely risk free.  </p>  <p>  \t<em style=\"\">Click the <strong style=\"\">&quot;Take This Course&quot;</strong> button now and enroll!</em>  </p>", 
    "end_date": null, 
    "title": "Goal Setting for Success: The Science of Goal Setting", 
    "price": "30.00", 
    "instructors": "Manuel Kraus", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359716_ffea.jpg", 
    "course_url": "https://www.udemy.com/science-of-goal-setting/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T12:52:35Z"
}