{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><strong>✪ </strong>Watch the video above to see how you'll learn a step-by-step method to cure any bad habit and create any new habit you want. Then watch the course previews below to get a sneak peek at the content you'll be learning.</strong><br></p><p><strong><strong>✪ </strong>You'll understand how habits control your life better than you ever have before, and you'll get the 6 steps you need to take to eliminate any bad habit and create any consistent, healthy routine you want, in a concise and compact course.</strong></p><p><strong><strong><strong>✪ </strong></strong>You'll never have to force yourself to get things done anymore. Instead, put a bit of energy up front to create permanent, effortless habits, which do the work FOR YOU.</strong></p><p><strong>✮✮✮✮✮</strong> Welcome to <strong>Habit Masterclass - The 6 Steps To Change Any Habit ✮✮✮✮✮</strong></p><p><strong>Here's what you'll learn in this course:</strong></p><ul><li>How tiny, 1% habit changes turned a national team that was a perennial loser into winners of the Tour De France and multiple Olympic Gold medals (in the same year)</li><li>Why bad habits form in the first place, and the real reason they are so hard to break</li><li>How to start any good habit - like learning an instrument, eating better, going to the gym consistently - and make sure it sticks, almost like you just 'uploaded' it into your brain's software.</li><li>How you can use the psychological concept of Identity to force yourself to change habits instantly (watch the Preview videos below)</li><li>How to use Shadowboxing and Visualization to condition habits before you actually do them in real life.</li><li>Have a list of habits you want to break or create? You'll learn the fastest way to get them all into your life as soon as possible.</li><li>Learn how to avoid subconsciously conditioning laziness.</li><li>The '5 Minute rule' that will get you up and running with your new habit by tomorrow.</li><li>How to prevent burn out and 'habit rejection'</li><li>A crash course in mindfulness to improve focus and concentration, and make it easier to form good habits.</li><li>The plan B you can fall back on when you miss a day forming a habit.</li></ul><p><strong>Who is this course for?</strong></p><ul><li>Students, freelancers, entrepreneurs and anybody else who thinks bad habits are holding them back in life</li><li>Anybody who cannot stay consistent with new practice routines or good work habits</li><li>Students with open minds</li><li>People who are ambitious and try hard, but can't be consistent on a day-to-day basis</li></ul><p><strong>Who is this not for?</strong></p><ul><li>Anybody with perfect self control and consistency</li><li><span></span>Anybody not willing to change their everyday habits and routines a bit in order to get results</li></ul><p>Remember, if <em>Habit Masterclass</em> doesn't work for you, you have 30 days to get your money back with Udemy's Guarantee.</p><p>I don't believe I deserve your money if you aren't absolutely delighted with it, anyway.</p><p>Click \"Take This Course\" now, and I'll see you on the other side!</p><p>- Richard</p><p><br></p>", 
    "end_date": null, 
    "title": "Habit Masterclass - The 6 Steps To Change Any Habit", 
    "price": "20.00", 
    "instructors": "Richard Rawlings", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662994_4991.jpg", 
    "course_url": "https://www.udemy.com/habit-course/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T13:32:33Z"
}