{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong>How to Create and Use a Vision Binder to Excel your Success</strong> merges positive thinking, productivity, action taking, and organization into a course about one tool that can elevate your life. </p><p>I will teach you the 12 steps of making and using a tool I’ve created, called a Vision Binder, to achieve the goals you set for yourself and add order, consistency, and progress to your life.</p><p><strong>Make a Customized Productivity Tool to Use on the Journey to Your Best Life </strong><br></p><p>Personal growth is a life-long journey that requires consistent action. </p><p>What better way to stay consistent than to make a personal development tool that contains your own motivating images that get you inspired with productivity worksheets that help you plan and map out your life. </p><p> Mostly importantly, you can use this tool to review all of your accomplishments and evaluate where you need to improve your life.  </p><p>This course will teach you how to:</p><ul><li>Make and organize your own Vision Binder</li><li>Create a vision that motivates you</li><li>Set challenging yearly goals</li><li>Plan your months, weeks, and days to achieve those goals</li><li>Conduct a review of your progress</li><li>Build the confidence to keep going.</li></ul><p><strong>Get unstuck and work towards a better life with a Vision Binder.  </strong></p><p> Feel stuck or content no longer. </p><p>If you want more for your life but have no idea how to get there, a Vision Binder can help you.  It helped me...a lot.  I'm more focused, I get more done in less time, and my income constantly increases.  </p><p>During my own personal development journey, I decided to create a tool I've dubbed as the Vision Binder to help me organize my life planning.  The results were so profound that I started sharing my Vision Binder with others.  The response I kept getting was, \"This is amazing! I could really use something like this in my life.\"  I knew I had to share it with the world.  </p><p><span></span>I designed this course to teach people how to create their own Vision Binder and how to use it consistently to excel their success.  By the end of the course, you will know how to use my productivity tools in your Vision Binder so you can begin living your best life and working daily towards your goals.  I will walk you through the 12 step process so you can apply these steps to your life.  You can download the productivity tools and start using them right away! </p><p>This course is taught using the principle and consistent progress forward, no matter how small, will compound over time for big results.  The more you follow through, the more you increase your confidence.  The Vision Binder can help you maximize your follow through which, in turn, maximizes your confidence.   </p><p>This course includes 15 lectures and approximately 66 minutes of content.  <br></p>", 
    "end_date": null, 
    "title": "How to Create and Use a Vision Binder to Excel Your Success", 
    "price": "20.00", 
    "instructors": "Entrepreneur, Attorney, Teacher Mary Hodges", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/710418_aaee_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-and-use-a-vision-binder-to-excel-your-success/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T03:57:34Z"
}