{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you feeling stuck, hopeless, and depressed? </p><p>Have you tried everything to accomplish your goals and new years resolutions, but nothing has worked? </p><p>If you are committed to closing the gap between where you are to where you want to be then this course is for you!</p><p>Are you ready to shatter your excuses and limiting beliefs? </p><p>Are ready to make the rest of your life your best life?</p><p>In this incredible course you will learn the 9 simple steps to achieving any goal. It is one of the best systems out there. I have spent several years training this system to thousands of individuals all across the world. All my students love how simple and easy it is to follow and implement. Now my students call themselves Goal Achievers!</p><p>I want to give you the opportunity to call yourself a Goal Achiever and be part of our amazing and growing tribe! This course will force you to raise your standards. If you apply everything in this course you may surely:</p><p>•2x your income</p><p>•Attract the career of your dreams</p><p>•Attract and close twice as many clients</p><p>•Transform your health (shedding fat, or building muscle)</p><p>•Maintain quality relationships and build new high quality relationships</p><p>You will see an explosive growth in all areas of your life. Thus allowing you to unleash your GREATNESS!</p><p>I cannot wait to serve you and see you on the other side!</p>", 
    "end_date": null, 
    "title": "How to go from Goals to Greatness!", 
    "price": 0, 
    "instructors": "Hasib Azhand MBA", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/767068_7ad1.jpg", 
    "course_url": "https://www.udemy.com/greatness/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T23:39:51Z"
}