{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In these course you'll learn step by step process how to use positive thinking to make productive and archive you business goal.<br></p><p> Here what you will learn in these course?? By taking these course, you will be able to understand what is positive thinking, Importance of positive thinking and understanding the Laws. How to motivate yourself. Then we are taking about what type of decision take you closer to your target. Understanding your problems that pull you back and solve them. Then we are taking about what types of Rules you follow to get success your life. Then we go through how we controll and utilize our brain power to incress your productivity. We look at How positive thinking can make you healthier and productive. We learn how to controll our ego to stay positive always. So let get started with positive thinking<em><strong> </strong></em>course and incress our productivity and self-esteem by 1000%. Enroll this course now.</p><p><strong>Topic Include</strong></p><ul><li>What is positive thinking?</li><li>Importance of positive thinking and understanding the Law.</li><li>How to motivate yourself.</li><li>Understanding right decision?</li><li>Understanding the problem and solve them.</li><li>Understanding rules of our life.</li><li>Understanding your brain and what your are thinking.</li><li>How positive thinking can make you healthier.</li><li>How to control your ego.</li><li>How positive thinking can make you more productive.</li></ul>", 
    "end_date": null, 
    "title": "How Positive Thinking Increase 1000% More Productivity", 
    "price": "20.00", 
    "instructors": "Somenath Sen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/511258_9a63_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-think-positive-and-be-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-25T22:43:24Z"
}