{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Join 800+ Students</strong><br></p><p>Have you ever heard any of the following statements: \"Yes, I would like to do that, but I just don't have the time to do so\" or \"Where do you find the time to get all these stuff done?\" or else \"Time is Money\". Well, all these statements are part of our collective conventional wisdom. But, somehow, I disagree with all of them. Now, here is why. Over the last 6 to 7 years, I have accomplished more and much more than in the first few decades of my life.</p><p>And what has changed was my realization that time is our most precious asset and yet it is the most perishable asset we have. Reaching that type of understanding marked a significant turning point in my life. Many people, including friends and colleagues have asked me over and over again: \"Kofi, where do you find time to do all that.\" And I would always smile and say: \"Well, where there's a will, there's a way.\" But that was not the right answer. Now, I am ready and willing to share my best kept secrets for achievement with you and I hope you are ready to learn them now.</p><p><strong><em>In Optimizing Your Time to Achieve More and Faster</em></strong>, you will discover 5 basic, common sense, principles that you can also apply to your own specific case in order to get more and much more done in the coming few years than you've ever thought possible.</p>", 
    "end_date": null, 
    "title": "How to Optimize Your Time to Achieve More and Faster", 
    "price": "20.00", 
    "instructors": "Kofi Sonokpon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737406_a66f_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-optimize-your-time-to-achieve-more-and-faster/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T01:11:08Z"
}