{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>I used this <strong>exact system</strong> to go from a chronic procrastinator to writing a #1 Amazon best-selling book in only 17 days... and now <strong>YOU CAN USE IT TOO</strong> to end your procrastination once and for all!<br><br>Procrastination affects as much as 70% of the general population.</p><p>Mind… blown.</p><p>Despite these negative statistics, you may have noticed that certain people are able not only to stop procrastinating, but escape the hamster wheel, <strong>eliminate procrastination for good</strong>, <strong>get the job done</strong> on a consistent basis and <strong>live happy and productive lives</strong>. If you ever wondered “how do they do that?\", you are in for a real treat.</p><p>Because today I am going to pull back the curtain and show you EXACTLY how I “cured\" myself of procrastination and most importantly, <strong>how you can do it too.</strong></p><p><strong></strong><br><strong></strong></p><p><strong>No fluff and filler, just BATTLE-TESTED tactics that work!</strong></p><p><br><strong></strong></p><p> It's all about how to hit HIGHER levels of productivity, energy, success, and fulfillment.</p><p> It's what high performance is all about, and it's what multi-millionaires and the world's most accomplished people know and DO.</p><p>Inside this course, you'll learn:<br></p><ul><li>How to <strong>actually overcome </strong><strong>procrastination</strong>, by reprogramming yourself to take action</li><li>How to install habits, so you have less and less procrastination in your life \"automatically\"</li><li>The place to invest your attention and energy to <strong>get the highest possible return</strong></li><li>Why it's important to understand willpower and how it works - so you can <strong>continually increase your productivity</strong></li><li>And much much more...</li></ul><p> So you can:<em></em></p><ul><li><em>Conquer your most important tasks...</em></li><li><em>Achieve your most ambitious goals and...</em></li><li><em></em><em>Live the life of your dreams...</em></li></ul><p>Are you interested?</p><p>Let's do this!</p><p><strong>Click on the \"Take This Course\" button to the right and let's beat that procrastination together!</strong><br></p>", 
    "end_date": null, 
    "title": "How To Stop Procrastination And Double Your Productivity", 
    "price": "20.00", 
    "instructors": "Kosio Angelov", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593064_f959_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-stop-procrastinating-for-good/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T16:17:46Z"
}