{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h5 style=\" text-align:center;\"><em style=\"\">Do you feel overwhelmed trying to keep track of your daily activities? Afraid that you&#039;ll forget something important?</em></h5>  <p style=\"\">  \t <em style=\"\"><br style=\"\">  \t</em>  </p>  <p style=\"\">  \t       Most people feel that there&#039;s just not enough time in a day to do everything they need to do, never mind what they WANT to do. Life is a rush from point A to point B, meeting deadlines and milestones in-between, and they associate a lot of stress with day-to-day activities.  </p>  <h5 style=\"\"><em style=\"\"><br style=\"\">  </em></h5>  <h5 style=\"\"><em style=\"\">But I&#039;m here to show you how you can have less stress and more fun in your life!</em></h5>  <p style=\"\">  \t       Hello, my name is Gerry Kirk.  </p>  <p style=\"\">  \t       I have been coaching and training individuals, teams and organizations for 10 years using Agile, Lean and Kanban. I have seen literally hundreds of people transform their lives with Personal Kanban&trade; through my workshops and individual client engagements.  </p>  <p style=\"\">  \t       Only a handful of people in the world actively consult or train in Personal Kanban&trade; and I am honored to be one of them. Personal Kanban&trade; forms an integral part of not only my business, but also my personal life. Thanks to Jim Benson and Tonianne DeMaria Barry for writing the <a href=\"http://www.personalkanban.com/pk/personal-kanban-the-book/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Personal Kanban&trade; book</a> and sharing this powerful tool.  </p>  <p style=\"\">  \t       Hundreds of people have had great results with Kanban under my coaching guidance and I guarantee that you will see immediate results with the Kanban system, too.  </p>  <h5 style=\"\"></h5>  <h5 style=\"\">This is what some of my clients have to say:</h5>  <p style=\"\">  \t       I am pleasantly surprised by this course! When I enrolled, I had never heard about Personal Kanban before. Nevertheless, I was eager to learn about this work management system, because <strong style=\"\">I was feeling increasingly more overwhelmed and frustrated by my schedule and never ending pile of work</strong>. [I found] <strong style=\"\">this course was a joy to take: it was engaging, easy to understand and follow, and Gerry Kirk&#039;s passion for Personal Kanban is quite contagious!</strong> ~ Jennifer Gehly  </p>  <p style=\"\">  \t       &quot;I had never heard of Kanban before but once I did this course <strong style=\"\">I realised that it was exactly what I had been looking for</strong>. At a glance now I can see what needs to be done and the priority of those tasks. No more &#039;To Do&#039; lists in the back of my diary! I feel less stressed and more organised. Highly recommended, thanks!&quot; ~ Jennifer Bailey  </p>  <p style=\"\">  \t       &quot;I find that <strong style=\"\">the clutter in my head has drastically reduced</strong>.&quot; ~ Mandar Maranthe  </p>  <p style=\"\">  \t       &quot;Gerry [reveals] how to continue to improve your flow of work. In advanced topics, he shows you how to <strong style=\"\">discover more about the how and why of what you choose to do and learn a bit about yourself</strong> along the PK journey. ~ Mark Kilby  </p>  <h5 style=\"\">Are You Ready For a Change?</h5>  <p style=\"\">  \t       It&#039;s time to say goodbye to the old tools and processes that have let you down in the past. It&#039;s time to throw out that unforgiving to-do-list and time to say hello to a new visual management system that will actually improve your life. Time management isn&#039;t enough, it&#039;s about doing the right things the right way.  </p>  <p style=\"\">  \t       This unique and intuitive system will:  </p>  <ul style=\"\">  \t<li style=\"\">  \t<p style=\"\">  \t\t       Reward you with extra time lost from task switching, interruptions and from focusing on time-wasting activities.  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t       Free you from feeling overwhelmed by showing all of your options in a way your brain will enjoy.  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t       Give you peace of mind with a system you can trust to remember everything important.  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t       Make prioritization effective, without making it feel like a chore.  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t       Celebrate your accomplishments, and increase motivation to get things done.  \t</p>  \t</li>  </ul>  <p style=\"\">  \t       The system is simple, because I understand that you don&#039;t have a lot of time to learn to use complicated systems. The system is based on two simple rules:  </p>  <ol style=\"\">  \t<li style=\"\">  \t<p style=\"\">  \t\t       Visualize all your work  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t       Stop starting, start finishing!  \t</p>  \t</li>  </ol>  <h5 style=\"\"></h5>  <h5 style=\"\">Learn how to stop doing busy work, start doing your best work because life is too short to do less than what you love.</h5>  <p style=\"\">  \t       Do you want to create more value for your organization?  </p>  <p style=\"\">  \t       Do you want to live your best life every day?  </p>  <h5 style=\"\"></h5>  <h5 style=\"\">Forget about productivity - let&#039;s focus on VALUE.</h5>  <p style=\"\">  \t       Personal Kanban&trade; is adaptable to all ages and situations and it is easily accessible to all learning styles. Personal Kanban&trade; is a pattern, not an edict. It can be moulded and optimized to deliver the best results for your requirements.  </p>  <p style=\"\">  \t       Start the course today to transform your life. Get the best value for everything you do by removing stress out of your life. It&#039;s easy and it&#039;s guaranteed.  </p>  <p style=\"\">  \t       Remember, you are protected by a 30 Day Money Back Guarantee.  </p>  <p style=\"\">  \t       Let&#039;s get started!  </p>", 
    "end_date": null, 
    "title": "How to Stop Doing Busywork, Start Doing Your Best Work", 
    "price": "40.00", 
    "instructors": "Gerry Kirk", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50994_517e_4.jpg", 
    "course_url": "https://www.udemy.com/visual-time-management/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-23T14:58:02Z"
}