{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>What if I told you could search much more efficiently than you do \nnow. What if that old question you couldn't find an answer to for a long\n time now... what if there's an efficient way to finally get that answer\n online?</p><p>In this course you'll learn Google search tricks that will save your \ntime and find the answers to any questions you have. With these tricks, <strong>\nyou'll become a better student, a more efficient writer and a more \nsought-after employee.</strong></p><p><strong>***FREE DOWNLOAD! Grab your free 86-page eBook inside listing all the search hacks which were reviewed in the videos.</strong></p><p><strong></strong></p><p>You'll learn:</p><ul><li>How to be the first in the room to find any information,</li><li>How to monitor any topic online</li><li>How to find exactly what you want</li><li>How to search Youtube, Gmail and \nTwitter</li><li>Discover which opportunities various search platforms open \nup for you in your daily and professional life.</li></ul><p>After taking this course:</p><ul><li>You will be able to find different types of documents online</li><li>You will be able to get answers to your questions instantly</li><li>You will be able to expand your research beyond your current knowledge or keywords</li><li>Discover new tools and concepts you had no idea about</li><li>Investigate people online before dealing with them</li><li>Find sources of images, quotes and articles</li><li>Navigate your email inbox more efficiently</li><li>Many more!</li></ul><p>You'll see how web search helps you brainstorm, expand your options and \ngain knowledge almost instantly!</p><p>Learn how to use Google advanced operators and search tools to get \nmore precise (or vice versa more flexible) search results. Discover how \nto better control Youtube search and find out how to finally find that \nemail you sent several years ago.</p><p>Take the course and if you  still fail to find an answer to any \nquestion, post it in the discussion section and I'll suggest best ways \nto search! I love tricky tasks! Puzzle me!</p><p><strong></strong><br><strong></strong></p>", 
    "end_date": null, 
    "title": "How to Use Google Advanced Search, Twitter, Youtube, Gmail", 
    "price": "20.00", 
    "instructors": "Ann Smarty", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791010_e999.jpg", 
    "course_url": "https://www.udemy.com/use-google-advanced-search-twitter-youtube-gmail/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T01:42:36Z"
}