{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>&lt; Celebrating our third year on Udemy with a limited time special offer (regularly $250).  Enjoy! &gt;</em></p><p>  \t<strong>Lean &amp; Agile are decades-old, field-tested philosophies</strong>, which help you to move from the beginning of an idea to the successful completion of that idea, quickly - allowing you to relish in the fruits of your labour whether that’s making money rapidly, improving your ROI (return on investment), delivering on-time &amp; on-budget or feeling more productive every single day.  Learn why so many companies and individuals are applying this impactful thinking to their working environments, from single person start ups to the biggest organisations in the world - private, public and not-for-profit sectors alike.</p>  <p>  \t<strong>Building from her experience delivering training on this subject for more than a dozen years</strong>, Laura cuts through the inconsequential details, straight to the root of how to make a difference in your working environment today.  She explains in clear terms how to reap the powerful benefits that Lean &amp; Agile philosophies provide.  This is not an overview of complicated techniques or practices, but a hands-on exploration of the principles that will allow even those new to the concepts to apply them right away.  </p>  <p>  \t<strong>In an engaging and accessible manner, Laura will give you an overview of the simple building blocks you need</strong> to begin enjoying your work more - packed full of thought-provoking stories and intriguing examples - culminating with a personal challenge that will see you improving the way you work immediately. Regardless of your particular working environment, within just a few hours you’ll already have taken your first step.  </p>  <p><strong>Come on - let's get things done &amp; enjoy your work more.   Starting right now!</strong></p>", 
    "end_date": null, 
    "title": "How to Get Things Done & Enjoy Work More (with Lean & Agile)", 
    "price": "50.00", 
    "instructors": "Laura at Flowmotion", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/13820_c5bc_21.jpg", 
    "course_url": "https://www.udemy.com/lean-agile-awareness/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-02-10T15:50:14Z"
}