{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><strong>The \"How to Think Smarter\" course takes you inside the source of your native smarts - your amazing mind!</strong> The course is perfect for both beginners and more advanced students of how to: <br> *Understand how your thoughts direct your behavior. <br>*Select the best questions to ask when facing a decision <br>*Solve  personal and business problems faster and easier.</li></ul><p>The course avoids the use of complicated terminology, although you will encounter the scientific names of a few areas of your brain. <em><strong>BUT</strong> no special education is required to fully understand and benefit from \"How to Think Smarter.\".</em></p><p><strong>The \"How to Think Smarter\" course includes information on how to understand and use your native mind power to the maximum. </strong>Materials include three short video lectures, several video exercises, PDF versions of the exercises are also included.</p><p>This <strong>FREE</strong> <strong>course</strong> is structured for ease of use on any computer or portable device.</p><p><strong>WHY take this course?</strong> Your human mind is an awesome asset. Increase your understanding of its potential, and you will increase your native intelligence. This course even includes 5 simple ways you can increase your mind power - and some of them will totally amaze you. </p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "How to Think Smarter", 
    "price": "20.00", 
    "instructors": "Jill Ammon-Wexler", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650580_7eaa_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-think-smarter/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-25T19:54:17Z"
}