{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>StartYourWorkNow Com has moved to Udemy!</em></p><p><strong><strong>✪ </strong>Watch the video above to learn a step-by-step method to cure procrastination, and watch the course previews below to get a sneak peek at the course content.</strong></p><p><strong><strong>✪ </strong>You'll understand why you procrastinate better than you ever have before, and you'll get the 4 steps you need to take to make sure you never do it again, in a concise and compact course.</strong></p><p><strong><strong><strong>✪ </strong></strong>You'll never have to force yourself to get things done anymore. Instead, use these simplified techniques to 'kick-start' your productivity along with the calendar 'designed for procrastinators' you're about to learn.<br></strong></p><blockquote>\"Hi Richard,<br>I just finished listening to your course and I am:<br>1. SO impressed!<br>2. SOOOO grateful!!!!<br>3. SO inspired!<br>I listened to the entire course, but I also just printed all the materials (transcripts) so that I could highlight what’s relevant and review it over and over again.<br>... Your course is going to help me get back to who I truly am WITHOUT the subconscious crap that’s going on inside me.<br>Thank you SO much for this!!! You are amazing!!!\"<br><strong>- Milena H. (student)</strong></blockquote><p><strong><br></strong></p><p><strong>✮✮✮✮✮<span></span></strong> Welcome to <strong>How To Stop Procrastinating &amp; Start ✮✮✮✮✮<span></span></strong><br></p><p><strong>Hi, I'm Richard Rawlings. </strong></p><p><strong></strong><strong>Procrastination used to make me feel like a complete loser at work and school.</strong></p>  <p>  \t                            I felt like I was talented and smart, but for some reason I never accomplished much compared to others around me. I couldn't compete at work and my grades were never even close to where I wanted them.</p>  <p>  \t                            I was getting pretty desperate, so a few years ago I started reading about the psychology of motivation, productivity and procrastination.  </p>  <p>  \t                            I got a little obsessed with it. I spent hundreds of hours reading and over $700+ on books...  </p>  <p>  \t                            And it took me about a year, but eventually I developed a system to stop procrastinating permanently without forcing myself or using extra willpower.  </p>  <p>  \t<strong>Now, I've taken the golden nuggets from that experience and crammed it into a short course you can watch in just a few hours.</strong></p>  <p>  \t                            I've done all the legwork for you already, so you just need to watch the course videos to get all you need to escape the procrastination habit for good.  </p>  <p>  \t            I discovered there are 4 steps to stopping procrastination, so the course is organized into 4 'Modules' - Watch the first video above where I explain what the 4 steps are and what you need to do to make sure you stop procrastinating.  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>    Here's what you'll learn in this course:  </strong>  </p>  <ul>  \t<li>How to stop using willpower and trying to force yourself to get things done (which just backfires!)</li><li>The hidden subconscious reason you procrastinate (I take you through an unusual, but effective process to find these reasons).</li>  \t<li>A simple-yet-elegant time management schedule that actually works for procrastinators (most scheduling systems work for people with ORGANIZATIONAL problems but are not targeted at the PROCRASTINATION problem).</li>  \t<li>How to stop perfectionism from creating procrastination problems.</li>  \t<li>How to break down projects and goals into almost insultingly-small chunks so they're simple to complete</li>  \t<li>How to manage your energy throughout the day</li>  \t<li>How to prevent burn out</li>  \t<li>How to use time management software effectively, and a selection of the most effective software you can use (but still keep it simple)</li></ul>  <p>  \t<strong>Who is this course for?</strong>  </p>  <ul>  \t<li>Students, freelancers and entrepreneurs who have to motivate themselves to work, but constantly get stuck</li><li>Students with open minds</li>  \t<li>Anybody who puts important things off, but isn't sure why</li>  \t<li>People who are ambitious, but can't find consistency</li>  </ul>  <p>  \t<strong>Who is this not for?</strong>  </p>  <ul>  \t<li>Anybody who never puts important things off to the last minute.</li>  \t<li>Anybody not willing to change their habits and routines a bit in order to get results</li>  </ul>  <p>  \t      Remember, if it doesn't work for you, you have 30 days to get your money back with Udemy's Guarantee.  </p>  <p>  \t                            I don't believe I deserve your money if you aren't absolutely delighted with it, anyway.  </p>  <p>  \t                            Click \"Take This Course\" now, and I'll see you on the other side!  </p>  <p>  \t                            - Richard  </p>  <p>  \t                            -------------------  </p>  <p>  \t<strong>The course has been online helping students for about a year now at StartYourWorkNow-com. </strong></p><p><strong>Here are a few STUDENT EMAILS:</strong></p><p><strong></strong><em>\"I just wanted to write to you and say how much of a big help your procrastination videos helped me with procrastination. I’ve been to a lot of self-help sites but none of them were quite as helpful as yours. I learned a lot of stuff in listening to your videos and whenever I need a boost in motivation I watch your videos and it’s like magic.\"</em><br></p>  <p>  \t<strong>             - Heidi W.</strong></p>  <p>  \t<em>\"Hello Richard. Let me introduce myself, my name is Daniel Aljure and I'm a 31 years old online marketer from Bogota (Colombia). I saw your ad in one of my FB profiles and I decided to register myself because I was aware that for a long time (maybe my whole adult life) I've had a procrastination problem that has caused me a lot of negative consequences (although, eventually you learn from everything, and that is a positive consequence itself). Anyway, I tried a lot of stuff, I even hired a business coach that offered to help me and she actually did, but not as much as I needed, and your offer appeared interesting to me and I decided to give it a shot. I have to say now, that it was a very good decision, because I enjoyed the course very much, and I decided to apply most of the stuff contained in the modules. I wanna thank you for that, and congratulate you on a job well done.\"</em>  </p>  <p>  \t<strong>             - Daniel Aljure, Bogota, Columbia  </strong>  </p>  <p>  \t<em>\"I watched all your modules a few days and they have given me new hope to break my current pattern of procrastination. It's the best resource I’ve found, and really spoke to me! ...\"</em>  </p>  <p>  \t<strong>             - A.R., San Diego  </strong>  </p>  <p>  \t<em>\"Hello there Richard! Firstly, I would like to thank you for this awesome website and the things you’ve shared – they’re amazing. (: ... Your information has given me lots of inspiration.\"</em>  </p>  <p>  \t<strong>             - Adel R., Singapore  </strong>  </p>  <p>  \t<em>\"I really like the information! I found this program yesterday and finished watching it just now. I might go through it again, most of the information is new to me. I hope that it will make changes in my work habits. Can’t wait to try the advises! Thanks again!\"</em>  </p>  <p>  \t<strong>             - Ada M.  </strong>  </p>  <p>  \t                                              -------------------  </p>", 
    "end_date": null, 
    "title": "How To Stop Procrastinating & Start: 3X Your Productivity!", 
    "price": "20.00", 
    "instructors": "Richard Rawlings", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420330_b265_7.jpg", 
    "course_url": "https://www.udemy.com/stop-procrastinating-and-start-your-work-now/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T16:40:18Z"
}