{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course you'll learn the <strong>exact, step-by-step, time-tested</strong> <strong>framework</strong> I used to <strong>launch two startups, work for Denmark's biggest companies, self-fund studies to the world's top schools, write a book and travel to almost 100 different countries.</strong></p><p>I've a successful, fun and exciting career and lifestyle, and in this course I want to tell you exactly how you can have one as well.<br></p><p>Five years ago, I was a broke, bored and unemployed graduate in South America. </p><p>I dreamed of working in Google or another big company, of traveling to London and Europe, and of having VIPs from all types in my network. </p><p>I was ambitious - I was trying the latest productivity tips, the latest \"life hacks\" and more, but <strong>I couldn't just \"take off\". </strong></p><p>While my old classmates started landing serious jobs, applying for Ivy League MBAs and traveling the world, I couldn't get it right and started to freak out. </p><p>One cold, dark winter day I hit rock bottom. After quitting my first job after only three days, I promised myself and everyone I knew, that I would rise up. </p><p>Fast forward a few years, and I've:</p><ul><li>Launched two businesses, one reaching 2.3m people</li><li>Moved to Denmark, and worked for Maersk and Carlsberg, two of the world's biggest companies</li><li>Self-funded a Masters Degree in Copenhagen and spent 8 weeks in Harvard</li><li>Wrote a book and traveled to over 90 different countries</li></ul><p><strong><br>I've finally cracked it.<br></strong></p><p> After years of reading all sorts of books, going to dozens of conferences, meeting hundreds of experts and experimenting with innumerable techniques and strategies, I've come up with a winning formula. </p><p>Today I want to share it with you.</p>", 
    "end_date": null, 
    "title": "How to Become a High Performer And Be 2-5X More Productive", 
    "price": "20.00", 
    "instructors": "Mario Scian", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627950_0d6b_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-high-performer-more-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T13:22:05Z"
}