{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">TOP RATED COURSE! Take full advantage of the working knowledge of Alin Vrancila in this powerful course on Evernote and how to use it to be uncommonly productive.</p>  <p style=\"\">  \t                  Are you tired of nonsense tips on how you can really manage INFORMATION OVERFLOW? Take this course and see how to get it done. Different than other courses, in this course you will not waste time with unnecessary information or spend too much time on unimportant and unrelated things. Direct, concise, focused course on how I use Evernote in REAL LIFE!  </p>  <p style=\"\">  \t<strong style=\"\">What others said about this course:</strong>  </p>    <p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;[This] course is perfect for busy professionals to use Evernote to organize their work and projects. Enjoyed every minute of it!&quot; A.W.</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;This is the third Evernote course I took on Udemy and the first to really show the power of the tool, great job&quot; D.L.</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;I am now going straight from the course to using the program without any doubts.&quot; M.S.K.</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;I definitely recommend this course for people looking to increase their productivity, keep track of everything going on in their lives better, and who want to start using Evernote.&quot; R.O.</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;If you are looking for a course to show you how to achieve efficient workflow in all areas of life, then look no further--it&#039;s here.&quot; J.C.</em></strong>  </p>    <strong style=\"\">&quot;Excellent!!!!!!!!!!This course was so helpful in helping me get organized. The tutorials were quick, and effective! The instructor seemed to have mastered the concepts of Evernote, which helped a lot in setting up an account. I know now that I will definitely be using Evernote for a really long time. I will definitely recommend this course to all of my friends and family. I am very satisfied.&quot; C.T.</strong>  <strong style=\"\">&quot;Never realized how much Evernote can do. The instructor does a good job explaining the various features of Evernote and tips on how to use them.&quot; D.D.</strong>  <strong style=\"\">&quot;I was first introduced to Evernote through this course. I loved it right from the beginning, so I highly recommend everybody to take this course and try out Evernote. It is clearly and detailed presented&quot; T.S.</strong>  <p style=\"\">  \t                                            What are you going to learn in this course? You are going to get a lot of answers to all these HOW TO questions:  </p>  <p style=\"\">  \t<strong style=\"\">I. How to get a good start! </strong>How to create an Evernote account. How to organize your notebooks and notes. How to create Notebook stacks. How to name your Notebooks. How to create Tags. How to create TO DO&#039;s and Task lists. On what devices you should use Evernote and when.  </p>  <p style=\"\">  \t<strong style=\"\">How to get organized </strong>How to capture your information using multiple sources. How to use Web Clipper. How to Email directly into Evernote! How to use Evernote in a smart way. How to scan documents on the go. How to track your Food! How to use the Evernote trunk!  </p>  <p style=\"\">  \t<strong style=\"\">How to get ready for…peace of mind: </strong>How to search. How to secure your data. How to do Two-Step verification! Extra secure. How to handle large projects.  </p>  <p style=\"\">  \t<strong style=\"\">How to get creative and become a pro </strong>How to Share and Collaborate – This is fun! How to Chat – did you say chat? Yes!  </p>  <p style=\"\">  \t                                            That should be sufficient for one course. If you do all these things I can guarantee you will be uncommonly productive in all areas of your life.  </p>  <p style=\"\">  \t          See you in the course.  </p>", 
    "end_date": null, 
    "title": "How to be uncommonly productive using Evernote", 
    "price": "20.00", 
    "instructors": "Alin Vrancila", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399334_bdbc_3.jpg", 
    "course_url": "https://www.udemy.com/lifeeasier/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T20:47:06Z"
}