{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*** Over 28,539 Students and 139+ 5-Star Reviews for My Courses  on Udemy ***</strong></p><p><strong>Learn How To Unleash Your Inner Creative Genius, Get More Important Work Done, and Skyrocket Your Productivity</strong></p><p><em>Do you wake up every single day inspired to create amazing art, write your book, grow your business, and work on meaningful and fulfilling projects?</em></p><p>When I went to school, they never offered courses like <strong>How to Be a Creative Genius 101</strong> or <strong>Productivity Secrets of Successful Creative Artists and Entrepreneurs </strong>or <strong>How to Change the World 202</strong>.</p><p>If they had offered such courses, I would have definitely taken them!</p><p>I had to learn it all the hard way. After getting a degree in Business and Entrepreneurship from the #1 Entrepreneurship program in the US at the time, I realized I still knew very little about how to actually create a successful business, write a book, change the world, or do anything else on my list of dreams.</p><p>I had to figure it out on my own with the help of thousands of books, hundreds of seminars and workshops, and over a decade of experiencing running my own businesses, and writing and publishing books.</p><p>Ten years later, I'm now a bestselling author of more than twenty books and run a few very successful lifestyle businesses from the comfort of my home.</p><p>Over the years I've struggled with every obstacle you've undoubtedly faced: fear, procrastination, self-doubt, ignorance, boredom, anxiety (lots of anxiety!), negative friends and family, unsupportive and dysfunctional relationships, a nagging fear of what others might think of me, and much more.</p><p>The good news is that because of all these challenges, I've been able to learn some truly valuable lessons on how to the overcome adversity and roadblocks (both internal and external) that stop most creative people from getting their most important and meaningful work done.</p><p><strong>Here's what you'll learn in this course:</strong></p><ul><li>The truth about creativity that most of us have been brainwashed to ignore, and how understanding this <strong>one simple truth </strong>can turn anyone into a creative genius.</li></ul><ul><li>How to get truly focused on what's most important to you (even if your friends all think you're a flaky multi-tasker who can't seem to focus for a minute).</li></ul><ul><li>How to come up with \"big ideas\" regularly and automatically (and how to make sure you actually implement your big ideas to make the world a better place).</li></ul><ul><li>And much more!</li></ul><span></span><strong>Scroll up and click \"Take This Course\" to get started and Unleash Your Creative Genius today!</strong>", 
    "end_date": null, 
    "title": "How to Unleash Your Creative Genius", 
    "price": "30.00", 
    "instructors": "Tom Corson-Knowles", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539444_024e_5.jpg", 
    "course_url": "https://www.udemy.com/unleash-your-creative-genius/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T19:04:33Z"
}