{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>ABOUT THIS COURSE</p><p>Gain new perspectives and learn new principles and strategies for effectively tackling the habit of procrastination.</p><p>Procrastination can really hold you back, occasionally to the point of making a person physically and/or mentally ill. Recognising the early signs of this problem and identifying the root cause is just the beginning of learning how to overcome procrastination that is present throughout different areas of your life.</p><p>Throughout this course, you will:</p><ul><li>Begin to understand why we procrastinate, what it is and where it comes from.</li><li>Learn how to overcome and manage destructive thinking.</li><li>Take responsibility for procrastination.</li><li>Change your perspective about procrastination.</li><li>Be able to pinpoint the exact source of procrastination in your life.</li><li>Learn how to deal with procrastination before it becomes a health problem.</li><li>Build a stronger character and mindset to help combat procrastination.</li><li>Build an effective strategy to overcome the habit of procrastination.</li></ul><p>We have all procrastinated at some point in our life, the problem lies when it becomes a habit. Procrastination is everywhere – at home, at work, at the coffee shop, online, at Uni, with friends and even with family – it can be anywhere and rear its ugly head when we least expect it.  - this course designed to cater for all.</p><p>Throughout your learning experience, you'll gain a number of essential skills, many of which you can action immediately to see immediate benefits. Some of the most effective principles taught are unique to this course. Proven to really make a difference in your overall quality of life. Stevie presents this course with his highly practical approach to personal development – one of which has helped many people since 2014 and now you have the opportunity to join them.</p><p>The easy-to-use modules and step-by-step guides are your first step towards a happier, stress-free life.</p><p>Partnered with a 100% money back guarantee, enroll on this truly enlightening course to learn the essential truths to overcoming procrastination, and in turn live a  healthier life that you're passionate about living.</p><ul><li>Category:Personal Development</li></ul>WHAT'S IN THE COURSE<p> 35 lectures and over 2 hours of content. The content is made up of talking head videos and a number of practical exercises and quizzes.</p><ol><li>Helping you Successfully understand why we procrastinate.</li><li>Understand the major sources of procrastination and realistic ways of managing the negative thoughts and feelings that are associated with it.</li><li>Be able to pinpoint the exact source of procrastination in your life.</li><li>Effectively manage this negative habit throughout every area of your life.</li><li>Learn how to deal with procrastination before it becomes a health problem.</li><li>On completing the course you'll be able to cope with procrastination better, win back control of your workload, improve your working relationships, and live a happier,effective and more balanced life.</li></ol>COURSE REQUIREMENTS:<ol><li>Students will need access to a computer and printer.</li><li>Students will need access to a notepad and pen.</li><li>Students would ideally be open to considering new idea's and thoughts.</li><li>Students would ideally have experienced procrastination in at least one area of their life.</li></ol>WHO SHOULD ATTEND?<ol><li>This course has been specifically designed as a generic guide for anyone who recognises that procrastination is a problem or a habit in their life, for anyone who is stuck in this habit and do know how to get out, or who is in a relationship with someone who consistently procrastinates.</li><li>This course is for people that want more from their relationships, business and  more purpose for their life.</li><li>The content herein can be used as a reference aid by counsellors, life coaches, business coaches and trainers.</li><li>Finally if procrastination is holding you back in a negative way and has become part of your daily routine.</li></ol>", 
    "end_date": null, 
    "title": "How To Break The Habit Of Procrastination", 
    "price": "20.00", 
    "instructors": "Steven Mills", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537372_07e3_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-break-the-habit-of-procrastination/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-25T20:02:41Z"
}