{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is for people that today say: enough. Enough to poverty, laziness, poor social skills and living a life that makes them miserable. This course is not about acquiring new professional skills. <strong>Its about acquiring new life skills, its about making you effective, successful and productive. </strong>No matter your profession or previous experience, you will change radically the way you are thinking, interacting professionally with people daily and finally, change the outcome of your effectiveness. This course is all about self-development. Some people wake up each morning to an alarm clock. Not an opportunity clock. If you organise your day in a way that will be both productive and positive/pleasant for you to work through, you are destined to success. </p><p><strong>Course updated as of November 21st, 2015</strong></p><p>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%</p><p><strong>What students say about it:</strong></p><p>\"Patrick H: <strong>The class was all meat...straight to the point and effective!</strong></p><p>I really appreciated how the instructor simplified complicated scientific jargon and made the course very practical. You have made a terrific course that is easy to follow and that provides accessible tools for productivity, and for a life well lived!</p><p>Very comprehensive for a 1-hour course...thanks.\"</p><p>\"Andrew W.: <strong>Great insight!</strong></p><p>I definitely enjoyed taking this course! She did a great job taking hard to answer questions and answering them in a way that is easy to apply. There is a LOT of material covered in just an hour. Apply her techniques, and you will see an increase in your productivity.\"</p><p>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%</p><p>The terminology of the course is quite simple to follow. No need for complicated scientific terms that make our life challenging. </p><p><strong>The course guides you through basic life hacks that dont cost a thing but produce massive effect. I created this course within a day. Wanna know how?</strong> I am pretty much describing all I do, every day in order to stay productive. The structure of the course is pretty easy to follow and includes some tests in order for you to better comprehend the materials. </p><p><br></p>", 
    "end_date": null, 
    "title": "How to achieve Limitless Productivity", 
    "price": "25.00", 
    "instructors": "Elena Seranova", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375390_cb4a_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-achieve-limitless-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T06:00:48Z"
}