{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Bạn có biết?</strong></p>\n\n<ul><li>80% nỗ lực hằng ngày của bạn chỉ mang lại 20% kết quả có giá trị nếu bạn làm việc mà không có kế hoạch.</li><li>Đặt mục tiêu tốt có thể gia tăng cơ hội thành công gấp 10 lần.</li><li>Stress không chỉ làm giảm năng suất lao động, mà còn làm suy giảm trí tuệ, ảnh hưởng sức khỏe lâu dài.</li><li>40% nỗ lực sẽ bị lãng phí cho việc chuyển qua lại giữa các công việc khi bạn làm nhiều việc đồng thời.</li><li>Quản lí trực quan đang thay đổi cách thức làm việc của hàng triệu người trên khắp thế giới.</li><li>Cách tốt nhất để tăng hiệu quả và chất lượng công việc là giới hạn việc làm đồng thời. Đó cũng là cách triệt tiêu stress bền vững.</li><li>Personal Kanban là giải pháp đơn giản đảm bảo tăng năng suất và chất lượng công việc mà không tốn sức.</li><li>Nhân viên từ hàng loạt tổ chức hàng đầu thế giới và cả Việt Nam đã học Personal Kanban để thay đổi cách làm việc, từ Spotify, Liên hợp quốc, JPMorgan, Ngân hàng Thế giới, FPT, Alimama, Pathway, Planday…</li><li>Bạn sẽ tăng gấp đôi năng suất</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Hằng trăm người đã học khóa \"Hoàn thành mọi việc với Kanban\" của Học viện Agile. Họ nói gì?</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Tất cả các vấn đề về công việc cá nhân của tôi giờ đã “KANBAN” hết. Cảm ơn giáo viên và Học viện Agile.\"</em> - Nguyễn Tuân, Giám đốc Đào tạo.</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Thiết kế khóa học rất hiệu quả. Mục tiêu, bài giảng, bài tập, tài liệu rất ngắn gọn súc tích, cô đọng nhưng rất dễ hiểu và hấp dẫn. Khi bắt đầu học tôi chỉ muốn học một mạch để hoàn thành khóa học. Thực sự có động lực học hành quá điiiiiiiiiiiiii.\"</em> - Nguyễn Phương, Chuyên gia kỹ năng mềm.</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Ui cái khoá học này á, dễ thương mà hiệu quả…dã man luôn, lại vừa đẹp học trong 1 tuần để áp dụng cho 1 năm 2016 hiệu quả bất ngờ nữa chứ.\"</em> - Nguyễn Hiển, Software Engineer.</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Nội dung khóa học rất hữu ích và dễ áp dụng.\"</em> - Phan Lương, Chuyên gia giáo dục.<br></p>\n\n\n\n<p><em>\"Mình cũng xài thử Kanban xem thực hư thế nào, nhưng cũng không thỏa mãn lắm, cho đến lúc học khóa này.\" </em>- Nguyên Ngộ Ngộ, Sale Staff.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bạn sẽ học gì?</strong></p>\n\n\n\n<ul><li>Đặt đúng và kiểm soát tốt mục tiêu ngắn và dài hạn.</li><li>Lên kế hoạch và quản lý công việc linh hoạt bằng bảng Kanban.</li><li>Giới hạn công việc đang làm để tập trung hoàn thành từng việc một.</li><li>Sớm nhận biết các khó khăn, biết cách thay đổi nhằm thích ứng và đảm bảo cho công việc luôn trôi chảy.</li><li>Nâng cao chất lượng công việc dựa trên Định nghĩa Hoàn thành.</li><li>Biết cách tạo lập thói quen làm việc mới, vui vẻ, hiệu quả với Scrumlife.</li><li>Cải tiến liên tục để tiến bộ không ngừng.</li></ul>\n\n\n\n<p><strong>Học phí thì sao?</strong></p>\n\n\n\n<p>Bạn chỉ phải bỏ ra 1 buổi tối cùng với chưa đến 400 nghìn đồng, chỉ như một bữa lẩu với bạn thân.<br>Hãy nhanh tay đăng kí nhập học và bắt đầu đột phá năng suất làm việc, kiểm soát stress và cân bằng cuộc sống!</p>", 
    "end_date": null, 
    "title": "Hoàn thành mọi việc với Kanban", 
    "price": "30.00", 
    "instructors": "Học viện Agile", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650996_78ef_5.jpg", 
    "course_url": "https://www.udemy.com/agilemindset4u/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T06:46:47Z"
}