{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Increasing your ability to focus can bring about life changing energy to help reduce stress and increase time to follow your passion. This course explores five points of wellness--exercise, eating, relaxation, positive mental processing, and following your life's path--to build the skills of focus. This focus is not just for daily tasks or projects, although it will definitely help with that, but more broadly for finding deep focus to bring greater meaning and wellness to your life. Enhancing the ability to meditate will be a key element of the course.</p>\n\n<p>Each point of wellness has its own chapter, and each chapter contains a video lecture with Nancy Candea, as well as a supplemental document that provides further information about the topic. At the end of each chapter there is an interactive handout that will help you evaluate the status of each point in your life and make practical plans to incorporate what you have learned into your life.</p>\n\n\n\n\n\n\n\n<p>This course is designed for everyone--beginner to advanced. If you are completely new to the idea of meditation, and are simply wanting to bring greater meaning and focus to your life, this course provides a step by step accompaniment to implement appropriate changes to reach your goals. If you are an advanced yoga or meditation practitioner or teacher, this course will give you a practical framework to evaluate essential elements of your life and the language to talk about these elements with others. Additionally, Nancy Candea is available for follow up private sessions (not included in course fee) to help you further this journey.</p>\n\n\n\n\n\n\n\n<p>We hope you join us to explore increased focus!</p>", 
    "end_date": null, 
    "title": "Improving Focus for Meditation and Productivity", 
    "price": "40.00", 
    "instructors": "Nancy Candea", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/812504_8388_5.jpg", 
    "course_url": "https://www.udemy.com/improving-focus-for-meditation-and-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-04T15:41:59Z"
}