{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you have a hard time <strong>focusing</strong>?   Are you easily <strong>side-tracked</strong> by the hundreds of random distractions that interrupt your day?  <br><strong></strong></p><p><strong></strong><strong>This course will teach you  proven, powerful techniques for how  to stay FOCUSED on your goals and how to STOP falling off track!</strong></p><p>I will share secrets that will skyrocket your motivation levels and  strengthen your inner resolve.  You will learn how to <strong>stay on track</strong> no matter what, even when disaster strikes!</p><p>Through examining the mind-body connection and learning how our bodies best operate, you will learn the secrets of how to maximize not only your physical energy, but also your <strong>mental energy</strong> and <strong>cognitive resources</strong><strong></strong>. This will serve to <strong>extend your attention span</strong> and <strong>increase your brain power</strong>, so you are able to <strong></strong>stay focused and<strong> </strong>accomplish<strong> more</strong>!<br></p><p>Together, we will work to identify the <strong>present obstacles</strong> in your life as well as anticipate <strong>future obstacles</strong> that may arise.  You will formulate specific strategies to navigate around all your barriers to success and will be guided in the process of developing contingency plans that will help you manage any potential future risks.</p><strong></strong><strong></strong><p>In this course, you will design a creative vision for your life that will give you <strong>direction</strong> and <strong>purpose</strong>.   It's <strong>crucial</strong> to have clarity of vision, because that vision provides the vector upon which the rest of your life will flow.   From an elevated perspective, all aspects of your life should <strong>assist</strong> and <strong>support</strong> you in the direction of you greater life purpose.   Like a streaming river, everything should be moving you towards that one singular vision. </p><p><strong>Hold yourself to a high standard</strong>!  <strong>  Challenge yourself</strong>!   When you rise to the challenge and start seeing progress in your life, you will experience a deep-seated sense of fulfillment and a renewed belief in your self, that you can <strong>genuinely</strong> accomplish anything you set your mind to.  <br></p><p>Come with me, and let me show you the <strong>shortcut to success</strong>!</p><p>***<strong>BONUS</strong>*** I have included a FREE eBook at the end of the course for you to download!  This eBook summarizes the content of the course and is a great resource for you to review the materials in the future as you need it.  Enjoy!!! </p>", 
    "end_date": null, 
    "title": "Increased Clarity & Focus for the Creative Professional", 
    "price": "20.00", 
    "instructors": "Andrea Hayes", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600972_efae_9.jpg", 
    "course_url": "https://www.udemy.com/the-power-of-focus/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T01:08:18Z"
}