{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><u>The Instant-Series</u></strong><u> <em>Presents</em> \"Instant Focus\"</u></p>  <p><strong>How to Get and Stay Focused at what You're Doing Instantly!</strong></p>    <p>How often do you have this happen?</p>    <ul>  <li>You      are supposed to be doing something, yet are continuously getting      distracted by every tiny thing that comes your way and never get anything      done.</li> </ul>    <ul>  <li>You      are supposed to be paying attention to something or someone, yet are      drifting off to <em>la la land</em> and      when you do return to reality, missed what just happened or said.</li> </ul>    <ul>  <li>You are      supposed to be working or studying, yet are constantly logging onto      Facebook checking status updates and see a funny YouTube video or      interesting article, then click the links, and one thing leads to another,      and before you know it, already wasted your entire day.</li> </ul>    <p><em>Let's face it</em>, we are living in a fast-pace world with ever-increasing multitude of distractions competing for our limited attention span.</p>    <p>Being bombarded with insatiable entertainment crave and never-ending information overload, our ability to <strong>focus</strong> has dwindled...and are you already not able to go through your day without being a jittery coffee addict because of this?</p>    <p>Should go without saying, now it's more important than ever to improve your concentration and get focused and stay focused if you ever want to get things done and achieve anything.</p>    <p>Are you ready to give yourself laser-beam focus to stop being distracted but getting things done? <em>Having <strong>Instant Focus</strong> will give you that!</em></p>", 
    "end_date": null, 
    "title": "Instant Focus Course", 
    "price": "20.00", 
    "instructors": "The INSTANT-Series", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654948_e8eb_3.jpg", 
    "course_url": "https://www.udemy.com/instant-focus/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T21:10:17Z"
}