{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        Frustrated? Nothing gets done and more work piles up? Exhausted? Need to make time for yourself? <strong>Do you feel trapped by your hectic schedule?</strong> Are things still on your list at the end of the day or the week or even the month?  </p>  <p>  \t        The key to achieving your goals is to <strong>uncover the behavioral barriers that block you from getting things done.  </strong></p>  <p>  \t        Transform your day from out of control to super productive in 3 hours or less.  </p>  <p>  \t    .....  </p>  <p>  \t    • Learn to take control of your priorities, set the right goals, and plan your time to live your dreams  </p>  <p>  \t    • Learn how to overcome procrastination  </p>  <p>  \t    • Learn your personality type and how it affects the way you spend your time  </p>  <p>  \t    • Learn how to take control of your schedule  </p>  <p>  \t   -----  </p>  Please Note: Success Skills offers 2 time management courses.  <p>  \t The same techniques are found in both courses.  \t Each course offers specific tools and examples for either professionals or students.  \t Please make sure to take the course suitable to your needs.  </p>  <p>  \t This course is specific for: professionals, business owners, managers and executives  </p>  <p>  \t-----  </p>  <p>  \tNote to subscribers: Please find the course workbook (PDF) in Lecture 1, in the right column under \"Downloadable Materials\".  </p>", 
    "end_date": null, 
    "title": "Learn Time Management, Get Organized & Get Everything Done", 
    "price": "30.00", 
    "instructors": "Success Skills", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/89412_dba7_10.jpg", 
    "course_url": "https://www.udemy.com/productivity-mastery-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-07T14:27:26Z"
}