{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Hypnosis – <strong>Learn How To Excel At Problem Solving With Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><li>1. This video course is designed to help you excel at solving your problems easily. You will learn, through this video, how to take problems as challenges. Many a times it happens that the solution to a problem is right in front of us but we fail to notice it. Why? Because we are continuously thinking about the problem not the solution.</li> <li>With self hypnosis, you can program your subconscious mind to relax and look for solutions to the problems as challenges and solve them easily. Be attentive and open-minded and your subconscious will guide you.   </li> <li><b>2. </b><b>How Self Hypnosis Can Help?</b><b></b></li> <li>1) Self hypnosis helps change your old and limiting beliefs and thoughts<b></b></li> <li>2) Self hypnosis brings more mental alertness<b></b></li> <li>3) Self Hypnosis helps you a great wave of relaxation refreshing your whole body<b></b></li> <li>4) Self hypnosis helps to connect with the deep sources of power and energy within you<b></b></li> <li>5) Self hypnosis helps maintain positive attitude <b></b></li> <li>6) Self hypnosis treats stress, anxiety, nervousness and depression successfully<b></b></li></ul><p>This course is ideal for people who lack problem solving skills and focus too much more on the problem rather than the solution to it. This course will help you relax your mind and arrive at the solution of the problem faster and effectively .</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English. </p>", 
    "end_date": null, 
    "title": "Learn How To Excel At Problem Solving With Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581870_3789.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-excel-at-problem-solving-with-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T05:47:35Z"
}