{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description</strong><br></p>  <p>  \t<strong></strong>This course is for entrepreneurs, innovators, problem-solvers and people that want to learn how to successfully evaluate their ideas. The course is based on over forty years of research into the key reasons some innovations take over the world and others never get off the drawing board. Enroll and learn about;  </p>  <ul>  \t<li>Relative advantage. </li>  \t<li>The power of the S-shaped curve</li>  \t<li>Psychological principles behind innovation</li>  \t<li>The innovation decision process</li>  \t<li>Change agents and early adopters</li>  </ul>  <p>  \t            The structure of the course is straight forward and takes you from understanding the psychology that drives innovation, then through each of four major elements for success, and ends with a step by step process you can use to evaluate the strengths and weaknesses of any idea. In addition, when you have finished this course you will be able to take the concepts you have learned and immediately begin applying these concepts to real world problems. Application includes;  </p>  <ul>  \t<li>Rapid assessment of others innovations</li>  \t<li>Conducting formal evaluations</li>  \t<li>Integration of evaluations into existing business plans</li>  </ul>  <p>  \t          Downloadable material includes a worksheet to help with evaluations as well as video clips that support the primary lectures. Including the downloadable materials, the course should take less than an hour to complete. A certificate of completion is available for students that complete the quiz and all lectures.  </p>  <p>  \t<strong>Added Value</strong>  </p>  <p>  \t          In addition to this course, those that complete the course receive free access to another one of my courses, \"Simplify Your Problems: The Psychology of Choice.\" This course teaches you to use a simple 4-step model for problem solving.  </p>  <p>  \t<strong>Future Lectures</strong>  </p>  <p>  \t<strong></strong>By enrolling now you also get any future lectures for today's price. Future lectures will include concepts such as;  </p>  <ul>  \t<li>Brainstorming for ideas</li>  \t<li>How to gain more insights</li>  \t<li>Tools for innovation </li>  </ul>  <p>  \t<strong>Summary</strong>  </p>  <p>  \t  Whether you are thinking about starting your own business or you work in an environment where innovation is rewarded, learning how to evaluate innovations based on a proven, research based framework will help improve your chances of success. <em>Become a Creative Genius: Keys to Successful Innovation</em> is a quick, effective course designed by students for students. Enroll now and start innovating.  </p>", 
    "end_date": null, 
    "title": "Learn the Fundamentals for Successful Innovation", 
    "price": "20.00", 
    "instructors": "Dr. Richard Feenstra", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428478_266a_2.jpg", 
    "course_url": "https://www.udemy.com/innovation-success/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-21T14:37:40Z"
}