{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Dear\nfriend, you are about to learn the secrets most people will never\nknow about how to make goals and get results. Several years ago I got\nto a point where I was so desperate to learn how to get the results I\nwanted. So I made the decision to finally figure it out.</p><p>\n<br>\n</p><p>\nI\nwent out and read every book, listened to every audiobook, and\nwatched every videocourse about goals and getting results. And you\nknow what? Nothing worked very well. I spent the next few years\nlearning from men who were experts with setting goals and getting\nresults, and I saw things and learned what I never could have even\nimagined.</p><p>\n<br>\n</p><p>\nSo\nafter I had learned these things, I created a system. I learned to\nsuccessfully set goals that I wanted which lead to an amazing\nsuperpower to get results from setting the most interesting goals,\nresults like money, travel, experiences, and learning skills.</p><p>\n<br>\n</p><p>\nAnd\nwhat I learned helped me work toward and reach goals in a completely\nnew way. I learned about the way to make goals lead to results, and\nhow to plan that. I also learned how to set goals that automatically\nhelp lead to results.</p><p>\n<br>\n</p><p>\nThis\nis what I will help you to do. I will teach you to write goals about\nany area and still make a plan to reach it. I will show you how to\nmake your plans clear and exactly what questions to ask to start\nplanning.</p><p>\n<br>\n</p><p>\nI\nwill teach you how to get rid of worry about failing your goals, even\nif you have before. I will show you the way achievers set their\ngoals. And I will show you why the way most people set goals doesn't\nprovide results.</p><p>\n<br>\n</p><p>\nI\nwill teach you how to measure the progress every step of the way so\nwe can see the goals getting closer, and I will tell you about the\nway to find your main goal, even if you don’t know it. You will\nknow your main goals within minutes rather than what used to take me\nyears to figure out.</p><p>\n<br>\n</p><p>\nI\nwill show you quick ways to reach goals so so you avoid wasting any\nmore time, and I will show you the best way to move toward goals, no\nmatter what they are.</p><p>\n<br>\n</p><p>\nJoin\nhere on this site. Come on in and let me show you how to make goals\nand get results. Take the first step to learn how to make goals and\nget those dream results.</p>", 
    "end_date": null, 
    "title": "Learn to Set Goals (And The Secrets to Reach Them)", 
    "price": 0, 
    "instructors": "Simon Berg", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698468_216e.jpg", 
    "course_url": "https://www.udemy.com/reach-your-goal/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T18:53:33Z"
}