{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Taking action is the difference between thinkers and doers. Between those who talk the talk and those who walk the walk.</p><p style=\"\">The question is, how do you take yourself from being a thinker to a doer?</p><p style=\"\">What is the key difference?</p><p style=\"\">For a long time, I didn&#039;t have a good answer to this question.</p><p style=\"\">But then I started noticing some patterns. </p><p style=\"\">As I studied the lives of successful entrepreneurs throughout history, as well as ones that I met in person, I noticed an interesting pattern.</p><p style=\"\">Most of them weren&#039;t that smart. Most of them weren&#039;t speed reading. Most of them weren&#039;t learning advanced memory techniques or even taking notes on what they read.</p><p style=\"\">Through my digging, I eventually learned that taking action is based on an emotional feedback loop that controls what motivates different kinds of people.</p><p style=\"\">A lot of the way you think about learning originated when you were in school. In school, you learn that you have to cram info in your head short term, pass a timed test, and then dump the information and move on to the next thing. And if you fail, there are no second chances.</p><p style=\"\">Well, it turns out life is usually the exact opposite of that, especially if you are an entrepreneur. </p><p style=\"\">The whole concept of agile development, which has taken over software development and Silicon Valley and is still expanding starts off with failure as the default mode. It&#039;s not about avoiding failure but learning from it quickly and minimizing the losses.</p><p style=\"\">it&#039;s about learning by doing and taking calculated risks. </p><p style=\"\">Usually, I&#039;d be the first to tell you that learning by doing is the slowest way to learn. But that&#039;s not always true. When you are solving a problem that has never been solved before, learning by doing is usually the only way to learn. (Sometimes software or other models can help simulate reality).</p><p style=\"\">The problem for many accelerated learners, and the reason I designed this course, is that the feedback loop you learn in school can often have very negative impacts on your performance, and how you use what you&#039;ve learned, once you enter the real world.</p><p style=\"\">The key here is to understand that there are two types of learning. Logical learning and emotional learning. </p><p style=\"\">Logical learning is knowing that eating junk food and not exercising is bad for your health.</p><p style=\"\">Emotional learning is actually changing how you live. Changing what you value so that you change how you behave.</p><p style=\"\">Many accelerated learners are really good at the first kind of learning, but not so good at the second. They tend to not have much control over the second type of learning, and not be so good at it.</p><p style=\"\">This course is about understanding that second type of learning so that you start taking more action on what you learn.</p><p style=\"\">And you&#039;ll do that by understanding how the existing feedback loops that are keeping you from taking action can be changed.</p><p style=\"\">What&#039;s the biggest of these feedback loops?</p><p style=\"\">For most of you, it&#039;s fear of failure. </p><p style=\"\">This all goes back to school. The system of having one chance to succeed via a test makes people become perfectionists. It build a lot of fear about doing anything without a perfect plan and perfect knowledge. </p><p style=\"\">With tests, there is a deadline. People tend to do well with deadlines.</p><p style=\"\">But when you are learning on your own, deadlines don&#039;t exist. It&#039;s just you and you. So you end up rarely if ever taking action, and many times it ends up being too late when you finally get around to implementing it.</p><p style=\"\">In this course, you&#039;ll learn how to do two basic things:</p><p style=\"\">1. Destroy the old feedback loops that prevent you from taking action</p><p style=\"\">2. Build up new feedback loops that will keep you in action mode</p><p style=\"\">I&#039;ve talked about the emotional game of taking action, and how much of it is about emotional learning. Which is just a fancy phrase for making an association between a thought and a feeling. Think Pavlov.</p><p style=\"\">Building these associations, and breaking the old ones, is tactical. But it doesn&#039;t equal success on it&#039;s own. You also need strategies to organize your thinking and planning to prevent common problems like information overwhelm and lack of focus. </p><p style=\"\">In this course you&#039;ll get access to a series of one page action systems that will allow you to quickly deconstruct problems and plan your projects and you weeks with maximum efficiency and with an action oriented stance. </p><p style=\"\">If you&#039;ve taken my memory course, you understand why I say that most of the time, memorizing what you learn is a mistake. Most of what you learn can be stored without memorization if you have the right systems in place to keep it organized enough that you can take action on it.</p><p style=\"\">Many accelerated learners imagine a fantasy scenario where they have memorized all important information in their domain of interest and can do anything with it. </p><p style=\"\">But the truth is that this is not how the most successful people operate. Instead they learn just enough to take the first few steps, often delegating massively to others, and learn just enough to develop their vision and execute that vision with a team who collectively know much more than they do. </p><p style=\"\">Much of the information you want to learn doesn&#039;t need to be memorized. It just needs to live in your head long enough for you to take action on it and then discard it or store it for later retrieval in a paper or digital format. The massive time it would take to get spaced repetitions on all this rarely-used information is incredibly costly and almost never worth it. </p><p style=\"\">But this is the trap and the dream that many accelerated learners fall for and never make it past this stage because the dream is impossible to achieve. </p><p style=\"\">I&#039;m not saying memory is worthless, I&#039;m just saying you have to be very strategic about it, and make sure you aren&#039;t memorizing and/or over consuming information as part of a feedback loop that is driven by procrastination rooted in fear of failure. </p><p style=\"\">In this course you&#039;ll learn how to not just train yourself to love taking action, but also how to handle information so that you know when to forget it, when to memorize it, when to store it via paper/digital (for later implementation), and when to take action on it immediately.</p><p style=\"\">There are millions of over educated, under paid accelerated learners across the globe who never get anywhere because they never get past square one except in their imagination. The only difference between where you are now and where you want to be is the actions you have yet to take. </p><p style=\"\">Reading time is over...it had to happen eventually. </p><p style=\"\">Sign up now and let&#039;s get started.</p><p style=\"\">-Timothy</p>", 
    "end_date": null, 
    "title": "Learning the Hard Way Vol 6 : Taking Action The Hard Way", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533190_5d57.jpg", 
    "course_url": "https://www.udemy.com/taking-action/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-20T23:34:11Z"
}