{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>After having written over <strong>one hundred novels, tens of thousands of articles, and tens of scripts</strong>, I have developed a method of breaking down <strong>anything </strong>and easily writing it in the <strong>fastest way </strong>possible. </p><p>This course is <strong>designed</strong> to make the process more about the writing than trying to figure out what happens next. The number one problem that I have noticed many veteran and new writers have when they either want to write something else, or something new, is that they have always <em>relied on their creativity</em> <strong>to get the work down</strong>. </p><p>I was like this as well, but I needed more work and I had noticed that I had a natural talent for breaking down articles for different subjects. I applied this to my writing and honed this technique over the years to where I can write 4 80,000 word novels in a month. </p><p>This course will go over the <strong>techniques</strong> that I<strong> use on a daily basis</strong> to deliver<strong> entire movie scripts, novels, articles</strong>, and even <strong>dissertations</strong>. This select set of organizational methods will work with<strong> any subject</strong> and many will find this course is very <strong>simplistic</strong> by nature,<strong> easy to learn </strong>and grasp, and is easily deployable in current work. </p><p>The course is just a little over a<strong> half hour</strong>, but is so <strong>impactful</strong> that it will <strong>entirely change</strong> how most writers go about their work. Each video covers a different part of the writing and is divided between fiction, and nonfiction, to cover both topics. </p><p>If there was ever a moment where you simply had to take a few days to try and find inspiration instead of actually writing more, <strong>this course </strong>is most likely for <strong>you</strong>. It shows you how to<strong> find more content</strong> within the content that you already have and how to organize the book so that you will almost never have a moment where you need to rely on a moment of inspiration that can take hours to months to have. This is the method I use to have a continous source of creativity and how I am always able to cover any topic that is handed to me.</p>", 
    "end_date": null, 
    "title": "Learn The Quickest Way For Writing a Book that I use", 
    "price": "20.00", 
    "instructors": "Tommy Mertell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628596_983b_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-book-in-a-month/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T06:17:51Z"
}