{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Would you like to be more productive? Would you like to have a greater understanding of how to improve your health and wellbeing? If you answered yes to either of those questions then read on...</p><p>Technology has lead to radical changes in our working environments, and so its important that you learn new skills to ensure that you are working as productively as possible whilst maintaining a good level of health and well-being. </p><p><strong style=\"\">Learn how to quickly increase your personal productivity </strong></p><ul style=\"\"><li style=\"\">learn how to manage stress and pressure</li><li style=\"\">understand the signs and symptoms of stress</li><li style=\"\">understand the health benefits of exercise</li><li style=\"\">understand how the food that you eat affects your productivity</li><li style=\"\">understand how improving your posture can impact on your health and well-being</li><li style=\"\">understand the health benefits of spending time in nature</li></ul><p style=\"\">In this course you will look at a range of different health and well-being focused topics which will help you become more productive.</p><p style=\"\"><strong style=\"\">Learn how to get more done</strong><br style=\"\"></p><p style=\"\">The course combines bite sized high definition video clips with hollywood style motion graphics and multiple choice quiz questions to provide an interesting and engaging learning experience. </p><p style=\"\">Some of the video footage from the course has recently been broadcast on national TV and due to the high level of video production it is completely different to other courses on the same topic.</p><p style=\"\">The product features interview footage from doctor John Mahony, as well as world-class physiotherapist, Paris Payne, whose previous clients include world cup winning rugby player, Andy Gomersall, and did we mention that we recently won a Dragons den style business competition and so the project has been part funded by a consortium of organisations including the National Health Service, The European Union, The University of the West of England and The Healthcare Protection Agency. </p><p style=\"\">At the end of this course you will walk away with a greater understanding of how you can improve your health and well-being as well as practical knowledge of how to become more productive in the digital age and so don&#039;t delay sign up today. </p>", 
    "end_date": null, 
    "title": "Less Stress, More Success", 
    "price": "20.00", 
    "instructors": "Series 41", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385652_7895_2.jpg", 
    "course_url": "https://www.udemy.com/less-stress-more-success/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T13:38:24Z"
}