{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Do you want <strong>More Energy</strong>? <br>  \t<br>  \t      Do you often feel tired and run down throughout your day and wish you could just magically flip a switch and feel energized? <br>  \t<br>  \t      Most of us try to flip this switch by consuming cup after cup of coffee or other caffeinated products, simply so that we can feel <em>normal</em>. If this scenario sounds familiar to you than you’re someone who needs to take this course.<br>  \t<br>  \t      If you have tried everything from caffeine to vitamins, to energy shots, to nicotine to Adderall and everything in between without achieving the results you desired – then you are in the vast majority.  </p>  <p>  \t      Most people yo-yo their energy up and down with stimulants that are helpful for a short time, but ultimately lead to a crash and/or other negative health side effects. Not to mention that over time they can become really expensive. <em>The average executive spends over $2500 a year on Starbucks!</em><br>  \t<br>  \t<strong>    Fortunately for you - there’s another option… </strong><br>  \t<br>  \t<strong>    You CAN have lasting energy and motivation without the crash and you can do it all naturally. </strong>The contents in this course will walk you step by step through the best habits and natural techniques for improving energy, focus, motivation and overall happiness and health.  </p>  <p>  \t<em>If this sounds like something you&#039;re interested in then scroll back up to the top of this page and enroll in this course now!</em>  </p>  <p>  \tSpecifically, throughout the course you will learn how to optimize all of the following things to dramatically boost your energy..  </p>  <p>  \t*Hydration and Oxygenation of Your Body  </p>  <p>  \t*Movement to Maximize Energy  </p>  <p>  \t*Language to Control Your Mental and Emotional States  </p>  <p>  \t*Using the Cutting Edge Energizer Technique to Spike Your Energy  </p>  <p>  \t*Nutrition for Energy 101  </p>  <p>  \t*Alkalizing Your Body for Energy  </p>  <p>  \t*Sleep and Meditation Hacks for Increased Enegry  </p>  <p>  \t*Building Your Energy Muscle  </p>  <p>  \t*Creating Energy Generating Habits  </p>  <p>  \t*Morning Routine for All Day Energy  </p>  <p>  \tand Much MUCH MORE....  </p>  <p>  \tReady for me to make you a morning person with tons of overflowing energy everyday??  </p>  <p>  \t<em>Then scroll back up and enroll in this course now.</em>  </p>", 
    "end_date": null, 
    "title": "Limitless Energy: Double Your Energy as an Entrepreneur ", 
    "price": "50.00", 
    "instructors": "Brandon Epstein", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/216918_b1a2_5.jpg", 
    "course_url": "https://www.udemy.com/limitless-energy-double-your-energy-as-an-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-13T04:35:38Z"
}