{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course takes you through a proven 8-step process for how to take massive amounts of action on any idea you have.  The course walks you through the process with instructional steps and timed working sessions where, in a rapid pace, you will learn a repeatable process while taking action on one of your ideas.  </p><p>By the end of the course, you will have learned the repeatable Action Surge process for taking action, you will have made progress on one of our ideas, and you will learn the extra bonus steps that make living an action-oriented life easy.  We'll not only give you the process, but also talk about how you can become more action-oriented in everything you do.  </p><p>This course is meant for people who want a proven way to take action on the ideas they have in their heads. This is for people looking for a step-by-step process to help them or for them to help others take action instead of just letting another idea pass by. There is no prior knowledge necessary, but working through all the steps is necessary for success. This is an immersive, experiential activity where students will learn by doing rather than just hearing lectures. </p><p>The course steps can be completed in approximately 30 minutes -- so set aside that amount of time at first -- but you will have the steps and bonus lecture to be able to revisit anytime. Plus, you can use the videos to <strong>run through as many ideas as you want, as many times as you want</strong> so there is no end to how many ideas you can take through this process.  After doing it a few times, it will become second nature to you, and the <strong>downloadable and printable workbook we give you</strong> will be all you'll need to take massive action on your ideas and help others do the same with every idea every time.<br></p>", 
    "end_date": null, 
    "title": "Make Your Ideas Happen: 8 Proven Steps for Taking Action", 
    "price": 0, 
    "instructors": "Matt Kane", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717890_6e36_5.jpg", 
    "course_url": "https://www.udemy.com/make-your-ideas-happen/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T03:49:53Z"
}