{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What is the aim of this course?</strong>\n\n  </p>\n\n<p>Management consultants are brutally efficient. They not only are taught to do their work fast, but also are very good in selecting the right issues. I know it from first-hand experience as I spend my first 5 years in this hostile environment of top consulting companies. Yes, we worked sometimes 10-15 hours a day; 6-7 days a week but we managed with a small team to do in 3 months what the the whole company was not able to do in years. Management consultants’ efficiency stems from 3 things: good organization, efficiency in daily activities and extremely good skills in picking the right topics. I think that those skills are crucial and I will teach how to acquire them.\n\n  </p>\n\n<p>In this course I will <strong>show you how to do the right things fast and efficiently </strong>so you can <strong>enjoy fully your work and life</strong> (depending what are your priorities ;) . The course is based on my 11 years of experience as a consultant in top consulting companies and as a Board Member responsible for strategy, improvement and turn-arounds in biggest companies from FMCG, SMG, B2B sector that I worked for.  On the basis of what you will find in this course I have trained over 100 business analysts and consultants who now are Investment Directors, Senior Analyst, Directors in Consulting Companies, Board Members etc.\n\n  </p>\n\n<p>I do not like to overcomplicate things so in every lecture I will be quite straightforward. In every lecture I described a different hack and I give examples how to use it, especially in services such as consulting. To every lecture you will find attached (in additional resources) many useful files: examples shown in the lecture, furthers suggestion, exercises etc.. If you don’t find something that you need let me know - I will try to prepare something and I will added to the course\n\n  </p>\n\n<p>In the course I use 6 main frameworks: 80/20 rule (Pareto Principle), lean manufacturing, theory of constraints, getting things done, critical chain method, lean startup\n\n  </p>\n\n<p><strong><br></strong></p><p><strong>Why I decided to create this course?</strong>\n\n  </p>\n\n<p>The companies I have worked with so far as a Board Member (I am usually, Chief Restructuring Officer VP responsible for Strategy and Development) still have huge problems with  productivity on 3 levels: personal efficiency of team members, the general efficiency of the whole team (you can have efficient people that create inefficient team), selection of topics / tasks / projects.\n\n  </p>\n\n<p>I have always tried to coach them and increase the productivity but on-the-job training is not enough and it is always limited to people you have contact with . To go further and to have a bigger impact you need a material that you can refer people to when they are in need. Therefore, I decided to create this course. Since I work not only with mature companies but also with startups I have tested the material also on them. It proved very handy in making sure that the startups are improving their productivity.\n\n  </p>\n\n<p> \n\n  </p>\n\n<p><strong>In what way will you benefit from this course?</strong>\n\n  </p>\n\n<p>The course is a practical, step by step guide loaded with tones of, tricks, hints, examples that will significantly improve your productivity and improve the quality of your choices. There is little theory – mainly examples, a lot of tips from my own experience as well as other notable examples worth mentioning. Our intention is that thanks to the course you will know:\n\n  </p>\n\n<ol><li>How to set priorities on tasks and projects?</li><li> How to select the right things to concentrate on, also on daily bases</li><li>How to do much faster tasks and to minimize the burden of boring tasks that everybody is faced with.</li><li>How to  avoid doing many things altogether</li><li>How to increase team efficiency</li></ol>\n\n\n\n\n\n\n\n\n\n<p>You can also ask me any question either through the discussion mode or by messaging me directly.\n\n  </p>\n\n<p>I will produce the necessary content and \n\n  </p>\n\n<p> \n\n  </p>\n\n<p><strong>How the course is organized?</strong>\n\n  </p>\n\n<p>The course is divided currently in 5 sections and will be adding new section to address other important issues. Currently you will find the following sections:\n\n  </p>\n\n<ul>  <li><strong>Introduction. </strong>We begin with little intro into the course \n\n  </li><li><strong>How to do the right things. </strong>In the second section we go through ways      you can use to decide what to do and what NOT to do. I will show you how      to avoid common mistakes\n\n  </li><li><strong>How to work faster.</strong> In the third section I will show you how to do faster the tasks or      avoid doing them altogether. This section will have the most useful      productivity hacks that you can apply to make sure that your personal      productivity jumps significantly. Some of them, after modification can be      applied for the team\n\n  </li><li><strong>How to make the whole team work faster. </strong>Fourth section is still in      production. It will show you how to apply the productivity hacks from      previous section to the team. I will also show productivity hacks for the      boss\n\n  </li><li><strong>How not to anything at all and still get things done. </strong>Fifth section is still in      production. It will be devoted to the productivity hacks that can be      applied by the CEO and the owner, founder of the business to make sure      that the whole business is efficient.\n\n </li></ul>\n\n<p> \n\n  </p>\n\n<p>We will be adding 4###sup/sup### and the 5###sup/sup### sections in the coming months\n\n  </p>\n\n<p><strong> </strong>\n\n  </p>\n\n<p><strong>You will be able also to download many additional resources</strong>\n\n  </p>\n\n<ol><li>Examples in Excel, Word, Power Point</li><li>Presentation of slides show in the course</li><li>Links to additional presentations and movies</li><li>Links to books worth reading</li></ol>\n\n\n\n\n\n\n\n<p><strong> </strong>\n\n  </p>\n\n<p><strong>At the end of my course, students will be able to…</strong>\n\n  </p>\n\n<ul>  <li>Set priorities\n\n  </li><li>Select the right things to      concentrate on\n\n  </li><li>Do much faster tasks\n\n  </li><li>Avoid doing many things      altogether\n\n  </li><li>Increase efficiency of your      team\n\n </li></ul>", 
    "end_date": null, 
    "title": "Management Consulting Productivity Hacks", 
    "price": 0, 
    "instructors": "Asen Gyczew", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842300_d4ac_2.jpg", 
    "course_url": "https://www.udemy.com/management-consulting-productivity-hacks/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-07T21:01:43Z"
}