{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>About Mandala Manifesting, the Visionary Video Course</strong></p><p>The course on manifesting has manifested itself! </p><p> Mandala Manifesting operates like the architect who depends upon other disciplines to get the project done. Each discipline (visualization, coloring, weekly worksheets, etc) contributes to creating a final \"hologram,\" a minutely detailed plan for the creation of a long-nursed and rewarding project.</p><p>Coloring relaxes the anxiety-production “worry wart\" brain. Gain a foothold against the resistances that block your flow. Develop habits which support creative work to completion. Incorporate visualization, outline technique and plan a year ahead by scheduling celebrations and days off. Time away is just as important as focused, productive work. The instruction supports integration of the method, not just into your work, but into your brain.</p><p>Naturally, as an astrologer, the mandala serves as a metaphor for the horoscope. The mandala is filled with pattern and so is the horoscope. If your life is routine and habitual, something has claimed your identity, and your creativity is suppressed. </p><p>With manifesting and mandalas, new creativity can be channeled as you do the exercises. Feel the feelings. Experience possibility. Be attentive to pattern. Train on an image everyday. The trajectory of creativity, from pure imagination to achievement, requires daily repetition. This is a pattern also, one that breeds new experiences in surprising ways. </p><p>Manifesting leads to understanding the Universe, its spin and rotation and from which everything proceeds, forever onward. Planets to molecules, to atoms, to galaxies, everything both rotates and circumambulates. Centrifuge. Recognizing these patterns, see them in the form of mandalas, train the mind's eye to expect joy. Create a better day, every day, until we have to ask, \"How good can you stand it?\"</p><p>Welcome to precognitive \"manifesting.\"</p><p>The Law of Attraction is based upon the dynamics of the cosmos, and like the zodiac, it circumambulates a narrative sequence. The story of your life's twists and turns enables you to better plan your workload and commitment. Let's use these road markers to influence our schedule to appropriately maintain goals, in spite of disruptions. It is yours to decide when you've completed your manifesting work.</p><p>More than ten years after the appearance of the movie, The Secret, manifesting returns in the subject of this new work, Mandala Manifesting.</p><p>Friends who have both written their \"Time Travel Essay\" and who also have seen <em>The Secret</em> tell me that the film describes a concept that seems \"selfish.\" Another criticized <em>The Secret </em>as well, saying the techniques \"worked in subtle ways, but it's so easy to fall off track.\"</p><p>\"Hedonistic,\" said yet another. Then, finally another said, \"Haphazard.\"</p><p>Really? The Secret? I still haven't seen the 2006 release. I tried to watch, but something turned in my gut. Maybe it was the over-the-top graphics and music? Maybe it was the same impression? Was it stuck in a selfish fantasy of \"riches\" and not attuned to my larger vision of benefit for all?</p><p>I had endured the movie for only a few minutes. Decided it was not for me. One woman (moi!) rejects a hit movie, no big deal, right? But now I am struck.</p><p>I meet other people who speak of the same impression. When I identified the feeling it came from people who were average and kindly types, trying to be sincere, certainly. They too identified the insularity and selfishness, exclusive luxuries of the very rich (or those who are sure it matters). </p><p>Breakthrough takes you in the opposite direction. You are challenged by other kinds of possibilities. So, where's your creativity and breakthrough? Where's that unrequited desire? Do the pressures of daily existence intrude on your intentions? Do they impede your creative progress? do you dream of some perfect image of happiness located someplace far away? Do you also wonder if more discipline would help to manifest a better life experience?</p><p>Manifesting is not merely about an experience of isolated wealth.</p><p>Mandala Manifesting involves some astrology. It is about enlisting and enrolling a community of supporters for your cause. You will be coloring mandalas, while meditating on life's purpose, on planning, intentions and goals. Some coloring occurs with planetary events such as the time of an eclipse, or the retrograde of Mercury. There are a number of other exercises which lead to quickly realized Manifesting. </p><p>Section One, <em><strong>\"Time Travel Essay\"</strong></em> brings you forward one year. \"Why is everyone congratulating you? What is possible? What is worthy of your manifesting focus. Clarify a possibility there, and the rest is repetition.</p><p>This video course requires under two hours to view--at present. Plans to expand are in work. Two workbooks are meant to accompany the video course and provide a coloring book for adults, and a calendar planner for the year. The instruction requires activities which lead quickly to reasoned goals that also get us out of our comfort zone, and into \"The Zone\" of inspiration. Best of all is the manifesting. I've got some amazing stories to describe my own experiences of Manifesting (over and over!).</p><p>I'm an astrologer, been looking at horoscopes since 1970, all mandalas. I draw inspiration from astrology, productivity innovations, and a profound curiosity about the brain. The quantum physics exploration brings a fresh new \"order\" to the process of desires and goals. All of which lends to the not-yet-released section on \"Speaking in Code,\" building confidence with neuroplasticity and \"My Future Me.\"</p><p>The goal of Mandala Manifesting is to create a new world for our children and share the joy and the discipline of coloring while journaling. All the exercises put you in the perfect mindset for manifesting.</p><p>Mandala Manifesting adds planning and project management to the test of manifesting. This discipline provides creative, flexible and efficient methods to constantly push your project to completion. Never abandon another novel again. Or the dream of love. Or the need for bigger, better, more wonderful living. This course has structures that once integrated, can move you into the flow of your work, your ideal, or your life.</p><ul><li>Experience the magic combination of powers which forward the dream</li><li>Allow bigger, more exciting goals to develop from the heart</li><li>Become more confident about the future</li><li>Enjoy a greater depth of awareness from which to create a new life</li><li>Gain mastery over time and resources</li></ul><p>The course is a goal-structuring plan for the next 12 months. Focus on a \"reset button\" of quiet and serenity while doing something that only the (superior, list-making) Left Lobe of the Brain would dismiss as, \"mindless\" work. Coloring is the pause needed by the constantly organizing brain, in order to change channels, from Left-Brain Critical Thinking, to Right Lobe Global Awareness. Flow is accessed through this gap. We begin with goals, but not at their beginning! We use the Backwards Planning method to visualize goals at their completion.</p><p>Where's your creativity and breakthrough? Where's that unrequited desire? Do the pressures of daily existence intrude on your intentions? Do they impede your creative progress?</p><p>For some artists, a planned calendar is impossible. <em>There is no way</em>. But then, there's reality. The gallery that wants to show new work. They wants a show in 17 months. 24 all new pieces must be created. For this artist, the manifesting plan enables a more positive experience in creation of the new work through a vision that sticks permanently and is repetitively crossing your awareness. </p><p>Visualizing in detail is mapped and managed with outlines or notes in structures, and a determined activity to prepare in advance--far in advance. Mandala Manifesting provides scaffolding for your inspiration, and draws from several well-known productivity disciplines to create a concrete plan.</p>", 
    "end_date": null, 
    "title": "Manifest Joy, Desire, Crazy Success and Fulfillment Now", 
    "price": "30.00", 
    "instructors": "Claire-France Perez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403442_d504_4.jpg", 
    "course_url": "https://www.udemy.com/mandala-manifesting/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T09:44:05Z"
}