{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*Course updated 1-16-16</strong></p><p>  \t<em>What if you could seize control of your todos and accomplish the impossible? </em>  </p>  <p>  \t                  From the creator of MouseWait, the #1 Disneyland App of all-time, and TIMEJAR (one of the first online/mobile time management systems launched in 2003) comes a comprehensive time management/productivity course that will show you the strategies Kelly Johns uses to run several businesses from his home.  </p>  <p>  \t<em>Are you looking for a simple, yet proven method for increasing your productivity and reducing stress? Do you want to spend more time with your family and loved ones? </em>  </p>  <p>  \t<strong>If you're sick of hearing about time management \"theories\" you're going to enjoy learning strategies that actually work in the real world. </strong>  </p>  <p>  \t                  In this course, Kelly Johns will take you on a journey to getting more done in less time while balancing your personal and professional life. You'll feel good about what you're doing, as well as what you're <em>not</em> doing.  </p>  <p>  \t                  Kelly Johns developed this method in 2003 and has used it to create and manage several online businesses. He used it to publish four bestselling novels in less than two years, create a music label, manage teams of employees and outsourcers, and to create dozens of successful iPhone and Android applications.  </p>  <p>  \t<strong>At the end of this course (and even after a few lectures) you will experience less stress while getting more done--which is what we call the <em>TIMEJAR Effect</em>. You will feel less overwhelmed, and you'll be equipped with an easy to use system that you can implement in your daily routine. </strong>  </p>  <ul>  \t<li>Learn 3 simple steps to revolutionizing your productivity.</li>  \t<li>How to create momentum in any situation.</li>  \t<li>Learn productivity secrets from Google as we break down Google Inbox.</li>  \t<li>See the online tools I use to get things done. </li>  \t<li>How to easily manage employees and outsourcers to create profitable products. </li>  \t<li>How this method was used to publish four bestselling novels in less than two years. </li>  \t<li>See Kelly's typical day and the hacks he uses to stay productive. </li>  \t<li>Get advice from Kelly Johns through the Udemy discussion group. </li>  </ul>  <p>  \t<em>\"I'm excited to take you on a journey to becoming more productive, and I truly want to play a part in helping you do what matters most in your life.\" --Kelly Johns  </em>  </p>", 
    "end_date": null, 
    "title": "Master Time Management in 2 Hours with the TIMEJAR Effect ", 
    "price": "30.00", 
    "instructors": "Kelly Johns", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359866_54fe_3.jpg", 
    "course_url": "https://www.udemy.com/time-management-software-timejar-effect-online-course/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T18:01:29Z"
}