{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is part of a 4 volume series on organizing your information. You should take the other 3 courses first.</p>\n\n<p>Simplicity.</p>\n\n<p>That's what's missing in how most people organize their homes, office and vehicles.</p>\n\n<p>We are flooded with information on a daily basis. That's why I created the previous courses on information organization.</p>\n\n<p>But then I realized it still didn't solve my problem of how to organize the objects in my life. Each room, each thing...it should have a home. A place where it belongs and a place where you can always find it when you need it.</p>\n\n<p>There should be a logic to how your things are organized. They shouldn't be in random places. </p>\n\n<p>And they should correspond to how you actually use your objects.</p>\n\n<p>All these problems are solved with this system.</p>\n\n<p>It takes the same framework for organizing your information and applies it to your physical stuff.</p>\n\n<p>This way, you only have to remember one system and it takes care of any organization question you have for the rest of your life.</p>\n\n<p>The question of: \"Where does this go?\"</p>\n\n<p>And the follow up question: \"Where did I put that?\"<br></p>\n\n<p>These problems may seem little but they add up. Saving an hour a day by being more organized is 350 hours a year.</p>\n\n<p><strong class=\"redactor-inline-converted\">That's over 8 work weeks of time. </strong></p>\n\n\n\n<p>The real question is what exactly do you get in this course?<br></p>\n\n<p>In the last course, you learned how to set up your object inboxes.</p>\n\n<p>In this course you learn how to do 3 major things:</p>\n\n<p>1. You will build a map of all your storage locations so that you know how much space you have. This is a step that is almost trivial with computer storage, but for physical storage it takes a lot more time.</p>\n\n<p>2. You learn how to categorize each object in your home/apartment/office/vehicle into one of the categories from the \"One System Framework\" I've been referring to in the previous courses in this series. You also learn how to build an inventory, which is optional, of all your most important objects.</p>\n\n<p>3. You learn how to allocate space to each storage location based on how you will access them (and how often) and how much space is available in each container. </p>\n\n<p>You will end up with a spreadsheet tool that will allow you to search your objects with the same ease and efficiency as you search for files on your hard drive.</p>\n\n<p><strong class=\"redactor-inline-converted\">The end result of having these systems in place is that a lot of the most annoying problems in your life will simply disappear. </strong><br></p>\n\n<p>You will find it very hard to lose things. </p>\n\n<p>It will be very hard to be confused about where something goes. </p>\n\n<p>Finding and storing things will become automatic.</p>\n\n<p><strong>Say goodbye to the organizational riddles and wild goose chases and get ready for a revolutionary system that will truly save you thousands of hours over your lifetime.</strong></p>\n\n<p>Enjoy the course and I'll see you inside,</p>\n\n\n\n\n\n<p>Timothy</p>", 
    "end_date": null, 
    "title": "Mastering Productivity Vol 4: Object Organization System", 
    "price": "30.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/870652_07db_2.jpg", 
    "course_url": "https://www.udemy.com/mastering-productivity-vol-4-object-organization-system/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-06T21:24:12Z"
}