{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is part of a 2 volume series on organizing your information. You should take the Volume 1 course on Information Inboxes First.</p>\n\n<p>I have gotten more requests for this course than anything else. </p>\n\n\n\n\n\n<p>And after over 5 years of development, I am finally releasing it here.</p>\n\n\n\n\n\n<p>This course is the ultimate answer to \"where do I put this piece of paper/digital file?\"</p>\n\n\n\n\n\n<p>There is a special technical word for this type of organization...it's called an <strong class=\"redactor-inline-converted\">ontology.</strong></p>\n\n\n\n\n\n<p>An ontology is a system of organizing ideas into a hierarchy. </p>\n\n\n\n\n\n<p>An example of an ontology is the way a supermarket organizes all it's food and other products. Or how Amazon organizes it's millions of products into various categories. Or the Dewey Decimal system that organizes the hundreds of millions of published books by category.</p>\n\n\n\n\n\n<p>The problem many people have is that they don't have this kind of exhaustive system for organizing their own personal information.</p>\n\n\n\n\n\n<p>That's why it's been requested by so many people over the years.</p>\n\n\n\n\n\n<p>This course contains a hierarchy that has been custom developed and tested for your use to handle all the major areas of your life, as well as all those things that you would consider \"Miscellaneous\" or \"uncategorizable.\"</p>\n\n\n\n\n\n<p>Those four areas are:</p>\n\n\n\n\n\n<p>1. Your career/business</p>\n\n\n\n\n\n<p>2. Your personal life</p>\n\n\n\n\n\n<p>3. Your relationships</p>\n\n\n\n\n\n<p>4. Your health</p>\n\n\n\n\n\n<p>*Note, personal life is stuff related to managing your home or apartment, your finances, technology, property (both intellectual and physical), vehicles, education, and other things like that.</p>\n\n\n\n\n\n<p>There are hundreds of folder ans subfolders to handle anything you throw at this system.</p>\n\n\n\n\n\n<p>I should also mention a bit more about the research that went into this. </p>\n\n\n\n\n\n<p>I have researched over 100 different organizing systems that other people have created to create this one. I've taken the best of the best from each area of your life and created an organizing system to handle that. </p>\n\n\n\n\n\n<p>With other people's system, you will get certain areas that are very well organized because the creator of the system spends a lot of time in that area of their life, and then other areas will be very sparse. You won't find that here. This system is very well balanced.</p>\n\n\n\n\n\n<p>Also, this system will give you a TON of mental clarity on your life in general, as a side effect.</p>\n\n\n\n\n\n<p>The way you organize your information is just a reflection of how you organize your mind. And mental clarity comes from having a well organized mind. </p>\n\n\n\n\n\n<p>When you have a well organized mind, you can handle a lot more coming at you, take one new projects, have 100 different things going on and handle it effortlessly when someone else would be pulling their hair out trying to handle a tenth of that. </p>\n\n\n\n\n\n<p>It also gives you peace of mind. You no longer have to worry about the \"unknown unknown\" which is one of the biggest problems with creating a system on your own.</p>\n\n\n\n\n\n<p>You are never sure if you are forgetting something or missing something that will come back to haunt you later and make you have to re-do your whole system later on and re-organize everything.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">For those of you who have finished Vol. 1, Information Inboxes:</strong></p>\n\n\n\n\n\n<p>The way this system works is you capture everything, digital and paper, into inboxes. Files on your computer, paper, mail, email, and captured web research and notes in OneNote or Evernote. You then have a weekly or monthly practice where you sort each inbox into it's final location in your information reference system, which is included in this course.<br></p>\n\n\n\n\n\n<p>The reason why this system is so groundbreaking is because it doesn't force you to immediately organize everything you touch (or else have your system fall into disarray). Instead, you can batch process all your information which makes it more efficient and less of a hassle and drain on your day during regular working or home hours. </p>\n\n\n\n\n\n<p>The other unique thing about this system is it works in parallel on your computer and your file cabinet system.</p>\n\n\n\n\n\n<p>Whether a file is printed or digital only, it's just as easy to find and it's going to be in the exact same \"place.\" </p>\n\n\n\n\n\n<p>Oh, and one other thing.</p>\n\n\n\n\n\n<p>There is another set of courses coming that involve applying this same methodology to organizing your OBJECTS.</p>\n\n\n\n\n\n<p>And that system is ALSO running in parallel with this one. So you actually are getting a system that will work to organize all your physical objects.</p>\n\n\n\n\n\n<p><strong>To get a little theoretical. </strong></p>\n\n\n\n\n\n<p>There are only two kinds of things you can organize. Two kinds of \"property.\"</p>\n\n\n\n\n\n<p>Intellectual property is information. (Everything you create is automatically copyrighted, even if you never file. Some IP is licensed to you, like this course, but you don't \"own\" it in the same way you own the notes you take on this course, which are your own expression.)</p>\n\n\n\n\n\n<p>Physical property. The objects all around you, including your apartment/home, which is just a big object. And the earth is a really big object.</p>\n\n\n\n\n\n<p>Anything you want to organize falls into one of those two categories. The middle ground is things like books, CDs, hard drives, Kindles, pieces of paper you print out. They are technically physical objects but they serve primarily if not exclusively to represent symbols that you can interpret as a person. Yes, you can use a bad book as a door stop or paper weight, but that's not it's primary use. </p>\n\n\n\n\n\n<p>Originally, this course was just going to cover digital information, but it's been expanded to cover all types of physical objects that only serve as vehicles for symbols, like books, your mail, and papers you print out (and moleskine notebooks, sticky notes, and anything else you can think of.)</p>\n\n\n\n\n\n<p>This course WILL change your life. It will give you a sense of mastery over your information that you can't get any other way, and a sense of clarity because not only will your external and digital places be so much better organized, but your own mind and ideas will all fall into their natural and proper place.</p>\n\n<p>If I had to go back to before I knew anything about accelerated learning, before I knew anything about how to be organized or how to be productive, this is the one thing I would bring with me. It's that valuable.</p>\n\n\n\n\n\n<p>Enjoy the course and I'll see you inside,</p>\n\n\n\n\n\n<p>Timothy</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Mastering Productivity Vol 2: Information Reference System", 
    "price": "30.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848698_cab4.jpg", 
    "course_url": "https://www.udemy.com/mastering-productivity-vol-2-information-organization-system/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T01:06:23Z"
}