{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>We all know the frustration of missing deadlines or forgetting to do something around the house. We know to write ourselves notes so we don't forget, but how do you remember to look at the note? If you have ever struggled to remember what that important thing you had to do today was, this is the course for you. I will introduce you to Todoist, the solution to the “what was I supposed to do again?” problem. </p><p>Todoist is supported by all major software platforms, so your to-do list goes with you wherever you are.  No more mis-placed sticky notes or forgotten memos, Todoist is the one place to list everything that needs to get done. </p><p><strong>Course Overview</strong></p><p>\tIn this course, I will walk you through each feature of both the free and premium versions  of Todoist and demonstrate how it can be used to improve your productivity. I will also reveal my own Todoist to-do list to further show how it can improve your daily life.</p><p><strong>Why choose this course?</strong></p><p>\tThis course is what an optimal to-do list should be: simple. It only takes a few hours to complete, and is designed to be easy to learn. Complicated task systems waste your time; I will not. If you are tired of spending too much time organizing what you need to do, instead of actually doing it, this course is perfect for you.</p>", 
    "end_date": null, 
    "title": "Master Your To-Do List", 
    "price": "20.00", 
    "instructors": "Andrew Whitworth", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622478_5859_2.jpg", 
    "course_url": "https://www.udemy.com/master-your-to-do-list/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T19:27:11Z"
}