{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Eventually every\nlife hacker realizes that productivity is about systems. </p>\n\n<p>The real\n\"hack\" is not a single app or a cool shortcut.</p>\n\n\n\n\n\n<p>It's an elegant\nsystem that allows you to get more done in less time because it reduces the\namount of time it takes to stay organized and get things done.</p>\n\n\n\n\n\n<p>What isn't often\ntalked about in productivity circles is the cost of making decisions.</p>\n\n\n\n\n\n<p>It's easy to talk\nabout saving time with this app or that plugin.</p>\n\n\n\n\n\n<p>But what about all\nthose friction points between apps, between tasks, that rob you of hours every\nday, a minute here, a minute there?</p>\n\n\n\n\n\n<p>Those are what a\nsystem is designed to solve. </p>\n\n\n\n\n\n<p>The key to managing\nyour information for productivity is\nreducing the decisions you have to make, and how long it takes to make them.</p>\n\n\n\n\n\n<p>The way this course\nsolves the problem is that you no longer have to make hard decisions about\nwhere to put new pieces of information.</p>\n\n\n\n\n\n<p>Information.</p>\n\n\n\n\n\n<p>What\nam I talking about?</p>\n\n\n\n\n\n<p>Physical information\nis mail. It's stuff you print out. It's receipts. Packing slips. Magazines and\nbooks. Even golf score cards. A moleskine notebook or a loose leaf\njournal. Sticky notes and scraps of paper. Business cards.</p>\n\n\n\n\n\n<p>Then there is\nDigital Information.</p>\n\n\n\n\n\n<p>This is the real\nkiller for a lot of people.</p>\n\n\n\n\n\n<p>There is information\nthat other people create: Emails. Web sites, articles, blog posts, forum\nthreads (and QA sites/threads). There's videos and audios and PDFs that you\ndownload or stream. There's bookmarks and random open tabs. There's Word docs and\nSpreadsheets and PowerPoint files. </p>\n\n\n\n\n\n<p>Then there's\ninformation you create. Photos and screenshots from your phone. And videos. And\nvoice memos. And maybe photos and videos from your DSLR. Notes-to-self in your phone. Papers that you scan into the computer.</p>\n\n<p>You have a perfect storm of information overload coming at you everyday. </p>\n\n<p>And it probably feels like there is no way to stop it.</p>\n\n<p>This system is the way. </p>\n\n<p>For each type of information, whether physical or digital, has an inbox. Each room where you do office work or learning has an inbox, a storage area and an outbox. You will learn how to create \"Pipelines\" for certain types of information.</p>\n\n<p>You'll learn how to manage the backup of all your information in all your digital inboxes. Automatically.</p>\n\n<p>The title of this  course says Volume 1. Why?</p>\n\n<p>Because there is a course directly related to this course that comes next, in Volume 2. </p>\n\n<p>Volume two shows you how to batch process each of these inboxes. It shows you how on a daily (email), weekly (web pages) or monthly (files, photos, videos) basis you can batch process the contents of each of your digital and physical inboxes.</p>\n\n<p>Batch processing vastly improves your productivity because you reduce the amount of task switching you do.</p>\n\n<p>Volume two shows you how to do batch processing and gives you a full \"Life System\" that will teach you where to store all your information for long term storage, once you move it out of the inbox. </p>\n\n<p>The Life System categories are 1. Professional, 2. Personal, 3. Relationships, and 4. Health. The full system contains hundreds of sub folders and is 3-4 folders deep in most cases. You will get the full folder structure as a zip file in Volume 2 as well as a walkthrough of how to use the system. </p>\n\n<p>However, remember this ISN'T part of this course. This course is just about setting up all your inboxes, which is a prerequisite for Volume 2. </p>\n\n<p>Just this first step of setting up the inboxes will take you several hours to complete once you have watched all the videos, and to implement Volume 2 will take even longer. Because of the amount of information and time required to implement these have been split up into two volumes.</p>", 
    "end_date": null, 
    "title": "Mastering Productivity Vol 1: Information Inboxes", 
    "price": "30.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/832020_79c7.jpg", 
    "course_url": "https://www.udemy.com/mastering-productivity-vol-1-information-inboxes/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-26T03:55:27Z"
}