{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is the first in a series of courses on planning and scheduling. </p>\n\n<p>You will learn the PAMeLa model for planning as well as a system for managing your time and your calendar on an hourly and daily basis. </p>\n\n\n\n\n\n<p>The courses that follow this one focus on the larger scale units of time: Weekly/Monthly, Quarterly/Yearly, Multi-Year, Lifespan/Legacy planning.</p>\n\n\n\n\n\n<p>This course is design to solve the paradox between spending most of your time in the a flow state and being able to schedule your time down to the hour and half hour-- and be accurate with your time estimates.</p>\n\n\n\n\n\n<p>For a long time I was a go with the flow type planner. Meaning I tried my best to have zero items on my schedule each day. I loved having the total freedom to work on whatever I wanted to work on and do whatever I wanted to do.</p>\n\n\n\n\n\n<p>This works for many years. Then I started asking some tough questions.</p>\n\n\n\n\n\n<p>I wanted to know how I was spending my time.</p>\n\n\n\n\n\n<p>And how much of it I was wasting.</p>\n\n\n\n\n\n<p>I figured I wasn't wasting much, but I knew there had to be some. I just had no idea whether it was 2 hours a week or 20. </p>\n\n\n\n\n\n<p>I was spending so much time in the \"flow\" I had no idea where my time was actually going, and if it matched up with my long term priorities and plans. </p>\n\n\n\n\n\n<p>So I decided to do a complete 180 and start planning out EVERYTHING. </p>\n\n\n\n\n\n<p>Literally every 30 minute block of my day. Just as an experiment to see what would happen.</p>\n\n\n\n\n\n<p>Plus, I learned that there were certain projects and areas of my life that I was chronically neglecting, and I wanted to use an hourly planner to make sure I gave those areas the time they need to really make some progress where I had been falling behind.</p>\n\n\n\n\n\n<p>I did this for a week, not expecting much.</p>\n\n\n\n\n\n<p>It turned out there was a wealth of information in the data I collected. I kept track both of what I had planned to do and what I actually did for an entire week on a single piece of 8.5x11 paper.</p>\n\n\n\n\n\n<p>You'll see how to set this up in the course.</p>\n\n\n\n\n\n<p>I did some simple metrics and learned some interesting facts, like on average I was only getting 4 hours of deep, productive work done each day.</p>\n\n\n\n\n\n<p>I learned there were certain people in my life that were taking up a lot more of my time than I thought, and often with things that I wasn't really enjoying or where I wasn't the best person for them to be doing that activity with.</p>\n\n\n\n\n\n<p>I also identified a handful of bad habits or consistent time wasters that were adding up to 10-20 hours each week.</p>\n\n\n\n\n\n<p>I learned that I was a lot worse at estimating how long things would take that I originally thought. I had a couple projects that started as 1 hour time blocks and ended up taking up entire afternoons, 5-6 hours each.</p>\n\n\n\n\n\n<p>After doing this for a few more weeks I started seeing big improvements.</p>\n\n\n\n\n\n<p>I started cutting out the time wasters one by one and re-deploying that time where it was more needed.</p>\n\n\n\n\n\n<p>I started getting a lot more done and streamlining my life.</p>\n\n\n\n\n\n<p>And it was all because of this small experiment. </p>\n\n\n\n\n\n<p>What you get in this course is the process for how to do your hourly and daily planning, at a highly granular level. All the details and how-tos are spelled out.</p>\n\n\n\n\n\n<p>You also get a comprehensive introduction to the PAMeLa Model, which is the framework for understanding how the planning process (which is really a cycle, because it repeats over time) works. </p>\n\n\n\n\n\n<p>The innovation with this model is that it takes into consideration the most recent advances in Artificial Intelligence and the planning that robots and Artificially Intelligent Agents use to plan optimally.</p>\n\n\n\n\n\n<p>It also places a higher value that any other time management or planning system on the market does on learning.</p>\n\n\n\n\n\n<p>Meaning, your planning process is really a learning process.</p>\n\n\n\n\n\n<p>Every time you make a plan you are making a prediction about how things will turn out, and what the right way to do something is. You could be right, you could be wrong.</p>\n\n<p>Then you act. Trial and error. And you see what happens. You get results, either good or neutral or bad.</p>\n\n<p>That's where most people stop. They just go back and forth with very little improvement. </p>\n\n<p>Those two steps are the P and A of the PAMeLa model. For Plan and Act.</p>\n\n<p>The next two steps are critical.</p>\n\n<p>First is Measure. You have to measure your results. You have to write things down. Or type them in somewhere. You have to have metrics, or record things in your journal, or say them into your phone, or record a video journal. You can't trust your memory to keep these \"measurements\" retained long term.</p>\n\n<p>And even if you do record what happened, that's not enough. Most people who take their learning or planning half way serious have some sort of journal or diary or log that they make entries in daily or at least a few days a week.<br></p>\n\n<p>But most of these people never go back and actually use these records. They just sit there. Unused. No learning ever happens. Or very very minimal.</p>\n\n<p>That's why the last stage is learning.</p>\n\n<p>You have to go through your measurements and records and look for <strong>patterns.</strong> You have to learn from your mistakes. You have to find solutions and dig into the problems to figure out what is really going on. </p>\n\n<p>You have to figure out what you will do differently next time, or better yet, how to create a system so that the problem never even shows up again in the future. </p>\n\n<p>You aren't really an accelerated learner if you don't have a PAMeLa type planning system in place. Because if you don't you are missing out on a gold mine of information about how inefficiently you are learning and behaving on a day in, day out basis. </p>\n\n<p>I guarantee you, if you just do the calendar system for a single week you will identify enough inefficiencies that you will save over $1,000 over the next year in saved time, which you can then better spend elsewhere.</p>\n\n<p>Lastly, you may be wondering why I am teaching this course first, instead of starting with long term planning and then moving down to short term. It's a fair question, and one I thought a lot about. The answer is that for the first few weeks of using this system, you really shouldn't be DOING anything different. It's mostly about learning where you are now, getting a really accurate baseline for how you are currently planning out and living your life. </p>\n\n<p>Once you have that information, then you can start making intelligent decisions. But not before then. </p>\n\n<p>Re-arranging your life is HARD to do. Not easy. And you will get the biggest bang for your buck by changing your daily habits, because you will see changes happen fast and it will give you the motivation to tackle the more long term planning projects, which take more time to think deeply about. </p>\n\n<p>You have to have a stable foundation on the day to day level before you can feel comfortable thinking long term. You won't make smart long term decisions if you have an empty stomach and are sleep deprived with no roof over your head. You have to have the basics down first. That means not in an overwhelmed, stressed out state because you can't handle your current schedule. </p>\n\n<p>This course will get you on firm ground so that you can tackle the longer term solutions when you are ready.</p>\n\n<p>See you inside the course,</p>\n\n<p>Timothy</p>", 
    "end_date": null, 
    "title": "Mastering Planning Vol 1: Hourly and Daily Planning", 
    "price": "30.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/868884_0e60.jpg", 
    "course_url": "https://www.udemy.com/mastering-planning-vol-1-hourly-and-daily-planning/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-04T20:32:14Z"
}