{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Watch us guide and mentor you real skills needed to be a management consultant at an elite firm – McKinsey.</p>\n\n<p>If you have never worked at McKinsey, it’s still worth watching this to understand the core techniques and toolkits which are easier to inject into other firms or industries.</p><p>We provide you with all the tools and techniques and most importantly how to become better focused on your career, business and yourself.<br></p>\n\n\n\n\n\n<p>McKinsey &amp; Company is a world’s leading management consulting firm. It conducts qualitative and quantitative analysis in order to evaluate management decisions. </p>\n\n<p><strong class=\"redactor-inline-converted\">80% of the world's largest corporations are counseled by the firm, which is considered the most prestigious management consultancy, this course will reveal the hands on secrets behind the firm’s success.</strong>\n\n  </p>\n\n\n\n\n\n<p>To make the process easy, we've broken down the course into 7 sections which could possibly cover every aspects of your work.\n\n  </p>\n\n\n\n\n\n<ul><li>Solving a problem</li><li>Leading a team</li><li>Managing clients</li><li>Communication skills</li><li>Managing time</li><li>Managing yourself</li><li>Preparing for a McKinsey interview</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By mastering these core modules you'll be ready to work like a McKinsey strategy consultant. To begin earning a better salary and living a better life.\n\n  </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">My course is designed for anyone who wants to advance their career, regardless of what industry you're in or what stage you're at. \n\n  </strong></p>\n\n\n\n\n\n<p>What you'll come away with will be theories and tools that will become immensely valuable to your business life. They will change the way you think about and conduct business.\n\n  </p>\n\n\n\n\n\n<p>At it's core, management consulting is identifying what changes a company needs to make to become better. Then, developing a strategic plan for getting there and finally effectively executing that plan. \n\n  </p>\n\n\n\n\n\n<p>As a consultant, your job is to immerse yourself in the product or service a company sells. To learn everything about it. Then, map out a strategy for a more efficient and profitable way to sell that product or service. In other words, do it better, faster and with a better ROI.\n\n  </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Management consulting is a rapidly growing field.\n\n  </strong></p>\n\n\n\n\n\n<p>Demand for college graduates is so great, that top firms are offering salaries of <strong class=\"redactor-inline-converted\">$90,000</strong> or more for first year employees. Experienced consultants can easily earn <strong class=\"redactor-inline-converted\">six figures plus bonus</strong>. With the techniques you'll learn in my course, you can write your own ticket.\n\n  </p>\n\n\n\n\n\n<p>The time to take action is now! McKinsey Productivity Pointers gives you unlimited access to a library of more than 40 training videos. View them on your time on your laptop or any mobile device. We give you numerous step-by-step guides including problem solving, leadership, time management, communication and a lot more. Plus, you'll receive in-depth supplementary materials, tool kits and other invaluable further readings.\n\n  </p>\n\n\n\n\n\n<p>What's required?\n\n  </p>\n\n\n\n\n\n<p>Just a basic working knowledge of business and the motivation to improve your business career. \n\n  </p>\n\n\n\n\n\n<p><strong>Enroll now and become a member. Click the link above! Together, we will write your success story!</strong></p>", 
    "end_date": null, 
    "title": "McKinsey Productivity Pointers", 
    "price": "20.00", 
    "instructors": "SAP BRIEF", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/825530_63eb_5.jpg", 
    "course_url": "https://www.udemy.com/mckinsey-productivity-pointers/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T00:55:13Z"
}