{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>With this premium personal productivity training, you will:</p><ul><li>Dramatically increase your productivity</li><li>Beat procrastination</li><li>Start or stop any habit in less than 2 minutes per day</li><li>Get organized effortlessly</li><li>Get in total control of your career and life</li><li>Get more done in less time while being happier and happier</li></ul><p>This course is <strong>3 in 1</strong>: It includes video, audio and e-book versions. It also includes two Meta-Habit<strong>™</strong> templates.</p><p><br></p><p>The course is organized into 5<strong> easy-to-learn</strong> modules:<br></p><ol><li>The Secrets of New Productivity</li><li>The Meta-Habit™<span></span></li><li>The Productiveness Framework™<span></span></li><li>33 Golden Nuggets of Productivity Wisdom</li><li>7 Productivity Power Tools</li></ol><p>Each of the modules is further divided into individual lessons.</p><p>You can complete the course in a single week. It will have lasting effects on your productivity, career and well-being.</p><p><br></p><p>In the<em> first module</em> (Secrets of New Productivity), you will learn how to..</p><p><strong>Work smarter, not harder! </strong>Get more done in less time, earn more money, be happier and relax. Win in life and business.</p><p>When you try to become productive, you simply try to work harder. But if you become meta-productive instead, you will start working smarter, and <strong>become more productive permanently</strong>.</p><p>The Meta Productivity approach is the next level of personal productivity. It's a stand-alone system of powerful techniques and insights. All to make you super-productive with the least effort possible.</p><p>Increasing your productivity is a huge opportunity. How would you like to be able to get two days’ worth of work in a single day?</p><p>Productivity can be your ultimate edge. Once you become efficient, other inefficient people would have to work 18-hour work days just to keep up with you.</p><p><br></p><p>In the second module - The Productiveness Framework™ - you will get organized and dramatically increase your productivity while decreasing stress and overtimes. You will also become more confident in your work, knowing that you are always doing exactly the right thing at the right time.<br></p><p><br></p><p>In the third module, you will<strong> master your habits </strong>with the simple Meta-Habit™ system. You already know what you would like to do… But doing it <strong>consistently</strong> is the problem.</p><p>Have you ever started a new habit, then took a break due to an ilnness or travel, then never resumed it again?</p><p>With the Meta-Habit™ system, you will be able to:</p><ul><li>Successfully start new habits in less than 2 minutes a day</li><li>Break old negative habits</li><li>Be <strong>consistently successful</strong> with your habits with minimum effort</li></ul><p>Whether you want to exercise regularly, get up sooner, or lose weight… with the Meta-Habit™ technique, you finally can!</p><p>The Meta-Habit™ system will become your new superpower for changing your life.</p><p><br></p><p>The 4th module will make you a wise productivity genius.</p><p>A single “AHA!” moment can make you glad you’ve read a book.</p><p>And <strong>in this module, you will likely get at least a dozen “AHA!” moments.</strong></p><p>You will increase your awareness of productivity, efficiency and strategic thinking. You will also understand yourself better.</p><p>These newly gained insights will then help you to<strong> increase the results you are getting in life</strong>.</p><p>You will learn:</p><ul><li>How to get into the flow state (\"doing without doing\").</li><li>Why productivity is ultimately emotional and how you can use that to your advantage</li><li>The 2 most important laws of productivity</li><li>How to make decisions faster, and how to pre-decide</li><li>How to get back on track ASAP when you have a bad day… without sabotaging yourself in the long run</li><li>How to get more willpower (<strong>willpower is a resource you are probably wasting every day</strong>)</li><li>How to access and use your motivation</li></ul><p>And so much more! There are over 33 valuable insights in this module that you can immediately apply in your life to become more successful.</p><p><br></p><p>In the final <strong>bonus</strong> 5th module, you will get additional 7 productivity tools.</p><p>You will learn:</p><ul><li>How to get started on an unpleasant task and have fun while doing it</li><li>The best thing you can do before taking a break</li><li>Which one common mistake (that no one talks about) you should avoid when using a to-do list</li><li>How to get unstuck in your work and life</li></ul><p>And so much more! Meta Productivity is jam-packed with valuable information, tips and powerful systems.</p><p><br></p><p>What students say about this course:</p><blockquote><em>Meta Productivity is <strong>absolutely enlightening</strong>. <br><br>Not only do the authors <strong>offer great advice</strong>, but they break down everything you need to do to boost your productivity - they've made it <strong>foolproof</strong>! <br><br>Since completing their training, I've <strong>restructured my life and found peace in my work</strong>.</em></blockquote><p>- Krista C, USA</p><p><br></p><blockquote><em>... your Meta Productivity training is <strong>like nothing else I have used before</strong>. My <strong>productivity and organisation has sky rocketed. Very happy.</strong></em></blockquote><p>- Paul T, Australia</p>", 
    "end_date": null, 
    "title": "Meta Productivity - Become super-productive", 
    "price": "20.00", 
    "instructors": "Jiri Novotny", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725890_1e19_11.jpg", 
    "course_url": "https://www.udemy.com/meta-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T18:04:06Z"
}