{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled ' <strong>Mind Power - 6 Simple Techniques To Improve Your Focus.' </strong>By Pradeep Aggarwal , </p><p>Focus – we all want more of it. Some of us probably need it more than others. We want to have the best productivity that we can have with our work or with our hobbies. Focus is essential regardless of what you are doing.</p><p>    You need true focus, the kind that has you engaging with what you’re doing, because you will learn more and you will get more done. You will be more aware of the details. You will be more prepared and this is the essence of true focus.<br></p><p>You will learn -</p><p>Powerful techniques to make your mind more alert and increase your focus in life to achieve your goals and desires in life.</p><p>It is very helpful for students who are looking out for a well settled career and require high level of focus and concentration in their life.</p><p>You will also learn <strong>Mindfulness </strong>techniques and <strong>Instant Relaxatio</strong><strong>n</strong> techniques to keep your mind alert and focused all the time.</p><p>Students will also learn how to anchor the feeling of confidence as and when required to make the most out of the situation at hand.</p><p>It is also very useful for people who are into sports and require high level of focus and concentration in their life.</p><p>This course has been recorded in English and contains 10 live recorded lectures. Time duration of the entire course is more than 35 minutes.</p><p><br></p>", 
    "end_date": null, 
    "title": "Mind Power - 6 Simple Techniques To Improve Your Focus", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/696950_92d7.jpg", 
    "course_url": "https://www.udemy.com/mind-power-6-simple-techniques-to-improve-your-focus/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T07:31:03Z"
}