{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tVision Boarding is an excellent way to plant the necessary seeds to really begin to see the changes in your life that you know to be possible. Traditional vision boards call for you to purchase a poster board and dozens of magazines to create an amazing collage in order to motivate, inspire, and be a catalyst for change. And it does the job, but most times only from your bathroom or bedroom. We would all think it about odd if someone walked around with a posterboard. Enter the Interactive Vision Board. The Interactive Vision Board goes wherever you go, enabling you to draw energy from it whenever you need it!  </p>  <p style=\"\">  \tLearn to <em style=\"\">create </em>your own Interactive Vision board that you can draw energy from. An Interactive Vision Board goes with you to the gym, on the job interview, and helps you get through moments we all have where the light at the end of the tunnel doesn&#039;t shine so bright. Could you benefit from having access to that type of inspiration at your finger tips?  </p>  <p style=\"\">  \tArticulate a clear vision of what you aspire to be in life  </p>  <p style=\"\">  \tFocus on fundamental image of this life you seek  </p>  <p style=\"\">  \tSimplify language that allows individuals immediately apply course content  </p>  <p style=\"\">  \tAvoid alienating yourself by encouraging collaboration  </p>  <p style=\"\">  \tImmediately create an Interactive Vision Board so you know HOW and WHAT your vision of success is  </p>  <p style=\"\">  \tStarting a business, getting that promotion, finding that special someone, taking that dream vacation, etc...  </p>  <p style=\"\">  \tWe all have life that we have designed for ourselves that we have every intention of realizing and could use all the help we can get because life isn&#039;t always easy. Images are how we process information, so having access to the images of our desired life is the key to realizing it. How many moments in your life would&#039;ve went differently if you could have taken a deep breath and referred to your Interactive Vision Board to strength?  </p>  <p style=\"\">  \t<em style=\"\">My Vision Board: How to Create Interactive Vision Boards</em><span style=\"\"> was built for the individual to be able to maximize the tremendous power of vision boarding. </span>  </p>  <p style=\"\">  \t<span style=\"\">On your terms. </span>  </p>  <p style=\"\">  \t<span style=\"\">The inspiration. </span>  </p>  <p style=\"\">  \t<span style=\"\">The motivation. </span>  </p>  <p style=\"\">  \t<span style=\"\">When you want it. </span>  </p>  <p style=\"\">  \t<span style=\"\">When you need it. </span>  </p>  <p style=\"\">  \t<span style=\"\"><strong style=\"\">Content and Overview</strong></span>  </p>  <p style=\"\">  \tOrganizing Your Effort for the Ladypreneur is for the female enterpreneur that has either already started their respective business or the Ladypreneur that is prepared to launch and looking for guidance. This course combines practical business practices with the concepts of Education Based Marketing specifically tailored to the circumstances of today&#039;s female entrepreneur.  </p>  <p style=\"\">  \tThere are 4 sections with 13 lectures, and 4 quizes that are best suited to be accessed one after another with time to apply in between, but in respect to the individual can be taken at your own pace. The sections cover topics to allow you to successfully plan, prepare, construct, customize, and utilize your Interactive Vision Board virtually anywhere. Furthermore, there is an entire section dedicated to how you can use your Interactive Vision Board to start taking the steps to reach your expectations. Don&#039;t laugh at me, but I even include my own Interactive Vision Board to serve as either inspiration or an idea of how weird I am :-) on today&#039;s business climate for the Ladypreneur in regards to organizing the sale process in order to maximize individual interactions with ideal customers and clients. What&#039;s really innovative about this course is that is practical. Meaning that the language is conversational which opens the content up to Ladypreneurs of all business backgrounds and demographics who are ready to focus efforts in order to start reaching business goals and expectations. Also the course is made to scale so whether you&#039;re a Ladypreneur looking to quit your job and go all in or if your just looking to supplement your current income this course can assist your in reaching your objectives.  </p>  <p style=\"\">  \t<span style=\"\">Sections include engaging video lectures and downloadable handouts (module supplements, summaries, recaps,  flow charts) that allow the individuals to measure progress in real time.</span>  </p>  <p style=\"\">  \t<span style=\"\">In addition to the content associated with the course, there are a few external goodies such as an invitation to join a private FB page dedicated to allowing you and other to exchange feedback, advice, tips, and anecdotes to inspire one another. You will have access to me via, announcements, discussions, and email. As well as a group call where we all can collaborate for better living every other Thursday.</span>  </p>", 
    "end_date": null, 
    "title": "My Vision Board: How To Create Interactive Vision Boards", 
    "price": "30.00", 
    "instructors": "Marcus Carter", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369218_c4e4.jpg", 
    "course_url": "https://www.udemy.com/thegoalmentormvb/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T23:39:59Z"
}