{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this <strong class=\"redactor-inline-converted\">NLP-based program </strong>I will reveal the time-tested goal setting strategies that have greatly impacted successful people from all walks of life.  <strong class=\"redactor-inline-converted\">NLP Well-Formed Outcomes</strong> will guide you in achieving your <strong class=\"redactor-inline-converted\">aspirations</strong> with minimal friction.  As you utilize this world-renowned <strong class=\"redactor-inline-converted\">Goal Setting Strategy</strong>, you will eliminate \"Muddy Thinking\" and gain detailed <strong class=\"redactor-inline-converted\">clarity</strong> over what's most important to you.  </p>\n\n<p>This system has been acclaimed for helping millions move past ordinary results, and achieve outcomes that are directly aligned with their <strong class=\"redactor-inline-converted\">best possible selves</strong>.  The course will enable you to develop a compelling future that increases your flow of effort by ensuring that your goals are self-concordant.</p>\n\n<p> As you use the NLP Goal Setting System I'm confident that you will avoid common pitfalls, and further your success in the <strong class=\"redactor-inline-converted\">things that are most important to you</strong>. \n\n  </p>\n\n<p><strong>This course teaches how to set NLP Well-Formed Outcomes and presents much of the material in an indexed format so that you can easily review the strategy whenever necessary.  </strong></p>", 
    "end_date": null, 
    "title": "NLP: Goal Setting Criteria for Achieving the Life You Want", 
    "price": "20.00", 
    "instructors": "NLP, Positive Psychology Coach Patrick Howell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628028_4eca_7.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-achievement-nlp-outcomes/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T15:46:40Z"
}