{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Have you ever had the situation when you just cant seem to get motivated at all? <br style=\"\">How about  what about when you know you &#039;should&#039; be excited or happy but you cant seem to get that going?<br style=\"\">And what about boredom... have you ever had that feeling of boredom where &#039;nothing&#039; will snap you out of it? <br style=\"\"><strong style=\"\">Imagine if you could learn a technique that would enable you to EASILY move from a stuck dis-empowering state through to a highly motive empowering one...</strong></p><p style=\"\">...Chaining anchors is an NLP technique that will see you taking control of your state and really getting a hold of your feelings enable you to maintain whatever state you choose. </p><p style=\"\">If you are a parent or a coach then you will <strong style=\"\">get great benefit out of this course</strong>. Have you ever had to listen to the moaning when its time for homework :) </p><p style=\"\">And of course in your own life, just <strong style=\"\">picture being able to always be at your best, empowered, positive and moving forward. Wouldn&#039;t that be great ?</strong></p><p style=\"\">This course is presented by expert NLP trainer Matt Barnett and is equally applicable to those wanting to work with others or those people who are committed to being the besat they can be in life.  </p><p style=\"\">Sign up for the Chaining Anchors course today! </p>", 
    "end_date": null, 
    "title": "NOW is the time to GET motivated ! with Chaining anchors NLP", 
    "price": "20.00", 
    "instructors": "Matthew Barnett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366920_09e7_4.jpg", 
    "course_url": "https://www.udemy.com/nlp-chaining-anchors/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T22:42:06Z"
}