{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Closed captions available.</strong><br></p><p>This course will show you how to use four excellent apps for managing your information, guide you through setting them up, and provide tips and best practices for using them.  </p>  <p>  \t          The apps are: <strong>Dropbox</strong> (cloud storage), <strong>1Password</strong> (secure password management), <strong>Wunderlist</strong> (to-do lists), and <strong>Evernote</strong> (store and search all your notes).  </p>  <p>  \t          When you have these apps set up, you'll be able to sync your information between computers and mobile devices, and quickly access all of your information from anywhere. This is a key advantage of today's mobile devices – always having your information at your fingertips.  </p>  <p>  \t          The course includes video demos, step-by-step worksheets, and quizzes on:  </p>  <ul>  \t<li>Setting up cloud storage: Dropbox.</li>  \t<li>Setting up a secure password system: 1Password.</li>  \t<li>Setting up to-do lists: Wunderlist.</li>  \t<li>Organizing a place for all of your notes: Evernote.</li>  \t<li>Using these apps together as a system for organizing your life.</li>  \t<li>Security and privacy: tips, best practices, and where to learn more.</li>  </ul>  <p>  \t        Who this course is for:  </p>  <ul>  \t<li>Those who have an iPhone or Android smartphone or tablet and haven't had time to set up cloud storage, password managers, to-do lists, and notes that synchronize with desktop computers.</li>  \t<li>People who would like a good system for storing information digitally and being able to easily find it again.</li>  \t<li>Busy students or professionals who want to free up time to focus on the creative work they enjoy -- because they are no longer losing track of important information, due to lost papers, notebooks left at home, or lost photos on a damaged phone.</li>  </ul>  <p>  \t        With this course you will  </p>  <ul>  \t<li>Save time.</li>  \t<li>Be more productive.</li>  \t<li>Manage your information effectively.</li>  \t<li>Access your information from anywhere.</li>  \t<li>Get the most from your smartphone or tablet.</li>  \t<li>Have a foundation for using other apps that connect with these in useful ways.</li>  \t<li>Reduce stress and focus on what's important in your life (now that your info is organized).</li></ul>  <p>  \t<strong>Enroll Now  \tHaving these systems set up will make all of your creative projects easier -- because you can easily find all of your information from anywhere.</strong>  </p>", 
    "end_date": null, 
    "title": "Organize Your Life with Mobile Apps", 
    "price": "40.00", 
    "instructors": "Nicole Hennig", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400288_593e_2.jpg", 
    "course_url": "https://www.udemy.com/org-your-life-with-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T17:53:59Z"
}