{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You've got a Paperwhite e-reader from Amazon. Now learn to use it to the max.</p><p>You'll see how to quickly set up your Paperwhite, navigate the touch-screen and buy, borrow, and browse the world's largest library of digital books. This course demystifies the Paperwhite and shows step-by-step how to master the Kindle basics, including secret tips, tricks and shortcuts you won't find elsewhere. </p><p>You'll follow along as Amazon guru Steve Weber demonstrates how to: </p><ul><li>Adjust your Paperwhite's setting just the way you prefer.</li><li>Charge your Kindle's battery properly and prolong its life.</li><li>Enjoy an infinite supply of the best books -- daily free and discounted fiction and nonfiction.</li><li>Use personal and office documents, including PDFs. Chuck your laptop, and do all your reading on the Kindle!</li><li>The easy way to harvest your own content and get it onto your Paperwhite, including gems you didn't buy at Amazon.</li><li>How to download, organize and read your favorite books, magazines and newspapers on the Paperwhite.</li><li>Use Amazon's free \"Cloud\" service for unlimited storage of your digital content.</li><li>Find the best free content in the world, downloadable to your Kindle. (You might never have to pay for books, movies or music again--ever!)</li></ul><p>So what are you waiting for? Let's get started right now. This course is guaranteed. You can use it for 30 days, and if you're not 100% satisfied, you get a full refund.</p><p>OK, let's go!</p>", 
    "end_date": null, 
    "title": "Paperwhite Users Guide: Get the Most From Your Kindle", 
    "price": 0, 
    "instructors": "Steve Weber", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663828_c609.jpg", 
    "course_url": "https://www.udemy.com/paperwhite-users-guide-get-the-most-from-your-kindle/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-08T14:25:12Z"
}