{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Performance Under Pressure - The Full Course includes all the three courses already published:</p><ol><li>The Right Attitude</li><li>Taking Action</li><li>Effective Human Interactions</li></ol><p>1. The <strong>Performance Under Pressure - The Right Attitude</strong> section helps you recognize the events and situations that cause you to feel pressure. It explains how you can understand your reaction to pressure, and how excessive stress can impair your performance.</p><p>Finally, it covers the principles for managing your attitude so you stay in control and maintain a success-oriented mentality. Because, meeting high-pressure challenges is an opportunity for you to excel and build your reputation as someone who can be counted on. </p><p>Professionals and all who want to develop their abilities to manage the stress that comes with working under pressure and anyone who wants to develop or refine their skills for performing under pressure.</p><p>After completing this topic, you should be able to:</p><ul><li>identify the factors that in a situation are likely to trigger pressure,</li><li>recognize how your response to pressure can impair your performance,</li><li>conduct a stress profile, and</li><li>manage your attitude in pressurized situations.</li></ul><p>The section includes video lectures, quizzes, examples and exercises and a small optional course project. All should take you not more than 2 hours to finish.</p><p>2. The second part of a series of three courses on <strong>Performance Under Pressure</strong> and focuses on <strong>Taking Action</strong>. And, in this course, you are going to learn not only how to take action under pressure, but also how to avoid over-thinking and over-confidence, and understand what exactly the challenge is.</p><p>Acting effectively in high-pressure situations is not easy. Over-confidence can lead to poor judgment, and over-thinking the situation can lead to paralysis. Also, your perception may become clouded by negative thoughts and emotions in times of pressure. But it's exactly at these times that you need to perceive the challenges most clearly so that you can set appropriate goals and take effective action to achieve them. </p><p>This course sets out some <strong>principles</strong> to help you avoid the dangers of overconfidence and overthinking, which can impair your performance when under pressure. It then <strong>teaches a technique</strong> for clarifying your perceptions in such situations and creating an action plan to optimize your performance under pressure. </p><p>Professionals who want to develop their abilities to manage the stress that comes with working under pressure, and those who want to develop or refine their skills for performing under pressure will benefit from this course.</p><p>After completing this section, <strong>you will be able to</strong>:</p><ul><li>avoid over-analysis and over-confidence in high-pressure situations, </li><li>understand the challenge in a high-pressure situation from emotional reactions,</li><li>manage automatic thoughts to optimize perceptions in high-pressure situations,</li><li>use appropriate steps in the process of taking action in a high-pressure situation, and </li><li>take action in pressure situations to match every challenge.</li></ul><p>3. The third and last part of a series of three courses on Performance Under Pressure and focuses on <strong>Effective Human Interactions</strong>. And, in this course, you are going to learn to prevent and deal with negative pressure, manage your reactions, deal with colleagues and stressful situations.</p><p>High-pressure environments can be hard on professional relationships. You can so easily get caught up with a major project or looming deadline that your interpersonal skills slip. Under pressure, you may start to make instinctive emotional reactions as your awareness of others' feelings fades.</p><p>This course helps you <strong>develop skills</strong> you need to recognize your personal reaction to pressure and how it impacts your relationships with others. It shows how you can consciously control your interpersonal reactions when under pressure and how to avoid unnecessary tensions. </p><p>And it details a <strong>step-by-step process</strong> you can use to stay in control when you're faced with a high-pressure interaction. This all enables you to recognize the importance of professional relationships, and it helps you to stay in control and make the right moves when you're performing with others under pressure. </p><p>Professionals who want to develop their abilities to manage the stress that comes with working under pressure and anyone who wants to develop or refine their skills for performing under pressure.</p><p>After completing this course <strong>you will be able to</strong>:</p><ul><li>understand negative reactions to pressure in the workplace and not only</li><li>use a step-by-step approach for managing your reactions in pressure situations</li><li>deal with a colleague, a friend or anyone else under pressure</li><li>be prepared to manage potentially stressful interactions</li></ul><p>This course includes video lectures, examples, quizzes and some learning support documents, and it will take you not more than 3 hours to finish. And, as usual you have the 30 days money back guarantee, no question asked.</p><p>Now, if this is something that will help you, go ahead and press that <strong>\"Take This Course\" </strong>button. And, see you inside the course!</p>", 
    "end_date": null, 
    "title": "Performance Under Pressure - The Full Course", 
    "price": "50.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/700868_49b4_4.jpg", 
    "course_url": "https://www.udemy.com/performance-under-pressure-the-full-course/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-18T16:53:16Z"
}