{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\"><strong style=\"\">300 New Students In The First 4 Hours Of Launch!</strong></em><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Eliminate Information Overload, Get More Done By Getting Clear, Getting Motivated And Focused And Save Boatloads Of Time While Doing The Things You Love.</strong><br style=\"\">  \t<br style=\"\">  \t  As a brand new entrepreneur, I remember wanting to learn everything I possibly could because I was afraid of making mistakes.  I didn&#039;t want lose money, yet I didn&#039;t know what it took to be successful.<br style=\"\">  \t<br style=\"\">  \t  So what was the first thing I did?<br style=\"\">  \t<br style=\"\">  \t  I started to follow many of the so called &quot;experts&quot;.  These experts not only promised to make me loads of cash, but I would never need any other system to make money online than &quot;theirs&quot;.<br style=\"\">  \t<br style=\"\">  \t  While there were some legitimate experts out there, I discovered they rarely gave you to complete scoop on how to be successful.  So I had to find more information.  I had to find more experts and often times, it lead to more confusion and indecision on my part.  <br style=\"\">  \t<br style=\"\">  \t  This course isn&#039;t about whether they were successful at helping me achieve my financial success, it is about how easy it was to become distracted by the many marketing messages I often received.<br style=\"\">  \t<br style=\"\">  \t  How many mailing lists are you on?  How often do you receive marketing promotions to your inbox?  10? 30? 50?<br style=\"\">  \t<br style=\"\">  \t  I was receiving over 40 because I was following everyone.  I wanted to make sure I didn&#039;t lose out on anything.<br style=\"\">  \t<br style=\"\">  \t  The problem with my strategy is that I suffered from information overload and 3 years later, I still didn&#039;t have a profitable business.  By that point, I spent 10&#039;s of thousands of dollars with little to no result.<br style=\"\">  \t<br style=\"\">  \t  Once I got clear, I was motivated and instantly, I took action.  <br style=\"\">  \t<br style=\"\">  \t  The day that happened, I had my first $1,000 day.<br style=\"\">  \t<br style=\"\">  \t  I don&#039;t know what your specific needs are....<br style=\"\">  </p>  <ul style=\"\">  \t<li style=\"\">Do you need to increase traffic to your website?</li>  \t<li style=\"\">Do you need to create more and better products?</li>  \t<li style=\"\">Do you need to find more affiliates to promote your products?</li>  \t<li style=\"\">Do you need to finally get focused and make you money?</li>  \t<li style=\"\">Do you need more income to replace your job?</li>  \t<li style=\"\">Do you simply need a little vacation money for the family?</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t  If you are suffering from information overload, inaction, indecisiveness and are stuck, then this course is for you.<br style=\"\">  \t<br style=\"\">  \t  Introducing:<br style=\"\">  \t<br style=\"\">  \t  Get Clear.  Get Motivated.  Take Action.<br style=\"\">  \t<br style=\"\">  \t  We both know, your productivity is your number one asset as an entrepreneur! Nothing affects your success like your ability to apply clear and focused action to the things you do.<br style=\"\">  \t<br style=\"\">  \t  In the course, you&#039;ll learn how to deal with and eliminate information overload.  You&#039;ll learn that by getting clear, you will become instantly motivated, focused and will start taking dramatic action immediately.<br style=\"\">  \t<br style=\"\">  \t  Here&#039;s what you will learn:<br style=\"\">  </p>  <ul style=\"\">  \t<li style=\"\">You&#039;ll learn the #1 reason why entrepreneurs suffer from entrepreneurial A.D.D</li>  \t<li style=\"\">You discover the most dangerous categories of &quot;Wannapreneurs&quot; are.</li>  \t<li style=\"\">The 1 simple mindset shift that was a game changer.</li>  \t<li style=\"\">You&#039;ll learn the perfect &quot;antidote&quot; of information overload.</li>  \t<li style=\"\">How to trick yourself into taking action and never feel overwhelmed again.</li>  \t<li style=\"\">You&#039;ll learn what the worst thing you can do when it comes to learning.</li>  \t<li style=\"\">You get the complete cure to fix it all.</li>  \t<li style=\"\">You&#039;ll discover why 97% of entrepreneurs fail at this.  </li>  \t<li style=\"\">Why being productive and focused is not ________________.</li>  \t<li style=\"\">Get the truth about why we let resistance control our lives.</li>  \t<li style=\"\">Learn why ________ is actually action.</li>  \t<li style=\"\">Why you should sweat the small things...not kidding!</li>  \t<li style=\"\">How to make things happen NOW.</li>  \t<li style=\"\">Why this type of &quot;tasking&quot; will instantly work for you.</li>  \t<li style=\"\">Why multitasking is a complete fraud.</li>  \t<li style=\"\">You&#039;ll learn a simple instant system for eliminating all your distractions.</li>  \t<li style=\"\">The one FREE tool I use to keep me on task</li>  \t<li style=\"\">Combine ____________ and ______________ to double your productivity in 1 hour.</li>  \t<li style=\"\">Learn why adding this short review process will get you clear.</li>  \t<li style=\"\">Learn why 1 to 1 ____________will improve your productivity, but 1 to 2 ____________will thrust your business light years ahead of your competition.</li>  \t<li style=\"\">The secret to managing distraction forever.</li>  \t<li style=\"\">What not to do with email.</li>  \t<li style=\"\">How to laugh at long-term goals.</li>  \t<li style=\"\">The simple method for breaking down your goals </li>  \t<li style=\"\">How to get so focused, your work just flows to completion.</li>  \t<li style=\"\">The truth about speed and money and why they are connected.</li>  \t<li style=\"\">Why ___________ building will make you financially free.</li>  \t<li style=\"\">Discover the truth behind &quot;P.I.F&quot; and how it eliminates all the &quot;noise&quot; from everything around you.</li>  \t<li style=\"\">The 3 steps to success that get you clear, motivated to take action.</li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t  Putting this off can cost a lot…<br style=\"\">  \t<br style=\"\">  \t  There&#039;s nothing worse than doing the same thing everyday, yet expecting a different result.<br style=\"\">  \t<br style=\"\">  \t  Look, Get Clear. Get Motivated. Take Action is about make simple changes that result in long-term success.  <br style=\"\">  \t<br style=\"\">  \t  I know this system will work for you.  In fact, I guarantee it will.<br style=\"\">  \t<br style=\"\">  \t  Your No-Questions-Asked Promise!<br style=\"\">  \t<br style=\"\">  \t  I know you’ve seen “no questions asked” guarantees before. And maybe they didn’t ask questions, but they sure made you jump through a lot of hoops to get your money back.<br style=\"\">  \t<br style=\"\">  \t  Here’s the thing: If you’re not completely satisfied with this product for any reason, you’ll get your money back – guaranteed. No hassle, no hoops and no questions. Fair enough?<br style=\"\">  \t<br style=\"\">  \t  Take 30 days to test drive it!<br style=\"\">  \t<br style=\"\">  \t  Whatever it is that you need to take your business to the next level and see your online income take off, focus &amp; action will help you get there sooner!<br style=\"\">  \t<br style=\"\">  \t  There’s only one thing left for you to do: Click here to find out what 293 new entrepreneurs know about getting clear, getting motivated and taking action.  And remember, your satisfaction is guaranteed…<br style=\"\">  \t<br style=\"\">  \t  Getting more productive by using a reliable, repeatable and simple system can be the one thing that makes all the difference! <br style=\"\">  \t<br style=\"\">  \t  Register NOW!  </p>", 
    "end_date": null, 
    "title": "Personal Development: Destroy Overwhelm, Double Productivity", 
    "price": "25.00", 
    "instructors": "Mark  Sumpter", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327772_d219_5.jpg", 
    "course_url": "https://www.udemy.com/personal-development-get-clearmotivatedfocused-in-1-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T00:46:26Z"
}