{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong><strong></strong></p><p><strong></strong><strong></strong></p><p><strong></strong><strong>Planning Made Easy and Fun with Free Online Tools</strong></p><p>Do you love creating and managing products or do you dread it worse than going to the dentist?</p><p>There are so many great free tools online today that can help you succeed with any project and take the dread away.  In this course you will learn about 3 very popular tools and find out what each one does well.</p><p>Just because it’s free, doesn’t mean it will work for you.  I have chosen three great tools that get a lot done with just the free version so there is no need to pay for upgraded versions.  I will also help you to see which tool would work best for you based on your tastes and your style of working.</p><p><strong>Design your project so that you can take action and remain motivated.</strong></p><ul><li>Learn which tools have the bells and whistles you need to make project planning fun for you instead of something you dread.</li><li>Discover the power to progress tracking to keep you motivated and get your projects done fast. </li><li>Uncover ways to use color to organize your tasks and your progress on those tasks.</li></ul><p><strong>Enjoy the simplicity of these tools.</strong> </p><ul><li>Tools should never add to your feeling of overwhelm.  Each tool you use should make your life easier and help you get out of the planning stage and into action quickly.  I have chosen each of the tools reviewed in this course for their simplicity.  After watching the overview of each tool, you will be able to make an educated choice and then get up and running with the tool right away.</li></ul><p><strong>Course Structure</strong></p><ul><li>Each lecture has been designed to be short and sweet.  I want you to get the main point without a whole lot of rambling.  The point of this course is to get you off and running on your project.</li><li>The Introduction will set the stage for what to look for in a planning tool.</li><li>The 3 sections that follow will give you and overview and screen shots of each tools so that you can see it in action.</li><li>The Wrap Up includes a comparison chart so that you can quickly see the pro’s and con’s of each tool plus a video lecture that gives you recommendations on which tool is right for you.</li></ul><p><br><br></p><p><em><strong>YOU HAVE LIFETIME ACCESS TO THE COURSE MATERIAL &amp; LIFETIME UPDATES.</strong></em></p><p><em><strong>PLUS A FULL 30 DAY MONEY BACK GUARANTEE.</strong></em></p><p>If this course doesn’t meet your expectations, you can get your money back.  However, I know you will love the simplicity and common sense approach.  You can reach out to me anytime you have questions, want support or want to share your success.  I am just a quick message away.</p><p>Now is the right time to change the way you plan your projects!!!</p>Click the Take the Course button today and let’s get started.", 
    "end_date": null, 
    "title": "Planning Made Easy with Fun and Free Online Tools", 
    "price": 0, 
    "instructors": "Julie Ann Price", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693024_de15_2.jpg", 
    "course_url": "https://www.udemy.com/project-planning-made-easy-with-free-online-tools/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T14:18:19Z"
}