{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Do you love the idea of planning but when it gets right down to it, struggle with the tools and the strategy to make your plan work?</strong></p><p><em>Do you sit down with every intention to create a plan but then find a fog settles over your brain?  You stare at a blank page or screen and nothings comes to you?</em></p><p>In this course, you will go step by step through a very SIMPLE planning process and learn some inspirational tips to help clear away that brain fog.  Not only that, but you will learn secrets to creating plans that you will actually follow through on.</p><p><strong>Have you bought detailed beautiful planning books in the past only to leave most of the pages blank?  Do you get tired of carrying that heavy book around? </strong></p><p>Trello is available on the web and on your phone.  Wherever you are, you can always access your plan.  Get inspired on the bus? No problem, add your thoughts on the app on your phone right then and there.  No bulky extra book to carry around...or lose.</p><p><strong>Have you struggled to find either a paper or online planner that has worked for you in the past? Nothing seems to meet your specific needs.</strong></p><p>We will be using Trello as our planning tool and I will show you different ways to set up your planning system and how to use Trello to motivate you and keep you on track.  Trello is so flexible.  You can set things up one way, decide you don't like them and change or move things easily.  </p><p>When I created my planning board for this course, I started with one board, then created a second board and in the end wound up merging the best of both boards into a single board.  Now I have the perfect planning tool for me.<br></p><p>In Planning Camp you will learn how to customize and move things around so that they suit you.</p><p><strong>Are you tired of traditional goal setting?  Does the entire idea bore you to tears?</strong></p><p>In Planning Camp, I leave out the basics about goal setting.  You already know how to do that.  Instead you will learn different focusing techniques and use a little storytelling to create goals that are actually meaningful to you.</p><p>Even more importantly, you will learn a simple way to remember what your goals are.  Before using this system, I use to create fantastic goals and then completely forget about them hours later.  Now, my major goals are top of mind and are incorporated into my daily life.</p><p><strong>Like Color?</strong></p><p>If you are a visual person, you will love the fact that you can easily add photos to your plans, use colorful tags to organize your lists and even add inspiring backgrounds in Trello.  I love this aspect.  My planning boards always involve a lot of images and bright colors.</p><p><strong>Want quick results?</strong> </p><p>Trello is a very easy system to use.  I teach the entire course inside a Trello board so you get to see me using the features of the tool while you are learning. You will become familiar with Trello after watching just a few lectures.  </p><p><strong>If you've tried planning in the past only to forget about your plan a month later, you can rest assured that this won't happen after taking Planning Camp. </strong></p><p><strong></strong></p><p>Your plan won't be gathering dust in cyber space. You will be checking in with it regularly, adding to it and making it an inspirational part of your life.</p><p>You will find that this course and planning system will change everything for you. You will be having fun while you accomplish your great plans.  You can do this!! And have a blast while you are at it!</p><p><strong>Have you ever wanted to have a friend keep you accountable for a part of your plan?</strong></p><p>Trello allows you to share specific items on your board so that your friends can comment or help you stay motivated.</p><p><strong>Planning Camp with Trello will allow you to:</strong></p><ul><li>Create a flexible plan</li><li>Make your plan appealing with photos and color</li><li>Quickly modify your plan at any time and from anywhere</li><li>Find inspirational tricks to help you focus on your plan and check in with it regularly</li><li>Learn a different way to plan that is more about storytelling and less about goal setting</li><li>Share your plan with your friends and family</li></ul><p><br></p><p>If you are not completely satisfied with Planning Camp, you can return it in 30 days and get a full refund!  However, I am confident that you will learn a new way to plan and find success with Planning Camp.</p><p>Click the Take This Course button now and join me in planning your best year ever!</p>", 
    "end_date": null, 
    "title": "Planning Camp - Design A Custom Visual Planner with Trello", 
    "price": "20.00", 
    "instructors": "Julie Ann Price", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/713326_8cf3_5.jpg", 
    "course_url": "https://www.udemy.com/trello-level-3-planning-camp/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-02T15:03:33Z"
}