{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  <strong>Updates:</strong>  </p><ul>  \t<li><strong>Over 1538 students have enrolled in the last few weeks and have left only 5-Stars ecstatic reviews.</strong></li>  \t<li><strong>Last course update: Monday 25th of January 2016</strong></li>  </ul>      <p><strong>Discover How To Pack 8-Hours Worth of \"Work\" Into Just 3 Hours - Even When You're Currently Procrastinating, Constantly Interrupted and Feel Like You're Not Getting Anything Done… </strong><br></p><p>Have you found yourself eager to get going on projects, then fizzle out and abandon them long before you get to enjoy the results (and the income you'd gain if you could just finish them)?</p><p>Are you feeling stressed all the time because you have way too much to do (and you keep procrastinating and feeling even worse as the week goes on)?</p><p>Do you have trouble sorting out your To Do list into what’s important and what’s not, constantly missing the big picture and the path towards tangible accomplishments? Is this making you feel overwhelmed, always trying to do everything and then accomplish nothing?</p><p>In this letter, I’m going to reveal to you one of the best ways to step on the treacherous path of <strong>achieving more by working less</strong>.</p><p>But before I do that, let me introduce myself.</p><p>I'm Bogdan Vaida, a former stressed, full time busy person turned stress-free time management trainer.</p><p>Starting from university (though I had some symptoms before), I suffered from what I now call unbalanced Kime. (<strong>Kime</strong> is a Japanese word which in karate means focus). </p><p>I had trouble staying focused and keeping my projects on track. No matter what the projects were, I kept abandoning them. When I was little, I tried doing sports. I started tennis, judo, karate and basketball… everything .. for 2 weeks. After 2 weeks it was like I had an internal clock that told me STOP!, let it be.</p><p>Procrastination was my worst enemy .. I always procrastinated. I remember trying to go to the gym (motivated by my girlfriend to get rid of some nasty body fat). Success!! I was able to go for .. 1 month (basically I doubled my results)..</p><p>.. only to postpone it for the rest of the year</p><p>.. until my membership card finally expired.</p><p>I was never a patient person, whenever I started some new project I was very enthusiastic .. but somehow, once my enthusiasm went away .. so did my results.</p><p>After leaving college after a first college semester where, interestingly enough, I had aced all exams that I was really into but failed all the others (dem’ mathematics). I realised this had to change.</p><p>I started reading some time management books, applying some of the things I learned in my life..</p><p>Well .. it wasn’t that bad .. but I had to read a lot and very few techniques applied for my particular situation.</p><p>So .. read more I told myself.</p><p>I immersed myself into everything productivity related. I participated in forums, seminars and even took some coaching lessons.</p><p>Suddenly, my life was becoming enjoyable again. I entered another college (keeping my scholarship to my final year), took dancing classes, 2 jobs and I even had the luxury of free time.</p><p>After passing through hundreds of techniques, I realized what was working for me. I adapted the generic things I learned about on the internet and I personalized them into techniques that gave results.</p><p>Then I shared these with Dan, one of my friends waiting for his big heartfelt ;thank you’..</p><p>But no, the techniques didn’t work for him!</p><p>I’ve spent days trying to help him but what I shared with him was actually what was working for me.</p><p>And then I got it!</p><p>I needed to fine tune each technique for the specific person who was using it. There’s no one-size-fits-all solution!</p><p>So I took all that I learned and developed a system that was fine-tuning these somehow “generic” techniques to the specific person that’s using them, an expert matchmaking system.</p><p>.. 10 years later:</p><p>I offer busy people the opportunity to find free time and to create a balance between their personal and professional life. I do this by teaching productivity principles and techniques specific to their personality using experiential methods.</p><p>I am the founder of the most prominent time management resource in Eastern Europe and author of The Ultimate Time Management Guide For Workaholics.</p><p>For the last 8 years I’ve been traveling around the world holding trainings where I’ve created environments for people to learn through doing. I’ve held trainings in Slovenia, Slovakia, Bulgaria, Romania and a few other Eastern European countries and my online courses have over 7000 happy students.</p><p>During all these years I came to identify 4 productivity bottlenecks that prevent people from developing focused productivity and achieving their goals. I noticed that once people can put their finger on the issue, the solution comes naturally to them and they keep applying it until the bottleneck disappears.</p><p>Let me prove my point here.</p><p>When you have trouble staying focused and keeping your projects on track,</p><p>And when procrastination is your worst enemy and your internal alarm clock buzzes 5 minutes before the deadline..</p><p>You suffer from unbalanced Kime. (<strong>Kime</strong> is a Japanese word which in karate means focus). </p><p>We usually have some techniques to help alleviate the problem. One of the most successful ones is having a 25-minute interval of focused, productive work, followed by a 5 minute break. This starts the process of educating your brain to accept a specific interval of time as *work* time.</p><p>But there’s almost always a larger issue behind your <strong>unbalanced Kime</strong> and <em>if you’re not going to correct it, it will get from worse to worst.</em></p><p>You need to solve this before your whole life goes out of balance. I know so many people that had <strong>unbalanced Kime</strong> and in my early days as a trainer I must confess, I had quite a bit of trouble helping them. I spent days and nights to try and figure out a solution. And found it I did!</p><p>Next comes <strong>The Zen Curse</strong>.</p><p><strong>The Zen Curse </strong>is exactly that. A curse that prevents you from reaching your zen state.</p><p>You crave patience and having time to sit and breathe but somehow things happen and you never find time for it. You are anxious and in a hurry and life tries to overthrow your plans and send you in disarray. Unexpected situations appear and it’s so hard to slow down and take a breath ..</p><p>Being in a hurry all of the time is one of the worst conditions us as humans find ourselves in. It impacts both our bodies and our minds. Stress is evil! And learning how to be patient and get rid of all the “bad” feelings that come from the inevitability of fate is hard .. dem’ hard.</p><p>When you look at that empty calendar you’re not actually looking at free time. In fact, you are looking at occupied time that you have yet to identify. An empty calendar is actually a full day.</p><p><strong>The Zen Curse </strong>is a state most of us go through from time to time.</p><p>And we usually have some techniques to help <strong>mitigate</strong> the problem. One of the most common ones is <strong>meditation</strong>. And you may think meditation, pfah!, tried it and it doesn’t work for me. I tried it too, <strong>for 3 years</strong>, before I got the specific meditation type that I could work with. The trick was to start so easy that my brain wouldn’t be able to find an excuse to stop it. I tried it for 5 minutes a day. 5 minutes, anybody can do that! And now I’m doing it for half an hour, daily!</p><p>But <strong>meditation</strong> only mitigates your problem and you need to fight the issue behind the issue, so to speak.</p><p>Then comes <strong>The Habit Cracker</strong>. This is the state where you strive to develop long lasting habits but things happen, disruptions appear and you forfeit those habits. Maybe you don’t even remember when you abandoned them.</p><p>Some habits.. you stick with .. for some time, then you skip those one or two days at the gym, then, a week .. and one year later, you find that gym membership card discarded in that dark corner of our closet.</p><p>Being unable to stick to your habits may even give you the feeling that you shouldn’t even start them. And so the days go by and you forfeit the chance for exercising, meditating or working on your project.</p><p>An effective technique to mitigate <strong>The Habit Cracker</strong> is <strong>habit linking</strong>. That is creating a habit that follows an already established habit. For example, if you want to drink a glass of water each morning, take your toothbrush and put it in a water glass, instead of its usual place. Each morning, you’ll see the water glass when you take your toothbrush and you’ll know what to do.</p><p>This technique alleviates your situation but it hardly fixes it. Developing long lasting habits takes more time to do .. but it’s achievable. One of the 2 techniques is mentioned later in the letter.</p><p>And the last productivity bottleneck is <strong>Funambulism</strong>. </p><p>Funam..’what? <strong>Funambulism</strong>, also known as tightrope walking.</p><p>You go through your life stepping on a tightrope and if you take a step a bit to the left, there go your professional achievements .. you take a step to the right .. your spouse starts the family melodrama.</p><p>It is the situation where you strive for work / life balance but the rope is thin and your comfort lacking. Where you find that life doesn’t let you prioritise, where situations pop up and disrupt you. Where you don’t know what will happen next.</p><p>But enough information. How can we fix these 4 bottlenecks?</p><p>4 years ago, I launched a series of online lessons that helps busy busy people de-stress by taking control over their life using techniques specific to their personality. It is the the fastest growing online course in time management, currently taught to over 1538 students over six continents.</p><p>This is not a traditional training. I will not be showing you techniques that I got off the internet, which might prove to be useful or not.</p><p>From the very first day, you’ll discover new methods and modern techniques, such as “<strong>The Pyramid Technique</strong>” (which will clarify the road you want to walk on and what you want to do with your future) and “<strong>Constructive Postponement</strong>” (a less known technique with will “swap” the stress in your mind with a state of creativity and productivity).</p><p>Introducing the online course The Secrets of Time: </p><p><strong>I. The beginner’s guide</strong></p><p>They say you know a book is good after you’ve read its first page. I’ve applied this same mentality for this course.</p><p>- In “The beginner’s guide” you discover some <strong>quick tricks</strong> that have immediate results. The entire concept of the course and how it can offer you tangible results <strong>from the very beginning</strong> will be explained to you.</p><p>- <strong>Together, we will find out</strong> what your main issues are and you will make the first steps to get rid of them</p><p>- In this module, you’ll have <strong>the first complete system to help you</strong> <strong>organize yourself on a daily basis</strong> and I will show you, in practice, how easy it is to use from the very beginning.</p><p>- You’ll also find out what my <strong>mentality</strong> was when I decided to lose 24 pounds, to broaden my circle of friends and how I got to teaching others to win their war on time.</p><p><strong>II. The mentality of a winner</strong></p><p>Did you know that only one hour of your day is truly productive? Find out which one in the second module, also called “The mentality of a winner”. It’s called as such because, in this module, you will acquire the mentality of an entrepreneur (which prevents the continuous postponement of tasks through a counterintuitive technique).</p><p>- In this module I will tell you <strong>what mentality successful people have when they make their first step, so that you never get stuck in any way.</strong></p><p>- Together, we will find out what your main issues are and what first steps to make to get rid them.</p><p>- You will also find out <strong>how to transform “wasted time” into “saved time”</strong> (this technique alone gave me the time I needed to study over 300 materials, time I never thought I had!)</p><p>- I will also tell you about <strong>my secret habit</strong>, which bothers many people, but <strong>helps me make the right choices and keep stress away</strong>!</p><p><strong>III. Instant self-motivation!</strong></p><p>Do you have motivation but don’t have results? This module is strictly on this topic! We won’t give up until we succeed, right?</p><p>- In this module you’ll find out what are <strong>the 2 factors that keep you from making that first step and how you can get rid of them</strong> in order to get started.</p><p>- I will also reveal  <strong>3 practical techniques to reduce the impact of the dependencies that consume your time</strong></p><p>- I will also offer you another <strong>complete time management system</strong>, which helped me throughout the years (and I will also show you a <strong>demo video</strong>). I’ve constantly improved this system and<strong> used it to work on 9 projects at the same time</strong> and I’m sure you can also adapt it to your needs.</p><p>- Finally, I’ll show you <strong>a self-motivation technique</strong> which, if properly used, <strong>can rid you once and for all of procrastinating unpleasant tasks.</strong></p><p><strong>IV. Fight against procrastination</strong></p><p>Why do you keep abandoning projects?</p><p>Have you ever asked yourself that? Did you find out why? I guess not. <br>\nIn 2009 I was asked this question for the very first time and I did not know how to answer it. I was a trainer, not a psychologist. <br>\nBut I promised to come up with an answer. I read intensely, I spoke with psychotherapists and contacted international trainers who were specialized in behavioral changes. In the end, I found the answer and I can’t wait to reveal it to you. It’s a very small change that will instantly make you go “AHA!”. Then you’ll ask yourself (as I did back then) why you haven’t thought about it until now!</p><p>- When you get here you’ll discover how much you can achieve if you <strong>rephrase your tasks</strong></p><p>- You always hear: “focus on results”, but now you’ll become the person who achieves those results!</p><p>- Find out what the main reasons why we’re stressed are and <strong>what techniques you can apply to get rid of each type of stress</strong></p><p>- Do you have a tendency to procrastinate on certain tasks? Find out how to immediately identify them and finish them on the same day!</p><p>- Identify the tasks that <strong>must be postponed</strong> so that you can focus on your goals</p><p>- By the end, you’ll understand <strong>an advanced technique to keep up with your tasks when you have a lot on your hands</strong> (and still some more coming your way).</p><p><strong>V. How to focus on your priorities regardless of interruptions</strong></p><p>You have the mentality and the motivation and you don’t back away from anything. You’ve already had your first results and, from now on, I’ll make sure those results take you towards your chosen goal.<br>\n<strong>Do you like to be a winner, but you always seem to come in second?</strong></p><p>Not after this training!</p><p><em>Fight against laziness and apathy, double your productivity, get over the obstacles in your way and aim for success!!!</em></p><p>- In this module you’ll <strong>discover and stick with the techniques that truly suit you.</strong></p><p>- Together, we will find out what your main issues are and what first steps to make to get rid of them</p><p>- <strong>I’ve had a cook</strong>, someone to clean around the house and an assistant ever since I got first job. Hiring these people <strong>is cheaper than you think</strong> and, in this module, I’ll prove it to you!</p><p>- Are you working late? Do you mix your personal and professional tasks? After this module you’ll manage <strong>to keep a balance between your personal and professional lives!</strong></p><p>- Have you ever made choices that you later regretted? Have you ever chosen money over your family or perhaps family over money even though, when you made the choice, everything seemed clear? <strong>Find out how to avoid the trap of the big decisions in your life!</strong></p><p><strong>VI. Vision – plan your objectives so that you can easily fulfill them</strong></p><p>This is one of the <strong>most important</strong> modules that you need.</p><p>- In this module we’ll focus on <strong>how to visualize your own future</strong> and <strong>how you can make it come true</strong>. I focused a lot on this aspect of my life, I’ve learnt from people who started from 0 and were successful and now you’ll also be able  to aim high and get there!</p><p>- This module is not a motivational one; <strong>you’ll actually uncover  how to get to the top of the pyramid, how to make your dreams come true</strong> and how to steer through life’s turbulent waves</p><p>- Here you will discover  <strong>the international technique</strong> with the help of which <strong>successful</strong> and very busy people from around the world organize their lives. Find out how stars such as <strong>Oprah Winfrey, Will Smith and Tom Cruise</strong> save time and how you can apply their experience to your life.</p><p>Calin Iepure, entrepreneur and consultant in business strategy, moderator of Business Days and facilitator for the Bootcamp University was very enthusiastic after he went through the course:</p><p>\"<em>Hello! I’m Calin Iepure. I met Bogdan Vaida some 4 years ago during the weekly meetings of Timisoara Toastmasters. Since then I was introduced to his educational programs and I’ve seen how they make our life, my life and yours and the life of those who participate in them, a lot better. With their help I managed to better organize my time and become more productive. If you, right now, are interested in personal development, want to increase your productivity and motivation, I strongly recommend Bogdan’s online courses.</em>\"</p><p>Mihnea Popescu, manager at Atos International knows me personally from one of the live trainings this course is based on.</p><p><em>\"Hello, my name is Mihnea Popescu and I live in Timisoara, where I had the opportunity to meet Bogdan Vaida. I also participated in some of his courses. I am very glad that I did. At the beginning I was a bit skeptical about the perspectives he presented, because I was used to a completely different lifestyle. I was determined to believe in him blindly at the start and to continue to do so if I had results. In doing so, I applied his advice and techniques and I realized I had incredible results. I asked myself “what’s happening?” I continued to listen to him and apply what he said, even though I sometimes disagreed and thought it wasn’t suited for me. Gradually, I started to understand that there were certain perspectives that I would never have thought about. Participating in his courses helped me a great deal. I recommend them to you and in the end you’ll see how happy you are you’ve been part of them.”</em></p><p>This is a course that pays for itself because what you learn here will give you more time and time can be transformed into money; imagine spending your time working hard but not effectively while you could win back time by discovering effective productivity principles from this product</p><p>This course has been taken by people from multiple parts of life from busy CEOs that continuously missed family dinners to Andreea, a single mom who tried to balance day to day priorities between her child and her job to get 2 hours of sleep per night.<br></p><p>I <strong>guarantee results from the very first day</strong></p><p>.. due to a special bonus called <strong>The Beginner's Guide</strong>. In it, I've amassed the most practical and intuitive techniques, voted by the participants of the course. They are easy to apply and <strong>provide you with </strong>the<strong> free time </strong>you need to continue with the rest of the course.</p><p>But we won't stop there. After the first week, you'll learn the <strong>counterintuitive technique </strong>of <strong>Continuous Postponement </strong>(told you it sounded counterintuitive) which frees your calendar, allowing you to destress and finally return to feeling like a human being (remember your childhood years when you had plenty of the special commodity called time?).</p><p>Only the first material of the guide (and the course has 28 such materials) will be enough to change your view of time so that you can focus on the rest of the content in peace.</p><p>Apart from these bonuses, there’s something else I want to offer you: <strong>interactivity and materials tailored after your needs</strong>.<br></p><p>Seeing the answers to my surveys, I learned that my students need to communicate with their trainer. Therefore, in this course I have taken interactivity to a completely different level!</p><p>Apart from communicating privately and answering all of your questions, I have built this course so that I can provide new materials based on the needs of my students. In other words, apart from what I promised to offer in the course, I will add materials based on your questions!</p><p>It takes 10 minutes to watch a video and your full day to (unconsciously) apply what you've learned. 10 minutes a day, a lifetime feeling its effects!</p><p>Now, what is it going to cost to not own this? You've heard my offer... I have expressed the value to you. I hope you feel like you can trust me. I've shown you exactly what's going to happen when you decide to give it a chance today. Remember that you have your 30-day guarantee. You're fully protected. All the risk is on me. If you're still wondering about this, let's just consider that right now you're standing at a crossroads and there are two paths. One of the paths takes you down the road I've just laid out for you where all these great things happen. Thirty days from now you'll feel like a different person, a stress free person with time to do anything you want or you can just stay on the road you're on right now and continue to experience the same frustration of not having enough time to do anything!<br></p><p>Get inside, double your productivity, live a stress free life and always have time to accomplish your dreams.</p>", 
    "end_date": null, 
    "title": "Practical time management for busy people", 
    "price": "30.00", 
    "instructors": "Bogdan Vaida", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124994_9ecc_7.jpg", 
    "course_url": "https://www.udemy.com/the-secrets-of-time/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-25T09:39:16Z"
}