{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Over 2000 students in nearly 100 countries have already changed their lives with this course.  Start today!  </em></strong></p><p><strong><em>See how easily you can take back control</em> of your schedule to get massively more done in less time, and without stress, like A+ players do. </strong>(Don't know what an A+ player is? Video 1 explains.)</p><p>This is not your typical 'top tips' hodgepodge, and not a “watch and learn\" course. <strong>These are the </strong><strong>exact strategies</strong><strong> I've learned from leading experts, and that I've used to become a highly successful physician, international speaker, author, entrepreneur, mother, and wife.</strong> All while keeping my own hobbies, being truly present for what matters most, and without burnout. </p><p>If you're <strong>frenetically busy but still drowning in your to-do list, you're not alone.</strong> These days, nearly everyone feels this way. Your calendar is filled with other people's priorities, and your well-planned days are derailed by unexpected emergencies. </p><p><strong>Your life has been totally hijacked</strong>, and you want it back!</p><p><span></span>The curriculum is<strong> immediately actionable</strong>, and intended for people serious about their success and happiness. <em>From the very first module,</em> you'll implement real changes, and in a few short weeks, you'll be <strong>totally transformed</strong>. </p><p><span></span>It's a comprehensive approach to <strong>quickly, easily, and radically</strong> increase your productivity and free time.</p><p>This course is for you if you want to:</p><ul><li><strong>Improve</strong> your career, business, family, or personal life</li><li>Stress less but <strong>achiev</strong>e more</li><li>Make your inbox and devices <strong>work for you</strong>, instead of the other way around</li><li>Find <strong>time</strong> to focus on YOU for a change</li><li><strong>Reclaim</strong> your calendar and your life</li><li>Be one of the people who <strong>“have it all\" and can “do it all\"</strong> - without breaking a sweat.</li></ul><p>If you wake up stressed, spend the day stressed, and go to bed stressed –exhausted, but your mind still racing about what you didn't accomplish...</p><p><strong>You have nothing to lose, and your entire life to gain. Enroll now.</strong></p><p>Skeptical? You have my 30 day <strong>money back guarantee</strong>, no questions asked. Plus, updates and bonuses are free, forever.  See you in class! </p>", 
    "end_date": null, 
    "title": "Productivity Secrets to Redesign Your Life in 30 Days ", 
    "price": "45.00", 
    "instructors": "Marjorie Stiegler, M.D.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/483664_5f7d_5.jpg", 
    "course_url": "https://www.udemy.com/massive-productivity-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T20:25:23Z"
}