{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Lets be honest here. You aren't looking into this course because you believe that you can't accomplish your work. You know you can. </p><p><strong><em>You are reading this course summary because you find yourself being lazy quite often and it is honestly getting in the way of your work resulting in a lack of accomplished tasks AND a large decline in your productivity.</em></strong></p><p>And here is the truth: <strong>THAT IS OKAY!!! :)</strong> That is because you are human! We all need a little push sometimes. <em>More often than not, that push needs to be you gaining a few tools and skills which allow you to still indulge in a small amount of laziness while at the same time accomplishing the work which you have set out to do. :)</em></p><p><strong>I CREATED THIS COURSE BECAUSE:</strong></p><ul><li><em>I have been there. I know exactly what it is like to be unproductive and not meeting the standards that you have been held up to.</em></li><li><em>I know that I am a human being. This means that I am not perfect and can't always be on top of my game 24/7.</em></li><li><em>I conquered this obstacle in my life! Sure, I often find myself battling against it, but I have the tools that I need to successfully over come those obstacles and be exceptionally productive in my work. </em></li><li><em>I WANT YOU TO HAVE THOSE TOOLS TOO!!! :)</em></li></ul><p><strong>YOU SHOULD TAKE THIS COURSE IF: </strong></p><ul><li><em>You have ever struggled with any of the things that I talked about in the opening paragraph. </em></li><li><em>You have ever said to yourself, \"How will I ever get all of this done?\"</em></li><li><em>You need/want to become more productive in the work that you have set out to accomplish.</em></li><li><em>You have a name, two eyes, and a nose. </em></li></ul><p>(Okay, I just threw that last there haha...but you get the point)</p><p><em><strong>I can't stress how important this course is for you and me to become the task accomplishing, goal smashing, productive worker/thinker that we have always dreamed of being! </strong></em></p><p>Take this course and I guarantee your life will be better when you finish. </p><p>I  <strong><em>G-U-A-R-A-N-T-E-E</em></strong> It</p><p><strong>ENROLL TODAY AND LETS GET STARTED!!!</strong></p><p>Kendall Knight</p><p>Your Udemy Instructor</p>", 
    "end_date": null, 
    "title": "Productivity Masterclass: You Can Be Twice As Good! FOR FREE", 
    "price": 0, 
    "instructors": "Kendall Knight", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/791508_c4fd_4.jpg", 
    "course_url": "https://www.udemy.com/productivity-masterclass-you-can-be-twice-as-good-for-free/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T16:35:48Z"
}