{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>\"Monday morning... waking up... </em><em>checking e-mails, facebook, news, back to facebook again... uff I have to do some work... checking what work needs to be done... ah a cat video lets click on it...\"</em><br></p>\n\n<p>That was exactly my case when I started my journey to become an \"entrepreneur\". Working at home can be hard. There are so many distraction around that just forces you into surrender, into re-action mode.</p>\n\n<p>So in this course I wanna share with you, the foundation of focus, how to develop it, why we lost it, how to get out of the \"I just dont feel like it mood\" and giving you a big variety of options to skyrocket your lifestyle, so you finally get your work done and can start achieving your dreamlifestyle.</p>\n\n<p><em>Fellow Procrastinator</em></p>\n\n<p><em>Benjamin </em><br></p><p>**** Beware This Course May Contain Innappropriate Language*****</p>\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p><strong>About This Course:</strong></p>\n\n<ul><li><em>Dense and Value packed content</em></li><li><em>The lections can be quiet intense and that is intended, so you can start training your focus right with the first video (if you have problems watching, this basically means you the sole act of watching can improve your focus)</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my \"giant balls promise\" to you. You either love it or get your money back.</em></li></ul>\n\n<p><em></em></p>\n\n<p><strong>Who Is This Course For?</strong><br></p>\n\n<p>Ladies and Gentlemans, this is course is right for you, when you are always <strong>struggling to get things done</strong>, who is overwhelmed with the amount of information out there and you spend your time rather on facebook and youtube then pursuing their dreams...</p>\n\n<p>And finally its for you, if you have bought a lot of courses and never started any project, because you got somewhere on the way and forgot to <strong>focus on </strong><strong>what is truly important for you.</strong></p>\n\n<p>You'll get the most out of this if you are one of the following:</p>\n\n<ol><li>Bootstrapping internet entrepreneur</li><li>Work from home business owner</li><li>Freelancer or Selfemployed</li><li>Or any other person who is struggling with their checklist...</li></ol>\n\n<p><br><strong>Who Is This Course Not For?</strong></p>\n\n<p>This Course is not for people who...</p>\n\n<ol><li>Who think that they have it all</li><li>Just wanna have another course that feels the dust of \"never touched\"</li><li>Are enlightened</li></ol>\n\n<p>You don't need any prior knowledge to get started, no software, no additional materials. Relax and come in... to a new world, full of possibilities that open up when you start learning to stay focused on your path.</p>\n\n<p>So the only requirements for this course are then: Bringing your childlike curiosity and the willingness for staying open-minded throughout the lections.</p>\n\n<p>Lectured by Marketing Consultant/Coach/Freelancer</p>\n\n<p>Captain Ben</p>", 
    "end_date": null, 
    "title": "Productivity Secrets - The Focus Mastery Class", 
    "price": 0, 
    "instructors": "Benjamin Hanna", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/719156_e444_2.jpg", 
    "course_url": "https://www.udemy.com/focusmastery/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-07T04:11:45Z"
}