{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Improve your productivity at work is an approach to performance at work by targeting <strong>4 major areas that bosses describe as the biggest problem issues facing their businesses today</strong>. The material highlights the FREW Model (Focus, Resilience, Engagement, Wellbeing). Students should take this course to develop themselves in these 4 areas to impress not only at work but in their lives generally.</p><p>There are videos, audios, narratives, introductions and 10 strategies in each area that have been simplified for students but are scientifically underpinned from the research and data and are proven to work. They are <strong>simple to implement</strong> and none of them cost any money at all, just a little effort and determination.</p><p><strong>It is suitable for anyone</strong> who is easily distracted from their goals; those who cannot bounce back from failure and adversity; individuals who cannot motivate themselves to become engaged in their work and anybody experiencing poor mental or physical wellbeing. In fact anyone who wishes to improve their productivity while at work.</p><p>The terminology and explanations are simplified to match relevancy of all students and can be applied in any field, job, sport or activity. </p><p>The course can be started at the beginning and work through Focus, Resilience, Engagement and Wellbeing or students can dip into one of the 4 areas in their own fashion. <strong>The strategies can be applied from the first moment</strong> and change can be noticed very rapidly. As an extra we have included material in a general section and a specific section that support the material in the 4 areas. </p><p>Take this course and you will not only become a champion in the workplace but will <strong>save yourself thousands of £'s</strong> in practitioner fees and <strong>months of consultations</strong>.</p><ul><li>Pinpoint Focus</li><li>Resilience, Hardiness &amp; Mental Toughness</li><li>Total Engagement &amp; Motivation</li><li>Psychological &amp; Physical Health &amp; Wellbeing</li><li>Mindfulness &amp; Awareness</li><li>Goal Setting Achievement</li><li>Imagery &amp; Visualisation</li><li>Self Talk &amp; Positive Thought Control</li><li> Performance Routines</li><li>Relaxation of Mind &amp; Body</li></ul>", 
    "end_date": null, 
    "title": "Productivity: Be A Champion At Work in 4 Easy Steps", 
    "price": "20.00", 
    "instructors": "Geoff and Elizabeth Greenwood FCCA MBA MSc", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633398_6f40_2.jpg", 
    "course_url": "https://www.udemy.com/improve-your-productivity-at-work-in-4-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T10:35:47Z"
}