{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>In this course you will learn how to drastically increase your productivity and get way more done in a day’s work while improving the return and the profitability of your efforts and projects. </strong></p><p>My name is Adi and I will be showing you the key tools and applications that will skyrocket your productivity.</p><p>15 years ago I started my career as a business lawyer working with entrepreneurs and CEOs on setting up, developing and expanding their corporations. Soon afterward I founded a global business consulting firm specializing in business optimization processes working thousands of businesses. </p><p>The tools i am going to show you in this course are the tools to increase productivity that made me a top consultant for global business, a successful serial entrepreneur and investor managing multi million dollars in assets, real estate owner and investor, a husband and a father with lots of free time.</p><p><strong>This course is designed to address and handle several common productivity killers that have been found to stall, slow or downright kill business initiative, productivity and consequently mess up projects, stop growth and completely mess up bottom line profitability.</strong> </p><p>By the end of the course you will be able to increase your productivity, get much more done for much less. you will be armed with smart strategies to get things done and use time resources at their fullest. This is going to be as hands on as possible, providing actual case studies showing you exactly not only what was done, but also how.</p><p><strong>Enroll Now to increase your productivity and free up your time.</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Productivity Formula Revealed", 
    "price": "20.00", 
    "instructors": "Adi Soglowek", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667662_5947.jpg", 
    "course_url": "https://www.udemy.com/productivity-formula-revealed/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T09:05:17Z"
}