{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Exhausted? Struggling to complete your to do list? Stressed? Unable to finish your work on time? A slave to a list of tasks that grows faster than your ability to complete it? </p><p>Don&#039;t let time be your master - learn how to master time!</p><p>This five-star rated course takes a three-hour live masterclass by world-renowned productivity trainer Diana Jervis Read, and reduces it down to a single hour packed with essential time management techniques.</p><p>When you take this course you will learn:</p> <ul style=\"\"><li>How to create a powerful person vision and purpose.</li><li>How to take control of your diary and calendar. </li><li>How to end unwanted email interruption forever.</li><li>How to develop a workable work life balance. </li><li>How to stop living your life to other people&#039;s agendas.</li></ul><p> If you put into action the time management techniques taught in this course:</p> <ul style=\"\"><li>You will gain an extra hour of time - each and every day.</li><li>You can look forward to more time with your family.</li><li>You will gain the prioritisation skills employers crave.</li><li>You can finally achieve the work life balance you seek.</li><li>You will learn how to do more work in less time.</li></ul><p>Once completed, you will benefit from increased performance, more free time, and a real sense of achievement at the end of each day.</p><p>You will learn how to use DISC psychometric profiling to understand your inner strengths and weaknesses and how your personality affects your relationship with time. </p><p>Together, the four sections of this course take you through the key time management skills you will need to prioritise even unforeseeable workloads, minimise stress, defeat procrastination, master delegation - and increase control, concentration and motivation.</p><p>Here are just some of the positive comments from students who have already benefited from this course:</p> <ul style=\"\"><li>&quot;As the Director of the National Security Institute (NSI) in Abu Dhabi, United Arab Emirates, we are currently undergoing a review of our policies and procedures. I have found the information on this course invaluable at the personal, professional and organizational levels. It is influencing the changes currently under review at the NSI. I highly recommend it both for individuals and organizations.&quot; - Professor Peter D&#039;Arcy, Director NSI</li></ul> <ul style=\"\"><li>&quot;Amazing return on investment! Just one hour watching this course has taught me enough to find an extra five hours a week!&quot; - Thomas Quinton</li></ul> <ul style=\"\"><li>&quot;This brilliant hour is an absolute must for anyone self employed. Thanks Diana.&quot; - Steve McDowell</li></ul> <ul style=\"\"><li>&quot;They should teach this at school! A ridiculously small price to pay for giving me back control over my day. In using these system, nothing gets overlooked. Just brilliant!&quot; - Lorna Morgan</li></ul><p>Need more convincing? It&#039;s worth remembering that this course is backed by Udemy&#039;s 30-day money back guarantee - so there is no risk in trying it.</p><p>By using the time management techniques in this course you WILL be able save an hour of time a day.</p><p>Transform your relationship with time and take control of your life in just one hour. </p>", 
    "end_date": null, 
    "title": "Productivity and Time Management Techniques & Hacks", 
    "price": "45.00", 
    "instructors": "Diana  Jervis Read", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/163706_880e_6.jpg", 
    "course_url": "https://www.udemy.com/productivity-time-management-techniques-tips-skills-strategies-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-13T17:28:44Z"
}