{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Do you ever feel like there aren’t enough hours in the day?</em>  </p>  <p style=\"\">  \t<em style=\"\">  Do you have graveyards full of dead goals that you’ve given up on?</em>  </p>  <p style=\"\">  \t<em style=\"\">  Do you want to make sure that next year is more productive than last year?</em>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">You’re in the right place.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t                       For a long time, I tried to improve myself in the same way you’d improve a robot. Set goals, make schedules, execute, and results should naturally flow, right? Unfortunately not. That isn’t how humans work. Our biggest barriers come from our own psychology.  </p>  <p style=\"\">  \t                       If I wanted to accomplish more, I’d need to learn to understand how my mind works.  </p>  <p style=\"\">  \t                       This course is the result of my journey. By diving deep into the research on psychology and neuroscience and directly applying the findings to my life, I completely transformed myself from slacker to superhero. I found myself taking on extra projects and still having heaps of spare time. I was amazed by how easy it all was once I understood the machinery.  </p>  <p style=\"\">  \t                       I’ve distilled my findings into six key lessons. There will be lots of insights into psychology, motivation and human behavior, but the heavy focus is going to be on action. Results come from doing, not from watching videos. <strong style=\"\">If you’re here to fill your brain with knowledge without applying it, this isn’t the course for you.</strong>  </p>  <p style=\"\">  \t                       What you can expect, however, are step-by-step, actionable guidelines to transform your life by completely changing the way you see the path to achievement.  </p>  <p style=\"\">  \t             I’ll see you on the other side.  </p>", 
    "end_date": null, 
    "title": "Productivity Strategies to Destroy Your Inner Procrastinator", 
    "price": "20.00", 
    "instructors": "Zach Obront", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107556_8745_5.jpg", 
    "course_url": "https://www.udemy.com/killingbob/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-18T14:11:40Z"
}