{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is designed to give you practical advice and tools to take control of what is most important to you and live a life that brings you joy and hope because you are focused on your most important priorities and actually getting (the right) things done. The Rapid Workflow series focuses on covering the details quickly to get you up and running in as little time as possible.</p><p><strong style=\"\">Start Making Your Time Work For You - Not The Other Way Around!</strong></p><ul style=\"\"><li>Learn Tips For Setting Up A Planner System</li><li>Create Organization Strategies To Help Reduce Wasted Time</li><li>Better Understand Why Rest And Health Play A Vital Role In Your Overall Productivity</li><li>Learn How To &quot;Bookend Your Days&quot;</li><li>Set Goals And Achievement Milestones</li></ul><p><strong style=\"\">Get The Right Things Done And Stop Wasting Valuable Time And Resources!</strong></p><p>Productivity is - to many - a mythical unicorn that is both elusive and difficult to keep once captured. As this course will show you, though, it doesn&#039;t have to be this way. Finding ways to make the most out of your days can be as easy as creating habits that set you up for long-term success. Planning. Saying No. Working Where You Are Inspired. These are just a few of the ways you can dramatically alter your workflow and reclaim minutes or even hours for each day.</p><p>I created this course for people that are new to re-framing their days for increased productivity. While anyone can benefit from these lectures, those just starting their search for a better workflow will be most impacted.</p><p>With real-world examples of how I have built a successful business using these productivity principles, you will walk away from this course with easy-to-implement nuggets of wisdom that can instantly transform the way you work and live.</p>", 
    "end_date": null, 
    "title": "Productivity Tips to Get More Done Quickly", 
    "price": 0, 
    "instructors": "Derrick Mitchell", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436870_b4fc_10.jpg", 
    "course_url": "https://www.udemy.com/rapid-workflow-productivity-series/", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T20:07:24Z"
}