{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>5-26-16 NEW LECTURE, learn how to use the 4 D's to manage your to-do-list. </strong><br></p>\n\n<p>My third course in a series, learn how to Increase your productivity and achieve your goals by understanding the psychology that drives success. This course is designed as a resource that provides research backed techniques and strategies that you can use to help boost your productivity.</p>\n\n\n\n<p>When you enroll, you gain access to a number of lectures that will teach you how to maximize your time, set goals and avoid several psychological biases that impact productivity. From learning how to shift from long term vision to short term action, to understanding the impacts of sleep on productivity, the course offers a range of interesting and valuable concepts that can be applied in the real world to help achieve more success. </p>\n\n\n\n<p>This course focuses on both common and lesser known techniques including, but not limited to;</p>\n\n\n\n<ul><li>SMART Goals</li><li>The Zeigarnik Effect</li><li>Impacts of Multitasking</li><li>Using the Eisenhower Matrix, and</li><li>The Planning Fallacy</li></ul>\n\n\n\n<p>The target audience for this course are entrepreneurs, leaders, managers, students or anyone interested in learning how to maximize their time. Regardless if you have never previously taken a productivity course or if you are already highly productive, I guarantee this course has at least one concept you can use to help achieve your goals in less time. </p>\n\n\n\n<p>The structure of the course intentionally limits each lecture to a single concept that is independently supported, allowing you the flexibility to either go straight through the course from start to finish or to pick and choose only those lectures and concepts with which you are unfamiliar without having to worry about losing understanding.</p>\n\n\n\n<p>\"<strong>Achieve Your Goals: The Psychology of Productivity</strong>\", is my latest course to supplement two other courses that I teach, \"<strong>Become a Creative Genius: Keys to Successful Innovation</strong>\", and \"<strong>Simplify Your Problems: The Psychology of Choice</strong>\". When you enroll in one of my courses, you are joining thousands of students that have benefited from the series. </p>", 
    "end_date": null, 
    "title": "Productivity: Applying Psychology to Achieve Your Goals", 
    "price": "20.00", 
    "instructors": "Dr. Richard Feenstra", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466772_d387_2.jpg", 
    "course_url": "https://www.udemy.com/productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T17:07:42Z"
}