{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you have more things to do than you have time and frequently get overwhelmed with all your priorities and tasks, you are in the right place! I designed this course to help people from all walks of life that struggle with trying to get it all done.</p><strong></strong><p><strong>    </strong></p><p>At the same time I have done my best to design this course as efficiently as possible since time is our most precious resource. </p><p>This course is going to be focused into three areas or sections. Each is designed to build on the other, but each lecture is labeled by concept clearly, so you will also be able to come back and hit specific topics that are most helpful for you.<br></p><p>In our first section we are going to focus on what is causing our overwhelm and what leads us to procrastination. <br></p><p>In our second section, we build the foundation for a new level of productivity and cover the fundamentals and key concepts that must be mastered in order to really get the results you want and to be a master of productivity. If you don’t start with the right fundamentals, even the best tricks and hacks won’t be fully utilized.<br></p><p>And finally in our last section we will build on the foundation we created by implementing proven productivity and time management tactics and strategies to really make a dramatic improvement in your productivity.<br></p><p>Here is what some of my students have to say about the course.</p><p><strong>Great course!</strong></p><p><em>The instructor is very knowledgeable on this subject. He uses applicable scenarios that I will definitely apply to my daily life. His ideas and instruction were easy to understand and make sense! The production quality was great- clear voice, no background noise and instructor was a great speaker. He was engaging and quick to the point. I would highly recommend if you want a productive way of life and need to get things done more efficiently!</em> <em>by ELizabeth Garvin</em><br></p><p><em>A lot of information put out. So many nuggets to use in everyday life leading you down the road of success. Feels genuine for many reasons most important one in my opinion is the free apps to assist in accomplishing your tasks or goals. 2 hours well spent and managed.</em><span> <em>by Edward D Smith</em><span></span><br></span></p><p><strong>Amazing course</strong></p><p><em>This course is very informative, the explanations are crystal clear and the instructor is very engaging.</em> <em>by Mr. Vignesh Gunasekaran</em></p><p><strong>Great Course</strong><br></p><p><em>I enjoyed this course, very informative with great examples and nuggets of wisdom to apply in life. Thanks!</em> <em>by Mr. Bill Todd</em></p><p>So let’s not waste anymore time. Let’s jump right in and get started!<br></p>", 
    "end_date": null, 
    "title": "Productivity and Time Management for the Overwhelmed", 
    "price": "20.00", 
    "instructors": "Josh Paulsen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655608_270e_3.jpg", 
    "course_url": "https://www.udemy.com/productivity-and-time-management/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T15:09:33Z"
}