{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Let's be honest, most \"productivity hacks\" just don't work. We start them with the best intentions, but along the way we get distracted or discouraged. You may start strong, but your internal voice starts saying things like,<br></p><ul><li><em>“There’s no way I can get all of this done.”</em></li><li><em>“Maybe I’ll feel better if I do something else... What’s new on Facebook?”</em></li><li><em>“Where did my day just go? I was busy but don’t feel like I did anything important!”</em></li><li><em>“If I didn't have so many distractions, I could actually focus on one thing.\" </em></li></ul><p>If you're like I was, you're probably overwhelmed, on the edge of burnout and feeling pulled in a million different directions. You're doing a lot of tasks that are wasting your time and aren't giving you the money or life you want. </p><p>But it doesn't have to be that way. </p><p><strong>This course is for you if...</strong></p><ul><li>You’re constantly looking for ways to improve yourself</li><li>You’re looking for faster ways to get work done so you can make progress every day</li><li>You’re juggling a million things and know you need to prioritize or delegate them </li><li>You have great ideas but need to focus on accomplishing one task at a time</li></ul>  <p><strong>Here are just a few of the things you can start learning today:</strong><br></p>  <ul>  \t<li>How to  <strong>find where every hour of your day goes</strong> to be more productive.</li>  \t<li> How to <strong>evaluate whether that time is actually making you money</strong> or not. </li>  \t<li> How to <strong>create step-by-step systems</strong> in your job or business to help it grow without you being there. (And not feel guilty about it.)</li>  \t<li>The exact <strong>questions to qualify</strong> people you delegate your work to. </li>  \t<li>Why I can leave my business for a <strong>week of vacation and come back</strong> without anyone knowing. </li>  \t<li>How to<strong> leverage your strengths and delegate your weaknesses.</strong> (You will learn from top experts on exactly how to outsource everything you should not be doing yourself.)</li>  \t<li>How to <strong>start outsourcing</strong> projects for as little as $5! </li>  \t<li>How to  <strong>be a more effective communicator </strong>to close more deals, hold shorter meetings  and master email. </li>  \t<li> Get a <strong>behind-the-scenes look at my business </strong>and get the exact tools I used to grow and automate my company. </li>  \t<li>The one tool that will <strong>enable you to never have to write the same email</strong> or proposal more than once again. </li>  \t<li>The <strong>secret to starting every day off successfully. </strong></li>  \t<li>New York Times Bestselling author,<strong> Dan Miller's exact process for creating Mastermind Groups</strong> so you're always surrounding yourself with the best people. </li>  </ul>  <p>  \t<strong>...and  much more!</strong>  </p>  <p>  \t                                                                  I've made the first (and longest) video in this course <strong>completely free </strong>so you can see my exact process for finding out where your time is going and how to make your day more profitable.  </p>  <p>  \t<strong><em>One Final Note… </em></strong>  </p>  <p>  \t<strong> If you don't own a business, that's OKAY.</strong>  These productivity strategies have helped thousands of people who work for small and large businesses as well. I've taught these strategies to everyone from sales teams to CEOs.  </p>  <p>  \t                                                                  There is a better way to approach your day and you can start immediately. Please don't put this off. If you are reading this, you know something needs to change. This is a risk free way to make that change. Remember, you have a 100% Money Back Guarantee.  </p>  <p>  \t<strong>Every hour you hesitate is TWO hours of profitable work you could have done.</strong>  </p>  <p>  \t                                                                 Click \"Take this course\" and join me today!  </p>  <p>  \t<em>See you inside,  </em>  </p>  <p>  \t                                                                 Joel Widmer  </p>", 
    "end_date": null, 
    "title": "Productivity Hacks: Free Up Your Time & Live Better", 
    "price": "30.00", 
    "instructors": "Joel Widmer", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189086_7e31_13.jpg", 
    "course_url": "https://www.udemy.com/productivity-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-26T14:22:20Z"
}