{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>**Update** Power Morning 2.0 is live, new content, better delivery and more engaging... and o</strong><strong>ver 3000 students got into the course now...</strong></p><p>Brainhack yourself and turn the \"Get Things Done Dial\" on high in 20 minutes or less each morning, with a simple 7-phase formula. Get rid of fear and anxiety in your body, get a healthy and strong body and get clarity each day so you can start hammering out your projects and finally can start pursuing your dreams again... with this 8-part crash course on the perfect morning routine.</p><p>+++++++++++++++++++++++++++++++++++++++++++++</p><p><strong>About This Course:</strong></p><ul><li><em>Dense and Value packed content</em></li><li><em>Different than any other dry and boring course on productivity, no filler and fluff talk, this course cuts straight to the chase of what it takes to have the best start into the day</em></li><li><em>I personally got out of the paralysis and overwhelm mode with these productivity secrets</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my \"giant balls promise\" to you. You either love it or get your money back.</em></li></ul><p><em></em></p><p><strong>Who Is This Course For?</strong><br></p><p>This course is for the guy/girl, who is always <strong>struggling to get things done</strong>, who is overwhelmed with the amount of information out there and spends his/her time rather on facebook and youtube then pursuing their dreams...</p><p>And finally for the person who has no clear structure and clarity in the day and is strucked by the procrastination mode.</p><p>You'll get the most out of this if you are one of the following:</p><ol><li>Bootstrapping internet entrepreneur</li><li>Work from home business owner</li><li>Freelancer or Selfemployed</li><li>Or any other person who is struggling with their checklist...</li></ol><p><br><strong>Who Is This Course Not For?</strong></p><p>This Course is not for people who...</p><ol><li>Who think that they have it all</li><li>Have their complete morning routine down.. perfectly...</li><li>Just wanna have another course that feels the dust of \"never touched\"</li><li>Don't wanna take action</li></ol><p>You don't need any prior knowledge to get started, no software, no additional materials. Just lean back, hit the play button and \"download\" the hidden psychology of The Power Morning to your own brain and finally take control of your life.</p><p>The only requirements for this course are: Being positive and open-minded.</p><p>Lectured by Marketing Consultant/Coach/Freelancer </p><p>Benjamin Hanna</p>", 
    "end_date": null, 
    "title": "Productivity Secrets - The Power Morning 2.0 ", 
    "price": "25.00", 
    "instructors": "Benjamin Hanna", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622826_d100.jpg", 
    "course_url": "https://www.udemy.com/powermorning/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-26T05:33:08Z"
}