{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">*******************************************************************************************************************</strong><strong style=\"\">LEARN HOW TO FOCUS AND BOOST YOUR PRODUCTIVITY BY 3x TODAY!</strong></p><p><strong style=\"\">Course fully updated for September, 2015!<br style=\"\"></strong><strong style=\"\">*******************************************************************************************************************</strong></p><p><em style=\"\">When I started preparing the content for this course, I received four email notifications on Outlook, my phone rang once, and a friend pinged me on Skype to discuss our upcoming road-trip - all within the first five minutes!</em><strong style=\"\"></strong></p><p><em style=\"\">Now, you may wonder that in this fast paced world, we all have become comfortable with handling several tasks at once. But chances are our work quality suffers when we divide our attention. So, in order to provide great quality content to our students and to walk the talk - I&#039;ve silenced my phone, turned off email alerts and logged out of instant messaging platforms!</em></p><p><em style=\"\"></em><em style=\"\">-------------------------------------------------------------------------------------------------------------------</em></p><p><strong style=\"\">IMPORTANCE OF UNITASKING: </strong></p><p>In simple terms, Unitasking means <strong style=\"\">&#039;doing a single thing at a time&#039;</strong>. It is just the opposite of multitasking. </p><p>A lot of people fall victim to the belief that the more they accomplish in the shortest time possible, the more successful they become in their lives. Yes, this notion might work for some, but for those who are not that good at multitasking, it is highly unlikely that they will reap positive results from this.</p><p>Research conducted at Stanford University found that multitasking is <strong style=\"\">less productive</strong> than doing a single thing at a time. Multitasking reduces your efficiency and performance because your brain can only focus on one thing at a time. When you try to do two things at once, your brain lacks the capacity to perform both tasks successfully. Research also shows that, in addition to slowing us down, multitasking <strong style=\"\">lowers your IQ</strong>.</p><p><strong style=\"\">WHY SHOULD YOU TAKE THIS COURSE?</strong></p><p>In this course, I will teach you proven strategies, models and techniques related to Unitasking, which will help you in getting more things done every single day! By the end of this course, you will not only be able to appreciate the importance of Unitasking but also practice it to improve your focus and concentration levels thereby boosting your productivity. </p><p><strong style=\"\">COURSE STRUCTURE:</strong></p><p> This course on Unitasking is structured into 6 key modules:</p><ul style=\"\"><li><strong style=\"\">Module 1 </strong>deals with the introduction which covers the impact of multitasking on productivity and the importance of performing single tasks at a time</li><li><strong style=\"\">Module 2 </strong>deals with key tools and models for prioritizing tasks effectively</li><li><strong style=\"\">Module 3 </strong>deals with proven strategies for Unitasking</li><li><strong style=\"\">Module 4 </strong>deals with Improving your concentration– this also includes daily focus exercises</li><li><strong style=\"\">Module 5 </strong>deals with work-related distraction and ways to eliminate multitasking at workplace</li><li><strong style=\"\">Module 6 </strong>deals with the conclusion which includes the next steps and various resources to get the best out of this course.</li></ul><span></span><p><strong style=\"\">COURSE MATERIAL: </strong>Primarily videos and text</p><p><strong style=\"\">COURSE DURATION:</strong> Approx. 1 hour</p><p><em style=\"\"><strong style=\"\">So get ready to declutter your life. I will see you on the other side!</strong></em></p>", 
    "end_date": null, 
    "title": "PRODUCTIVITY: How To Unitask & Double Your Productivity", 
    "price": "20.00", 
    "instructors": "Upskill Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566494_ccc5_17.jpg", 
    "course_url": "https://www.udemy.com/unitasking-boost-your-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T21:16:03Z"
}