{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                                      OVER 960 SUCCESSFUL STUDENTS HAVE ALREADY TAKEN THIS COURSE  </p>  <p>  \t<em>IMPORTANT NEWS: Price will increase to $299 on October 1st, 2014, 10 AM (Pacific) - Make sure to enroll before the next price increase!</em>  </p>  <p>  \t<em>NEW FEATURE! Worksheets, Blueprints and Productivity-Templates added to the download section for fast implementation.</em>  </p>  <p>  \t<em>LATEST UPDATES - September 5th, 2014:</em>  </p>  <ul>  \t<li><em>14 Advanced Bonus Videos on Time Management Added</em></li>  \t<li><em>1 Hour Live Webinar Replay Titled &quot;How to Wake Up Productive&quot;</em></li>  </ul>  <hr>  <p>  \t                                      Start increasing your productivity, improving your ability tofocus and DOUBLE your physical energy, no matter how lazy and unproductive you are, immediately - just like my current 960+ students!  </p>  <p>  \t                                      No to-do-lists, tickler systems or calendars needed!  </p>  <p>  \t<em>NEW! Now includes 4-week autosuggestion sheets for willpower boosts!</em>  </p>  <p>  \t                                      +++++++++++++++++++++++  </p>  <p>  \t                                      About this course:  </p>  <ul>  \t<li><em>Over 960 very happy students</em></li>  \t<li><em>Different than ANY traditional time management techniques like calendars, &quot;tickler systems&quot; or to-do lists that others are teaching!</em></li>  \t<li><em>Dozens of 5 Star Reviews from VERY satisfied students</em></li>  \t<li><em>Full, free lifetime access</em></li>  \t<li><em>All future extra lectures and upgrades are always included for free</em></li>  \t<li><em>Unconditional Udemy 30 day money-back guarantee - that&#039;s my &quot;giant balls promise&quot; to you. You either love it or get your money back.</em></li>  \t<li><em>14 advanced bonus modules to increase your productivity even more!</em></li>  \t<li><em>Now includes 4-sheets of autosuggestions to boost your productivity!</em></li>  </ul>  <p>  \t                                      HERE&#039;S JUST SOME OF THE RESULTS I&#039;VE GOTTEN  </p>  <ul>  \t<li>I wake up productive, with more energy than a 5 year-old guzzling energy drinks and more motivated than Tony Robbins in front of a crowd of 10 thousand. I know exactly what I’ve got to get done to transform myself into a peak emotional and physical state that’s primed specifically to take massive action with. </li>  \t<li>I &quot;accidentally&quot; lost an excess of 25 pounds and I’ve never been this healthy in my life. I rarely ever fall sick. Even when there’s a bug in the air and everyone around me has faucet taps for noses and are basically forced to stay in bed all day...I don’t get sick! </li>  \t<li>My energy level has doubled, and I don’t ever get those crack cocaine energy highs and intense energy drops anymore. My energy levels run at a constant and sustainable high that’s available any time I need to get in action.</li>  \t<li>I got rid of $1,800 debt, and started not only one, but TWO 5-figure businesses that are growing daily and creating an income that I can use to live a life of travel, fun and adventure. While the masses of men are living in “quiet desperation”, I’m geographically free, travelling the world while nurturing my businesses.</li>  </ul>  <p>  \t                                      ...And would you like to know the craziest part of this new life I have?  </p>  <p>  \t                                      It&#039;s nerve-shockingly EASY!  </p>  <p>  \t                                      The majority of us picture that peak-performance productivity as an entrepreneur sweating bullets over his business sales figures... face scrunched up in deep concentration, blood dripping from his forehead due to the amount of mental work he’s juggling...  </p>  <p>  \t                                      You know what?  </p>  <p>  \t                                      It&#039;s the COMPLETE OPPOSITE.  </p>  <p>  \t                                      I’m still the same lazy bum who loves eating pizza in bed.  </p>  <p>  \t                                      But I know the secrets to effortlessly tapping into that emotional and physical peak state. And after the years of trial and error, I’ve developed a simple method that puts me in peak productivity, day after day, night after night.  </p>  <p>  \t                                      Once you start playing the videos, taking notes and looking at the materials, you’ll see that mastering your time management and having peak productivity isn’t something impossible or magical <em>- it just requires the right recipe. </em>  </p>  <p>  \t                                      You’ll be able to shortcut over 5 years of painful trial and error <em>in just 3 hours of jam-packed video training.</em>  </p>  <p>  \t                                      And if after looking at the entire course you don’t think that the course was an investment that’ll pay 10x over in the benefits you get from it, you can get a refund from Udemy within 30 days for the entire course fee without any hassle.  </p>  <p>  \t                                      (By the way - No one has told me that I’ve wasted their time or money in this course yet. That’s why I’m making this offer. This course will deliver. I’m putting my money where my mouth is with this guarantee)  </p>  <p>  \t                                      If you don’t want to miss out, take action now, invest in the course and secure your spot.  </p>  <p>  \t                                      Click the &quot;take this course&quot; button, top right, now!  </p>  <p>  \t                                      To Your Productivity,  </p>  <p>  \t                                      Till Boadella  </p>  <p>  \t                                                  P.S. This course will show you exactly how to wake up productive every day, how to successfully overcome procrastination and how to manage your time.  </p>  <p>  \t                                                  This is the exact time management and productivity system that allowed me to build two new successful businesses in one year, lose about 25 pounds and at least double my physical energy. I guarantee this course will change your life.  </p>  <p>  \t                                      You’ll receive instant access to all 14 modules and over 3 hours of video content right after your payment. You don’t risk anything! Try it for the next 30 days and if you’re not satisfied, you can have 100% of your money back, for any reason at all!  </p>  <p>  \t                                      You&#039;ll also get access to 14 additional lectures as a FREE bonus.  </p>", 
    "end_date": null, 
    "title": "Productivity Secrets: The Ultimate Time Management System", 
    "price": "20.00", 
    "instructors": "Till Boadella", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189244_8d80_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-wake-up-productive-every-day/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-26T19:32:56Z"
}