{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t     Discover How to Use effective Time Management, Project Management, Email Management, Social Media Management and Procrastination Busting and a bunch of other Productivity Ninja moves so you can be ALL that You Are, so You Can FINALLY Get Exactly Where You Want to Go – FASTER than You Ever Thought Possible – To Allow Yourself to Make the Big Money and to BE Big Impact YOU are meant to!  </p>  <p style=\"\">  \t     Have you ever wondered:  </p>  <ul style=\"\">  \t<li style=\"\">Why do I work so hard and accomplish so little at the end of the day?</li>  \t<li style=\"\">Why do I work so hard and seem to accomplish a lot but never seem get to those chunks of work and projects that would really turn my business around?</li>  \t<li style=\"\">Why do I feel like I’m chasing my tail, never getting anywhere, even though I do put tons of hours in?</li>  \t<li style=\"\">How can I manage all of this endless email, social media, and all the tasks that pull at me without constantly feeling overwhelmed and frazzled?</li>  \t<li style=\"\">Why do I feel and KNOW I have something great to offer, yet I never seem to gain enough traction or make enough money? Or make any money at all?</li>  \t<li style=\"\">Why do I barely get what I need done in the day to just keep my business surviving, let alone growing it?</li>  </ul>  <p style=\"\">  \t    If you answered “Yes” to any of these…  </p>  <p style=\"\">  \t    … you’re in exactly the right place.  </p>  <p style=\"\">  \t This program was designed just for you. To clear out all those past obstacles to getting things done, feeling great about it and finally getting you to the place you want to be in your work and life!  </p>", 
    "end_date": null, 
    "title": "Productivity Secrets of Successful People", 
    "price": "20.00", 
    "instructors": "Jeanne Omlor", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/220090_2047_40.jpg", 
    "course_url": "https://www.udemy.com/productivity-secrets-of-successful-people/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-16T00:54:42Z"
}