{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><span></span></p><ul><li>Over <strong>3500 happy students</strong> enrolled in my courses</li><li>Currently <strong>103 out of 124 4- and 5-star reviews</strong></li><li>No risk involved. Watch the <strong>PREVIEW VIDEOS</strong>!</li></ul>\n\n<hr>\n\n<p><strong>Do you say these things to yourself:</strong></p>\n\n<ul><li>I'm so sick and tired of feeling overwhelmed by emails, papers, voicemails, projects, and other peoples' demands! </li><li>Why can't I do the things I KNOW I should be doing?</li><li>Why do I constantly feel like I get 2 things done, and 3 new things show up...arghhh!!</li><li>Why does my 'dream' for an awesomely productive day often end up being a dud?</li><li>What in the world should I be working on right now?</li><li>Waking up early really stinks, but I know I need to do it, but how can I make it less painful?</li><li>How do other people do so much in 24 hours, and I feel like I barely squeeze out an existence?</li><li>Where did I leave the kids?!?</li></ul>\n\n<p>If you've said any of these things to yourself in the past week, you're going to love this course.</p>\n\n<p>Not only does it answer all these questions (and more), but the course is delivered to you in a visual, simple, and fun way (<strong>check out the preview videos</strong>).<br></p><hr>\n\n<p>So...what makes this one of <strong>the best productivity courses you will ever take</strong>?</p>\n\n<ul><li>My relentless focus on delivering high-quality content within the course</li><li>The high value of the ideas</li><li>The unique and engaging way lessons are presented</li><li>How practical and usable the ideas are that I teach you</li><li>The transformation you'll see in yourself</li><li>The transformation others will see in you</li></ul>\n\n<hr>\n\n<p><strong>This course is for you if you:</strong></p>\n\n<ul><li>Want to be to be a freakish force of productivity nature!</li><li>Have very little time to watch boring, complicated lessons because the kids need fed, the dog needs walked, and life just continues to happen</li><li>Tired of ideas that are really nothing more then weak, boring cliche's that are largely worthless nonsense ('be yourself', 'never walk away from fear', 'let it go', etc.)</li><li>Enjoy video training over book-learnin'</li><li>Want actionable, practical strategies and tools that you can use right now - today</li><li>Think visual guides for each lesson are cool and useful for reference later</li><li>Like having some fun while you learn</li></ul>\n\n<p>Scan the lessons below, and be sure to <strong>watch some of the many FREE preview videos </strong>to see for yourself that what I just said is true!</p>\n\n<hr>\n\n<p>After you're done watching the free preview videos (and your brain has adjusted to how awesome it feels), then follow these steps:</p>\n\n<ol><li>Join the course </li><li>Watch <em>all</em> the videos</li><li>Download <em>all</em> the included guides (I call these <strong>LifeMaps</strong>)</li><li>Put what you learn into action</li><li>Come back and let me know what you think - if you like what you've learned, leave a lovely (that means nice) review, if not, get a lovely refund (you have a full 30 days to do this)</li></ol>\n\n<hr>\n\n<p>Be amazing!</p>\n\n<p>Derek</p>", 
    "end_date": null, 
    "title": "Productivity: How To Get 2X More Done Each Day", 
    "price": "20.00", 
    "instructors": "Derek Franklin", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552524_4cae_14.jpg", 
    "course_url": "https://www.udemy.com/wow-u-course/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T14:57:00Z"
}