{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Everybody is blessed with a powerful brain,the right part which is creative in nature .</p><p>It can think and develop innovative ideas which are very much necessary for the development of mankind.</p><p>All intelligent people such as the scholars,the scientists,the professors etc..possess lot of knowledge which should not perish with their demise.<br></p><p>The knowledge and skills acquired by various people should be propagated for use by the people of future generations to continue development,.It is possible only by transferring the data by writing in the form of books or by recording.</p><p>Therefore writing book is a very important activity of the educated people to share their knowledge with other people.</p><p>Even though lot of people possess lots of knowledge not many of them do have the skill of writing books for want of specific knowledge of writing.</p><p>This course which is strengthened with several lectures covering all aspects of writing help all such interested people to learn the techniques of writing  a book the fastest way.</p><p>By repeatedly practicing writing in the prescribed manner the  student will develop the skill to write and publish his books to get name fame money satisfaction and finally happiness.</p><p>Various lectures of this course discusses the 3 important stages involved in book writing and publishing thoroughly in an interesting manner so that anybody with interest to write a book can write soon and become an established author.</p><p>No prior experience of writing is needed to understand and practice the techniques explained in this course except the interest and enthusiasm to write a book.</p><p>                                                                Aspirant Book writers</p><p>                                                                         Best of luck <br></p><p>Let us meet again in the lecture sessions ,if you register for this course.<br></p>", 
    "end_date": null, 
    "title": "Productivity Hacks : Become A Writer from Scratch", 
    "price": "20.00", 
    "instructors": "Harris Crystal's Smart Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590146_2ffa_10.jpg", 
    "course_url": "https://www.udemy.com/learn-the-skills-to-write-a-book-the-fastest-way/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-22T06:02:35Z"
}