{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will dramatically increase your productivity and help you accomplish your everyday tasks twice as fast!</p>\n\n<p>If you find yourself being lazy quite often and it is honestly getting in the way of your work, resulting in a lack of accomplished tasks and a decline in your productivity, then this training is perfect for you.</p>\n\n\n\n\n\n\n\n\n\n<p>Let me introduce you to proven &amp; tested strategies and tools which allow you to still indulge in a small amount of laziness while at the same time accomplishing the work which you have set out to do.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn How To Take The Best Seat In The House &amp; Learn Cutting-Edge Techniques To</strong></p>\n\n\n\n\n\n<ul><li>Stop being unproductive and meet the standards that you have been held up to</li><li>Discover the hidden obstacles to being productive and how to overcome them</li><li>Be twice as productive before going to bed tonight</li></ul>\n\n\n\n\n\n\n\n\n\n<p><br>This course will teach you the most cutting-edge tips and tricks for productivity and efficiency, so that you can do more work in less time.<br></p>\n\n\n\n\n\n\n\n\n\n<p>You’ll have more time for the things that truly matter in life by understanding how to organize, prioritize and manage your tasks. You will learn the tips and tricks to do just that - and much more!</p>\n\n\n\n\n\n\n\n\n\n<p>I simply can't stress how important this course is for you to become the task accomplishing, goal smashing, productive worker thinker that you have always dreamed of being!</p>\n\n\n\n\n\n\n\n\n\n<p>By the time you complete this training, you’ll have the tools and skills to become the task accomplishing, goal smashing and productive worker that you’ve always dreamed of being. </p>\n\n\n\n\n\n\n\n<p><em><strong>Enroll today and let me help you making your life a bit better!</strong></em></p>", 
    "end_date": null, 
    "title": "Productivity Masterclass: You Can Be Twice As Good!", 
    "price": "20.00", 
    "instructors": "Kendall Knight, Sandor Kiss", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780706_afd6_8.jpg", 
    "course_url": "https://www.udemy.com/ultimate-productivity-you-can-be-twice-as-good/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-03T03:47:33Z"
}