{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul>  \t<p>  \t\t<strong>UPDATE</strong>: Almost 400 students within the first day!! I&#039;m honored to share my work with everyone and will continue to add more content through december to teach, stimulate, engage, and provoke thought.  \t</p>  \t<p>  \t\tSign up today for the low price of $9!! Price will be increased soon!  \t</p>  \t<p>  \t\t__________________________________________________________________<br>  \t</p>  \t<p>  \t\tWould you like to develop psychological immunity, mindfully learn from some of the world’s greatest thinkers and learn…..HOW to learn more effectively in ANY and EVERY field you come across?  \t</p>  \t<p>  \t\t    Then this course is for you!  \t</p>  \t<p>  \t\t    I have spent many years in psychology both from a research perspective and through my own independent self-study of knowledge and how our brains interact with it. Through this study in psychology, neuroscience, creativity, education, philosophy, and health, I have concluded that the relationship we have to knowledge and how we interact with it through our brains is the key in successful learning. In this course you will:  \t</p>  \t<ul>  \t\t<li>  Learn how to be more mindful of the hidden potential in everything you learn  </li>  \t\t<li>  Develop your brain by educating and training it through different fields  </li>  \t\t<li>  Combine different areas in life to see the common theme and open up new avenues for learning + succeeding in life  </li>  \t\t<li>  Learn from some of the world’s greatest thinkers</li>  \t\t<p>  \t\t\t    ·Gandhi  \t\t</p>  \t\t<p>  \t\t\t    ·Helen Keller  \t\t</p>  \t\t<p>  \t\t\t    ·Bruce Lee  \t\t</p>  \t\t<p>  \t\t\t    ·Viktor Frankl  \t\t</p>  \t\t<p>  \t\t\t    ·Carl Jung  \t\t</p>  \t\t<p>  \t\t\t    ·Aristotle  \t\t</p>  \t\t<p>  \t\t\t    ·Even Sherlock Holmes!  \t\t</p>  \t\t<li>  Develop greater attention and communication skills  </li>  \t\t<li>  Develop better relationships with others and yourself as well!  </li>  \t\t<li>  Enhance empathy  </li>  \t\t<li>  Lower stress and anxiety  </li>  \t\t<li>  Develop psychological immunity to obstacles in your life  </li>  \t\t<li>  Interact with every course on Udemy (even across courses) on a much deeper level through research informed by psychology, neuroscience and creativity experts  </li>  \t\t<li>  Transform a piece of knowledge that may seem of little value into something priceless  </li>  \t</ul>  \t<p>  \t\t    This simple yet powerful course will teach you all of this and supply you with the tools to utilize Psychosynosis in your own life, in any and every field.  \t</p>  \t<p>  \t\t    I’m honored to share my work with you! It has saved my life in many ways and can enhance your own in so many ways!  \t</p>  \t<p>  \t\t    Enroll today!  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Psychosynosis: Learn.....how to learn more effectively. ", 
    "price": "20.00", 
    "instructors": "Louis Lakatos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355900_a929_3.jpg", 
    "course_url": "https://www.udemy.com/psychosynosis-learnhow-to-learn-more-effectively/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T05:43:24Z"
}