{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>This course will transform the way you read forever!<br>  \t</strong>  </p>  <p>  \t<strong></strong><strong><em>Speed reading is easy, an ability anyone can learn. Already trained thousands of people improving their reading speed with this method.</em></strong>  </p>  <p>  \t<strong>IMPORTANT:<br>  \t</strong>  </p>  <p>  \t<strong>To give even more people the opportunity to follow this great technique, we have temporarely lowered the price, just until 31 December. Take advantage!</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>This course contains many hours of video&#039;s, lots of sections with text and about 50 trainingslides: all e</strong><strong>ffective learn by doing exercices.</strong>  </p>  <p>  \t                                                        Do you recognize any of the following situations?  </p>  <p>  \t                                                        - You are reading a book and at the bottom of the page, you realize that you do not exactly know what you&#039;ve read!  </p>  <p>  \t                                                        - While reading, you can not keep your attention, you will be regularly distracted.  </p>  <p>  \t                                                        - You &#039;jump&#039; back regularly because you have either not understood the words or you have no idea of what you&#039;ve read!  </p>  <p>  \t                                                        - While reading, you get the &#039;feeling&#039; that you no longer have a complete overview of the stuff you&#039;ve read.  </p>  <p>  \t<strong>In short, you feel that your reading skills can use improvement?</strong>  </p>  <p>  \t                                                        Now is the time to follow this training in speed reading and you will find that your reading speed has doubled during training, with at least constant or even increased level of understanding!  </p>  <p>  \t                                                        Reading is a great skill to acquire knowledge or just to relax. Wouldn&#039;t it be nice to read, while the information is better stored in your brain? Read a book in half the time, or faster?  </p>  <p>  \t<strong>Speed reading is the ideal way to: </strong>  </p>  <li> be able to do more in less time! </li>  <li> be able to work faster! </li>  <li> be able to learn more in less time! </li>  <p>  \t<strong>You also want to read much faster? <br>  \t                            Then follow this training right now and you will experience faster reading, even within the next couple of days!  </strong>  </p>", 
    "end_date": null, 
    "title": "Quadruple your current reading speed!", 
    "price": "25.00", 
    "instructors": "Ruud Rensink", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304146_39b1_2.jpg", 
    "course_url": "https://www.udemy.com/speedreading/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T08:59:52Z"
}