{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>\"No More Wasted Days...\"\n</strong>\n</p>\n\n<p><strong>\n</strong>\n</p>\n\n<p><strong>Can you relate to the following story...???</strong>\n</p>\n\n<p>Dave needs to finish an important project that he’s been putting off...\n</p>\n\n<p>His thought process starts with...\n</p>\n\n<p>Okay, I have to sit down, get all the papers out, will have to do\n some reading and typing by that time it will be 30 minutes, I only have\n 40 minutes to spare right now, so by the time I start doing actual \nwork, I will have to pack up...\n</p>\n\n<p>\"You know what I’d just rather not think about it right now… instead, let me just quickly check my emails...\"\n</p>\n\n<p>Emails to say Dave has Facebook notifications, plus YouTube \nrecommends a video (click) LOL that’s funny reminds Dave of film…. Dave \nfeels like watching something now, and starts browsing Netflix……………..\n</p>\n\n<p>\n 45 minutes later of browsing Netflix…… Dave can’t decide on anything good to watch…Arghh\n</p>\n\n<p>\n Looks down at the bottom right of the screen to notice 2 \nwhole hours have just gone past, when Dave said that he had only 40 \nminutes to spare, Dave feels guilty for putting off the project \nassignment once again, and he says to himself “I could have done some \nwork all that time!!!... Dave then goes to promise himself \"I'm going to\n do it tomorrow….” \n <strong>------------------------</strong>\n</p>\n\n<p><strong>Tomorrow Arrives...</strong>\n</p>\n\n<p>Dave sits down all prepared with the best of intentions to get some work done today...\n</p>\n\n<p>But he feels he just needs to research something quickly online...\n</p>\n\n<p>Next thing you know..\n</p>\n\n<p>Dave finds himself checking email..... followed by \nFacebook.....then twitter..... Dave then finds himself watching a quick \nfew videos on youtube.... plays a quick game online...... then does some\n actual work for 10 minutes before Dave feels the need to check email \nagain.... followed by Facebook..... then twitter and emails once again, \nbefore coming back to doing some actual work.\n</p>\n\n<p>Total time spent 3 hours, actual time spent doing work 20 minutes...\n</p>\n\n<p>Dave doesn’t feel so bad because at least he did some work today,\n but definitely, tomorrow he says to himself…. \"I'm going to do it \ntomorrow...\"\n</p>\n\n\n\n<p>Dave's story is a funny one that  we all can relate to, and every-one of us has their own version of this story,\n</p>\n\n<p>However…\n</p>\n\n<p>\n</p>\n\n<p><em><strong></strong></em><strong><strong>\"Imagine </strong><strong>waking\n up one day feeling that you're stuck in a loop and your life is not \ngoing anywhere, you feel a midlife crisis coming on and or depression.”</strong></strong><em><strong></strong></em>\n</p>\n\n<p>If this is a scary thought, think about how drugs can have serious negative \nconsequences over the long term for someone who regularly uses drugs, similarly habitual procrastination can also have serious \nLife consequences if you regularly procrastinate.\n</p>\n\n<p>One of two things happen when we regularly procrastinate;\n</p>\n\n<p>1) In some areas of our life, whether that be financial, \nrelationship-wise or health, can suffer badly because we procrastinate \nway too often, and break promises to ourselves as well as others.\n</p>\n\n<p>2) Or we are always just trying to keep up with life’s chaos, \njust so we can make it through the week. We don't have time to \nconcentrate on our hopes, dreams, big goals, health, relationships or \nanything else. We already have far too much going on already, small and \nbig things \"to-do\" that we are constantly juggling in the back of our \nminds that we have been procrastinating on lately.\n</p>\n\n<p>Either way, procrastination ultimately can lead to a day, where \nyou wake feeling that you're stuck in a loop and your life is not going \nanywhere, this can result in a midlife crisis and or depression.\n\n</p>\n\n<p>The more you use the \"I'll do it tomorrow\" phrase on a daily basis...The more and more \nthings start piling up quickly, as you try to juggle everything from the unimportant to the \nimportant in the back of your mind.\n</p>\n\n<p><strong>You either become scattered all over the place, or you just avoid \ntasks altogether by not thinking about them until you have no choice but\n to complete them, but by that time more small and big tasks have already piled up…. \nincluding stress and anxiety!!!\n\t</strong>\n</p>\n\n<p>Here's what you may experience the longer you procrastinate on \nsomething important that you've been \nmeaning to get done.... first you may start to feel guilty for not \ncompleting it, but as the deadline draws near you feel stress and \nanxiety as more and more small and big tasks start to build up in your \nmind, its complete chaos and in the end you either fail to deliver on \ntime or you deliver much poorer quality than you could have\n\t.\n</p>\n\n<p>This Cycle repeats itself day after day, week after week, month after month, year after year....\n\n</p>\n\n<p>Procrastination does this to the best of us, who always have the best of intentions to get things done.\n</p>\n\n<p> So if you are finding yourself procrastinating too much, you \nshould want to get a handle on it as soon as possible in order to take \nback control, and to avoid this ultimate depressing outcome and downward\n spiral.\n</p>\n\n<p><strong>By getting a handle on \nprocrastination and staying on top of things, you'll feel better that \nyou actually did something productive at the end of each day. You’ll \nfeel more in control and organized. You’ll also feel a sense of \naccomplishment every-time you achieve one of your tasks. </strong>\n</p>\n\n<p><strong>As you begin to notice these \npositive changes starting to happen within your life, you’ll find that \nmore and more doors tend to open for you, you'll be presented with \nbetter financial and career opportunities, as well as experiencing \nbetter health and having better relationships as a extra side benefit \nover time.\n\t</strong>\n</p>\n\n<p>There are many good motivational videos, articles, and speeches \nto get you motivated. In fact, you may have already read, heard or \nwatched some of these. After a few hours, these things can help you feel\n motivated for 1hr, 2 hrs or maybe even for the rest of today.\n</p>\n\n<p>But the problems with these types of articles and videos is that \nmotivation is short lived, as it does not provide a clear strategy you \ncan apply to your unique situation immediately or how to track your own \npersonal progress on the tasks you are currently procrastinating on. So \nas soon as tomorrow comes there's a high chance you'll be back to square\n one procrastinating again.\n</p>\n\n<p>So this is why I’ve created this video course \"Quick Proven \nMethods to Help You Stop Procrastinating &amp; Get Your Life Back on \nTrack Starting Today!!!\" This course is created using only the most \npowerful and proven methods that actually work, that you can learn and \napply instantly to your own unique situation to experience immediate \nprogress and long-term transformation.\n</p>\n\n<p>\n\n</p>\n\n<p>\n</p>\n\n<p><strong><u>By the end of the course;</u></strong>\n</p>\n\n<p> <strong>You'll Feel more Mentally Organized</strong>\n</p>\n\n<p><strong>You'll Find Yourself taking Action on your tasks Automatically, without any extra mental </strong><strong>effort or needing to spend hours motivating yourself,</strong>\n</p>\n\n<p><strong>You'll Feel a Fresh Boost of Mental Energy, </strong>\n</p>\n\n<p><strong>You'll Feel More in Control and more Focused than you have been Recently,</strong>\n</p>\n\n<p><strong>You’ll know exactly where to start, and in which steps to do your tasks in.</strong>\n</p>\n\n<p><strong>You'll\n find yourself completing your tasks much earlier, and rewarding \nyourself with extra free time that's stress free to enjoy anything you \nwant to do without worrying about deadlines.</strong>\n\n</p>\n\n<p>\n\n</p>\n\n<p>Before you know it, you'll back on track ticking off those\n important tasks that you've been procrastinating on in no time. You’ll \nfeel more fulfillment and a sense of accomplishment every-time you \ncomplete one of your big tasks, by doing this you will naturally find \nyourself  moving towards more of what you really want.\n</p>\n\n<p>If you're looking for an in-depth course on procrastination \nexplaining hours of procrastination theory and the science of \nprocrastination, then this course is probably not for you...\n</p>\n\n<p>However if you're looking for a short effective course, with \nproven techniques and powerful strategies that you can apply immediately\n to your very own unique situation, then this course is for \nyou.\n</p>\n\n<p>\n\n</p>\n\n<p><strong><u>This video course has been designed differently;</u></strong>\n</p>\n\n<p><strong>To Help you stop procrastinating &amp; get things done starting today, <strong>using only the most effective \nand powerfully proven methods stacked upon one another. \n\t</strong></strong>\n</p>\n\n<p><strong><strong>To help you get back on track quickly, and help you stay on track for the weeks, months and year ahead.</strong></strong>\n</p>\n\n<p><strong><strong>With\n 8 easy to watch videos, this video course has been distilled to make it\n as short and effective as possible in order to get you Fast results in \nyour unique situation within the shortest space of time\n\t</strong></strong>\n</p>\n\n<p><strong>Each video is easy to follow along, with step by step instructions that you can apply to your  situation <strong><strong>immediat</strong>ely </strong>as you watch each video or immediately after watching<strong><strong>\n</strong></strong></strong>\n</p>\n\n<p><strong><strong><strong>No\n extensive long hours on the theory of Procrastination or unnecessary \nrepeats, this course is just pure valuable content, with proven \ntechniques and strategies you can apply immediately as you watch, to get\n you results fast.\n\t</strong></strong></strong>\n</p>\n\n<p><strong><strong><br></strong></strong></p><p><strong><strong>\n\n</strong></strong></p><strong><strong>\n\n</strong></strong><p>\n</p>\n\n<p><strong>T</strong><strong>ry this course Risk-FREE for 30 days</strong>\n either you’re back on track, mentally organized with more focus and \nclarity than ever before, making progress and getting things done on \nautopilot mode, or your money back.\n</p>\n\n<p><strong>“Procrastination” is the \nultimate thief of time, don’t let procrastination continue to steal your\n days away from you that you could be using, to \nget to where you really want to be… Because the worst regret in Life is \nwasted time... \n\t</strong>\n\t\n\n</p>\n\n<p>\n</p>\n\n<p><strong>So<strong> click the \"enroll\" button now </strong>to get started, as this could be<strong> the most valuable investment you make on yourself this year…</strong> </strong>\n</p>\n\n<p>\n\n</p>", 
    "end_date": null, 
    "title": "Quick Proven Methods to Help You Stop Procrastinating Today!", 
    "price": "40.00", 
    "instructors": "Mohammed Rahman", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761126_4fc3_5.jpg", 
    "course_url": "https://www.udemy.com/proven-methods-to-stop-procrastination-procrastinating-get-things-done/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T00:48:17Z"
}