{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You can be more productive right now. Learn how by taking full advantage of the popular task management tool Todoist. Millions of people around the world rely on Todoist every day to help them get stuff done.</p><p>We'll start this course by getting an overview of Todoist's interface. We'll get familiar with some of the terminology and features you'll come across when using Todoist. Some of hte features we'll cover include:</p><ul><li>Understanding projects</li><li>Adding and using labels</li><li>Search queries and syntax</li><li>Saved searches with filters</li><li>Gamification with Todoist karma</li><li>Setting up mobile, location and time-based reminders</li></ul><p>After we're familiar with some of the core fundamental concepts, we'll start learning some more advanced features. We'll learn how to add attachments from our computer, Dropbox or Google Drive. We'll learn how to share projects, assign tasks to others and how we can save time by using project templates.</p><p>If you're like me, you probably get a lot of emails. So we'll learn how we can email tasks to Todoist and even how we can set up Gmail filters to automatically send things to Todoist. We'll also learn how we can use popular tools such as IFTTT and Zapier to automate creating tasks in Todoist.</p><p>We'll wrap up this course by learning some general tips and tricks and how we can both back up our data and be more secure with Todoist.</p><p>By the end of this course, you'll be armed with the tools you need to be a more productive and effective person using Todoist's powerful features.</p>", 
    "end_date": null, 
    "title": "Quick Start to Todoist", 
    "price": "20.00", 
    "instructors": "Dan LeFebvre", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697724_ade7_7.jpg", 
    "course_url": "https://www.udemy.com/getting-started-with-todoist/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T02:25:29Z"
}