{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      Mind Mapping isn&#039;t a new concept.  It is, however, a largely untapped resource that most people either skip over or think themselves incapable of utilizing.  </p>  <p style=\"\">  \t      This course will help guide you through not only the steps and uses of mind mapping, but also the elements of deeper, insightful thinking.  You will learn to utilize mind mapping in order to:  </p>  <ul style=\"\">  \t<li style=\"\">Discover solutions for problems</li>  \t<li style=\"\">Organize your thoughts for study and research</li>  \t<li style=\"\">Write presentations</li>  \t<li style=\"\">Plan events</li>  \t<li style=\"\">And more!</li>  </ul>  <p style=\"\">  \t      With two hours of content, this course gives you both experiences and information, and it does so with enough time to keep you engaged, yet <strong style=\"\">without hours of repeated, unnecessary content</strong>.  It also includes <strong style=\"\">downloadable mind map templates</strong> to help get you started.  </p>  <p style=\"\">  \t      This course is designed to guide you through discovering radiant thinking, learning the basics of mind map structure, and then 7 ways to use mind maps in real world situations.  It also includes countless mind maps I&#039;ve used for years, so you have <strong style=\"\">real examples</strong> to both <em style=\"\">validate the information you&#039;re learning</em> and to <em style=\"\">inspire you in your mind mapping endeavors</em>!  </p>  <p style=\"\">  \t  The course will also have regularly updated bonus material, such as <strong style=\"\">case studies</strong> (stories of myself and others using mind mapping in real-world situations) and <strong style=\"\">bonus lessons</strong> (based on new ways I&#039;ve discovered uses for mind mapping).  </p>", 
    "end_date": null, 
    "title": "Radiant Thinking: Mind Map Your Way to Success & Empowerment", 
    "price": "30.00", 
    "instructors": "Brenton Harris", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381226_0120_2.jpg", 
    "course_url": "https://www.udemy.com/radiant-thinking/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T22:35:56Z"
}