{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>How do you conquer that endless reading list? And even if you do get around to reading, how do you process all that new information? In this course I will teach you a system for extracting information from the books you read, so that you get more reading done, learn more, and make that information more useful to you in the future.</p><p><em>-------</em></p><p><em>This was the course I was searching for, for a long time!…This course should be seen by all starting students or (like me) all struggling old students who missed this in the past. — Udemy review</em></p><p><em><em>Danny, does a great job laying the foundation of \"batch\" reading as well as offering many great pointers to facilitate and maximize the process. If you desire, or need to, do lots of research reading (business or academic) you will love this course<span><em>. — Udemy review</em></span></em><br></em></p><p><em>-------</em></p><p><strong>I will help you implement a system to read books faster and get the information you want from them.</strong></p><ul><li>Find more time for making reading a life-long habit</li><li>Learn to read faster</li><li>Learn more from the books you read</li><li>Set up a system for making information more useful to you later</li><li>Conquer your reading list!</li></ul><p><em>-------</em></p><p><em>The information is not just for students or academics, but also for anyone who is trying to learn a new topic for personal or professional use. There is so much information available out there, this course provides tools to read and then extract and organize info in a meaningful way, such that you do not inefficiently duplicate work by reading twice…I can definitely apply many of the topics in this course immediately to improve my efficiency. — Udemy review</em></p><p><em>-------</em></p><p><strong>Get More Out of Your Books</strong></p><p>The endless list of books that you want to read sometimes stunts us from even beginning. And even those who do read regularly do not have a great system for actually getting the most from those books. By implementing the system this course teaches, students will begin to conquer their reading list, and feel confident that the information that they learn will be close by for the rest of their lives. Even in the age of blog posts and reddit threads, people still know their is value in reading the books of experts. Students who take this course will have a system in place to learn from those great minds who put the best of their knowledge into the books they write.</p><p><em>-------</em></p><p><em>The course is well structured and extremely informative. Prof. Zacharias delivery kept me engaged. I have been searching for this type of course for years. I highly recommend this course to anyone that enjoys reading, but more so to students. My next semester starts on Wednesday and I look forward to implementing this system. Thank you!<em> — Udemy review</em></em></p><p><em>-------</em></p><p><strong>Content and Overview</strong></p><p>The course begins with providing you some tips and encouragement to make more time for reading. The more intentional someone is about reading regularly, the more it will become a life-long habit.</p><p>Although not a speed reading course, a section of the course is devoted to helping students to read at a faster pace. I cover both hard copy and eBook reading.</p><p>The actual system of information extraction is thoroughly presented to the student, so that they clearly understand the steps taken through a book to get the information you wish to retain.</p><p><em>-------</em></p><p><em>You will find no hyped up claims of doubling your reading speed in this course. It's a breath of fresh air. Reading can be hard work, but I appreciated the simple, no-nonsense approach of this course. — Udemy review</em></p><p><em><em>I wish I had this information back in high school and college. Perfect system for teachers and public speakers to organize topics and information from textbooks. Thanks Danny! — Udemy Review</em><br></em></p><strong></strong>", 
    "end_date": null, 
    "title": "Reading for Information Extraction: Get More Out Of Books", 
    "price": "35.00", 
    "instructors": "Danny Zacharias", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532168_1aeb_2.jpg", 
    "course_url": "https://www.udemy.com/reading-for-information-extraction-get-more-out-of-books/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T13:51:39Z"
}