{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>The best way to predict your future is to create it.  —</em>Abraham Lincoln</p>  <p>The purpose of this course is to inspire you to conquer your fears and set goals. </p><p>Once we’ve removed fear and replaced it with faith, our courage and confidence will propel us on our quest for our dreams. </p><p>That's where goal setting comes in!</p><p>Goals aren't meant to stress you.</p><p>They are meant to stretch you!</p><p>You can't shrink into greatness you have to stretch.</p><p>\"The problem with most people isn't that they set goals to high and miss it, but they set goals to low and hit it\" Les Brown</p><p>Why not take this course and challenge yourself to set a goal that will make something of you to achieve it.</p><p><strong>Goals are dreams with deadlines.</strong></p><p>The other day I helped a friend set some goals for recording his next album. I suggested he have ten songs done by the end of the year. I know that’s a lot, but I also know that if he chips away at it, he can get very close to that goal—even finishing seven songs would be a big success. The point isn’t to beat yourself up if you don’t make the exact goal; the point is to take action. If he doesn’t shoot for ten songs, he might only have two or three songs completed by the end of the year, which is a long way from a full album. That’s what setting a goal does: it puts some positive pressure on you to take action. </p><p><strong> </strong><strong>Take Action</strong></p><p><strong> </strong><em>Inspiration unused is merely entertainment. </em>—David Bach</p>", 
    "end_date": null, 
    "title": "Set goals to be more productive & achieve anything you want", 
    "price": "20.00", 
    "instructors": "Christopher Greenwood", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761578_f03b_2.jpg", 
    "course_url": "https://www.udemy.com/lifegoals/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T16:47:15Z"
}