{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You've got a great course or book idea.  This one is going to be a home run.  You've done all the research. You start building and 5 months later, you aren't that much closer to shipping. Your <em>real</em> job took over. The family needed a vacation. The car went into the shop. </p><p>While those are all great reasons not to ship, the truth is, without some type of process, anything will can become a distraction and take away your finish line.  All you need is a <strong>step by step</strong> method for getting your online course or book <strong>out the door</strong>.  You'll be surprised at the results of using a process.</p><p>Why does it work so well? When you're able to see each step and the finish line, you know where you are at any point in the process.  You know what is coming next.  In your mind, you begin planning and looking forward to the next step. This motivation is based off of something you can see and virtually touch.</p><p>What about all of those distractions?  The funny thing is, once you get involved and motivated by a tangible, visible process, you'll begin finding ways to finish each step.  A few steps later and you are at the finish line.</p><p>Turn your online course or book into reality.  This is a process you can use over and over for years to come.  Build your course or book empire on a solid foundation.  <em>Ship Your Online Course Or Book With Trello</em> has everything you need to make an idea a reality.</p><p>Oh, and by the way, don't worry if you don't know anything about Trello.  I'll show you what it's all about and how it will help you ship your online course or book!</p>", 
    "end_date": null, 
    "title": "Ship Your Online Course Or Book With Trello", 
    "price": "20.00", 
    "instructors": "Brett Romero", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605966_48d1_3.jpg", 
    "course_url": "https://www.udemy.com/ship-your-online-course-or-book-with-trello/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T15:06:06Z"
}