{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4> Would you like to learn how to <span style=\" color:#ff6600; \">simplify your life</span> in a few but powerful steps?</h4>  <p>  \t                                                                    Would you like to be able to spend more time doing the things you are <strong>passionate</strong> about and be on top of things with <strong>less effort</strong> and struggle?  </p>  <h4><span style=\" color:#ff0000; \">                       The good news is that you definitely can!</span></h4>  <h4><span style=\" color:#ff0000; \"></span><span style=\" color:inherit; \">Learn how to simplify all major areas of your life in easy to follow lectures.</span></h4>  <h4>Discover simple productivity secrets on getting more done with much less work and effort.</h4>  <p>  \t  This is what some students are saying about the course:  </p>  <p>  \t<strong>&quot;<em>A life changer!: </em></strong><em>This course is very interesting, and I must say it’s completely changing the way I think on a daily basis..</em>&quot; - Mr. Jason Attard  </p>  <p>  \t  &quot;<strong><em>Very practical in the busy life we&#039;re living in - an eyeopener to our consumption</em>&quot; - </strong>Mr. Stefan Mifsud  </p>  <p>  \t                                                                    Through this course you can start learning the art of simplicity - or in other words the art of living your day to day life effortlessly and in line with your true purpose and talents.  </p>  <h4><span style=\" color:rgb(255, 102, 0); \">Note: </span><em>This is not some guru stuff but basic principles applied to everyday life that anyone can follow whether you are a student, a busy professional, a working mum or anyone who simply desires to make a positive change in lifestyle.</em></h4>  <p>  \t<strong>Think about it.</strong> This is not about learning how to improve a particular skill - such as your golf swing or your reading speed (although this is good). No. This course is about <strong>a complete lifestyle overhaul </strong>and one which will bring <strong>a total positive repercussion to all aspects of your life</strong>.  </p>  <h4><span style=\" color:#ff0000; \">I can guarantee you this if you are ready to follow this course .</span></h4>  <h4><br>  <p>  \t<strong>Let me ask you a few questions:</strong>  </p>  <ul>  \t<li>Do you feel that you are struggling to cope with everyday tasks at home, work, business and with family? </li>  \t<li>Are you finding it hard to manage your time or your busy schedule? </li>  \t<li>Do you feel that you are not getting the best out of your life?</li>  \t<li>Do you have dreams and personal projects that have been pending for a long time because you are trying to catch up with too many things?</li>  \t<li>Do you feel stressed and exhausted keeping up with a fast-paced hectic lifestyle?</li>  </ul>  <p>  \t                                                    You <span style=\" color:#ff6600; \">CAN</span> start doing more meaningful things in line with your life purpose and talents <span style=\" color:#ff6600; \">TODAY</span> while spending less time and energy coping with things that are  inessential to your happiness and well-being. <strong>Yes I assure you that you can…In a few easy steps!!</strong>  </p>  <p>  \t            This course will teach you how to hack your lifestyle and dramatically change it to be simpler, lighter and happier in <span style=\" color:#ff6600; \"><strong>13 lectures and over 2 hours of material</strong></span> that cover all the major practical areas in life - home, work, business, relationships and parenting.  </p>  <p>  \t<strong>In this course you will learn: </strong>  </p>  <ul>  \t<li>How to get rid of those things that are inessential to your life and that are just weighing you down - The simplest life-changing thing ever!</li>  \t<li>How to <strong>let go of the mental blockers</strong> and beliefs that are holding you from simplifying your life and aligning with your life purpose (Very powerful!)</li>  \t<li>How to <strong>simplify and declutter</strong> you living and working space - an effective how to guide</li>  \t<li>How to manage your time more effectively - little practical secrets that always work like a charm</li>  \t<li>How to organise yourself in <strong>super effective routines</strong> that will minimize work and clutter to a bare minimum</li>  \t<li>How to <strong>focus on what is essential</strong> for yourself and loved ones - Live without needless worries, hassle and problems</li>  \t<li>Discover effective ways to <strong>simplify your work and business</strong> through smart use of technology and leveraging on other people’s skills!</li>  \t<li>How to stay focused and <strong>avoid distractions</strong> from information overload</li>  \t<li>Learn how to <strong>simplify your decision making</strong> and make elegant choices effortlessly</li>  \t<li>How to focus on things that are in line with your purpose and <strong>getting more done with less work</strong> and effort</li>  \t<li>How to <strong>smartly prioritise your tasks</strong> at work or business and keep on top of things with less stress</li>  \t<li>A smart approach to <strong>manage your email</strong> and avoid letting your inbox take over you</li>  \t<li>Understand the simple but powerful rules of creating <strong>healthy &amp; loving relationships</strong></li>  \t<li>How to bring simplicity into parenting - a guide to help you <strong>simplify parenting</strong> &amp; understand what is best for your children</li>  \t<li>and more!</li>  </ul>  <p>  \t                                                      Leading a simple effortless life is a lifestyle choice you have full power over <span style=\" color:#ff6600; \"><strong>anytime</strong></span> despite of how many barriers you ‘think’ there are holding you from it. The Art of Simplicity course is designed to help you break down those barriers and guide you to practically move step by step towards a simpler, lighter and happier life.  </p>  </h4>", 
    "end_date": null, 
    "title": "Simple Living Hacks - Declutter, Organise & Get More Done ", 
    "price": "20.00", 
    "instructors": "Gilbert Ross", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/202704_76c2_16.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-simplicity-focus-productivity-freedom/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-21T19:04:20Z"
}