{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Sketchnoting is a recent name given to a method of taking notes that involves text and simple images. Some people refer to these drawing as doodles!</p>\n\n<p>Research has proven that when we write notes with our hands and draw images about things that we are listening or observing, the learning happens faster and retention of that information is much higher than taking notes on a computer or just writing textual notes.<br></p>\n\n\n\n\n\n<p>Sketchnoting involves using our left brain, right brain and our hands to take notes. This means that we are more present in the moment, are paying more attention to things in front of us, synthesizing the information gathered and are then representing it on paper using text and and sketches.</p>\n\n\n\n\n\n<p>In this class we look at simple ways of sketching  or drawing things using few simple shapes and easy ways of emphasizing text to make our sketchnotes much more interesting, readable and memorable.</p>\n\n\n\n\n\n<p>You do not need any artistic skills to start sketchnoting as we are capturing ideas and not creating \"ART\".</p>\n\n\n\n\n\n<p>I also give you tips how to organize content on a sketchnote and how to make sketchnote more presentable using bullets, boxes, icons and arrows.</p>\n\n\n\n\n\n<p>Anybody who wants to learn to listen more effectively, learn new things at a faster pace and wants to present their ideas more effectively to others, will benefit from this course. It does not matter if that person is a student or a teacher, a doctor or an engineer, a consultant or a business owner, a freelancer or a home maker. Anybody who has ideas, can learn to make sketchnotes and reap it's benefits along the way.</p>\n\n\n\n\n\n<p>Anyone who loves to draw, sketch, doodle and express their thoughts on paper will love this class.</p>", 
    "end_date": null, 
    "title": "Sketchnoting: An effective way of expressing and documenting", 
    "price": "30.00", 
    "instructors": "Mandar Marathe", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/876454_e2ce_2.jpg", 
    "course_url": "https://www.udemy.com/sketchnoting/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-13T03:55:40Z"
}