{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>We, the people, get most of our knowledge and valuable information from the books for many years now. And even the development of modern technology has not changed the process. Books became electronic, interactive, but they still remained books.</p>  <p>How do we read business books?</p>  <p>You’ve read the book, you liked it, you were inspired by new ideas, but this euphoria will pass in a day or two and you will forget most of the ideas.</p>  <p>This course will help you to read business books in much more productive way.</p>      <p><strong>Learn to get the most out of your reading and to make your communication with the business books much more productive.</strong></p>    <p>In this course, you'll learn:</p>  <ul><li>How to choose the right useful business books</li><li>How to design the structure of your card-file of ideas</li><li>How to make real card-file from materials on hand</li><li>How to start filling your card-file of ideas</li><li>How to use your card-file of ideas for your needs</li><li>How to calculate the RUI Index of the book</li></ul><p><br></p><p><strong>This course is not just about how to read business books. First of all, it is about how to increase your productivity and effectiveness. </strong></p><strong>  </strong><strong>  </strong><ul><li>16 Video Lectures</li><li>3 Quizzes</li><li>Special form to calculate the RUI Index for each particular book</li><li>Format of card for card-file of ideas</li><li>2 Bonus Lecture<strong><br></strong></li></ul>", 
    "end_date": null, 
    "title": "Smart Reading: How To Get The Most Out Of Your Reading", 
    "price": "20.00", 
    "instructors": "Evgeniy Bondarenko, Anna Nikitenko", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449390_a290_4.jpg", 
    "course_url": "https://www.udemy.com/smart-reading-how-to-get-the-most-out-of-your-reading/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T12:53:01Z"
}