{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>****Richard has successfully taught over 25,000 people to speed read!</strong><strong>****</strong></p><p><strong><strong><em>Come with me on a journey to fast-track your reading and comprehension!</em></strong><br></strong></p><p>Most people read consciously, which means they use 5% of their mind. What would happen if you could use 25% of your mind? Or 50%? Would you like to <strong>effortlessly increase your comprehension level five times or even ten times</strong>?</p><p>Richard taught high school math for 5 years before becoming Head Instructor for <strong>Speed Reading Toronto</strong>, Canada. He next became a certified Master Hypnotist/Relaxation. Combining the two professions, it dramatically shortened his student's learning curve for Speed Reading.</p><p>In this experiential course (Yes, you have to do the exercises and practise), Richard unlocks <strong>the secret of your mind</strong> in a gentle, effective manner that will have you whipping through memos, emails, technical manuals and, yes, even reading and enjoying your favorite books in record time!</p><p>Untrained readers use the central focus of their eyes, but not \"Horizontal Peripheral Vision\" as they read <strong>losing about 50% of their reading speed</strong>. In this course, we will show you a easy method to essentially doubling your reading speed, by removing this loss.<br></p><p>The untrained reader tends to consciously re-read lines and back-skip (subconscious rereading due to their eyes jumping around) for up to 30% of their reading.<br></p><p><strong>What you will learn:</strong></p><p><strong>1) The importance of Hand Motion</strong>. This fundamental of Speed Reading in discouraged in schools, oddly enough. Yet you will double your speed simply because this active reading secret prevents your eyes from doing the one thing eyes like to do that slows your reading to a snail's pace. (Lecture 7)</p><p><strong>2) How to Super-Charge your Memory.</strong> What is the point of reading faster if you forget faster. (Lecture 12)</p><p><strong>3) Relaxation and Visualization. </strong>Stress interferes with your mind's natural brilliance. Our society is so stressful, you don't even know you are stressed out and that your mind is performing at extremely low efficiency. Do you run faster carrying a 50 pound backpack or without it? You read carrying a 50 pound 'backpack'. Time to let it go. (Lecture 16)</p><p>This course is perfect for you if you always thought there was <strong>a better way to acquire knowledge and keep it.</strong></p><p>But, if you want my personal \"insider\" information - remember <strong>I</strong>'<strong>ve helped over 125,000 readers, just like you, dramatically increase their reading speed and retention</strong> - you need to get this course now ... right this minute.</p><p><strong>Every minute you delay is actually COSTING you time and money....</strong></p><p><strong>Register for Speed Readnig Simplified Today!</strong></p>", 
    "end_date": null, 
    "title": "Speed Reading Simplified", 
    "price": "40.00", 
    "instructors": "Richard Walton, Scott Paton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/766560_daa0.jpg", 
    "course_url": "https://www.udemy.com/speed-reading-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-18T14:19:56Z"
}