{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course I'll share with you the things I've learned about stress and how to handle in during a decade of front line operational work in the emergency services. In this course you'll learn:</p><p><br></p><ul><li>Stress removal and reframing</li><li>How to meet pressure with pressure of your own to achieve high performance</li><li>Simple relaxation and refocusing techniques</li><li>The techniques Firefighters use to stay calm and focused in life or death situations.</li></ul><p>This course is for anyone who experiences stress or pressure, whether at home, at work, in sports… <br></p>\n\n<p>This course draws on years of firefighting, leadership and teaching experience to provide practical techniques for dealing with high pressure situations. </p>\n\n<p><strong>By following the video lectures students will learn…</strong></p>\n\n<p><strong>How to use a proven psychological technique to change their perception of stress<br></strong></p>\n\n<p><strong>Why stress is seen as negative - and what to do about it!</strong><br></p>\n\n<p>          The background to studies of this subject. </p>\n\n<p>The neuroscience behind brain behavior under pressure.</p>\n\n<p>You will also learn several practical techniques to lift your performance to the next level. and to combat stress and pressure, wherever you experience them.<br></p>\n\n<p>New lectures are already in the pipeline for this course, and you will get access to them for free if you're already signed up for the course! So go ahead, make a good decision right now, click the button to enroll, and let's get working on putting your performance under pressure where you want it to be!</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Stress And Pressure: Solutions From The Emergency Services", 
    "price": "20.00", 
    "instructors": "Dr David Murphy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631150_8008_4.jpg", 
    "course_url": "https://www.udemy.com/perform-under-pressure/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T10:08:55Z"
}