{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>Bist du manchmal total beschäftigt oder gestresst und doch schaffst du es nicht, die wirklich wichtigen Aufgaben zu erledigen?</li><li>Hättest du gerne mehr Zeit für deine Familie, deine Freunde und deine Hobbies?</li><li>Kommst du abends oft mit dem schlechten Gefühl nach Hause, dass du nicht genug geschafft hast?</li></ul><p>Dann ist dieser Kurs für dich. </p><p>In diesem Kurs, bringe ich dir die Strategien bei, die ich benutze, um jede Woche viele Stunden Zeit einzusparen und sicherzustellen, dass ich meine Zeit mit dem verbringe, was wirklich wichtig ist. Ich zeige dir Programme, die ich benutze, sowie Tipps und Tricks, um unnötiger Zeitverschwendung vorzubeugen.</p><p>Nach dem Kurs wirst du unter anderem in der Lage sein, deinen Tag effektiv zu planen, und dich auf die wichtigsten Dinge zu konzentrieren, die du zu erledigen hast. Du wirst deinen Arbeitstag auf deine Tagesform anpassen, bei vielen Aufgaben Zeit sparen und Ablenkungen jeglicher Art besser vermeiden können. Zudem wirst du deine Emails so effektiv managen wie nie zuvor.<br></p><p>Der Kurs wird begleitet von einem umfangreichen Arbeitsbuch, so dass du nicht nur zuhörst, sondern auch selber handelst und tatsächliche Veränderungen anstoßen kannst, die dich produktiver, effektiver und effizienter machen. </p><p>Belege jetzt meinen Kurs, wenn du endlich die Kontrolle über deine Zeit zurückerlangen willst!</p><p><br></p>", 
    "end_date": null, 
    "title": "Superproduktiv werden! Tipps, Tricks, Tools und Strategien", 
    "price": "50.00", 
    "instructors": "Dr. Johannes Metzler", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/748718_e27f.jpg", 
    "course_url": "https://www.udemy.com/produktivitaet-tipps-tricks-tools-strategien-zeitmanagement/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-01T10:16:49Z"
}