{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Los smartphones y tablets ofrecen un mundo de posibilidades que bien podemos aprovechar para facilitarnos la vida y mejorarla. En este taller, veremos varias formas de sacar provecho de estos aparatos que solemos llevar encima</p><p>Ya que estamos todo el día pegados a ellos... ¿Por qué no aprovecharlos mejor?</p><ul><li>Veremos como hablar y transcribir textos o dar órdenes a nuestros dispositivos</li><li>Guardaremos notas de voz o llamadas telefónicas</li><li>Capturaremos información en varios formatos con gran rapidez y eficacia</li><li>Usaremos el dispositivo como un escáner de documentos</li><li>Haremos búsqueda o borrado de dispositivo en caso de pérdida</li><li>Realizaremos la compra fácilmente o manejaremos cualquier lista</li><li>Salvaremos la información en la nube y nos mentalizaremos de que no se deben usar como almacén</li><li>Escucharemos cualquier tema musical o programa de radio sin necesidad de descargarlo</li><li>Sabremos lo que se debe y no se debe hacer para estar tranquilos</li></ul><p>Quién debería realizar este curso? ¿Quién no debería?<br></p><ul><li>Te interesa este curso si quieres aprovechar las posibilidades que ofrecen estos dispositivos y ya estás familiarizado con su manejo básico</li><li>No deberías realizar este curso si no estás familiarizado con estos dispositivos. Dispones de un taller de iniciación totalmente gratuito</li></ul><p>¿Qué tienen que saber o hacer los estudiantes antes de comenzar este curso?</p><ul><li>Es necesario disponer de un smartphone o tablet Android para ir practicando lo explicado</li></ul>", 
    "end_date": null, 
    "title": "Tablet y smartphone Android. Un mundo de posibilidades", 
    "price": "20.00", 
    "instructors": "Juan Manuel Ríos", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612090_ae75_3.jpg", 
    "course_url": "https://www.udemy.com/tablets-y-smartphones-android-un-mundo-de-posibilidades/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T20:31:57Z"
}