{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Are you sometimes not in control of your life?<br></strong><strong>Do you sometimes find yourself agreeing to things... and then regretting it?<br></strong><strong>Are you sometimes overwhelmed by life's choices and want to know which to take?</strong></p><p>Of course.</p><p>But now there are answers<strong>. . .</strong></p><p><em><strong>'Time Management on Steroids'</strong></em> is how one person described this programme.</p><p>But that's wrong. You won't learn to manage your time. <br>You'll learn how to <strong>TAKE BACK CONTROL OF YOUR LIFE</strong>. </p><p>This means that you can start to say Yes to the right things and No to the rest. And that means <strong>more time for what matters and less stress from what doesn't</strong>.</p>  <p>  \t    Too many people find they need more time in their lives to do the things they want. And time management is not giving them enough of an answer.  </p>  <p>  \t    Focusing on doing things effectively, just means you get more <em>things</em> done. Learning what to say Yes to and what to say No to, means getting <strong>the right things</strong> done and achieving more... by doing less.  </p>  <p>  \t    But do you find the tiny little word 'No' alarmingly difficult to say? If you worry that it sounds negative, that people won't like you, that you'll miss an opportunity, or that something will go wrong if you say No, then you need this course.  </p>  <p>  \t    Because <strong><em>these fears mean that you are no longer in control of your life</em></strong>.  </p><p><br></p>  <p>  \t<strong>Learn when to say NO and how to say NO.</strong>  </p><p><strong><em>If you don't, you'll regret it, every time you feel trapped into saying 'Yes'.</em></strong></p><p><strong><br></strong></p>  <p>  \t    This course is delivered entirely as high quality videos delivered by author and professional speaker, Dr Mike Clayton. You will get unlimited lifetime access to 27 videos with nearly three-hours of high quality content. And I'll be adding more bonus videos from time to time too - which will appear, at no extra cost, in your course library.  </p>  <p>  \t<strong>Your Unconditional, No-questions, 30-Day Guarantee</strong>  </p>  <p>  \t    I am so confident that this course will change your life that I  offer you an unconditional, no questions asked, full 30 day money-back-in-full guarantee.  </p>  <p>  \t<strong>Please compare this course...</strong>  </p>  <p>  \t... with other courses promising to teach you how to say No. I think you will find <em><strong>far more breadth, depth, and psychological rigour</strong></em> in this course. And if you enroll and you don't agree: there's always my 30-Day Guarantee.  </p>  <p>  \tI will also be on hand to answer your questions if you get stuck, puzzled, or just want to know more. As a professional trainer, this is what I do, and I promise to respond within 24 hours of your question arriving with me from Udemy.  </p>  <p>  \t<strong>Enroll Now</strong>  </p>  <p>  \t    Enroll for this course now, so you can start to regain control of your life straight away.  </p>", 
    "end_date": null, 
    "title": "Take Back Control of Your Life: When and How to Say No", 
    "price": "25.00", 
    "instructors": "Dr Mike Clayton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392764_90bc_2.jpg", 
    "course_url": "https://www.udemy.com/take-back-control-of-your-life-when-and-how-to-say-no/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T05:50:06Z"
}