{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t   Dear Friend,  </p>  <p style=\"\">  \t   My name is Miroslav Zaporozhanov,  </p>  <p style=\"\">  \t   Over the past few years, I’ve learned concepts and strategies that have turned me into a Time Management Ninja and helped me at least DOUBLE my productivity (and start two 100k business while working full-time).  </p>  <p style=\"\">  \t   In addition I lost 10 pounds of fat, improved the way I FEEL about myself and sharpened my FOCUS on the things that are most important in my life.  </p>  <p style=\"\">  \t   In fact those methods have changed me for the better. I’d like to share with you the story of how I discovered how EASY it was to turn my life around and start having More Time and More Money Than Ever Before – and how YOU can use those techniques to manage your time better and get more done in 2 hours than most people do in 2 days…all while improving your health and mental focus.  </p>  <p style=\"\">  \t   Let me tell you my story...  </p>  <p style=\"\">  \t   A couple of years ago, I found myself in an interesting situation…  </p>  <p style=\"\">  \t   I was working on my full-time job for a big Consulting firm.  </p>  <p style=\"\">  \t   I had a successful career consulting the billion dollar energy companies out there – Shell, Conoco Phillips, Chevron, RWE, E.ON.  </p>  <p style=\"\">  \t   Then at some point I realized I wanted to launch my own business, and take advantage of the skydiving market which was not served well.  </p>  <p style=\"\">  \t   The challenge I was facing was that I was already working at least 60-80 hours per week on my CURRENT job.  </p>  <p style=\"\">  \t   On top of that as most consultants, I was flying around like crazy – 2 to 4 flights per week.  </p>  <p style=\"\">  \t   It was exhausting.  </p>  <p style=\"\">  \t   Here’s what my day actually looked like…  </p>  <p style=\"\">  \t   I would wake up in my hotel room around 7 am, go straight to my email, and get “sucked in”.  </p>  <p style=\"\">  \t   Soon I was fighting fires and responding to the requests of others.  </p>  <p style=\"\">  \t   Often before I had a chance to consider what was actually important to do that day, I’d get a phone call I had to take, or a conference call would come up.  </p>  <p style=\"\">  \t   Somewhere in there I’d check out my Facebook &amp; Twitter feed and maybe catch up on the news.  </p>  <p style=\"\">  \t   Then go in a meeting or a conference call.  </p>  <p style=\"\">  \t   And then I’d go back and check my email.  </p>  <p style=\"\">  \t   Lather, rinse and repeat.  </p>  <p style=\"\">  \t   Before I knew it, the day was nearly over, my energy was gone, and I’d realize I hadn’t actually done anything to move things further with my business idea.  </p>  <p style=\"\">  \t   The stuff that was really important to help me escape the rat race.  </p>  <p style=\"\">  \t   I was mistaking activity and being busy with productivity and getting the results and life I want.  </p>  <p style=\"\">  \t   Sound familiar?  </p>  <p style=\"\">  \t   What’s worse is that this had literally become a 100% habitual.  </p>  <p style=\"\">  \t   And this process of getting “sucked into” my day spilled over into literally all areas of my life – and affected me on every level.  </p>  <p style=\"\">  \t   When I would get sucked in, I wouldn’t consciously remember to do things like exercise, eat right, and renew myself. I would try to “squeeze in” these things…between emails, meetings and phone calls.  </p>  <p style=\"\">  \t   And you know what that feels like right?  </p>  <p style=\"\">  \t   I would forget to eat a meal, and by the time I realized I was hungry I’d be STARVING.  </p>  <p style=\"\">  \t   What do you eat when you are starving? Exactly. Junk.  </p>  <p style=\"\">  \t   And a lot of it.  </p>  <p style=\"\">  \t   I wouldn’t exercise regularly.  </p>  <p style=\"\">  \t   I wouldn’t relax regularly.  </p>  <p style=\"\">  \t   I didn’t even care I was overweight.  </p>  <p style=\"\">  \t   I didn’t have time to care.  </p>  <p style=\"\">  \t   What was I going to do about it anyway?  </p>  <p style=\"\">  \t <strong style=\"\">I Didn’t Have Time to Solve My Problems With Time!</strong>  </p>  <p style=\"\">  \t   Where was I going to find the time to start and run my own company?  </p>  <p style=\"\">  \t   I needed a new model – and I needed it fast!  </p>  <p style=\"\">  \t   Fortunately, One day as I was searching for videos on Time management in YouTube I bumped onto a guy who was talking about the concept of managing not time – but ENERGY.  </p>  <p style=\"\">  \t   This concept made a lot of sense to me because it was backed up by scientific evidence that our minds are BUILT to focus <strong style=\"\">on one thing at a time (sound too obvious right) – </strong>but that we lose this ability over time by multi-tasking and allowing ourselves to be distracted constantly.  </p>  <p style=\"\">  \t   If we could make it a RITUAL to focus on one important thing at a time, eventually this could become a HABIT – and success would follow.  </p>  <p style=\"\">  \t   Well, this was the missing part I needed to complete my “Time management” puzzle.  </p>  <p style=\"\">  \t   I’ve now created what I consider to be one of the most powerful, in-depth, and GUARANTEED way to increase YOUR productivity, energy and financial success… right from the comfort of your own home.  </p>  <p style=\"\">  \t   Let me tell you about it.  </p>  <p style=\"\">  \t   Announcing:<strong style=\"\"> The Ultimate Productivity and Time Management Blueprint</strong>  </p>  <p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t   The System To Help You Organize your Life And Get More Done in 2 Hours Than Most People Do in 2 Days  </p>  <p style=\"\">  \t   The Ultimate Productivity and TM Blueprint goes far BEYOND traditional “time management” programs, because it focuses on helping you identify the most important activities in your life, eliminate the blocks that keep you from doing them and turn them into HABITS that you do EVERY SINGLE DAY NATURALLY.  </p>  <p style=\"\">  \t   Here’s what you are going to learn in this Program, section by section…  </p>  <p style=\"\">  \t <strong style=\"\">Introduction and </strong><strong style=\"\">Foundational Trainings (Module 1)</strong>  </p>  <p style=\"\">  \t   This Program begins with an Introductory video training  </p>  <p style=\"\">  \t   In this video I am going to introduce you to the BEST way to go through the whole training so you take the most out of it.  </p>  <p style=\"\">  \t   The next nine videos are the first module of the program, and they lay the foundation.  </p>  <p style=\"\">  \t   In this first module you are going to be introduced to what I believe is the most powerful set of methods for creating life-long productivity. This is the material that changed the game” for me personally. (and allowed me to lose 10 pounds and get into the best physical shape of my life)  </p>  <p style=\"\">  \t   Some of the thing you will learn during the first module of trainings are:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t   ·A Billionaire&#039;s <strong style=\"\">SECRET formula</strong> for building powerful habits (I will also teach you the FIVE best ways to build any habit you want in your life)  \t</p>  \t<p style=\"\">  \t\t   ·How to completely eliminate “busy work” and set conditions in your life that make it so you cannot do anything but focus on the important things  \t</p>  \t<p style=\"\">  \t\t   ·How your nervous system translates time and how this impacts every decision your are making throughout the day  \t</p>  \t<p style=\"\">  \t\t   ·How to seize your mornings and why this is the equivalent of that sound financial advice to pay yourself before you pay your bills (here I will also tell you why Steve Jobs was so productive)  \t</p>  \t<p style=\"\">  \t\t   ·What drains your energy and how to have at LEAST twice more energy than ever more  \t</p>  \t<p style=\"\">  \t\t   ·How to find your highest leverage activities – the ones that bring you the most rewards… and make SURE you do them every single day no matter how much busy work… and “clutter” gets thrown at you.  \t</p>  \t<p style=\"\">  \t\t   ·A simple exercise to help you identify which activities in your business give you the most LIFETIME value… and also spot those which rob you of value (This is a secret to prioritizing your activities that the smartest – and wealthiest – business owners swear by)  \t</p>  </ul>  <p style=\"\">  \t <strong style=\"\">Module 2: </strong><strong style=\"\">How to Plan like a Serial Entrepreneur</strong>  </p>  <p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t   In the second module, after you’ve learned the Foundation of your new productive you, I’m going to teach you how to take your “newfound power” of energy and productivity… and how to put this into a plan that you actually execute in MUCH less, time, effort, and hassle than you thought was possible.  \t</p>  \t<p style=\"\">  \t\t   Here I’m going to walk you through a set of 9 videos that will teach you how to structure your day and week so that you get at least TWICE as much done every single day.  \t</p>  \t<p style=\"\">  \t\t   I am going to teach you the secrets of:  \t</p>  \t<p style=\"\">  \t\t   ·the planning system that will help you take a &quot;helicopter view&quot; of your life, so that you can bring things back into balance and produce the results you want in the area of life that is most important for you  \t</p>  \t<p style=\"\">  \t\t   ·a way to define up front all of the areas of your life that are important to you and what you want in each area - before you actually create the plan for your time  \t</p>  \t<p style=\"\">  \t\t   ·How to Transform Stress in planning into Success with a single concept  \t</p>  \t<p style=\"\">  \t\t   ·The five EASY and simple steps to creating plans for your days, weeks and projects which you execute with excitement (Learn How to never abandon your plan again)  \t</p>  \t<p style=\"\">  \t\t   ·The 1 Page Miracle Planner Millionaires use to schedule their day  \t</p>  </ul>  <p style=\"\">  \t <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t <strong style=\"\">Module 3: </strong><strong style=\"\">Productivity and Time Management Hacks </strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t   In this third and final module I will give you more than 10 different techniques that will turn you into a Time Management Ninja and will help you unlock your potential so you find the STRAIGHT PATH to your dreams. (Sound cheesy but it was true for me. Most of the time success is counter intuitive)  \t</p>  \t<p style=\"\">  \t\t   I am going to teach you:  \t</p>  \t<p style=\"\">  \t\t   ·The ugly frog strategy that have helped hundreds of solo Entrepreneurs and the 90/90/1 rule that will set you for an extremely productive day  \t</p>  \t<p style=\"\">  \t\t   ·How to boost your mental performance with easily embraceable, common-sense tactics that can have an immense impact on the long-term health of your most important natural resource  \t</p>  \t<p style=\"\">  \t\t   ·How to have better brain health avoiding the biggest productivity killer in THREE easy steps  \t</p>  \t<p style=\"\">  \t\t   ·The FIVE easy ways to instantly improve your focus and attention  \t</p>  \t<p style=\"\">  \t\t   ·The FIVE steps time management technique used by some of the most creative &amp; productive business people, artists, authors, students, etc.  \t</p>  \t<p style=\"\">  \t\t   ·SIX simple rules to instantly enable you  to manage your inbox EFFECTIVELY and ensure it&#039;s not managing you  \t</p>  \t<p style=\"\">  \t\t   ·THREE simple approaches to STOP procrastinating and get things done  \t</p>  \t<p style=\"\">  \t\t   During this program I’m also going to teach you MANY other principles, mindsets, and step-by-step techniques for increasing your energy and becoming FAR more productive.  \t</p>  \t<p style=\"\">  \t\t   Here are a few other things I’m going to show you:  \t</p>  \t<ul style=\"\">  \t\t<p style=\"\">  \t\t\t   ·Simple and effective tricks on coping with interruptions and distractions  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·Tired of meaningless time-wasting meeting that don’t lead to results? I will show you FOUR ways on how to run highly efficient and effective meetings  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·You&#039;ve been interrupted and feel hard to get back where you were? I will give you THREE simple ways to get your focus back after  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·Thinking too much SEVEN steps strategy to making better decisions  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·Want to read more books this year? I will show you how to read at least TWICE faster  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·Always waiting for the “Right Time”? I will show you the reason why we procrastinate and what to do about it  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·THREE suggestions for improved nutrition  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·How to improve the quantity and quality of your focus that will ultimately help you not only become more productive, but also become more HAPPY  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·The secret to having MORE willpower and brainpower and why we break our diets in the evening?  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·Do you thing multitasking is the way to get a lot done? Thin again. Research shows you are LESS efficient when multitask. Here’s how to focus yourself like a laser-beam on one task at a time…  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·The “Grey Zone” is the place in your life where you don’t do things completely - multitasking is a common example. Here’s how to get out of the “Grey Zone” completely, for the rest of your life, and get more things done than ever before.  \t\t</p>  \t\t<p style=\"\">  \t\t\t   ·Many “time management experts” talk about the need to prioritize, but few give a precise system – and few still have systems that are “doable” Here’s a simple process you can use right away to clearly focus on your highest leverage areas – and then make SURE you work on these every day.  \t\t</p>  \t</ul>  </ul>  <p style=\"\">  \t <strong style=\"\">The Most Important Question:</strong>  </p>  <p style=\"\">  \t <strong style=\"\">Is This Program Right For YOU?</strong>  </p>  <p style=\"\">  \t   This program might be right for you and it might not.  </p>  <p style=\"\">  \t   By now, you’ve probably started to get a sense of whether or not this program can help you get what you want, increase your energy, and become more productive.  </p>  <p style=\"\">  \t   If it’s right for you that’s great.  </p>  <p style=\"\">  \t   If it’s not, that’s also OK.  </p>  <p style=\"\">  \t <strong style=\"\">Who This Program Designed to Help MOST</strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t   My initial thought was to create a program that everyone can use. But life is so colorful and most of us live it in a different way.  </p>  <p style=\"\">  \t   So in order to create a program that will change your life I had to know what your life is mainly about.  </p>  <p style=\"\">  \t   That’s why I’ve created this program to help a few very specific types of people.  </p>  <p style=\"\">  \t   If you are one of these types, then I highly recommend that you consider investing in this program.  </p>  <p style=\"\">  \t   Let me explain who will get the MOST from this course…  </p>  <p style=\"\">  \t   1) Wantepreneurs  </p>  <p style=\"\">  \t   Are you a wantrepreneur? A wantrepreneur is someone who longs to be his or her own boss.  Does that describe you?  </p>  <p style=\"\">  \t   The corporate world is uncomfortable and unfulfilling, but you keep playing the role of a wage slave. You say I will wait for the next “Instagram” idea to strike me. And it better be soon!  </p>  <p style=\"\">  \t   You’re a business book NUT (like me). You’ve read them all (like me). Yet you don’t have the time to follow through (as I used to). You are paralyzed. You are too busy to think clearly and act upon your ideas.  </p>  <p style=\"\">  \t   You are simply too busy to change your life.  </p>  <p style=\"\">  \t   See I’ve been there. I’ve cried (yes, I admit it). I’ve struggled. I’ve been in this never ending vicious circle.  </p>  <p style=\"\">  \t   If this sounds like you  Then let me help you.  </p>  <p style=\"\">  \t   The strategies and techniques I’ve included in this course have helped me escape the society trap and make that leap.  </p>  <p style=\"\">  \t   I’ve never been happier.  </p>  <p style=\"\">  \t   And that’s exactly how I want you to feel.  </p>  <p style=\"\">  \t   2) Work at Home Business Owners  </p>  <p style=\"\">  \t   Those of us that work from home are very fortunate – be we also have to deal with a set of problems and challenges that most other professionals can’t relate to.  </p>  <p style=\"\">  \t   The techniques you are going to learn inside this program were CREATED by someone who works from home (hello, that’s me) – and designed to help others who must manage THEMSELVES and their own productivity  </p>  <p style=\"\">  \t   If you work from home (or would like to start your own home-based business), then this program will be VERY valuable to you.  </p>  <p style=\"\">  \t   3) Small Biz Owners &amp; Serial Entrepreneurs  </p>  <p style=\"\">  \t   If you run your own business or have a couple of businesses like me, you frequently have to wear many hats.  </p>  <p style=\"\">  \t   You have to perceive opportunities, plan, organize resources, oversee production, marketing, and also network with others.  </p>  <p style=\"\">  \t   Sometimes it may seem like there are never enough hours in the day.  </p>  <p style=\"\">  \t   The pressure to make sure everything&#039;s running smoothly means days go quickly and the to-do list easily gets lost amid ever-changing priorities.  </p>  <p style=\"\">  \t   This program will help you overcome some of these challenges that seem IMPOSSIBLE to solve… and do it QUICKLY.  </p>  <p style=\"\">  \t   If you’re a small biz owner or entrepreneur you will find that the course will give you a powerful set of tools to focus and get things done in your busy day-to-day environment.  </p>  <p style=\"\">  \t   4) Bloggers, Authors, Coaches  </p>  <p style=\"\">  \t     The techniques in the Ultimate Productivity and TM Blueprint are particularly well-suited to teachers as they allow you to switch back and forth between tasks that require a combination of focus and creativity (writing, teaching, coaching) and tasks that require a lot of ‘changing gears’ quickly (like returning calls, answering emails, etc.)  </p>  <p style=\"\">  \t   If you found yourself saying “That sounds like me!” to one or more of these descriptions, then this program will be VERY valuable to you.  </p>  <p style=\"\">  \t <strong style=\"\"></strong>So if you want to Stop Being The Embarrassing Joe Who Never Does What He Says He Will Or Follows Through On Your Personal Commitments .....or just want to be the most productive version of yourself...hear me out:  </p>  <p style=\"\">  \t       This course is for <strong style=\"\">YOU</strong>! And will teach you how to take control over your time, attention, and your results.  </p>  <p style=\"\">  \t       You will learn how to become a Productivity Hacker and do the high value work that leads to rapid results, more profit and higher income and more free time for your family, friends and hobbies.  </p>  <p style=\"\">  \t       This sounds pretty good right?  </p>  <p style=\"\">  \t       Here’s what we need you to do to <strong style=\"\">to bridge the gap between your goals, dreams, desires, and REALITY…</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t       1.Scroll back up to the top and click the “Take This Course&quot; Button  \t</p>  \t<p style=\"\">  \t\t       2.If you’re already a member of Udemy, this will take you to the payment page - IF YOU’RE NOT, you will be prompted to sign up for Udemy (it’s really good and will never spam you so YOU SHOULD SIGN UP)  \t</p>  \t<p style=\"\">  \t\t       3.Enter in your credit card or Paypal details and press “Complete Purchase” (then do a little dance because you just made a great decision)  \t</p>  \t<p style=\"\">  \t\t       4.Udemy will confirm your purchase  \t</p>  \t<p style=\"\">  \t\t       5.You will immediately get access to the course and subsequently learn how to become organized, creative, effective and productive in every area of your life.  \t</p>  \t<p style=\"\">  \t\t       6.You’ll have to think of new dreams because you will be on your way of achieving the ones you have rigth now!  \t</p>  </ul>  <p style=\"\">  \t       Today is the best day. So stop procrastinating and watch the Ultimate Productivity and Time Management Blueprint.  </p>  <p style=\"\">  \t     And I know that within 30 days time you are gonna write back to us (and we will respond) and tell us about all the great things you’ve been doing, and how much more you’ve able to get done in your life. So this is really the first step in the next phase of your life.  </p>  <p style=\"\">  \t       So get to it by taking this course today! See you on the other side.  </p>  <p style=\"\">  \t P.S. One last thing… if you wanted, you could probably figure out all this stuff on your own. I know, because that’s what I did. But it probably cost me lots of struggle and money when I add up what I’ve invested, spent, tested and <strong style=\"\">WASTED</strong> figuring out everything by myself.  </p>  <p style=\"\">  \t So you can invest a ton of money and time trying to figure out what works, or you can short-circuit that whole process… and then you can be putting this material to work in your life starting tomorrow  </p>", 
    "end_date": null, 
    "title": "The Ultimate Productivity and Time Management Blueprint", 
    "price": "20.00", 
    "instructors": "ZapoMedia Academy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/196158_fb48_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-productivity-and-time-management-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-09T08:07:19Z"
}