{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Getting into business is tough. Surviving, and thriving in business is even more challenging. That's why we created this course. To share with you 3 practical mindsets and 6 points of leverage to instantly give you more control of your business and life.</p><p><strong>Master the strategies and attitudes of some of the worlds most productive and effective business people with this streetwise yet holistic training course.</strong><br></p><p><em>Learn how to.</em></p><ul><li>Train Your Brain to Gain and Earn.</li><li>Use Your Body to Supercharge Your Energy and Vitality Levels.</li><li>Surround Yourself with these types of People and Watch Your Confidence and Charisma and Competence Soar.</li><li><span></span>Plan like a professional Project Manager and Ensure all Your Projects come in on Time, within Budget, and to Your Stakeholders Expectations.</li><li>Front up to and Solve All Your Challenges with this Simple yet Dynamic 5 Step Problem Solving Process.</li><li>Discover and Exploit the Ultimate Time Management Tool.</li></ul><p><strong>Learn Why Time Management is the Most In-Demand Executive Training Course on the Planet.</strong></p><p><strong></strong>It's often said that money is the greatest asset in a business. When you think about it, your time is a far more precious resource. You can always replace money, but once time elapses, it's gone forever.</p><p> And yet so many people bemoan the fact that they haven't enough time to achieve their dreams. The reality is that they have exactly the same time as Bill Gates, Warren Buffet or even Richard Branson. They are just not using it in an optimal way. </p><p>That's the purpose of this course. To share with you the mindsets, the routines and the practices of those who have succeeded in creating a rich life - financially, emotionally and physically.</p><p><strong>What's different about this course is that it recognizes that effective time management is first and foremost an attitude of discipline. Before you begin learning new planning techniques you first need to commit to disciplining yourself in 6 key areas.</strong><br></p><ul><li><strong><em>Psychology</em>. </strong>Really productive people realize that productivity begins and ends in your mind. They learn to harness the almost infinite potential of their minds. In this course learn that no <strong>thought</strong> ever resides in your mind rent free. You will learn that by changing the quality of your thoughts you will change the quality of your results and productivity. Learn how by becoming conscious of your <strong>choices </strong>you can begin to instantly transform your output. Learn how to<strong> program</strong> your<strong> subconscious mind</strong> with clear intentions and to eliminate those <strong>non-productive beliefs</strong> and programs that have been responsible for your results up to now. Finally, discover what an Eagle who was reared with chickens can tell you about productivity.</li></ul><ul><li><strong><em>Physiology</em>. </strong>High Productive people have high energy levels. Full stop. The new term for Time Management is rapidly becoming<strong> Energy Management. </strong>Learn three ways to change your energy levels for the better - beginning today.</li></ul><ul><li><strong><em>People.</em> </strong>My favorite all time quote comes from Jim Rohn and it states that <strong><em>'you are the average of the five people you are surrounded by most of the time.' </em><span></span></strong>Nowhere is this more important than in the area of personal productivity. Simply stated, in order to change your results, change your peer group. This course will show you four practical strategies how.</li></ul><ul><li><strong><em>Planning.</em> </strong>Planning remains at the heart of effective time management. Learn six practical strategies to plan your Key Result Areas; your Month (I get paid a fortune to do this one exercise in some of the biggest organizations in the world); your Week (Imagine impacting the quality of your other 167 hours in your week with this simple exercise); your Day (Learn why you should always plan your day before you leave your place of work); your Projects (When you think about it, everything is a project. This is a non-negotiable skill for anyone who intends being more productive); your Communications (This six phase communications strategy can absolutely propel you into being a mega communicator).</li></ul><ul><li><strong><em>Problems</em>. </strong>Life is a series of problems and if you're mature, you'll learn the wisdom of confronting your problems early and squarely. Learn how the buffalo has this sorted out naturally by nature. In addition, learn a five step problem solving process that you can apply to any problem from poor sales to reduced profitability to breaking bad news to a colleague .I used this exact process to deal with the news that I had a rare tumor on my right aorta.</li></ul><ul><li><strong><em>Presence.</em> </strong>We expend vast amounts of time bemoaning the past or fantasizing about the future. This is a pity because <strong>The Present Moment </strong> is by far and away the ultimate time management tool. When you invest fully and passionately in the present moment you increase massively the probability of you being, doing and having the burning desires you yearn for.</li></ul><p>On the program we talk about the power of asking good questions. Two good questions for you to consider now are:<br></p><p><strong>1. What differences would it make in my life if I were to double my productivity?</strong><br></p><p><strong>2. What will the cost be to me - emotionally, physically and financially - if I choose to do nothing about it?</strong><br></p><p>Tony Robbins has said that <strong><em>'it's in your moments of decision that your destiny is shaped.' </em><span></span></strong> Make an investment in your destiny by signing up now for this practical and positive and life changing course.<br></p><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "The Ultimate Time Management Course for Business and Life.", 
    "price": "45.00", 
    "instructors": "Pádraic Ó Máille", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613870_264b_4.jpg", 
    "course_url": "https://www.udemy.com/pig-headed-discipline/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T16:19:00Z"
}