{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>---- Bonus lectures added on Wednesday 9th March 2016 ----</strong></p>    <p>  \t<em>Do you want to read faster?</em>  </p>  <p>  \t<em>Would you like to absorb new information 5x faster? 10x faster? How about 100x?</em>  </p>  <p>  \t<em>How about study multiple degrees (with a high GPA) and work full time?</em>  </p>  <p>  \t<em>What if you could complete exams twice as fast as everyone else?</em>  </p>  <p>  \t                               ....  </p>  <p>  \t                               This course will showcase the best methods for speed-reading used by top universities and Guinness World Record holders.  </p>  <p>  \t                                                 Not only that, we'll supercharge those methods by applying the latest technology to truly make you a super-reader.  </p>  <ul>  \t<li>Learn to easily double your reading speed in less than 5 minutes. Most people do so instantly, thanks to the technology we employ.</li>  \t<li>Learn the classic speed reading techniques, and the technology hack to boost you even faster.</li>  \t<li>Learn the exact technique top university academics use to speed through huge mounds of information.</li>  \t<li>Learn how to fly through university and school examinations.</li>  \t<li>Smash the competition by becoming a SUPER-READER.</li>  </ul>    <p>  \t<strong>             Hear what my students have to say:  </strong>  </p>  <p>  \t<em>'Great pace and delivery, however the animation is amazing. Seriously one of the best courses I've seen. It's very engaging!' - </em>Umesh  </p>  <p>  \t<em>'I was able to reach a speeding level of 750 wpm in a few days through application of the techniques presented by Matt Wong in this course. A+ speed reading course.' -</em>Mitchell  </p>  <p>  \t<em>  '...the editing is amazing and the pace engaging. Great work!' - </em>Davide  </p>  <p>  \t<em>'Very organized and well presented...superbly done.' -</em>Moslem  </p>  <p>  \t<em>'Of the courses I've reviewed so far yours has demonstrated the best delivery' - </em>Yi-Choong  </p>  <p>  \t<em>'This is a wonderful course--very smooth presentation and great content. I almost doubled my reading speed in one day.' -</em>Sally  </p>  <p>  \t<em>'The video and audio are great, and the instructor certainly knows what he is talking about. I particularly liked that the instructor compared traditional methods and new methods for even faster speed reading.'</em> -Dr Kluge  </p><p><em>'Matt Wong... I can't thank you enough for what you have done for me...He [Matt] keeps you engaged and takes the loads of information in bite size form.'</em> -Nyk</p>    <p>  \t<strong>Okay here's the secret sauce, right up front:</strong>  </p>  <p>  \t                                                 All the standard 'speed reading' techniques are in this course. I've paid thousands for speed reading courses and here they all are condensed into 60 seconds.  </p>  <p>  \t                                                 But with the rate of information growth today, we are fighting a losing game. Even at <strong>triple</strong> the average speed (750wpm) we're not going to be able to read everything we'd like to.  </p>  <p>  \t                                                 Academics know this. Entrepreneurs know this.  </p>  <p>  \t                                                 That's why they don't read like we do. They 'super-read'.  </p>  <p>  \t<strong>Super Reading is a combination of: </strong>  </p>  <ol>  \t<li>Time-tested techniques to increase general reading speed; and</li>  \t<li>Advanced triage sorting systems.</li>  </ol>    <p>  \t<strong>Don't read anything else until you've taken this course. </strong>Learn to speed-read and then super-read by enrolling in this course and start saving time today!  </p>  <p>  \t                                       30 Day Money Back Guarantee. Udemy will refund you 100% if we don't successfully hack your reading speed. <strong>I won't even know that you requested a refund</strong>. How <em>easy </em>and <em>anonymous </em>is that?!  </p>", 
    "end_date": null, 
    "title": "The DEFINITIVE course on Speed Reading. All techniques+hacks", 
    "price": "20.00", 
    "instructors": "Matt Wong", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352838_99c5_2.jpg", 
    "course_url": "https://www.udemy.com/learn-super-reading-hack-your-productivity-10x-guaranteed/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T11:47:56Z"
}