{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>The MASSIVE Goal Principle... </strong></p><p>This course blows the myth out of the water that we should be setting <em>\"realistic &amp; achievable\" </em>goals...</p><p>The presenter has conducted 200+ research interviews with top achievers which proved that successful people do <strong>NOT</strong> set <em>\"smart\" </em>goals.</p><p>This is a research based goal setting model wrapped around the private thoughts, behaviours and secret proven systems of top achievers.</p><p><strong>This course gives you the skills and confidence to set and go about achieving your MASSIVE goal.</strong></p><ul><li>achieve more both day to day AND on your massive goal.</li><li>know how to get a coach or mentor at the very highest level.</li><li>plan your goals the way top achievers do.</li><li>overcome the \"give in\" moments.</li><li>know how set up and run a \"mastermind\" peer group for success.</li><li>think and behave like a top achiever.</li></ul><p><strong></strong>The course is for those with a goal to achieve or a BIG SCARY project that needs achieving and it shares with you how you will be able to think and behave like the \"super successful\" do when setting their goals. Proven in both the business world and education sector and in addition many have achieved amazing personal goals using this process. It is \"NOT\" for those who are okay with playing safe all the time and moan about not achieving things.</p><p>The actual process and structure of how to set a MASSIVE goals is given to you along with the most popular actions and processes used by top achievers when setting goals and working towards their \"massive goals\".</p><p>Packed with true examples of those who have used the process to achieve BIG and some of the top achievers David interviewed for the process research.</p><ul><li>How to plan your goal and find out what \"you do not know\".</li><li>Why your purpose is CRITICAL to your success.</li><li>Confidence in getting the right support network around you.</li><li>Certainty around overcoming procrastination, and maintaining your motivation levels to win big!</li><li>Know why \"fun\" is critical to your goals.</li><li>How to get a top achiever to \"mentor\" you.</li></ul><p>10'000-50'000 people every year experience David Hyner presenting this live and many have taken action to achieve their goals including sporting champions, exam busting superstars and business gurus.</p><ul><li>D grade to A* 100% in four months !</li><li>Over a dozen Amazon no1 books credit this process.</li><li>World, European and National sporting champions.</li></ul><p>Some great resources... on their own worth the course fee include a supporting ebook explaining how to use the process, and templates of the process for you to play with.</p><p>Structured in 12 short, punchy and light hearted videos (5-13 minutes each) delivered  by the lead researcher David Hyner who is an award winning professional speaker himself after using this process. In addition, he used the process himself to have no1 books on Amazon and Kindle, raise over half a MILLION (GBP) pounds for charity and much more besides.</p><p>Will you set yourself a MASSIVE GOAL ? </p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "The MASSIVE Goal Principle", 
    "price": "20.00", 
    "instructors": "David Hyner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572300_a71f_2.jpg", 
    "course_url": "https://www.udemy.com/the-massive-goal-principle/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T11:32:46Z"
}