{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p>\n\n\n\n\n\n\n\n<p><strong>IN PURSUIT OF PRODUCTIVITY, THERE'S PLENTY OF ROADS TO CHOOSE FROM &amp; MANY MOUNTAINS TO CLIMB. BUT WHAT WOULD HAPPEN IF YOU REACHED THE TOP, ONLY TO DISCOVER THAT YOU'VE BEEN CLIMBING THE WRONG MOUNTAIN?</strong></p>\n\n\n\n\n\n<p>In life, many people commit the best of their time to pursuing goals that when reached, often prove to be empty or unfulfilling. When you understand your core values &amp; priorities, every decision you make is wiser, less impulsive and of far sounder judgement.</p>\n\n\n\n\n\n<p>Your work is going to fill a large element of your life, and the only way to become satisfied is by doing what you know is great work. The only way to do this, is by loving what you do.</p>\n\n\n\n<p><strong>In Pioneer Mindset: A Guide To Extraordinary Productivity, you'll learn how to;</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Get Clear in Who You Are &amp; What Your Priorities Are.</li><li>Make Wiser Choices About How You Invest Your Time.</li><li>Prioritise Your Goals and Transform Your Personal Productivity.</li><li>Stay Inspired, Motivated &amp; Overcome Procrastination With Ease.</li><li>Transform Your Productivity &amp; Establish a Greater Work-Life Balance.</li><li>Develop the Confidence to Pursue Your Passions and Main Life Goals.</li><li>Understand How Your Core Values Drive &amp; Direct Your Decision Making.</li></ul><p><br></p><p>This course offers an in-depth look at core values, and will show you how to understand your own core values, to gain more clarity, maximise your productivity and fulfil your true potential.<br></p><p>Values are the most important drivers in our life and underpin all our decision making. If you don't understand your own core values, then you'll never be able to fully understand yourself and what drives you.</p>\n\n\n\n\n\n<p>You'll be guided through a process of assessing your approach to life, to your career, your finances and even your close relationships. Pioneers are those who are willing to take greater risks, explore unchartered territories, and go beyond the limits of what most people believe to be possible. So, to get ahead in life, we need a Pioneer Mindset.</p>\n\n\n\n\n\n<p>There's no time like now to transform your productivity, get more purpose, passion and meaning back in your life. So forget what you think you know about success or productivity and enter a new way of thinking that will completely revolutionise your life.</p>\n\n\n\n\n\n<p><strong>Risk free, this course comes with a Full Money Back Guarantee, and if you're less that 100% satisfied, you can get a full refund within 30 days of purchase.</strong></p>\n\n\n\n\n\n\n\n<p><strong><em></em></strong><strong></strong></p>", 
    "end_date": null, 
    "title": "The Productivity Secret: Aligning With Your Core Values", 
    "price": "20.00", 
    "instructors": "Kain Ramsay", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604972_8c4f_15.jpg", 
    "course_url": "https://www.udemy.com/unlimited-success-transform-your-personal-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T16:18:52Z"
}