{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will teach you  simple yet powerful techniques to permanently remove the clutter in your life and home, so that you feel less stressed, happier, and have more time and energy for the things that matter to you.\n\n  </p>\n\n<p>The truth is we don’t need a better way to cram more stuff in less space; that’s just insane. The secret is to understand what you truly need and love to have or keep, then to develop a way of maintaining your environment the way you like it, without effort and stress, and without wasting precious time.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course from the Lean manufacturing and productivity expert Gabriela Drescher, you will learn how to take control and enjoy your life by learning skills and tools to get rid of the inessential, and by organizing your surroundings in a way that pleases you, without compromise, and without past baggage or anxiety about the future.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This is a course of personal transformation, of working smarter, not harder, and of freeing up time to pursue what you love, instead of being the victim of the circumstances.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>For the last 12 years, your instructor Gabriela Drescher has developed a series of techniques to get rid of the clutter permanently, and in the process she experienced an amazing personal transformation. As a chrysalis turns into a butterfly, she’s turned from a middle-age stressed-out engineer in the lean manufacturing field  into an online entrepreneur, science-fiction writer, avid learner, and hopefully soon, a piano player.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is not strictly about clean-up, or tidying up. It is about finding the real you behind your belongings. It’s also about traveling light and purposeful through life, about letting go, and about self- discipline.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The course starts out by familiarizing you with the principles of proper organization, adopted from the Lean philosophy. Lean stands for achieving anything with less effort, less resources, less time, and less cost.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Armed with these principles and way of thinking, the course dives into the actual tidying-up methodology, offering the road-map of the transformation of your environment into a sustainable, organized one, by presenting a case study from start to finish. A picture is worth a thousand words, thus the course has a lot of visuals to help you apply right away the newly found knowledge.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The style of the course is not show-and-tell, but rather hands-on, following the principles of learning by doing. So the recommendation is to take a section at a time and follow through with your own work. By the end of the course, you should be able to have completed at least one project, thus you’ll be ready to expand to all the other projects or areas of your life, whether at home or work.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Remember, the end result: tidying up is the wind beneath your wings, and not boring cleanup time.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>With that said, this course is constantly updated and improved based on your precious feedback, so what are you waiting for? Roll up your sleeves and let's start!</p>", 
    "end_date": null, 
    "title": "The Science Of Tidying Up To Boost Your Productivity", 
    "price": "20.00", 
    "instructors": "Ms. Gabriela Drescher", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/827294_19a2_2.jpg", 
    "course_url": "https://www.udemy.com/the-science-of-tidying-up-to-boost-your-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-20T17:43:44Z"
}