{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "    <p> <strong><em>\"one of the best course in Udemy</em><em> </em></strong></p><p><strong><em>It is short and straight to the point... I am achieving my goals thanks to his course...one of the best course, I took in Udemy so dar...\"</em></strong></p><p><strong><em> Sandy Allain,</em></strong></p><p>Sir John Whitmore defines <strong>coaching</strong> as <strong>\"unlocking people's potential to maximize their own performance. It is helping them learn rather than teaching them.\" </strong></p><p><strong>With that in mind, here's what I got for you:</strong></p><p>A way to coach yourself to success using the exact same 4 step framework, called the GROW model, that most professional coaches around the world use with their clients, and have been using since the 80's or before when Sir John Whitmore created it to help athletes improve their game.</p><p>Now, coaches use this framework not only for sports but for just about everything from business to even private life. And you'll be able to apply it easily and quickly with just about any goal that you need or want to get done. </p><p><strong>Here's what it will do for you:</strong></p><ul><li>It will help you achieve things you never thought possible and get real, tangible results.</li><li>It'll provide an effective tool to use in problem solving so you can overcome the obstacles that are holding you back.</li><li>It's going give you the skills, knowledge and confidence to improve your own performance and effectiveness.</li><li>And above all, It will help you raise self awareness and motivate and encourage self responsibility in your self.</li></ul><p><strong>Here's what I want you to do next:</strong></p><p>Go ahead and sign up for the course because I know this is really really going help you achieve all those goals that you haven't quite been able to get to, And I know you might not believe me but just give it a try and see for yourself what it can do for you, cuz after all you have 30 days to get your money back and I really don't want your money if your not going to get anything out it anyway, So go ahead and sign up for the course and I'll see you soon.</p>", 
    "end_date": null, 
    "title": "The Best Year of Your Life: Coach Yourself to Success", 
    "price": "30.00", 
    "instructors": "Ed Arellano M.B.A.", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494930_1a54.jpg", 
    "course_url": "https://www.udemy.com/coach-yourself-to-success-use-the-grow-model-to-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T10:46:07Z"
}