{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tThis course focuses on <strong style=\"\">harnessing your personal energy</strong> (by at least 5%) by tapping into your energy sources and increasing vitality, flow and well being for you and for others. Putting fuel in your tank and being bulletproof = DRIVE.  </p>  <p>  \tThis course can easily boost your energy by if you need to…  </p>  <p>  \t1) Develop <strong style=\"\">physical</strong> resilience to continuously evolve during turbulent times? PHYSIOLOGY  </p>  <p>  \t2) Tap into <strong style=\"\">emotions</strong> that increase the level of passion for what you do? PASSION  </p>  <p>  \t3) Broaden your <strong style=\"\">mind</strong> to new possibilities? PSYCHOLOGY  </p>  <p>  \tWe all have<strong style=\"\"> five recognised energy sources – soul, body, heart, mind and spirit.</strong> You will learn to master these energy sources on a daily basis. We need the energy to come into our system and for it to be released. Breathing in and out for vitality. If the energy is coming IN, we intend to use it for our own wellbeing. If we send energy OUT, we intend it to be utilised by someone else.  </p>  <p>  \tI am a qualified coach/facilitator with Energy Diamond who offer some of the best profiling tools (that this course promotes) I have ever seen as they bring together <strong style=\"\">energy psychology techniques from the East with life and business coaching from the West.</strong>  </p>  <p>  \tMy programmes work closely with <strong style=\"\">your needs</strong> so that In a given time period you can make sure that you complete conscious tasks that boost your energy under all 5 energy sources. I utilise presentations and supplementary reading so that you can get the best results possible.  </p>", 
    "end_date": null, 
    "title": "The 7 Secrets of Increasing Personal Energy: Introduction", 
    "price": "20.00", 
    "instructors": "Stuart Haden", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413192_761c_2.jpg", 
    "course_url": "https://www.udemy.com/the-7-secrets-of-increasing-personal-energy-introduction/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T14:51:27Z"
}