{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you ever; write goals that don't get realised, find that your goals don't help you reach your aims or objectives, or find setting goals for others difficult?<br></p><p>If you want to set challenging, appropriate and achievable goals then this is the course for you.</p><p>By the end of this courses you will be skilled in setting and meeting ALL your goals!</p><p><strong>**UPDATED OCTOBER 2015**</strong></p><p><strong>Master the art of SMARTERS goal setting </strong></p><ul><li>Learn the 8 crucial stages of goal setting</li><li>set goals that are challenging, appropriate and achievable</li><li>undertake 8 unique activities </li><li>achieve your aims and objectives </li><li>recognise how to continually open up opportunities </li><li>understand how to link your goals with others </li><li>learn how to use the power of 'reward' to get support</li></ul><p><strong>Set &amp; achieve ALL your goals</strong> </p><p>This course will take you through the 8 stages of goals setting using 12 videos and 8 associated activities which will enable you to set and achieve all your future goals.<br></p><p>These 8 activities are specifically designed to address any goal, be it big or small and ensure you have considered and planned for all eventualities.</p><p>This course is suitable for anyone who wants to set and achieve their goals or set goals for others that go beyond a 'tick box' exercise.</p><p><strong>Start achieving all your goals today! </strong></p><p>My approach will have you setting and achieving your goals that are appropriate and strategically balanced. </p><p>I know this SMARTERS strategy works because I've used it both personally and professionally and the outcome has been goals that continually drive you forward and open up an increasing number of previously unseen opportunities. </p><p>By the end of this course you will have all the tools and approaches you need to be an <strong>ultimate goal setter</strong> and more importantly <strong>goal achiever</strong>, who constantly seeks new opportunities and experiences. </p>", 
    "end_date": null, 
    "title": "The SMARTERS approach to setting & achieving all your goals ", 
    "price": "20.00", 
    "instructors": "Sarah Simpson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625656_76be_3.jpg", 
    "course_url": "https://www.udemy.com/the-smarters-approach-to-setting-achieving-all-your-goals/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T08:50:51Z"
}