{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you wanting to have more productivity in your business? This productivity course teaches you some simple hacks that will catapult the amount of work you get done and help you to increase your business and free up your time!</p><p><strong>Over 1,700 happy students can't be wrong!</strong></p>  <p>  \t      Real reviews of my courses:  </p>  <p>  \t<strong>\"Well done, a very inspiring course that delivered consistently. Clear narrative and well thought out learning pathways. One of the best Udemy courses.\"</strong>  </p>  <p>  \t<strong>\"Wow! I'm stunned at the volume of GREAT information here! If you're not acquainted with Charity's training, this is a FANTASTIC way to start! Each of the videos is very easy to understand, and set up perfectly to take notes. You get step-by-step instructions on HOW to do it...\"</strong>  </p>  <p>  \t<strong>\"I am a little more then halfway done taking this course. Every video I watch I learn more and say WOW I would have never thought of that. I have already put what I learned into action and am making money. I am excited to see how much more I can and will make when I finish this course. So glad I chose to take this course. I will check out the other courses Charity offers in the future.\"</strong>  </p>  <p>  \t      ***  </p>  <p>  \t<em>Do you find yourself thinking there are never enough hours in the day?  </em>  </p>  <p>  \t<em>Do you feel like you're always spinning your wheels and never getting anywhere?  </em>  </p>  <p>  \t      As an online entrepreneur, professional ghostwriter, bestselling fiction author and trainer, I have a LOT on my plate everyday. My students regularly ask me the same question:  </p>  <p>  \t<strong>Charity, how do you get so much done so quickly? What productivity hacks do you know that we don't?</strong></p>  <p>  \t      You see, in the last 3.5 years, I've published over 72 books (in different niches and under pen names). I've also created many courses, released hundreds of pre-written plots, trained students, run my eBay business, sold on Amazon FBA and managed a large ghostwriting team. In the last 10 weeks, I've created and released SEVEN Udemy video training courses too.  </p>  <p>  \t      But I'm not better than you! I'm no smarter either. I'm a wife and the mother of three kids, all of whom we have homeschooled since kindergarten. Productivity at work has been a struggle for me too.</p>  <p>  \t      What's different about me is that I have a system for how I run my businesses. I'm not naturally an organized person, but I've managed to learn to use tools and techniques that allow me to have hyper productivity while still having a life!  </p>  <p>  \t  What will you learn?  </p>  <ul>  \t<li>The methods I use daily to supercharge my productivity at work</li>  \t<li>The tools that you can use (free and cheap) to make your productivity levels soar</li>  \t<li> The no-fail method of \"brain dumping\" (my favorite productivity hack) that allows me to work faster than most people I know.</li>  \t<li> The lifestyle and health tips you need to understand to be even more productive</li>  \t<li> Productivity hacks that I use to create more content quicker</li>  </ul>  <p>  \t<strong>If you want to learn how to be super productive in less time, click the TAKE THIS COURSE button so we can get started!  </strong>  </p>", 
    "end_date": null, 
    "title": "The Productivity Course - Productivity Hacks for Business", 
    "price": "20.00", 
    "instructors": "Charity  Cason", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424472_52a1.jpg", 
    "course_url": "https://www.udemy.com/get-stuff-done-productivity-hacks-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T01:15:55Z"
}