{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>The Easy Way to Write Short Stories That Sell</em> will enable you to plan, write, submit, and sell your own commercial short stories, whether you want to get published by magazines, e-zines and/or in anthologies, or whether you prefer to go it alone - and start making money soon from your self-penned stories on Amazon Kindle.</p><p>The course focuses on attaining a professional author's mindset quickly, so that you can immediately begin to get inspired and become proficient enough to write commercial short stories for the marketplace. </p><p>Included are over fifty personal lectures on inspiration, genre conventions, instruction of characterization, plotting, structure, and fast writing, plus many text-based mini-courses that explore creative writing in more depth. Also included is an up to date listing of available (paying!) short story markets.</p><p><b>\"Master the Art of Short Story Writing with The World's Foremost Writing Guru\"</b></p><p>* Harness your imagination quickly</p><p>* Acquire the writing habit easily</p><p>* Discover how to make your stories more commercial</p><p>* Learn the habits of professional writers in just a few hours</p><p>* Begin a new career as an author</p><p>* Finally understand the needs of mainstream publishers and editors</p><p><b>Discover the reality of a writer's life, taught to you by the author of over thirty bestsellers.</b></p><p>This course will take you on a thrilling journey, from acquiring the working writer's mindset to thinking of compelling ideas; from learning how to structure stories for maximum effect to correctly formatting and submitting your stories to editors and publishers.</p><p>At the end of this course you can expect to be able to write commercial short stories easily and perhaps begin a whole new career as a freelance, paid author. </p><p>Rob Parnell has been teaching writing for almost two decades. That experience has been synthesized into this unique course, then specifically designed and structured to help the beginner move from wannabe writer to professional wordsmith.</p><p>Starting with an introduction to the writer's mindset, the course first focuses on mental preparation, ideal time management, goal-setting, and the importance of strong self-belief. There are pre-designed templates to aid in your understanding of these issues.</p><p>In part two of the course, we look at inspiration and getting ideas, finding subject matter for your stories, as well as providing a clear guide to the fiction genres: romance, thrillers, horror, fantasy, and science fiction. </p><p>In the third section, Rob Parnell reveals the tips and tactics of professional writers with crucial guidance on the creation of protagonists, building empathy, character motivation and agenda, dialogue, story setting, style, tone, description, point-of-view, plotting and much more. You will also discover the 7-Step Story Generator - a tool that allows you to develop and test any fiction idea. Plus, learn the ideal 5-Point Story Structure as well as how to easily create templates on which to hang commercial short stories.</p><p>Along the way, there are text-based courses on character creation, plotting, and a special presentation of <i>The Art of Story</i>, a downloadable resource that fully explains the more technical aspects of ideal story structure. Rob also hosts a section on writing software, presenting the solution to any writer's needs.</p><p>In part four, we explore the actual writing: how to write fluidly, without blocks, for maximum impact. How to create arresting opening paragraphs and compelling text. And, how to edit professionally for submission and publication. </p><p>In part five, discover how to find and approach paying short story markets. A full market listing is available with the course. For those who want to self-publish, and start making money immediately, Rob presents crucial advice on formatting and publication through Amazon Kindle.</p><p>This course is fully mentored - Rob is available on-line throughout your course journey to answer queries, offer guidance, and give support. Your very own writing guru is just a click away (via the Udemy Console.)</p><p>At the end of this course, you will possess a clear understanding of the short story marketplace and will therefore be ideally placed to compete in this exciting and fast-growing new career opportunity. At the very least, you'll be able to write fabulous short stories that people will love and admire!</p>", 
    "end_date": null, 
    "title": "The Easy Way to Write Short Stories That Sell", 
    "price": "25.00", 
    "instructors": "Rob Parnell", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/544600_9c73_3.jpg", 
    "course_url": "https://www.udemy.com/the-easy-way-to-write-short-stories-that-sell/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-04T04:40:59Z"
}