{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t This &ldquo;Time Management Strategies for Entrepreneur: Time Management Course&rdquo; will teach you:  </p>  <ul style=\"\">  \t<li style=\"\">The real truth behind what time management really is, and why its the most potent weapon in an entrepreneur&#039;s arsenal.</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">How to identify and totally annhilate the distractions that are causing you to lose income each and every day.</strong></li>  </ul>  <ul style=\"\">  \t<li style=\"\">Why disorganization is sucking productivity from your day like a spider sucks the life from its victims, and how you can get this under control.</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">How to push through, obliterate, and eliminate the time leeching obstacle of procrastination, now you too can never face this deadly time killer again by using this proven method.</strong><br style=\"\">  \t </li>  </ul>  <ul style=\"\">  \t<li style=\"\">Whether or not multi-tasking really makes you more productive, you won&#039;t believe the answer to this one!</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">How bad time habits are making off with your money like a thief in the night, and how you can setup your time management security system to protect your money!</strong></li>  </ul>  <ul style=\"\">  \t<li style=\"\">How you can pull the rug from under your bad time habits and expose them for the ugly profit sucking monsters they really are.</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">The hands down, easiest and most simplistic way that you can begin saving time right now.</strong></li>  </ul>  <ul style=\"\">  \t<li style=\"\">The proper way to use planning to get things done because more than likely you&#039;ve been doing it all wrong all along!</li>  </ul>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">What the good time habits are, and how you can easily and quickly replace your bad time habits with them.</strong></li>  </ul>  <ul style=\"\">  \t<li style=\"\">And much, much more!</li>  </ul>  <p style=\"\">  \t So take this Time Management Course and learn mandatory time management strategies for the Entrepreneur.  </p>", 
    "end_date": null, 
    "title": "Time Management for the Entrepreneur", 
    "price": "40.00", 
    "instructors": "Strategize Your Success, Wanda Baader", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25612_7a1e_13.jpg", 
    "course_url": "https://www.udemy.com/time-management-for-the-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-29T05:55:26Z"
}