{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Has anyone ever told you not to get overwhelmed?&nbsp; Probably.&nbsp; So, how   does knowing that you shouldn’t be overwhelmed teach you how&nbsp;not&nbsp;to be   overwhelmed?</p>  <p style=\"\">When we inventoried all the breakthroughs we had, we realized that we   needed to put this information together and get it out there so we   could help as many people as possible.</p>  <p style=\"\">We first considered including this as another offering in our   consulting practice, but there were two challenges.&nbsp; One is based on our   rate structure–most entrepreneurs would not be able to afford our   rates.&nbsp; The second was by doing one-on-one coaching, we would be   severely limited on how many people we could touch.&nbsp; So, we considered   delivering this content via live seminars. &nbsp; Again, we saw the challenge   of limited time and resources.</p>  <p style=\"\">The question remained:&nbsp;<strong style=\"\"><em style=\"\">how could we offer a program that ANYONE could access and apply within 24 hours?&nbsp;</em></strong>&nbsp;This question led to the launch of our new&nbsp;online video program called&nbsp;<strong style=\"\">Time Mastery Excellence</strong>.&nbsp; We filmed this program in front of a live group that paid thousands of dollars to attend.</p>  <p style=\"\">Our Time Mastery video/mp3 program is beyond the typical Time   Management program.&nbsp; We get right to the point in the beginning of the   program–who you are is just as important as what you are doing.&nbsp;   Controlling your emotions and state is one of the most powerful ways to   be productive.&nbsp; Imagine what it would be like to be composed in chaos.&nbsp;<strong style=\"\">&nbsp;See yourself having the ability to eliminate feeling overwhelmed ever again!</strong></p>", 
    "end_date": null, 
    "title": "Time Mastery", 
    "price": "50.00", 
    "instructors": "Time Mastery", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29397_d004_5.jpg", 
    "course_url": "https://www.udemy.com/time-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-12T14:43:27Z"
}