{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Time management is something most of us want to be better at. Learn how to take control of your time and your life; significantly improve your focus and productivity and to achieve the success you desire. Get the things done that matter for YOU.<br></p>\n\n<p>It is very easy to feel overwhelmed and stressed by the sheer volume of things you believe you have to get done. It can seem as though other people are effectively controlling you and how you spend that most precious of commodities - your time.</p>\n\n<p>Time is one of the few resources that we all have an equal amount of. Yet we achieve vastly different levels of success with that time. Highly successful people are excellent at time management, developing a clear focus on what success means for them, working to strong priorities and ensuring that they waste no effort or time delivering that success. It's not rocket science, but it does require self discipline.</p>\n\n<p><strong><em>Selected by Udemy as one of only 10 Winning Courses in the 2015 Black Friday Challenge</em></strong><br></p>\n\n<p>This course will give you the tools and strategies you need to significantly improve your time management skills:</p>\n\n<ul><li>clearly identify what success really means for you</li><li>Develop clear, measurable, meaningful goals and objectives </li><li>Establish and work to clear priorities - making decisions on where to use your time easier</li><li>Organize and schedule  your tasks and activities to make sure you make the best possible use of your time and gain the maximum benefit</li><li>Deal effectively with the day to day challenges of scheduling your time.</li><li>Eliminate bad habits and the time bandits that can waste so much of your time</li></ul>\n\n<p>Having the self-discipline and commitment to implement these strategies will result in a significant improvement in your productivity enabling much greater levels of achievement that will transform your level of success. </p>", 
    "end_date": null, 
    "title": "Time Management: increase productivity & achieve your goals.", 
    "price": "20.00", 
    "instructors": "Richard Lock", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628670_f3ee_3.jpg", 
    "course_url": "https://www.udemy.com/time-mastery-how-to-transform-your-productivity-and-success/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T09:30:36Z"
}