{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>*******************************************************************************************************</em></strong></p><p><strong><em>\"A man who dares to waste one hour of life has not discovered the value of life.\"</em></strong></p><p style=\"\">- Charles Darwin</p><p><strong><em><em>*******************************************************************************************************</em><br></em></strong></p><p>Have you ever heard the phrase <strong>“time is money”</strong>?</p><p>It’s true - time is a valuable commodity that, once used, can never be replaced.<br></p><p>Many people end up kicking themselves because they lose valuable time by not planning their day correctly. Does this sound like you?</p><p>Maybe you keep telling yourself that today’s the day you’re going to finally take care of that to-do list, only to find yourself procrastinating and being unable to complete everything. There's just not enough time in the day!</p><p>While being told to <strong>“live like there's no tomorrow”</strong> is great advice, it doesn't really give us any specific guidelines on how to do that.</p><p><strong>==========================================================================</strong></p><p><strong>Are you tired of all these phrases, and would like practical step-by-step guidelines that you can apply to your life today?</strong></p><p><strong>==========================================================================</strong></p><p>Time is definitely limited, but we are glad to say that there is a way out. </p><p>Now I know you've heard this before time and time again, but rather than talking about things in theory, we are going to give you real, practical solutions. Whether it’s for your work life or leisure time, this video course is going to guide you through the process of improving your life.</p><p><strong>Don’t let any more of your precious time go\nto waste! Learn proven and effective ways to plan your day right and manage\nyour time by grabbing this video course today.</strong></p>", 
    "end_date": null, 
    "title": "TIME MANAGEMENT: How To Plan Your Day Right!", 
    "price": "20.00", 
    "instructors": "Upskill Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658802_e78f_3.jpg", 
    "course_url": "https://www.udemy.com/time-management-manage-time/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T10:55:52Z"
}