{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p></p><p><strong>Grab this course at it's current discounted price before it goes back to $97 soon!</strong></p><p>Personal time management skills are essential for professional &amp; personal success in any area of life. Those able to successfully implement time management strategies are able to control their workload rather than spend each day in a frenzy of activity reacting to crisis after crisis - stress declines and personal productivity soars! These highly effective individuals are able to focus on the tasks with the greatest impact to them and their organization.</p><p>  The Time Management workshop will cover strategies to help participants learn these crucial strategies. Participants will be given a skill set that include personal motivation, delegation skills, organization tools, and crisis management. We'll cover all this and more during this workshop.</p><p><strong>Learning Outcome:</strong> </p><ul><li>Plan and prioritize each day's activities in a more efficient, productive manner</li><li>Overcome procrastination quickly and easily</li><li>Handle crises effectively and quickly</li><li>Organize your workspace and workflow to make better use of time</li><li>Delegate more efficiently</li><li>Use rituals to make your life run smoother</li><li>Plan meetings more appropriately and effectively</li></ul>", 
    "end_date": null, 
    "title": "Time Management Skills", 
    "price": "30.00", 
    "instructors": "Adam Karchoufa", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467304_dbb2_3.jpg", 
    "course_url": "https://www.udemy.com/simple-time-management-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T11:55:53Z"
}