{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\"I'm tired\", \"Do not take it anymore\", \"I can’t:  too little time\", \"Where do I find the time to do that task too?\".  How many times have we said these sentences? We often say that time is money, to emphasize that it is a finite and precious resource. If we think that every person during his life  sleeps on average for about twenty-two years, eats for about 6 and half years and plays for about more six years, we realize the time at our disposal is still less than what we think. But if time has a so important value, we must not waste it. Would you throw your money on unnecessary things or you do not need to? Well, for the time is exactly the same thing. </p><p>In order to manage the time in an effectively and efficient way we have to adopt a specific  mindset and use appropriate techniques. This course is for managers, politicians, employees, students but in general all those who, regardless of activity and the social and economic situation, have no time to lose and want to achieve their goals.</p>  <p>We will teach you just that: we are interested in helping you achieve your objectives, professional and / or personal objectives: we will explain concretely how to be more productive, how to organize your tasks by importance, how to identify and manage all the thieves of time, i.e. those our personal characteristics or those external factors that consume our time and distract us from what is really decisive for us. Little theory and many facts. Techniques, methodologies, practical advice. Everything with practical and real examples. For every thief of time we will provide at least three operational guidelines to manage it better. We also have a self-assessment test on your approach to time and a methodology of action plan to immediately apply the things you have learned. One minute after finishing the course, you will have all the skills to reduce to zero the wasted time. </p>  <p>In fact, you will have learned how to:</p>  <p>focus on the important things in your life</p>  <p>avoid procrastinations</p>  <p>give the right priorities</p>  <p>combat and eliminate all the factors that useless consume your time</p>  <p>program and manage your time</p>  <p>work by objectives</p>", 
    "end_date": null, 
    "title": "Time management & personal productivity: change your life", 
    "price": "20.00", 
    "instructors": "Renato Votta", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711088_44f3_2.jpg", 
    "course_url": "https://www.udemy.com/time-management-personal-productivity-change-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-30T19:49:34Z"
}