{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  In today&#039;s highly pressurized workplaces there is much to be gained by developing our knowledge, skills and confidence in relation to time and workload management. This course, equivalent to a full-day&#039;s continuous professional development, provides opportunities to learn how to manage our pressures as effectively as possible.  </p>  <p style=\"\">  \t  The course, presented and developed by author, Dr Neil Thompson, is based on four principles of Time and Workload Management:  </p>  <p style=\"\">  \t  路<em style=\"\">Too much work is too much work </em>Trying to do more than we reasonably can is unhelpful. If we are overloaded we need to think strategically about how we can deal with the situation, rather than simply work faster or harder.  </p>  <p style=\"\">  \t  路<em style=\"\">Managing energy as well as time </em>How much work we can get done in a given amount of time will depend on levels of motivation and morale, so these are important factors to consider.  </p>  <p style=\"\">  \t  路<em style=\"\">Skills not qualities </em>No one is born well organised or focused; these are skills we can learn, skills that can be developed over time.  </p>  <p style=\"\">  \t  路<em style=\"\">Investing time to save time </em>Not taking time to think, plan, analyse and get a sense of control is a serious but sadly not uncommon mistake.  </p>  <p style=\"\">  \t  Divided into six main lessons, the course provides a clear and helpful introduction to this important subject matter and offers an excellent foundation for developing your knowledge, skills and confidence in tackling the challenges of managing a heavy workload.  </p>  <p style=\"\">  \t  This course will help you to feel more confident in making sure that your workload pressures remain within manageable limits so that you can keep stress at bay.  </p>  <p style=\"\">  \t  The course has been designed to be flexible so that you can dip into it when it suits you within your busy schedule. In keeping with one of the important lessons put forward by this course, the time invested in it will be handsomely repaid by greater confidence in managing your pressures efficiently and effectively.  </p>", 
    "end_date": null, 
    "title": "Time and Workload Management", 
    "price": "35.00", 
    "instructors": "Neil Thompson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/209318_c8cb_4.jpg", 
    "course_url": "https://www.udemy.com/time-and-workload-management/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-02T11:56:25Z"
}