{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>Looking for an easy to use todo list manager that will actually help you to complete the things on your todo list?</em></p><p>Trello is a <strong>free </strong>online task manager that can be accessed using any web browser (or <strong>IOS </strong>and <strong>Android</strong> apps) and that supports simplified todo list management through a <strong>drag &amp; drop</strong> interface.</p><p><em>Looking for an easy to use project manager that will allow you to work in teams?</em></p><p>Trello is a fully <strong>collaborative </strong>software tool that allows groups of people to work on shared projects moving tasks from concept through completion.</p><p><em>Looking for sophisticated task management that will allow you to manage large teams of people working toward a common goal?</em></p><p>Trello allows you to fully document each task in a project while also tracking estimated time against time actually spent.</p><p><em>So, how does Trello differ from any other todo list or task manager?</em></p><p>Trello allows you to organize multiple project into separate Boards.  People can be invited to work together on boards granting different administrative privileges to each person.  Each Trello Board is composed of multiple Lists with each list being associated with a phase of the project.  For example, your lists might include:</p><ul><li><strong>Todo </strong>- All tasks anyone can think of to work on.</li><li><strong>Selected </strong>- The tasks selected for this project.</li><li><strong>Working On</strong> - Tasks currently being worked on.</li><li><strong>On Hold</strong> - Tasks that are awaiting something.</li><li><strong>Completed </strong>- Completed Tasks</li><li><strong>Rejected</strong> - Rejected Tasks</li></ul><p>Cards are added to a Board to represent individual tasks.  Cards are moved from one List to the next to represent advancement through the phases of a project development from initial concept all the way to completion.</p><p>Initially developed to track software development projects, I will be showing you how to use Trello to track everything from Udemy course development to organizing a party</p><p>Trello is free.  Trello is easy to use.  Trello is intuitive.  Trello is powerful.  Trello will store you project data safely online and make it available on all your devices.  Trello can be used to manage collaborative efforts.</p><p>So, what are you waiting for.  Increase your productivity 10 fold using this leading task management tool.</p><p>Remember: Udemy offers a <strong>30 day money back guaranty </strong>if you aren't 100% satisfied with this course, so you have nothing to lose.</p><p>I look forward to seeing you in the classroom.</p><p>---Brian</p>", 
    "end_date": null, 
    "title": "Trello Project Management: Easy, Shared, Online To Do Lists", 
    "price": "20.00", 
    "instructors": "Author/Publisher Brian Jackson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/714070_5d45_7.jpg", 
    "course_url": "https://www.udemy.com/trello-project-management-easy-shared-online-to-do-lists/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-03T04:01:21Z"
}