{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Welcome to <strong>Twitter Advanced Search: Become an expert at finding stuff</strong> !</p>\n\n<p>This course was designed for anyone who wants to become more capable at finding stuff on Twitter. </p>\n\n\n\n\n\n<p>Sometimes, Twitter is complete mess of irrelevant information mixed up with interesting content. What you want is an ability to filter the irrelevant content out and just keep the best. That's basically what this course will teach you.</p>\n\n\n\n\n\n<p><u>What you'll gain from this course</u><br></p>\n\n\n\n\n\n<ul><li>Time. A lot of it. </li><li>Efficiency. You'll become a Twitter sniper.</li><li>A new skill to add on your resume. </li></ul>\n\n\n\n\n\n<p><u>What you'll learn during this course</u></p>\n\n\n\n\n\n<ul><li>How to use logical operators and build complex queries</li><li>How to use specifiers and filter results according to your needs</li><li>How to follow up with tweets between people</li></ul>\n\n\n\n<p>All of the lessons are <strong>screen recorded in HD 1080p</strong> so you can see everything I mention during the lectures (check out the free preview sections!) And there’s also a checklist at the end of each section with a link to every website you see in the videos. </p>\n\n<p>I’ll personally be answering any questions you have and I’ll be happy to provide links, resources and <strong>any help I can offer you </strong>in improving your understanding of Twitter Advanced Search operators and specifiers.  I’ll also be updating the course every month with new tactics and approaches to Twitter Advanced Search so that you’re<strong> always up-to-date.</strong></p>\n\n<p>If you're looking to save hours of time, learn an invaluable skill and become a boss at finding anything, <strong>click Take This Course </strong>at the top right of the page and let's get started!</p>\n\n\n\n<p>I'm very excited to teach you this topic, and I hope that you're ready for your journey of learning Twitter Advanced Search!</p>\n\n\n\n\n\n<p>Let's get started!</p>", 
    "end_date": null, 
    "title": "Twitter Advanced Search: Find Stuff Like a Boss", 
    "price": "20.00", 
    "instructors": "Samy Mkacher", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/844810_f6de_2.jpg", 
    "course_url": "https://www.udemy.com/twitter-advanced-search/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-10T09:47:41Z"
}