{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you a <strong>BUSY TEENAGER</strong> ready to stop fumbling around in high school and <strong>become a top student</strong>?<br></p><p>Or, are you the <strong>PARENT of a teenager</strong>, who wants your kid to <strong>transform their HECTIC lifestyle</strong> into a SUCCESSFUL one?</p><p>And, do <strong>personal fulfillment</strong> and <strong>happiness </strong>matter to you <em>as much or more</em> than <strong>keeping up with the Joneses</strong>?</p><p><strong><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong></strong><br></p><p>If any one of the points above applies to <strong>you</strong>, then <em>pay attention</em> to what I'm about to tell you (even MORE so if <em><strong>two</strong></em><strong></strong> of the previous descriptions fit you!)<strong></strong></p><p><strong>Teens and high schoolers</strong> can take this course to experience a whole-life <strong>transformation</strong> - to find new purpose in their <strong>high school lifestyle</strong> as WELL as uncover <strong>more free time</strong> and <strong>ditch stress </strong>- ALL while actually <strong>improving your college resume</strong>!<strong></strong></p><p>Transform from being tossed around by events in high school to charting your own path in life<strong>.</strong></p><p><strong><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong></strong><br></p><p><strong>Wanted to include just a few testimonials from my time as a teacher:</strong></p><p><em>\"Just a short note to tell you WHAT a FABULOUS job that you are doing with the class. Luke has really appreciated your teaching manner &amp; not complained about going!  WOW – credit to you!!  </em><em>Best,\" - </em><em>Jennifer N. (Mom of one of my students)</em></p><p><em><em><strong>-----------------------------------------------------------------------------------------------------</strong><strong>--------</strong></em><br></em></p><p><em>\"By the way, thank you for the added bonus of guiding Alia in her future.  She said you were an excellent SAT teacher, but more importantly a remarkable life coach! ;-))\" - </em><em>Jinous R (Mom of one of my students)</em></p><p><em><strong>-----------------------------------------------------------------------------------------------------</strong><strong>--------</strong><br></em></p><p><em>\"Love the SAT has been a lifesaver for my SAT score! I came into it thinking it was just another SAT class, but after just one class I felt an improvement. My attitude has changed into a more positive one because of the teacher, Christian. His enthusiasm and tips and tricks made a huge difference! After a lot of practice with the skills I've learned at Love the SAT, my score improved by 400 points. I'm very satisfied with my score, and I highly recommend Love the SAT!\"  - Kasmira M., high school student<br></em></p><p><em><strong><em><strong>-----------------------------------------------------------------------------------------------------</strong><strong>--------</strong></em><br></strong></em></p><p>It's not hard to help a smart teenager TRANSFORM their life in high school, but it DOES require an exceptionally talented, empathetic and experienced teacher who students can <em>relate</em> to.</p><p>Sometimes it's hard for parents and students to make the connection, since it's such an INTENSE relationship during high school and you're both under so much pressure.<span></span></p><p>That's where I come in! As a tutor, entrepreneur, and <strong>a bit of a difficult case myself</strong> in high school, I have a <em>rare</em> <em>talent</em> for helping teens go from a constant state of rushing panic (<em>or</em> a state of aimless laziness!) to a calm, measured and successful approach to life that's more FUN and more SUCCESSFUL than the old ways... </p><p>And best of all this transformation will help you have a BIGGER and MORE AUTHENTIC IMPACT on the world.</p><p><strong>-----------------------------------------------------------------------------------------------------</strong><strong>--------</strong><br></p><p><strong>My favorite \"testimonial\" ever, from one of my students in China:</strong><em></em></p><p><em>I met a teacher, his name was Christian. He always smiled, everytime had a happy look in his face. He was also really energetic, he went from one side to the other side of the classroom. Every single class Christian told us that we need to have motivation in order to be good at anything in this world. After hearing these words for a week. I finally got some motivation. I closed everything, every electronic device that would bother me. I spent just 20 minutes everyday after school memorizing vocabs. After few months I figured out that I had learned more then 500 words perfectly. I realized that it wasn't me who was bad at memorizing things. It was myself who didn't have motivation to do things. I was going the easy, lazy way. Although it was a short time being with Christian, I had learn alot of things from him. He was the engine that started me to get going. If I meet him again I really want to thank him.</em><em> I wish i could eventually meet him again. <span></span></em></p><p><strong>-----------------------------------------------------------------------------------------------------</strong><strong>--------</strong><br></p><p>This is the ULTIMATE course on Time Management for teens and it contains EVERY essential lesson, quiz, and reading we could pack in.</p><p>Complete the entire course from start to finish (6+ hours of material) or <em>pick and choose</em> from the well-organized lecture titles.</p><p>Since the students who need this course are <em>already busy</em>, it's designed in easily-digestible bite-sized sections.</p><p>You can study this course for a <em>weekend</em> or you can study it for <em>years</em>. The choice is completely up to you.</p><p><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong><br></p><p><strong>Sections of this course:</strong><br></p><ol><li>Intro to the Course and Instructor</li><li>Timeless Time Management Principles</li><li>High School Time Management</li><li>Conclusions, Review, and Action Steps</li></ol><p><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong><br></p><p><strong>Key lessons in the course:</strong></p><ul><li>How teens can identify their life passions</li><li>The top 3 timeless rules of time management</li><li>How to create rhythm in your schedule</li><li>Advanced high-school homework tactics</li><li>Making space for SAT / ACT test prep</li><li>Planning for college apps and deadlines</li><li>Managing social life and peer pressure</li><li>How to use study groups to win big</li><li>How to use weekends and vacations in high school</li><li>A preview of college-level time management</li><li>... and much, <em>much</em> more that couldn't <strong>possibly</strong> fit here!</li></ul><p><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong></p><p><strong>Additional features:</strong><br></p><ul><li>5x comprehension quizzes to enhance your experience</li><li>Personal access to ask questions of the instructor</li><li>Access to the complete Course Discussion forum</li><li>Hi-Definition video and audio for clean and crisp content delivery</li><li>30-Day Money Back Guarantee</li><li>Lifetime Access to course and updates</li></ul><p><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong></p><p>Right now, the price for enrollment in the course is set at a level I know EVERYONE can afford.</p><p>Of course, there's actually no risk to enrollment (since you've got the 30-day money back guarantee to decide if you love it or not)...</p><p>But... the price for the course MAY go up in the future. In the right hands, I think the information in this course is <em>tremendously</em> underpriced.</p><p>I encourage you to <strong>enroll</strong> in the course today to become a TRULY GREAT high school student and a more fulfilled human being - to take you not only to <strong>admittance</strong> to your top-choice <strong>colleges and scholarships</strong> but also to <em>live a life</em> you don't even dare to dream of yet<em>.</em></p><p><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong><br></p><p><strong>Important information before you enroll:</strong></p><ul><li>This course comes with a 30-day, no questions asked, <strong>money-back guarantee!</strong></li><li><strong>Ask the instructor</strong> questions DIRECTLY inside and get personal responses.</li><li>Once enrolled, receive unlimited <strong>lifetime access</strong> to the course!</li><li>Instant and free access to all <strong>future course updates</strong>.</li><li><strong>Direct personal support</strong> regarding any issues or suggestions related to the course.</li></ul><p><strong><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong></strong></p><p>Be sure to check out the curriculum and <strong>PREVIEW your FREE lectures</strong>:</p><ul><li>Check out the curriculum and course contents below.</li><li><strong>PREVIEW</strong> several free and VALUABLE lectures from the course below.</li></ul><strong><strong>-----------------------------------------------------------------------------------------------------</strong>--------</strong><p><strong>Now,</strong> it's time to <strong>take the </strong><strong>Ultimate Time Management Course for Teens</strong> to discover your true abilities and to <strong>reach your next level-up in life</strong>.<br></p><p>Your personal search and suffering is over.. take action! </p><p><strong>Enroll now... </strong><strong>And I'll see you on the inside!</strong></p>", 
    "end_date": null, 
    "title": "Ultimate Time Management for Teens and Students", 
    "price": "20.00", 
    "instructors": "Christian Heath", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724922_ec7f_2.jpg", 
    "course_url": "https://www.udemy.com/ultimate-time-management-for-teens-and-high-school-students/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T01:26:22Z"
}