{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Der Onlinekurs Zeitmanagement umfasst fünf Module. Sie können den Kurs nach Ihrem Tempo durchführen. Nehmen Sie sich genug Zeit für die einzelnen Lektionen.</span>  </p>  <p style=\"\">  \tIch zeige Ihnen, wie Sie die Verwendung Ihrer Zeit bewusst gestalten können. Wie Sie Klarheit darüber erlangen, wo Sie überhaupt hin möchten und wie Sie es schaffen können, dort auch wirklich anzukommen - mit Begeisterung und Spaß.  </p>  <p style=\"\">  \tEbenso zeige ich Ihnen Strategien zur Strukturierung und Planung Ihrer Woche und Ihrer Tage, mit der Sie Ihre gewünschten Ergebnisse erzielen können.  </p>  <p style=\"\">  \tZu oft beschäftigen wir uns im Alltag mit Dingen, die uns langweilen und uns nicht voran bringen. Vielleicht bereiten Ihnen diese Dinge Vergnügen, doch glücklicher machen sie Ihr Leben leider nicht.  </p>  <p style=\"\">  \tDie Lebensfreude bleibt einfach auf der Strecke.  </p>  <p style=\"\">  \tIch möchte Sie dabei unterstützen einen Weg zu finden, dass Sie Ihre Tage mit mehr Lebensfreude füllen und wieder begeistert sind von den Dingen, die Sie tun - nicht nur, doch besonders, weil Sie darin einen Sinn sehen.  </p>  <p style=\"\">  \tEs geht nicht darum Ihrem Leben mehr Tage zu geben, sondern darum Ihren Tagen mehr Leben!  </p>  <p style=\"\">  \tKonzentrieren Sie sich auf die Dinge, die Sie Ihren Zielen näher bringen. Priorisieren Sie diese. Schenken Sie diesen Ihre volle Aufmerksamkeit und erledigen Sie sie fokussiert und schnell.  </p>  <p style=\"\">  \tStrukturieren und planen Sie Ihre Wochen und Tage so, dass Sie wissen, wann Sie welche Ergebnisse produziert  haben und wann Sie freie Tage mit sich selbst, Ihrer Familie und Ihren Freunde verbringen.  </p>  <p style=\"\">  \tStrategien und Methoden hierfür finden Sie im Onlinekurs Zeitmanagement.  </p>  <p style=\"\">  \tJetzt ist Ihre Zeit. Heute ist Ihr Tag. Verschieben Sie es nicht auf später oder irgendwann, denn die traurige Wahrheit ist, dass später und irgendwann zu oft NIE bedeuten.  </p>", 
    "end_date": null, 
    "title": "Weniger arbeiten, mehr erreichen - Onlinekurs Zeitmanagement", 
    "price": "50.00", 
    "instructors": "Mathis Uchtmann", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421002_caad_2.jpg", 
    "course_url": "https://www.udemy.com/onlinekurs-zeitmanagement/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T11:48:54Z"
}