{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you find that you have a problem with procrastination? Do big tasks easily pile up and overwhelm you? Are you worried that your lack of productivity could be putting you in an insecure position at your job? And do you find that it even spills over into your personal life?\n\n  </p>\n\n<p>Learning effective work productivity isn’t just about responsibility; it’s about learning how to better your life in every aspect. Those who know how to manage their work effectively are able to finish tasks on time and see goals through to the very end. Think of your goals and current obligations as mountains to climb. Some are enormous; some are bunny hills in the backyard. But, regardless of their size, all are easier to climb when you aren’t trying to juggle while hopping up them on one leg. \n\n  </p>\n\n<p>And though this is a strange example, it easily shows you how important work productivity is. Ultimately, it will decide how far you get in life, from your level of career to how much money you make. And if you already have to climb up daily mountains, you should afford yourself every opportunity for it to be an easy hike. \n\n  </p>\n\n<p>‘Work Productive’ is an amazing course that will make you productive in every aspect of your life: how to maintain the needed energy; how to juggle the daily requirement of both work and personal responsibilities; and how to do it all with plenty of time to spare!\n\n  </p>\n\n<p>This is a course that is meant to prepare you for the future. Your potential is great and the places you can go are far above your current level. If your overwhelming tasks are keeping you from conquering daily mountains and climbing to new heights, sign up for my course. I will have you ready for whatever comes your way! </p><u>Is Work Productive good for me?</u>\n\n<p>·      Are you tired of living your daily life in a prison of clutter? \n\n  </p>\n\n<p>·      Are you locked into old cycles of this never ending chain of frustration? \n\n  </p>\n\n<p>·      Are you tired of being told that every step from here on out is going to be ‘long and                  drawn out’ when you know that there is a quicker way that’s just as effective?\n\n  </p>\n\n<p>·      Would you like to have more energy?\n\n  </p>\n\n<p>·      Would you like to be able to focus more?\n\n  </p>\n\n<p>·      Would you like to have more time to do the things you WANT to do?\n\n  </p>\n\n<p>·      Would you like to create a lifestyle that allows you to live your passion and get paid for             it?\n\n  </p>\n\n<p>·      Are you willing to put in the effort if only given the right opportunity for the right price?</p>", 
    "end_date": null, 
    "title": "Work Productive: Create A Lifestyle of Freedom & Happiness", 
    "price": "45.00", 
    "instructors": "Therapy Teacher LLC- Beau Laviolette", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/141060_cfd4_4.jpg", 
    "course_url": "https://www.udemy.com/work-productive-6-week-platinum-program/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-02T20:49:08Z"
}