{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Everybody is blessed with a powerful brain,the right part which is creative in nature .</p><p>It can think and develop innovative ideas which are very much necessary for the development of mankind.</p><p>All\n intelligent people such as the scholars,the scientists,the professors \netc..possess lot of knowledge which should not perish with their demise.<br></p><p>The\n knowledge and skills acquired by various people should be propagated \nfor use by the people of future generations to continue development,.It \nis possible only by transferring the data by writing in the form of \nbooks or by recording.</p><p>Therefore writing book is a very important activity of the educated people to share their knowledge with other people.</p><p>Even\n though lot of people possess lots of knowledge not many of them do have\n the skill of writing books for want of specific knowledge of writing.</p><p>This\n course which is strengthened with several lectures covering all aspects\n of writing help all such interested people to learn the techniques of \nwriting  a book the fastest way.</p><p>By repeatedly practicing\n writing in the prescribed manner the  student will develop the skill to\n write and publish his books to get name fame money satisfaction and \nfinally happiness.</p><p>Various lectures of this course \ndiscusses the 3 important stages involved in book writing and publishing\n thoroughly in an interesting manner so that anybody with interest to \nwrite a book can write soon and become an established author.</p><p>No\n prior experience of writing is needed to understand and practice the \ntechniques explained in this course except the interest and enthusiasm \nto write a book.</p><p>                                                                Aspirant Book writers</p><p>                                                                         Best of luck <br></p>Let us meet again in the lecture sessions ,if you register for this course.<p><strong></strong></p><p><strong>The Ultra Productivity Course :</strong></p><p><strong>You'll Be Amazed How Easy It Is To Achieve Your Goals In Half The Time!</strong>  Do you often wonder how some people can get twice as much work done in a smaller time frame than you? Were these people born with higher energy levels and laser beam focus?  Of course the answer is no. However, they do have the right tools, techniques, and strategies that allow their minds, bodies, and emotions to perform at a higher level.  The good news is that all these things can be learned and replicated quickly. In fact, you can double your productivity</p><p>Did you know that most people restrain themselves from performing anywhere near as well as their minds and bodies were naturally designed to perform? Most people believe that productivity is all about prioritizing your tasks throughout the day, but in reality there is a lot more to it than that.</p><p>Imagine yourself producing better quality of work in half the time it used to take you. And, you'll enjoy your work a lot more. After applying these methods you will be amazed with how easy it is to double your productivity.</p><p><em><strong>Improve your productivity and reach your goals faster than you ever thought possible.</strong></em></p>", 
    "end_date": null, 
    "title": "Write A Book The Fastest Way +The Ultra Productivity Course ", 
    "price": "20.00", 
    "instructors": "Harris Crystal's Smart Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502566_fa06_11.jpg", 
    "course_url": "https://www.udemy.com/superlearning-speedreading-double-your-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T04:07:22Z"
}