{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*Winner of the Udemy Summer Camp Course Creation</strong></p><p>“Writing 10,000 words a day is possibe.”</p><p>“What? 10,000 words in one day? Come on, Manuel. You’ve got to be kidding me.”</p><p>“I’m not. Do you know those <strong>writing sessions where nothing exists except for you and the words you type</strong>? Those moments of pure concentration where you <strong>enjoy your story so much it can make you cry with laughter</strong>. I’m lucky to experience that often. And I’m happy to say you can also have more of those memorable sessions if you <strong>take your writing productivity to the next level. </strong>That’s basically the purpose of this course.</p><p><strong>E</strong><strong>veryone has ideas. The hard part is to externalize them</strong>. And this is something very common in writing. I've met several people who would love to turn inspiration into words, but they never do it. Perhaps they aren't motivated enough. Other times it is a lack of organization or knowledge which makes them fail. <strong>There is always an excuse that prevents us from being productive, and this makes our dreams disappear without even having tried to accomplish them. But now there is a solution to all that, and it's this course.</strong><br></p> <p>Many people have great ideas or just the intention of writing something like an article, a book, a blog post or a personal diary, but they never actually do it because they lack <strong>the main ingredient that makes a writer successful: habits</strong>. The objective of this course about writing productivity is to fix that problem. <strong>I have elaborated every single lesson to help you:</strong></p><ul><li><strong>Develop effective and fun writing habits</strong></li><li><strong>The Best Writing Productivity Techniques</strong></li><li><strong>Write from 0 to 10k Words a Day Step by Step</strong></li><li><strong>The Secrets to Get Instant Creativity</strong></li><li><strong>Use the Latest Software to Develop your Writing Projects</strong></li></ul><p>Here's a list of the topics that you'll find:</p><ol><li><strong>Motivation,</strong> where we will learn how to be inspired and passionate with our topic and our writing right from the start. </li><li><strong>Organization,</strong> to make sure that we set achievable writing goals on a regular basis. </li><li><strong>Productivity, </strong>where I'll give practical writing resources that you can implement right after the lesson to keep concentrated, Avoid Distractions and Manage your Time and Effort properly. </li><li><strong>Creativity, </strong>where we'll understand the whole process that is required to generate our greatest ideas.</li><li><strong>LiterAPPture,</strong> where I show and explain how you can use the best software available to develop your writing projects effectively.</li></ol><p>In fact, you can preview some lessons for free to check their quality. What is more, you get a <strong>30 day money back guarantee</strong>. Watch them, <strong>join the course and get some serious writing done. Writing Productivity will make you feel like a pro writer.</strong> Welcome!</p>", 
    "end_date": null, 
    "title": "Writing Productivity", 
    "price": "20.00", 
    "instructors": "Manuel Arnedo", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/360618_f360_4.jpg", 
    "course_url": "https://www.udemy.com/productivityforwriters/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-01T17:47:29Z"
}