{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course fully updated on June 2016.</strong></p>\n\n<p>Learn how to make daily progress towards your goals in 5 steps!<br></p>\n\n<p>But first, a few questions:</p>\n\n\n\n<ul><li>Do you often find yourself setting new years resolutions or goals that never happen?</li><li>Are you frustrated in having to start over every single time?</li><li>Do you feel like you lack the motivation or time to work on what you love?</li></ul>\n\n\n\n<p>Don't worry, I totally understand how you feel.</p>\n\n\n\n<p>One of my goals two years ago was making and releasing an online course. The problem was I had no idea where to start and i was trying to balance that with parenthood.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">It was frustrating and I felt like i had no direction.</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">When I learned a simple method to help me create clear goals that I can do to consistently.</strong> I practically woke up everyday motivated.</p>\n\n\n\n<p>I understand the need to feel like you need to do everything. In reality, if you do simple steps day by day, you'll achieve what you set out to do. It may feel like you're not doing much at first, but it's the small steps that lead to the big victory.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">My philosophy is simple: simplicity and consistency breeds success.</strong></p>\n\n\n\n<p>I've had the pleasure of implementing these same steps with my dance crew which has been going strong for 11 years and has won multiple championships, my clients in where they lost 20-40 pounds of weight, my business in earning thousands of dollars, and my personal life where I learned how to balance working at home and building a family.</p>\n\n\n\n<p>Before I go into the details of my course, let's take a look at your options</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Seminar/Workshop </strong>- These are great because you really get to dive in and immerse yourself with likeminded people and learn from the best minds out there. The problem is, what if you don't have the time or the money to commit to this?</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Hire a coach</strong> - A lot of coaches can cost from $300-$2,500 an hour. If you can afford this, I recommend you go for it. If not, let's take a look at your next option.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn for free on YouTube</strong> - There's a lot of free information out there to help you get started in helping you set goals and action steps. But do you really want to spend hours and hours looking?</p>\n\n\n\n<p><em>\"Off the bat, I could probably write a long essay about how Emeroy Bernardo's teachings have positively influenced my life. That's what Roy does as a coach, he gives advice that can help changeone's life. Whether he is a coach for health, fitness, dance, etc. Roy can always find an inspiring quote or motto to help motivate you. He does not only coach verbally. He \"walks the talk.\" Roy is a physical example that \"actions speak louder than words.\" He stays healthy, dances his heart out, lives life to the fullest, and remains respectful to those around him. I call him \"Coach Guru\" because he is the perfect balance of being a motivational coach while including how to stay relaxed.\" </em><strong class=\"redactor-inline-converted\">-Jazlynn Pastor</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">In my course, Yearly Gameplan, I take you through 5 steps in how to create clarity for your personal goals so you can create a weekly, monthly, or yearly game plan. </strong>A course designed for people like you who are frustrated in starting over.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Let's take a quick look at these steps:</strong></p>\n\n\n\n<ol><li><strong class=\"redactor-inline-converted\">Creating A Powerful Vision. </strong>Without clarity of what you want in your life, you're not going to accomplish much.</li><li><strong class=\"redactor-inline-converted\">The Wheel of Life.</strong> There's more to life than to work. If you've ever felt like your life was out of balance, this exercise will help you determine where you need to shift your .This video is going to help you determine which area in your life needs attetntion so you can restore that balance</li><li><strong class=\"redactor-inline-converted\">Personal Goal Setting.</strong> Most people set goals without creating enough clarity or they expect it to magically happen. You'll learn how to create specific goals and specific steps to take to get there so you're making daily progress.</li><li><strong class=\"redactor-inline-converted\">Creating your Gameplan. </strong>Learn how to take advantage of your weeks by distributing your action steps so you don't feel rushed or overwhelmed to do everything in one day.</li><li><strong class=\"redactor-inline-converted\">Setting Up Your Day For Success</strong>. What you do immediately after waking up is essential for your perseonal productivity. In this step you'll learn how to start your day off right.</li></ol>\n\n\n\n<p>You'll also be receiving additional bonus footage I've shared on my YouTube show, EmeroyTV, such as what to do when you feel like giving up, or when it's time to give up on a goal.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">These are simple videos with exercises to help give you clarity and direction.</strong></p>\n\n\n\n<p>If you want to make sure that you're on the right track or need support, you can shoot me a message of what you're up to and I'll give you some feedback.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">My intention for this class is for you to be able to go after your passions while balancing your life.</strong></p>\n\n\n\n<p><em>\"He makes sure he always delivers and gives amazing product. Emeroy will guide you the best way he can to make you understand what your learning. What's great about him is that he's always prepared. You can count on him! He teaches you life lessons on top of what you requested to be taught.\" </em><strong class=\"redactor-inline-converted\">-Marc Miranda</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Imagine...</strong></p>\n\n\n\n<ul><li>Not having to worry about staying motivated</li><li>Not having to start over any more.</li><li>Being able to balance your passion with the rest of your life</li><li>Not worrying about whether or not you're making any progress towards your goal</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Join The Course If You...</strong></p>\n\n\n\n<ul><li>Want to achieve your personal goals</li><li>Want to be pushed beyond your comfort zone</li><li>Want to follow a simple format in personal goal setting</li><li>Want to be held accountable.</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Don't Join The Course If You...</strong></p>\n\n\n\n<ul><li>Aren't committed to personal goals...</li><li>Are satisfied with where you're currently success</li><li>Don't see the value in investing in yourself.</li><li>Are not committed to completing your goals</li><li>Are not ready to be held accountable</li></ul>\n\n\n\n<p><em>\"Conversations with Emeroy are nothing but encouraging and anything but the \"norm\". Any idea you have he says is possible and he always has an out of the box way of thinking. What's also comforting is that he doesn't pretend to be perfect. He loves to admit where he started from and how he is still transforming. He is a man that is striving everyday for the better and that is what life and growth is about.\" </em><strong class=\"redactor-inline-converted\">-Dominique Pompa</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">No Risk. Money 30-Day Money Back Guarantee.</strong></p>\n\n\n\n<p>I believe so strongly in this course that I'll take on all the risk. If you enroll and don't like it, you can have your money back within the first 30 Days.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">The Question Now Is: Are You Going To Step Up?</strong></p>\n\n\n\n<p>I've told you everything you need to know in regards to the course. The ball's in your court now.</p>\n\n\n\n<p>You can either continue trying again and again, reading up the latest tip on goal setting or...</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">You can join the Yearly Gameplan where you'll be given clear steps and guidelines you need without over complicating anything.</strong></p>\n\n\n\n<p>The only thing between you and where you want to go is enrolling up for the course. Enroll Now.</p>", 
    "end_date": null, 
    "title": "Yearly Gameplan: Get More Done Without Feeling Overwhelmed", 
    "price": "30.00", 
    "instructors": "Emeroy Bernardo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514396_75f9_8.jpg", 
    "course_url": "https://www.udemy.com/yearly-gameplan-get-more-done-without-feeling-overwhlemed/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T07:06:18Z"
}