{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><strong>Your morning creates your day. Your day creates your life. </strong><br></strong></p><p>If you get the morning right, the rest of your life will flow much easier and more successful.</p><p><strong></strong></p>\n\n<p><strong>Imagine waking up feeling inspired about your life - everyday.</strong></p>\n\n<p><em>In this life-changing course:</em><br></p>\n\n<ul><li>You'll overcome morning chaos and start your day strong</li><li>You'll discover the little things you can do each day that make you feel happier and more productive</li><li>You'll easily create your own personal morning routine that makes your day fun, exciting, rejuvenating and inspiring</li></ul>\n\n<p><em><strong>As you Wake Up Inspired:</strong></em></p>\n\n<ul><li>You'll find that life becomes more fun and more meaningful. </li><li>You'll be able to do more in less time. </li><li>You'll be able to show up better and face challenges with greater ease.</li></ul>\n\n<p>In short, upgrading your morning routine can be the<em><strong> best gift you've ever given yourself.</strong></em></p>\n\n<p>In this powerful course, we go into depth about why it's so essential to have a morning routine and \"me\" time, and how to create your morning ritual that lasts. It's not always easy to create new habits and sustain them, but with this course, you'll be able to <strong>create new habits that actually 'stick'.</strong> </p>\n\n<p>Empowered habits are essential to our mental, emotional &amp; spiritual health. </p>\n\n<p>We need space to think. We need space to 'just be'. And when we get this space to ourselves first thing in the morning, the entire remainder of our day is blessed with creativity, productivity, insights, awareness and a calm state of being.<br></p>\n\n<p>It's what's missing from our world today. Everyone just wakes up and goes right to checking their cell phones and running around in crisis. But where are the boundaries from the world? Where are the quiet moments to your self, so you can hear your own thoughts? Where is the time to deeply listen to your higher self, before the noise and craziness of the day starts?</p>\n\n<p>We must change things here and return to taking care of ourselves FIRST, before the noise and demands of the day. If we don't, we run a high risk of leading a life untrue to ourselves. If we never take to time to be with ourselves, really and truly, how can we expect to be in touch with our higher guidance? How can we expect to be productive and effective in our actions. The truth is we can't. And so, it is time to return to you joy and peace of mind, it's time to create a morning routine that gives you wings. </p>\n\n<p>It's time to wake up inspired.</p>\n\n<p>PLUS - you'll get a bonus lecture from #1 best selling author, Tom Corson-Knowles about how to work LESS and achieve more by adding a simple daily practice that takes just 5 mins per day.</p>\n\n<p>By doing this course you are guaranteed to improve your morning and set your self up for success in the rest of your life.</p>\n\n<p>You're awesome. Make your morning something you look forward to!</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Your Morning Routine: How To Wake Up Productive Every Day", 
    "price": "25.00", 
    "instructors": "Michael & Arielle, Tom Corson-Knowles", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527182_8e74_2.jpg", 
    "course_url": "https://www.udemy.com/wake-up-inspired-how-create-your-ultimate-morning-routine/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T01:35:49Z"
}