{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Do you struggle with completing projects or specific tasks?</strong>  </p>  <p style=\"\">  \t  We all do, up to an extent. Some more, some less, but at the end of the day, we all have that inner drive to do less than what we can. But not anymore; it&#039;s time to stop. That&#039;s why this course will help you unlock the best version of yourself. It doesn&#039;t matter what you do for a living, you need to be productive to succeed in life. The fact is that the amount of success you achieve both in business and life is determined by your ability to get down to work, overcome impeding barriers (<em style=\"\">like the Procrastination Devil</em>), ultimately increasing the quality of your output in less and less time! It’s determined by the ability to GET DOWN TO WORK, go out and exercise, maintain your diet. It&#039;s determined by the ability to do what you have to do, when you have to do it, whether you feel like it or not.  </p>  <p style=\"\">  \t<strong style=\"\">My Goal?</strong>  </p>  <p style=\"\">  \t  My goal is simple. I will help you get free from the chains of procrastination. Together, we will go to the roots of <em style=\"\">productivity, procrastination, time management, self discipline &amp; self control</em> and transform that knowledge into a simple step by step guide that will change forever the way you approach life.  </p>", 
    "end_date": null, 
    "title": "Zap Your Procrastination for Productivity & Time Management", 
    "price": "20.00", 
    "instructors": "Romuald Andrade", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405202_8040_3.jpg", 
    "course_url": "https://www.udemy.com/zap-your-procrastination/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T11:43:19Z"
}