{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\"هذا الكورس هو النسخة العربية لكورس تنظيم الوقت الذي أدربه\"</p>\n\n<p>بحكم خبرتي في مجال الصحافة أزعم <strong>أنه من السهل جدًا نشر أي فكرة في أي مجتمع </strong>من خلال التأكيد عليها بما فيه الكفاية بالطريقة الصحيحة والوقت المناسب، وهذا هو السبب في أنني شعرت بالحاجة لنشر فكرة صائبة عملية لتحويل كل لحظة نعيشها لقيمة من أجل تحقيق هدفك.</p>\n\n\n\n\n\n<p>هذا بالطبع لا يمكن أن يتحقق في يوم واحد ولكن تطبيقه عمليا سيترك أثرا على حياتك كلها.</p>\n\n\n\n\n\n<p>أنا أؤمن أنه <em>من الممكن تحقيق كل ما نصبو إليه، </em>إلا أننا نحتاج فقط أن نخطط بشكل صحيح وأن نمتلك الأصول الفعالة للوصول لأهدافنا. أؤمن أيضًا أن <strong>العنصر الرئيسي الذي يفرّق بين من يعيش لتناول الطعام والشراب، والنوم، والزواج، ثم يموت، وبين الذين يتمتعون فعلا بحياتهم ويكون لهم تأثير على العالم هو تنظيم الوقت.</strong></p>\n\n\n\n\n\n<p>يحول هذا الكورس ذاك العنصر - تنظيم الوقت - إلى عادة يومية تلقائية، <strong>ويتم تحديثه</strong> - أي الكورس - من آن لآخر ليواكب الضغوطات والمسئوليات التي تتزايد يومًا بعد يوم.</p>\n\n\n\n\n\n<p>لكي لا يتشتت انتباهك؛ تم تصميم الدورة في أبسط عروض باور بوينت، ملفات PDF، وبالطبع ملفات الفيديو.</p>\n\n\n\n\n\n<p><u>نظام Udemy يسمح لك بـ 30 يوما لاسترداد كامل أموالك. أنا أيضا أقدم بعض المحاضرات من هذه الدورة، لمعاينة مجانية لضمان عدم ضياع وقتك أو أموالك فيما لا ترضى عنه.<br></u></p>\n\n\n\n\n\n<p>لأن كل لحظة تمضي لن تأتي مرة أخرى، ولأن كل لحظة يمكن أن تكون أكثر قيمة مما هي عليه حاليا، سجل في هذه الدورة الآن، وإذا لم تحصل على ما وعدتك، <strong>استرد أموالك كاملة (لا توجد أي مخاطرة)</strong>.</p>\n\n\n\n\n\n<p>عش كل لحظة؛ استمتع أو تعلم أو كليهما.</p>", 
    "end_date": null, 
    "title": "كيف تنظم وقتك وتضاعف قدرتك الإنتاجية كالفراعنة في 2016", 
    "price": "25.00", 
    "instructors": "Amgad El-Sakka", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/720654_fb8a.jpg", 
    "course_url": "https://www.udemy.com/time-management-course-in-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Productivity"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T11:23:54Z"
}