{
    "selfpaced": false, 
    "topic_name": [
        "Statistics & Probability"
    ], 
    "description": "\n\n                    \n                    \n                    Ce cours d'introduction aux probabilités a la même contenu que le cours de tronc commun de première année de l'École polytechnique donné par Sylvie Méléard.\n\nLe cours introduit graduellement la notion de variable aléatoire et culmine avec la loi des grands nombres et le théorème de la limite centrale. \n\nLes notions mathématiques nécessaires sont introduites au fil du cours et de nombreux exercices corrigés sont proposés.\n\nCe cours propose aussi une introduction aux méthodes de simulations des variables aléatoires comme la méthode de Monte Carlo. Des expériences numériques interactives sont également mises à votre disposition pour vous permettre de visualiser diverses notions.\n\n                                            Syllabus\n                        VECTEURS ALÉATOIRES (1/2)Nous entamons cette semaine le Cours 4 dont le sujet est les vecteurs aléatoires, c'est-à-dire, une collection finie de variables aléatoires réelles, comme par exemple des couples de variables aléatoires. Ce cours s'étend sur deux semaines.  VECTEURS ALÉATOIRES (2/2)Il s'agit de la suite et de la fin du Cours 4. Nous allons en particulier généraliser le résultat qui nous permet de faire des calculs de lois.CONVERGENCES ET LOI DES GRANDS NOMBRES (1/2)Nous entamons le Cours 5 dont l'objet principal est le théorème communément appelé la « loi des grands nombres ». Nous introduirons aussi plusieurs notions de convergence d'une suite de variables aléatoires.CONVERGENCES ET LOI DES GRANDS NOMBRES (2/2)Nous terminons le Cours 5 en donnant des exemples d'applications de la loi des grands nombres. Nous introduisons également la méthode de Monte Carlo.FONCTIONS CARACTÉRISTIQUES, CONVERGENCE EN LOI ET THÉORÈME DE LA LIMITE CENTRALE (1/2)Nous commençons le Cours 6, le dernier de ce MOOC, à cheval sur deux semaines. Cette semaine, on introduit un nouvel outil très puissant : les fonction caractéristiques. FONCTIONS CARACTÉRISTIQUES, CONVERGENCE EN LOI ET THÉORÈME DE LA LIMITE CENTRALE (2/2)Cette dernière semaine est consacrée au second pilier de la théorie des probabilités : le théorème de la limite centrale. Ce résultat nécessite une nouvelle notion de convergence : la convergence en loi. Nous verrons notamment une application aux intervalles de confiance qui sont utilisés pour les sondages.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Aléatoire : une introduction aux probabilités - Partie 2", 
    "price": 0, 
    "instructors": "Sylvie Méléard, Jean-René Chazottes and Carl Graham", 
    "institution_name": [
        "École Polytechnique"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/probabilites-2", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}