{
    "selfpaced": false, 
    "topic_name": [
        "Statistics & Probability"
    ], 
    "description": "\n\n                    \n                    \n                    Ganz gleich in welcher Wissenschaftsdisziplin, Statistik ist das Schweizer Armeemesser für die Behandlung von vielen Zahlen – um daraus wenige Zahlen zu machen. Das klingt unspektakulär, hat aber schon so manchen Studierenden der Human-, Wirtschafts- und Naturwissenschaften an den Rand der Verzweiflung geführt. Dabei ist Statistik überall, in den alltäglichsten Situationen und den komplexesten Forschungsfragen.\r\nIn dieser Einführung kümmern wir uns um das Fundament der Statistik, die Wahrscheinlichkeitstheorie. Das klingt schlimm, ist es aber nicht. Wir erfahren etwas über die männliche Sicht weiblichen Intellekts, antike Cassettenhüllen, gezinkte Würfel, Milchreis, Hochrisiko-Sportfeste und vieles mehr, das uns den Einstieg in die Welt der Wahrscheinlichkeit so leicht macht als sei die Statistik auf eine strenge Diät gegangen.\r\nKursstruktur\r\nDer Kurs deckt ein halbes Semester Grundstudiumsstatistik für Nicht-Mathematiker ab und besteht aus sechs Lerneinheiten mit jeweils 90 Minuten Lernvideos. Diese Videos sind das zentrale Lernelement des Kurses und werden durch Anwendungsbeispiele in Microsoft Excel unterstützt. Zusätzlich kannst Du bei jedem Video Deinen Lernfortschritt über Quizfragen testen. Am Ende jeder Lerneinheit steht oft eine größere Übungsaufgabe, deren Lösung Dir per Video vermittelt wird.\r\nLernergebnisse\r\nAm Ende des Kurses wirst Du die grundlegenden formalen Elemente der Wahrscheinlichkeit kennen. Du wirst verstanden haben, was sich Pierre Simon Laplace und Nikolaj Kolmogoroff unter dem Begriff Wahrscheinlichkeit vorgestellt haben. Du wirst mit bedingten Wahrscheinlichkeiten und dem Satz von Bayes umgehen können. Und schließlich wirst Du Dich in vielen Wahrscheinlichkeitsverteilungen zurechtfinden wie der Binomialverteilung, der Poissonverteilung, der hypergeometrischen Verteilung und der Normalverteilung.\r\nVorkenntnisse\r\nAlles, was Du zum Genuss der Wahrscheinlichkeitstheorie brauchst, lernst Du hier. Du brauchst keine besonderen Vorkenntnisse, denn mehr als Plus, Minus, Mal und Geteilt wird hier kaum gerechnet. Versprochen! Also schau vorbei und lern mit uns die Statistik von einer ganz neuen Seite kennen.\n\n                                    ", 
    "end_date": "2014-03-03T00:00:00Z", 
    "title": "Einführung in die Wahrscheinlichkeitstheorie", 
    "price": 0, 
    "instructors": "Anja Mihr", 
    "institution_name": [
        "Johannes Gutenberg University Mainz"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://iversity.org/courses/einfuhrung-in-die-wahrscheinlichkeitsrechnung", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2014-01-06T00:00:00Z"
}