{
    "selfpaced": false, 
    "topic_name": [
        "Statistics & Probability"
    ], 
    "description": "\n\n                    \n                    \n                    Si alguna vez has tenido problemas con la estadística, este curso está hecho para ti. Es ideal para investigadores y alumnos que se encuentran cursando trabajos fin de grado, trabajos fin de máster o realizando la tesis y que quieren realizar un análisis cuantitativo en sus estudios.\r\nPartimos sin nivel de conocimientos previos y está dirigido a todo el mundo que tenga inquietudes en la interpretación de datos estadísticos. Además, es ideal para recordar y actualizar los conocimientos que ya tiene sobre estadística básica, proporcionándole un buena base para su investigación, de una manera muy sencilla de comprender.\r\nEs un curso muy intuitivo, en el que hacemos énfasis en la utilidad que le proporciona al alumno de cualquiera de las disciplinas del conocimiento, ya sean para estudios en ciencias sociales o ciencias de la salud, donde ponemos de manifiesto las ventajas y las limitaciones de cada una de las técnicas.\n\n                                            Syllabus\n                        Módulo 1. Estadística Descriptiva: Tablas estadísticas y Tratamiento gráfico\r\nMódulo 2. Estadística Descriptiva: Medidas de Síntesis\r\nMódulo 3. Análisis de la relación entre dos variables cuantitativas: Correlación y Regresión\r\nMódulo 4: Análisis de la relación entre dos variables cualitativas: Test Chi cuadrado\r\nMódulo 5: Análisis de la relación entre dos variables una cualitativa y otra cuantitativa: t de Student\r\nMódulo 6: Test no paramétricos: U de Mann-Whitney y Test de Wilcoxon\r\nDespedida\r\n \n                                    ", 
    "end_date": "2015-11-26T00:00:00Z", 
    "title": "Estadística para investigadores: Todo lo que siempre quiso saber", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Universidad de Salamanca"
    ], 
    "commitment": "7 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.miriadax.net/web/estadistica-investigadores-4edicion", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Miríada X"
    ], 
    "start_date": "2015-10-15T00:00:00Z"
}