{
    "selfpaced": false, 
    "topic_name": [
        "Statistics & Probability"
    ], 
    "description": "\n\n                    \n                    \n                    This short course will provide a hands-on introduction to statistics used in educational research and evaluation. Participants will learn statistical concepts, principles, and procedures by building Excel spreadsheets from scratch in a guided learning approach using short video-based tutorials. Examples of specific skills to be learned include scales of measurement, measures of central tendency, measures of variability, and the computation of the following: mean, mode, and median, standard deviation, z (standard) scores, Pearson product-moment correlation coefficient (r), correlated-samples t test (i.e. dependent t test), independent-samples t test (i.e. independent t test), and a one-way analysis of variance (ANOVA).\r\nThe course is designed primarily for two audiences: 1) educational professionals who would like to be more informed about how to compute basic statistics and how to use them intelligently in their work; and 2) first-year doctoral students who want a short and friendly introduction (or brush up) to basic statistics before taking full graduate-level statistics courses. However, this course would be useful to anyone who wants a good, short, hands-on, friendly introduction to the most fundamental ideas of statistics in education.\n\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "Statistics in Education for Mere Mortals", 
    "price": 0, 
    "instructors": "Lloyd Rieber", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "http://www.canvas.net/browse/canvasnet/courses/statistics-in-education-6", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2016-07-11T00:00:00Z"
}