{
    "selfpaced": false, 
    "topic_name": [
        "Statistics & Probability"
    ], 
    "description": "\n\n                    \n                    \n                    Our world is rich with data sources, and technology makes data more accessible than ever before! To help ensure students are future ready to use data for making informed decisions, many countries around the world have increased the emphasis on statistics and data analysis in school curriculum–from elementary/primary grades through college. This course allows you to learn, along with colleagues from other schools,  an investigation cycle  to teach statistics and to help students explore data to make evidence-based claims.\r\nWho should take this course? This MOOC-Ed  is applicable to anyone interested in strengthening their approaches to teaching statistics through data investigations. The statistical concepts included are those often introduced to middle school through early college learners. Thus, teachers of statistics in grades 6-12 and in post-secondary contexts are the primary audience. This course may also be of interest to elementary teachers, teacher educators, and teachers of other disciplines that use data-based explorations extensively to make claims and inferences (e.g., science, social science).\n\n                                            Syllabus\n                        Unit 1: Course introduction-Considering the possibilities of teaching statistics with data (March 9 - March 15), considers what statistics is and why it is taught in schools. This unit explores the possibilities of students playing with real data and cool tools and of teaching statistics with data. You will have opportunities to set your goals for the course when playing with self-efficacy to teaching statistics and common content items related to statistics. We will offer some tools for data exploration, exciting readings, and sites where datasets are publicly available.\r\nUnit 2: What is a statistical investigation? (March 16 - March 22), examines the difference between mathematics and statistics, introduces the statistics investigation cycle, and begins to consider habits of mind when working with statistics. You will have opportunities to analyze mathematical and statistical tasks and examine student reasoning as they engage in statistical investigations. We will offer some additional tools for data exploration and resources for lesson plans.\r\nUnit 3: Introducing levels of statistical sophistication (March 23 - March 29), explores a framework for supporting growth in students’ statistical sophistication and digs deeper into statistical habits of mind. You will apply a statistical task framework to design/adapt and analyze instructional tasks and explore students' levels of statistical sophistication. We will offer some additional tools and resources assisting the teaching of statistics.\r\nUnit 4: Starting a statistical investigation –Posing questions and collecting data (March 30 - April 12) , digs deeply into what it is important for students to consider during the pose and collect phases of statistical investigations and zooms in the concept of comparing distributions. You will play with the Census of School data set to try posing rich statistical questions and examining issues of survey questions for collecting data. We will offer some additional tools and resources assisting the teaching of statistics.\r\nUnit 5: Investigating further — What can we say about the data? (April 13 - April 26), digs deeply into the analyze and interpret phases of the statistical investigation cycle and the concept of informal inferences. You will play with the Census of School data set to analyze and interpret results for the questions you pose in Unit 4. We will offer some additional tools and resources assisting the teaching of statistics.\r\nUnit 6:Course wrap up and next steps (April 27 - May 3), allows participants to reflect on, assess, and share the knowledge gained throughout the course, provide feedback for the work posted by colleagues and share what they have learned and their ideas for improving the MOOC-Ed.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Teaching Statistics Through Data Investigations", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Friday Institute", 
        "North Carolina State College of Education"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://place.fi.ncsu.edu/local/catalog/course.php?id=4&ref=1", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "MOOC-ED"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}