{
    "selfpaced": false, 
    "topic_name": [
        "Statistics & Probability"
    ], 
    "description": "\n\n                    \n                    \n                    This cross-disciplinary course deals with the undetermined, the unpredictable -- or what appears to be such. Among the questions that will be addressed are:How is randomness defined?How has randomness, often seen as a nuisance, become a useful resource for communication and computing? How is it generated?How can physicists make the astounding claim that there is real randomness in nature?Can our apparently free acts be predicted by monitoring the activity of the brain?\n\n                                            Syllabus\n                        Lecture 1: Basic of randomnessHistory of randomnessThe fair coin as ideal caseDefinitions of randomnessLecture 2: Randomness as a resourceReview of various tasks in which randomness is usedRandomized algorithms and de-randomizationCryptography: randomness for secrecyZero-knowledge proofsLecture 3: Characterizing a source of randomnessThe biased coin and other weaker sources of randomnessAmount of randomness: min-entropyExtraction of randomnessLecture 4: Noise as a random number generatorDefinition of \"noise\"Thermal noise: example of a resistorHow to extract random numbers from thermal fluctuationsLecture 5: Deterministic chaosPhysical (in)determinismDefinition and examples of chaosLecture 6: Quantum physics, a first encounterOverview of quantum physicsSingle-particle interferences (Mach-Zehnder, double slit)UncertaintyLecture 7: Intrinsic randomness and its practical usesBell's theorem and its implicationElements of quantum information scienceLecture 8: Introduction to free will in scienceMeasurement independenceQuanta in the brain?Libet's experiments\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Unpredictable? Randomness, Chance and Free Will", 
    "price": 0, 
    "instructors": "Valerio Scarani", 
    "institution_name": [
        "National University of Singapore"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/course/randomness", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-01-06T00:00:00Z"
}