{
    "selfpaced": false, 
    "topic_name": [
        "Statistics & Probability"
    ], 
    "description": "\n\n                    \n                    \n                    Издавна среди жителей Кёнигсберга была распространена такая загадка: как пройти по всем мостам через реку Преголя, не проходя ни по одному из них дважды. Многие кёнигсбержцы пытались решить эту задачу как теоретически, так и практически во время прогулок. Доказать или опровергнуть возможность существования такого маршрута никто не мог до 1736 года, когда выдающийся математик Леонард Эйлер не написал письмо своему другу с решением. Ответ был «нельзя». Так и родилась теория графов. Но что будет, если процесс, который описывает граф – случаен?\n\nТеория случайных графов находится на стыке теории графов и теории вероятностей. Наука появилась в середине ХХ века, и она сразу же привлекла огромное внимание как со стороны чистых математиков, так и со стороны прикладников. В курсе мы изучим как основы теории случайных графов, так и настоящие ее жемчужины.\n\nМы научимся воспринимать многие сложные системы как \"случайные графы\". Среди них – интернет, социальные сети (Фейсбука, Вконтакте), биологические, межбанковские сети.\n\nПрослушав этот курс, вы проникнетесь чрезвычайно красивой математической теорией и научитесь решать комбинаторные и алгоритмические задачи на случайных графах. Все эти знания позволят нам затем перейти к курсу веб-графов, в котором мы расскажем о самых современных приложениях вероятностно-графовых моделей и конструкций.\n\nДля освоения материала будет достаточно математики школьного уровня, базовых знаний комбинаторики и теории вероятностей.\n\n                                            Syllabus\n                        Две модели случайного графаСлучайный граф Эрдеша-Реньи: биномиальная модель и равномерная модель. Свойства случайного графа. Свойство связности. Пороговая вероятность для свойства связности. Пороговая вероятность для свойства связности. Возникновение гигантской компоненты в случайном графе.Теорема о пороговой вероятности для свойства связностиНеравенство Маркова и Чебышева. Доказательство теоремы о пороговой вероятности для свойства связности случайного графа.Вероятностный методХроматическое число, число независимости и кликовое число. Обхват графа. Теорема о существовании графа с большим обхватом и большим хроматическим числом.Хроматическое число случайного графаОценки хроматического числа случайного графа G(n,p) при различных p=p(n).Алгоритмы на случайном графеЖадный алгоритм раскраски. Жадное хроматическое число, жадное число независимости и жадное кликовое число. Теорема о жадном хроматическом числе и жадном числе независимости случайного графа.Малые подграфы в случайном графеРаспределение малых подрафов в случайном графе: пороговые вероятности и Пуассоновская предельная теорема на пороге.Итоговый тестЗаключительный экзамен, содержащий задачи по всем пройденным темам\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Случайные графы", 
    "price": 0, 
    "instructors": "Андрей Райгородский", 
    "institution_name": [
        "Moscow Institute of Physics and Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/sluchajnye-graphy", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}