{
    "selfpaced": false, 
    "topic_name": [
        "Statistics & Probability"
    ], 
    "description": "\n\n                    \n                    \n                    Теория вероятностей - это, вне всякого сомнения, один из самых важных и богатых приложениями разделов современной математики.\n\nС помощью методов этой замечательной науки можно как оценивать классические вероятности выигрышных стратегий в азартных играх, так и решать весьма серьезные прикладные задачи, возникающие буквально в каждой области науки. В нашем курсе мы познакомим слушателей прежде всего с самыми основами предмета. И сделаем мы это в уникальном формате - иллюстрируя вероятностные объекты и методы на примерах решения с их помощью комбинаторных задач. Суть в том, что, конечно, в базовой вероятности много комбинаторики, и это все знают; мы же расскажем не только об этом, но и о том, как, наоборот, вероятностные методы позволяют работать с комбинаторными задачами. Это позволит нам впоследствии выйти на приложения вероятности в теории графов, случайных графов и, наконец, веб-графов и прочих сложных сетей. Также в рамках курса мы оторвемся от чисто комбинаторных интерпретаций и обсудим более общие вероятностные модели. Но интуиция все равно сохранится, и в этой комбинаторной подоплеке уникальность курса.\n\nКурс построен так, что будет по плечу даже тем, кто изучал математику последний раз только в школе. Тем не менее, так как для понимания курса необходимы знания основ комбинаторики, мы рекомендуем пройти наш курс по комбинаторике прежде чем прослушивать данный курс.\n\nВнутри курса также все просто – каждую неделю вас ждут видеолекции и проверочные задания, которые нужно выполнять в срок. В конце – итоговая проверочная работа. Студенты, которые набрали достаточное количество баллов, смогут получить сертификат.\n\n                                            Syllabus\n                        Классическая вероятностьОпределение классической вероятности. Элементарные исходы. События. Примеры. Свойства вероятности. Пространство элементарных исходов. Задача о существовании правильной раскраски множества в два цвета. Условная вероятность. Независимость двух событий и независимость в совокупности. Формула полной вероятности. Формула Байеса. Задачи на применение формул.Схема испытаний БернуллиСхема испытаний Бернулли: множество элементарных исходов, успех и его вероятность, вероятность элементарного исхода. Классическая вероятность как частный случай. Подсчет вероятности события «произошло k успехов» в схеме испытаний Бернулли. Задача про случайный выбор двух множеств – нахождение вероятности пустого пересечения. Обобщение задачи о существовании правильной раскраски на произвольное число множеств. Теорема о существовании правильной раскраски.Общее понятие конечного вероятностного пространстваОпределение конечного вероятностного пространства, свойства вероятности. Определение случайной величины, примеры. Случайный граф,  число треугольников случайного графа. Распределение случайной величины. Математическое ожидание, два способа его вычисления.\tЛинейность математического ожидания.\tМатематическое ожидание числа треугольников в случайном графе. Математическое ожидание числа успехов в схеме испытаний Бернулли. Неравенство Маркова. Дисперсия. Неравенство Чебышева. Пороговая вероятность для свойства случайного графа содержать треугольник.Предельные теоремы для сумм независимых случайных величинНезависимость двух и нескольких случайных величин. Математическое ожидание произведения независимых случайных величин. Дисперсия суммы независимых случайных величин. Пример некоррелированных зависимых случайных величин. Закон больших чисел. Предельная теорема Пуассона. Интегральная теорема Муавра-Лапласа. Применение теоремы к задаче о двух гардеробах.Бесконечные вероятностные пространстваЗадача о встрече. Геометрическая вероятность. Парадокс Бертрана. Бесконечное множество элементарных исходов. Колмогоровская аксиоматика.Итоговый тестЗаключительный экзамен, содержащий задачи по всем пройденным темам\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Теория вероятностей для начинающих", 
    "price": 0, 
    "instructors": "Андрей Райгородский and Максим Жуковский", 
    "institution_name": [
        "Moscow Institute of Physics and Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Mathematics"
    ], 
    "course_url": "https://www.coursera.org/learn/probability-theory-basics", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}