{
    "selfpaced": false, 
    "topic_name": [
        "Theoretical Computer Science"
    ], 
    "description": "\n\n                    \n                    \n                    课程介绍视频也可以访问中国网站\n点击上方绿色按钮报名。\n\n计算机是现代社会中用于解决问题的重要工具。利用计算机解决实际问题需要将问题抽象，并对数据进行操作，最后通过计算机程序求解问题。而本门课程主要内容就是对以上内容进行研究。\n\n图灵奖获得者N.Wirth写了一本经典著作“程序=算法+数据结构”。数据结构，是抽象的表示数据的方式；算法，则是计算的一系列有效、通用的步骤。算法与数据结构是程序设计中相辅相成的两个方面。\n\n我 们会围绕着“算法+数据结构=程序”的思路，以问题求解为导向进行学习。希望能够帮助大家提高理论、抽象、设计的能力。在扎实的经典理论基础上，运用问题 抽象、数据抽象、算法抽象来分析问题，应用适当的数据结构和算法来设计和实现相应的程序。通过课程学习，大家的抽象思维能力、问题求解能力将得到较大提 升，编程能力和代码质量会有质的飞跃！\n\n在求解实际问题方面，我们会学习到通过权衡时空和其他资源开销，利用数据结构来组织数据、设计高效的算法、完成高质量的程序以满足错综复杂的实际应用需要。\n\n此外，课程所学到的内容会被利用到计算机科学后续的各个课程中，如操作系统、软件工程、数据库概论、编译技术、计算机图形学、人机交互等。希望可以为大家将来从事计算机相关的学习、研究和开发工作打下扎实的基础。\n\n本课程采用张铭主编的国家“十一五”规划教材《数据结构与算法》（高等教育出版社）。适合计算机以及相关理工专业的大二本科生学习，需要先修过计算概论等课程，具有结构化和面向对象的程序设计基础。\n\n课程主要包括的内容有：线性表，栈与队列，字符串，二叉树，树，图，排序（内排序，外排序），检索，索引，高级数据结构、以及数据结构应用。课程持续16周（分为两个session，每个8周），学习者每周在本课程上需要投入4－8小时。\n\n本课程的本次开设得到Google研究经费支持。\n\nComputers are an important tool for problem solving and are deeply involved in modern life. Computers perform operations on data. What is the logical relationship among data? How is data stored in computers? What algorithms are required to solve particular problems? These are the questions that will be answered in “Data Structures and Algorithms,” an important core course in Computer Science. The course also introduces students to fundamental data structures and classical algorithms used in more specialized courses, including Operating Systems, Software Engineering, Database Systems, Compiler Principles, Computer Graphics and Human Computer Interaction.\n\nNiklaus Wirth described the important and indivisible link between algorithms and data structure in his book, Algorithms + Data Structures = Programs.\n\nThe course will build on Wirth’s ideas as it helps students improve their knowledge of theory and their ability to think abstractly to solve problems. Building on a solid theoretical foundation, students will analyze problems using data and algorithm abstraction. Students will learn how to organize data efficiently and make tradeoffs between space and time complexity, design efficient and effective algorithms, and implement high quality programs to solve complex real-world problems. After studying this course, students will be well prepared for further study and research in engineering and other computer-related areas.\n\nThis is an intermediate-level course appropriate for sophomore students majoring in computer science or other science/engineering disciplines. Students should have learned \"introduction to computing\", with the knowledge of structured and object-oriented programming.\n\nThis course is presented in two eight-week sessions.\n\nStudents who score 60% or higher will receive an Honor Code Certificate.\n\nThe Autumn 2014 Sessions of this course are supported by Google.\n\n课程采用的算法语言? Which programming languages does the course use?\n\n本课程采用基于C++的伪代码授课和出习题。编程作业是POJ自动评判的，该平台目前接受 C、C++、Java等都可以。\n\nThe course’s content and exercises are both based upon C++ pseudo code. Programming assignments are automatically assessed by POJ which accepts code written in C/C++ and JAVA.\n\n                                    ", 
    "end_date": "2014-11-03T00:00:00Z", 
    "title": "04830050x: 数据结构与算法第一部分 | Data Structures and Algorithms Part 1", 
    "price": 0, 
    "instructors": "Ming Zhang", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "4-8 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/shu-ju-jie-gou-yu-suan-fa-di-yi-bu-fen-pekingx-04830050x", 
    "duration": "7 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-09-15T00:00:00Z"
}