{
    "selfpaced": false, 
    "topic_name": [
        "Theoretical Computer Science"
    ], 
    "description": "\n\n                    \n                    \n                    Digital systems are at the heart of the information age in which we live, allowing us to store, communicate and manipulate information quickly and reliably. This computer science course is a bottom-up exploration of the abstractions, principles, and techniques used in the design of digital and computer systems. If you have a rudimentary knowledge of electricity and some exposure to programming, roll up your sleeves, join in and design a computer system!\n\nThis course is Part 3 of a 3-part series on digital systems, providing an introduction to the hardware/software interface and is based on a course offered by the MIT Department of Electrical Engineering and Computer Science. Topics include pipelined computers, virtual memories, implementation of a simple time-sharing operating system, interrupts and real-time, and techniques for parallel processing.\n\nUsing your browser for design entry and simulation, you’ll optimize your processor design from Computation Structures 2: Computer Architecture for size and speed, and make additions to a simple time-sharing operating system.\n\nLearner Testimonial \n\n“Out of the many edX courses I have taken, the first two parts of Computation Structures 6.004x were clearly the best. I am looking forward to the third part.” - Previous Student\n\n                                    ", 
    "end_date": "2016-07-26T00:00:00Z", 
    "title": "6.004.3x: Computation Structures 3: Computer Organization", 
    "price": 0, 
    "instructors": "Chris Terman, Steve Ward and ​Silvina Hanono Wachman", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/computation-structures-3-computer-mitx-6-004-3x", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-05-24T00:00:00Z"
}