{
    "selfpaced": false, 
    "topic_name": [
        "Theoretical Computer Science"
    ], 
    "description": "\n\n                    \n                    \n                    In this research-oriented graduate course, we will study algorithms for graph partitioning and clustering, constructions of expander graphs, and analysis of random walks. These are three topics that build on the same mathematical background and that have several important connections: for example it is possible to find graph clusters via random walks, and it is possible to use the linear programming approach to graph partitioning as a way to study random walks.\r\nWe will study spectral graph theory, which explains how certain combinatorial properties of graphs are related to the eigenvalues and eigenvectors of the adjacency matrix, and we will use it describe and analyze spectral algorithms for graph partitioning and clustering. Spectral graph theory will recur as an important tool in the rest of the course. We we will also discuss other approaches to graph partitioning via linear programming and semidefinite programming. Then we will study constructions of expander graphs, which are graphs with very strong pseudorandomness properties, which are useful in many applications, including in cryptography, in complexity theory, in algorithms and data structures, and in coding theory. Finally, we will study the mixing time of random walks, a problem that comes up in several applications, including the analysis of the convergence time of certain randomized algorithms, such as the Metropolis algorithm.\r\nPrerequisites Linear algebra, discrete probability, and algorithms\n\n                                    ", 
    "end_date": "2013-08-06T00:00:00Z", 
    "title": "Graph Partitioning and Expanders", 
    "price": 0, 
    "instructors": "Luca Trevisan", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "8 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "http://venture-lab.org/expanders", 
    "duration": "15 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2013-04-23T00:00:00Z"
}