{
    "selfpaced": false, 
    "topic_name": [
        "Theoretical Computer Science"
    ], 
    "description": "\n\n                    \n                    \n                    How can you tell a secret when everyone is able to listen in? In this course, you will learn how to use quantum effects, such as quantum entanglement and uncertainty, to implement cryptographic tasks with levels of security that are impossible to achieve classically.\n\nThis interdisciplinary course is an introduction to the exciting field of quantum cryptography, developed in collaboration between QuTech at Delft University of Technology and the California Institute of Technology.\n\nBy the end of the course you will\n\nBe armed with a fundamental toolbox for understanding, designing and analyzing quantum protocols.\n\tUnderstand quantum key distribution protocols.\n\tUnderstand how untrusted quantum devices can be tested.\n\tBe familiar with modern quantum cryptography – beyond quantum key distribution.\nThis course assumes a solid knowledge of linear algebra and probability at the level of an advanced undergraduate. Basic knowledge of elementary quantum information (qubits and simple measurements) is also assumed, but if you are completely new to quantum information additional videos are provided for you to fill in any gaps.\n\n                                    ", 
    "end_date": "2016-12-19T00:00:00Z", 
    "title": "QuCryptox: Quantum Cryptography", 
    "price": 0, 
    "instructors": "Thomas Vidick, Stephanie Wehner and Guest Lecturers", 
    "institution_name": [
        "California Institute of Technology", 
        "Delft University of Technology"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/quantum-cryptography-caltechx-delftx-qucryptox", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-10-10T00:00:00Z"
}