{
    "selfpaced": false, 
    "topic_name": [
        "Theoretical Computer Science"
    ], 
    "description": "\n\n                    \n                    \n                    Can we capture the unpredictable evolutionary and emergent properties of nature in software? Can understanding the mathematical principles behind our physical world help us to create digital worlds? This class focuses on the programming strategies and techniques behind computer simulations of natural systems. We explore topics ranging from basic mathematics and physics concepts to more advanced simulations of complex systems. Subjects covered include physics simulation, trigonometry, fractals, cellular automata, self-organization, and genetic algorithms. Examples are demonstrated using the p5.js environment with a focus on object oriented programming.\n\n\n\n\n\n\n\nVideo featuring original artwork in P5.js by:Particle Equalizer #1 by Sehyun KimLook at me! by Muqing NiuDancing Spring by Yue HuFireWork by Yue HuNature Of Code final at ITP by Joe_MangoNature of Code - midterm by Marcela NowakSound And Motion Coding by Marcela Nowak\n\n                                            Syllabus\n                        Session 1: Introduction / Overview In this session we’ll review the basics of p5.js and get everyone up and running with posting sketches online. We’ll look at how object-oriented programming works in JS and create simple sketches of objects moving around a canvas.\r\nSession 2: Vectors / Forces This session will look at the concept of a vector and implement sketches using a p5.Vector object. By creating objects with vectors for position, velocity, and acceleration, we’ll build a simple “hello world” physics engine.\r\nSession 3: Steering Behaviors This session, we’ll examine a special kind of force (pioneered by Craig Reynolds) — a steering force — that moves an object according to its own goals or desires. Examples are wandering, seeking a target, path following, obstacle avoidance, and more. We’ll then look at how group behaviors can be simulated by combining multiple steering behaviors according to local interactions between objects.\r\nSession 4: Fractals In this session we will cover the concept of a fractal and look at ways of generating fractal patterns with code.\r\nSession 5: Genetic Algorithms This session will look at the key concepts of Darwinian evolution — variation, selection, heredity — and examine how they can be applied in a computer simulation.\n                                    ", 
    "end_date": "2016-06-08T00:00:00Z", 
    "title": "The Nature of Code", 
    "price": 0, 
    "instructors": "Daniel Shiffman", 
    "institution_name": [
        "Processing Foundation"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.kadenze.com/courses/the-nature-of-code/info", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Kadenze"
    ], 
    "start_date": "2016-05-04T00:00:00Z"
}