{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t  Advanced Spanish Grammar is a course designed for non-Spanish speakers with some Spanish background that want to go deeper as far as grammar in concerned. The course will explore &quot;The Subjunctive mood&quot; in its diverse ways to use it. We will explore grammar theory along with communicative examples that explain how to use it and when to use it. Similarly, we will provide assessment moments and evaluations in order to check your understanding of the topic. As for the terminology used in the course, we use simple and easy vocabulary in order that you understand definitions fast with real examples that ease the comprehension and facilitate the language acquisition process.  </p>  <p>  \t   You will find Videos, Articles, Grammar Charts and Links in order to understand the topic perfectly. Also, we have two sources to interact with your teachers and classmates.  These platforms are Voxopop and Coursebase. We will let you know how to sign in and when to develop tests, quizzes, assessment activities and voice tasks. The teachers in charge will provide feedback in order to clarify and support the learning process.  </p>  <p>  \t  The course will take 4 weeks to be completed and it is structured in 22 modules of academic content divided in relevant grammar topics. By the end of the course you will be able to understand and speak with &quot;The Subjunctive&quot; in a natural and easy manner.  </p>  <p>  \t  It is crucial to take the course since we explore topics that are explained by native teachers in a professional and interactive way. Also, we use diverse technological tools that ease the topic explanation and development. Besides, we are native speakers that have experience teaching Spanish as a Second language; so the course is designed to meet our students’ needs. Finally, if necessary, we will be in contact with our students by mail or twitter to clarify doubts or just to interact in Spanish.  </p>", 
    "end_date": null, 
    "title": "Advanced Spanish Grammar: The Subjunctive ", 
    "price": "20.00", 
    "instructors": "Sergio Gomez Fajardo", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324344_7106_4.jpg", 
    "course_url": "https://www.udemy.com/advanced-spanish-grammar-the-subjunctive/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T18:47:38Z"
}