{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \tCourse was updated for November 2015.  </p>  <p>  \t<strong>Do you want to communicate in Spanish in a way that WOWS people?  </strong>  </p>  <p>  \t            Mastering Spanish written accents allows you to impress others when you speak and especially, when you write. It doesn't matter if you're a native Spanish speaker, or someone who is just starting to learn Spanish, by using written accents, you will come off as more educated, more fluent and especially, more clear.  </p>  <p>  \t            In this course, you will learn the foundation for understanding Spanish accents, but you'll do so in a way that is fun, engaging and immediately applicable.  </p>  <p>  \t            Instead of having to look up words in the dictionary or online to see if they have accents or not most of the time, you will hardly use the dictionary. Why? Because after taking this course, you won't need to.  </p>  <p>  \t            This course consists of several components of Spanish language that will help you communicate in a way that looks professional in your personal, interpersonal, professional and educational setting.  </p>  <p>  \t        Having a good grasp on Spanish accents will ensure that you speak, read, write and communicate in a way that makes your interactions precise instead of vague, confusing, foolish or even controversial.  </p>  <p>  \t<strong>  This course, which consists of 35 lectures, will allow you to:  </strong>  </p>  <p>  \t            1. Understand the why behind Spanish accents  </p>  <p>  \t        2. Know the factors that influence whether words have accents and when they don't  </p>  <p>  \t        3. Learn how to communicate with accents effectively  </p>  <p>  \t            4. Increase your confidence when communicating in Spanish  </p>  <p>  \t            5. Master your linguistic abilities to your greatest potential  </p>  <p>  \t            6. Learn how to use diphthongs to your advantage instead of fearing them  </p>  <p>  \t            7. Learn how to analyze and dissect words just enough so that you can be more empowered to apply accents effectively  </p>  <p>  \t            8. Keep your ability to communicate with Spanish accents top notch  </p>  <p>  \t<strong>  What are the course requirements?  </strong>  </p>  <p>  \t            Something to take notes with and your willingness, diligence and above all, your curiosity.  </p>  <p>  \t<strong>  Who Should Take This Course?  </strong>  </p>  <ol>  \t<li>Native Spanish Speakers</li>  \t<li>Spanish learners</li>  \t<li>Parents</li>  \t<li>Teachers</li>  \t<li>Coaches</li>  \t<li>Business People</li>  \t<li>People who are marrying into a Spanish-speaking family, or want to</li>  \t<li>People who live in communities where Spanish is spoken</li>  \t<li>People who are interested in interacting with Spanish speakers</li>  \t<li>Authors</li>  \t<li>Translators</li>  \t<li>Bloggers </li>  \t<li>Public Speakers</li>  \t<li>People who have great linguistic etiquette</li>  </ol>", 
    "end_date": null, 
    "title": "Become A Pro At Knowing Where Spanish Written Accents Go: ", 
    "price": "20.00", 
    "instructors": "Haydee Montemayor", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327314_0eb1_9.jpg", 
    "course_url": "https://www.udemy.com/become-a-pro-at-knowing-where-spanish-written-accents-go/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-26T01:24:07Z"
}