{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\"><em>***THE WORLD'S SPANISH TEACHER SINCE 2009, LAUNCHED ON UDEMY IN 2016***</em></strong></em></p>\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">This is the most effective Spanish course on Udemy</strong></em></p>\n\n\n\n\n\n<p><em>\"I love eSpanishTeacher's Beginner Spanish. Having tried two other well-known courses, I'm now more than half way through Beginner Spanish and am learning much more compared to the others.\"        </em><em>        -Paul S., Texas </em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\"></strong></em></p><p>Since 2009, eSpanishTeacher has helped tens of thousands of people worldwide learn to speak Spanish quickly and affordably.<br></p>\n\n<p>Our Spanish courses are built one three core values: We exist to 1) offer the most personalized &amp; effective language instruction, 2) at the most affordable price, and 3) always with a 100% satisfaction guarantee.</p><p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Want to know a little secret about learning Spanish?</strong></em><br></p>\n\n\n\n\n\n<p>You can't simply memorize a list of Spanish words, phrases, and questions and expect that you'll be able to survive a trip to Mexico or speak to your Spanish speaking neighbor. The chances that those few lines you've memorized will even fit into the conversation you'll be having with native speakers is extremely small.</p>\n\n\n\n\n\n<p>Too many Spanish language courses attempt to have you memorize a list of common words and phrases that you may or may not ever need. So why do they teach the language this way? Because it's easier to teach a list of words &amp; phrases instead of digging in and teaching students how to actually create language that fits the circumstances. But this alone is not the secret.</p>\n\n\n\n\n\n<p>The true secret you need to know is that with just a small foundation in a few key language concepts, new students will be much better equipped to speak the language in actual situations with native Spanish speakers. It doesn't take years to develop this foundation; it doesn't even take months. In just a few days, you can have a basic foundation in Spanish that enables you to communicate effectively with a broad vocabulary.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Spanish instruction with a human touch</em><br></strong>There's no need to spend hundreds of dollars on robotic &amp; impersonal software programs. Thanks to the eSpanishTeacher system, you can learn Spanish from an actual Spanish teacher when it's convenient for you. You'll develop a foundation in the language that will enable you to communicate effectively in virtually all situations.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Language lessons on your computer</em></strong><br>Video Spanish lessons, vocal practice, and quizzes accessible from any computer with an internet connection. Watch, listen, and interact with eSpanishTeacher as he helps you understand the most essential language concepts.<br><br><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Speak Spanish</strong><strong class=\"redactor-inline-converted\"> </strong><strong class=\"redactor-inline-converted\">in less than an hour</strong></em><br>This course breaks down the language into it's simplest components so that you can understand completely and quickly. Following each lesson, you'll practice what you have learned by actually speaking out loud in Spanish. Move at your own pace and start speaking in minutes!</p>\n\n\n\n\n\n<ul><li>16 lessons taught by eSpanishTeacher himself</li><li>12 quizzes to test your knowledge</li><li>11 speaking practices and much more!</li></ul>", 
    "end_date": null, 
    "title": "Beginner Spanish Course: Learn to Speak Spanish Like a Pro!", 
    "price": "20.00", 
    "instructors": "eSpanishTeacher ™", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821010_c5b0_2.jpg", 
    "course_url": "https://www.udemy.com/espanishteacher-learn-spanish-language-course-rosetta-stone-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T15:07:51Z"
}