{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \t         This course is intended to be an overview of the most important aspects of the Spanish language. Each lesson is designed to reveal the inner workings of the language through clear, concise explanations and numerous text based examples that appear in the videos. This is primarily a  video lecture based course which includes over two and a half hours of explanations, examples, guided practice and exercises. It is not designed to &quot;wow&quot; you with action videos, pictures and cool music. There are other courses that already do that very well. Rather, the purpose is to provide you with solid explanations of how the language works.  </p>  <p>  \t         Everything you need is included in the course: explanations, vocabulary, examples and exercises.  </p>  <p>  \t  There are over two and a half hours of lecture videos and an additional 30 minutes of review videos. The minimum time to complete the course is about 3 and a half hours.  </p>  <p>  \t         The approach is academic. The sequence of grammar and topics generally follows the sequence found in most university level Spanish textbooks. This course is a good companion course to anyone already taking a beginning Spanish course at the college or university level. If you are taking any other informal, self-study or software / app based Spanish course this course is designed to complement all other Spanish courses by helping you to understand how the language works.  </p>  <p>  \t         You should take this course if you are interested in acquiring a quick overview of the language at the beginning level and if you would like to learn how to express and/or create your own original thoughts in the language.  </p>", 
    "end_date": null, 
    "title": "Beginning Spanish 1", 
    "price": "20.00", 
    "instructors": "Thomas C. Farias", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/166118_7e22_3.jpg", 
    "course_url": "https://www.udemy.com/beginning-spanish-1/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-17T22:37:51Z"
}