{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong><strong>**UPDATED May 2016**</strong></strong></p>\n\n<p>Have you tried to learn Spanish before and simply lost interest and motivation along the way?</p>\n\n\n\n\n\n\n\n<p>Have you visited a Spanish speaking country and wished you had been able to communicate with the locals in their own language?</p>\n\n\n\n\n\n\n\n<p>If so, the \"Conversational Spanish Made Easy\" course, will give you the tools to communicate effectively in a large number of common situations when traveling around the world or with Spanish speakers in your own country.</p>\n\n\n\n\n\n\n\n<p>This course takes you from learning how to pronounce Spanish words correctly to understanding others and expressing your needs and wants effectively.</p>\n\n\n\n\n\n\n\n<p><strong>How have we accomplished this?</strong></p>\n\n\n\n\n\n\n\n<p>This course focuses on frequently used vocabulary that you would find in everyday conversations among native Spanish speakers.</p>\n\n\n\n\n\n\n\n<p>Instead of focusing and bombarding you with grammar concepts and lingo, we focus on useful phrases and sentences that you can start using from day one.</p>\n\n\n\n\n\n\n\n<p>We've been able to design a course that will have you speaking Spanish with native speakers in no time. Join our community of over 4,000 students and start speaking Spanish today!</p>\n\n\n\n\n\n\n\n<p><strong>This is what some of our students are saying:</strong></p>\n\n\n\n\n\n\n\n<p>\"Best course available - I've purchased numerous books and most of the major Spanish software programs, but I still had difficulty with the fundamentals. But after taking your course, learning finally became easy and understandable. Your presentation is excellent! I hope that you have another course in the works.\"</p>\n\n\n\n\n\n\n\n<p>\"Best Spanish course - The course offers lots of great opportunities to learn Spanish from scratch and ways to keep up the Spanish you already know.\"</p>\n\n\n\n\n\n\n\n<p><strong>Course Highlights: \t</strong>  </p>\n\n\n\n\n\n\n\n<p><strong>Overview</strong>  </p>\n\n\n\n\n\n\n\n<p>\t Through 88 video lectures, you will learn essential conversational Spanish in a number of common situations. Starting with simple vocabulary that you can use when meeting people, to more complex vocabulary and phrases that will allow you to order food, follow directions and other important skills, essential for successfully communicating with Spanish speakers.</p>\n\n\n\n\n\n\n\n<p>\t In addition to the video lectures, practice videos and quizzes, you will have access to ready-to-print PDF's that you can review in your free time to help you keep your conversational Spanish skills fresh.</p>\n\n\n\n\n\n\n\n<p>\t Join a community of over 6,000 students eager to learn Spanish, so if you have questions just ask.</p>\n\n\n\n\n\n\n\n<p>Remember, all Udemy courses come with a 30-day money back guarantee. Sign up and start learning Spanish today! See you inside the course!</p>", 
    "end_date": null, 
    "title": "Conversational Spanish Made Easy", 
    "price": "20.00", 
    "instructors": "Esteban Perez Rodriguez", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46738_c270_96.jpg", 
    "course_url": "https://www.udemy.com/conversational-spanish-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-20T20:58:32Z"
}