{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>The course is designed to help <strong>everyone</strong> from the <em>ab initio</em> stage - those who have never learned Spanish before - to those wanting to brush up in preparation for an upcoming holiday or business trip. The course is <strong>audio based</strong> using an experienced bilingual speaker, with the content created collaboratively by both instructors, and it will be supported with on-screen transcripts for easier learning and better retention. There are also <strong>printable vocabulary guides</strong> to take with you wherever you go!</p>\n\n<p><em>Latest Update: <strong>May 2016</strong></em></p>\n\n<p><em></em>-----------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Just look at what our students have to say!</strong></p>\n\n<p><em>'I have bought a few courses in the past that have been a heavily weighted towards grammar. When I stumbled upon the other titles in the Learn to Speak range it was amazing how fast I learned. Highly recommend this course to everyone!' </em><strong>Frances Phipps</strong></p>\n\n<p><em>'</em>Great course - really enjoyed the experience. All was very well presented and engaging. I found it great value for money as there is loads of material for what you pay. I hope to put it all into practice in the near future!<em>' </em><strong>Laura Lucas</strong></p>\n\n<p><em>'Really informative course. The language is relevant and is definitely going to be useful when I visit Spain next year'</em> <strong>Raymundo Martín Gutiérrez</strong></p>\n\n<p><em>'Enjoyed the course a lot. Useful language tips and very good for going abroad, well done!'</em> <strong>Peter De Voorts</strong></p>\n\n<p>-----------------------------------------------------------------------------------------------------------------</p>\n\n<p>The course is designed as an easy access into the world of Spanish and has been laid out in such a way that students can <strong>go at their own pace</strong>. Don't forget, you are covered by a MASSIVE 30-day no-quibble money back guarantee, so if you don't love the course then you can get a refund with no questions asked!</p>\n\n<p>If you have always been fascinated by people who speak another language and want to pursue it as a hobby, or you simply need to brush up on your spoken Spanish before you head off on a trip, this course will help you to achieve your goals and <strong>open up new avenues</strong> and experiences for years to come!</p>", 
    "end_date": null, 
    "title": "Learn to Speak: Conversational Spanish - Complete Edition", 
    "price": "20.00", 
    "instructors": "Scott McElroy, Jonathan Price", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442240_886c_2.jpg", 
    "course_url": "https://www.udemy.com/learnspanish/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T22:08:57Z"
}