{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">¡Hola!</strong></p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">Welcome to the course! I hope you are ready for super engaging lectures, lots of useful vocabulary, and helpful tips and advice to help you on your language-learning journey! I want to make learning Spanish easier than you ever thought possible before.</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Let me introduce myself:</strong></p>\n\n\n\n\n\n\n\n<p>I'm your instructor, Josh. I'm a real person who really wants to see you succeed. In fact, many years ago, I started EXACTLY where most of you are now. I had a strong desire to learn Spanish, I saw how useful it was in everyday life... but I also wanted to learn at my own pace and from an instructor who knew what he/she was talking about. </p>\n\n\n\n\n\n\n\n<p>Over time, I practiced regularly to perfect my Spanish skills. I found that I loved speaking Spanish so much, that I wanted to teach others as well. So, that is exactly what I did.</p>\n\n\n\n\n\n\n\n<p>I have been teaching Spanish at different colleges and universities for almost a decade now. I love every minute of teaching and have recently expanded my teaching to Udemy.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So, who did I make this course for? </strong></p>\n\n\n\n\n\n\n\n\n\n<p>This course is designed for those who want to learn basic vocabulary and useful phrases in Spanish.  There are no prerequisites for this class....all you need is a computer and internet access! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Don't worry! I have done all the work of planning, creating, and organizing the course, so that you can reap the rewards! I provide you with EVERYTHING you need to know. You will get the most ESSENTIAL lectures that truly help you learn Spanish in no time at all!</strong> </p>\n\n\n\n\n\n\n\n\n\n<p>I have even added PDF vocabulary list attachments to most lesson, so that you can have a printable resource for yourself. (Don't want to print the PDF files? You can also download the study lists and add them to a folder on your desktop!)</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">But, that's not all!</strong> In addition, I have created fun (and short) multiple-choice quizzes throughout the course to test your knowledge of the vocabulary and phrases you learned in the lessons.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>What are you waiting for? Sign up and start learning Spanish today! </em></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Within a few minutes of starting the course you will be able to say your first phrases in a new language!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You've always wanted to learn a new language.  The time is now....let's do it!!<br></p>\n\n\n\n\n\n\n\n<p>I won't leave you behind!</p>", 
    "end_date": null, 
    "title": "Learn Spanish - Fast & Direct", 
    "price": "20.00", 
    "instructors": "Joshua Sanderson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776330_ce00_4.jpg", 
    "course_url": "https://www.udemy.com/basic-spanish/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T20:45:08Z"
}