{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Ever wondered how to learn Spanish<strong> easily and effectively</strong>? This course offers exactly that: you will learn how to communicate in <strong>everyday situations </strong>as on the phone, at the restaurant, talking about the weather, the hobbies, and more. </p><p><strong>Learn Spanish Language Quickly With The Communicative -Pictures Supported Method</strong>.</p><p>Every sentence in Spanish will appear with the English equivalent with the voice and pictures which helps to learn better and faster.</p><p>\n\nAt the end of the course you will be<strong> able to express yourself with\tclear and simple sentences </strong>in Spanish, learn to talk about yourself and\n\task people for information in Spanish, learn Spanish words and phrases\nin a context.\t</p><p>The course is made up of 5 lessons\nwhich consist of 7 sections and <strong>15 lectures</strong>. Each section has 1-4\nlectures and each lecture consists of different subjects, as for\nexample: \n</p><ul>\n\t<li><em>Introducing yourself</em>\n\t</li><li><em>Expressing likes and dislikes</em>\n\t</li><li><em>Pronunciation</em>\n\t</li><li><em>Spanish food</em>,\n\tand more</li></ul><p>We will learn how to order food at the restaurant, the recipe for gazpacho (typical Spanish soup), how to make an appointment to go to the cinema, how to express what we like doing in free time as reading, listening music, traveling. You know how often the conversation leads to the weather, you will also learn to express what is the weather like.</p><p>It will take you about 30 minutes to complete the course.<br></p><p>I designed this Spanish course to be understood with <strong>no difficulties </strong>by absolute beginners, those who want to refresh their knowledge of Spanish, those who are learning\nSpanish for interest or because they are going on holidays to a\nSpanish speaking country.</p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Spanish in 5 lessons for beginners", 
    "price": "25.00", 
    "instructors": "MSc Katja Seljak Adimora", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726782_419b_2.jpg", 
    "course_url": "https://www.udemy.com/learn-spanish-in-5-lessons-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T12:32:09Z"
}