{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>If you've tried learning Spanish before and haven't succeeded, well this course is for you.</p><p>There is nothing as thrilling as being able to visit another country and communicate with the locals in their own language. Well, now you can experience that amazing feeling too!</p><p>This course gives you ten hours of high quality Spanish tuition broken down into 26 lessons. You'll go from a complete beginner to speaking more of the language than somebody who has been studying it for years!\t           </p><p>This is the first of my Spanish courses and is suitable for everybody, no matter what your starting level. I wrote the course assuming you know absolutely nothing about the Spanish language. Even if you've studied the language before, I recommend you commence with this course, as you will definitely learn things you didn't know before.\t           </p><p>This course gives you a huge base vocabulary and shows you how to build your own sentences to get by in almost any situation. By the end of the course, you'll be more than a perfect tourist and you'll know more than just a few pleasantries.\t           </p><p>You'll be able to:\t           </p><ul><li>Give descriptions of things around you\t\t\t           </li><li>Order food and drinks in a restaurant\t\t\t           </li><li>Make a reservation\t\t\t           </li><li>Book a hotel\t\t\t           </li><li>Hire a car\t\t\t           </li><li>Order a taxi\t\t\t           </li><li>Ask for directions\t\t\t           </li><li>Ask questions about things (and understand the answers!)\t\t\t           </li><li>Go shopping\t\t\t           </li><li>Say what you think about things\t\t\t           </li><li>And much more... </li></ul><p>You'll not only get video tutorials, but you'll also get videos where you can practise what you've learnt, videos giving you useful learning techniques and a range of downloadable PDFs that will give you an enormous vocabulary as well as a set of reference sheets explaining the more complex ideas.</p>", 
    "end_date": null, 
    "title": "Learn Sensational Spanish with Kieran - Level 1", 
    "price": "50.00", 
    "instructors": "Learn with Kieran", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/747374_4679_9.jpg", 
    "course_url": "https://www.udemy.com/learn-sensational-spanish-with-kieran-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T23:35:31Z"
}