{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t Welcome to all!!!  </p>  <p style=\"\">  \t <br style=\"\">  \t This course has been thought and designed for all who want to learn Spanish as a foreign language: children, young people, students, professionals and adults who want to learn Spanish in a very simple and fast way. <br style=\"\">  \t <br style=\"\">  \t <strong style=\"\">• How this course works </strong><br style=\"\">  \t No matter what level of Spanish you have, as this course is quite dynamic: although I added in an orderly and consecutively the sections of this course the student can go directly to what you like or where are you looking for: For example you need to learn or do a review of the personal pronouns, in that case it is only necessary to enter the respective video. For this reason the videos are short and precise with it. If the student has difficulty in understanding it, need clarification or help, I will send as quickly the answers you requires.  </p>  <p style=\"\">  \t <br style=\"\">  \t <strong style=\"\">• What offers this course? </strong><br style=\"\">  \t In this course you will find simple and easy videos, allowing you to learn instantly words in Spanish with its articles: el, la, los, las (that is why things are feminine and which are masculine), the conjugation of verbs, personal pronouns , numbers, the alphabet and their pronunciation, everyday conversations, and more.<br style=\"\">  \t In the course, students may also suggest topics of personal interest. For example if the student requires learning of a particular topic, which has not been provided in these videos, I will make the explanation in videos and share with all the students that can help them too. In this way the student will get some form of personalized and active learning within the course.  </p>  <p style=\"\">  \t <br style=\"\">  \t <strong style=\"\">• Suggestions to the students in this course</strong><br style=\"\">  \t It is suggested the student in each video make an instant refresher. What I mean with this? The videos are paused for the student to repeat the words, read them and understand them graphically. <br style=\"\">  \t How I&#039;ve mentioned before, the course is dynamic, the student can follow the order of each section and proceed directly to class or video that needs to learn or review. <br style=\"\">  \t • Who is this course for? <br style=\"\">  \t Everyone!!!, Children, youth, students, professionals, housewives, adult, passenger speaking countries, who want to learn Spanish FAST!  </p>  <p style=\"\">  \t <br style=\"\">  \t <strong style=\"\">• Student Requirements </strong><br style=\"\">  \t -You like Spanish and you wan to learn with or without knowledge  </p>  <p style=\"\">  \t -Want to learn Spanish fast <br style=\"\">  \t -Want a lot of vocabulary (words and their articles) <br style=\"\">  \t -Want to talk once in Spanish in everyday life <br style=\"\">  \t <strong style=\"\"><br style=\"\">  \t • On the Spanish league </strong><br style=\"\">  \t Spanish is a beautiful language but quite complex. Varies from country to country in both intonation and even the Spanish differs from Spain to Latin America and Central. In some countries speak faster and of course in every country we idioms (colloquial ways of saying things), which can only learn from being in each country. But language is one.  </p>", 
    "end_date": null, 
    "title": "Learn practical spanish right away!!!", 
    "price": "20.00", 
    "instructors": "Suselle Tejada Del Carpio", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238834_181a_5.jpg", 
    "course_url": "https://www.udemy.com/spanish-right-away/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-07T10:23:53Z"
}