{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>Ser/estar, indefinido/imperfecto, por/para, subjuntivo… can be real nightmares for students of Spanish. They are the \"trouble points\" of Spanish. In this course we will resolve these trouble points together.</p>  <p>Speak Spanish like a Native with this Course:</p>  <ul><li>Understand the Subjuntivo.</li><li>Distinguish ser and estar.</li><li>Use the presente perfecto, the pretérito imperfecto and pretérito indefinido.</li><li>Learn the perífrasis verbales.</li><li>Recognize por and para.</li><li>Categorize este, ese and aquel.</li></ul>            <p>Think like a native of a language of 560 million people.</p>  <p>We will use the categories that native speakers of Spanish use to describe the reality in Spanish. We will study step by step, each class is adapted to the level where the concept is studied.</p>  <p>Automatic mental mechanisms of native Spanish speakers will come into your mind and create a \"Spanish brain”. You will learn to categorize the world as the native Spanish speakers and speak like them.</p>  <p>I used my experience as teacher of Spanish with students around the world to create this course. Each topic has a detailed and easy explanation, a video with explained examples and exercises with solutions. Explanations contain many practical examples directly hitting the common mistakes of the student of Spanish.</p>  <p>Strike the trouble points of Spanish language!</p>  <p>¡Piensa y habla en español!</p>", 
    "end_date": null, 
    "title": "Master Spanish Language: Ser/Estar, Subjuntivo, Por/Para...", 
    "price": "20.00", 
    "instructors": "Javier González", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/649538_1fac_2.jpg", 
    "course_url": "https://www.udemy.com/strike-the-trouble-points-of-spanish-language/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-24T12:21:22Z"
}