{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \t Learning Spanish can be fun and engaging.  </p>  <p style=\"\">  \t This course is intended to help you become conversational in basic Spanish.  To become truly proficient in a second language requires years of practice, but this course is designed to give you an engaging, intuitive way to start communicating.  </p>  <p style=\"\">  \t          The course is designed around an imagined trip to a Spanish-speaking country.  You begin at your destination airport, and are guided through various real-life scenarios that you would find yourself in if you were really in a Spanish-speaking country.  These practical scenarios will be supplemented by clear and concise direct instruction in vocabulary and basic grammar.  For those who are interested in more in-depth explanations of the grammar, there are supplementary videos linked throughout the course.  </p>  <p style=\"\">  \t    Throughout the course, you will learn to talk about the following things in Spanish:  </p>  <p style=\"\">  \t    • meeting people  </p>  <p style=\"\">  \t    • what you need and want  </p>  <p style=\"\">  \t    • making purchases  </p>  <p style=\"\">  \t    • what you like and don&#039;t like  </p>  <p style=\"\">  \t    • getting medical help  </p>  <p style=\"\">  \t    • restaurants and hotel accommodations  </p>  <p style=\"\">  \t    • travel and getting around  </p>  <p style=\"\">  \t          The length of completion varies based on how long you need to spend on each unit, and how often you go back to review things that you previously covered.  Learning a language is not a race, so don&#039;t be afraid to take your time or to go back and review as necessary.  </p>  <p style=\"\">  \t     The course is designed to be self-directed, but the instructor will check messages at least weekly in order to answer questions or clarify concerns.  </p>  <p style=\"\">  \t       The course presents scenarios that you would encounter as a traveler, but most of what you learn could easily be transferred to other situations.  For instance, there are many scenes in which you are a customer of some sort; you could just as easily view these scenes from the point of view of the seller, doctor, etc.  </p>", 
    "end_date": null, 
    "title": "Quick Spanish: Start Speaking Today", 
    "price": "20.00", 
    "instructors": "David Nance", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/78226_08ef_9.jpg", 
    "course_url": "https://www.udemy.com/spanish-course/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-13T22:27:50Z"
}