{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p style=\"\">  \tThis Spanish Conversational Guide is a great course for those who want a condensed education on key Spanish vocabulary words and phrases. While this course offers some essential grammatical content, such as verb conjugations, articles, and prepositions, it will focus mostly on teaching you how to speak Spanish in a short period of time. In fact, we have arranged the lectures in a way that, after walking you through the basics, will guide you through events and activities that you might encounter once you arrive in a Spanish-speaking country.  </p>  <p style=\"\">  \t    We begin with the airport, and then walk you through all of the words and phrases that you might need when catching a cab, asking for directions, getting to the hotel, going to bank, etc. Then, we make sure to provide you with enough dialogues so that you can hear what you are learning in context; thereby allowing you to develop the ability to use context clues as a method of deducting the meaning of unknown words and phrases.  </p>  <p style=\"\">  \t    This course is intended for anybody interested in learning the Spanish language in a fun and easy to understand way. The only requirement is that you are committed to being an active Spanish language learner!  </p>  <p style=\"\">  \t    Again, we really value student interaction and are here to help you with your quizzes and worksheets, and many downloadable files and activities that you can do at the comfort of your own home. Don&#039;t hesitate to write to us and request more material; our main goal is that you learn!  </p>  <p style=\"\">  \t    ¡Gracias y buena suerte!  </p>", 
    "end_date": null, 
    "title": "Spanish Language Essentials", 
    "price": "20.00", 
    "instructors": "ProLingua USA", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/73016_4f08_5.jpg", 
    "course_url": "https://www.udemy.com/spanishsurvivalguide/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-02T11:16:19Z"
}