{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>  \tIn this Spanish course, which is really 4 courses in one, SpanishL2 takes you from complete beginner to advanced Spanish student. And if you are not a beginner, we still have lessons for you. With 4 levels and 323 videos, we have lessons for everyone.  </p>  <p>  \tYou will learn by watching, reading and listening to 323 videos covering vocabulary, pronunciation, grammar and punctuation. These lessons break things down and cover topics in detail. This is Spanish for Serious Language Learners. There are 323 lessons and over 109 hours of content. Every lesson has activities where you will be expected to put your knowledge to use. You will create with the language and speak. You can also ask questions and get answers from language professionals.  </p>  <p>  \tOnce you have worked your way through the entire course (all 4 levels), you will be a strong Spanish student and capable of holding your own in Spanish. Maybe you want to be able to speak with customers in Spanish. Or maybe you want to travel and use Spanish in one of the 20 countries where over 420,000,000 people speak it as their native language. Even in the United States there are over 37,000,000 native Spanish speakers. That&#039;s a lot of people speaking Spanish!  </p>  <p>  \tYou have 30 days to try out the entire course with 323 Spanish lessons. Udemy offers a money-back guarantee, so you only pay if you are happy with the course.  </p>  <p>  \tStudy. Learn. Use.  </p>", 
    "end_date": null, 
    "title": "Spanish 1-4: Beginner, Elementary, Intermediate and Advanced", 
    "price": "20.00", 
    "instructors": "Simple3", 
    "commitment": "109 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/10449_882c_17.jpg", 
    "course_url": "https://www.udemy.com/spanish-101-beginning-spanish-spanish-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-10-18T07:18:14Z"
}