{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p><strong></strong><strong>Not a native speaker, but you want to sound like one?</strong> This course is designed for <strong>beginner Spanish learners</strong> who want to <em>erase pronunciation errors before they even happen</em>. Perfect pronunciation is a hefty feat, but <strong>understanding the basic building blocks of the Spanish language</strong> (<em>the alphabet, digraphs, trigraphs and unique letters</em>) and the <strong>foundations of the pronunciation system</strong> (<em>dipthongs, hiatos and accent marks</em>) will place you on the path to <strong>pronunciation fluency</strong>. </p><p>If you're an <strong>intermediate or advanced student</strong>, but you would like to get back to the basics <em>to see where you might have gone wrong with your pronunciation</em>, this course is for you as well.</p><p><strong>Funny, engaging animated videos</strong> guide you through the thick and thin of the Spanish phonetic system, which is really not so tricky after all! <strong>PDF note sheets</strong> help you take useful notes that <em>you can use as reference sheets later on in your studies</em>, and <strong>video quizzes</strong> allow you to practice your pronunciation skills you've learned in the course! </p><p>This course teaches Latin American Spanish with Castillian Spanish (Spain) variations included.</p><p>Recent updates to the course include:</p><ul><li>3 Audio Lessons that you download to practice your Spanish pronunciation on the go</li></ul>", 
    "end_date": null, 
    "title": "Spanish Pronunciation: Speak Like a Spanish Speaker", 
    "price": "50.00", 
    "instructors": "Nikki Joslin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365738_221d_2.jpg", 
    "course_url": "https://www.udemy.com/pronouncespanish/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T11:00:08Z"
}