{
    "selfpaced": true, 
    "topic_name": [
        "Language"
    ], 
    "description": "<p>We proudly invite you to take part of the Verbotica course - incredibly easy way to learn perfectly all Spanish verbs. The system of Verbotica provides you the possibility to dominate 7000 Spanish with only 60 irregular verbs!! Throught our course of Verbotica you have the opportunity to understand and even teach the world&#039;s easiets system of rules in Spanish conjugation. Verbotica course is meant for all students who want to be sure while talking in any Spanish grammar tense or form. The course is structured in grammar tenses when every tense has several different verbs we will be practicing on. In the course are included UNIQUE COMPLETE lists of all Spanish irregular verbs. </p><p>What will you as a student get in this course?</p><ul style=\"\"><li style=\"\">The knowledge of the easiest way how to work with all Spanish verbs</li><li style=\"\">One simple system for all the tenses and forms - no more complicated memorizing!!</li><li style=\"\">Very clear and systematic explanations of the Spanish verbs</li><li style=\"\">The lists of all Spanish irregular verbs - with Verbotica they are only 60!!</li></ul><p>Are you as well a Spanish language teacher or you want to become one of us?</p><ul style=\"\"><li style=\"\">This course will provide you completly new view of Spanish verbs</li><li style=\"\">You will be able to explain this grammar to your students in much easier way than other teachers</li></ul>", 
    "end_date": null, 
    "title": "Verbotica® - the easiest way to learn Spanish verbs", 
    "price": "20.00", 
    "instructors": "Santiago Martínez", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440802_6882_2.jpg", 
    "course_url": "https://www.udemy.com/verbotica/", 
    "currency": "USD", 
    "subject_name": [
        "Spanish"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T23:49:51Z"
}