{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t<strong>                    Professional advice is not widely available </strong><strong>for entering the cosmetics industry which typically hires from within.</strong>  </p>  <p>  \t<strong>Jumpstart your cosmetics career by taking this course now!<br>  \t</strong>  </p>  <p>  \t                                          If you don&#039;t have experience, then at least be armed with knowledge.  </p>  <p>  \t                                          If you don&#039;t have contacts, then cast a smaller net targeting companies that are a better fit.  </p>  <p>  \t<strong>Present yourself as an insider.</strong>  </p>  <p>  \t                                          Many aspirants have the passion to get in, but don&#039;t demonstrate &quot;having done their homework&quot; to stand out.  </p>  <p>  \t                      Being able to speak as more in-the-know will help you advance.  </p>  <p>  \t<strong>In just 30 minutes, learn the basics. </strong><strong>Job Search Worksheet included as a guide.</strong>  </p>  <p>  \t                                                      These lectures give access to those seeking corporate work in the beauty business:  </p>  <ul>  \t<li>industry overview: top companies, key distribution channels, categories</li>  \t<li>realities and varieties of company culture, work styles, functional role</li>  \t<li>professional development tips and key networking organizations</li>  </ul>  <p>  \t                                          I created content because to have this background and resource as a roadmap would have been great when I was seeking to break into beauty more than a decade ago transitioning from financial services marketing. I successfully navigated the barriers to entry growing to mid-level executive at small and large companies including The Estee Lauder Companies, Inc. and L&#039;Oreal USA and even earned both a master&#039;s degree in Cosmetics and Fragrance Marketing and Management and an adjunct professorship in the undergraduate Cosmetics and Fragrance Marketing program at The Fashion Institute of Technology. Now, I have transitioned to independent consulting and instruction.  </p>  <p>  \t                                          Even if not pursuing work or study, it&#039;s just as informative for the curious at heart. Valuable and clear understanding of this fascinating, specialized field is guaranteed.  </p>  <p>  \t                                                        Yours in beauty.  </p>  <p>  \t                                                        ~T. Bernie  </p>", 
    "end_date": null, 
    "title": "Beauty Biz Basics to Break Into a Corporate Cosmetics Career", 
    "price": "20.00", 
    "instructors": "T. Bernie", 
    "commitment": "28 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/272310_78c6_11.jpg", 
    "course_url": "https://www.udemy.com/beautybiz-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-31T15:52:26Z"
}