{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Through the years I have enjoyed learning techniques of how to care for our type 4 hair. Now, it is time to pass that learning on to my daughters. I would love for you to join us. Take this course to gain the knowledge you need for hair care. </p><p style=\"\">I know it can be a challenge to maintain or grow a head of healthy hair if you don&#039;t have the information you need. If you are interested in growing your hair, repairing damaged hair, switching to a natural hair style, getting away from relaxers and perms, or just starting an overall health routine, this course provides the foundation knowledge.</p><p style=\"\">This course will take about an hour to complete as you engage with the video, reflect on the lessons, and closely inspect your hair. The course is structured in 3 sections that outline knowledge that you need.</p><p style=\"\">What are the Requirements?</p><ul style=\"\"><li style=\"\">No prior knowledge is required for this course.</li><li style=\"\">No additional materials are required for this course.</li></ul><p style=\"\">The Ideal Student:</p><ul style=\"\"><li style=\"\">Seeks knowledge about their hair.</li><li style=\"\"><span style=\"\"></span>Has an interest in basic hair structure and growth cycle.</li><li style=\"\"><span style=\"\"></span>Is caring for another&#039;s hair.</li><li style=\"\"><span style=\"\"></span>Wants to create a bridge on their hair care journey.</li></ul><p style=\"\">You will:</p><ul style=\"\"><li style=\"\">Learn what elements hair is made of.</li><li style=\"\">See a demonstration on hair typing.</li><li style=\"\">Receive instruction for use during hair growth phases.</li></ul>", 
    "end_date": null, 
    "title": "Black Hair Care: the Basics of Hair Typing and Growth", 
    "price": "20.00", 
    "instructors": "MAWMedia Group, LLC", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514788_d367_4.jpg", 
    "course_url": "https://www.udemy.com/the-black-hair-care-volume-1/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T18:37:14Z"
}