{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t    En este curso aprenderás a elaborar tu <strong style=\"\">propia fragancia desde cero</strong>, sin conocimientos previos y en tu propia casa.  </p>  <p>  \t    Encontrarás enseguida la ocasión perfecta para impresionar a amigos y seducir a tu pareja con esta fragancia, ya sea una fragancia sofisticada de noche, fresca de día, para un encuentro romántico para la ocasión que tu decidas.  </p>  <p>  \t<strong style=\"\">  ¿CÓMO APRENDERÁS?  </strong>  </p>  <p>  \t    Te enseñaré y te guiaré a través de lecciones sencillas y amenas <strong style=\"\">PASO A PASO</strong>, explicadas de manera muy exhaustiva en vídeo para que puedas hacer tu perfume en muy poco tiempo y ahorrando mucho dinero.  </p>  <p>  \t    Si te surge alguna duda, estoy ahí para ayudarte. Simplemente expón tu pregunta en el apartado de <em style=\"\">&quot;Apoyo técnico&quot; </em>y te responderé o antes posible.  </p>  <p>  \t<strong style=\"\">  ¿QUÉ BENEFICIOS OBTENDRÁS?  </strong>  </p>  <p>  \t    Este curso es el primer paso para adentrarte en el apasionante mundo de la perfumería, a tu ritmo y desde casa. Puede que descubras una vocación oculta y te conviertas en un Perfumista!  </p>  <p>  \t    IMPORTANTE: Como alumno del curso, recibirás periódicamente nuevos post en el blog y trucos de perfumería, así como CUPONES DESCUENTO y promociones para el resto de mis cursos de perfumería.  </p>", 
    "end_date": null, 
    "title": "Crea tu propio perfume en sencillos pasos", 
    "price": "30.00", 
    "instructors": "Sandra Iruela", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/424808_d9ee.jpg", 
    "course_url": "https://www.udemy.com/crea-tu-propio-perfume-en-sencillos-pasos/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T10:53:18Z"
}