{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \tCe cours vous enseigne le <span>style parfait pour votre personnalité. Lorsque vous comprenez quel est le style qui vous convient, vous pouvez commencer à développer ce que l’on appelle le « style sans effort » ! Vous trouverez également de nouveaux moyens pour exprimer votre propre identité, vous aurez confiance dans le choix de vos vêtements et vous serez inspirée pendant vos séances de shopping. </span>  </p>  <p>  \t<span>L&#039;idée de s&#039;aimer soi-même peut paraître arrogante, mais en fait nous allons parlé de l’auto-acceptation et la création d&#039;une image positive de soi-même. L&#039;image que l&#039;on a de soi-même est la base de tout. Si l&#039;on s&#039;aime intérieurement et extérieurement, tout le reste devient positif.</span>  </p>  <p>  \t<span>Il existe un grand nombre de trucs et astuces du métier pouvant vous aider à valoriser vos points positifs et équilibrer ainsi votre silhouette, quelle que soit votre taille et votre forme! Le Coaching de style vous apprend comment habiller chaque client afin qu’il soit et se sente au top! Nous allons passer en revue les 5 morphologies de base et partager avec vous des astuces pour bien démarrer. Nous espérons que vous apprendrez des choses nouvelles qui vous permettront d’apprécier d’autant plus le contenu de vos armoires!</span>  </p>  <p>  \t<span>On ne peut pas parler de style sans aborder les nuances de couleurs, la leçon de cette semaine vous apprendra quelques bases essentielles afin de porter les couleurs qui vous vont bien. Dans ce cours, notre but est simplement de vous aider à mieux comprendre votre propre palette de couleurs, et de commencer à utiliser ce précieux savoir lorsque vous choisissez les couleurs de vos tenues et de vos accessoires.</span>  </p>  <p>  \t<span>Vous apprendrez les bases de réalisation d’un style personnel qui vous convient parfaitement, met en valeur vos superbes attributs, et camouflera ce qui vous plaît moins. Vous apprendrez à:</span>  </p>  <ul style=\"\">  \t<li>découvrir votre silhouette et les traits de votre visage.</li>  \t<li>accentuer des attributs et en camoufler d’autres.</li>  \t<li>créer une silhouette balancée grâce à des astuces mode et des coupes de vêtements.</li>  \t<li>travailler avec des palettes de couleurs qui vous donnent bonne mine.</li>  \t<li>choisir des coiffures qui mettent en valeur la forme de votre visage.</li>  \t<li>prendre le meilleur soin possible de votre peau et de vos cheveux.</li>  \t<li>créer des ambiances différentes avec certains styles.</li>  \t<li>utiliser les tendances de manière avisée pour savoir ce qui vous va bien ou pas.</li>  \t<li>maximiser la valeur de vos vêtements - faire des miracles avec un budget limité.</li>  \t<li>penser différemment et briser la monotonie de la mode.</li>  </ul>", 
    "end_date": null, 
    "title": "Devenir Experte en Relooking et Beauté", 
    "price": "20.00", 
    "instructors": "Modulas Académie", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/420870_f54d_6.jpg", 
    "course_url": "https://www.udemy.com/devenir-experte-en-relooking-et-beaute/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T07:18:34Z"
}