{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t       Is a few minutes of your time worth a glowing, younger looking face?  </p>  <p style=\"\">  \t       Would you like to see improvements on your face in the next 28 days?  </p>  <p style=\"\">  \t       Would you like to turn back the hands of time?  </p>  <p style=\"\">  \t       Would you like to feel better about your face&#039;s appearance?  </p>  <p style=\"\">  \t   Face yoga has already won devotees among the forever-young-looking celebrity crowd. Celebrities like Gwyneth Paltrow and Jennifer Aniston are said to be big fans of Face Yoga.  </p>  <p style=\"\">  \t   I am going to teach you the exact exercises you need to know in order to master face yoga and take years off your face. The great news is you only need to spare less than 10 minutes a day and I will even show you how to do a mini-facelift in less than 10 minutes. No prior experience is required.  </p>  <p style=\"\">  \t Now you can get a stronger, happier face.  </p>  <p style=\"\">  \t       Like a strength-training workout at the gym, exercising the muscles of  your face will give you the same toned, sculpted effect that exudes  youthfulness and radiance.<strong style=\"\">Look better </strong>and feel great at any age with the Face Yoga Method.  </p>  <p style=\"\">  \t Welcome!  </p>  <p style=\"\">  \t I&rsquo;m Fumiko Takatsu, creator of the Face Yoga Method.<strong style=\"\"></strong>I developed the Face Yoga Method to help make you feel proud of yourself and walk with confidence in the world.  </p>  <p style=\"\">  \t <br style=\"\">  \t       In other words: I&rsquo;m here to make you look young again.<strong style=\"\"></strong>Confidence  isn&rsquo;t all about how we look. However, if our older-looking appearance  doesn&rsquo;t reflect the vivacity inside us, that disconnect can make us feel  misunderstood, shy and embarrassed.  </p>  <p style=\"\">  \t <br style=\"\">  \t       Face Yoga Method uses conventional approaches &ndash; muscle exercises,  stretching and visualization &ndash; to naturally tighten, tone and brighten  your face, and do away with those inhibiting, negative emotions.  I know  from personal experience, as I survived what could&rsquo;ve been a fatal car  crash that significantly altered and aged my face. I developed Face Yoga  as my own &ldquo;medicine,&rdquo; never imagining at the time that I&rsquo;d bring it to  the public.  </p>  <p style=\"\">  \t <br style=\"\">  \t       Since I introduced Face Yoga in Japan, my home country, I&rsquo;ve become a  best-selling book author, graced almost 100 Japanese magazines, been  featured on multiple TV shows, worked as a corporate sponsor for several  major brands, and trained 7 Face Yoga-certified teachers.  </p>  <p style=\"\">  \t <br style=\"\">  \t       I&rsquo;m known as a Face Yoga expert, and am committed to bringing you  top-notch knowledge plus in-the-trenches experience about how to look  young again. My thousands of clients and followers will tell you that  Face Yoga changed their lives. <br style=\"\">  \t <br style=\"\">  \t But let&rsquo;s rewind about a decade, to  the serendipitous event that started it all.  I was an American-educated  academic living in Japan, teaching English. At 36, I still looked  pretty great and was convinced my youthfulness was invincible.  Then,  one day while vacationing in California, I was riding in the passenger&rsquo;s  seat of a car and we got hit at high speed. The impact caused my hip,  shoulder, and head to be thrown off-kilter. I&rsquo;m lucky to be alive now.  </p>  <p style=\"\">  \t<br style=\"\">  \t       I remember experiencing the shock of a lifetime when I got my  driver&rsquo;s license photo taken after the crash and observed my  asymmetrical face. It was difficult to look at myself.  I panicked. I  started to buy expensive facial creams, lotions and treatments, but none  were helping me look young again.  </p>  <p style=\"\">  \t <br style=\"\">  \t       Then one day, I was standing in front of the mirror and realized  that if I exercise my body muscles, I should be able to do the same for  my face. That&rsquo;s when Face Yoga Method was born.  After practicing  facial exercises for several weeks, people started commenting on my  results. They said I looked younger and more aligned, and wanted to  learn how to tone their faces too.  </p>  <p style=\"\">  \t <br style=\"\">  \t       That&rsquo;s why I do what I do &ndash; to share with you the practices that restored my confidence.  Eventually,  I wrote a book, which became a national bestseller in Japan. I realized  there&rsquo;s a great need for Face Yoga, because people really deserve to be  youthful both in heart and appearance.  Now living in the US again, I&rsquo;m  excited to bring Face Yoga to you.  </p>  <p style=\"\">  \t <br style=\"\">  \t       This course is filled with the resources, encouragement and support to make you look and feel great again.<strong style=\"\"></strong>If  there&rsquo;s any way I can help, please don&rsquo;t hesitate to email me. Until  then, I wish you all the best in your journey to regaining your youth.  </p>  <p style=\"\">  \t <br style=\"\">  \t       Change your face, change your life,  </p>  <p style=\"\">  \t       Fumiko  </p>", 
    "end_date": null, 
    "title": "Face Yoga Method - Take five years Off your face in months", 
    "price": "50.00", 
    "instructors": "Fumiko Takatsu", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/131176_adf7_16.jpg", 
    "course_url": "https://www.udemy.com/face-yoga-method/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-09T04:48:13Z"
}