{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t Be Ever-young - the Natural Non-Surgical Face-Lift was designed for the busy person.  It was developed by a Medical Hypnotherapist, Acu-point Specialist and International Speaker on Holistic Medicine..  It is quick and easy and fun to learn and do while moving through your day.  It's a FACE-LIFT TO GO.  </p>  <p>  \t The program blends western physiology and eastern energetics.  In other words, it is a complete program with powerful elements that work your facial muscles, unstick energy blockages and relax your mind.  </p>  <p>  \t Smooth away unsightly wrinkles, reduce puffiness, release ugly tension lines, and lift up your face from the inside out.  This is a fun and fascinating course.  </p>  <p>  \t Here are just some of the things students learn:  </p>  <ul>  \t<li>How to use Facial Renewal Exercises to defy gravity.</li>  \t<li>What Your Face Says About You (Visual Diagnosis) The face reflects the state of  inner health.  Learn what Traditional Chinese Medicine (TCM) practitioners can tell by just looking at the face.</li>  \t<li>How to use Acu-Point Therapy (Acupressure) to reduce puffiness, tone underlying tissues, alleviate headaches, TMJ, teeth clenching and grinding and sinus problems.</li>  \t<li>How to RELAX and to become EMPOWERED letting beauty and confidence shine from the inside out. This course includes audio guided imagery sessions and affirmations to download and take with you to feel calm, centered, secure and beautiful all day long.</li>  </ul>  <p>  \t Be Ever-Young Face-Lift to Go is the perfect portable program to get you moving toward a look of youthful radiance.  It is quick, it's easy, it's FUN.  </p>", 
    "end_date": null, 
    "title": "Facelift to Go - No Botox or Dangerous Surgery", 
    "price": "35.00", 
    "instructors": "Patricia Gilmore", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253234_5517_6.jpg", 
    "course_url": "https://www.udemy.com/face-lift-to-go-be-ever-young/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-30T15:07:09Z"
}