{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Effortlessly perfect skin for women of all ages</strong></p><p>I believe great skincare should be effortless fit into every lifestyle - you shouldn't need to spend a fortune, and find yourself confused but advertising messages. This course will empower you to take control of the vast range of skincare products in the market by feeling educated on ingredients and your own skin type. I want to make sure you look and feel your best every day, and for years to come.</p><p><em>After taking this course you will:</em></p><ul><li>Create reliably flawless skin, and slow the ageing process dramatically</li><li>Understand what skin type you have</li><li>Learn which ingredients to look out for in the products you buy</li><li>Discover which products give incredible results, and which are just not worth bothering with</li><li>Learn time saving and money saving techniques that will still give you flawless skin</li><li>Hear my golden rules of skincare to guarantee an improvement</li><li>Uncover which is my Holy Grail beauty product that you simply can't live without</li><li>Learn to love your skin, with or without make up on</li><li>Be confident in who you are, and have a rock solid skin care routine to back you up</li></ul><span></span><p>I'm not a professional dermatologist - I am a normal woman just like you, and I need a skincare routine that will fit in with my busy lifestyle. I am passionate about skincare, getting great value for money, and have spent years trawling Youtube and blogs for the best recommendations. I'm so excited to teach you all my tips and tricks for looking flawless!</p><p>Take this course today, and get control of your bathroom cupboard!</p>", 
    "end_date": null, 
    "title": "Get Perfect Skin (anti ageing & blemish free)", 
    "price": "20.00", 
    "instructors": "Louise Croft", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535284_1362.jpg", 
    "course_url": "https://www.udemy.com/effortless-anti-ageing-skincare/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T17:06:38Z"
}