{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>In this course titled</strong> </p><p><strong>Get surgery free Hypnotic face lift ♥ Virtual Hypnotherapy  </strong></p><p><strong><em>All Files and videos are downloadable for easier access</em></strong></p><p>Learn that if you have been using cosmetics regularly without success to rejuvenate your looks and to access your natural beauty hidden by stress and worries. This is the course for you this course is not meet to replace looking after your facial features with cosmetic products and creams, this course was created to help you release all the tension that you may be holding within the muscles of your face. The same muscles you use to laugh with or cry, however if you have a lot of stresses in your life or have had a lot of stresses in your life you may be still holding on to them on your face. </p><p>My first experience of a woman making changes to her appearance with what I am going to teach you here is when I was giving a free demonstration using EFT to lady that I knew absolutely nothing about, I didn't even know what we were working on as I allowed her to keep it private as this was only a demonstration and then after the demonstration she was on her way feeling a little better.</p><p>Then one day she phoned me for an appointment and told me that after I had worked with her the next day people who knew her wanted to know what makeup she was using as she looked great .</p><p>So I decided there and then maybe even more people could get the same results and as I worked with clients on problems with EFT and hypnosis I could physically see the years just slip away from their faces.</p><p>So I created this course and here you are ready to take this course that will help change how you look and feel with simple and easy to apply exercises and hypnosis.</p><p><strong> </strong><strong>What I will teach you in this course to have you feeling great and rejuvenate your appearance </strong></p><p><strong>1. You will begin by creating an image in your mind of what changes you want </strong></p><p><strong>2. Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</strong></p><p><strong>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</strong></p><p><strong>4. Learn how you naturally resist changes even changes that can be very good for you</strong></p><p><strong>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</strong></p><p><strong>6. Learn who can and cannot be hypnotized</strong></p><p><strong>7  Get surgery free Hypnotic face lift ♥ Virtual Hypnotherapy bonus section </strong></p><p><strong>Learn how you can have a great feeling anytime you want to</strong></p><p><strong> How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings from your life</strong></p><p>All Files and videos are downloadable for easier access</p>", 
    "end_date": null, 
    "title": "Get surgery free Hypnotic face lift ♥ Hypnotherapy solution ", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419464_b8ff_3.jpg", 
    "course_url": "https://www.udemy.com/hypnotic-face-lift/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T18:03:55Z"
}