{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course provides complete instruction to create a complete homemade facial skincare regimen for red, irritated, rosacea and sensitive skin types.</p><p>You will learn detailed information about making, using and storing highly effective skincare creations including cleansers, mask, toner and moisturizer. You will also learn what else you can do calm and sooth difficult skin. </p><p>Course benefits:<br></p><ul><li>Taylor your skincare to your exact needs</li><li>Create gentle cleansers that don’t cause irritation</li><li>Sooth and calm redness and rosacea</li><li>Discover the amazing techniques essential for looking your best</li><li>Enjoy clear, glowing skin</li><li>Avoid unsafe and irritating chemicals of commercial products</li></ul><p><br></p><p>The course offers:</p><ul><li>Learning from a professional formulator of natural botanical skincare</li><li>Knowledge to create complete daily and weekly regimens of fabulous quality skincare</li><li>Easy step-by-step instructions</li><li>Detailed simple recipes in pdf format</li><li>Understanding of the most beneficial and effective ingredients</li></ul><p><br></p><p>This course is packed with insights from years of experience. You will never find better skincare than what you can make yourself. It will be effective, safe and healthy. This course emphasizes healing, protective botanicals. Avoid the costs, irritating preservatives and often unsafe chemicals of commercial products by making your own skincare in lovingly wholesome small batches. </p><p>A few hours of kitchen fun will provide all your skin care needs for two to six months.</p><p> Crafting skincare in your own kitchen really is fun and it's creative. Most importantly, you'll be deeply caring for yourself each and every time you use your own creations. </p><p>Enroll now for the best skin of your life!<br></p>", 
    "end_date": null, 
    "title": "Homemade Skincare: How to Make Effective Rosacea Remedies", 
    "price": "20.00", 
    "instructors": "Elizabeth Heck", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567666_1511_2.jpg", 
    "course_url": "https://www.udemy.com/diy-redness-rosacea-skincare-regimen/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T20:24:56Z"
}