{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This course provides complete instruction to create a complete homemade facial skincare regimen for acne or oily skin types.</p><p>You will learn detailed information about making, using and storing highly effective skincare creations including cleansers, mask, toner, moisturizer and spot treatment. You will also learn what else you can do to create beautiful, clear skin. </p><p>Course benefits:<br></p><ul><li>Taylor your skincare to your exact needs</li><li>Create gentle cleansers that don’t cause excess oil production</li><li>Effectively care for acne and oily skin without damage</li><li>Enjoy clear, glowing skin</li><li>Quickly zap blemishes with a miracle spot treatment</li><li>Avoid unsafe chemicals of commercial products</li></ul><p><br></p><p>The course offers:</p><ul><li>Learning from a professional formulator of natural botanical skincare</li><li>Knowledge to create complete daily and weekly regimens of fabulous quality skincare</li><li>Easy step-by-step instructions</li><li>Detailed simple recipes in pdf format</li><li>Understanding of the most beneficial and effective ingredients</li></ul><p><br></p><p>This course is packed with insights from years of experience. You will never find better skincare than what you can make yourself. It will be effective, safe and healthy. This course emphasizes antibacterial, anti-inflammatory and healing botanicals. Avoid the costs and and often unsafe chemicals of commercial products by making your own skincare in lovingly wholesome small batches. </p><p>A few hours of kitchen fun will provide all your skin care needs for two to six months.</p><p> Crafting skincare in your own kitchen really is fun and it's creative. Most importantly, you'll be deeply caring for yourself each and every time you use your own creations. </p><p>Enroll now for the best skin of your life!<br></p>", 
    "end_date": null, 
    "title": "Homemade Skincare: How to Make Effective Remedies for Acne", 
    "price": "20.00", 
    "instructors": "Elizabeth Heck", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568364_7525.jpg", 
    "course_url": "https://www.udemy.com/diy-skincare-acne-oily-skin-regimen/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T15:47:07Z"
}