{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em><em><em><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></em></em></em></p>\n\n<p>  \t<strong>Do  you see hair as a canvas; are you always trying to come up with unique  and intriguing hairstyles? </strong></p>\n\n\n\n\n\n<p><strong>Do you daydream about styling the hair of the  world's most influential people?</strong></p>\n\n\n\n\n\n<p><strong> Have you perfected your hair cutting  skills to a fine art?</strong></p>\n\n\n\n\n\n<p><strong> Have you always dreamed about working for yourself  and setting your own hours, rather than working for someone else?</strong></p>\n\n\n\n\n\n<p> If  all of this sounds good to you and you are one of those people that  dreams about the most unique and interesting way to make other people  beautiful. Maybe you should consider running your own hair salon.  </p>\n\n\n\n\n\n<p>  \tThis  course will teach you everything you need to know about running a hair  salon, and how to turn your passion for style into a great personal and  independent financial gain. Although running a hair salon will  definitely be a lot of hard work on the part of the owner. </p>\n\n\n\n\n\n<p>This course  will give you all the necessary tools and information so that you can  achieve your dream of owning and operating your own hair salon. </p>\n\n\n\n\n\n<p>This  course will show you all the ins and outs of the business and alleviate  some of the stress (although not the work) of getting your hair salon on  the ground and establishing his reputation as a styling hotspot amongst  all the fashion insiders.</p>\n\n\n\n\n\n<p>Nothing is kept secret - I reveal all I know ... and as I test even more\n things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>\n\n\n\n\n\n<p>\n  \t                                                                     \n                                                           As well as \nthe Udemy 30 day guarantee, you have my personal promise that you will \nbe wowed and delighted by what you'll learn in the next 3 to 4 hours ...\n and <strong>you'll be kicking yourself if you already have a Udemy course</strong> and have been missing out on fabulous potential HAIR SALON earnings.  </p>\n\n\n\n\n\n<p> <strong>As with all my courses:</strong> </p>\n\n\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently $ 45, but will next increase to $ 497</li><li>You have unlimited lifetime access at no extra costs ever !!!</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li><strong>There's an unconditional, never any questions asked full 30 day money back in full guarantee</strong></li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy.</li></ul>\n\n\n\n\n\n<p> <strong>This will be a truly interactive course with additional bonus routines added over the course of the first year, inspired by the seasons and based on feedback from students.</strong> </p>\n\n\n\n\n\n<p> <strong>Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...Scroll up and Enroll Now! </strong> </p>", 
    "end_date": null, 
    "title": "How to Start a Hair Salon Business With No Money Hair Salon", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267142_c06f_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-up-a-successful-hair-salon/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T05:51:46Z"
}