{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t  This course is for anyone who is tired of paying a fortune for skincare products that are not necessarily getting the results promised by marketeers. It is also for people worried about the suspect preservatives that go into your beauty products.  </p>  <p style=\"\">  \t  If you create your own skincare, not only can you trust the ingredients that go into it, but you can save a lot money and you get to personally customise products to suit your own skin.  </p>  <p style=\"\">  \t  In this course we will learn how to make:  </p>  <li style=\"\"> A beautiful rich cleanser that is also a gentle make up remover.</li>  <li style=\"\"> Some lovely refreshing toner that cleans and opens up your pores.</li>  <li style=\"\"> A moisturiser that can be adapted to suit your preference and skin needs.<br style=\"\">  <br style=\"\">    We will be using lots of butters and waxes and floral waters all teamed together some beautiful smelling essential oils. I buy my ingredients online and have saved so much money when compared with the products I used to buy straight from the shelf. You don&#039;t need a lot of equipment, the only new thing I have bought in terms of equipment is a set of digital scales that cost me &pound;8, the rest is all are pots, dishes and utensils that I already had in the cupboard.</li>    The course consists of video modules. Also included are PDFs for your shopping list, recipes and references to books and websites I use.  <p style=\"\">  \t  Although I have recipes to follow, I encourage students to adjust recipes to suit your own skin needs and tastes. For example, I love lavender but I appreciate not everyone does, therefore I have made alternative suggestions. Once you have completed this course, you will have a good foundation to personalise your skincare routine to suit you.  </p>  <p style=\"\">  \t  Learning about natural skincare for me, led me to be generally more healthy. I can honestly say I am much more in tune with my body holistically and what it needs when I&#039;m feeling low. I really hope others can benefit in this way too.  </p>  <p style=\"\">  \t  You could complete this course in a day or spread the time it takes you to feel comfortable in making each product.  </p>", 
    "end_date": null, 
    "title": "How to make your own natural skincare routine.", 
    "price": "20.00", 
    "instructors": "Rochelle Maas", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/106878_e9b4_9.jpg", 
    "course_url": "https://www.udemy.com/natural-skincare-routine/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-16T22:04:54Z"
}