{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t                  In this course you will learn <strong>the best makeup recipes and how to make 10.000$ selling it.</strong></p><p>  \t                  All the ingredients are safe and tested. And you probably have them at home!  \t<strong>You will have access to all the videos.</strong>  \t                  The course is not boring! It is high-quality step-by-step to learn how to make makeup with special recipes!</p><p>You can sell your own makeup too! Why not? You just need to be carefull and put extra effort and create your own design products! You can sell them as \"Makeup Natural Products\"! I have already made <strong>12.000$ </strong>selling my makeup products. People love it!Don't be scared about the EXPLOSIVE name of the course. Try, and I promise you will love it.</p><p>  \t                  You can make the products while you are watching the video (you can't fail).  \t                  You will save lots of Money with this course because you won't need to spend Money in makeup anymore.  \t                  Don't worry if you are not a professional on makeup. This course can be for anyone!  </p>  <p>  \t            Sometimes, you probably give your family or friends makeup (at Christmas or on birthday). If you offer them your OWN makeup (makeup done by you at home) they will love it even more! Because they know you spent time doing their presents. And you will <strong>save lots of Money</strong> too! It is awesome for both parts!</p><p>  \t                  After the course you can submit your questions and I will answer them quickly!  </p>  <p>  \t            If you don't buy the course you are losing Money right now... You are spending lots of Money buying makeup.  </p>  <p>  \t            <strong>Take action</strong> and you can start <strong>making Money</strong> right NOW!  </p>", 
    "end_date": null, 
    "title": "Learn Makeup Recipes to Create Your Very Own Makeup", 
    "price": "20.00", 
    "instructors": "Filipa \"F.C\" Canelas", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/282112_1082_3.jpg", 
    "course_url": "https://www.udemy.com/learn-makeup-recipes-to-create-your-very-own-makeup/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-16T17:26:25Z"
}