{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Namaste!!</p><p>Here is a short course for all the women, who would like to learn how to wear the most sought Indian wear, which is the <strong>'Saree'</strong>. <strong></strong></p><p><strong>Look Gorgeous by Wearing the Indian Saree With Video Explanation</strong></p><ul><li>We do understand that many of you out there just love to wear the saree, easily<span></span></li><li>We also know that many of you stop wearing a saree or don't even try because you don't know how to wear it! </li><li>Also, there are some of you who don't want to wear a saree because you don't know how to wear it correctly and be comfortable through out the day</li></ul><p>Not to worry, we've got all of you covered!! In this video, you will not only learn the basics of how exactly to wear a saree, but also how to wear it and <strong>carry yourself comfortably, with grace!! </strong>With simple step-by-step explanation along with a live demonstration on a mannequin, you will be learning 18 different styles of wearing a saree which include the variations of :</p><ul><li><strong>Nivi style</strong></li><li><strong>Gujarati Style</strong></li><li><strong>Bengali Style</strong></li><li><strong>Saree like Lehenga</strong></li><li><strong>Mermaid Style</strong></li><li><strong>Kerala Style</strong></li></ul><p>Yes, That's right!! You can experiment with your looks every single time you wear a saree!! Majority of the women, know only one or two ways to wear a saree based on their traditions, religions and many other demographics. But, once you watch this video, you would have learnt all the 18 different ways and been ready. Off course, you will need some amount of practice along with it. The instructions are very simple and easy to follow.</p><p>We have designed this course, to make it easy for all the Indian girls who want to look gorgeous &amp; gracious in a saree. </p><p style=\"\">You could be a beginner who doesn't know how to wear a saree at all </p><p style=\"\"><strong>OR</strong> </p><p>a person who wants to learn more variations and try them out on yourself</p><p style=\"\"> <strong>OR </strong></p><p>a beautician who would like to use these videos to enhance your skills!!</p><p>We hope you do enjoy the videos and make sure you practise wearing the different styles of sarees and stun people around you with your vivacious looks!! Have a great time!!</p><span></span>", 
    "end_date": null, 
    "title": "Learn how to wear a Saree", 
    "price": "20.00", 
    "instructors": "Shamanth N, Trainer & Therapist Bhavini Shamanth", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/701342_523f.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-wear-an-indian-saree-and-look-gorgeous/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-19T08:53:52Z"
}