{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Flawless makeup for real women</strong></p><p style=\"\">I believe make up should fit into every lifestyle, and you shouldn&#039;t need years of training and a bottomless wallet to look and feel amazing. This course will empower you to take control of the vast sea of makeup options out there, and look your best every day.<br style=\"\"></p><p style=\"\"><em style=\"\">After taking this course you will:</em></p><ul style=\"\"><li>Understand how to create a flawless base</li><li>Take your makeup quickly from day to evening to night</li><li>Fit different makeup options into a limited time frame</li><li>Learn which bargain products beat the designer ones</li><li>Pick up my tips and tricks for time saving and avoiding makeup mistakes</li><li>Understand the difference between types of brushes and application techniques</li><li>Tailor complex techniques (like contouring and false lashes) to a realistic lifestyle</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\">I&#039;m not a professional makeup artist - I am a normal woman just like you, and I need a makeup routine that will fit in with my busy lifestyle. I am passionate about makeup, getting bargains, and have spent years trawling Youtube and blogs for the best recommendations. I&#039;m so excited to teach you all my tips and tricks for looking flawless!</p><p style=\"\"><br style=\"\"></p><p style=\"\">Take this course today, and get control of your makeup drawer!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Makeup: Effortless Makeup for Real Women", 
    "price": "20.00", 
    "instructors": "Louise Croft", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440204_ea3a_3.jpg", 
    "course_url": "https://www.udemy.com/makeup-effortless-makeup-for-real-women/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T07:18:55Z"
}