{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This class is essential for anyone that aspires to be a makeup artist professionally or otherwise. &nbsp;It is vital to understanding business, protocol, how to network, and how to create and seize opportunities.&nbsp; Upon completing this course, you will understand how best to take your job as a makeup artist and transform it into a money earning career.<br></p><p>Industry Expert</p><p><strong>Patty Bunch</strong> <em>Makeup-Artist</em><p>As a two-time Emmy nominated make-up artist, Patty is in constant&nbsp; demand by producers, directors and network executives.&nbsp; She has been a contributing make-up expert&nbsp; for such magazines as <em>Allure</em>, <em>In-Style</em>, <em>TIME</em>, <em>Teen Vogue</em>, and <em>W</em>.&nbsp;&nbsp; Her personal clients include Hollywood stars’ Billy Crystal, Patricia&nbsp; Heaton, Geena Davis, Megan Mulally, and Reba McIntire.&nbsp; Patty has worked on over 50 television shows&nbsp; with <em>Desperate Housewives</em>, <em>Who’s the Boss</em>, <em>Mike and Molly</em>, <em>Designing&nbsp; Women</em>, <em>Greek</em>, <em>$#*! My Dad Says</em>, and, <em>Will and Grace</em> among her credits.&nbsp; <p>Also, Patty is a licensed esthetician and founder of APB&nbsp; (Agency Patty Bunch), a highly regarded networking agency for professional&nbsp; make-up artists.&nbsp; She has served as a&nbsp; Master Educator for MAC, Genie Beauty Products, and other top tier cosmetic&nbsp; companies.&nbsp;&nbsp; Patty has worked on many blockbuster&nbsp; films and extensively with film celebrities such as Halle Berry and Jennifer Anniston.</p>\r\n", 
    "end_date": null, 
    "title": "Makeup: Becoming a Professional Hollywood Makeup Artist", 
    "price": "20.00", 
    "instructors": "Faith in Dreams Edutainment", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/68858_8155_8.jpg", 
    "course_url": "https://www.udemy.com/fidmakeup/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-23T21:39:26Z"
}