{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Thank you for visiting our course. </p><p>Our Make Beautiful Mineral Makeup (Complexion)' course will teach you everything you need to know to make your own beautiful makeup.</p><p>Have you ever wished you could save money on your makeup bill? Or had a reaction to the chemical ingredients of shop makeup? Have you ever been frustrated that the makeup you buy doesn't quite match your unique skin tone?</p><p> If so then this course is perfect for you.</p><p>Mineral makeup is amazing; it doesn't clog your pores, it's natural and the ingredients are actually healing for your skin. Plus it's super easy and fun to make if you know how.</p><p>In our course you will learn:</p><ul><li>How to make 5 essential makeup products: primer, concealer, foundation, blusher and finishing Powder.</li><li>How to make a foundation colour powder that perfectly matches your unique skin tone. (Never worry about buying the wrong shade again) </li><li>How to easily source the ingredients online.</li><li>Why mineral makeup is great for your skin, and what the specific benefits of each ingredient are.</li></ul><p>In an hour or less you can have a complete set of beautiful mineral makeup that looks great and heals your skin too. </p><p>You're friends will definitely be asking where you got your makeup from!</p><p>We have also included a free, printable label sheet so you can personalise your makeup pots and easily keep track of your creations. This you can download from our website or on the course page.</p><p>We know you'll love making your own mineral makeup. Try our mineral makeup course today and become your very own makeup expert!</p><p>Thank you for choosing Freedom Courses</p>", 
    "end_date": null, 
    "title": "Make Beautiful Mineral Makeup (Complexion)", 
    "price": "25.00", 
    "instructors": "Freedom Courses", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579356_3559_2.jpg", 
    "course_url": "https://www.udemy.com/make-beautiful-mineral-makeup-complexion/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T19:21:24Z"
}