{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \tThis <strong style=\"\">Professional Make-up Course</strong> will help you master many important <strong style=\"\">make-up techniques</strong> to start practicing either on yourself or on other people to enhance anyone’s beautiful features, disguise minor faults in one’s appearance, or express yourself creatively.  </p>  <p>  \tThe course consists of 8 topics and 30 video tutorials, and is designed so that you can <strong style=\"\">master all the techniques</strong> gradually, starting from basic and relatively simple techniques before moving on to the more demanding techniques that <strong style=\"\">professional make-up artists</strong> use to create contemporary looks in their everyday work.  </p>  <p>  \tFrom this course you will learn how to:  </p>  <ul style=\"\">  \t<p>  \t\t&gt; Choose your tools, take good care of them, and use them for best results;  \t</p>  \t<p>  \t\t&gt; Use color theory principles when choosing colors in make-up when working with different people;  \t</p>  \t<p>  \t\t&gt; Make skin look flawless using different textures of foundations;  \t</p>  \t<p>  \t\t&gt; Enhance highlights and shadows to create the illusion of depth on the face and create a sculpted look;  \t</p>  \t<p>  \t\t&gt; Shape eyebrows and enhance their beautiful shape;  \t</p>  \t<p>  \t\t&gt; Correct eye shapes and master many eye make-up techniques that will draw attention to the most beautiful features of the face;  \t</p>  \t<p>  \t\t&gt; Work with different textures of lip products to make them either stand out or remain subtle and hidden to make eyes look even more expressive.  \t</p>  </ul>  <p>  \tIt will take around 10 hours to go through all the video tutorials. Remember, to acquire a <strong style=\"\">professional range of make-up skills</strong>, it is crucial to practice them as much as possible. It might take you 20 hours or more to repeat all the techniques at least once on yourself or on your models. However, for <strong style=\"\">best results</strong>, it is recommended to go through them at least 5 times; therefore, properly <strong style=\"\">practicing the skills</strong> of this course might take up to 100 hours.  </p>  <p>  \t<span>In addition to video tutorials, you’ll also receive a <strong style=\"\">comprehensive workbook</strong> and a full list of high-quality professional make-up products that will not only be necessary to practice all of these make-up skills, but also for your future work.</span><span></span>  </p>", 
    "end_date": null, 
    "title": "Make-up for Beginners: learn doing make-up like a Pro", 
    "price": "50.00", 
    "instructors": "Lana Vallo", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398016_96cd_4.jpg", 
    "course_url": "https://www.udemy.com/training-course-on-professional-makeup-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T13:33:59Z"
}