{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">Mehndi art is a vast subject. If you want to become a pro in this art, then it is necessary that you first get familiar with the basics of this beautiful art. All the mehndi enthusiasts who are keen on learning the art of mehndi, need to acquire the method of applying it. </p><p style=\"\">It is important to enroll yourself into a well designed structural course in mehndi in order to explore the different styles incorporated in this art. This course offered to you all is a comprehensive one that covers every bit of detail for a beginner to learn the art of applying mehndi. From the basic floral, peacock and mango designs, to the most intricate checkered peacock design, this course covers them all. Learn the simple filler patterns and get familiar with the shaded Arabic designs with the help of this marvelous mehndi course.</p><p style=\"\">This course follows a method that keeps in mind the interests of its viewers. It teaches you not only how to apply novel designs but also covers areas like, how one can remove mehndi without any trouble and how to darken the mehndi color! This course helps its viewers in understanding how to apply a particular design by giving them stepwise instructions that cover each and every minute detail that helps in creating a perfect and exclusive mehndi design. We first start with mastering the designs on paper and then move to the application on hands and feet.</p><p style=\"\">All the mehndi addicts are sure to benefit from this course because it not only educates you with various forms of mehndi designs but also makes a novice master this art in 15 days!</p><p style=\"\">All the admirers of mehndi can enter the world of this beautiful art by enrolling yourselves for this course and understand the creativity and beauty of applying mehndi.</p>", 
    "end_date": null, 
    "title": "Mehndi 101 - How To Master The Art Of Mehndi In Just 4 Hours", 
    "price": "20.00", 
    "instructors": "Inc Nut", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569030_4919.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-mehendi-expert-in-15-days/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T08:40:47Z"
}