{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t        LATEST: Course Updated Again On 1st of June 2016</p>\n\n<p> <em><em><strong>OVER 1,178 SUCCESSFUL STUDENTS HAVE TAKEN THIS 5-STAR COURSE</strong></em></em> <br></p><p>  \t                 Learn how to:  </p>\n\n<ul>  \t<li>lose weight</li>  \t<li>put muscles on</li>  \t<li>get rid of acne</li>  \t<li>change eye color</li>  \t<li>get a tattoo</li>  </ul>\n\n<p>  \t                 … and more  </p>\n\n<p>  \t                 In only <em>5 minutes</em>  </p>\n\n<p>  \t                            using this practical Photoshop training!  </p>\n\n<p>  \t                 Last summer I went to Montenegro with one of my best friends.  </p>\n\n<p>  \t                 We had a lot of fun wakeboarding, swimming and taking a lot of pictures.  </p>\n\n<p>  \t                 When we got back home, I had 2032 photos on my camera - talk about narcissism!  </p>\n\n<p>  \t                 Like every other guy, I started posting some of them on Facebook. In my mind, I thought “Hey, it's my summer vacation! Of course I want to brag a little about it…\"  </p>\n\n<p>  \t                 5 minutes later, a friend called to tell me to take the pictures off because she hadn't had time to edit the ones in which she appeared.  </p>\n\n<p>  \t                 I most certainly didn't intend to offend anyone, so I complied with her demand. Come to think of it, it was a reasonable request. Who doesn't want to look good?  </p>\n\n<p>  \t                 Next thing, I sent her a total of 37 pictures I was intending to upload on Facebook. After she got them, she asked if I could wait until she had photoshopped the ones she was in. My instant reaction was: “Wait? I wonder how long…\"  </p>\n\n<p>  \t                 And I got the answer. 3 hours later, she sent them back, edited.  </p>\n\n<p>  \t                 I was thunderstruck!  </p>\n\n<p>  \t                 The wait was definitely worth it! She looked amazing! In all of them!!  </p>\n\n<p>  \t                 My friend is a pretty girl, for sure, but the editing made her look <em>great</em>!  </p>\n\n<p>  \t                 Next, I called her up to ask her how she did it…  </p>\n\n<p>  \t                 …  and she told me it only took her 5 minutes of editing in Photoshop.  </p>\n\n<p>  \t                 Wow!  </p>\n\n<p>  \t                 Not before long, I was telling all my friends about the editing girls do to make themselves look better on Facebook  </p>\n\n<p>  \t                  ... and found out some of the guys did it too (put some muscles on, get rid of some fat, etc).  </p>\n\n<p>  \t                 I was impressed that the guys knew how to use Photoshop to their advantage and at the same time, a bit jealous that I wasn't using the trick.  </p>\n\n<p>  \t                 + I also started noticing that people <em>actually</em> wanted to know how to use Photoshop to make them look better in photos and <em>were already asking around</em>!!  </p>\n\n<p>  \t                 And so, the penny dropped!  </p>\n\n<p>  \t                 I called my best friend, a graphic designer well known in my town and together, we created “The Everyday Guide to Photoshop\".  </p>\n\n<p>  \t                 In it you will find 20 videos on how to make yourself look better by using Photoshop!  </p>\n\n<p> </p><li>Want a tattoo? Why not get it digitally before you burn it forever onto your skin!</li> <li>Want a pump that lasts your whole workout? Create a “me with muscles\" picture to get you motivated to work those biceps!</li> <li> Want a motivational picture on your fridge? “How would I look 10 pounds thinner\" sounds about right </li> Do you want a hollywood style picture of yourself and your girlfriend walking hand in hand? Something only professional photographers seem to create? It only takes <em>5 minutes</em>! <br><p>  \t                 All the lessons in this course are PRACTICAL! In each of them you will get a “before\" and “after\" picture, you will be told when to zoom, when to drag and when to hold and you will also get an explanation for each step of the way.  </p>\n\n<p>  \t                 My name is Vaida Bogdan and I am the creator of The Secrets of Personality course. It's Udemy's top course with 5 star reviews and over 1.000 students.  </p>\n\n<p>  \t                 I'm a trainer and my goal with this course, The Everyday Guide to Photoshop is to teach you how to enhance your pictures beyond belief.  </p>\n\n<p>  \t                 By the end of this course you'll be able to edit pictures for you and for your friends .. and, why not, <em>make a living out of it</em>! 5$ for 5 minutes of editing sums up to 60$/hour job, right?  </p>\n\n<p>  \t                 Join this course now and get a digital tattoo today!  </p>", 
    "end_date": null, 
    "title": "PREPOSTEROUS: Down and dirty photoshop!", 
    "price": "20.00", 
    "instructors": "Bogdan Vaida", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/143260_a2cb_10.jpg", 
    "course_url": "https://www.udemy.com/the-everyday-guide-to-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-07T10:10:59Z"
}