{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \tThe <em style=\"\">Ultimate Creative Hair Design</em> course is designed to teach you how to become familiar with creating many different hair designs and to use your imagination and newly learnt skills to create some of the most jaw-dropping hair designs. The <em style=\"\">Ultimate Creative Hair Design</em> course will help you to gain confidence in satisfying your customers/clients. The course is designed for anyone who would like to advance their skills in becoming a more confident and creative hair stylist. It suits beginners all the way up to professionals. (Example: Hair Students, Apprentices, Make Up Artists, Qualified Hair Dressers).  </p>  <p>  \tThe course is structured in a very easy to follow criteria and teaches you the basics before moving on to more advanced techniques throughout the course.  </p>  <p>  \tThe course includes high quality easy to follow videos and worksheets that can be downloaded to assist with your learning. It is structured so that it starts with the basics and as you progress through the course, so does the difficulty of the lessons.</p><p><strong style=\"\">In The Ultimate Creative Hair Design course, you will learn:</strong></p><p>- Occupational Health &amp; Safety requirements and responsibilities.- Mixing &amp; Matching Hair Designs.- Knowing between Asymmetrical &amp; Symmetrical Hair Designs.- Using Accessories to Compliment Your Hair Design.- How To Section Hair &amp; Use Your Tools Correctly.- Handy Tool Techniques.- Many Different Styles of Braids.- How To Tease Hair.- How To Apply Hair Extensions.- Creating a Chignon Bun.- Creating a French Roll.- How To Do a Hair-up Using Multiple Hair Designs.</p><p>This course is guaranteed to make you a more confident and creative hair stylist.</p>", 
    "end_date": null, 
    "title": "The Ultimate Creative Hair Design Course", 
    "price": "20.00", 
    "instructors": "Katie Dobbin", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425770_c74d_2.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-creative-hair-design-course/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T09:00:31Z"
}