{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>In this course titled </strong></p>\n\n<p><strong>Weight Loss Program : Slim thinking permanent weight loss</strong></p>\n\n<p>Learn If you have been dieting with weight loss programs and never been able to maintain the weight loss and look you want , then this is the course for you because you will learn a technique that will help you to.</p>\n\n<p><strong>Eliminate chocolate cravings for speedy weight loss</strong></p>\n\n<p><strong>Eliminate other specific food cravings for speedy and permanent weight loss</strong></p>\n\n<p><strong>Eliminate comfort eating for permanent weight loss</strong></p>\n\n<p>To begin your permanent and easily manageable weight loss I will be teaching you a technique called EFT ( Emotional Freedom Technique) that I will be teaching you in a step by step videos that will help you to eliminate cravings for specific foods that usually sabotage any efforts to remove excess weight and improve results for permanent weight loss. </p>\n\n<p>I will be guiding you through each exercise to give you an easy to learn and use technique to begin making all the changes you desire. I will be teaching you how to eliminate chocolate cravings so that if you used to use chocolate as your drug of choice to feel good all that craving and calories will give you a speedy weight loss in less than ten minutes.</p>\n\n<p>To prove this is possible I have added a recording of my work live on radio in Ireland with a radio presenter Gerry Kelly helping him to eliminate his chocolate craving. </p>\n\n<p>I will also teaching you how to use EFT on any other cravings to reach your goal for permanent weight loss.</p>\n\n<p>I will then be teaching  you how to use the same technique for emotional triggers that have caused you to over eat and sabotaged previous attempts at weight loss that lasts. </p>\n\n<p>But before you start to make any of those changes I will be guiding you through an exercise that I will have you visualize  the way you want to look so that you know what you want from this course before you start to get that permanent weight loss so that after about 21 days you will have began to see positive changes in your body and life style and relationship to food only because you have fully engaged in this course.</p>\n\n<p>Because I have created this course to simulate the sessions that I have had with successful weight loss clients here in my therapy room in County Cavan Ireland.I will also be helping you to program a new way of thinking with your own private hypnosis sessions again simulated from work with my clients to reprogram your mind to be a slim thinking for permanent manageable weight loss.  </p>\n\n<p>Weight Loss Program : Slim thinking permanent weight loss</p>\n\n<p>What you will learn list </p>\n\n<ol>  \t<li><em><strong>All Videos are downloadable for easier access offline</strong></em></li>  \t<li><em><strong>Learn how to visualize how you want to look </strong></em></li>  \t<li><em><strong>Learn EFT  ( Emotional Freedom Technique )and how to apply it </strong></em></li>  \t<li><em><strong>Eliminate specific food cravings</strong></em></li>  \t<li><em><strong>Beat emotionally triggered eating</strong></em></li>  \t<li><em><strong>learn how to trigger a good feeling any time </strong></em></li>  \t<li><em><strong>Listen to three specially recorded hypnosis sessions </strong></em></li>  \t<li><strong><em>Review your progress with session debriefing </em></strong></li>  \t<li><strong><em>After 21 days notice the results you are having and know you will continue to have because you took this course. </em></strong></li>  </ol>", 
    "end_date": null, 
    "title": "Weight Loss Program : Slim thinking permanent weight loss", 
    "price": "25.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401608_df52_2.jpg", 
    "course_url": "https://www.udemy.com/secret-recipe-to-slim-thinking-and-permanent-weight-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T22:01:26Z"
}