{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t          Только сейчас у Вас есть возможность опробовать Авторский эксклюзивный рецепт – «Глянцевые Волосы Мгновенно!» из любого исходного состояния. Этот рецепт я раскрываю Впервые!  </p>  <p style=\"\">  \t    Благодаря этому курсу Вы сможете:  </p>  <p style=\"\">  \t    - получить Сияющий Глянцевый дорогой блеск на волосах за 3 минуты;  </p>  <p style=\"\">  \t    - избавитесь от ломкости и сечения волос;  </p>  <p style=\"\">  \t    - в 2 раза реже мыть голову и беречь, защищать волосы;  </p>  <p style=\"\">  \t    - наконец отрастите здоровые шикарные волосы;  </p>  <p style=\"\">  \t    - усвоите азы реальных факторов, влияющих на РОСКОШЬ Волос!  </p>  <p style=\"\">  \t          Не имеет значения, сколько Вам лет, Ваш уровень образования, какие методики, средства и специалистов Вы опробовали – простейшие рецепты этого курса, отточенные моим многолетним опытом, Гарантированно сразу же принесут Вам сияющие и радостные результаты на Ваших волосах!  </p>  <p style=\"\">  \t          Помните, что по многочисленным исследованиям Волосы и Причёска – это 50% Внешности и это Первое, на что обращают внимание, что Вас характеризует, по чём судят люди о Вас.  </p>  <p style=\"\">  \t          Для справки:  </p>  <p style=\"\">  \t          Повышение блеска волос даже на 17% сразу же говорит окружающим, что Вы Успешный, Счастливый и Здоровый Человек!  </p>  <p style=\"\">  \t          Таким образом, качественно улучшив и структурировав Ваши волосы (в этом курсе даны кратчайшие и скорейшие рецепты для этого) Вы усилите свой Магнетизм, и по-факту, по реакции окружающих на Вас увидите, что означает выражение и понятие: Сила Человека – в Волосах! (вспомните для примера легенды про Златовласку, Самсона и Далилу).  </p>  <p style=\"\">  \t          В более углубленных, продвинутых моих курсах я даю методики, которые благодаря Правильной структуризации волос Усиливают Ваши ФИНАНСОВЫЕ Потоки, Ваш Жизненный Комфорт, Личную Жизнь, Благополучие. Вы реально превратите Ваши Волосы в РОСКОШНЫЙ Магнит Успеха!  </p>  <p style=\"\">  \t          В этом же курсе я раскрываю ФУНДАМЕНТАЛЬНЫЕ Азы этого превращения, без которых все дальнейшие манипуляции наладить красоту волос, здоровье, финансы останутся бесполезными и беспочвенными (и то что Вы наблюдаете в Вашей жизни и жизни окружающих – тому подтверждение).  </p>  <p style=\"\">  \t          Поэтому Качественный Уход за Волосами – это Основы и Самый Лёгкий и Эффективный способ навести в Вашей Жизни долгожданные Богатство, Здоровье, Красоту и Порядок, а также это Самый доступный способ без долгих самовнушений ПОЛЮБИТЬ Себя.  </p>  <p style=\"\">  \t          Экспресс-курс «Глянцевые Волосы Мгновенно!», состоящий всего из 9 лекций видео и кратких конспектов (1 ч времени для изучения), подходит для КАЖДОГО, кто хочет жить Полноценной Жизнью и осознаёт всё вышеописанное.  </p>  <p style=\"\">  \t          Желаю Вам РОСКОШНЫХ Волос!!!  </p>  <h4 style=\"\"><br style=\"\">  <strong style=\"\"></strong></h4>", 
    "end_date": null, 
    "title": "Глянцевые Волосы Мгновенно!", 
    "price": "20.00", 
    "instructors": "Ekaterina Stankevich", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421414_05b7.jpg", 
    "course_url": "https://www.udemy.com/glancehair/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T21:35:45Z"
}