{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t    В этом <strong style=\"\">курсе профессионального макияжа</strong> для начинающих ты узнаешь все важные техники, после освоения которых ты сможешь без труда сделать красивый <strong style=\"\">профессиональный макияж</strong> как на себе, так и на любом другом человеке и подчеркнуть самые красивые черты лица, скрыть недочеты, а также выразить свой творческий потенциал.  </p>  <p style=\"\">  \t    Курс состоит из 8 разделов и 30 видео-уроков. Каждый из разделов курса построен так, чтобы освоение материала шло постепенно: вначале ты освоишь более легкие в исполнении техники, и после этого без труда сможешь освоить и более сложные техники макияжа.  </p>  <p style=\"\">  \t    Из этого курса ты узнаешь:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t    &gt; как выбрать профессиональные инструменты и косметику, как за ними правильно ухаживать и как ими правильно пользоваться;  \t</p>  \t<p style=\"\">  \t\t    &gt; основы теории цвета и цветовых сочетаний в макияже и как применить эти знания в работе с разными людьми;  \t</p>  \t<p style=\"\">  \t\t    &gt; как сделать кожу на вид безупречной при помощи разных по степени покрытия и стойкости средств;  \t</p>  \t<p style=\"\">  \t\t  &gt; техники моделирования и корректировки формы лица с помощью различных средств для достижения объемного результата в макияже и чтобы подчеркнуть структурность лица;  \t</p>  \t<p style=\"\">  \t\t    &gt; техники корректировки формы бровей и как подчеркнуть брови при помощи макияжа;  \t</p>  \t<p style=\"\">  \t\t    &gt; техники корректировки разных форм глаз и различные техники макияжа глаз, начиная от натуральных и более легких в выполнении, и заканчивая более сложными в выполнении техниками, которые используют многие профессиональные визажисты для создания модных и современных образов;  \t</p>  \t<p style=\"\">  \t\t    &gt; техники работы с разными по стойкости помадами, а также особенность работы как с натуральными, так и яркими оттенками помад.  \t</p>  </ul>  <p style=\"\">  \t    Первоначальное освоение материала займет около 10 часов. Но как и в любой прикладной профессии, в освоении техник макияжа важна практика. Выполнение всех техник, представленных в этом видео-курсе, хотя бы по одному разу займет около 20 часов. Хотя для полного их освоения желательно будет отработать все эти техники не менее 5 раз, таким образом практическая часть курса может занять до 100 часов.  </p>  <p style=\"\">  \t    К видео урокам также прилагается <strong style=\"\">рабочая тетрадь</strong> для удобства освоения материала, а также полный список косметики, которая может понадобиться как для выполнения всех техник макияжа, представленных в данном курсе, так и для начала <strong style=\"\">профессиональной деятельности</strong>.  </p>", 
    "end_date": null, 
    "title": "Макияж для начинающих: научись делать макияж профессионально", 
    "price": "50.00", 
    "instructors": "Lana Vallo", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404810_acd5_4.jpg", 
    "course_url": "https://www.udemy.com/lana-vallo-make-up-course-1-ru/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T22:45:19Z"
}