{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>＜本コースについて＞</p><p>「日本化粧品検定」代表理事の小西さやか自身の指導で、正しくコスメを理解するための基礎知識、「化粧品検定3級」対策について学べます。肌の悩みに対しての効果的な対処や最適な化粧品選びの基礎もわかるようになります。</p><p>まとめパックとなる本コースは、化粧品の基礎的な知識や選び方、効果的なメイクのテクニック、スキンケアについてや内面から美しくなるためのポイントなど、広範囲なテーマにも関わらず明確で分かりやすい講義が展開されます。検定対策だけでなく、実生活で生かせる“美容\"の知識がぎっしりと詰まった充実のコースです。</p><p>※全70回の講義全てを学習できるお得な「まとめパック」です。</p><p>※化粧品用語や解釈は2015年4月現在のもので、今後変わる可能性があります。</p><p>＜講師：小西さやか　略歴＞</p><p><strong><strong>一般社団法人 日本化粧品検定協会 代表理事。コスメコンシェルジュ第一号。</strong></strong></p><p>化学修士（サイエンティスト）としての科学的視点から美容、コスメを評価できるスペシャリスト。その知見から意味のない無駄なお手入れを省いた最短最適な美容法「なまけ美容」を推奨。</p><p>過去、毎週200種以上（累計10万種を越える）の化粧品を評価。その鋭い評価が好評で、各種の雑誌やメディアで新作コスメの評価を担当。毎月5～10誌で美容コーナーを担当。雑誌美的、MAQUIA、CanCam、anan、minaなどでベストコスメ選定を担当。</p><p>現在は、あらゆる美容知識の集約・蓄積及び美容術の振興に寄与することを目的とし、一般社団法人日本化粧品検定協会を設立。代表理事として、協会運営を行っている。その他、化粧品コンサルティング、美容コラムの執筆、大学での講義や日本流行色の選定、メイクアップトレンドカラー本の監修、日本美容食協会 理事や韓国コスメのナビゲーターなど幅広く活躍。</p><p><strong>【経歴・資格】</strong></p><p>・国連機関勤務 国連大学 補助研究員・国立大学工学部化学科 修士号・化粧品製造販売責任者 取得・コスメ薬事法管理者 取得・工業高校化学科教員免許 取得・k-two メイクアップアーティストプロフェッショナル資格 取得・ジャパンコスメティックアカデミー認定 化粧品プランナー資格・ジャパンコスメティックアカデミー認定 化粧品マーケティングプランナー資格・日本化粧品検定1級・日本化粧品検定協会認定 コスメコンシェルジュ資格・日本化粧品検定協会認定 コスメコンシェルジュインストラクター資格・健康入浴指導士検定協会公式 健康入浴指導士資格・日本ライター検定公式 BWS認定ベーシックコース 修了認定・日本ライター検定公式 日本ライター検定2級 ・タイ古式マッサージ 取得（ワットポーマッサージスクール＠タイ）・中国式足ツボマッサージ 取得（ワットポーマッサージスクール＠タイ）・ ロミロミコース 取得（ヒーリングアカデミー＠ハワイ）・ベビーマッサージ初級 取得・TOEIC740点・普通自動車免許・アロマテラピー検定1級。</p>", 
    "end_date": null, 
    "title": "小西さやかの「日本化粧品検定3級」対策講座（まとめパック）", 
    "price": "25.00", 
    "instructors": "Benesse Corporation", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477090_d97b_2.jpg", 
    "course_url": "https://www.udemy.com/bc15_beauty_konishi_001/", 
    "currency": "USD", 
    "subject_name": [
        "Beauty & Makeup"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T13:26:41Z"
}