{
    "selfpaced": true, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    This is a preview – a glimpse – into Collaborative Knowledge Services, a critical component of the knowledge disciplines. Why a preview into knowledge services? As we learn from Ed Hoffman, PhD, a long-time IKNS instructor, and Chief Knowledge Officer for NASA, knowledge services are how we, as leaders, help organizations and networks share and produce knowledge to achieve performance and impact. Whycollaborative knowledge services? Knowledge services cannot be technology, data or content alone. It’s about humans coming together. No one person, no one organization, no one institution, no one nation can know it all. In the end, it's all about how we come together. We contend that convening collaboration is the single most important leadership skill of our time. With this preview, we invite you into the “community of conveners.”\r\nOBJECTIVES\r\nCourse participants will learn about:\r\n\r\nBusiness goals for knowledge services\r\nDifference between information management and collaboration, as ways of classifying two types of knowledge services.\r\nCollaborative knowledge services 1: How “lessons learned” are part of a class of knowledge elicitation approaches, and how knowledge practitioners design those elicitation approaches.\r\nCollaborative knowledge services 2: How “communities of practice” require design, and what factors should go into designing communities of practice.\r\nCollaborative knowledge services 3: How “storytelling” is a unique approach to activating tacit knowledge, and how to structure and orient stories.\r\n\n\n                                    ", 
    "end_date": null, 
    "title": "A Preview Course on Collaborative Knowledge Services", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Columbia University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "http://www.canvas.net/browse/columbiau/courses/collaborative-knowledge-services", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2016-04-02T00:00:00Z"
}