{
    "selfpaced": false, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    \r\nAcumen  and  The Ariel Group  have developed this workshop to help you develop your skills for storytelling. Whether you work in an office doing presentations in the boardroom, is professor of 30 or 300 students, interact with customers, or relating to people individually, using narrative elements will allow you to establish a closer relationship with his listeners. Storytelling makes your message memorable, the listeners will find a way to relate to you and, most importantly, attract the attention of his listeners, motivate and inspire in ways unprecedented. A story leverages more than an element of communication. Seasoned storytellers are great communicators and effective leaders.\r\n \r\nAcumen believes that the narrative is essential to change the way poverty in the world begins to change combat because conversations about what we see, feel, and know to be true in our environment tool. Change leaders recognize the potential in the world and have powerful stories that inspire action.\r\n \r\nKey Outcomes of Learning:\r\nAfter completing this course you:\r\n\r\nYou'll feel safe when using stories, especially personal stories, as part of its communication tools box.\r\nKnow how to tell stories and use a specific set of narratives to connect with ears and minds of his listeners skills.\r\nThere will be developed, tested and received feedback to a personal story that will serve as a replicable model so that you can develop your \"library\" personal or stories to keep on hand to use on various situations\r\nIt will be able to use a process that involves five steps to integrate history presentations aimed to change, to work or a variety of circumstances\r\n\r\n \r\nFurther questions?\r\nFor more information please visit our website: + Acumen . We invite participants to form groups to work together. For a group, please send this link to your friends or colleagues to join.\r\nhttps://novoed.com/storytelling-change-spring-2015-es/\r\n \r\nIf you have a group, no problem. Within the platform will be an option to form a group. Or they could also participate individually and interact with others on the course forum.\r\nPlease send any questions to  courses@plusacumen.org\r\nThis course is for you if:\r\n\r\nYou make many presentations or want to improve your presentation skills\r\nYou are a teacher, facilitator or instructor\r\nThink you do not have stories (Well, we'll find it for you!)\r\nWant a different way to connect with people (great for networking!)\r\nHe is attending interviews to find jobs and want to present yourself in a shocking way\r\nWant to change your communication style\r\nJust want to have fun!\r\n\r\n \r\nAbout Courses + Acumen:\r\nAcumen  is a nonprofit organization that changes the way in which the world fight poverty and build a world based on dignity, investing in companies, leaders and ideas. Furthermore  + Acumen  (\"Acumen plus\") was established in 2009 to provide people an interesting way to incorporate wit - \"+ Acumen\" - in their lives. + Acumen makes available all the work that has developed in the field of leadership. In Acumen, Leadership begins with the moral imagination: the humility to see the world as it is and audacity to imagine as it could be. In combination with the operational and financial skills, our courses are designed to provide emerging leaders who are change agents, tools to change the way the world fights poverty and build a world based on dignity. We invite you to learn here other  courses + Acumen . You can contact us through courses@plusacumen.org \r\n \r\nLeadership Model\r\n\r\n \r\n\r\n\r\n \n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "Contar Historias para el Cambio", 
    "price": 0, 
    "instructors": "Richard Richards", 
    "institution_name": [
        "+Acumen"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://novoed.com/storytelling-change-2016-1-es", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2016-06-21T00:00:00Z"
}