{
    "selfpaced": false, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    In \"Engaging in Persuasive and Credible Communication\", you will learn the key skill of persuasion, in the context of professional communication in a globalised world. \n\nPersuasive communication is essential to any professional workplace. From a simple email request for your colleague to help you, to developing a presentation for the board of directors, these are acts of communication that require a good degree of persuasion. Even the process of entering the workforce requires effective persuasive communication, for in the act of writing your resume, cover-letter, or in the interview process, you are essentially persuading the potential employer to hire you.\n\nBy the end of this course, you will be able to structure and express your ideas in a convincing and persuasive manner in writing, apply basic principles of persuasive writing to convince different sets of audiences at the globalised workplace, and learn to engage in persuasive and credible communication across different cultures in a complex globalised environment.\n\n                                            Syllabus\n                        Persuasive and Credible Communication: An OverviewIn the first part, we will analyse and discuss theoretical concepts of both persuasion and credibility. Principles of Persuasive WritingIn the second part, we will establish some basic rules of effective writing and examine how writing can be made more persuasive.Persuasive Writing in a Globalised WorldIn the last part of the course, we will situate persuasive and credible writing in the larger context of a globalised world. We will tackle issues such as persuasion and credibility across cultures. \n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Engaging in Persuasive and Credible Communication", 
    "price": 0, 
    "instructors": "Derrick Ng", 
    "institution_name": [
        "National University of Singapore"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/persuasive-communication", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}