{
    "selfpaced": false, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    \r\n\r\n\r\nCome riconoscere un conflitto? Come gestirlo al meglio? Che ruolo ha la tua personalità? In questo corso potrai trovare alcune risposte a questi interrogativi.\r\n\r\n\r\nIn qualsiasi contesto sociale, i conflitti, oltre ad essere inevitabili, sono anche indispensabili per cogliere le potenzialità della diversità e per crescere come persona. Imparare ad affrontarli in modo costruttivo è fondamentale. Nella realtà però connotiamo la parola ‘conflitto’ negativamente e spesso ciò ci fa reagire in modo disfunzionale.\r\nNel privato spesso ci viene più facile esprimere il nostro dissenso in una discussione o parlare dei nostri bisogni e sentimenti feriti. Però più ci sentiamo intimi con la controparte (ad es. partner, familiare o amico), più abbiamo la sensazione che lui/lei potrà capire, e perdonare, se ci lasciamo andare emotivamente.\r\nNel mondo professionale quando ci troviamo in mezzo ad un conflitto ci sentiamo più frenati ad esprimere i nostri bisogni o sentimentiapertamente, siamo più inclini a nascondere le difficoltà, finché il conflitto esplode in modo del tutto inaspettato per la controparte. Avere completo controllo emotivo spesso viene visto come un approccio professionale ideale;‘controllo emotivo’ però non deve implicare una negazione del mondo emotivo.\r\nI conflitti nel mondo privato e nel mondo professionale hanno le stesse caratteristiche generali. Ciò che cambia è la nostra modalità nell'affrontarli, in funzione del contesto, delle situazioni e degli interlocutori.\r\nInformazioni sul corso:\r\n\r\nIl corso è strutturato in 5 week, suddivise in moduli.\r\nI moduli hanno al loro interno diverse lezioni, composte da parti testuali, video, quiz ed esercitazioni individuali di autoriflessione.\r\nPotrai metterti in gioco affrontando i Role Play, che ti permetteranno di sperimentare diverse reazioni ad alcune situazioni conflittuali esemplificative.\r\nTi suggeriamo di seguire il percorso in modo lineare ma sei libero di spostarti liberamente nei contenuti, se lo ritieni più utile ai fini del tuo percorso di apprendimento.\r\nÈ importante che rispetti il tuo ritmo: le indicazioni di durata sono una valutazione di massima ma il tuo ritmo guiderà nel modo migliore i tempi di fruizione e di riflessione individuale sulle tematiche proposte lungo il percorso.\r\nTi offriamo alcune risorse aggiuntive, raccolte negli approfondimenti, in modo che tu possa scendere ad un livello di dettaglio maggiore rispetto ad alcuni argomenti di tuo interesse e/o affrontare dei test specifici che possono darti qualche ulteriore indicazione rispetto al tuo atteggiamento.\r\n\r\nPRE-REQUISITI\r\nNon vi sono prerequisiti per affrontare questo corso, ma tutte le tue esperienze personali relative alla gestione del conflitto possono essere un utile punto di partenza.\r\nVALUTAZIONE\r\nIl corso presenta diverse domande in itinere, alcune sotto forma di quiz, altre proposte unicamente per stimolare la tua riflessione personale. Queste domande non verranno valutate ai fini del superamento del corso. Verrà invece valutato il quiz che troverai al termine di ogni week. Il punteggio assegnato al quiz è pari ad un punto per ciascuna domanda. È possibile ritentare il quiz fino ad un massimo di tre volte. Ricorda che il sistema registrerà l’ultimo punteggio ottenuto, non il migliore tra i tuoi tentativi. Il corso si considera completato in modo adeguato se il partecipante risponde correttamente al 60% delle domande presenti in totale. Il punteggio totale del corso verrà calcolato facendo la media dei punteggi dei quiz relativi alle singole week. Al termine del corso, se avrai superato il punteggio richiesto, potrai scaricare e stampare l'attestato di partecipazione. Nel tuo diploma supplement verrà inoltre inserito un record specifico rispetto alla frequentazione e all'esito di questo corso.\r\n\r\n\r\n\n\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "GestConf101 - Gestire il conflitto", 
    "price": 0, 
    "instructors": "Jelle Zeilstra", 
    "institution_name": [
        "Politecnico di Milano"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.pok.polimi.it/courses/course-v1:Polimi+GestConf101+2016_M6/about", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Polimi OPEN KNOWLEDGE"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}