{
    "selfpaced": false, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    En este curso los participantes lograrán identificar y tomar decisiones sobre casos clínicos con conflictos éticos en el área de la salud por medio de la aplicación del razonamiento ético desde una perspectiva universal y considerando los aspectos médicos y éticos, el marco jurídico y la decisión ética. \n\nLa ética en lo general es un elemento esencial para el avance del ser humano porque resulta de la capacidad de cuestionar, reflexionar y razonar sobre todo lo que es y todo lo que cambia en la vida. Existe evidencia de que la percepción y los juicios, que sobre la moral hace un individuo, definen su comportamiento. Estas capacidades que se desarrollan en forma paulatina, permiten atender y resolver los conflictos éticos.\n\nPara facilitar tus logros tendrás disponibles videos y evaluaciones.\n\n                                            Syllabus\n                        El contexto de la ética médica ¡Bienvenidos a la primera semana del curso \"La Solución del Conflicto Ético\"! En este módulo podrás identificar qué ha cambiado en nuestro contexto y cómo esos cambios han influído en la ética médica. A partir de esto  lograrás relacionar esos cambios con los ámbitos de la medicina que se han visto modificados y cómo todo esto promueve que se presenten nuevos conflictos éticos. Para facilitar tus logros tendrás disponibles videos, lecturas, guías de lectura, síntesis y evaluaciones. Los conceptos básicos de la ética¡Hola! Bienvenido al curso \"La Solución del Conflicto Ético\" en su segunda semana. Este módulo te permitirá diferenciar claramente entre los conceptos de moral, ética, bioética, ética médica, deontología y ley. Además podrás diferenciar un conflicto ético en medicina de otros problemas éticos. Para ello, contarás con material en video, de lectura y evaluaciones.El razonamiento éticoEstamos en la tercera semana de \"La Solución del Conflicto Ético\". ¿Listo? En este módulo vas a conocer las características tanto del razonamiento como de la reflexión. Lo anterior será útil para que logres aplicarlo en la identificación y solución de conflictos éticos. El módulo contiene material en video, de lectura y evaluaciones.Los aspectos médicos del conflicto ético¡Hola! Esta es la cuarta semana de \"La Solución del Conflicto Ético\". En este módulo podrás aplicar tu conocimiento y experiencia previos en la medicina para identificar un conflicto ético. Contarás con material en video, de lectura, guías de lectura, síntesis y evaluaciones.Los aspectos éticos del conflicto ético¿Estás listo para este módulo de \"La Solución del Conflicto Ético\"? Esta semana está llena de retos para ti. Lograrás identificar cada uno de los elementos que conforman un conflicto ético. Además podrás explicar cómo se da la contraposición de valores, derechos, deberes y la obligación profesional en ejemplos de conflictos éticos. Tendrás material diverso a tu disposición como: video, lectura, guías de lectura, síntesis, evaluaciones y material complementario.El marco jurídico y el conflicto éticoHola, Es el sexto módulo del curso \"La Solución del Conflicto Ético\". ¿Te has preguntado que tiene que ver el marco jurídico con el conflicto ético? Pues preparate para identificar la importancia del marco jurídico de la atención de la salud y de la obligación profesional frente a un conflicto ético. El material que tendrás para tu apoyo cuenta con video  lectura, guías de lectura, síntesis y evaluaciones. En este módulo en particular será muy importante que investigues lo aplicable a tu país. La decisión ética fundamentadaHemos llegado a la séptima semana del curso \"La Solución del Conflicto Ético\". Éste módulo tratará sobre la decisión ética fundamentada como solución a un conflicto ético. Tu podrás ver como se aplica el razonamiento y la reflexión a conflictos éticos ejemplo para estructurar la decisión ética. Para apoyarte en tus logros contarás con material como video, lectura, guías de lectura, síntesis y evaluaciones. Tendrás la posibilidad de practicar en conflictos éitcos ejemplo aplicando una guía de cómo estructurar tu decisión ética.Mi proyecto: La solución de un conflicto ético.Bienvenido a la última semana del curso \"La Solución del Conflicto Ético\". Esta semana podrás mostrar tus logros al presentar la solución de un conflicto ético que incluya: 1) Una viñeta clínica, 2) La descripción del conflicto ético médico; 3) El proceso de análisis del conflicto ético que presentas. y 4) el enunciado de la decisión ética; el fundamento médico, el fundamento ético, la explicación del contexto administrativo que aplique, si fuese el caso, y la explicación del contexto jurídico que aplique. Para este trabajo podrás consultar el material de todo el curso además del material adicional  que consideres necesario.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "La Solución del Conflicto Ético", 
    "price": 0, 
    "instructors": "Dra. Irene Durante Montiel", 
    "institution_name": [
        "Universidad Nacional Autónoma de México"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/etica", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}