{
    "selfpaced": false, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    En este curso se analizará para su aplicación la ubicación y señalamiento de los obstáculos que se presentan durante el proceso de negociación. Es interesante observar que en este análisis no sólo se plantean los obstáculos, sino se hacen observaciones sobre las condiciones que se presentan para identificar el obstáculo con las habilidades y estrategias que se ofrecen para su manejo efectivo. La presentación de los nueve obstáculos que propone nuestro modelo de negociación se hace en forma de aparición secuencial, lo que permite la previsión necesaria para evitarlos. Finalmente incorporaremos un elemento nuevo al proceso de negociación, que es el factor del tiempo y del ritmo, para que cada una de las fases cumpla con un requerimiento de exactitud en su cumplimiento.\n\n                                            Syllabus\n                        Introducción a los obstáculos en las negociacionesEn este curso se analizará para su aplicación la ubicación y señalamiento de los obstáculos que se presentan durante el proceso de negociación. Es interesante observar que en este análisis, no sólo se plantean los obstáculos sino se hacen observaciones sobre las condiciones que se presentan para identificar el obstáculo con las habilidades y estrategias que se ofrecen para su manejo efectivo, la presentación de los nueve obstáculos que propone nuestro modelo de negociación se hace en forma de aparición secuencial, lo que permite la previsión necesaria para evitarlos. Finalmente incorporaremos un elemento nuevo al proceso de negociación que es el factor del tiempo y del ritmo para que cada una de las fases cumpla con un requerimiento de exactitud en su cumplimiento.  Las posiciones de los negociadoresEn este módulo analizaremos los tipos de negociadores, estos se denominan intranegociadores y negociadores. Los primeros, recogen necesidades e intereses en las áreas de la organización vinculadas a la negociación. Los segundos, reciben esta información y la traducen en prioridades y objetivos cuantificables para ser negociados por ellos. Así mismo hablaremos sobre las actitudes al negociar con su importancia y transcendencia. También analizaremos las metas, necesidades y problemas de las partes y la forma de desplejar un enfoque de berneficios mutuos. Como ustedes verán estos son elementos clave en las negociaciones y te generarán confianza y seguridad al negociar.Las fases y el tiempo de la negociación Aquí estudiaremos el tiempo y el ritmo de las negociaciones en cada una de las fases de las negociaciones para generar una guía práctica que dará efectividad en el proceso. Analizaremos las preguntas que descubren y promueven los intereses y deseos de la contraparte que crean un ambiente de negociación y que permiten realizar intercambios y propuestas. Analizaremos también como enfocar los intereses y no las posiciones y poder buscar opciones y beneficios cuyos CVB queden garantizados para el oponente por contar con normas y estándares de equidad y justicia. Con el estudio de estos elementos nos prepararemos para negociar con toda la consciencia de lo que sabemos y de la actitud que somos capaces de desarrollar para tener éxito.Obstáculos para la cooperación En este módulo analizaremos los nueve obstáculos más comunes que afectan no sólo la cooperación, sino los resultados mismos de las negociaciones. La forma de evitarlos se verá en cada caso, pero existen factores en los que nosotros mismos somos los causantes. En primer término se encuentra nuestra falta de conocimientos y de deseos de superación. En segundo lugar nos falta controlar nuestras emociones, y el control o la reacción sobre las conductas de los oponentes. La tercera razón de los obstáculos se encuentra en la falta de confianza en nosotros y en lo que sabemos. Pero encontrarás que sólo tú puedes decidir la actitud que deseas presentar ante situaciones y salir victorioso.   \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Los obstáculos y la conducción en las negociaciones", 
    "price": 0, 
    "instructors": "Fernando Guerra", 
    "institution_name": [
        "Universidad Nacional Autónoma de México"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/negociacion-proceso", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}