{
    "selfpaced": false, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    Todos nós negociamos diariamente. No nível pessoal, negociamos com amigos, família, proprietários do imóvel em que moramos, vendedores de carro, funcionários, entre outros. A negociação também é a chave para o sucesso nos negócios. Nenhuma empresa consegue sobreviver sem contratos lucrativos. Dentro de uma empresa, as habilidades de negociação podem levar a avanços na carreira.\n\nEste curso fornece uma introdução prática e holística às estratégias e habilidades que podem levar a negociações de sucesso na vida pessoal e nas transações de negócios. O curso cobre os quatro principais estágios da negociação: (1) planejamento, (2) negociação, (3) criação do contrato e (4) execução do contrato. \n\nCada estágio analisa as principais questões que você deverá estar preparado para responder em negociações futuras, como:  \n•\tQuais são os principais elementos em uma análise de negociação, incluindo o preço de reserva fixado, a meta de expansão, alternativas para o negócio em questão e a zona de acordo potencial?\n•\tQue diretrizes devem ser seguidas ao confrontar questões de ética?\n•\tQual é a sua fonte de poder nas negociações e como é possível aumentar o seu poder?\n•\tQuais ferramentas psicológicas podem ser usadas durante as negociações e quais armadilhas psicológicas devem ser evitadas?\n•\tQuais são as quatro principais questões de lei contratual que devem estar no checklist de negociação?\n•\tQuais conceitos e ferramentas podem ser usados ao resolver controvérsias?  \n\nDurante o curso, você assistirá a uma série de pequenos vídeos (que vão de 5 a 20 minutos) sobre cada estágio da negociação.  Os vídeos são interativos e incluem questões para testar o seu entendimento sobre estratégias e habilidades de negociação. O curso também inclui vídeos que dramatizam a arbitragem de uma controvérsia na área de construção e a mediação de uma controvérsia de software de robótica. \n\nDependendo do seu planejamento, pode assistir aos vídeos ao longo de algumas semanas ou pode assisti-los todos de uma vez.  Um aluno que assistiu a todos os vídeos de uma vez concluiu que \"É uma série tão boa quanto Breaking Bad\".\n\nApós assistir aos vídeos sobre os quatro principais estágios da negociação, você poderá participar de uma negociação individual que testará as suas qualificações como negociador.  Os vídeos finais do curso verificam a sua negociação e revisam os conceitos e as ferramentas tratados no curso.  Você também receberá feedback sobre o que faz de melhor como negociador e como pode melhorar.\n\nThis is a translated version. To join the original English version, please visit this page: https://www.coursera.org/learn/negotiation-skills\n\n                                            Syllabus\n                        Prepare-se: Planeje sua Estratégia de NegociaçãoEste Módulo começa com uma visão geral do curso. Ele então foca os primeiros passos do processo de negociação — planejando-se para uma negociação — e cobre (a) diferenças entre negociações baseadas em posição e baseadas em interesse, (b) diferenças entre negociações por resolução de conflitos e por elaboração de acordos, (c) como completar uma análise de negociação, (d) uso de árvores de decisão para determinar a sua MAANA, (e) negociações interculturais, (f) como resolver problemas éticos em negociações e (g) usando agentes nas negociações.Negocie: Use Táticas Chave para o SucessoOs vídeos do Módulo 2 totalizam mais ou menos noventa minutos e incluem dois tópicos especialmente importantes: (1) como usar poder durante as negociações e (2) ferramentas psicológicas que se pode usar durante as negociações. Essas ferramentas são também armadilhas que você quer evitar quando usadas pelo outro lado da negociação. Algumas dessas ferramentas são úteis além da negociação ao se fazer decisões de liderança e decisões financeiras. Ao assistir aos vídeos, por favor, tenha um papel e lápis à mão porque eu vou pedir para que você participe em vários experimentos que ilustram essas ferramentas.Feche: Crie um ContratoEstes vídeos focam o fechamento da sua negociação criando um contrato. Acordos de negócio tipicamente exigem duas negociações. A primeira negociação envolve chegar num acordo através do uso das estratégias discutidas nos Módulos 1 e 2. A segunda negociação envolve converter seu acordo num contrato vinculante. Este é o foco dos vídeos do Módulo 3. Às vezes você vai usar um advogado para criar o contrato e às vezes você mesmo vai ser seu próprio advogado. (Por exemplo, nos Estados Unidos, indivíduos normalmente assinam contratos para comprar imóveis — um comprometimento pessoal financeiro bastante grande — sem consultar um advogado.) Dependendo do tamanho e da complexidade do acordo, esta segunda negociação pode tomar mais tempo e ser mais complicada que a primeira. Estes vídeos vão permitir que você desenvolva uma lista prática de questões-chave de um contrato para verificar em negociações futuras. Os princípios legais são generalizações e pode haver variações em certos países. Os vídeos não devem ser encarados como sugestão legal.Execução e Avaliação: O Jogo FinalOs vídeos para o Módulo 4 focam a execução e avaliação do seu acordo. Se ambas as partes atuam como esperado, não há problema. Mas se elas falham em atuar, os processos de dispute resolution que cobrimos ao longo do Módulo 4 se tornam importantes — especialmente a mediação e arbitragem. Entender estes processos é importante por várias razões descritas nos vídeos. Por exemplo, quando os processos falham, você poderia incorrer em custos além daqueles sujeitos a pagar mediante decisão judicial. Os vídeos do Módulo 4 totalizam duas horas, incluindo dramatizações de uma arbitragem e uma mediação. Como um bônus adicional, a mediação dá um ótimo exemplo de uma negociação baseada em interesse durante a resolução de conflitos. Um desafio a vocês que são dos Estados Unidos: o vídeo é do Reino Unido, então você pode ter dificuldades para entender a linguagem.Pratique suas Habilidades de NegociaçãoDepois de completar os primeiros quatro Módulos, você vai ter uma oportunidade de testar suas habilidades de negociação fechando uma negociação chamada de \"A Casa em Elm Street\". Assista ao vídeo \"Exercício de Introdução à Negociação\". Aí então selecione um dos dois papéis — Pat ou Tracy. Atribua o outro papel a um amigo e não leia. Siga as instruções no início do seu papel. Quando você terminar com a sua negociação, assista aos vídeos. Eles irão avaliar a negociação e revisar os conceitos e ferramentas cobertos no curso. Você então receberá um feedback pessoal com o que você faz bem como negociador e o que você pode melhorar.Exame FinalO Exame Final concede uma oportunidade adicional de aprender sobre negociações ao testar seu entendimento de conceitos. O tempo estimado para se completar o exame é de 75 minutos. Você pode refazer o exame até que esteja confiante de que entendeu os conceitos.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Negociações de sucesso: estratégias e habilidades essenciais (em Português)", 
    "price": 0, 
    "instructors": "George Siedel", 
    "institution_name": [
        "University of Michigan"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/negociacao", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}