{
    "selfpaced": false, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, participants will learn to apply negotiation strategies to a wide range of situations in their professional and personal lives—for better results, improved relationships, and enhanced decision-making.\r\nNegotiation is a process through which two parties (or more) engage with one another, and attempt to influence each other, with an eye toward reaching an agreed-upon outcome. Negotiation can be a tool for conflict prevention and for conflict resolution, for sealing deals and for resolving disagreements.\r\nNegotiation is at the heart of many professional, organizational, and international interactions. However, negotiation processes are in no way limited to the boardroom or to meetings between diplomats or heads of state. Many of our day to day interactions—with friends, colleagues, and family—include elements that are essentially negotiation.\r\nSuccessful negotiation processes are at the core of our success and growth, but not all negotiation processes are successful, and parties to these processes wind up paying a price through missed opportunities, financial loss, and soured relationships.\r\nHow can we improve our negotiating abilities to set ourselves up for success, professionally and personally? A wide range of possibilities exists. Negotiation involves cognitive strategizing and planning, even as it incorporates the interpersonal and emotional aspects inherent to all human interactions. A great deal of multidisciplinary research has been conducted in this field, generating best practices we can apply to real-life situations. Furthermore, negotiation is far from being only a science—it is also an art, in which intuition and personal style play a major role; we can use our personal strengths to enhance our negotiation capacity. This mix of art and science, of mind and heart, makes negotiation a fascinating topic to explore and offers wide open areas for personal reflection, growth, and improvement.\r\nThe primary goal of this course is to help participants make good use of these opportunities for self-improvement and growth. The reading material and video lectures will provide the knowledge you need in order to consider different approaches to negotiation, to understand negotiation dynamics, and to analyze negotiation processes. Through course exercises and assignments, you will apply this knowledge to reflect upon your own habits as a negotiator, recognize areas of personal strength, and map out areas for improvement and growth.\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Negotiation: Navigating Professional and Personal Interactions", 
    "price": 0, 
    "instructors": "Noam Ebner", 
    "institution_name": [
        "Creighton University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.canvas.net/courses/negotiation-navigating-professional-and-personal-interactions", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2014-10-20T00:00:00Z"
}