{
    "selfpaced": true, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    Email is one of the most important means of communication of our time. However, can the technology in terms of safety much to be desired. As an email user can neither be sure that no one is reading the news, nor that they arrive at the receiver also unchanged. To appropriate security measures - the so-called end-to-end encryption and digital signatures - each user must take care of yourself.\r\nIn this workshop you will learn openhpi also through practical exercises, such as encrypted with the use of free tools and send digitally signed emails and receive.\r\nWe invite you  here  (link to video tutorial) obtain information on all the contents of the workshop.\r\nThis course is part of the  Safer Internet Day  instead. This is a global initiative of the European Commission about Internet security, where we with  teachers online  cooperate. In  www.lehrer-online.de  teachers find teaching materials and current information about safe Internet use in schools and other educational contexts.\r\nPress release on the course on the HPI press portal.\r\nThe students say about us:\r\nDieter K:  \"Thank you for the course - the fabric was treated well and had a lot of fun for me I will examine the subject in each case and apply of course I'm looking forward to the next course...\"\r\nClaus N.  \"I am thrilled with your online offer. After training opportunities such I have been looking for. Because of my project activities, the possibility of my being\" lessons \"freely divide simply excellent. Thank you to all those who make such a deal possible.\"\n\n                                    ", 
    "end_date": "2015-03-09T00:00:00Z", 
    "title": "Sichere Email", 
    "price": 0, 
    "instructors": "Prof. Dr. Christoph Meinel", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://open.hpi.de/courses/ws-email2015", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "openHPI"
    ], 
    "start_date": "2015-02-09T00:00:00Z"
}