{
    "selfpaced": false, 
    "topic_name": [
        "Communication Skills"
    ], 
    "description": "\n\n                    \n                    \n                    Want your workplace writing to make a positive impression? At the end of this course, you will be a more confident writer, able to create higher quality professional documents more quickly. \n\nThis course is at the introductory or beginner level and focuses on mastering the basics of email etiquette and communication.  While this course will help learners become faster and more efficient writers by virtue of practice with common writing purposes, it does not cover marketing emails or job application materials. \n\nIn this project-based learning course, you will work on a continuous project, the writing of a professional email/memo. At the end of the course,  you will write a clear and concise email/memo. The final product will be individualized to your professional endeavors and follow the guidelines for one of the common types of emails/memos explained in the course: directives, progress reports, incident reports, response to inquiries, and meeting minutes. You will gain a wealth of skills. You will learn about appropriate email/memo formats, common ways to organize email/memo contents, common email/memo routing protocols, and expectations upon writers in professional environments.\n\nThis course is designed to be beneficial to all levels of learners, whether you have never heard of an email/memo or write them every day. Everyone will learn something from this experience. In fact, different levels of learners are encouraged in this course so that we can all learn from each other. There will be thousands of learners working side-by-side on their projects, and the environment will be social, supportive, and constructive. \n\nBy the end of this course, learners will be able to:\n- write clear and concise emails/memos relative to their professional endeavors\n- recognize five different types of emails/memos and their formats\n- analyze email/memo context for audience and tone\n- use basic grammar correctly in their email/memo writing\n\nMaterials required:\nLearners in this course will need only a computer with strong enough Internet to play videos and hear sound. A word processing software is suggested, but not required. \n\nTime required:\nThis course will require approximately 4 hours of work in the platform, including videos, reading, quizzes, and other activities. \nThe course project will require approximately 6 hours of work, including the rough draft, draft peer review, final draft, and final peer review.\n\n                                            Syllabus\n                        Introduction to Professional Memos and EmailsWelcome to the course! We are excited to get to know you and start working with you to achieve your writing goals.  In this module you will learn about the history of memos and emails and be introduced to the final project options and rubric. Five Types of Emails/MemosIn this module you will learn about five different types of emails/memos and their formats. You will also practice evaluating bad emails/memos to get acquainted with the course rubric, and you will see examples of good emails/memos.Audience, Grammar, and Clarity, Oh My!This module will introduce the technical aspects of memo/email writing: grammar, audience, tone, formality, grammar, and clarity.Case Studies in Writing a MemoIn this module we will look at some case studies in memo writing. Turn in Your Final MemoIn this module you will turn in your final memo and conduct a peer review. It was great working and learning with you!\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Writing Professional Email and Memos (Project-Centered Course)", 
    "price": 0, 
    "instructors": "Tamara Michele Powell and Tiffani Kristine Reardon", 
    "institution_name": [
        "University System of Georgia"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/professional-emails", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}