{"selfpaced": false, "topic_name": ["Philosophy"], "description": "\n\n                    \n                    \n                    States are increasingly using remote control methods, such as drones, private military companies and special operations units, to engage in activities that were traditionally performed by their conventional armed forces.\n\nThe killing of Osama bin Laden in Pakistan by US Special Forces; the drone strike on Anwar al-Awlaki in Yemen; and the engagement of Academi (formerly Blackwater and Xe Services) in Iraq are just a few examples.\n\nUnderstand the philosophical, ethical and cultural impact\n\nThis free online course looks at the reasons for this trend, including technological innovation; security privatisation; risk aversion among politicians and the public; and the opportunity that remote methods provide to circumvent the law.\n\nOver six weeks, we’ll examine the philosophical, ethical and cultural challenges raised by remote control warfare, drawing on cases in Pakistan, Yemen, Libya and Iraq, and discuss how states like the UK, US and China oversee these methods.\n\nJoin the debate on remote control warfare\n\nWe’ll ask how our traditional understanding of war and security is changing, and how states in the future will ensure our security through non-traditional means. We’ll also look at the responsibilities states have for their own populations, as well as the wider international society.\n\nCrucially, we’ll examine how remote control warfare is seen by those at its receiving end. Join us, as we ask:\n\n\n  Does remote control warfare make states more prone to waging war?\n  Does this recent trend influence the way states’ security activities are policed?\n  Are drones an ignoble form of warfare, with a huge mismatch between the technological capabilities of each side?\n  Do private military companies allow states to undertake new, illegal and unethical activities?\n  Are special ops forces the optimum response to the public’s aversion to fear?\n\n\n\n                                    ", "end_date": "2016-03-21T00:00:00Z", "title": "From State Control to Remote Control: Warfare in the 21st Century", "price": 0, "instructors": "", "institution_name": ["University of Bath"], "commitment": "", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/remote-control-warfare?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-02-08T00:00:00Z"}