{"selfpaced": false, "topic_name": ["Philosophy"], "description": "\n\n                    \n                    \n                    The ancient philosopher Isocrates (436-338 BC) founded the first advanced school in Greek history, innovated creatively with new communication technology, and bequeathed a rich intellectual legacy that eventually served as the scaffolding for later efforts (in ancient Rome and modern Italy) to develop humanistic, liberal arts education. Though widely admired, Isocrates was criticized in his own time by Plato and later vilified by contemporary thinkers for advocating organized violence against non-Greek \"barbarians.\" This course provides a basic introduction to Isocrates as a key figure in intellectual history, explores his contributions to the rhetorical tradition, and considers his enduring salience for contemporary rhetorical theory and practice. Primary texts include Isocrates' rhetorical compositions such as Against the Sophists, Helen, On the Peace, Panegyricus, Panathenaicus, Nicocles, and To Philip, among others. Students will read assigned texts (open access versions available online), view video lessons taped by professors Gordon Mitchell, John Poulakos, and their graduate students, complete various evaluations tools, and even have opportunities to remotely join several in-class discussions at the University of Pittsburgh. A traditional, brick-and-mortar graduate seminar in rhetorical theory (focusing on Isocrates) will take place during Pitt's Fall 2013 Term and will run contemporaneously with the MOOC, enabling this exciting hybrid, MOOC-mortar interaction. To follow the graduate seminar blog: http://www.blogospolitikos.wordpress.com\n\n                                    ", "end_date": "2013-12-03T00:00:00Z", "title": "Isocrates", "price": 0, "instructors": "John Poulakos and Gordon Mitchell", "institution_name": ["University of Pittsburgh"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.coursesites.com/webapps/Bb-sites-course-creation-BBLEARN/courseHomepage.htmlx?course_id=_278442_1", "duration": "9 weeks", "language_name": ["English"], "provider_name": ["Open Education by Blackboard"], "start_date": "2013-10-01T00:00:00Z"}