{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong></strong> <strong>Overview:</strong> This Module 1 Course represents Day 1 of the <em>Rapid Delivery of Enterprise Architecture Workshop</em>. It introduces methods for transforming business plans into strategic data models – for delivery into production of priority, reusable, standardized processes comprising databases and systems: rapidly, in 3-month increments of increasing functionality. These reusable processes, when implemented, can save large organisations hundreds of millions of dollars in annual operating costs. <br></p><p>The <em>Rapid Delivery of Enterprise Architecture</em> <em>Workshop</em> comprises three Modules. Each Module is a separate Udemy Course. The training delivered in this workshop represents a full University year of training in the discipline of Enterprise Architecture. These Modules (Courses) correspond to days in the workshop (or University semesters) as follows:</p><ul><li>[Day 1] Module 1: Introduction to Enterprise Architecture for Managers &amp; IT (1 Semester)</li> <li>[Days 2 – 4] Module 2: Rapid Delivery Methods for Enterprise Architecture (2 Semesters)</li> <li>[Day 5] Module 3: Rapid Delivery Technologies for Enterprise Architecture (1 Semester)</li> <li><strong>NOTE</strong> – Module 3 has been renamed for UDEMY as the Course: <br> “<em>Web Services and Technologies\"</em></li></ul><p><strong>Audience:</strong> This Course (Module 1) is directed to an audience of: senior-level business managers (CEOs, COOs, CFOs); Government Program managers; middle-level business managers; operational business managers; business experts; IT experts (CIOs, IT managers, CTOs); systems analysts or developers.<br></p><p> <strong>Prerequisites: </strong>This Course (Module 1) is a prerequisite for Module 2 and Module 3 Courses. It does not require any prior knowledge of business planning or computers. <br></p>", 
    "end_date": null, 
    "title": "2) Module1: Enterprise Architecture for Managers and IT", 
    "price": "50.00", 
    "instructors": "Mr. Clive Finkelstein", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342428_7770_5.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-enterprise-architecture-for-managers-and-it/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T15:13:27Z"
}