{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to <strong class=\"redactor-inline-converted\">A+ Mobility with Portable Devices Fundamentals</strong> from LearnSmart.</p>\n\n<p>This course will help you validate you have mastered the technologies found in today’s extensive and varied IT environment to boost your career. This course series will also better qualify you for such jobs as <em>computer systems analyst</em> and <em>information security </em><em>specialist</em>.</p>\n\n\n\n<p>foundational knowledge of the principles, techniques, and tools needed to successfully prepare for<strong class=\"redactor-inline-converted\"> CompTIA's A+ 220-901 Essentials &amp; 220-902 Practical Application exams</strong>. </p>\n\n\n\n<p>This is 1 Course in our 6 Course <em>CompTIA A+ Series</em> including:</p>\n\n\n\n<ol><li>A+ PC Assembly Fundamentals</li><li>A+ PC Components Fundamentals </li><li>A+ Networking Fundamentals </li><li><strong>A+ Mobility with Portable Devices Fundamentals </strong></li><li>A+ Operating Systems Fundamentals </li><li>A+ Security and Operational Procedures Fundamentals</li></ol>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Overview:</strong></p>\n\n\n\n<p>This course is designed to prepare the student for the <em>CompTIA 220-901 &amp; 220-902</em>. Students will look into portable devices. Once in our course review our course map to see just how we align with CompTIA's A+ Certification in providing this training. Learn the main exam objectives by learning these key concepts we cover:</p>\n\n\n\n<ul><li>Laptop Setup and Troubleshooting</li><li>Laptop Features</li><li>Introduction to Mobile Devices</li><li>Mobile Operating SystemsTroubleshooting Mobile Devices</li></ul>\n\n<p>Our lectures are paired with a variety of demonstrations and quizzes giving visual example and real world look of the concepts that will be talked about.</p>\n\n\n\n<p>Our sections listed below are can be taken in any order, as a review of a particular concept or exam domain. However, if you are just becoming familiar with the portable devices and mobility it is recommended that you view the courses sequentially.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Breakdown:</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Section 1</strong>: Keep a laptop in tiptop shape through upgrades and replacing components that aren’t working properly along with knowing how to troubleshoot and fix common laptop symptoms.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Section 2</strong>: Utilize Windows, OS, and other operating systems shortcut keys to handle many features in a display unit with these add-on devices.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Section 3</strong>: Cover the different mobile devices available in the marketplace and the many features that can be utilized in daily life.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Section 4</strong>: There have been many operating systems that have come and gone, but only a few have survived the tests of time so learn the many aspects of mobile operating systems and networks.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Section 5</strong>: Focus on common mobile device problems and the symptoms that accompany those problems with basic maintenance and troubleshooting tools and techniques.</p>\n\n<p><strong class=\"redactor-inline-converted\">Recommendations:</strong></p>\n\n\n\n<p>Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p>\n\n\n\n<ul><li><em>Great Material - This course is a great reference and way to refresh your skills for the new A+ exam! I needed a good refresh before taking the exam and this course is clearly laid out and copiously covers the material for the exam. Great course, well worth the money! -- M.B.</em></li><li><em>Perfect Course - Not only do you get great lectures that are pretty much PowerPoints with an instructor teaching you the concepts, there are also Demo lectures that show you how each of the concepts works in real life. This is such valuable information to have when taking the test. I feel very confident that this course is the best course on Udemy. -- D.R. Jr.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul>", 
    "end_date": null, 
    "title": "A+ Mobility with Portable Devices Fundamentals", 
    "price": "50.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/865982_e69b.jpg", 
    "course_url": "https://www.udemy.com/it-portable-devices-comptia-a-plus-900/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T17:07:38Z"
}