{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Learn and Master to integrate, the most famous Social Networking plugins like Facebook, Google Plus, Twitter, and Digits into your Android Application.</p><p>In this course you will learn to integrate famous social networking login buttons into your Android Application to validate users login. If you are a Android Programmer or want to learn Android Programming with basic this course is for you, In this course you will start with the Android Overview and then move to learn to integrate Login Buttons of <strong>Facebook, Twitter, Digits and Google Plus.</strong> As a <strong><em>bonus chapters</em></strong> you will learn to generate crash report for your app by using <strong>Fabric crashlytics tool</strong>. you will also learn to convert your <strong>Wordpress blog into a full flash Android Application</strong>. You will end with Push Notification Service by Parse Push and learn to integrate Parse code in Android Application.</p><p>This course Include <strong>Video as well as reference material </strong>which guide you to learn advance concept of Android Programming.</p><p>In this approximately 10 days course you will start with basic and move to the Advance topic of Social Plugins Integration to Android Application.</p><p><strong><em>Anyone working in Android Programming can take this course to provide Authorization functionality with complete App analysis with Push notification.</em></strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Android Programming on Social Plugins", 
    "price": "20.00", 
    "instructors": "Girish Shakya", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686004_c37f.jpg", 
    "course_url": "https://www.udemy.com/android-programming-on-social-plugins/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-01T13:15:55Z"
}