{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Welcome to Appium Master classes!!!!</p><p>Appium is already started getting popular in the market for mobile automation testing.</p><p>The main reason why appium is popular in the market because it is an open source and free open discussion in communities to get quick solutions.</p><p>The highlight of Appium is that this supports both Web and mobile Platforms and works on both Android and IOS Platforms.</p><p>In present scenario Mobile market is growing / flourishing tremendously therefore there is a lot of demand for quality mobile application testers across the world.</p><p>So bringing a New Course \" APPIUM- Mobile Automation testing\" which is the most popular mobile application testing tool in the Current Market.</p><p>This course is specially designed for all those students, who wants to start testing carrier from scratch.</p><p>I always provide real time examples to get proper understanding of automation steps.</p><p>Unique features which makes this course different from other courses available in the market :-</p><p><strong>- Video recording of your test.- Capture the screen shot when test fails.- Best possible ways to do mobile screen mirror to laptop.- Run your test on multiple devices (Mobile) using selenium grid which support by appium.- For most of the sections, </strong>will provide text documents for off-line reading<strong>. - Install and test IOS application on windows using VM Ware.(You can save around 2000$, No need to buy Mac/Apple for mobile testing )</strong></p>", 
    "end_date": null, 
    "title": "Appium Master Classes (Selenium 3.0)", 
    "price": "30.00", 
    "instructors": "Srikanth Katakam", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/397418_36ce_3.jpg", 
    "course_url": "https://www.udemy.com/appium-master-classes/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T18:15:51Z"
}