{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>The Microsoft Dynamics NAV 2015 Application Setup training examines the basic concepts of Enterprise Resource Planning (ERP), how to Configure and setup the Application from the beginning to the end</p>  <ul><li>» Explain the dependencies between RapidStart Services and manual setup work.</li><li>» Describe the different components and processes of RapidStart Services.</li><li>» Explain and demonstrate all tasks in a RapidStart Services process.</li><li>» Create a configuration worksheet.</li><li>» Create a configuration package.</li><li>» Create a configuration questionnaire.</li><li>» Create a configuration template.</li><li>» Initialize a new company with a configuration package.</li><li>» Migrate customer data.</li><li>» Transfer opening balances</li><li>» Set up a new user.</li><li>» Explain the concepts of permission sets and permissions.</li><li>» Create a new permission set, and assign permissions to it.</li><li>» Perform user-specific setup.</li><li>» Create, assign, and work with user profiles.</li><li>» Explain the purpose of company-wide number series.</li><li>» Set up number series.</li><li>» Create number series relations.</li><li>» Explain and set up trail codes, source codes, and reason codes.</li><li>» Explain the purpose and organization of journal templates and journal batches.</li><li>» Create general journal templates and general journal batches.</li><li>» Explain and set up specific posting groups.</li><li>» Explain and set up general posting groups.</li><li>» Create a General posting setup.</li><li>» Create an Inventory posting setup.</li><li>» Explain and set up VAT posting groups.</li><li>» Create a VAT posting setup.</li><li>» Describe posting setups based on the chart of accounts.</li><li>» Demonstrate how posting groups direct a sales transaction.</li><li>» Explain and set up dimensions and dimension values.</li><li>» Explain and set up global and shortcut dimensions.</li><li>» Explain and show how single and multiple default dimensions are set up.</li><li>» Explain and show how default dimension priorities are set up.</li><li>» Show how to use dimension and dimension values in journals and documents under different dimension setup scenarios.</li><li>» Set up the general features of the document approval system.</li><li>» Set up approval templates.</li><li>» Set up user logons for use with document approvals.</li><li>» Set up approval users in a hierarchy.</li><li>» Set up the notification system for approvals.</li><li>» Send an approval request.</li><li>» Approve a sales or purchase document.</li><li>» Maintain substitute approvers.<br><br>The training is designed for individuals who plan to use core setup and finance features in Microsoft Dynamics NAV 2015. They typically are sales consultants, implementation consultants, and Microsoft Dynamics NAV 2015 users who are in the finance, Sales, Manufacturing and other industries. Candidates should have a basic knowledge of how to use computer, the course does not expect the user to have basic knowledge of how to configure NAV, it simulate a company from the start of the implementation stage to the end of the implementation stage<br><br></li></ul><p>Demand for Dynamics NAV Implementer who know how to configure Dynamics NAV is at an all time high, with  rates around $50 - $100 an hour and UK rates around £40- £100 an hour.<br></p><p>So start your journey to becoming an NAV expert!<br></p>", 
    "end_date": null, 
    "title": "Application Setup in Microsoft Dynamics NAV 2015", 
    "price": "20.00", 
    "instructors": "Opeyemi Olorunfemi", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485432_7851_2.jpg", 
    "course_url": "https://www.udemy.com/application-setup-in-microsoft-dynamics-nav-2015/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T17:40:26Z"
}