{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>As certificações da Amazon Web Services (AWS) estão rapidamente se tornando essenciais para qualquer profissional de TI trabalhando com a AWS. Este curso é projetado para lhe ajudar a passar no exame da certificação AWS Developer Associate (CDA) 2016. Mesmo que você nunca tenha logado na plataforma da AWS antes, ao final dos nossos vídeos de treinamento você estará apto a fazer o exame. Não é preciso saber nenhuma linguagem de programação em específico, saber uma irá lha trazer uma vantagem e não é preciso nenhuma experiência prévia com AWS. Com a certificação em suas mãos, você estará em alta demanda por muitos empregadores e irá lhe ajudar em um salário superior.</p><p>Preste atenção, este não é um curso para lhe ensiar como programar. Este curso é especificamente projetado para ajudar você a passar no exame AWS Certified Developer Associate. Todos os códigos requeridos para fazer os exercícios neste curso estão disponíveis no github.</p><p>A AWS está constantemente evoluíndo sua plataforma, em 2015 foram lançados mais de 600 novos produtos e funcionalidades. Enquanto 2016 prossegue, nós iremos continuamente atualizar este curso com novos conteúdos, então você não precisa ficar preocupado sobre perder ou falhar no teste por causa de conteúdo desatualizado. </p><p>A maioria das aulas são de 5-15 minutos, com quase nenhuma chegando perto de 20 minutos em duração. Eu sou um Arquiteto de Soluções certificado AWS, vivendo em Porto Alegre com cerca de 17 anos de experiência em TI. Eu tenho experiência em desenvolver em Python, Nodejs. Este curso é mais barato que a maioria, pois eu não faço ele no meu tempo regular de trbalho, e também porque eu adoro ensinar nuvem. Então junte-se a mim hoje em se tornar um Cloud Ninja e obter sua certificação AWS Developer Associate 2016 completando o curso online!</p>", 
    "end_date": null, 
    "title": "AWS - Curso Preparatório para Certificação Developer ", 
    "price": "50.00", 
    "instructors": "Arquiteto de Soluções Jonathan Dias Baraldi", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743688_299a_4.jpg", 
    "course_url": "https://www.udemy.com/curso-preparatorio-para-certificacao-aws-developer-associate/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T15:54:23Z"
}