{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Are you looking for AWS Training? </p><p>Amazon Web Services (AWS) Certification is fast becoming the must have certificates for any IT professional working with AWS. This course is designed to help you pass the AWS Certified Solutions Architect (CSA) - Associate Exam. Even if you have never logged in to the AWS platform before, by the end of our AWS training you will be able to take the CSA exam. No programming knowledge needed and no prior AWS experience required. With this AWS certification under your belt (and optionally after completing our AWS Certified Developer 2016 - also available on Udemy), you will be in high demand by many employers and you can command a superior salary.  </p>  <p>  \t                      In this course we will start with a broad overview of the AWS platform and then deep dive into the individual elements of the AWS platform. You will explore Route53, EC2, S3, Cloud Front, Autoscaling, Load Balancing, RDS, RedShift, DynamoDB, EMR, VPC etc.</p>  <p>  \tRead the fantastic reviews of our course!  </p>  <p>  \t    Alex describes this course as <strong><em>\"The best course out there</em></strong><strong><em>\"</em></strong>  </p>  <p>  \t    Steve says the course was <strong><em>\"A</em></strong><strong><em> God send\"</em></strong>  </p>  <p>  \t    And Adam says <strong><em>\"You must take this course if you're taking the exam\"</em></strong>  </p>  <p>  \t                      AWS are constantly evolving their platform, in 2015 there have been over 700 new product releases. As 2016 progresses we will continuously update this course with new content so you will never have to worry about missing out or failing the AWS certification test because of new content. This is the best online AWS training available, at a great affordable rate.</p>  <p>  \t            Most lectures are 5 - 12 minutes long, with almost no lecture being over 20 minutes in length. I am an AWS Certified Solutions Architect, Developer and Systems Administrator living in London with over 17 years experience in IT. This course is cheaper than most other courses because I am not doing this as a full time job, rather because I love teaching cloud. So join me in becoming A Cloud Guru today and get your AWS Solutions Architect Associate qualification by completing our AWS online course today!  </p>", 
    "end_date": null, 
    "title": "AWS Certified Solutions Architect - Associate 2016", 
    "price": "40.00", 
    "instructors": "Ryan Kroonenburg", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362328_91f3_10.jpg", 
    "course_url": "https://www.udemy.com/aws-certified-solutions-architect-associate/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T15:19:44Z"
}