{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t                Amazon Web Services - (AWS) Certification is fast becoming the must have certificate for any IT professional working with AWS. This course is designed to help you pass the AWS Certified Developer Associate (CDA) 2016 Exam. Even if you have never logged in to the AWS platform before, by the end of our AWS training videos you will be able to take the CDA exam. No specific programming knowledge is needed (though knowing a language would be advantageous) and no prior AWS experience required. With AWS certification under your belt (and optionally after completing our AWS Certified Solutions Architect course - also available on Udemy), you will be in high demand by many employers and will command a superior salary.  </p>\n\n<p>  \t        Please note, <strong>this is not a course to teach you how to code</strong>, this course is specifically designed on helping you to <strong>pass the AWS Certified Developer exam</strong>. All required code to do the exercises in this course is provided when you join the course (via Github).</p>\n\n<p>  \t                AWS are constantly evolving their platform, in 2014 there have been over 500 new product releases. As 2016 progresses we will continuously update this course with new content so you will never have to worry about missing out or failing the AWS certification test because of new content.  </p>\n\n<p>  \t                Most lectures are 5 - 15 minutes long, with almost no lecture being over 20 minutes in length. I am an AWS Certified Solutions Architect and Certified Developer, living in London with over 17 years experience in IT. I have experience in developing in PHP, Python and Xcode. This course is cheaper than most other courses because I am not doing this as a full time job, rather because I love teaching cloud. So join me in becoming A Cloud Guru today and get your AWS Certified Developer Associate 2016 qualification by completing our AWS online course today!  </p>", 
    "end_date": null, 
    "title": "AWS Certified Developer - Associate 2016", 
    "price": "35.00", 
    "instructors": "Ryan Kroonenburg", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393306_f2a5_6.jpg", 
    "course_url": "https://www.udemy.com/aws-certified-developer-associate/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T19:36:13Z"
}