{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>The cloud is slowly becoming an important piece of technology in today’s world. In addition to being a great data storage system, it is also becoming the standard for creating manageable and scalable web application services, all the while offering a wide range of hosting capabilities.</p>\n\n<p>Amazon is currently on top of the game in web application services with its Amazon Web Services (popularly known as AWS). With so many companies shifting their servers to the cloud, making it easier to save data and even access it, it is no wonder that they are looking for AWS specialists. </p>\n\n\n\n<p>This has resulted in a lot of companies demanding technicians that are experts in cloud computing and cloud system architecture. Technicians that hold the Amazon’s AWS Certification Exams are considered as specialists in the cloud computing field. Do you want a significant boost in your career and even your salary package? Well then let’s get ready for the AWS Solutions Architect – Associate Certification Exam. </p>\n\n\n\n<p>This AWS Solutions Architect – Associate Training and Certification Course is geared to helping you successfully pass your certification exam to become a certified Solutions Architect.</p>\n\n\n\n<p>This panoptic course covers everything that will be a part of the exam, including detailed descriptions on EC2 Instances, S3 Bucket and various Amazon’s Databases such as RDS, DynamoDB, Elasticache, Redshift and DMS. You will learn everything that is included in the exam paradigm including how to design a highly available and fault tolerant system, lifting and shifting an existing system to AWS, selecting the appropriate AWS service based on select requirements, identifying the appropriate use of AWS architectural, estimating costs and identifying mechanisms to control costs and etc.</p>\n\n\n\n<p>It will also cover extensively the important EC2 Dashboard and other related technologies including AMI (Amazon’s Machine Images) images, Security Groups and even Auto Scaling Groups. </p>\n\n\n\n<p>This course is the perfect stepping stone on your journey to getting your AWS Solutions Architect – Associate Certificate.</p>\n\n\n\n<p>So, what’s stopping you from increasing your skills and your salary? Let’s get high on cloud computing.</p>", 
    "end_date": null, 
    "title": "Become An AWS  Certified Solutions Architect - Associate", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/843622_5dea_2.jpg", 
    "course_url": "https://www.udemy.com/become-an-aws-certified-solutions-architect-associate/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-09T09:05:32Z"
}