{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>In this \"HANDS ON\" course you will learn to build an Adaptable Virtual Network in Virtual Box. <strong>  This course is MCSA and job focused it provides the TOOL you \nneed to get serious about configuring Microsoft Servers &amp; Clients on\n a virtual network when a real network is not available to you.</strong></strong><br></p>\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em></em>*As a new course - Some Issues and Details of recent Updates -  Addressed below.*<br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>**Just Added* Before we can do Microsoft Server &amp; Microsoft Active directory domain services configurations. We need both a virtual network and to understand IP Addressing. I added an IP addressing Bonus section to this course. This is the actual material and Project that I created and use in one of my courses.  Andrew<br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>1.   Although approved by Udemy any audio problems are being reviewed and   corrected by re-recording some videos as needed to improve sound quality.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>2. Regarding</strong><strong> specs for the virtual or host machines. </strong><strong>If you have a recent dual core or greater computer from the last few years you can run virtualization. The question is how many virtual machines you can run at the same time 4, 8, 12? This can be optimized but at some point you will run out of resources. You need a 64 bit machine to run windows server 2102 and later.  </strong><strong>When you download the ISO Image from Microsoft click on description and that will give you the requirements for the virtual machine. Keep in mind these aren't written in stone. I often run virtual machines with less than what is listed as min.  </strong><strong>I always start with 1 GB ram and 25 GB dynamically allocatable hard drive for a virtual machine. Then adjust RAM as needed the HD is ok. </strong><strong> I demonstrate how to\n do this during the course.  If you have any doubts you can google your processors to see if it can be used for virtualization.  Of course almost all modern machines can.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>3.  Regarding WSUS and the \nSCCM.  For logical reasons this is an internal virtual network it  is \nisolated from the host machine.  This means the virtual machines on this\n network cannot reach the outside world. The only purpose of the shared \nfolder created in this course is to pass files, from \nthe host machine to the virtual machines and vise versa. Clearly the shared folder is not intended to \"drive\" updates to the clients.  Only to allow the virtual machines access to the host machine via shared folder.  For example if you want to download FTP and Python to a virtual machine, download it from the internet to the shared folder on the host machine this will put FTP and Python in the shared folders on the virtual machines.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>4.  Be sure what you are getting.  This is a complete course to build a virtual internal network, no information is lacking for this purpose however this is not a Microsoft configuration course, this is a course to Build an adaptable virtual network in virtual box to do the Microsoft configurations on, it is not a complete course on virtual box.  There are many ways to build a virtual network in VIrtual Box and I have seen them all submitted by my studets this is the best and easiset way to get started.   I designed this so my students can do their Microsoft course work on this virtual network at home.  It has been tested successful many times for over a year.  However you will need to go to Youtube, Microsoft webpage or another Udemy course for specific  Microsoft server configuration details.  This course shows you step by step in detail how to build a adaptable virtual network in Virtual Box that supports multiple servers and clients to do the Microsoft configurations on.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>5.  The Value of this course is different to different people.  Setting up a virtual network and configuring multiple servers and clients on a network is great for the MCSA exams.  Although its certainly possible you can become a \"Paper Cert\" with little actual configuration experience.  However its impossible to land a decent job with little actual experience.  This course is for those that plan to earn a MCSA and then look for a job or for those already MCSA certified but lack the experience to pass the interviews.  You can build this virtual network on your computer.  Practice DNS, DHCP, AD/DS configs over and over on a network using multiple virtual machines all working together and ACE an interview.  This is the next best thing to real job experience and certainly valuable.    If you are primarily a Cisco Route and Switch Engineer and you just want to know a little overview about the Microsoft world this is not a valuable course for you.  This course is job focused it provides the tool you need to get serious about configuring Microsoft Servers &amp; Clients on a virtual network when a real network is not available to you.  It takes much of the hardwork out of figuring out virtualzation and lets you focus your time doing the Microsoft Configurations.  That's very valuable to those looking for Certification  and Employment as an MCSA.  <br></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Maintenance of this course is ongoing coming soon as a bonus I plan to add:</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>AD/DS server, DNS server, DHCP server configuration to the virtual network</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>and a Introduction to Powershell section.</strong><strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Disclaimer:</strong><br><strong></strong><strong>Note:  Like everything in Networking hands on is the key.  It is intended that you build this virtual network hence the title.  I will help you as needed in the shell. Everything is demonstrated step by step.  So work along and have some fun.</strong><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p>I am a University instructor, I teach Microsoft MCSA courses as well as other Tech courses. I have spent 100s of hours developing and documenting this system to create a virtual lab in virtual box so my students can practice MCSA configurations for certifications. From my experience, this is the Best, Easiest way to build an adaptable Virtual Network in Virtual box.</p>\n\n\n\n\n\n\n\n\n\n<p>What do I mean by an adaptable network? Your will learn to add and remove servers and clients from the virtual network very easily such that you can practice the required Microsoft configurations for both certifications and employment.</p>\n\n\n\n\n\n\n\n\n\n<p>In just under 3 hours, you will gain all the knowledge and ability required to build a great lab in virtual box to practice for the Microsoft MCSA and MCSE exams.</p>\n\n\n\n\n\n\n\n\n\n<p>Any student that wants to practice Microsoft Server and Client configurations on the free virtual box software should take this course because this takes the hard work out of using virtual box and configuring the network and allows you to focus on the Microsoft configurations to pass the exams, land a great job or improve your skills at work.</p>\n\n\n\n\n\n\n\n\n\n<p>I provide support in the discussion area to get your network working and adaptable. All I ask is that you follow my proven simple and effective method, watch all the videos and build the network according to the plans. After you become an expert, you may choose to add to or modify this method to suit your needs.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>*Note on host machine</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Some old processors do not officially support virtualization. Some examples of processors that do not support virtualization are: older Pentium 4s, Celerons, and AMD Athlons. Thus, you will not be able to activate processor virtualization effectively for a computer that does not have a processor with virtualization capabilities.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>For the most part, any newer processor with more than one core should be capable of running virtualization software. Some examples of processors that should support virtualization are: Core 2 Duo, Core 2 Quad, Intel Core i3, i5, i7, AMD Athlon X2, AMD Athlon X4, and AMD Phenom X4.</strong></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Build  a Virtual Network to prepare for Microsoft MCSA exams", 
    "price": "20.00", 
    "instructors": "Andrew Schlegel", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660762_340a_7.jpg", 
    "course_url": "https://www.udemy.com/build-a-virtual-network-to-prepare-for-microsoft-mcsa-exams/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T04:29:25Z"
}