{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Note: Actual price of the course is $199,Enroll now and get the benefit.</strong></p>\n\n<p><strong> Price will be </strong><strong>$199 very soon</strong></p>\n\n<p><strong>Additional topics will be added regularly.</strong></p>\n\n<p>C,C++,Ruby and Python are the most popular and advanced programming language which are used in most of the applications today, They are used in application like web-applications, games, mobile apps, operating systems, popular websites like yahoo, google, instagram twitter and many more.<br></p>\n\n<p>This course teaches you all the basic fundamentals in C, C++, Python and Ruby Programming Languages. You will get complete course on each of the individual subjects, It's four in one course.</p>\n\n<p>All Subjects here are treated as individual courses and are stand alone course, that means If you want to learn any one of the course it's absolutely fine and you are getting the complete course for your selected one.</p>\n\n<p>All the topics are explained separately under each subject, If there is common topics among the subjects they are explained in each of the course again and again as they are separate courses just included in one course.</p>\n\n<p>This courses are designed with practical examples for each topic to understand the concepts better. You will start each course from installing the software to run your program to basic concepts and further proceed to advanced concepts in each subject.</p>\n\n<p>After completing the course on one subject or all subject you will be able to write your own code for any requirement and bag strong knowledge on this programming languages.</p>", 
    "end_date": null, 
    "title": "C, C++, Python and Ruby Programming", 
    "price": "20.00", 
    "instructors": "DoEdu IT Educations", 
    "commitment": "26 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438970_d2e3_5.jpg", 
    "course_url": "https://www.udemy.com/c-c-python-ruby-java-html5-php-programming-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T21:49:17Z"
}