{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<h5></h5>  <h5></h5>  <h5></h5>  <h5>20 hours of Real World Videos and Packet Tracer / GNS3 Labs and Challenges!</h5>  <h5></h5>  <h5>Learn things that you really need to know.</h5>  <p>  \t                                   Right... so you want to work in networking? Great choice... wait a  minute... what about your experience? Oh... you read two books and  played with Packet Tracer? That might NOT be enough!  </p>  <ul style=\"\">  \t<li>20+ hours of Real Life Networking videos (HD) including troubleshooting of  switches, routers and access points (wireless), creating a perfect network diagram, installing and managing monitoring tools (PRTG, Kiwi Syslog etc.), applying for a job as a Cisco Engineer, working with Cisco TAC Support...</li>  \t<li>NO boring and useless topics which you will not find in the real world!</li>  \t<li>GNS3 and Packet Tracer Labs and Challenges</li>  \t<li>Real World Questions and Quizzes</li>  </ul>  <p>  \t                    .  </p>  <h5>Why are your videos better than 1000+ similar offers online?</h5>  <p>  \t                                   Simple! Because it is ALL about real life examples! No boring and  useless topics, no marketing, no useless commands - labs, labs,  troubleshooting exercises....  </p>  <p>  \t                   I cover things that you SHOULD know but<strong style=\"\"> you will struggle to find in a book</strong>: network diagrams, monitoring tools, racks, applying for a Cisco job etc.  </p>  <p>  \t                    .  </p>  <h5>I am studying towards CCENT/CCNA. Will it help me get my cert?</h5>  <p>  \t                                  Of course! There are a lot of questions and labs on your CCNA exam so  for sure my videos and labs will help you prepare for your exam.  However, my project is more focused on real life examples so not all  CCNA/CCNA Sec topics will be covered and some will be covered in more  details (including some CCNP topics and Microsoft topics). That&#039;s a good  thing as you can use my videos at ANY stage of your career in  Networking!  </p>", 
    "end_date": null, 
    "title": "CCENT and CCNA Real World Labs - Cisco Training", 
    "price": "20.00", 
    "instructors": "Marious Kuriata", 
    "commitment": "20 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/171532_e129_10.jpg", 
    "course_url": "https://www.udemy.com/ccnalabs/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-23T22:38:56Z"
}