{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t      Cisco Certified Internetwork Expert Routing and Switching (CCIE Routing and Switching) certifies the skills required of expert-level network engineers to plan, operate and troubleshoot complex, converged network infrastructure.  </p>  <p style=\"\">  \t      This video training course focuses on the topics listed in the “Layer 2 Technologies&quot; section of Cisco&#039;s blueprint for the CCIE Routing and Swiching  Version 5 Written and Lab exam.  \t        This is the First part of of 7 CCIE courses by sikandar shaik.  </p>  <p style=\"\">  \t  The  benefits of getting a CCIE certification are varied and include the following:  </p>  <ul style=\"\">  \t<li style=\"\">Better  pay</li>  \t<li style=\"\">Career-advancement  opportunities</li>  \t<li style=\"\">Applies to certain minimum requirements for Cisco Silver and Gold Channel Partners, as well as those seeking Master Specialization, making you more valuable to Channel Partners</li>  \t<li style=\"\">Better movement through the problem-resolution process when calling the Cisco  TAC</li>  \t<li style=\"\">Prestige</li>  \t<li style=\"\">Credibility for consultants and customer engineers, including the use of the Cisco CCIE  logo</li>  \t<li style=\"\">The other big reason to take the CCIE Routing and Switching written exam is that it recertifies an individual&#039;s associate-, professional-, and expert-level Cisco certifications, regardless of his or her technology track. </li>  </ul>", 
    "end_date": null, 
    "title": "CCIE Routing & Switching Version 5.0 - Layer 2", 
    "price": "50.00", 
    "instructors": "Sikandar Shaik", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327448_1d8e_2.jpg", 
    "course_url": "https://www.udemy.com/cciersv5/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-26T08:08:34Z"
}