{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Get ready to earn your CCNA and CCNA Security certifications with the best offer I've ever made on this popular course!</strong></p>\n\n<p><strong>First, you get my CCNA Security course absolutely FREE when you enroll for my CCNA Video Boot Camp in June.  (The video refers to another month, but we're still giving away the course!)  Just email your receipt to success@thebryantadvantage.com and we'll set you up with the free course within 48 hours.</strong></p>\n\n\n\n\n\n<p><strong>I also GUARANTEE you'll earn your CCNA by the August 20 deadline for the CCNA 200-120 exam.  If you don't have your CCNA for ANY reason by that date, you get my updated CCNA course absolutely FREE.   </strong></p>\n\n\n\n\n\n<p><strong>Come on in and join over 36,000 students on the road to CCNA and CCNA Security success!</strong></p>\n\n\n\n\n\n<p><strong>You'll earn your CCNA *AND* CCNA Security certifications for one low price!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>_________________________________________________________</strong></p>\n\n\n\n\n\n<p><strong>Earn Your CCNA With The Highest-Rated CCNA Course On Udemy. Over 27 Hours Of World-Class Instruction From Chris Bryant, \"The Computer Certification Bulldog\" -- and every video can be downloaded!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Over 200,000 students are now in my Video Boot Camps on Udemy, and now it's your turn to get CCNA certified -- with a little help from yours truly.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>36,000+ students are currently in this course, and now it's your turn to get CCNA certified, earn more money, and create a brighter future.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\t You receive immediate, full access to all 27+ hours of the course, and you can stream them or download them anytime you like.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\t You'll have permanent online access to watch the videos whenever you like as well, and there's a Q&amp;A forum right here on Udemy where you can post questions - and I'll answer them personally!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\t From my unbeatable, trick-free methods of teaching you how to perform binary, hex, and decimal conversions all the way through tough OSPF and EIGRP configs, you'll see it all right here on LIVE Cisco routers and switches - and you can watch every single session as often as you like.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\t Thanks for making The Bryant Advantage part of your CCNA success story! Let's get started on your CCNA!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\t Chris Bryant\t</p>\n\n\n\n\n\n<p> CCIE #12933</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\t \"The Computer Certification Bulldog\"</p>", 
    "end_date": null, 
    "title": "CCNA 2016 200-120 Video Boot Camp With Chris Bryant", 
    "price": "30.00", 
    "instructors": "Chris Bryant", 
    "commitment": "29.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/10812_b0af_6.jpg", 
    "course_url": "https://www.udemy.com/ccna-on-demand-video-boot-camp/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-11-03T22:36:26Z"
}