{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Online security is a huge concern for a lot of companies, with many of them opting for multiple firewalls and various encryptions to keep their data safe from hackers. The process of securing a company’s website starts by securing the servers and the network. This is why many companies pay a lot of money for hiring certified network specialists.</p><p>This is where CCNA comes in. Technology giant, Cisco, has designed numerous certifications to determine the credibility of technicians and to test their knowledge regarding networks, security and creating a network from the ground up. </p><p>The CCNA (200-120) is one of the many different certifications that the company offers. The 200-120 CCNA determines the candidate’s knowledge when it comes to installing, operating, and troubleshooting a small to medium size enterprise branch network.</p><p>If you want to start earning more while doing what you love, well then this course is perfect for you. Even if you have no knowledge of creating networks or knowing different communication tools, this course will teach you everything you need to know about hubs, switches, networking, routers, etc.</p><p>Our comprehensive course is all that you need in order to prepare yourself for the CCNA test. The course will cover the latest 200-120 test and all the 8 sections of the test - Operation of IP Data Networks, LAN Switching Technologies, IP Addressing (IPv4/IPv6), IP Routing Technologies, IP Services, Network Device Security, Troubleshooting, and WAN Technologies.</p><p>This is the ultimate course for learning everything you need to know about networking and security. What are you waiting for? Enroll now and ace your way through the CCNA test!</p>", 
    "end_date": null, 
    "title": "CCNA Routing and Switching - The Easy Certification Guide", 
    "price": 0, 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630982_b319.jpg", 
    "course_url": "https://www.udemy.com/ccna-routing-and-switching-the-easy-certification-guide/", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T05:24:55Z"
}