{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t                                                                                            Did you know that CCNA is one of the most important exams in the IT World today? Interested in unique training? Keep reading!</p><p><strong>Cisco has announced the new CCNA exam (200-125). Do not worry, you ARE covered! This course will be updated before the deadline and all new topics will be discussed. The last day to take ‘the old exam’ is: August 20, 2016</strong></p>\n\n<p>  \t                                                              This CCNA course teaches you all networking concepts and application  skills for configuring Cisco routers and switches. It includes a lot of <strong>real world examples and presentations</strong>, e.g. how to make an ethernet cable and use a patch panel, stacking Cisco switches, subnetting and much more... You will also see lectures with whiteboards and clips showing real routers, switches, access points, firewalls and network tools.  </p>\n\n<ul>  \t<li>The OSI Model</li>  \t<li>Configuration of Cisco routers and switches</li>  \t<li>Labs with 20 routers!</li>  \t<li>Cabling, including fibre optic cables and racks</li>  \t<li>How to use a <strong>virtual rack</strong> and save money</li>  \t<li>Subnetting made easy</li>  \t<li>VLANs, VTP and Spanning Tree Protocols</li>  \t<li>Dynamic routing protocols</li>  \t<li>Access lists and security concepts</li>  \t<li>Overview of firewalls and UTM devices</li>  \t<li>Meraki Access Points in action!</li>  \t<li>NAT configuration with real world examples</li>  \t<li>WAN solutions including ADSL/VDSL</li>  \t<li>How to troubleshoot network issues</li>  \t<li>Quizzes to help you pass the      exam</li>  \t<li><strong>Challenges in Packet Tracer</strong></li>  </ul>\n\n<p>  \t                                                                                             The course is perfect for anyone seeking to learn how to set up and troubleshoot Cisco networks.  </p>\n\n<p>  \t<strong>Contents and Overview</strong>  </p>\n\n<p>  \t                                                                                         In over 18 hours of content including almost 200 lectures this course covers a whole range of topics required for your <strong>CCNA exam</strong> and <strong>the real world </strong>as well. Each chapter closes with a quiz to make sure you  can practice exam questions and test your knowledge before moving to the  next section.  </p>\n\n<p>  \t                                                                                        We start from  scratch discussing The OSI and TCP/IP models, subnetting and network protocols. Then you move to basic router configuration and routing protocols. You will learn many interesting concepts about switches, access points and firewalls. This course  also discusses cabling, WAN technologies, subnetting and troubleshooting tips.  </p>\n\n<p>  \t            You will find a few <strong>challenges in Packet Tracer</strong> with answers so you can practice at home.<br>  </p>\n\n<p>  \t                                                                                      Join now!  </p>", 
    "end_date": null, 
    "title": "CCNA 2015 - CCNA 200-120 exam - a complete guide - Cisco", 
    "price": "20.00", 
    "instructors": "Marious Kuriata", 
    "commitment": "21.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359100_539f_3.jpg", 
    "course_url": "https://www.udemy.com/ccna-2015-cisco-200-120-exam/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T15:26:47Z"
}