{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>You get my CCNA Security Video Boot Camp FREE when you join my CCNP All-In-One Video Boot Camp in May!   Just send your receipt to success@thebryantadvantage.com and we'll set you up with the free course!</strong></p>\n\n<p><strong>You're in the right place at the right time to earn your CCNP with my clear, comprehensive CCNP All-In-One Video Boot Camp! </strong></p>\n\n\n\n\n\n\n\n<p><strong>  The </strong><strong>SWITCH course is fully refreshed for the 300-115 exam, and the ROUTE course is fully refreshed for the 300-101 exam. </strong> The TSHOOT material is currently being refreshed and will be completed in May 2016.<br></p>\n\n\n\n\n\n\n\n<p>Over 125,000 students in my Video Boot Camps have made me the #1 instructor on Udemy, and now it's your turn to earn your CCNP -- with a little help from yours truly!</p>\n\n\n\n\n\n\n\n<p>\t You receive full access to all 50+ hours of the course, including downloading - you can download one video or download them all! You'll have permanent online access to watch the videos whenever you like as well, and there's a Q&amp;A forum right here on Udemy where you can post questions - and I'll answer them personally!</p>\n\n\n\n\n\n\n\n<p>\t The videos are in order -- CCNP SWITCH, ROUTE, and TSHOOT - and clearly labeled, so you know EXACTLY what to watch for each exam.</p>\n\n\n\n\n\n\n\n<p>\t From my unbeatable methods of mastering BGP all the way through tough OSPF and EIGRP route redistribution scenarios, you'll see it all right here on LIVE Cisco routers and switches - and you can watch every single session as often as you like.</p>\n\n\n\n\n\n\n\n<p>Thanks for joining and for making The Bryant Advantage part of your CCNP success story!</p>\n\n\n\n\n\n\n\n<p>Chris Bryant</p>\n\n\n\n\n\n\n\n<p>CCIE #12933</p>\n\n\n\n\n\n\n\n<p>\"The Computer Certification Bulldog\"</p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "CCNP 2016 All-in-One Video Boot Camp With Chris Bryant", 
    "price": "50.00", 
    "instructors": "Chris Bryant", 
    "commitment": "56.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/16429_c92e_5.jpg", 
    "course_url": "https://www.udemy.com/ccnpallinone/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-16T15:17:33Z"
}