{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Healthcare Technology is a rapid growth industry, with increasing demand for skilled IT professionals who understand digital technology and the unique needs of healthcare clients and environments.</p><p>When you complete this course you will be able to:<br style=\"\"></p><ul style=\"\"><li>Identify and deploy the best technology for medical sites</li><li>Understand implementation methodology for healthcare environments</li><li>Manage EHR rollout and digital technology projects</li><li>Explain HIPAA, HITECH, and Meaningful Use compliance requirements.</li><li>Select proper encryption technology and employ encryption techniques in practice.</li><li>Define most frequently used health technology terminology and much more…</li></ul><p><br style=\"\">The CHITP course is edited and narrated by industry expert Brian Johnson, Senior Director of Online Education at 4Medapproved. Brian has years of instructional experience in Health IT Security topics and has a unique talent for making complex subjects accessible and easy to understand.<br style=\"\"></p><p>Each topic area is presented through dynamic animated video, which will highlight important concepts and training goals. Downloadable support materials are also included. All lectures are followed by a brief assessment to cement comprehension. The final exam will help you to confirm your knowledge and achieve the 4Medapproved certification to demonstrate your proficiency.</p><p>This proven learning method helps to maximize retention while accommodating busy schedules and flexible training timelines. <br style=\"\"><br style=\"\">The Certified Health IT Professional (CHITP) Course from 4Medapproved will help build a foundation of skill and credibility so that you may successfully address the needs of the unique healthcare technology market.</p><p>4Med Certifications are recognized and accepted by major healthcare employers, employment agencies, providers and professional organizations nationwide! Certify and Succeed with 4Medapproved!</p>", 
    "end_date": null, 
    "title": "Certificate of Health IT Proficiency (CHITP)", 
    "price": "50.00", 
    "instructors": "Stone River eLearning, Brian Johnson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386766_bbcd_2.jpg", 
    "course_url": "https://www.udemy.com/certified-healthcare-it-professional-chtp/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T15:54:07Z"
}