{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>The CCNP Route 300-101 certification is your next step in your professional Cisco Career. When you complete this course you should be well prepared to take your certification exam and begin to join the professional world of Cisco Systems.</p>\n\n<p>This certification is but one of three needed to obtain the highly sought after CCNP Routing &amp; Switching. Not only will this be a mile stone in your IT career but it is also sought after by companies around the world that require a higher level of routing; the Professional Level.</p>\n\n\n\n\n\n<p><strong>DISCLAIMER:   </strong><strong>Please note that the simulators/emulators used in this course are not part of the course. It is the students responsibility to have these to practice with. The Cisco Packet Tracer and/or VIRAL (Virtual Internet Routing Lab) are Cisco proprietary software and can only be obtained through Cisco. It is up to each student to obtain the simulator/emulator of their choice to study along with this course.</strong><br></p>\n\n\n\n\n\n<p>This course will teach you the  advance topics needed for IP's among many others). How to configure Security using Time Based Access-list, Infrastructure Access-lists and IPsec.</p>\n\n\n\n\n\n<p>You will learn how to filter routes, create prefix lists and so much mor. </p>\n\n\n\n<p>This course will give the knowledge required, no only to pass the CCNP exam, but it will help you in real world scenarios as well.</p>\n\n\n\n<p>The CCNP Route (300-101): The Complete Course will be the only course you will need to prepare and pass your CCNP Route certification exam.<br></p>", 
    "end_date": null, 
    "title": "Cisco CCNP Route (300-101): The Complete Course", 
    "price": "50.00", 
    "instructors": "Lazaro Diaz", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779948_743b.jpg", 
    "course_url": "https://www.udemy.com/cisco-ccnp-route-300-101-the-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T12:48:27Z"
}