{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t  Every year many thousands of students embark upon their studies towards the coveted Cisco CCNA exam. Most give up along the way. Of those who actually take the exam, only half will actually pass. What goes wrong?  </p>  <p>  \t  This is the question IT expert and the best selling author of &#039;Cisco CCNA in 60 Days&#039; and &#039;Cisco CCNA Simplified&#039; Paul Browning asked himself and spent years researching. He found after speaking to hundreds of IT students that most quit in frustration because they find the subjects both difficult and overwhelming and they felt under prepared for the task ahead.  </p>  <p>  \t  The CCNA is not an exam for beginners. Even the CompTIA Network+ may not sufficiently prepare you for the new style CCNA exam. Cisco have made it tougher than ever with the introduction of advanced subjects such as Spanning Tree Protocol, IPv6, OSPFv3 and many more which previously were part of the advanced Cisco CCNP syllabus!  </p>  <p>  \t  What has been lacking is a foundational course you can take to cover all the subjects Cisco leave out from the CCNA but you simply must understand if you are to tackle the exam. Subjects such as TCP/IP, network cabling and basic router and switch configuration. If you are considering taking the Cisco CCNA exam and want to give yourself a huge head start then this is the course for you.  </p>  <p>  \t  You will learn valuable information you can put to use when you study for the CCNA as well as learn tips and tricks you can put to use on a live network.  </p>  <p>  \t  If you want to avoid months of frustrating study and wasted time then this course will help you accelerate your understanding and give you a valuable edge if you decide to progress to the Cisco CCNA next.  </p>", 
    "end_date": null, 
    "title": "Cisco CCNA Primer", 
    "price": "20.00", 
    "instructors": "How To Network", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355982_7e05.jpg", 
    "course_url": "https://www.udemy.com/cisco-ccna-primer/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T08:47:55Z"
}