{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong style=\"\">Welcome to Cisco&#039;s CCNA Wireless course  for the (640-720) IUWNE certification!<br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">This course is over 12+ hours in  length and will cover all the needed subjects to be successful in  helping to prepare and pass the CCNA Wireless exam.</strong>  </p>  <p>  \t<strong style=\"\">This course packs a punch!...not only will the student acquire the knowledge needed for Cisco&#039;s certification exam; but what is learned herein will be transferable to the real world for a small and/or Enterprise environment.  </strong>  </p>  <p>  \t                                          Students will get an in-depth  understanding of networking, using wireless routers along with switches and their  various configurations and connections. Students will learn about different types of wireless topologies, wireless RF fundamentals, wireless standards and an introduction to wireless security.  </p>  <p>  \t                                          This course will also prepare the student  in Layer 2 technology and its various configurations, such as; VLAN’s, Inter-VLAN  communication &amp; Trunking.  </p>  <p>  \t                                          Students will also acquire the basic understanding  needed to secure their wireles networks using the following techniques and protocols; PSK. 802.1x, WPA/WPA2 with EAP-TLS, EAP-FAST, PEAP and LEAP.  </p>  <p>  \t                                          Student will learn how to install the Cisco Unified Wierless Network (CUWN), how to setup the WLC management, manage stand alone AP&#039;s, and be able to troubleshoot, maintain wireless networks.  </p>  <p>  \t<strong style=\"\">This is a full comprehensive course that will take you from A-Z in your quest to acquire the Cisco Wireless Certification!  </strong>  </p>", 
    "end_date": null, 
    "title": "Cisco CCNA Wireless (640-722 IUWNE): The Complete Course", 
    "price": "40.00", 
    "instructors": "Lazaro Diaz", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333978_6c2c.jpg", 
    "course_url": "https://www.udemy.com/cisco-ccna-wireless-640-722-iuwne-the-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T10:46:36Z"
}