{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t    <em class=\"redactor-inline-converted\">This course is over 24+ hours in length (for now) and will cover all the needed subjects to be successful in passing your CCNA 200-120 exam and/or the (200-125). Let me explain:</em></p>\n\n<p><strong class=\"redactor-inline-converted\">This course will be updated to reflect everything you need for Cisco's new certification CCNA (200-125) certification exam! This course is will be updated for the NEW CCNA requirements before the 8/20/2016 deadline.<br></strong></p>\n\n<p>Students will acquire the knowledge and practice labs in this course to make it transferable to real world use as a Cisco and or IT Professional.</p><p><strong class=\"redactor-inline-converted\">DISCLAIMER:   </strong><strong>Please note that the simulators/emulators used in this course are not part of the course. It is the students responsibility to have these to practice with. The Cisco Packet Tracer &amp; VIRAL (Virtual Internet Routing Lab) are Cisco proprietary softwares and can only be obtained through Cisco. It is up to each student to obtain the simulator/emulator of their choice to study along with this course.</strong></p>\n\n<p>  \t\t  \"<em class=\"redactor-inline-converted\">This course is complemented by my newest course: </em> <strong class=\"redactor-inline-converted\">Cisco CCNA Labs: Gateway to Success! </strong><em class=\"redactor-inline-converted\">which covers all the labs needed <strong class=\"redactor-inline-converted\">(Newer labs will be added to reflect the new CCNA (200-125) certification exam</strong>). This will give the students the practice to prepare for configurations and simulations that will be encountered in the CCNA certification exam. I have also created a <strong class=\"redactor-inline-converted\">free Dropbox on my website</strong> that has all the material, labs and other resources to compliment my CCNA courses.\"</em></p>\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Of course, as this courses evolves into the (200-125), those labs will also be included.</strong></em><br>  \t</p>\n\n\n\n<p>  \t\t\t     This course will give students an in-depth understanding of networking, using routers and switches and their various configurations and connections. Students will learn how to configure; default, static and dynamic routing. Students will comprehend how to manipulate each of the routing protocols attributes to meet the requirements of the network.  \t\t\t</p>\n\n\n\n<p>  \t\t\t\t\t                        This course will also prepare the student in Layer 2 technology and its various configurations, such as; VLAN’s, VTP, STP, PortFast, EtherChannel, Port-Security, Inter-VLAN communication &amp; Trunking; plus the newest requirements for the CCNA (200-125) certification exam as well.  \t\t\t\t</p>\n\n\n\n<p>  \t\t\t\t\t\t\t                        Students will also acquire the knowledge needed to secure their routers through the use of Access-list, configuring the different types of NAT &amp; will be able to manage the router’s components.  \t\t\t\t\t\t</p>\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t                        Students will also be able to thoroughly grasp the concepts of both Internet Protocols; IPv4 &amp; IPv6.  \t\t\t\t\t\t\t\t</p>\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t                        Wide Area Network Protocols will also be covered; HDLC, PPP &amp; Frame Relay. The student will also learn how to create redundancy in their networks through the use of Redundancy Protocols such as HSRP which is just as important. Also, within the WAN, the student will also learn how to create VPN’s and GRE Tunnels.  \t\t\t\t\t\t\t\t\t\t</p>\n\n\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t                        <strong class=\"redactor-inline-converted\">This is a full comprehensive course that will take you from A-Z in your quest for the CCNA (200-120)...and the soon to be the 200-125 as well.</strong>  \t\t\t\t\t\t\t\t\t\t\t\t</p>\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">About \"the book\":</strong></em>    </p>\n\n\n\n<p>Throughout the course, you will hear me mention \"<em class=\"redactor-inline-converted\">your book</em>\", \"<em class=\"redactor-inline-converted\">a book</em>\" or \"<em class=\"redactor-inline-converted\">the book</em>\"...and if you're wondering why I don't mention a name...it's because this was done on purpose.</p>\n\n\n\n<p>I don't want anyone to purchase a book if you already have one...all CCNA study guides cover the same thing in different manners. So if you already have a CCNA book, you can use it with this course.</p>\n\n\n\n<p>However, for those that wonder which book I use and/or mention in this course...I can tell you that it's the Sybex CCNA Study Guide by Todd Lammle for the 200-120. (the book is not mandatory, but highly recommended).</p>\n\n<p><em>Todd Lammle will have a new book to out for the CCNA (200-125). Which will be available on AMAZON</em>.</p>\n\n\n\n<p>Also, I have created a free Dropbox for all my students that includes practice labs and other stuff that will be useful to prepare for the CCNA exam. Since I cannot post the link here <em class=\"redactor-inline-converted\">(not allowed)</em>, just go thought some of my announcements and you will find the link there.</p>\n\n\n\n<p>Hope you enjoy the course!</p>\n\n\n\n<p>Laz  ;)</p>\n\n<p><strong class=\"redactor-inline-converted\">DISCLOSURE:  I do not know Todd Lammle, I do not get referral fees and/or any compensation  from him or Sybex, I just happen to think that his books are much easier to understand and follow. It is up to you (the student) to decide which book, if any, you want to use along with this course.</strong><br></p>", 
    "end_date": null, 
    "title": "Cisco CCNA (200-120): Soon to be (200-125)", 
    "price": "40.00", 
    "instructors": "Lazaro Diaz", 
    "commitment": "25 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/209610_a78c_8.jpg", 
    "course_url": "https://www.udemy.com/the-complete-ccna-200-120-course/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-02T21:48:21Z"
}