{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>NEW UPDATE: Doubled the content and added in 5 more lectures!</p><p>Feeling overwhelmed in jumpstarting your Cisco IT career? No worries.. I've got you covered.</p><p>If you've always wanted to learn how to become a successful Cisco IT engineer step by step, this mini course covers everything you need to get you started on the right path. It's intended for people that want to become a network or systems engineer with a special focus on Cisco technologies. </p><p>In a nutshell, this is \"How To Become a Cisco Engineer 101\". Get all the real insights, strategies, and tips to map out your career. But don't take my word for it. See what my students have to say below.</p><p><em>\"Awesome course ! Terry shares his precious experience on career planning in the IT field and the \"Course Links and References.pdf\" is very useful in the course, thanks!\" -Ernest </em></p><p><em>\"Nice short introduction into the world of Cisco. The educator gives clear how-to instructions - where to begin, how to start with no experience, etc.\" -Marc</em></p><p><em>\"This definitely deserves a top rating! He was articulate, enthusiastic. This is a really intelligent approach into the world of computer networking if you like working with technology in the computer networking world! The instructor was engaging and gave an interesting delivery while keeping it real! Thank you!\" -Chuey</em><br></p><p><em>\"Clear, easy to follow, and informative... before viewing this course I was confused on how to navigate Cisco certification and career pathway. Also the additional resources are a big bonus as well.\" -Keeona</em></p><p><em>\"I'm really pleased to have found that kind of course, it helped me to get a better idea about my career blueprint!\" -Thomas</em></p><p><em>\"Terry Kim gives good information about starting off in the IT field as a Network Engineer and more. I highly recommend this course for anyone switching into IT, having a hard time landing a job in IT and such. Great course to take!\" -Carlos</em></p><p><em>\"These sessions are very enlightening indeed as to what the IT career field is all about, and what one might expect to experience were (s)he to become involved in it. It's well worth the time for anyone who is even casually interested in such work.\" -Gene</em></p><p><em>\"It will fill you with confidence + how to build a future in IT. Awesome!\" -Irfan</em></p>", 
    "end_date": null, 
    "title": "Cisco Careers: Want to Earn 100K+ as a Cisco Engineer?", 
    "price": "20.00", 
    "instructors": "Terry Kim", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572850_fe0d_2.jpg", 
    "course_url": "https://www.udemy.com/cisco-engineer-ccna-course-blueprint-101/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-03T21:40:23Z"
}