{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">The CISSP: Certified Information Systems Security Professional, covers topics such as Access Control Systems, Cryptography, and Security Management Practices, teaching students the eight domains of information system security knowledge.</p>As the first certification of information security ANSI accredited with ISO recognition, the CISSP certification provides security professionals the information an objective measure of validity and professionalism recognized internationally. The certification demonstrates advanced knowledge within 8 domains of the (ISC) ² CISSP CBK<p style=\"\"><strong><br>The CISSP exam tests one's competence in the 8 domains of the CISSP CBK, which cover:</strong><br></p><ul><li>Security and Risk Management</li><li>Asset Security</li><li>Security Engineering</li><li>Communications and Network Security</li><li>Identity and Access Management</li><li>Security Assessment and Testing</li><li>Security Operations</li><li>Software Development Security</li></ul><p style=\"\">The CISSP Certification is administered by the International Information Systems Security Certification Consortium or (ISC)². (ISC)² promotes the CISSP exam as an aid to evaluating personnel performing information security functions. </p><p style=\"\">In this course, It is mentioned maps directly to the exam objectives and offers numerous features such as exam tips, case studies, and practice exams.<br></p><p>CISSP candidates must have a minimum of five years of professional work experience direct full-time security in two or more of the ten domains of the (ISC) 2® CISSP CBK®, or four years of professional work experience directly on security full time in two or more of the ten domains of the CISSP CBK with a tertiary degree.</p><p>Alternatively, there is a reduction from year to year professional experience requirement to possess an additional credential on the approved list of (ISC) 2</p>", 
    "end_date": null, 
    "title": "CISSP - Certified Information Systems Security Professional", 
    "price": "30.00", 
    "instructors": "Naps Tecnologia Academy Inc", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609260_342d_2.jpg", 
    "course_url": "https://www.udemy.com/cissp-certified-information-systems-security-professional/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T16:59:34Z"
}