{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t    We&#039;ve all heard of cloud computing and the chances are you are already using it when we access e-mail, watch videos online or listen to music but what exactly is it?  </p>  <p style=\"\">  \t    This entry level course explains what actually constitutes cloud computing. We look not only at the technical aspects but the business issues (benefits and risks).  </p>  <p style=\"\">  \t    Your trainer is a highly experienced cloud computing architect working for a global IT solutions company and so you are learning from somebody who really knows their stuff and shares with you all their insider tips and knowledge.  </p>  <p style=\"\">  \t    Subjects covered include:  </p>  <ul style=\"\">  \t<li style=\"\">Models of cloud computing available</li>  \t<li style=\"\">Learning common cloud terminology</li>  \t<li style=\"\">Things to consider before moving to the cloud</li>  \t<li style=\"\">Which parts of the IT department we can move to the cloud</li>  \t<li style=\"\">Considerations if our cloud provider goes out of business</li>  \t<li style=\"\">How to migrate our IT services to the cloud</li>  \t<li style=\"\">Cost considerations (pros and cons)</li>  \t<li style=\"\">IT Governance and cloud computing (managing it all)</li>  \t<li style=\"\">Understanding the big vendor options</li>  </ul>  <p style=\"\">  \t    Take this course if you want to gain confidence and understanding of cloud computing as a technical or business person.  </p>  <p style=\"\">  \t    This course will prepare you for the internationally recognized CompTIA Cloud Essentials qualification. Check the CompTIA website for details of examination centres and testing requirements.  </p>  <p style=\"\">  \t    This course is entry level so no previous knowledge is assumed. A general understanding of what a computer network is and does will help.  </p>", 
    "end_date": null, 
    "title": "Cloud Computing - CompTIA Cloud Essentials Certification", 
    "price": "20.00", 
    "instructors": "How To Network", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390244_7456.jpg", 
    "course_url": "https://www.udemy.com/cloud-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T09:39:58Z"
}