{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong> In order to become CompTIA A+ Certified, you need to take this course and also the CompTIA 220-801 course.</strong>  </p>  <p>  \t In this CompTIA A+ 220-802 Exam training course, expert author Mark Long will teach you everything you need to know to prepare for a career in IT and successfully complete the A+ 220-802 exam. You must pass the A+ 220-801 and A+ 220-802 exam to receive the CompTIA A+ certification.  </p>  <p>  \t <br>  \t You will start by learning about the various Windows operating systems, including how to install Windows and use the command line tools. You will then learn about networking command line tools and administrative tools, such as performance monitor, Windows firewall, and task manager. Mark will teach you about the control panel utilities, including folder and power options and user accounts. This video tutorial will also cover how to configure Windows networking, sharing resources, and security. You will also learn about different mobile devices, such as Android, iOS, and Bluetooth. Finally, you will cover troubleshooting techniques, including common hard drive symptoms, network issues, and printer symptoms.<br>  \t <br>  \t Once you have completed this computer based training course, you will have the developed the knowledge and skills necessary to pass the A+ 220-802 (2012 Objectives) exam.  </p>", 
    "end_date": null, 
    "title": "CompTIA A+ 220-802 - Prepare For The CompTIA A+ 220-802 Exam", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/245190_d745_7.jpg", 
    "course_url": "https://www.udemy.com/comptia-a-220-802/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-17T18:44:12Z"
}