{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>HTML</strong> and <strong>CSS</strong> are the core languages any <strong>Web Developer</strong> needs.</p><p>All Website and an increasing number of Mobile apps are built using these <strong>fundamental</strong> but easy to use languages.</p><p><strong>Web Development Essential Skills - Complete HTML and CSS</strong> - teaches you everything you need to know to master HTML and CSS and start building Web Apps and Mobiles today!</p><p><strong>Assuming no prior knowledge because pre requisites are covered in section 1</strong>, we will show you how to get the tools and apply pro techniques to make your code clean, easy to maintain and robust.</p><p>All you need is a Windows PC or Apple Mac running OSX and an internet connection - This course will show you how to get all the other tools you need - FOR <strong>FREE</strong>!</p><p>I'll take you step by step through the <strong>most important skills</strong> including</p><ul><li>Core HTML Tags and how to use them.</li><li>Separating Style from Content</li><li>Using CSS Selectors</li><li>Working with Links, Positioning, &amp; forms.</li><li>Core HTML Tags and how to use them.</li><li><span></span>Apply CSS Styling</li><li>Separating Style from Content</li><li>Building Multi Level Menus</li><li>Advanced CSS features.</li><li>Making a website responsive for tablets &amp; mobile phones.</li><li><strong>FREE GIFT OF 14$ HTML CSS Template. </strong></li></ul><p>In this course, you'll go through each element HTML in turn, and walkthrough all the options for styling elements using CSS Selectors and Style Sheets to create clean and easy to maintain HTML Apps.</p><p>By the end of the course you'll be fully confident and know everything you need to get started on your way to being a top class, professional web developer!<br></p><p>And of course, being part of Udemy you get: <br></p><ul><li><strong>FREE lifetime access</strong> to this course</li><li>ALL future lectures and upgrades (of which there will be many!) included for free</li><li>Udemy's Unconditional <strong>30 day money back guarantee </strong>- so there's NO risk</li><li>Course completion certification after completing it 100%</li></ul><p>I believe this is the best way to learn, you will be able to apply what you are learning to a real project and instantly see the results.</p>", 
    "end_date": null, 
    "title": "HTML AND CSS KICK-START TO BECOME A RICH WEB DEVELOPER", 
    "price": "20.00", 
    "instructors": "Flipbell IT Studio", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726674_e130_3.jpg", 
    "course_url": "https://www.udemy.com/html-css-website/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T10:18:35Z"
}