{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>في عالم إدارة الأنظمة التشغيلية والمستخدمين، شركة <strong>مايكروسوفت </strong>هي الأولى، وتعد امتحاناتها هي الأشهر والأوسع انتشاراً منذ أكثر من 15 عاماً، حيث تصدر مايكروسوفت سلسلة امتحانات جديدة مع كل نظام تشغيل (خادم) جديد، فكان هناك شهادة لنظام تشغيل 2003، وأخرى للنظام الأشهر على الإطلاق 2008، وهذه هي الثالثة التي تغطي نظام تشغيل 2012 MCSE<br>في هذه الدورة، سنقوم بتغطية جميع المواضيع المطلوبة لاجتياز الامتحان الأول <strong>410-70 </strong>من سلسلة الامتحانات المطلوبة للحصول على الشهادة<br><strong>ملاحظة: تم وضع الكلمات الإنجليزية في سطر منفرد لأن النص هنا لا يدعم الكتابة من اليمين لليسار في الوقت الحالي<br>عناوين المحاضرات أيضاً تم كتابتها باللغة الإنجليزية لصعوبة وضع كلمات عربية وإنجليزية في نفس السطر مع الحفاظ على التنسيق</strong></p><p><strong></strong><br>سيتم تقسيم الدورة إلى عدة أقسام، كل قسم يغطي عنوان رئيسي في متطلبات الامتحان، حيث سنأخذ نبذة في البداية عن تاريخ الشهادة، والتغيرات والتطورات التي حصلت في النسخة الأخيرة منها</p><p><br>في القسم الثاني، سنقوم بتغطية إصدارات نظام التشغيل 2012 والفروق بينهم، وما هي الخيارات المتاحة لتنزيل النظام، ثم سنقوم بتنزيل النظام على جهاز افتراضي، وإعداده وتجهيزه للبدء بالعمل عليه<br></p><p>القسم الثالث يتحدث عن العمل على شاشة الأوامر وإعداد الخادم في حال تم تنزيل<br>Windows Core<br></p><p>بعد ذلك، سنأخذ الوقت الكافي لإضافة وإعداد أهم وظيفة لنظام التشغيل، وهي<br>Active Directory Domain Services - ADDS<br>وما يتبع ذلك من إعدادات وتهيئة لتجهيز الخادم للعمل بهذه الوظيفة<br></p><p>بعد ذلك، سنتعلم إدارة المستخدمين، الأجهزة، المجموعات، وغير ذلك في الـ<br>Active Directory Users and Computer &amp; Active Directory Administrative Center<br></p><p>ثم سنتحدث عن الشبكات في النطاق المطلوب للامتحان، سنغطي الـ<br>IPv4 &amp; IPv6<br>وكيفية عمل كل منهما<br></p><p>ثم سندرس بشكل موسع جميع ما يتعلق بالـ<br>Group Policy<br>مما هو مطلوب في الامتحان<br></p><p>بعد ذلك، سنتعلم المهارات المطلوبة لتجهيز الخادم ليعمل كـ<br>DHCP Server<br></p><p>ثم سندخل في كيفية عمل الـ<br>DNS<br>وكيف تتواصل هذه الخوادم مع بعضها عبر شبكات العالم، وما عليك معرفته فيما يتعلق بإدارة الخادم لديك<br></p><p>سنتحدث بعد ذلك عن منتج مايكروسوفت للأجهزة الافتراضية<br>Hyper-V<br>سنغطي كافة جوانبه التقنية المطلوبة في الوقت الحالي، من تجهيز للخادم، وإنشاء للأجهزة الافتراضية وإدارتها وغير ذلك<br></p><p>سيكون هناك بعد ذلك عدة أقسام تتعلق بالتخزين والصلاحيات التي يمكن تطبيقها على وحدات التخزين والملفات، منها ما هو عام، ومنها ما يتعلق بنظام التشغيل 2012<br></p><p>في النهاية، سنتحدث بشكل سريع عن إدارة الطابعات، وعن تفعيل وإدارة الجدار الناري في 2012</p><p>ستكون هذه الدورة شاملة لجميع مواضيع الامتحان وسيتم تحديثها بشكل دوري<br>وسيتم إن شاء الله العمل على إتمام الامتحانات الأخرى من سلسلة<br>MCSA</p>", 
    "end_date": null, 
    "title": "Installing & Configuring Windows Server 2012 R2 70-410 دورة", 
    "price": "20.00", 
    "instructors": "Omar Dabbas", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642752_7fec_5.jpg", 
    "course_url": "https://www.udemy.com/mcse-70-410-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T19:36:54Z"
}