{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Interested in getting AWS certified solutions architect associate, but not sure on how and where to start, this video will help you get certified in 30 days.\n\n  </p>\n\n<p>Irrespective of you being certified or not, AWS skills are going to have skill in today's market. On average AWS solution architect makes $150,000 per year.  AWS certified solutions architect is ranked top among the moneymaking certifications in entire IT world.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>When people came to know that I had completed my AWS Certified Solutions Architect Associate, I received number of inquiries from my friends and students on how I did it and where I found resources and study materials etc... . So here is this brief course… Get AWS certified solutions architect associate in 30 days? That’s right…. In 30 days!  \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>This course is must for anyone who wants to get certified in Amazon Web Service solution architect associate exam as it answers key questions:</p>\n\n\n\n\n\n<ul><li>Why do you want to get learn AWS and get certified?</li><li>Why AWS Certified Solutions Architect Associate and what they do?</li><li>Where to start and find the resources for exam preparation?</li><li>How to study and prepare in 30 days for the exam?</li><li>What are the exam objectives and the domains measured?</li><li>What to expect in your exam including question types?</li><li>What AWS services you should focus for the exam?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Take advantage of this free course and let me help you to successfully prepare for your certification exam. So, signup now and get started!  I’m looking forward to having you in the course!</p>", 
    "end_date": null, 
    "title": "Intro to AWS Certified Solutions Architect Associate Exam", 
    "price": 0, 
    "instructors": "Premraj Jeyaprakash", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/838602_cf92_4.jpg", 
    "course_url": "https://www.udemy.com/aws-certified-solutions-architect-associate-in-30-days/", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-03T15:59:49Z"
}