{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>If you are preparing for ISTQB Foundation level to become an ISTQB Certified Tester then it is good to attend this course. I will be adding lectures to describe all the chapter and I have also focused on sample questions to practice. I have included around 160 sample questions in quiz and sample exam papers. Sample exams helps you to evaluate your preparation before you take up the actual certification. This will help you evaluate your readiness to take up the ISTQB Certification, as well as judge your understanding of the topics.<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is ISTQB?</strong><br></p>\n\n\n\n\n\n\n\n<p>The International Software Testing Qualifications Board (ISTQB) is a software testing qualification certification organisation. It was founded in Edinburgh in November 2002, ISTQB is legally registered in Belgium.The ISTQB is responsible for the international qualification scheme called \"ISTQB Certified Tester\". The qualifications are based on a syllabus, and there is a hierarchy of qualifications and guidelines for accreditation and examination.</p>\n\n\n\n\n\n<p><strong>ISTQB vision is</strong><br>Defining and maintaining a Body of Knowledge which allows testers to be certified based on best practices, connecting the international software testing community, and encouraging research.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What is ISTQB certification?</strong></p>\n\n\n\n\n\n\n\n<p>ISTQB certification is the certification exam conducted by the International Software Testing Qualifications Board (ISTQB). ISTQB certification exams are conducted internationally<br>ISTQB provides 3 levels of certification:</p>\n\n\n\n\n\n\n\n<ul><li>ISTQB Foundation Level (CTFL)</li><li>ISTQB Advanced Level (CTAL)</li><li>Expert Level (CTEL)</li></ul>\n\n\n\n\n\n\n\n<p>In order to get certified, you must successfully pass the ISTQB certification exams. In order to pass the test you must acquire professional knowledge in the field of testing, and be familiar with the basics and work processes of software testing. For all three levels of certification, international working groups of ISTQB develop and maintain internationally uniform curricula and exams</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What are the benefits of ISTQB certification?</strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Benefits of ISTQB certification for individuals:</strong></p>\n\n\n\n\n\n\n\n<ul><li>Certification represents recognition of a particular individual's professional competence.</li><li>Prestige for the individual and a competitive advantage over non-certified individuals in the same field.</li><li>Many companies consider ISTQB certification as a plus point for employees during appraisals.</li><li>During employee recruitment, many companies prefer certified employees over non certified employees.</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Benefits of ISTQB certification for Organisations:</strong></p>\n\n\n\n\n\n\n\n<ul><li>Establishment of a professional standard for employees in the field of Software testing.</li><li>Assist the employers in making hiring decisions.</li><li>Highly trained and competent workforce for employers.</li></ul>", 
    "end_date": null, 
    "title": "ISTQB - Foundation Level Certification (CTFL) Training", 
    "price": "25.00", 
    "instructors": "Sagar Joshi", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515146_eccd_6.jpg", 
    "course_url": "https://www.udemy.com/istqb-foundation-level-certification-ctfl-training/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T02:33:54Z"
}