{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t           Are you new to Software Testing field or an experienced Software Testing professional who want&#039;s to enhance his existing skill set and get ISTQB® Certified Tester? Do you want to keep yourself competitive in the IT market by leveling up your Software Testing skills? Then this course if for you.  </p>  <p>  \t              This is a comprehensive course to learn Software Testing skills at your desk, get ISTQB® certified and improve you marketability throughout the industry. In this course I have covered complete ISTQB® foundation level syllabus in detail which will help you to PASS your certification very easily.  </p>  <p>  \t<strong style=\"\">Why should you get ISTQB® certified?</strong>  </p>  <p>  \t              ISTQB® Certified Tester is the most widespread qualification scheme in the world, and the syllabi contents and glossary have become the de facto industry reference for the software testing profession. By doing  certification you:  </p>  <ul style=\"\">  \t<li>Gain independently assessed knowledge and skills.</li>  \t<li>Increase your marketability throughout the industry.</li>  \t<li>Have greater career opportunities and increased earning potential.</li>  \t<li>You can add the &quot;ISTQB® Certified Tester&quot; logo and credential to their resumes.</li>  \t<li>You are recognized as having subscribed to a Code of Ethics.</li>  </ul>  <p>  \t          So, don&#039;t wait. Just go ahead and enroll in the course as you are not going to get anything better in such competitive pricing.  </p>", 
    "end_date": null, 
    "title": "ISTQB® Certified Tester Foundation Level (CTFL) Training", 
    "price": "25.00", 
    "instructors": "Manish Verma", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/142466_add1_4.jpg", 
    "course_url": "https://www.udemy.com/istqb-certified-tester-foundation-level-training/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-06T00:31:37Z"
}