{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>*** Probably THE MOST POPULAR ISTQB COURSE on Udemy! ***</strong><br></p>\n\n<p><strong>*** Course Updated as of April 2016! ***</strong></p>\n\n<p><strong>*** Only ISTQB course in Udemy which is taught by Real Software Professional not by teachers of institutes***</strong></p>\n\n<p><strong><em>The course is very good, quality and slides by instructor are too good. I didn't took course for ISTQB but for </em></strong><strong><em>understanding software testing and it is explain prety well. 5 star to course :)</em></strong> by Ankit Sharma</p>\n\n<p>----------------------------------------------------------------------------------------------------------------</p>\n\n<p>Key Points:</p>\n\n<ul><li>ISTQB is not so easy to be covered in only few hours only, so join course which covers     full syllabus</li><li>Course is developed by real IT persons, not instructors of some boring institutes, so real     scenarios would be covered here</li><li>Success rate of ISTQB ceritified are huge after completing this course in ISTQB</li><li><strong>Don't spend your hard earnings on so expensive course unnecessary</strong></li></ul>\n\n<p><br></p>\n\n<p>The Foundation Level exam tests for knowledge, not skill. </p>\n\n<p>It provides information about the certificate holder's level of familiarity with the most common concepts of software testing and the associated terminology.</p>\n\n<p><strong><em>I was looking for course not for learning Software Testing, as I wanted to move to Software testing industry. I was unaware of what I need to do, what best practices and others. But this course is so simple that it explained all stuff of Software Testing and preparing for ISTQB cerification also. This course really helped me understand each process of the SDLC and has explained the different types of testing </em></strong><strong><em>in a hands on approach. I feel have earned more than I spent on this course.</em></strong> By Jyoti Rana</p>\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n<p>Over <strong>4000+ </strong>satisfied students are enrolled in my ISTQB courses across the Web</p>\n\n<p><strong>Last Updated Dec 9,2015</strong></p>\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n<p>This course will help you to clear ISTQB Certification. Course material is designed as per the ISTQB syllabus. </p>\n\n<p>I have been in Software Testing filed since last 8+ years and ISTQB certified tester, teaching is my passion so will be going explaining Software Testing concepts with real scenarios.</p>\n\n<p>I will be present for any support and help during the course. Will also be updating the course as per istqb syllabus so that this training material stays the worth for all of you.I am not just trainer who is just narrator through topics, I am working <strong>professional </strong>will be covering each topic with i<strong>ndustry examples and best practices used in IT industry.</strong> </p>\n\n<p>This course covers:</p>\n\n<ul><li>Why is testing necessary?</li><li>What is Testing?</li><li>Testing Principles</li><li>Fundamental Test Process</li><li>The psychology of Testing</li><li>Software development models</li><li>Test Levels (Eg. Unit testing, Component testing, Integration testing,etc.)</li><li>Test types (Functional, non-functional, structural, change-related testing)</li><li>Maintenance testing</li><li>Reviews and the Test process</li><li>Review Process</li><li>Static analysis by tools</li><li>Identifying test conditions and designing test cases</li><li>Categories of test design techniques</li><li>Specification based or Black Box techniques (eg. BVA, Equivalence Partitioning)</li><li>Structure based or white Box techniques</li><li>Experienced based techniques (Error guessing and Exploratory guessing)</li><li>Choosing a Test techniques</li><li>Test organization</li><li>Test Plans, estimates and strategies</li><li>Test progress, monitoring and control</li><li>Configuration management</li><li>Risk and testing</li><li>Incident management</li><li>Types of test tools</li><li>Effective use of tools</li><li>Introducing a tool into an organization</li></ul>\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Important information before you enroll:</strong></p>\n\n<ul><li>In case you find the course useless for your career, don't forget you are covered by a   <strong>   30 day money back guarantee</strong>, full refund, no questions asked!</li><li>Once enrolled, you have unlimited, lifetime access to the course!</li><li>You will have instant and free access to any updates I'll add to the course.</li><li>I will give you my full support regarding any issues or suggestions related to the course.</li><li>Check out the curriculum and FREE lectures for a course preview.</li></ul>\n\n<p>------------------------------------------------------------------------------------------------------------------</p>", 
    "end_date": null, 
    "title": "ISTQB Certified Tester Foundation Level Training (CTFL)", 
    "price": "25.00", 
    "instructors": "Vaibhav Gupta", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/511902_604e_3.jpg", 
    "course_url": "https://www.udemy.com/istqb-certified-tester-foundation-level-training-ctfl/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T16:06:32Z"
}