{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>السلام عليكم و رحمة الله</p>    <p>أهلا و سهلا بكم في دورة الايتل المستوى التأسيسي اصدار سنة 2011.</p>    <p>سأصحبكم في هذه الدورة للتعرف على اطار عمل يشرح أفضل الممارسات في مجال ادارة تكنولوجيا المعلومات و الذي يركز على ايصال قيمة حقيقية من استخدام تكنولوجيا المعلومات و وجود أقسام تكنولوجيا المعلومات في المؤسسات و الشركات بحيث يفهمهما و يقدرها المستخدم أو العميل و ذلك عن طريق صياغة ما تقدمه تكنولوجيا المعلومات و أقسام تكنولوجيا المعلومات على شكل خدمات</p><p>و تقدم الايتيل افضل الممارسات لادارة تكنولوجيا المعلومات بغض النظر عن التكنولوجيا المستخدمة مما يؤدي الى رفع الكفاءة و تحسين الجودة و خفض التكاليف فيما يخص عمل تكنولوجيا المعلومات<br></p><p>تم وضع مادة التدريب بناء على نموذج التدريب المعتمد للدورة التأسيسية و باستخدام قاموس مصطلحات و اختصارات الايتيل الرسمي للغة العربية مع ذكر المصطلحات الاجنبية جنبا الى جنب مع ترجمتها العربية. و تم اثراء المنهاج بالرسومات التوضيحية المتحركة للمساعدة في ايصال الأفكار<br></p>    <p>في نهاية كل قسم سنقوم بمراجعة الأفكار الرئيسية التي تم مناقشتها بهدف تعزيز الفهم بالاضافة الى اعطاء أمثلة عملية. كما سنقوم باستعراض نماذج من اسئلة و اجوبة الامتحان التأسيسي. </p><p><br></p>    <p>معكم علاء ياسين ابو حجلة. مدرب معتمد في تقديم دورات الايتيل.</p><p>This course covers the full curriculum of ITIL Foundation 2011 using the official Arabic glossary and is based on the official curriculum structure.<br></p>", 
    "end_date": null, 
    "title": "ITIL Foundation Arabic -  ايتيل بالعربي  اصدار 2011", 
    "price": "25.00", 
    "instructors": "Ala' Yasin Abuhijleh", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588400_edc6_5.jpg", 
    "course_url": "https://www.udemy.com/itil-foundation-2011-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T13:41:14Z"
}