{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t    The OSA &quot;lite&quot; course has been developed to give you an insight to the intermediate level OSA (Operational Support &amp; Analysis) of a service using Best Practice and the ITIL® Framework.  </p>  <p style=\"\">  \t    The target audience for this course are individuals who aspire to or who do manage services and want to learn how to better manage day to day operations of a service using Best Practice.  </p>  <p style=\"\">  \t    This course covers off on the first two modules of the full OSA course, as well as a clear high level overview of the remainder topics. You will be able to easily understand what the topics are included in the OSA course, and if the full OSA course is right for you. As the intermediate courses are long, and challenging and can cost up to $4000, you want to make an informed decision if this is right for you prior to spending that hard earned cash.</p>  <p style=\"\">  \t    There are four levels of certification within the scheme:  </p>  <ol style=\"\">  \t<li>Foundation - Receive 2 credit for passing exam (one course only)</li>  \t<li>Intermediate - Receive 3 credits for life cycle and 4 credits for capability courses (per course) (10 courses in total.)</li>  \t<li>Expert - To become an expert a MALC (Managing Across the Life Cycle) course is required which sits above the intermediate level. 17 Credits are required to sit this course.</li>  \t<li>Master - You are an ITIL® Master once you reach this level, only a handful in the wold hold this certification.</li>  </ol>  <p style=\"\">  \t    Successfully passing the Foundation exam is mandatory before you can progress to the intermediate courses, and to become an expert you will need a total of 22 credits.  </p>  <p style=\"\">  \t    ITIL® is supported by a comprehensive qualifications scheme, accredited training organisations, and implementation and assessment tools.  </p>  <ul style=\"\">  \t<li>Increase your chances of future employment</li>  \t<li>ITIL® is increasingly becoming the sought after qualification on job descriptions</li>  \t<li>A recent survey by Plexent (January 2012) showed that the average US salary for ITIL® related jobs was over $108,000 per annum</li>  </ul>  <p style=\"\">  \t    Please Note - This is NOT the ITIL® Intermediate (OSA) course and is not intended to help with the passing of the ITIL® intermediate Exam. IT is a high level overview ONLY. To qualify to sit the intermediate exam you will require a certificate of completion received from the ATO + submission of your foundation certificate.  </p>", 
    "end_date": null, 
    "title": "ITIL Intermediate: OSA Operational Support & Analysis \"Lite\"", 
    "price": "20.00", 
    "instructors": "Scott Tunn", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425678_1fc7_6.jpg", 
    "course_url": "https://www.udemy.com/itil-osa-lite/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T06:03:20Z"
}