{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Learn the technologies and concepts of\nnetworking in this complete course and earn your Juniper certification.</p><p><strong>Give your career a head start  in large scale Service Providers and Enterprise or simply make yourself\nmore knowledgeable.\n</strong></p><p>Basics of Networking</p><p>Juniper Devices Architecture<br></p><p>JNUOS Fundamentals<br></p><p>Design your own networks and implement Routing Protocols</p><p>Management of Juniper Devices<br>\n</p><p>If you happen to visit some of the major global Service Providers like BT, NTT, Optus or even Verizon you will be surprised to see the extent of Juniper devices deployed for their core services. Juniper is one of the leading Networking\nequipment provider with a large product portfolio ranging from small\nEnterprises to large Data Centers. <strong>JNCIA-Junos (JN0-102) is the fundamental certifications</strong> that Juniper offers to new learners that will help you in realizing the working of Juniper devices and their implementation.\n</p><p>This course has been <strong>designed for\nbeginner level IT Engineers</strong>. It will take you through the physical\ninstallation of the Juniper devices to the basic configurations to make network topologies for real world scenarios. This course will ensure\nthat you understand the dreaded <strong>concepts of subnetting</strong>. You will observe actual packets as they move through\nthe wires and make those “dots connect”. While configuring the\ndevices you will feel as if you are doing it yourself, its that close\nand personal. By following this course you will not only be able\nachieve your JNCIA-Junos certification but it will <strong>pave the\nfoundation for your other Juniper certification as well like JNCIP and JNCIE</strong>.</p>", 
    "end_date": null, 
    "title": "Juniper JNCIA-Junos (JN0-102) Complete", 
    "price": "30.00", 
    "instructors": "Ahmad Nadeem, Mehreen Kamran", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750920_4f84_2.jpg", 
    "course_url": "https://www.udemy.com/juniper-jncia-junos-jn0-102/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-03T06:05:56Z"
}