{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">First of all I want to state that this course is still in Progress. I will be adding on to this course beyond the RIP video. So hang in there.This is a course that starts off with some theory and then flows right in some fun. Configuring interfaces, setting up zones, filter routes, and setting up routing protocols. All of this is done on the Juniper command line. You are about to walk into a world which Juniper is no stranger to providing a powerful operating system that make their devices provide granular or simple tasks.</p><p style=\"\">By the time you are finished with this course, you will have the skills to be comfortable on JUNOS. But this does not happen over night. It takes practice and you need to spend the time practicing. I have taken the time to provide you with a course that helps you get familiar with the command line. </p><p style=\"\">I will be using real Juniper equipment with my lectures and there is a lots of time spent on the command line. That is correct, you will be seeing a lot of configurations. Lets face it, that is why you are here. You will learn how to configure IP addresses, set up zones, allow traffic into and between zones, static routing, routing protocols, route filtering, and so on. </p><p style=\"\">You can take for granted that you will find this course relaxing and a joy to follow. There is some boring things in the beginning, but when we start configuring, it just keeps going and going. Juniper is usually a device that others start with after having experience with other networking vendors. So you will need the basic skills in Network Fundamentals, IP addressing, TCP/IP, OSI Model, and Basic Communicated between two host. </p><p style=\"\">This is a course that is designed for one purpose....... To leave the course and gain the ability to configure a Juniper device. That is my goal and that is the mission of this course.</p>", 
    "end_date": null, 
    "title": "Juniper Basics", 
    "price": "50.00", 
    "instructors": "Kiel Martin", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529922_88a1_2.jpg", 
    "course_url": "https://www.udemy.com/juniper-basics/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T00:17:54Z"
}