{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>LATEST:</strong> Course Updated on 15th November 2015</p><p>Have over <strong>2400</strong> Students in 2 Courses (Checkpoint CCSA and Juniper JNCIA)</p><p><strong>Why should you </strong><strong>join this course?</strong></p><ul><li>Are you a Network engineer who wants to learn JUNOS as secondary skill? This course is for you.</li><li>Are you looking for opportunities in Networking domain and could not afford expensive courses? This Course is for you.</li><li>Juniper JUNOS is one of the Most Advanced Network OS in the world today.</li><li>Obtaining Juniper certification will enhance your networking career.</li></ul><p>Please - if you're looking for \"instant knowledge\" on JUNOS, don't take this course! You'll need to study the course and do as it shows for success. It will take you a week or so to understand and if you are completely new, it may take more time depending on your efforts. but if you are serious about learning JUNOS and ready to put extra efforts this course is for you. <strong>SUCCESS </strong>is not far away! It just require a bit dedication.</p><p><strong>What you will learn-</strong></p><p>After the completion of the Juniper JNCIA course, you should be able to understand:</p><ul><li>Junos OS Fundamentals</li><li>User Interfaces</li><li>Junos Configuration Basics</li><li>Monitoring and Maintenance</li><li>Routing Fundamentals</li><li><strong>Bonus-</strong>Learn to create your own LAB and Practice</li></ul><p><strong>Important-</strong></p><ul><li>The initial low price will increase shortly (you will not get JUNOS JNCIA certification course for this price anywhere that's Guaranteed)- the course is currently $29, but will soon increase to $69</li></ul><ul><li>You have unlimited lifetime access at no extra costs, ever.</li><li>All future additional lectures, bonuses, etc in this course are always free.</li><li>30 days money-back- guarantee. No questions will be asked.</li><li>My help is always available to you if you get stuck or have a question.</li></ul>", 
    "end_date": null, 
    "title": "Juniper JNCIA Made Easy: Complete JNCIA Course with LAB.", 
    "price": "20.00", 
    "instructors": "YP Singh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412416_a914.jpg", 
    "course_url": "https://www.udemy.com/juniper-jncia-certification/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T17:08:29Z"
}