{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Sam’s Courses have been taken over 30,000+ times by 20,000+ students all over the world. And now, he’s ready to help YOU!</strong></p>  <p>If you’re the type of person that doesn’t like to waste time, learn at a quick yet easy pace, and follow along with state of the art “Prezi” guides and voice overs, then boy do we have the course for you! The average amount of lecture time for a course like this is 10 hours, but ours is 2. It’s not less information. It’s just exactly what you need to know. </p>  <p>“<em>Coming from the mind of an industry expert with 20+ years of experience, Sam masterfully breaks down every last detail in a quick, easy to understand way. His teaching style is light and quick, and I just can’t make myself bored</em>” – Isaiah T. <strong>5 Stars</strong></p>  <p>“<em>This course makes CCNA topics like routing technologies and network device security as simple as possible. I really enjoyed it, and I will definitely being taking more of your courses.</em>” – Trever Eason <strong>5 Stars</strong></p>  <p>In fact, there’s mile long lists of people raving about our courses, and how much they love them, and we know you will too. </p>  <p>------------------------------------------------------------------------------------------------------------------</p>  <p>This course is packed with essential, need to know info that is useful for tests.  But most importantly, it gives you real world applications. There’s no reason to spend an additional 8 hours, following along as a boring, monotone voice reads off a pdf. Not when you can get this 2 hour, fast-paced work of art that keeps you on your toes and engaged the entire way through.</p>  <p>Sam has successfully helped 20,000 students  learn and understand various networking topics, and begin their journey on career success. Let’s make you 20,001! Enroll Today!</p>", 
    "end_date": null, 
    "title": "Juniper Network JNCIA OSPF", 
    "price": "20.00", 
    "instructors": "Sam Fitzgerald", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664740_9637_3.jpg", 
    "course_url": "https://www.udemy.com/networkingstepbystep-juniper-network-jncia-ospf/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T14:59:47Z"
}