{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>The importance of <b>six sigma in the field of healthcare</b> was understood after a lot of thought process. It was realized that patient care being hands-on, variance possibility will be larger than in any other process-driven industries. Even for a slightest of variance, the <b>data-driven approach of Six Sigma </b>can make a lot of difference by coming up with ample amount of measurable improvement.</p><p>Six Sigma works on five major principles: Define, Measure, Analyze, Improve and Control. Let us see how each of these process add value in the healthcare industry.</p><p>In the Define phase, we determine who are the patients, and what do they want. Also, we look into the capabilities of the process being measured. Finally, we get more clarity on what are our objectives. </p><p>Next is the Measure phase, in which we will look into what improvement looks like. We will also see on what data our efforts will be measured. Here is when the Metrics are used to define performance in a healthcare organization. It often include service level, service cost, patient satisfaction, and clinical excellence.</p><p>In the Analyze phase we collect data and analyze using proven tools.</p><p>In the Improve phase we will implement modifications to improve the process.</p><p>Finally it is the Control phase where performance to maintain improvement is monitored.</p> <p>There are a number of Hospitals that have successfully used SS in Healthcare including, Boston Medical Center, Mount Carmel Health System and Valley Baptist health System.</p><p>This course is intended to provide a practical understanding on the effective use of methodology and tools, to improve projects in a healthcare environment. Course highlights include examples, case studies and a sample project to reinforce and provide insight on the enhancements that are possible by implementing Lean Six Sigma. </p>", 
    "end_date": null, 
    "title": "Lean Six Sigma in Healthcare", 
    "price": "20.00", 
    "instructors": "Compaq learning", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441914_8685_3.jpg", 
    "course_url": "https://www.udemy.com/lean-six-sigma-in-healthcare/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T14:10:27Z"
}