{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong><em>The price of the course will be raised once more content is added, So join now and get the benefit.</em></strong></p><p><strong><em>This course will be updated regularly and Lectures will be added regularly.</em></strong></p><p><strong><em> Javascript, Jquery, php : Lectures will be added soon</em></strong></p><p><strong><em>JavaSript is added</em></strong></p><p>This course is not just about html5 and css3, it's about entire html and css which also includes html5 and css3. No need to learn prior version of html because we will start from the basic of html and css .</p><p>This course teaches everything from scratch, You will learn from basics tags in html and css first and then once you are comfortable with the basic tags which are common in previous version then we will advance to html5 and css3 and learn everything inside.</p><p>No need to have prior knowledge on html or any programming knowledge. This course starts from the very basic explaining you everything about html and starts from how to install the text editor to coding using basic tags then move on to the advanced topics in html5 and css3.</p><p>Once you complete this course you will learn how to build complete website using html5 and css3.</p><p><strong>HTML5</strong> is a core technology markup language of the Internet used for structuring and presenting content for the World Wide Web. As of October 2014 [update] this is the final and complete fifth revision of the HTML standard of the World Wide Web Consortium (W3C). The previous version, HTML 4, was standardised in 1997.</p>", 
    "end_date": null, 
    "title": "Learn HTML, CSS & JavaScript from scratch", 
    "price": "20.00", 
    "instructors": "DoEdu IT Educations", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452576_4262_4.jpg", 
    "course_url": "https://www.udemy.com/learn-complete-html5-and-css3-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T21:21:40Z"
}