{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong>About this course</strong>  </p>  <p>  \t                   Salesforce is an incredibly powerful on demand platform that allows people to customize their standard applications (Sales  &amp; Call Centre applications) and also build custom applications . While it can seem intimidating to someone with no background in coding, working with Salesforce is much easier than many realize. With the right guidance and desire to learn, most people can learn how to put together a functional web app in few days !  </p>  <p>  \t                   This Salesforce Tutorial Course is narrated by a long time trainer and consultant who specializes in helping people learn how to use technology to solve real world problems. In this high - impact course, Parikshith walks users through the creation of a functional application from beginning to end, explaining where needed the important technical points without relying on excessive jargon. This is not an overview of complex theory, but a hands- on primer that will allow even beginners to create usable solutions quickly !  </p>  <p>  \t                   Parikshith shows you how to make the most from these cloud technology used by everyone from small startups to the biggest technology companies in the world.  </p>  <p>  \t                   The Goal is help one acquire the knowledge and pass the DEV 401 (Salesforce Developer Exam). If you would like to know understand the different modules, Please watch my Introduction to Salesforce here.  </p>  <p>  \t                   There are no pre-requisites for this course</p>  <p>  \t<strong>Whats in this course</strong>  </p>  <ol>  \t<li>46 video lectures detailing the steps to becoming an awesome Salesforce Developer.</li>  \t<li>Downloadable Assignments &amp; Source Code files to compliment lectures.</li>  </ol>  <p>  \t            Note : Please turn on the HD at the right most corner of your video for better viewing experience .  </p>", 
    "end_date": null, 
    "title": "Learn Salesforce in easy steps and get certified!", 
    "price": "30.00", 
    "instructors": "Parikshith Red", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/18617_0041_6.jpg", 
    "course_url": "https://www.udemy.com/learn-salesforce-in-easy-steps-and-get-certified/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-27T07:03:07Z"
}