{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t<strong style=\"\">What is this course about? </strong>  </p>  <p>  \t   DNS or Domain Naming System is a mechanism for name resolution which is used worldwide in almost every type of networking environment. In this course I’ll be covering basic fundamentals of DNS and Name resolution. Gradually we’ll progress through advanced configuration of DNS and we’ll see how DNS can be integrated with Active Directory Directory Service or AD DS.   Proper designing the DNS infrastructure can solve most of the name resolution and security issue. You’ll learn how to secure the DNS and implement it for internal and external namespace. At last we’ll walk-through some troubleshooting tools to identify and troubleshoot name resolution issues.  </p>  <p>  \t<strong style=\"\">    What kind of materials are used?</strong>  </p>  <p>  \t    I’ve designed this course using Microsoft Official Curriculum (MOC), so this course will also prepare you for MS exam 70-411 as DNS is one of the topic covered in the exam. Training will be done through videos where you’ll find lectures and hands-on. I’ve also provided some hands-on and exercises based on real world scenario as supplementary materials.  </p>  <p>  \t<strong style=\"\">   What is the structure of the course?</strong>  </p>  <p>  \t   Course is divided into five sections, I’ll be starting from basic fundamentals of DNS and gradually moving toward core or advance configuration of DNS. Every lectures includes step by step hands-on.  </p>  <p>  \t<strong style=\"\">   Why take this Course? </strong>  </p>  <p>  \t   There are many reasons to take this course.  </p>  <ol style=\"\">  \t<li><span>This course is designed according to Microsoft Official Curriculum and taught by Microsoft Certified Trainer. </span></li>  \t<li><span></span><span> Knowing the understanding level of students whether they are beginner or advanced, this course is designed for all levels making it best fit for everyone. </span></li>  \t<li><span></span><span>Exercises and Hands-on provided as supplementary material is made keeping in mind the pattern of examination and application to the real-world scenario.</span></li>  </ol>", 
    "end_date": null, 
    "title": "Mastering DNS on Windows Server 2012 R2", 
    "price": "25.00", 
    "instructors": "Himanshu Rana", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394686_7fe3_4.jpg", 
    "course_url": "https://www.udemy.com/mastering-dns-on-windows-server-2012-r2/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-15T08:10:31Z"
}