{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Students who enroll in this course will learn the fundamentals of programming in vba as well as applying them in a smart way. The Excel VBA Tutorials are easy to follow and we create interesting and useful macros and learn vba programming during the lectures.</p>\n\n<p>I designed the course in a way which offers students with different excel vba knowledge the perfect environment to increase their skills and become proficient with one of the most important tools microsoft has to offer. We cover basics in VBA Code as well as sophisticated tasks. Moreover we create own vba macros / vba codes together.</p>\n\n\n\n\n\n<p>I use Excel 2013 but other versions of excel ( Excel 2010 VBA, Excel 2016 VBA, Excel 2007 VBA) could be used to. The course is structured in several lectures with almost 3 hours of valuable content. Any student can decide on his/her own how fast he or she wants to complete the course.</p>\n\n\n\n\n\n<p>Whether you want to work in the banking sector, in consulting, in an industrial company or as an entrepreneur - learn  how to program  in excel vba can be part of your entry ticket and this course offers the best way to hone your skills.</p>\n\n<p>If the course is not helpful to you than you can use a 30 day money back guarantee. But I promise you find what you are looking for. Let's learn Excel vba together.</p>\n\n<p>I am looking forward to working with you. See you in the first lecture.</p><p><br></p>", 
    "end_date": null, 
    "title": "Master excel vba –Yes, You can!", 
    "price": "20.00", 
    "instructors": "Daniel We", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578152_5a94_3.jpg", 
    "course_url": "https://www.udemy.com/masterexcelvba-yes-youcan/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T16:02:40Z"
}