{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Now is your chance to learn Microsoft SQL Server Integration Services (SSIS) with this extensive course that will give you the confidence and skills to use this Business Intelligence tool. It will be the golden ticket to your success in this industry. You will learn the basics about the development tools and what they are capable of, clear instruction on how to handle various issues that you might face when designing your packages and how to overcome them. By the end of this course you will understand many basic concepts and how to perform data integration and transformation. This course also includes the process of cleansing data and how to get the end result after applying different transformations. It also gives some real world scenarios that you might face and what salary to expect from working as an SSIS/ETL developer.</p>  By taking this course you will learn about:<ul style=\"\"><li style=\"\">Creating an Integration Services Project</li><li style=\"\">Basic SQL Server Data Tools features</li><li style=\"\">Creating Integration Services Tasks</li><li style=\"\">Creating connections to and from an Integration Services Package</li><li style=\"\">Writing data to a SQL Server database</li><li style=\"\">Executing a package from SQL Server Data Tools</li><li style=\"\">Creating a Foreach Loop and map Variables</li><li style=\"\">Controlling Data Flow for multiple Flat Files</li><li style=\"\">Changing a Flat File Connection using Expressions</li><li style=\"\">Changing command-line application arguments using Expressions</li><li style=\"\">Change Data Capture(CDC) database objects</li><li style=\"\">Preparing data for CDC and performing Incremental loading</li><li style=\"\">Most Familiar Data Transformations concepts</li></ul><p style=\"\">  \t  </p>", 
    "end_date": null, 
    "title": "Microsoft SQL Server Integration Services (SSIS) Training", 
    "price": "30.00", 
    "instructors": "Business Intelligence Guru", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425504_d376_2.jpg", 
    "course_url": "https://www.udemy.com/microsoft-ssis/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-18T00:50:59Z"
}