{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>In this course we will cover all the fundamentals of MPLS. We will be\ndiscussing why MPLS was implemented, the terminology used in an MPLS\nenvironment, the configurations used in MPLS, concentrating in using Layer 3\nVPNs.</p>\n\n<p>We will discuss the LDP protocol, what labels are and how they get forward\nit to other LDR Routers. Using the hands on lab we will get to see how these\nlabels get forwarded and we will be configuring multiple IGP routing protocols\nalong with BGP to get information across our network.</p>\n\n<p>We will be creating multiple types of VPNs and through the use for Route\nTargets and Route Reflectors, we'll demonstrate how packets can be manipulated\nin a particular direction.</p>\n\n<p>We will definitely be creating Provider Edge routers Customer Edge Routers\nand have customers within the same company communicate with each other and\ndifferent companies also be able to communicate with each other through VPN.</p>\n\n<p>We will also learn how to create VRF's in order to make all this possible,\nas well as understand the CEF, LFIB, LRIB and much more tables in order to\ntroubleshoot MPLS. </p><p><strong>DISCLAIMER:   </strong><strong>Please note that the simulators/emulators used in this course are not part of the course. It is the students responsibility to have these to practice with. The Cisco Packet Tracer and/or  VIRAL (Virtual Internet Routing Lab) are Cisco proprietary softwares and can only be obtained through Cisco. It is up to each student to obtain the simulator/emulator of their choice to study along with this course.</strong><br></p>", 
    "end_date": null, 
    "title": "MPLS Fundamentals: Cisco CCNP & Real World", 
    "price": "30.00", 
    "instructors": "Lazaro Diaz", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631746_33e4_2.jpg", 
    "course_url": "https://www.udemy.com/mpls-fundamentals-for-cisco-ccnp-real-world/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T21:32:06Z"
}