{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">  \t                            Did you know, that more than 85% of IT support roles <strong style=\"\">require a good foundation of networking concepts</strong>?  </p>  <p style=\"\">  \t                                  Microsoft Technology Associate (MTA) is <strong style=\"\">a recommended entry point</strong> into  IT certification. Pass just one exam and you’ll earn  a certification  </p>  <p style=\"\">  \t<strong style=\"\">What&#039;s more - pass the exam prepared by us and we will issue an awesome digital certificate of completion for you!</strong><br style=\"\">  </p>  <p style=\"\">  \t                                     The main benefit to earning a Microsoft Certification is that  it shows  potential employers/hiring managers that you have the  necessary  requirements and skills to be the perfect candidate for the  job.  </p>  <p style=\"\">  \t                        In this course you will learn <strong style=\"\">all you need to know to pass the exam</strong> and <strong style=\"\">apply your skills in the real world</strong> scenarios.  </p>  <ul style=\"\">  \t<li style=\"\">Overview of network topologies and concepts</li>  \t<li style=\"\">Routers and switches</li>  \t<li style=\"\">Wireless and access points</li>  \t<li style=\"\">Security, including firewalls and UTM</li>  \t<li style=\"\">Virtual Private Networks (VPN)</li>  \t<li style=\"\">Network protocols and services</li>  \t<li style=\"\">Basic subnetting</li>  \t<li style=\"\">Real world examples</li>  \t<li style=\"\">Remote support</li>  \t<li style=\"\">Quizzes to help you pass the exam</li>  </ul>  <p style=\"\">  \t                  The course is perfect for anyone who seeks to learn the fundamental of networking. Join now!  </p>  <p style=\"\">  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p style=\"\">  \t                        In over 5  hours of content including more than 30 lectures, this course covers  the basics of networking. Each chapter  closes with a quiz to make sure you can practice exam questions and test  your knowledge before moving to the next section.  </p>  <p style=\"\">  \t                        We  start by discussing LAN and WAN topologies, including Virtual Private Networks and security.  </p>  <p style=\"\">  \t                        There  is a section dedicated to network hardware, we talk about routers, switches, access points and firewalls - real network devices in action.  </p>  <p style=\"\">  \t                Basic subnetting lectures will allow students to understand IP addresses very well and move to more advanced topics without any problems.  </p>  <p style=\"\">  \t                        Students completing the course will have the  knowledge to create a network diagram and explain basic networking concepts without any problems. Thanks to some troubleshooting tools and tips it will be easier to apply the skills in real world situations.  </p>  <p style=\"\">  \t<strong style=\"\">Stand out from the crowd, learn the fundamentals networking and pass the MTA exam</strong>.  </p>", 
    "end_date": null, 
    "title": "MTA: Networking Fundamentals - Exam: Microsoft 98-366", 
    "price": "20.00", 
    "instructors": "Marious Kuriata", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325852_7bb3_4.jpg", 
    "course_url": "https://www.udemy.com/mta-networking-fundamentals-exam-microsoft-98-366/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T18:02:42Z"
}