{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Este curso es para aprender a <strong style=\"\">navegar </strong>en el sistema <strong style=\"\">SAP</strong>. Se dará un <em style=\"\"><strong style=\"\">acceso gratis</strong></em> de <em style=\"\">48 horas</em> al servidor privado de la Academia para que el usuario practique en un entorno real las herramientas aprendidas. Si estás interesado en iniciarte en SAP no dejes de inscribirte a este curso. Nuestro método combina la <strong style=\"\">teoría </strong>con la <strong style=\"\">práctica</strong>, por lo que es ideal para adquirir la <strong style=\"\">fluidez </strong>necesaria para manipular el sistema.</p><p style=\"\">En primer lugar aprenderemos las dos opciones que tenemos para navegar en el sistema SAP. Primero exploraremos la posibilidad de instalar el navegador <strong style=\"\">SAPGUI </strong>en la computadora personal, la cual es la opción que recomendamos. Luego veremos la otra opción que existe para navegar en el sistema, que es a través del navegador de internet ingresando a la página web del servidor de SAP. En este caso no será necesaria la instalación y configuración del SAPGUI.</p><p style=\"\">Luego aprenderemos qué significan los <strong style=\"\">datos técnicos</strong> que indica nuestro navegador, así como conceptos propios del sistema como el de <strong style=\"\">transacción </strong>y <strong style=\"\">modos</strong>. También aprenderemos a manipular las herramientas básicas del navegador, la administración de los <strong style=\"\">favoritos </strong>y significados de los <strong style=\"\">mensajes </strong>del sistema al usuario.</p><p style=\"\">El curso está compuesto centralmente por <em style=\"\">videos sencillos y didácticos</em> que explican como navegar en el sistema. También tenemos un equipo de consultores dispuestos a responder cualquier <strong style=\"\">consulta </strong>o duda que le surja a los usuarios.</p>", 
    "end_date": null, 
    "title": "Navegación general de SAP - Con acceso al servidor SAP", 
    "price": 0, 
    "instructors": "Jump To SAP Academy", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498976_9783_5.jpg", 
    "course_url": "https://www.udemy.com/navegacion-general-de-sap/", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T14:16:20Z"
}