{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  A CCNP VOICE professional has advanced knowledge of Cisco voice and telephony products including:</p><ul style=\"\"><li>Cisco Unified Communications Manager</li>  \t<li>Cisco Unified Communications Manager Express</li>  \t<li>Cisco Unity Connection</li>  \t<li>Cisco Unity Express</li>  \t<li>Cisco Unified Presence</li>  \t<li>Gateways</li>  </ul>  <p>The primary focus of this course is the applications that form part of a Unified Communications System, which include:</p>    <ul style=\"\">  \t<li>Cisco Unity Connection</li>  \t<li>Cisco Unity Express</li>  \t<li>VPIM</li>  \t<li>Digital Networking</li>  \t<li>Cisco Unified Presence</li>  </ul>  <p>Once you have a solid foundation in Cisco Unified Communications Manager and gateways, you can start to learn the applications that enhance Cisco Unified Communications.<br style=\"\">  <br style=\"\">  <span>The 642-467 exam tests a candidate’s knowledge of how to integrate the new Unified Communications Applications, which are part of the new version 8.0 Cisco Voice software.&nbsp;</span><br style=\"\">  </p>    <p><span>OUR FOCUS: Practical, hands-on demonstrations using the equipment. We don&#039;t just talk about a topic. We demonstrate it using multiple phones communicating with CUCM or CUME or Unity Connection etc. Watch the calls be set up, transferred, torn down and so forth in real time.</span><br style=\"\">  </p>    <p>This video course allows me to explain and demonstrate concepts in far greater detail than would be possible in a 5 day course. There isn&#039;t enough time to explain all the concepts properly in a standard instructor lead course. However, here I am able to do that. I have even added some additional content from the CVOICE course to explain and demonstrate more advanced concepts.</p>    <p class=\"PIN_1373053954162_hazClick\">Why pay $3,695 for an instructor lead course (with some companies) when you can get all the content here for $47?</p>    <p>And watch as many times as you like, watch on your iPad and even download all the videos!</p>    <p><span><br style=\"\">  </span></p>  ", 
    "end_date": null, 
    "title": "Pass the Cisco CAPPS 642-467 exam. Part of CCNP VOICE", 
    "price": "20.00", 
    "instructors": "David Bombal", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58580_a89d_7.jpg", 
    "course_url": "https://www.udemy.com/pass-the-cisco-capps-642-647-exam-part-of-ccnp-voice/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-06T13:02:46Z"
}