{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t     Take your CCNA certification to the next level by getting certified in the still greatly in demand area of Voice over IP.  </p>  <p>  \t       We don’t just browse over topics in our training, but provide detailed explanations and lots of hands on demonstrations.  </p>  <p>  \tPlease read the course reviews to see what customers thought about the course:  </p>  <p>  \t&quot;This is the most comprehensive CCNA Voice course on the market&quot;  </p>  <p>  \t  &quot;I have tried most of them: CBT Nuggets, IPexpert, Trainsignal and (and in my opinion) one of the worst on the market -&gt; INE but David&#039;s CCNA Voice is wonderful. It is very structured; to the point; with filled with a lot more Voice fundamentals than you need for the exam but very useful for the real-life experience. Thank you Dave for such comprehensive course.&quot;  </p>  <p>  \t  The main products the course covers are:  </p>  <p>  \t       ·  Cisco Unified Communications Manager (CUCM)  </p>  <p>  \t       ·  Cisco Unified Communications Manager Express (CUCME)  </p>  <p>  \t       ·  Cisco Unity Connection (CUC)  </p>  <p>  \t       ·  Cisco Unified Presence (CUP)  </p>  <p>  \t       We go into much more detail than the Cisco Certification exam with many real world examples and demonstrations.  </p>  <p>  \t       The course consists of over 33 videos and over 23 hours of video training. You can DOWNLOAD the videos.  </p>  <p>  \t       We have also added some bonus material to help you understand complicated voice topics.  </p>  <p>  \t       OUR FOCUS: Practical, hands-on demonstrations using the equipment. We don&#039;t just talk about a topic. We demonstrate it using multiple phones communicating with CUCM or CUME or Unity Connection etc. Watch the calls be set up, transferred, torn down and so forth in real time.  </p>  <p>  \t       I have taught this course live and the biggest issues are:  </p>  <p>  \t       1) Limited time.  </p>  <p>  \t       2) A great deal of content  </p>  <p>  \t       This video course allows me to explain and demonstrate concepts in far greater detail than would be possible in a 5 day course. There isn&#039;t enough time to explain all the concepts properly in a standard instructor lead course. However, here I am able to do that. I have even added some additional content from the CVOICE course to explain and demonstrate more advanced concepts.  </p>  <p>  \t       Why pay $3,695 for an instructor led course (with some companies) when you can get all the content here for $97?  </p>  <p>  \t       And watch as many times as you like, watch on your iPad and even download all the videos!  </p>", 
    "end_date": null, 
    "title": "Pass the Cisco CCNA Voice 640-461 exam (ICOMM) Downloadable", 
    "price": "20.00", 
    "instructors": "David Bombal", 
    "commitment": "24.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/57153_cd1a_11.jpg", 
    "course_url": "https://www.udemy.com/pass-the-cisco-ccna-voice-icomm-exam/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-29T20:19:36Z"
}