{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<ul>  \t<li>Preparing for the tough PMI-ACP Exam? </li>  \t<li>Concerned about the vast amount of information you need to remember for the exam?</li>  </ul>\n\n<p>  \t      Look no further! Take up this course and get the most definitive edge required to pass Project Management Institute’s Agile Certified Practitioner (PMI-ACP) exam!  </p>\n\n\n\n<p>  \t <strong><em> <br>  \tAbout the Course:</em></strong>  </p>\n\n\n\n<p>  \t<em><strong>  PMI-ACP Exam Practice Kit</strong></em> provides executives preparing for PMI-ACP Certification Examination with the Swiss army set of tools required to pass the demanding examination.  </p>\n\n\n\n<ul>  \t<li>Explains all the important / key concepts as detailed in the PMI-ACP Syllabus and the 11 exam reference books </li>  \t<li>Provides extensive test practice through simulated PMI-ACP style questions </li>  \t<li>Provides guidance on filling up the PMI-ACP application </li>  \t<li>Provides a cheat sheet of highly useful information required to pass the exam </li>  </ul>\n\n\n\n<p>  \t  <br>  \t <strong><em>Our Approach:</em></strong>  </p>\n\n\n\n<ul>  \t<li>Over 150 key concepts are presented in a talking flash card video, grouped by topics </li>  \t<li>Small practice tests in each topic help consolidate your understanding of the subject (130 practice questions) </li>  \t<li>TWO full length three-hour mock exam completely tests your understanding (total of 240 questions) with extensive explanation </li>  \t<li>Downloadable videos, eBooks and cheat sheet provide an offline study resource </li>  </ul>\n\n\n\n<p>  \t  <br>  \t <strong><em>How will you learn?</em></strong>  </p>\n\n\n\n<p>  \t      ProplanX uses a combination of instruction and interaction to engage with the students.  </p>\n\n\n\n<ul>  \t<li>You will learn using a combination of video and text based instruction </li>  \t<li>Your understanding of the topic is further consolidated through chapter based practice tests </li>  \t<li>Finally, you get to practice with two full length mock exams that also provide detailed explanation </li>  </ul>\n\n\n\n<p>  \t  <br>  \t <strong><em>Course Materials:</em></strong>  </p>\n\n\n\n<p>  \t      You have access to the following course materials:  </p>\n\n\n\n<ul>  \t<li>Downloadable videos and eBook for all topics </li>  \t<li>Detailed text based description for each topic</li>  \t<li>Practice questions (and answers) </li>  \t<li>Two full length PMI-ACP Practice Mock Tests (paid customers please write to info@proplanx.com for 30 day test access). </li>  </ul>\n\n\n\n<p>  \t  <br>  \t <strong><em>Study Duration:</em></strong>  </p>\n\n\n\n<p>  \t      You should expect to spend at least 11 hours, as detailed below:  </p>\n\n\n\n<ul>  \t<li>2 hours to study over 150 concepts  </li>  \t<li>3 hours for topic-wise practice tests (130 questions) </li>  \t<li>6 hours for two full length final exams (total 240 questions) </li>  </ul>\n\n\n\n<p>  \t  <br>  \t <strong><em>How to contact the Instructor?</em></strong>  </p>\n\n\n\n<p>  \t      Please write to info@proplanx.com for any questions or instructor assistance.   <br>  \t       You may expect a reply within 24 hours (conditions apply).  </p>", 
    "end_date": null, 
    "title": "PMI-ACP Exam Practice Kit", 
    "price": "20.00", 
    "instructors": "ProplanX  ", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/226026_c3aa_7.jpg", 
    "course_url": "https://www.udemy.com/pmi-acp-exam-practice-kit/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-22T10:21:23Z"
}