{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Feel the real power of <strong>Python </strong>and programming! The course offers you a unique approach of learning how to code by solving real world problems. Throughout the course we will be understanding how to identify and formulate the problems, what is the key to a great app, we will learn how to efficiently adopt the problem for the computer and the most important that you will be writing a lot of code! The course is structured in a way that lectures are like labs where we study the material, do the quizzes, write programs and test them! The most important that you will be involved into work a lot in order to get the best experience!<br></p>\n\n<p><strong>Python is one of top 5 programming languages today</strong>. If you want to pursue a career, this language is a must for you.</p>\n\n\n\n<p><strong>This course has been created for beginners.</strong></p>\n\n\n\n<p>You will start the training from the ground up and will get to know the python language and its potential in and out.</p>\n\n\n\n<p>In this Python for Beginners course, Instructor will teach you how to quickly write your first program in Python! You will also learn how to create custom modules and libraries</p>\n\n\n\n<p>Take this course now online Python course and master your skill!</p>\n\n\n\n<p><strong>ENROLL NOW</strong></p>", 
    "end_date": null, 
    "title": "Python Tutorial for Absolute Beginners ", 
    "price": "20.00", 
    "instructors": "Yogesh Patel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453144_590e_4.jpg", 
    "course_url": "https://www.udemy.com/python-crash-course-for-absolute-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T15:27:52Z"
}