{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Are you a QlikView systems administrator and in search of the most comprehensive QlikView training? Are you a QlikView developer who has been asked to manage QlikView server? Do you want a single stop QlikView server training to spruce up your skill? Or, has your company just purchased QlikView as new business discovery tool and you are the one responsible to install and configure server and publisher? </p>\n\n<p>If you answered \"Yes\" then this course is for you.</p>\n\n<p><strong><em>This course is all about mastering all aspects of QlikView server administration.</em></strong></p>\n\n<p><strong><em>This course requires no prior knowledge of QlikView administration.</em></strong></p>\n\n<p><strong><em>At Vertechs.io, we teach what we practice. Both of us -- Deepak Vadithala (DV) and Shilpan Patel -- have been working in the trenches and have crafted this course with practical ideas that you can put to work immediately.</em></strong></p>\n\n<p><strong>You Will Learn:</strong></p>\n\n<ul><li>What is QlikView? How it differs from other business intelligence tools and various QlikView components.</li><li>Various types of QlikView deployments and how to choose the appropriate deployment for your organization.</li><li>Various QlikView development methodologies with Pros and Cons.</li><li>In depth overview of various QlikView services.</li><li>Step by step how to install and configure QlikView server and publisher components.</li><li>How to implement document administration for your enterprise.</li><li>In depth dive into various QlikView logs</li><li>How to create tasks in QlikView Management Console</li><li>Practical examples of QlikView administration issues and troubleshooting</li><li>Detail overview of various QlikView licenses.</li></ul>\n\n<p>This course  will guide you every step of the way to master various aspects of QlikView administration.</p>\n\n<p>And it comes with 30 day money back guarantee!</p>\n\n<p><strong><em>Please contact us directly for any coupon/discount requests.</em></strong><br></p>\n\n<p><em>We also contribute to charity that inspires underprivileged kids to learn.</em></p>\n\n<p><strong><em>So, what are you waiting for? Enroll today and start journey to master QlikView administration now.</em></strong></p>\n\n<p><em></em><br></p>", 
    "end_date": null, 
    "title": "QlikView Server and Publisher", 
    "price": "50.00", 
    "instructors": "Vertechs .IO, Shilpan Patel", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/522140_305c_4.jpg", 
    "course_url": "https://www.udemy.com/qlikview-server-and-publisher/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-06T19:22:16Z"
}