{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>!! OVER 650 STUDENTS HAVE ALREADY ENROLLED IN THIS COURSE !!</strong></p>\n\n<p>Recent 5 Star Reviews &amp; Comments : </p>\n\n\n\n<p><em><strong>!!Easy to understand and easy to make progress for first timers.!!</strong></em></p>\n\n\n\n<p><em><strong>!! very good for salesforce course. I like his content to cover almost every aspects. Thanks for your good effort.!!</strong></em></p>\n\n\n\n<p>Easiest and Simplest walk through covering Salesforce Development &amp; Administration Topics.<br></p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p>You don't need any programming experience and you don't need to know anything about Salesforce. You'll learn the ins and outs of point-and-click development,Administration, Coding and Analytics. so, all you need now is an interest in learning Salesforce</p>\n\n\n\n<p>This course covers all aspects of <strong>Salesforce Development &amp; Administration</strong>. You'll learn how to Create App, Objects, Profiles, setting up Security, Workflows, Visualforce page, Apex coding, Triggers , reporting and analytics etc.</p>\n\n\n\n<p>The course teaches all these in an effective manner that will aid your learning in the best way.</p>\n\n\n\n<p>If Salesforce Development and Administration is what you seek, then look no further! Enroll now and begin your journey of Salesforce! </p>\n\n\n\n<p>This course will equip you with comprehensive knowledge that helps you get certified.</p>", 
    "end_date": null, 
    "title": "Salesforce Development & Administration for Beginners", 
    "price": "20.00", 
    "instructors": "Aslam Tayyab", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508228_5b91_4.jpg", 
    "course_url": "https://www.udemy.com/salesforce-development-and-administration-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T17:07:49Z"
}