{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>All researches reveal just one thing - Demand for Salesforce Developers far exceeds supply. As a result, Salesforce Developers are calling the shots. Raking in multiple job offers for both full-time and contracting opportunities, Salesforce Developers are dictating pay and a range of perks from employers who are uber-eager for the talent. There has never been a better time to become a Salesforce Developer.</p><p>Whether you're a brand-new or experienced Developer, get the core knowledge you need to get up to speed, perform at your best, and get the most out of Salesforce. This program is a must for application and Salesforce developers who want to create custom Force applications or customize existing Salesforce applications.</p><p>This course contains basic &amp; advanced instructions of Salesforce Programming covering VisualForce Designing with Standard and Custom Controller, Triggers, SOQL language etc</p><p>While it can seem intimidating to someone with no background in coding, working with Salesforce is much easier than many realize. With the right guidance and desire to learn, most people have become proficient in no time after taking this course.</p><p>Note: This course comes with lifetime access and will be updated regularly as per latest release of Salesforce and all future upgrades are free for existing subscribers.<br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Salesforce Programming Step by Step for Beginners", 
    "price": "20.00", 
    "instructors": "Prateek Singh", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584350_4669_4.jpg", 
    "course_url": "https://www.udemy.com/complete-salesforce-training-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-16T07:53:48Z"
}