{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Salesforce is a customer relationship management software (CRM)...In this course I am trying my best to answer all the questions that generally people ask...This course gives you a quick glimpse about salesforce and I highly recommend to take this course if you are planning on changing your career and want to know about your options.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">What skills you need to become salesforce adminstrator?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I get asked this question a lot. Many people are looking to make a career change, and there is concern that they don’t have the experience or background to become a successful Salesforce Administrator.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Salesforce is a tool, you can easily learn this tool. Just like you have learned to use playstation and  how to operate computer, you can learn this tool as well.To learn about Salesforce, you don't need to be a programmer. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>A Salesforce Administrator is a expert in business processes. Administrators work closely with business stakeholders to learn and understand issues happening in current system or to gather requirements for new changes or enhancements. The skill needed to become Salesforce Administrator is to know how to take those process requirements and implement them successfully in Salesforce.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>There are some characteristics that successful Salesforce Administrators should possess. But the really good Salesforce Administrators have the following characteristics.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Ability to listen and empathize with users</strong>: This is a “customer facing” role. Users of the application are your customers. They deserve great customer service. If you have the ability to listen and learn about their problems, issues, and needs, and also you want to really help them out, then this field is great fit for you.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Good communication skills:</strong> Communication is very important. Salesforce administrator needs to be a good listener as well as good communicator. This role tends to work with individuals at all levels; from the CEO of the company  to the end user. Knowing how to communicate effectively with each at each level will help you to get your job done faster and efficiently.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Ability to think outside the box:</strong> There is not a set way to do anything in Salesforce. That’s part of the beauty of the tool. That also means that for any one process or set of requirements, there are multiple solutions. You’ll need to think outside the box to ensure that all possibilities are captured and that the needs of the business are being met. This requires creative and critical thinking.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Should I become an Administrator or Developer?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Another common question is,</strong> should I become an Administrator or Developer?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This question is hard to answer because everyone is different. But, there is some basic information I can provide that may help you make a decision.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Administrators <em>job is more customer-facing : </em></strong>Salesforce adminstrators deals with  the business directly on a more regular basis. This requires a different skill set as a result. Administrators focus on out of box features <strong class=\"redactor-inline-converted\">(meaning we develop with clicks, not code). They need to know about the out -of-the box features of salesforce.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Developers need to be a programmer who knows coding:</strong> While they do work directly with business users and stakeholders, they tend to operate more in the background; working more closely with the Administrator than the internal customer.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Is certification important?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I was tempted to answer this in one word – yes – but I though that might be a bit biasé. If you’re relying on Salesforce for running your business, you  should make the investment in a Certified Administrator. Its always great  to find someone who took time to learn the tool and prepared for the certification. It also depends on the size of the company and the strategic value of Salesforce for that company. The more customization, complexity and number of users involved, the more your administrator needs to be a well-versed Salesforce rockstar, and certification helps to find out which candidate is suitable for the job. So many companies are looking for someone with certification and a certified administrator will have more chances of getting that job.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>If you want to become salesforce Developer, it is still recommended that you learn Salesforce as an Administrator.</strong> Ideally, you should not write code  for something that can be done using the out of the box features of salesforce. The only way to know what can and can’t be done with the platform is to learn about its features. The best developers will also validate this fact.</p>\n\n\n\n\n\n\n\n<p>TAKE THIS COURSE IF YOU WANT TO KNOW ABOUT SALESFORCE  AND WHAT SALESFORCE OFFERS YOU...WHAT IS THE RIGHT PATH FOR YOUR CAREER....ENROLL NOW..</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Salesforce Introductory Course and Career Planning", 
    "price": 0, 
    "instructors": "Deepika Khanna", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/840108_14db_3.jpg", 
    "course_url": "https://www.udemy.com/salesforce-certification1/", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-05T04:12:49Z"
}