{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t                      Learn the basic concepts, tools, and functions that you will need to build fully functional Knowledge with SAP PRODUCT COSTING.  </p>  <p>  \t<strong style=\"\">Note this course is part-1 of SAP Product Costing Series, It will have multiple courses add in in future series. Each time a new course is added to the series the price will increase. I have planned to add at least 5 more courses to the series.</strong></p>  <p>  \t<strong style=\"\">1-SAP CO-PC Overview (Live)</strong>  </p>  <p>  \t<strong style=\"\">2-Planning and Preparation (Live) (Added on 02/23/204)</strong>  </p>  <p><br style=\"\"></p>  <p>  \t<strong style=\"\">Build a strong foundation in SAP Product Costing and Costing process with this tutorial for beginners and all levels</strong>  </p>  <p>  \t                      ·Concepts of SAP Product Costing  </p>  <p>  \t                      ·SAP Product costing use in Real World  </p>  <p>  \t                      ·Build solid foundation for SAP Product Costing Consultant  </p>  <p>  \t<strong style=\"\">Build Skills as You Go </strong><br style=\"\">  \t                       Learning the fundamentals of SAP Product Costing Builds a powerful skills as you go. SAP Product Costing is free, easy to learn, has excellent documentation, and is the base for all Functional-oriented Concept with Configuration.  </p>  <p>  \t                      Jobs in SAP Product Costing are plentiful, and being able to learn SAP Product Costing will give you a strong background to more easily pick up other SAP FICO sub modules like Material Ledger and  CO-PA.  </p>  <p>  \t<strong style=\"\">Content and Overview </strong><br style=\"\">  \t<br style=\"\">  \t                       Suitable for New SAP Consultants, Experienced SAP FI Consultants trough this course several hours of content, you&#039;ll learn all of the SAP Product Costing fundamentals, Experts tips, Configuration and establish a strong understanding of the concept behind costing related process. Each chapter closes with Demo and exercises, putting your new learned skills into practical use immediately.  </p>  <p>  \t                      Starting with the concept of the SAP Product Costing, this course will take you through SAP Product Costing Overview and how to use them.  </p>  <p>  \t                      Students completing the course will have the knowledge to configure SAP Product Costing .You will able to articulate SAP CO-PC and its various usage.  </p>  <p>  \t                       You&#039;ll be able to work alongside the author as you work through each concept, and will receive a verifiable certificate of completion upon finishing the course.  </p>", 
    "end_date": null, 
    "title": "SAP Product Costing Part 1- Overview,Planning & Preparation", 
    "price": "25.00", 
    "instructors": "MiYug E-Learnings", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413721_ecc8_3.jpg", 
    "course_url": "https://www.udemy.com/sap-product-costing/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T02:00:53Z"
}