{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "Learn the basic concepts, tools, and functions that you will need to build fully functional Knowledge with SAP FICO.  Build a strong foundation in SAP Controlling and Costing process with this tutorial for beginners and all levels  •\tConcepts of SAP Controlling  •\tConfiguration and its usage   •\tSAP costing use in Real World  •\tInformation System and Reporting  •\tOverhead Management and Cost Center Accounting  •\tA must pre Requisite to COPC and COPA  •\tBuild solid foundation for SAP Controlling Consultant  Build Skills as You Go   Learning the fundamentals of SAP Controlling Builds a powerful skills as you go.. SAP Controlling is free, easy to learn, has excellent documentation, and is the base for all Functional-oriented Concept with Configuration.  Jobs in SAP Controlling are plentiful, and being able to learn SAP Controlling will give you a strong background to more easily pick up other FICO sub modules like Product Costing and CO-PA.  Content and Overview     Suitable for New SAP Consultants, Experienced SAP FI Consultants trough this course of 14 lectures and 2,5 hours of content, you’ll learn all of the SAP Controlling fundamentals and establish a strong understanding of the concept behind costing related process. Each chapter closes with Demo and exercises, putting your new learned skills into practical use immediately.  Starting with the concept of the SAP Controlling, this course will take you through SAP Controlling Overhead management, Cost Center Accounting, Internal Orders Cost Allocation, and how to use them. By creating Cost Planning and Posting of actual Costs, you’ll a establish a strong understanding of Cost Center Accounting..  With these basics Concept, the course will take you through structured flow by teaching you how to set up master data for cost centers, internal orders. while loops, and conditional if-else statements to add complexity and functionality to your programs.  Students completing the course will have the knowledge to configure SAP controlling area, Cost Center accounting also understand different situation scenarios of configuration. You will able to articulate cost center planning and its various usage.   You’ll be able to work alongside the author as you work through each concept, and will receive a verifiable certificate of completion upon finishing the course  ", 
    "end_date": null, 
    "title": "SAP Controlling", 
    "price": "25.00", 
    "instructors": "MiYug E-Learnings", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386798_a62f_5.jpg", 
    "course_url": "https://www.udemy.com/sap-controlling-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-06T16:30:40Z"
}