{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>En este curso se aprenderán las principales funcionalidades y transacciones del módulo de <strong>Finanzas</strong> del sistema <strong>SAP</strong>. Además. este curso provee <strong>acceso al servidor</strong> privado de la Academia por un período de <strong>3 días</strong> una vez inscripto al curso.</p><p>De esta manera, el usuario además de comprender la teoría del sistema SAP, podrá adquirir <strong>experiencia </strong>en el uso del sistema practicando las transacciones en un servidor de prueba. El usuario tendrá acceso a las <strong>más de 65 transacciones</strong> que están incluídas en el índice de este curso.</p><p>Este curso se encuentra <em>dividido en 3 partes</em>, correspondientes a los submódulos de Finanzas que serán estudiados. Esos submódulos son <strong>Libro Mayor</strong>, <strong>Cuentas a Pagar</strong> y <strong>Cuentas a Cobrar</strong>.</p><p>Este curso tiene una duración aproximada de <strong>dos semanas</strong>. Es una gran oportunidad para aprender SAP interactuando con el sistema en un <strong>entorno real</strong>. Ya que en el mundo laboral las empresas valoran la experiencia <strong>práctica</strong> de SAP, además de los conocimientos teóricos.</p><p>En primer lugar, realizaremos una introducción al módulo de <strong>Libro Mayor</strong>, donde abordaremos sus principales funcionalidades y aprenderemos el concepto de <strong>Plan de Cuentas</strong>. Luego, exploraremos las características de integración del Libro mayor con otros módulos del sistema SAP, así como el proceso para realizar <strong>cierres</strong> contables mensuales y anuales.</p><p>Luego, profundizaremos sobre la estructura organizativa en SAP. Esto es de vital importancia a la hora de comprender y manejar con naturalidad los registros de <strong>datos maestros</strong>. El paso siguiente será explorar las distintas variantes de <strong>monedas</strong> en SAP. Para finalizar el abordaje del módulo GL de SAP, aprenderemos a utilizar las herramientas de <strong>reportes</strong> de libro mayor.</p><p>Una vez finalizado el módulo de Libro Mayor, comenzaremos a conocer el módulo <strong>Cuentas a Pagar</strong>, correspondiente a la contabilidad de <strong>Acreedores</strong>. Realizaremos una introducción al módulo, luego profundizaremos sobre el registro de datos maestros de acreedores y sobre el concepto de <strong>grupo de cuentas</strong>. Luego aprenderemos a realizar <strong>registraciones</strong> contables y <strong>pagos</strong> a acreedores mediante las transacciones SAP. Por último, exploraremos las herramientas de reportes que ofrece el módulo Cuentas a Pagar.</p><p>El último módulo que estudiaremos será el correspondiente a la contabilidad de <strong>Deudores</strong>, denominado <strong>Cuentas a Cobrar</strong>. En esta ocasión comenzaremos con una introducción al módulo, luego aprenderemos a administrar los registros maestros de clientes, a realizar registraciones contables y a efectuar <strong>cobranzas</strong>. Por último conoceremos las herramientas de <strong>reportes</strong> de la contabilidad de deudores. </p>", 
    "end_date": null, 
    "title": "SAP FI - Finanzas - Con acceso al servidor SAP", 
    "price": "30.00", 
    "instructors": "Jump To SAP Academy", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512114_6f2e_3.jpg", 
    "course_url": "https://www.udemy.com/sap-fi-finanzas/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T19:20:19Z"
}