{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>En SAP<em><strong>ñ</strong></em> creemos firmente en ser mejores día a día y con nuestro trabajo estamos seguros que logramos el objetivo central que nos hemos planteado y que es ayudar a que cada uno de los estudiantes de nuestros cursos amplíen su conocimiento del sistema y puedan así tener la confianza de crecer personal y profesionalmente de una manera acelerada.</p>\n\n<p>Así que deseamos felicitarte ya que si te encuentras leyendo este texto es debido a que estás considerando  aprender más acerca del sistema SAP. Incluso puede que estés considerando cambiar de trabajo con todos los beneficios y retos que eso implica y aunque pudiera parecer una tarea enorme nosotros hemos creado este curso con la mayor dedicación posible para que tu aprendizaje sea óptimo.</p>\n\n<p>Siempre te ha llamado la atención saber del sistema SAP pero no te habías dado la oportunidad por los altos <strong>costos </strong>o la falta de <strong>tiempo </strong>para desplazarte a los lugares donde se imparten los cursos.</p>\n\n<p>Contactanos <strong>lo más pronto posible</strong> para que recibas información que en un instante te convencerá de tomar el curso y darle un giro a tu vida.</p>\n\n<p>Estás interesado en saber qué es SAP y entender por qué las personas que saben utilizarlo están consiguiendo todas las vacantes en las mejores empresas y los mayores aumentos de sueldo.</p>\n\n<p>En SAP<em><strong>ñ</strong></em> estamos comprometidos a ayudarte y continuamente liberamos cursos para que nuestros estudiantes aprendan todo lo más relevante de este sistema y puedan crecer laboralmente siempre obteniendo mejores puestos.</p>\n\n<p>En nuestros cursos, a diferencia de otros que puedes encontrar en la plataforma, siempre explicaremos un concepto y lo demostraremos de forma práctica en el sistema.</p>\n\n<p>Inscribete ya y obten acceso a las clases para que aprendas a tu ritmo, en los horarios que más te convengan y sin perder tiempo por tener que desplazarte a ningún aula.</p>", 
    "end_date": null, 
    "title": "SAP FI & TR Obten la información que necesitas a tiempo", 
    "price": "50.00", 
    "instructors": "Sap Entuidioma", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/798608_56ee.jpg", 
    "course_url": "https://www.udemy.com/sap-fi-tr-obten-la-informacion-que-necesitas-a-tiempo/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-20T05:32:05Z"
}