{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>This course <strong>“</strong><strong>SAS programming on Data Manipulation Part II Modify Datasets</strong><strong>” </strong>is the second course for SAS programming on Data Manipulation.</p>\n\n<p><strong></strong></p>\n\n<p>SAS Base and data manipulation programming skills are highly demanded in the SAS/data industries. This course can also help prepare you for <strong>the SAS Base Programming Certification Exam</strong>.</p>\n\n<p>This course is at the beginner to intermediate level. It is designed to help you master SAS Base programming essentials on data manipulation focusing on datasets merging, combining, transforming, etc. My previous course is on data manipulation focusing on modifying variables. These two courses are designed to help you master essential SAS programming skills on data manipulation.</p>\n\n<p>As the same as my other SAS programming courses, this course utilizes hands-on coding in SAS programming environment as well as detailed step-by-step explanations to make your learning easy and fast.</p>\n\n<p>This course was created using <strong>the SAS University Edition</strong> (The free SAS programming environment provided by SAS). The SAS code and data are compatible across all SAS programming environments.</p><p>This course has</p>\n\n<ul><li>16 lectures</li><li>Each lecture shows hands-on coding in SAS programming environment as well as detailed step-by-step explanations</li><li>The course supplements (including SAS codes and data used in lectures) are easy downloadable for your own practice.</li></ul><p><br></p><p>References:</p>\n\n<p>SAS certification prep guide: base programming by SAS Institute</p>\n\n<p>The little SAS book: a primer / Lora D. Delwiche and Susan J. Slaughter</p>\n\n<p>Learning SAS by example: a programmer's guide / Ron Cody </p>\n\n<p>SAS 9.4 SQL procedure user's guide by SAS Institute</p>\n\n<p>SAS certification prep guide: advanced programming for SAS 9 by SAS Institute</p><p>\n\n\n\n</p><p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "SAS Programming on Data Manipulation Part II Modify Datasets", 
    "price": "20.00", 
    "instructors": "Sharon Cheng", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686740_26fc_4.jpg", 
    "course_url": "https://www.udemy.com/sas-programming-on-data-manipulation-part-ii-modify-datasets/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T04:54:09Z"
}