{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Do you want to start learning SAS easily and quickly? You have come to the right place! SAS programming for beginners is a SAS entry level course, which is designed to show you how to write SAS programs step by step from the start. SAS programming skill is highly demanded and rewarded in many fields. This course is for students who want to learn SAS and pursue career in related fields, as well as for professionals who want to equip themselves with this new skill to broaden their career path or bring it to the next level. </p>\n\n<p>This course was created using<strong> the SAS University Edition</strong> (The free SAS programming environment provided by SAS). The SAS code and data are compatible across all SAS programming environments.</p>\n\n<p>This course has</p>\n\n<ul><li>Over 21 lectures and 3 hours of contents </li><li>Essential SAS Data Step and Proc Step programming examples</li><li>Each lecture shows hands-on coding in SAS programming environment as well as detailed step-by-step explanations</li><li>The course supplements (including SAS codes and data used in lectures) are easy downloadable for your own practice. </li></ul><p><br></p><p>References:</p><p>SAS certification prep guide: base programming by SAS Institute</p>\n\n<p>The little SAS book: a primer / Lora D. Delwiche and Susan J. Slaughter</p>\n\n<p>Learning SAS by example: a programmer's guide / Ron Cody </p>", 
    "end_date": null, 
    "title": "SAS programming for beginners", 
    "price": "20.00", 
    "instructors": "Sharon Cheng", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530022_dbc8_3.jpg", 
    "course_url": "https://www.udemy.com/sas-programming-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T03:54:42Z"
}