{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Do you already have some basic SAS programming knowledge\nand want to learn more about SAS programming? Do you want to enter the highly\ndemanded SAS/data industry and become a SAS programing professional? If you\nanswer yes, then <strong>“<strong>SAS Programming on\nData Manipulation Part I Modify Variables</strong>” </strong>is the right\ncourse for you!<strong></strong></p>\n\n<p>SAS Base and data manipulation programming skills are highly\ndemanded in the SAS/data industries. <strong>This course can also help prepare you for SAS\nBase Programming Certification Exam.</strong><br></p>\n\n<p>This course is at the beginner to intermediate level. It is designed to help you master SAS Base Programming Essentials on Data Manipulation Focusing on Variables (my next coming course will be focusing on data sets modifications including data merging, combining, transforming, etc. ). As the same as my course ‘SAS programming for beginners’, this course utilizes hands-on coding in SAS programming environment as well as detailed step-by-step explanations to make your learning easy and fast.</p>\n\n<p>This course was created using<strong> the SAS University Edition</strong> (The free SAS programming environment provided by SAS). The SAS code and data are compatible across all SAS programming environments.</p>\n\n<p>This course has</p>\n\n<ul><li>25 lectures </li><li>Each lecture shows hands-on coding in SAS programming environment as well as detailed step-by-step explanations</li><li>The course supplements (including SAS codes and data used in lectures) are easy downloadable for your own practice.</li></ul><p><br></p><p>References:</p><p>SAS certification prep guide: base programming by SAS Institute</p>\n\n<p>The little SAS book: a primer / Lora D. Delwiche and Susan J. Slaughter</p>\n\n<p>Learning SAS by example: a programmer's guide / Ron Cody </p>", 
    "end_date": null, 
    "title": "SAS Programming on Data Manipulation Part I Modify Variables", 
    "price": "20.00", 
    "instructors": "Sharon Cheng", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616854_b77d_3.jpg", 
    "course_url": "https://www.udemy.com/sas-base-programming-essentials-on-data-manipulation/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T21:03:34Z"
}