{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Sensu</strong> is a powerful Next-Generation monitoring framework that is quickly\nreplacing traditional monitoring systems like Zabbix, Icinga, and Nagios.</p>\n<p>More than just a beginner Sensu user? Ready to learn more?</p>\n<p>This <strong>intermediate</strong> course will teach you the things you\nneed to setup Sensu in <strong><em>Production</em></strong>.</p>\n<p><strong>Contents</strong></p>\n<ul>\n<li>Realtime whiteboard interaction - learn like you would if I was right in front of you</li>\n<li>In-depth architecture overview and recap</li>\n<li>Deploy and configure Sensu with Configuration Management - I fully cover Chef / Puppet / Ansible / Salt</li>\n<li>Tune and Filter noisy alerts, keep your pager under control</li>\n<li>Write your own Sensu Check and Handlers - Live code demonstration</li>\n<li>Security walkthrough - deploying SSL, hardening API endpoints</li>\n<li>Advanced Sensu-cli usage and examples</li>\n<li>Bonus: Dynamically monitoring infrastructure by pushing your own custom events</li>\n<li>Extensive show-notes, vagrant images, and source code is open-source and on Github</li>\n</ul>\n<p>When you are finished with the course, you will be ready to deploy a\nperformant, secure, and tuned Sensu installation for your organization.</p>\n<p><strong>Let Me Make The Mistakes For You</strong></p>\n<p>It's one thing to read docs and get perfect copy-paste command line examples\nthat work. It is another thing to be in real life watching a real engineer\nfight a live system and try to get it working! I purposely make mistakes\njust to demonstrate what happens when things go wrong. That gives me an\nexcuse to troubleshoot the problem and then solve it. Then, when you encounter\nthat same mistake in your infrastructure, you will know exactly what to do!</p>\n<p><strong>For Dev and Ops Alike</strong></p>\n<p>Sysadmins, Devops Practitioners, Infrastructure engineers, SREs, and simply\ncurious software engineers should take this course to better their craft and\nlearn more about what makes Sensu special. It is <strong>not</strong> your\ngrandfather's monitoring system. It is a modern, scalable, flexible\nmonitoring system with a great API to integrate with your infrastructure.</p>\n<p>This course is a <strong>must</strong> for engineers who are currently, or considering\ndeploying Sensu intro production. Increasing the scope of your DevOps\ntoolbox, enroll today and check it out!</p>", 
    "end_date": null, 
    "title": "Sensu - Intermediate", 
    "price": "20.00", 
    "instructors": "Kyle Anderson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559976_042c_3.jpg", 
    "course_url": "https://www.udemy.com/sensu-intermediate/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T03:07:13Z"
}