{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t          This program is designed for Software Quality Control and Assurance Manager, Project Manager and Software Development Team Member who is interested in increasing the likelihood of project success. The course looks at software quality control and assurance processes and practices, as well as support disciplines such as software project management, software configuration management and release management. Successful software quality assurance is the result of the combination and integration of these practices, and complements SE practices.</p>  <p>  \t          Topics include:  </p>  <ul style=\"\">  \t<li>Success, Reflections, Terms and Concepts</li>  \t<li>Competencies, Standards, Software Lifecycle Models, Software Quality Assurance</li>  \t<li>Software Project Management, Adoption of PM Practices</li>  \t<li>Reviews and Inspections, Software Testing, Testing Effort, Advances in Testing</li>  \t<li>Software Quality as a Profession</li>  \t<li>Metrics and Analysis, Software Configuration Management</li>  \t<li>Release Management</li>  </ul>  <p>  \t<strong style=\"\">Video Duration Time:</strong> 6 Hours 31 Minutes and 11 Seconds  </p>  <p>  \t          Click on the Promo Video to view the introduction of the &quot;Software Quality Assurance&quot; learning video.</p><p>There are 18 well organized, high impact yet easy to follow Lectures. A test for Software Quality Assurance Certification is available upon finishing the course. </p>  <p>  \tContact Us for more information and licensing options.  </p>", 
    "end_date": null, 
    "title": "Software Quality Assurance", 
    "price": "20.00", 
    "instructors": "Michael Cesino", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341348_12f5_5.jpg", 
    "course_url": "https://www.udemy.com/software-quality-assurance/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T12:54:53Z"
}