{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Welcome To The Complete Linux LPIC-1 Certification Course Exams 101-102</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">⇉ Watch the promo video </strong>to see How You Can Pass The Linux LPIC-1 Certification Examinations! (101 &amp; 102) </p>\n\n<p><strong class=\"redactor-inline-converted\">⇉ This Course is MASSIVE! </strong>You receive over<strong class=\"redactor-inline-converted\"> 18+ hours of video</strong> content &amp; <strong class=\"redactor-inline-converted\">60</strong><strong class=\"redactor-inline-converted\">+ lectures!</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">⇉ Join Over 100,000+</strong> <strong class=\"redactor-inline-converted\">Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n<p><strong class=\"redactor-inline-converted\">⇉ 2500+ Five Star Reviews Shows</strong> Students Who Enrolling Are Getting Real Results!</p>\n\n<p><em>__________________________________________________________________________</em></p><p><strong>Why should you learn Linux? <br></strong></p>\n\n<p>Linux is a fast-growing operating system, it is <strong class=\"redactor-inline-converted\">inexpen</strong><strong class=\"redactor-inline-converted\">sive and highly flexible</strong>. Almost all the key organizations in IT industry including Google<strong class=\"redactor-inline-converted\"> use variations of Linux</strong> to power their servers. Linux is also a major player in the small and mid-sized server field, and it’s an increasingly viable platform for workstation and desktop use as well. By understanding Linux, you’ll <strong class=\"redactor-inline-converted\">increase your standing in the job market</strong>. Even if you already know Windows or Mac OS and your employer uses these systems exclusively, understanding Linux will give you an edge when you’re looking for a new job or you’re looking for a promotion.\n\n</p>\n\n\n\n<p>The Linux Professional Institute (LPI) has developed its LPI-1 certification as an introductory certification for people who want to enter careers involving Linux. The exam is<br>meant to certify that an individual has the <strong class=\"redactor-inline-converted\">skills necessary to install, operate, and troubleshoot a Linux system</strong> and is familiar with Linux-specific concepts and basic hardware.</p>\n\n\n\n<p>The purpose of this course is to help you pass the LPIC-1 exams (101 and 102).<br>Because these exams cover basic Linux installation, configuration, maintenance,<br>applications, networking, and security, those are the topics that are emphasized in this<br>book. You’ll learn enough to get a Linux system up and running and to configure it for<br>many common tasks. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why Become Linux Certified through LPIC?</strong></p>\n\n\n\n<p>There are four major benefits:</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Relevance</strong> The LPIC exams were designed with the needs of Linux professionals in mind. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Quality</strong> The exams have been extensively tested and validated using psychometric standards. <br><strong class=\"redactor-inline-converted\">Neutrality</strong> LPI is an organization that doesn’t itself market any Linux distribution. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Support</strong> The exams are supported by major players in the Linux world.</p>\n\n\n\n<p>Don't miss this opportunity to learn Linux through this easy to follow course and add versatility in your skills, necessary for today's highly competitive market. Click on \"Take this Course\" now, and I will see you inside. <br></p><p>__________________________________________________________________________</p><p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards receiving your Linux LPIC-1 certification. <br></p>\n\n<p><strong>When we learn something new,</strong> I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n<p>In addition to the <strong>Udemy</strong> <strong>30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course. If you ever have any questions please feel free to message us directly and we will do our best to get back to you as soon as possible!</p>\n\n<p>__________________________________________________________________________</p>\n\n<p><em>What I can't do in this Course..</em></p>\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em></p>\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n<p><em>__________________________________________________________________________</em></p>\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n<p><strong>Click the \"take this course\" button at the top right now!</strong></p>\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n<p>See you in the course!</p>\n\n<p><strong>Sincerely,</strong></p>\n\n<p><strong>Ahmad Nadeem &amp; Joe Parys </strong></p>", 
    "end_date": null, 
    "title": "The Complete Linux LPIC-1 Certification Course Exams 101-102", 
    "price": "50.00", 
    "instructors": "Ahmad Nadeem, Joe Parys", 
    "commitment": "18.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/809760_b708_2.jpg", 
    "course_url": "https://www.udemy.com/linux-lpic-1-certification-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-01T05:07:24Z"
}