{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Course Description</strong></p><ul style=\"\"><li>This course provides a a high level overview of Enterprise Architecture and why this discipline - together with the TOGAF® Architecture Framework - can help businesses effectively manage a rapidly changing technology landscape and complex business environment.</li><li>This course is a primer course suitable for many different Enterprise roles such as Technical Architects, Solution Architects, Business Analysts, Project Managers and even C-Suite executives like CIO&#039;s, CTO&#039;s or CEO&#039;s</li><li>There are 8 video lectures covering TOGAF at a high level</li><li>The course is 30 minutes in length</li></ul><p style=\"\"><strong style=\"\">What will I learn?</strong></p><ul style=\"\"><li>A High Level understanding of the Enterprise Architecture problem space</li><li>A High Level overview of the basic concepts of TOGAF®</li><li>Understanding of the Business Benefits of good Enterprise Architecture</li><li>Understanding of what an Architecture Framework is and why it is needed</li><li>Understanding of the Architecture Development Method (The ADM) - the heart of TOGAF®</li><li>A High level overview of the 2 certification examinations</li><li>A little known/understood exam tactic you can apply to any multiple choice exam</li><li>A list of further resources to help deepen your understanding of TOGAF®</li><li>A FREE mock practice exam - just like the real thing with 40 timed multiple choice questions (This will show you exactly what you&#039;re up against in the exam environment)</li><li>A crossword to test your knowledge of the TOGAF® In 30 concepts</li></ul><p style=\"\"><strong style=\"\">Requirements</strong></p><p style=\"\">There are no pre-requisites to take this course:</p><ul style=\"\"><li>Software Required: None</li><li>Preparatory Materials Required: None</li></ul><p style=\"\"><strong style=\"\">Target Audience</strong></p><p style=\"\">This course is targeted to Business and IT Professionals looking for a high level overview of TOGAF® and Enterprise Architecture. I have already mentioned some of the Enterprise Roles who could benefit from this course but some other roles might include Software Engineers, Security Architects, Application Architects and Systems Analysts.</p><p style=\"\">So if you&#039;re ready to get started, enroll now...<br style=\"\"></p>", 
    "end_date": null, 
    "title": "TOGAF® In 30 - TOGAF Overview For Business/IT Professionals", 
    "price": 0, 
    "instructors": "Tom O'Brien", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485968_c685_2.jpg", 
    "course_url": "https://www.udemy.com/togaf-overview/", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-25T08:52:01Z"
}