{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p><strong>Last Update: April 2016</strong></p>\n\n<p><strong><em>(Now includes Level 1 &amp; Bonus Level 2 Course - FREE)</em></strong></p><p><br></p><p><strong></strong></p>\n\n<p><strong>Why Take This Course?</strong></p>\n\n<p>Because... TOGAF 9.1 is the leading industry enterprise architecture framework. </p>\n\n<p>A TOGAF 9.1 Certified Background means your skills are being searched for right now at a <strong>premium</strong>. According to the 2015 IT Skills and Certifications Pay IndexTM<strong> </strong>,TOGAF Certification is a qualification which <strong>commands premium pay</strong>. </p>\n\n<p>Given Enterprise Architecture is growing in importance (and here to stay), this is<strong> fantastic for your career (and wallet) prospects.</strong></p>\n\n<p>This course will teach you what you need to know to sit and successfully pass the TOGAF Certification exam (Foundation Level 1 OG0-091) with the help of <strong>accelerated learning techniques</strong>. It covers the entire Foundation curriculum focusing heavily on the Architecture Development Method (ADM) - the core of TOGAF.</p>\n\n<p>The bonus lecture <strong>\"Your Career Boost Bonus\"</strong> will help you maximise your TOGAF knowledge and keep your motivation levels high to complete the course.</p>\n\n<p><em>TOGAF® is a registered trademark of The Open Group in the United States and other countries.</em></p>\n\n<p><strong>Course Goals</strong></p>\n\n<ul><li><strong>Primary Goal: To help you pass the TOGAF 9.1 Foundation Exam</strong></li><li><strong>Secondary Goal: is to deepen your learning using accelerated learning techniques.</strong></li><li><strong>Tertiary goal: For you to have fun learning!</strong></li></ul>\n\n<p><strong>Course Description</strong></p>\n\n<p>The course has been created to take advantage of accelerated learning techniques such as</p>\n\n<ul> <li>Mind Maps</li> <li>Video &amp; Audio</li> <li>Mnemonics</li> <li>Practice Revision Exams</li> <li>Practice Revision Crosswords</li> </ul>\n\n<p>to make your learning experience <strong>more enjoyable and more effective</strong>. </p>\n\n<p>It is structured into 43 lectures (primarily videos) covering the examination curriculum with supplemental learning materials including <strong>15 Practice Exams &amp; 10 Knowledge tests </strong>to test your knowledge in detail.</p>\n\n<p><strong>Course Overview</strong></p>\n\n<ul> <li>The Core TOGAF Concepts</li> <li>TOGAF Terms &amp; Definitions</li> <li>The Architecture Development Method (ADM)</li> <li>The Enterprise Continuum &amp; Tools</li> <li>Architecture Governance</li> <li>TOGAF Reference Models</li> <li>Enterprise Building Blocks &amp; Deliverables</li> </ul>\n\n<p>These are the areas tested in the examination curriculum, we will focus on helping you learn what you need to know to pass the examination. There are plenty of class-room based courses out there costing thousands of pounds/dollars and I am confident this course stacks up to each and every one - at a fraction of the cost.</p>\n\n<p><strong>What Will You Learn?</strong></p>\n\n<ul> <li>The knowledge to successfully sit the TOGAF Foundation (Level 1) Exam</li> <li>To understand TOGAF Standard Basic Concepts</li> <li>To understand TOGAF Standard Core Concepts</li> <li>To understand the main TOGAF Terms &amp; Definitions </li> <li>To understand the Architecture Development Method (ADM) </li> <li>To understand the ADM Guidelines &amp; Techniques</li> <li>To understand the Enterprise Continuum &amp; Tools</li> <li>To understand Architecture Governance</li> <li>To understand the TOGAF Reference Models</li> <li>To understand the importance of Enterprise Architecture Building Blocks</li> <li>To understand the Deliverables used across the ADM</li> </ul>\n\n<p><strong>How will Accelerated Learning Help You</strong></p>\n\n<p>This course has near 4.5 hours of video and audio to help you make sense of the TOGAF specification. You can of course go off and read the specification on your own, but you will find the specification is written in a very dry (technically \"correct\") and difficult to consume format.</p>\n\n<p>The primary focus of the course is to help you pass the exam by covering/revising the specific areas of the TOGAF specification examined. This will help shave time off your own study efforts but the longer term goal of the course is to help you truly understand, retain and apply the material in your career.</p>\n\n<p>This is why the course contains Mind Maps, Revision Crosswords as well as 25 practice exams and knowledge tests.</p>\n\n<p>In addition, there is a bonus 12 month follow up email series which will regularly get you to test your knowledge so you retain and build upon your knowledge. You are investing a good amount of time to prepare for this Enterprise Architect exam - it would be a waste if it ended when you left the exam room.</p>\n\n<p>The accelerated learning resources and techniques in this course will help you pass your exam but more importantly learn faster, better and build upon your knowledge in the long term.</p>\n\n<p><strong>What am I going to get from this course?</strong> </p>\n\n<ul> <li><strong>65</strong> Lectures</li> <li><strong>5+</strong> hours of video (Including TOGAF In 30 course)</li><li><strong>FREE </strong>Access to the TOGAF 2 Certification Course</li> <li><strong>24</strong> Mind Map files in PDF format covering course slides and Mind Map overviews</li> <li>The course should take between <strong>12 and 15</strong> hours to complete (depending upon how much revision you undertake with the practice exams and revision exercises)</li> <li><strong>23</strong> Revision Crosswords - Crosswords are an excellent way to get your brain remembering in a different way (don't worry - they are not cryptic crosswords!) and are thus an excellent revision device.</li> <li><strong>15 x 60 </strong>Minute Online Practice Exams (Simulated exams - just like the real thing) <ul> <li>Question Bank contains <strong>237 </strong>questions</li> </ul> </li> <li><strong>10 x 60</strong> Minute Online Knowledge Tests (Similar to Practice Exams but cover full TOGAF standard including Certified Level 2 curriculum) <ul> <li>Question Bank contains <strong>415 </strong>questions</li> </ul> </li> <li><strong>12 </strong>Month Follow Up Revision Bonus - Regular email series follow up to ensure you retain and deepen your learning. The primary goal is to pass the exam, the secondary goal is to deepen your learning for the rest of your career.</li> <li>Mnemonics PDF detailing some key TOGAF concepts</li><li>\"Your Career Boost Bonus\" - This is an extra lecture which provides you a fantastic reason for keeping your motivation levels high and completing the course/taking the exam.</li></ul>\n\n<p><strong>What are the requirements?</strong> </p>\n\n<ul> <li>You need a willingness to invest your time for best results</li> </ul>\n\n<ul> <li>This course is targeted to IT Professionals looking to undertake the TOGAF® 9.1 Certification (Part 1) exam. </li> <li>It is also targeted to professionals who have already passed the exam but wish to revise and deepen their learning over time.</li> <li>Typical roles include: Enterprise Architects, Technical Architects, Business Architects, Application Architects, Data Architects, Security Architects, Infrastructure Architects, Solution Architects, Integration Architects as well as Software Developers.</li> <li>Those in Business roles (eg Business Analysts/Program Managers) will also find this course useful should they wish to undertake certification to complement their business experience and architecture life-cycle knowledge.</li></ul>\n\n<p><strong>What this course is not:</strong></p>\n\n<p>This course is an accompaniment to the TOGAF specification. It is not a total replacement for study of the specification itself. It will however help you achieve your goals faster and learn at a deeper level.</p>\n\n<p><strong>Who Am I?</strong></p>\n\n<p>My name is Tom O'Brien and I am a TOGAF Certified architect. I am also a member of the Open Group Architecture Forum and have created this course under the The Open Group commercial license. </p>\n\n<p><strong>Helping You Succeed</strong></p>\n\n<p>If you have any questions about the materials, you can contact me directly and I will make every effort to help you. If you are in any way not satisfied, for any reason, you can get a full refund from Udemy with a no questions asked 30 day guarantee. </p>\n\n<p>I am 100% confident you will find the content and materials the perfect way to help you succeed passing the TOGAF Foundation exam.</p>\n\n<p><strong>Enrol now, save BIG and take your career to the next level!</strong></p>", 
    "end_date": null, 
    "title": "TOGAF® Certification,Accelerated Enterprise Architect Course", 
    "price": "20.00", 
    "instructors": "Tom O'Brien", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489052_a859_7.jpg", 
    "course_url": "https://www.udemy.com/togaf-certification/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T00:28:31Z"
}