{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t“Understanding the CCSK Certificate of Cloud Computing&quot;  </p>  <p>  \tThe CCSK (Certificate of Cloud Security Knowledge) is an individual certification. After this course you will be able to decide how valuable the CCSK is, and you will understand how you can attain the certification. This is NOT a CCSK training in itself.  </p>  <p>  \t<strong style=\"\"> Understand How The CCSK Cloud Security Certification Will Benefit You And Your Company</strong>  </p>  <ul style=\"\">  \t<p>  \t\t·Learn that cloud computing is here to stay  \t</p>  \t<p>  \t\t·Understand why cloud security is new  \t</p>  \t<p>  \t\t·Find public resources to help you study CCSK  \t</p>  \t<p>  \t\t·Recognize the reasons for taking the CCSK  \t</p>  \t<p>  \t\t·Learn about the components of the CCSK body of knowledge  \t</p>  </ul>  <p>  \t<strong style=\"\">The CCSK Cloud security certification </strong>  </p>  <p>  \tCCSK was developed by the Cloud Security Alliance to facilitate a common understanding of cloud security concepts, which should increase the quality of risk decisions taken. By now, CCSK is the most recognized independent cloud security certification world-wide.  </p>  <p>  \tEvery professional involved in selecting or adapting cloud solutions, and every team that they are a member of, will find that the CCSK speeds up taking the right decisions.  </p>  <p>  \tCCSK is also the basis for a lot of new cloud provider certifications.  </p>  <p>  \t<strong style=\"\">Content and structure of this course</strong>  </p>  <p>  \tThe course briefly discusses cloud computing and cloud security, then dives into the details of the body of knowledge and the contents of the certification.  </p>  <p>  \tYou will also get examples of the value of CCSK.  </p>  <p>  \tIt explains how the exam can be taken and how the certification works.  </p>  <p>  \tIn concludes with options that you have for studying for the CCSK, and there is a bonus  </p>  <p>  \tAs a bonus, the course contains links to or copies of the official study material, a couple of sample questions and a few bonus documents to help you to understand how cloud security can be applied in practice.  </p>  <p>  \tAll in all you should be able to run through all the components in about an hour. After that you will be ready to decide whether CCSK is for you.  </p>  <p>  \t<strong style=\"\">Who is this for?</strong>  </p>  <p>  \tThere is no formal requisite for this training, nor is there for the full CCSK certification or its training. However, this course assumes that you have a professional career that is related to IT, and that you are considering a cloud security certification for yourself or your team members.  </p>  <p>  \t<strong style=\"\">What you will get out of this course</strong>  </p>  <p>  \tWhat you will get out if this course is a good idea as to how worthwhile it is to go for the CCSK certification.  </p>", 
    "end_date": null, 
    "title": "Understand the CCSK Cloud Security Certification", 
    "price": 0, 
    "instructors": "Peter HJ van Eijk", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287770_60bc_3.jpg", 
    "course_url": "https://www.udemy.com/understand-the-ccsk-cloud-security-certification/", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-25T21:50:28Z"
}