{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>  \t            Are you considering joining the Cisco career but do not know where to start? Here you will find the answer!  </p>  <p>  \t<strong>Cisco Career Certifications</strong> are a type of IT professional certifications created by Cisco Systems for their products. The certification breaks down into five levels: Entry, Associate, Professional, Expert, and Architect along with targeted certifications for Specialist and Technician. These can divide into nine different subject tracks depending on the certification level: Routing &amp; Switching, Design, Security, Service Provider, Service Provider Operations, Data Center, Voice, Wireless and Video.  </p>  <p>  \t            Cisco certifications career is the most famous in the world, and therefore it is very important to understand all the paths and certifications that exist.  </p>  <p>  \t          Many technology professionals have the initiative to start the cisco career but when faced with the amount of acronyms and certifications, are confused and may even give up.  </p>  <p>  \t            In this course you’ll be showing all the necessary path, starting on the first level and ending at the top of the pyramid, with tips and best practices to start your career.  </p>  <ul>  \t<li>How to start your studying</li>  \t<li>What is the first Cisco Certification to do</li>  \t<li>How to choose the correct course and the most productive path</li>  </ul>  <p>  \t          At the end of this course you will have an excellent knowledge of Cisco career and you can choose wisely which way scroll and also trace their goals more clearly.  </p>  <p>  \t          Welcome and enjoy the course!  </p>", 
    "end_date": null, 
    "title": "Understanding Cisco Certifications (Easy Steps)", 
    "price": 0, 
    "instructors": "Andre Iacono", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355924_ff12_2.jpg", 
    "course_url": "https://www.udemy.com/understanding-cisco-certifications-easy-steps/", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T06:28:39Z"
}