{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p style=\"\">Visual Basic is one of the Microsoft core programming languages for building  web, mobile, and desktop applications. Visual Basic was derived from BASIC and enables the rapid application development (RAD) of graphical user interface (GUI) applications.</p><p style=\"\">Why do we learn Visual Basic <br style=\"\"></p><ul style=\"\"><li style=\"\">It shares the same principles with other programming languages.</li><li style=\"\">It is good when developing small and handy utility programs.</li><li style=\"\">It is supported by Microsoft.</li><li style=\"\">It is powerful when integrated with Excel and Word.</li></ul><div style=\"\">A programmer can put together an application using the components provided with Visual Basic itself.<br style=\"\"></div><div style=\"\">We will start this course by installing Visual Studio Express which is a community edition of Visual Studio and is free to use. Then We will see How to create a variety of visual basic Projects using Windows form application in Visual Basic. We will see How to work with buttons, list, text-boxes, text area, date time picker, PictureBox, Listview etc.</div><div style=\"\">The course then outlines the language fundamentals such as data types, strings, operators, conditional code, and looping constructs. In Addition, discover how to package reusable code in functions and subroutines.<br style=\"\"></div><div style=\"\">The We will see How to Create more advanced stuff in visual basic Like creating file, Working with PDF files, Media player, vlc media player, chars, tables, webview etc.</div><div style=\"\">In the Last part of this course We will learn How to work with access database with visual basic.</div><div style=\"\">So Lets Get Started with <strong style=\"\">Visual Basic .NET Tutorial for Beginners</strong></div><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Visual Basic .NET Tutorial for Beginners Make App That Sells", 
    "price": "20.00", 
    "instructors": "Yogesh Patel", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595328_e0bd_4.jpg", 
    "course_url": "https://www.udemy.com/visual-basic-net-tutorial-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T20:33:15Z"
}