{
    "selfpaced": true, 
    "topic_name": [
        "IT & Software"
    ], 
    "description": "<p>Ένα ελεύθερο, διαδικτυακό μάθημα για τον \"Προγραμματισμό Υπολογιστών\" που θα υποστηρίξει τους μαθητές της Γ' τάξης των ΕΠΑΛ, στο τελευταίο στάδιο της προετοιμασίας τους για τις πανελλαδικές εξετάσεις.</p>\n\n<p><strong>Σε ποιους απευθύνεται το μάθημα;</strong></p>\n\n\n\n\n\n<ul><li>Στους μαθητές των ΕΠΑΛ που θα εξεταστούν πανελλαδικά στο μάθημα του Προγραμματισμού Υπολογιστών και θέλουν να μάθουν πώς να λύνουν όλα τα θέματα των πανελλαδικών των προηγούμενων ετών, αλλά και κάθε παρόμοιο.</li><li>Στους εκπαιδευτικούς που διδάσκουν το μάθημα του Προγραμματισμού Υπολογιστών.</li><li>Σε όσους ενδιαφέρονται για τον Προγραμματισμό Υπολογιστών</li><li>Σε όσους ενδιαφέρονται να δουν στην πράξη πως λειτουργεί ένα Μαζικό, Ανοιχτό, Διαδικτυακό Μάθημα (MOOC);</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Ποιοι είναι οι βασικοί στόχοι του μαθήματος;</strong></p>\n\n\n\n\n\n<p>Το μάθημα σχεδιάστηκε για να βοηθήσει τους μαθητές των Επαγγελματικών Λυκείων που θα εξεταστούν στο μάθημα του Προγραμματισμού Υπολογιστών, στις πανελλαδικές εξετάσεις, για την εισαγωγή τους στην τριτοβάθμια εκπαίδευση. <br>Επίσης μέσα από το μάθημα αυτό θα διερευνηθεί αν είναι δυνατόν οι μαθητές να συνεισφέρουν στη δημιουργία γνώσης μέσα από συνεργατικές κοινότητες μάθησης καθώς οι γενικότερες δυνατότητες και προοπτικές των MOOCs στη δευτεροβάθμια εκπαίδευση.<br><br><strong>Τι θα κερδίσουν οι μαθητές αν παρακολουθήσουν το μάθημα; Τι θα μπορούν να κάνουν;</strong><br>Μετά το τέλος του μαθήματος οι μαθητές που θα έχουν παρακολουθήσει τη μεθοδολογία επίλυσης όλων των θεμάτων που έχουν πέσει τα προηγούμενα χρόνια, θα μπορούν να λύνουν με σχετική άνεση τα θέματα των προηγούμενων ετών αλλά και κάθε παρόμοιο.<br><br></p>\n\n\n\n\n\n<p><strong>Τι θα περιλαμβάνει το μάθημα;</strong></p>\n\n\n\n\n\n<ol><li>Μια σειρά βιντεομαθημάτων τα οποία λύνουν βήμα προς βήμα αντιπροσωπευτικά θέματα των πανελλαδικών των προηγούμενων ετών και περιγράφουν αναλυτικά τη μεθοδολογία επίλυσης τους</li><li>Τα θέματα όλων των προηγούμενων ετών και τις λύσεις τους σε ψηφιακή μορφή (pdf)</li><li>Ψηφιοποιημένα τεστ (σε μορφή pdf) καθώς και on-line ασκήσεις αξιολόγησης</li><li>Εκτίμηση / πρόβλεψη για τα φετινά θέματα σε μορφή βίντεο-μαθήματος</li><li>Ένα τελικό τεστ αξιολόγησης με τα πιθανά θέματα του 2016.</li></ol>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Εκτός από τις βιντεο-διαλέξεις το μάθημα πλαισιώνεται από:</strong></p>\n\n\n\n\n\n<ul><li>μία ομάδα συζητήσεων στο Udemy</li><li>μία ομάδα συζητήσεων στο Facebook</li></ul>\n\n\n\n\n\n<p>στις οποίες οι μαθητές μπορούν να διατυπώνουν τις απορίες τους, να ανταλλάσουν απόψεις και γενικότερα να συνεισφέρουν στο μάθημα</p>\n\n\n\n<p>Μάλιστα στην ομάδα συζητήσεων του FB θα συναντίομαστε κάθε Πέμπτη (μετά την 1η Απριλίου και μέχρι τις πανελλαδικές) για να τα λέμε ζωντανά</p>\n\n<p>Το μάθημα αποτελεί μέρος διδακτορικής έρευνας με στόχο τη διερεύνηση των δυνατοτήτων και των προοπτικών υιοθέτησης των MOOCs στη δευτεροβάθμια εκπαίδευση.<br></p>", 
    "end_date": null, 
    "title": "Ο Προγραμματισμός Υπολογιστών στις πανελλαδικές των ΕΠΑΛ", 
    "price": 0, 
    "instructors": "Philippos Koutsakas", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434266_5f9f_11.jpg", 
    "course_url": "https://www.udemy.com/domprogepal/", 
    "subject_name": [
        "IT Certification"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T17:11:16Z"
}