{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Have you ever wanted to <strong>create marketing pages fast?</strong> and paid hundreds of dollars for designers that took forever to finish 1 single page?</p><p>are you an Online Entrepreneur and want to create full website for your self and your client and host it for FREE for life?</p><p>then this course is for you</p><p><strong>in this course you will learn how to create stunning marketing pages and sales pages,squeeze pages,offer pages,bonus pages or any other marketing pages you can think of with a simple drag and drop dashboard that will give you all you need to get a page done in minutes!</strong></p><p><strong>not only marketing pages but i will teach you how to create full websites with unlimited pages and FREE HOISTING FOR LIFE!</strong></p><p>and it does not stop there too!</p><p><strong>with my 30 Minutes marketing pages and full website - No More coding</strong><strong> course you will get FREE lifetime access to my premium web based software that you will use to create all the pages and it comes with over 30 ready made templates that are great for any business type so you can get started as fast as today! (software alone currently sells $200 but you get it FREE + Developers License to all pages you create so you can sell them for profits!)</strong></p><p><strong>Software name is: SqueezeMatic</strong></p><p><strong>My courses don't just give you information! we give you the knowledge,information and tools to get you started as fast as possible and at almost no upfront investment!</strong></p><p>Join now and let's rock! </p><p>*please note that in order to get the free tool that is a gift with the course you will have to complete %100 of the course and provide an email address to get your membership created in the tool and this is completely optional and your data will not be added to any lists or shared or spammed in any way.</p>", 
    "end_date": null, 
    "title": "Affiliate Ninja #1: create & sell marketing pages in minutes", 
    "price": "50.00", 
    "instructors": "Kenz A.Soliman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662752_4830_4.jpg", 
    "course_url": "https://www.udemy.com/create-and-sell-marketing-pages-in-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T06:15:41Z"
}