{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will teach you how to generate complete passive income on auto-pilot from one blog using my tested affiliate marketing strategy.</p><p>You will see inside in this course that I generate more than $2300.00 per month just from one affiliate website. <em><strong>You can create as many sites as you like and multiply your income.</strong></em></p><p><strong>What is This Course About?</strong></p><p>This is teaching about establishing affiliate blogs or website through WordPress to promote other people's products without worrying about sale, customers, service, inventories, investments etc.</p><p>You will create a blog or WordPress site that you will love. By the end of this course, you would have all the affiliate strategies to establish several sites and multiply your income potential.</p><p><strong>Materials in This Course</strong></p><p>The course is delivered for most parts through videos. The videos are screen-casts with <strong><em>step by step instructions and easy to follow guidelines</em></strong>. Everything has been explained in plain, simple and straightforward English. </p><p><strong>Duration of Course Completion</strong></p><p>Depending upon the time you can set aside for following this course, it may take a few hours or a week time. The course <strong><em>does not include any fluff </em></strong>and every topic has been straight away dealt with.</p><p><strong>Structure of the Course</strong></p><p>There are 8 sections of this course and 44 videos. New updates to the sections and lectures shall be added as we go along. </p><p><strong>Why Take This Course?</strong></p><p>If you have ever dreamed to earn some passive income through your blog or website, this is course is ideal for you. Many people have to spend years after years to learn all these effective affiliate strategies and techniques. In this course you will be able to learn all those effective tips and tricks just in matter of a couple of hours.</p><p><strong>Who is this Course Not For?</strong></p><p>If you are thinking of short cuts and getting rich quick methods, <strong><em>this course is not for you</em></strong>. If you do not want to add value to the internet or you have no interest in working a couple of hours a week, then this course may not be suitable for you.</p><p></p><p></p><p></p>", 
    "end_date": null, 
    "title": "Affiliate Marketing Techniques and Tools for Any Blog", 
    "price": "35.00", 
    "instructors": "Qadar Khan", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555046_c99e_2.jpg", 
    "course_url": "https://www.udemy.com/affiliatemarketingtechniques/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T04:06:55Z"
}