{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em><strong>Over 2,280 Students are Enrolled in this Course!</strong></em>  </p>  <p>  \t<strong><span style=\"color: #0000ff;\">UPDATED March 2016 </span></strong><strong>\"The Lazy Money System\"</strong>  </p>  <p>  \t              Learn How to Make Money Online - with Affiliate Marketing and CPA Marketing using Bing PPC and get a $50 Free Ad Credit*. Makes it easy to get started!  </p>  <p>  \t<strong>==== another 5-star Testimonial just came in from a student ====</strong>  </p><p><em>Simple BUT It Works!!<br></em></p><p><em>My first 2 days experience with PPC Bing using Lazy Money system was aweesome! I set about 10 different ads using lazy money system. Got charged about $2.7 (less than 10 clicks for 50 impression), but I got 1 sales $45. This system is laser-targeted &amp; Now I'm hooked with Bings PPC. Thank you, Hans... you are a great teacher!</em></p><p><em>mel fnc</em><em></em><br></p><p><strong>And Another:</strong></p>  <p>  \t<em>This is just awesome!</em>  </p>  <p>  \t<em>After i completed this course,worked on it right away 3 days back with a peerfly offer and yesterday got my first lead of $17 which is great :D</em>  </p>  <p>  \t<em>This is really a great course and i recommend this course to anybody who wants to earn money with very basic understanding!</em>  </p>  <p>  \t<em>Once again thanks Hans Peter for this great course</em>  </p>  <p>  \t<em>Abhijith N</em>  </p>  <p>  \t<strong>                                  ==================================================================  </strong>  </p>  <p><strong><span style=\"color: #ff0000;\">Includes $50 Free Advertising Credit from Bing*. Enroll now! </span> </strong>  </p>  <p>  \t<strong>                                  ==================================================================  </strong>  </p>  <p>  \t                              In this course you can learn how to create an additional income stream online. You are going to learn how to get cheap advertising in order to promote affiliate offers.  </p>  <p>  \t                                            All you need for this an internet connection. No additional software needed. No web site needed.  </p>  <p>  \t                                              You should be able to use the internet and write short sentences. The short sentences are for the little text ads that you create.  </p>  <p>  \t                                              This course is about using Bing/ Yahoo Pay Per Click advertising to send cheap traffic to affiliate offers.  </p>  <p>  \t                                              Here is Exactly How it Goes:  </p>  <p>  \t                                                  1. Sign up for Bing Advertising  </p>  <p>  \t                                                  2. Sign up for an affiliate program  </p>  <p>  \t                                                  3. Pick an offer  </p>  <p>  \t                                                  4. Create a campaign  </p>  <p>  \t                                                  5. Collect your money  </p>  <p>  \t                                                  Seriously that is exactly what I am going to show you.  </p>  <p>  \t                                                  Well, as you know the devil is in the details.  </p>  <p>  \t                                                  1. Where to get $100 in free advertising (only if you have no Bing Ads account).  </p>  <p>  \t                                                  2. Which offers you should pick. (You can copy my campaigns!)  </p>  <p>  \t                                                  3. Which keywords you should start to work with.  </p>  <p>  \t                                                  4. How to set up your campaigns on Bing that your campaigns have the best chances to be profitable right out the gate.  </p>  <p>  \t                                                  5. Which boxes you have to un-check or you risk wasting all your money. (Very Important!)  </p>  <p>  \t                                                  6. How to scale this into more income.  </p>  <p>  \t                                                  7. Which other networks you can use for this.  </p>  <p>  \t                                                  All is shows step-by-step in videos. There are also several additional PDFs that make it easier for you to follow along.  </p>  <p>  \t                      <span style=\"color: #ff0000;\"><strong>*</strong></span>The $50 Free advertising credit is an offer from Bing. The offer has some restrictions. The main restriction: It is only offered for new Bing ad accounts and it may not be available for every country and it's only valid until June 30, 2016. </p>", 
    "end_date": null, 
    "title": "Affiliate Marketing and CPA Marketing Using Bing PPC Adverts", 
    "price": "25.00", 
    "instructors": "Dipl.-Ing. Hans Peter Jeschke", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/382634_1fc2_10.jpg", 
    "course_url": "https://www.udemy.com/the-lazy-money-system-a-few-hundred-dollars-extra-week/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T01:41:59Z"
}