{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\">Take Your Affiliate T-Shirt Marketing Skills to the Next Level</strong>  </p>  <p>  \t            In this course you will learn the intermediate to advanced strategies and tactics that I use to make hundreds of dollars to over $1000 per week selling t-shirts as an affiliate.  The course is designed to help you create more winning t-shirt campaigns using Teespring and Facebook.  </p>  <p>  \t<strong style=\"\">The training goes deep into the tactics and strategies of what makes a campaign successful.</strong>  It focuses heavily on those problem areas of choosing winning niches, designs, and Facebook targeting.  Many people struggle with finding successful niches and designs.  My methods make it easy so you can tip more campaigns.  </p>  <p>  \t            I have specific methods such as the Piggyback and the Pin methods that help you know in advance if the niche and design idea are both proven winners.  My Facebook targeting strategies will help you find the audiences who are most likely to buy your t-shirts.  </p>  <p>  \t      They will also help you discover hard-to-find audiences that many other t-shirt marketers would likely miss.  This will bring you more sales and higher profits.  Of course no one can guarantee that you will have successful campaigns, but my methods will increase your chances.  </p>  <p>  \t            The course is structured as a case study of one of my successful campaigns where I sold over 100 shirts.  I feel that case studies are one of the best ways to learn as long as they are detailed and none of the pieces of the puzzle are left out.  </p>  <p>  \t      I go through my case study in great detail, step by step.  I show you exactly what I did right, what I did wrong and my thinking and decision process throughout the campaign.  As you follow along little light bulbs should go on in your head as to what you might have done wright and wrong in your campaigns.  And you’ll also discover new things to test in your future campaigns.  </p>  <p>  \t            This course is an intensive, fast paced, online video training program.  Just watch me complete each simple task on my computer screen, pause the video, then do it yourself.  I purposely kept each video short, most are around 7 minutes.  This is so you’ll have an easy reference should you go back and review a specific task.  The video lessons are very easy to follow and understand.  There is no technical talk.  </p>  <p>  \t            This is a self-study course that does not include coaching or consulting; however, if you do happen to see something in one of the lessons that you don’t quite understand I would be happy to clarify it for you.  </p>  <p>  \t            If you already know the basics of t-shirt marketing or you’ve already gone through my affiliate t-shirt course for beginners then this course is perfect for you.  You’ll learn my intermediate to advanced strategies that will help you take your skills to the next level.  Enroll now before the next price increase.  </p>  <p>  \t  If you need the beginners course just type my last name (Piteo) into the search box and you&#039;ll find it. <br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Affiliate Marketing Advanced:  Sell T-Shirts With Teespring", 
    "price": "50.00", 
    "instructors": "John Piteo", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409030_70e5_3.jpg", 
    "course_url": "https://www.udemy.com/sell-t-shirts-with-teespring-advanced/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T13:43:33Z"
}