{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "\n\n<p>  \t<strong>Home business selling t-shirts with Facebook and Teespring.</strong><strong></strong></p>\n\n<p><strong>Affiliate Marketing the Easy Way… </strong>  </p>\n\n<p>  \t  How would you like to be able to make money as an affiliate without a website, an email list or any experience?  </p>\n\n<p>  \t  I know, it may sound too good to be true, because most affiliate marketing courses require you to spend months learning everything that you need to know before you start making money.  They expect you to build websites, email lists, learn search engine optimization, social media marketing, and wait for weeks to months for the traffic to come, etc.  </p>\n\n<p>  \t  They would also have you writing blog articles daily or adding content to Facebook twice a day.  Who's got time for that?  And after all of that work and search engine optimization Google or Facebook makes a change and your traffic disappears.  </p>\n\n<p>  \t<strong>I Do it Differently…</strong>  </p>\n\n<p>  \t  The business that I'm talking about is the affiliate t-shirt business.  All you need is Facebook for traffic and Teespring as the t-shirt selling platform.  You don't need a website or any of those other things and you don't need months to learn how to set up campaigns.  You can turn the traffic on and off instantly.  If your campaign is profitable let it run, if not turn it off.  No waiting weeks or months for the traffic.  </p>\n\n<p>  \t  You can do this type of business part-time, full-time or even occasionally whenever you need some extra cash.  I do this business part-time and make hundreds of dollars to over $1000 per week whenever I have time to launch campaigns.  If you want to see the type of money that it's possible to make selling t-shirts then be sure to check out the free preview videos in the course below.  </p>\n\n<p>  \t  After completing this course you will also be able to do affiliate marketing the easy way.  And that is selling t-shirts as an affiliate with Teespring and Facebook.  </p>\n\n<p>  \t<strong>How it works…</strong>  </p>\n\n<p>  \t  I use Teespring to sell and deliver the t-shirts.  I simply set up short, 7-10 day, campaigns in Teespring.  Then I drive traffic to those campaigns with inexpensive Facebook ads.  Don't worry, I show you how to get cheap clicks and you can get started with just $5 to $10 per day in ad spend.  The whole business is simply setting up t-shirt campaigns and driving traffic to them.  </p>\n\n<p>  \t<strong>It's Fast and Easy</strong>  </p>\n\n<p>  \t  This course is an intensive, fast paced, online video training program.  It's designed for complete beginners and it's easy to get started.  It's not the type of thing that takes weeks or months to learn or set up.  You could easily be running your own t-shirt campaigns within 24 hours of completing the course.  </p>\n\n<p>  \t  I go through all of the basics step by step.  Just watch me complete each simple task on my computer screen, pause the video, then do it yourself.  I purposely kept each video short, most are around 7 minutes.  This is so you'll have an easy reference should you go back and review a specific task.  The video lessons are very easy to follow and understand.  There is no technical talk.  </p>\n\n<p>  \t  This is a self-study course that does not include coaching or consulting; however, if you do happen to see something in one of the lessons that you don't quite understand I would be happy to clarify it for you.  </p>\n\n<p>  \t  After completing this course you will be able to set up your own affiliate t-shirt marketing business from square one.  With my training anyone can do it.  So let's get started.  Enroll now!  </p>", 
    "end_date": null, 
    "title": "Affiliate Marketing Beginner: Sell T-Shirts with Teespring", 
    "price": "20.00", 
    "instructors": "John Piteo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/335742_0d6f_3.jpg", 
    "course_url": "https://www.udemy.com/sell-t-shirts-with-teespring-beginner/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-04T15:22:09Z"
}