{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Can you imagine having the power to <strong>turn ANY YouTube video into a money making machine</strong> even if you do not own the video and <strong>without stealing anything</strong>?</p><p>Imagine having that magic key that turns <strong>YouTube Videos to Facebook Marketing machine</strong> generating cash for you on <strong>almost complete autopilot</strong> and with only 1 hour of work every Day!</p><p>This course is for anyone who wants to make money online in a smart quick way and it doesn't stop there! <strong>we give you FREE ACCESS to our secret weapon</strong> <strong>(Socivids Software)</strong> and a simple yet <strong>powerful 7 day plan</strong> to get you started as soon as one hour from now!</p><p>Enroll Today and <strong>don't miss out on this! </strong></p><p>your success start is <strong>only 1 hour away from now!</strong></p><p><strong>-You will learn how to add your banner ads inside ANY Youtube Video and post it to your Website,Blog,Facebook Page,Profile or group</strong></p><p><strong>-You will be able to Build your Email List at the lowest cost possible and really fast!</strong></p><p><strong>-You will be able to add your PayPal Buy button right inside of Facebook's Newsfeed to sell your products and services</strong></p><p><strong>-You will be able to create affiliate marketing campaigns,CPA marketing campaigns,Digital product marketing,Physical Product Marketing and even Amazon affiliate campaigns in minutes of time!</strong></p><p><strong>Enroll now and let's get started!</strong></p><p><em>*please note that in order to get the free tool that is a gift with the course you will have to complete %100 of the course and provide an email address to get your membership created in the tool and this is completely optional and your data will not be added to any lists or shared or spammed in any way.</em><em></em><br></p>", 
    "end_date": null, 
    "title": "Affiliate Ninja #2: Facebook & YouTube affiliate success", 
    "price": "50.00", 
    "instructors": "Dot Com Success Academy, Kenz A.Soliman", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606672_2362_5.jpg", 
    "course_url": "https://www.udemy.com/fb-tube-money-plan-7-days-to-making-money-online/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T04:31:17Z"
}