{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<h4>How to exactly force customer to buy from your affiliate link and no one else.</h4>  <h4>Double your affiliate commission straight away.</h4>  <p>  \t<strong style=\"\">Warning:This course will teach you blackhat marketing, if you do not want to make a lot of money using blackhat techniques please leave now. </strong>  </p>  <p>  \t<strong style=\"\">(PLEASE NOTE - I understand this course is exciting, and everyone wants in. But please stop sending soliciting messages, I will NOT give you a free coupon for a review.)</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t                 Dear Friend  </p>  <p>  \t<strong style=\"\">First of you have to sit back relax, and be prepared to learn something shocking!</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t                      You are probably seeing this course because you are interested in affiliate marketing, but what you don’t realize is that every time you make an affiliate commission you lose 90% of potential commission simply because you are not using this method that all the <em style=\"\">big </em>affiliates are.  </p>  <p>  \t                      Some &quot;<em style=\"\">true facts</em>&quot; about affiliate marketing –  </p>  <ul style=\"\">  \t<p>  \t\t                      1.95% of affiliates make less than $10 per month!!  \t</p>  \t<p>  \t\t                      2. You are losing commission  \t</p>  \t<p>  \t\t                      3. Affiliate marketing is a waste of money  \t</p>  \t<p>  \t\t                      4. Only 5% of affiliates earn $250+ per month  \t</p>  \t<p>  \t\t                      5. Affiliate marketing is a dying business.  \t</p>  </ul>  <p>  \t                      I bet everyone who has been doing affiliate marketing has heard some of these “<em style=\"\">facts</em>” about affiliate marketing. But the truth is, that you are in control of your own destiny.  </p>  <p>  \t                      Do you know the definition of insanity? Doing the same action over and over and expecting a different outcome.  </p>  <p>  \t                      And if you think about affiliate marketing, are you doing the same tricks as everyone else and not getting that income you want?  </p>  <p>  \t                      The answer is simple. If you don’t make the customer buy from you they will buy from someone else, and that is why you don’t make as much as everyone else.  </p>  <p>  \t                      Wanna know the real secret how to market, sell and earn from any affiliate program?  </p>  <p>  \t                      What if I told you, I can show you exactly how to find a profitable niche, a product that is already being sold by professionals and how you can sell it and get a piece of the large pie.  </p>  <p>  \t                      Come inside and see the real marketing secrets no one will tell you anywhere else.  </p>", 
    "end_date": null, 
    "title": "Blackhat Marketing - The Most Detailed Guide To Date.", 
    "price": "20.00", 
    "instructors": "Wayne McDonald", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/297210_6365_5.jpg", 
    "course_url": "https://www.udemy.com/earn-with-blackhat-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-09T17:41:10Z"
}