{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">This course will teach you how to make a $1,000 with an email list of 1,000 people. It will teach you how yo grow a list of 1,000 people. How to also make money instantly with your list.<br style=\"\"></p><p style=\"\"><strong style=\"\">Who This Course Is For:</strong></p><ul style=\"\"><li style=\"\">People who want to start making money as a secondary income and those that want to make it into a permanent income stream</li><li style=\"\">People who are already in affiliate marketing , but want to make more</li></ul><p style=\"\"><strong style=\"\">Do You Have Questions About What You Will Get From The Course?</strong></p><p style=\"\">Send me a private message with any questions you might be wondering about the course, and I'll tell you whether the course will help your particular situation or not.</p><p style=\"\"><strong style=\"\">How The Course Is Structured</strong></p><p style=\"\">The course is one to two hours to complete, as i want you to spend valuable hours building your business. Its about 20+ lectures</p><p style=\"\"><strong style=\"\">What You Will Get From The Course</strong><br style=\"\"></p><ul style=\"\"><li style=\"\">You will have a very solid understanding of how to grow a list</li><li style=\"\">How to design a landing page and what makes a great template</li><li style=\"\">Make money instantly with your list</li><li style=\"\">List relationship the key to continuing to have a strong email list</li></ul><p style=\"\"><strong style=\"\">The course is broken down into SIX PARTS</strong></p><p style=\"\">PART1: Introduction and course expectations</p><p style=\"\">PART2: Dream Niche - How to find the right market to sell products</p><p style=\"\">PART3: Landing Pages - What is a landing page , how to design one with no technical knowledge, how to outsource it and what makes a killer landing page. What autoresponders you should use to capture emails and send emails</p><p style=\"\">PART4: Traffic - How to get free or paid traffic to generate leads to your landing page and grow your list.</p><p style=\"\">PART5: List relationship - How to make sure you send the right emails to your list at the right time and also balance the different types of emails.</p><p style=\"\">Personal Relationship</p><p style=\"\">In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with through private messages and through the discussion board.</p><p style=\"\">+++++++++++++++++++++++++++++</p><p style=\"\">MONEY BACK GUARANTEE</p><p style=\"\"><em style=\"\">The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em></p>", 
    "end_date": null, 
    "title": "Build Your Company Through an Email List – All Levels", 
    "price": "50.00", 
    "instructors": "Imran Dean", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610664_3409_5.jpg", 
    "course_url": "https://www.udemy.com/build-your-company-through-an-email-list-all-levels/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T12:19:21Z"
}