{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Are you seriously interested in making money online? Do you want to succeed in Clickbank marketing?</p>\n\n<p>I am sure the only thing that stands between you and your goal is taking action with a sure proof clickbank money making system.</p>\n\n<p>Here is a complete step by step strategy to make money from clickbank. You are going to lean how to make money from clickbank by promoting the right product and bringing in instant traffic from social media sites.</p>\n\n<p><em>This course will cover the following:</em></p>\n\n<p><strong>-----------------------------------------------</strong></p>\n\n<p><strong>MY STEP BY STEP BLUEPRINT TO GET STARTED WITH CLICKBANK MARKETING</strong></p>\n\n<p><strong>+</strong></p>\n\n<p><strong>GUARANTEED INCOME AND WEBSITE TRAFFIC FROM YOUR CLICKBANK WEBSITE</strong></p>\n\n<p><strong>+ </strong></p>\n\n<p><strong>100% FREE CLICK PRO PERMIUM PLUS SOFTWARE (Worh $67) - Completely FREE For Those Who Join The Course</strong></p>\n\n<p><strong>-----------------------------------------------</strong></p>\n\n<p>This course is definetely a instant money making system because you are going to bring in instant laser targeted traffic from social media sites to your website.</p>\n\n<p>You dont need to wait for ranking your clickbank website with SEO and wait for months to make money, this course will provide you a solid foundation and get you started with clickbank marketin.</p>", 
    "end_date": null, 
    "title": "Clickbank Marketing Blueprint", 
    "price": "20.00", 
    "instructors": "Hema Chandiran", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801016_9082_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-money-with-clickbank/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T16:15:36Z"
}