{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>***UPDATED ARPIL 2016***</strong></p>\n\n<p><strong>We are Shane Farrell, Brian Gray and Mark Tandan of the <em>IM Rebels</em>. Today we are here to get rid of your stress, frustration, information overload and finally help you succeed.</strong><br></p>\n\n<p>Over the years we've discovered some things that have really made the whole list building and email marketing business a lot easier.</p>\n\n<p><strong>If you can follow simple step by step instructions, you will finally be able to start making money with this training.</strong></p>\n\n<p><strong><em>One of the best courses of more than 30 that I have completed</em> - </strong><em>Nicolas Danielson</em></p>\n\n<p><em>To the point instruction.. Like the short videos.. easy to absorb.. very good download and resources section</em><em></em><br></p>\n\n<p>Imagine squeeze pages that don't require expensive software that actually suck new subscribers in.</p>\n\n<p><strong>Once you focus in and build exactly what profitable marketers do daily, the same results will quickly follow!</strong></p>\n\n<p>You are going to finally see that anybody can make it in this business if they have the right plan.</p>\n\n<p><strong>The scary part is how simple and easy it will be to set up and profit from.</strong> Let us show you the exact same foundational list building and email marketing set-up that successful internet marketers use. <strong>we walk you through every single step in 30 modules.</strong></p>\n\n<p>We are going to share with you a powerful list building system along with letting you in on some unique twists and tweaks in the video training, that when we shared with others like you, they have been blown away by the simplicity and the ease with which they can get this up, running and profitable - <strong>even if you've failed at every other method online!</strong></p>\n\n<p>In fact, my guess is that you are still reading this because you have something inside of you that tells you that you have what it takes to succeed</p>\n\n<p><strong>Introducing…</strong></p>\n\n<p><strong>How We Profit $2-$5 Per New Email Subscriber Without Selling!</strong></p>\n\n<p><strong></strong>We are going to share with you our own system for building simple list building funnels and monetizing them with high converting offers that don't make your subscribers buy anything... </p>\n\n<p><strong>Then we'll show you how to create an easy email series that runs on auto-pilot and how to set up free traffic systems that drive subscribers into your funnel and profits</strong><strong> into your PayPal account... </strong></p>\n\n<p>We use this system DAILY ourselves. Even if you have never done any of those things before, We've taught complete newbies these foundational methods with success. <br><br><strong>This is the exact system we used to go from broke newbie to pro list builder</strong><strong> and email marketer. </strong>We don't care how many times you've failed before or thought about quitting, if you follow what we teach, you will be a success story.</p>\n\n<p>Imagine how different your life will be when you stop wasting time and money looking for the next great thing?</p>\n\n<p><strong>Think for a second what it will be like get this simple, workable plan to execute every time you turn your computer on…</strong></p>\n\n<p>...and every time you log in to check your stats, your subscriber list is growing and commissions are bigger than the week before...</p>\n\n<p><strong>Check out what you're going to learn INSIDE this massive training course:</strong></p>\n\n<p>Once you watch and read how simple all the parts are of this system you'll be kicking yourself for not taking action on list building and email marketing years ago when you first got into this business</p>\n\n<ul><li><strong>Our favorite method to monetize free opt-in funnels and we</strong><strong>'ll show you how to use these in every corner of your new business from opt-in report to thank you pages, from email series newsletters to your download page.</strong> The best part is the subscriber doesn't have to buy anything and you still PROFIT. We've added some more strategies in past two weeks to make this method even stronger.</li></ul>\n\n<ul><li><strong>Learn our stealth 5 page opt-in report</strong><strong> creation method that will take you less than an hour to write</strong> and you need ZERO internet marketing knowledge or even a High School diploma to get this done. We even show you where to get all the content from. Ctrl C and Ctrl V is all your need to know how to do.</li></ul>\n\n<ul><li><strong>Opt-In, Thank You &amp; Download Page Creation:</strong> You can use expensive WP plugins and templates or you can use the FR<strong>E</strong>E plain-jane templates I give you that converts at 40%+ on cold traffic and force your subscribers to take action and make you those funnel profits.</li></ul>\n\n<ul><li><strong>Building Your Email Series</strong>: Stop searching for affiliate offers to mail and buying reports on “How to write an email.\" I'll show you how to set this up once under an hour and you you'll just have to log into your auto-responder once a week to smile at the stats.</li></ul>\n\n<ul><li><strong>Traffic! Building Your Subscriber List:</strong> You can spend your money on solos and get robot leads (seen all the talk in the FB groups lately?) or you can use our free targeted traffic methods that actually work and don't cost any money by the way!</li></ul>\n\n<ul><li><strong>PROFITS!!! </strong><strong>Our favorite lectures and the reason you want to pick up this course.</strong> Your subscribers don't have to buy anything for you to profit and we'll walk you through monetizing every corner of your download pages, thank you pages, emails and opt-in report. -This is also where we see most people making easy to fix mistakes that when corrected,drastically increase their income.</li></ul>\n\n<ul><li><strong>Scaling Up Your New Business:</strong> It would be ignorant of us to ask you to spend more money to implement this simple stealth funnel profit system. If you have an auto-responder account and empty domain, you are good to go.</li></ul>\n\n<ul><li>But we also know, you are an action taker and ready to succeed and will want to know what's next... <strong>we</strong><strong> show you how to make more profits after you get this foundation built and running in stealth mode</strong>.</li></ul>\n\n<ul><li>Build the foundation first and experience success, then scale up. Too many courses promise and teach the other way around.</li></ul>\n\n<ul><li><strong>Five methods to scale your new business</strong> to the levels that are the reason you got into this business in the first place.</li></ul>\n\n<ul><li><strong>Frequently Asked Questions:</strong> Some of the most common questions we get when we teach this to my coaching students and other marketers who reach out for help. We like to leave no stone un-turned when we teach my methods and want to make sure you are crystal clear to get this method up and running as soon as possible.</li></ul>\n\n<p><strong>As you can see- the value we are including in this full on video training is MASSIVE…</strong></p>\n\n<p>...We've made sure we show you everything in GREAT detail and the exact steps we use in my business.</p>\n\n<p><strong>...We want to make sure EVERYTHING you need is inside from the reason why e do it this way or that way to the exact ways we grow my funnel, lists and scale larger and more efficient...</strong></p>\n\n<p>...So, if you're serious about your online business and making money - start this course now and we look forward to hearing your success stories!<br></p>\n\n<p><strong><em>The IM Rebels<br><br></em></strong>-Shane Farrell, Brian Gray and Mark Tandan<strong><em> </em></strong></p>", 
    "end_date": null, 
    "title": "Email Marketing: Grow Your Business With Every Subscriber ", 
    "price": "20.00", 
    "instructors": "Shane Farrell, Brian Gray, Mark Tandan", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605862_1561_7.jpg", 
    "course_url": "https://www.udemy.com/how-we-profit-2-5-per-new-email-subscriber-without-selling/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T13:05:57Z"
}