{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>***UPDATED JUNE 2016***</strong></p><p>Whether you know it or not, you already have a multitude of internet marketing skills you aren't even aware of that could be making you great cash TODAY.</p>\n\n<p>The only thing standing between you and that steady injection of money into your PayPal account, is some very basic guidance. That's where WE come in. And don't worry - experience is not needed here!</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How To Turn Unlimited Demand Into Your Own Services Internet Marketing Business...<br><br></strong>We're the time savers. The results-getters. The people that can provide that specific 'thing' that internet marketers DESPERATELY NEED to get on with their day. <br></p>\n\n\n\n\n\n\n\n<p>And you know what? These marketers are GLADLY willing to pay good dollars to make it happen. <br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Take a look at what just SOME students have to say about our courses:<br></strong><em><br><strong class=\"redactor-inline-converted\">One of the best courses of more than 30 that I have completed</strong></em><strong class=\"redactor-inline-converted\"> - </strong><em><strong class=\"redactor-inline-converted\">Nicolas Danielson</strong><br></em><em>To the point instruction.. Like the short videos.. easy to absorb.. very good download and resources section</em></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Thank you!</em> - </strong><em><strong class=\"redactor-inline-converted\">Alexandra Moore</strong><br></em><em>Brian, Mark and Shane are wonderful instructors and the course is simply brilliant. As a copywriter and marketer, I’m always willing to learn more about crafting compelling sales copies. This course helped me tremendously not only to better understand my target audience, but also to run better researches and structure my letters.</em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>\"Another Excellent Course From The IM Rebels\" - Terry Jenkins<br></em></strong><em>I have just completed watching this course and it provides an excellent platform for you to build an online business from and also an audience for that business. There is a lot of excellent content here ... this is one excellent marketing plan! </em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Just look at two of the main internet marketing platforms...WarriorForum &amp;</strong><strong class=\"redactor-inline-converted\"> JVNotify...</strong></p>\n\n\n\n<p>Because you'll see that where there's a need, there's money to be made. Those are just TWO of the many platforms where marketers are actively looking to pay YOU good money, with wallets in hand! <br><br>And don't worry, we are going to show you PLENTY more places to find people HAPPY TO PAY YOU...</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How do you know if this will work for you?</strong></p>\n\n\n\n\n\n\n\n<ul><li>If you can write an email, this will work for you.</li><li>If you can follow the simple instructions in our step by step video lectures, this is for you.</li><li>If you're willing to market the skills you ALREADY have, this is for you.</li><li>And if you're willing to pick up a simple skill inside of a weekend, this is definitely for you!</li></ul>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">3 Simple Steps To A Foolproof, Consistent Online Business...</strong></p>\n\n\n\n\n\n\n\n<ol><li>The 'skills' required for internet marketing aren't at all complicated.</li><li>The most VALUABLE thing you can offer is time savings.</li><li>You CAN set your OWN prices and make a great income simply providing the services we will teach you, working part time hours. </li></ol>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What Makes This Course Unique?<br></strong><br>We’ve got your back. You’ll have <em class=\"redactor-inline-converted\">a dedicated team of three instructors</em> ready to answer any question you have, or describe something in more detail for you.</p>\n\n\n\n\n\n\n\n<p>As with our other courses, this one will be updated over time with fresh content. All updates for life are included.<br><br>The extensive content is broken into easily digestible bits you can rapidly absorb. Engaging exercises along the way help you master the methods so you can see results fast.<br><br>You’ll come out with specific strategies AND SKILLS to earn a consistent, lucrative income as a freelancer.</p>\n\n\n\n\n\n\n\n<p>Thank you!</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">-The IM Rebels<br></strong>Mark Tandan, Brian Gray and Shane Farrell<br></p>", 
    "end_date": null, 
    "title": "Freelancing Profits- How We Cash In With Simple Services", 
    "price": "20.00", 
    "instructors": "Mark Tandan, Brian Gray, Shane Farrell", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765880_4dfb_3.jpg", 
    "course_url": "https://www.udemy.com/simple-freelancing-profits-an-easy-50-or-more-per-hour/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T22:19:07Z"
}