{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>**Updated December 2015**</strong></p><p><strong>Now Includes information on becoming an Etsy Affiliate! </strong></p><p><strong>I've also added modules on all of the major Amazon affiliate plugins including Prosociate, Azon Store Builder and Fresh Store Builder. </strong></p><p>  \t<strong>What is the course all about? </strong>  </p>  <p>  \t     In  this course you will learn how I've built a profitable Amazon affiliate  store that works and functions as an awesome eCommerce site.  </p>  <p>  \t<strong>What should I expect to achieve after completing this course?</strong>  </p>  <p>  \t    Your #1 goal should be to have built a profitable Amazon affiliate store that allows you to expand beyond being just an affiliate. You will have the choice of offering physical products to your buyers.  </p>  <p>  \t<strong>What will you learn in this course?</strong>  </p>  <ul>  \t<li>Getting started with focus and mindset while organizing and planning tasks</li>  \t<li>Setting up your eCommerce website the right way </li>  \t<li>Picking a niche and doing keyword research for that niche</li>  \t<li>How to design your site and pick a theme</li>  \t<li>Maximizing conversions to get more buyers</li>  \t<li>Basic overview of eCommerce SEO</li>  \t<li>Promoting your eCommerce site with Social Media</li>  \t<li>Using free and paid advertising to promote your site</li>  \t<li>Outsourcing Virtual Assistants to help you build your site faster</li>  \t<li>Learning the basics of Email marketing for eCommerce  </li>  \t<li>Moving beyond Amazon Affiliates - Selling on Amazon &amp; eBay</li>  \t<li>Working with Dropshippers and buying products Wholesale</li>  </ul>  <p>  \t<strong>How long is the course?</strong>  </p>  <p>  \t    This course is split up into 6 weeks, each week you are provided with homework so you have tasks to complete after watching the modules and reading through the content.  </p>  <p>  \t    It may take longer than 6 weeks to complete the entire program, the course is designed to allow you to create a part time or even full time eCommerce store if you choose to do so.  </p>  <p>  \t    Most of the advice I provide allows you to make sales without a ton of commitment when it comes to purchasing physical inventory. You can start slow and grow as you make progress through the course.  </p><p><strong>Check out these awesome testimonials!</strong></p><p>\"Found this just as I started work on an Amazon site. Really useful advice on how to set up shop. I'm implementing now and honestly, that alone will save me the next few days of my life at this point in my project. Thats worth the price of entry alone. But the course has a lot more to give: outsourcing tips, sensible approach to promotion. Also heaps of stuff on FBA and other things beyond Amazon affiliate that held no interest and I thought weren't really for me, but I can now see offer a lot of potential for growth of my store down the line. Great stuff. I also appreciate the straight up approach here. </p><p><strong>No typical marketers fluff, filler, hype or BS. Just laying out what seems solid advice and an action plan that will get you up and running in short order.</strong> You know the course is solid, as John walks through the set up of one of his sites, which is a cut above the usual robo-Azon affiliate spam site. Maybe the title shouldn't emphasis passive income so much, as its some work to get up and running. Even outsourcing leaves the hassle of managing workers, as we all know. It'd also be better if the intro gave some idea of the minimum kinds of investment of time and money you should expect to put in to get any result. Of course, you can keep it passive, but consumers are more savvy than they've ever been. So i'd suggest getting into this with a view to build out and up: in which case the the slog begins.\" <strong>- Paul Andrews</strong></p><p>\"Start off gently as an as an Amazon Affiliate and then transition into your own eCommerce juggernaut. John will show you how it's done and demonstrate the software that makes it possible, easy and profitable.\" <strong>- </strong><strong>Dr. Phillips</strong><strong></strong></p><p>\"This course is way more than just about Amazon Affiliates. Anyone starting an online business will also benefit from this course there is so much information in here and very useful information. John does a great job keeping you engaged in what he has to say, he's very knowledgeable and shows proof that he knows his stuff! Thanks for a great course John.\"<strong> - S Howard</strong><span></span></p><p>\"I've used Wordpress for years so when I saw this course focused on the WooCommerce plugin I decided to give it a shot. It really is a comprehensive course covering everything you need to know about starting your own Amazon affiliate store.\"<strong> - Glen Thonis</strong></p><p>\"I'm very happy to have subscribed and this is a perfect course if you want to setup your own ecommerce store. John is an expert and his advises are very practical and easy to follow. I thoroughly enjoyed the whole course and i have already started implementing them into my own business.\" <strong>- Hussain Ahmed</strong><strong></strong></p><p><br></p><p><span></span></p>", 
    "end_date": null, 
    "title": "How To Make a Wordpress WooCommerce Amazon Affiliate Store", 
    "price": "20.00", 
    "instructors": "John Shea", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334174_f505_3.jpg", 
    "course_url": "https://www.udemy.com/passive-income-amazon-affiliate-store/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T17:28:36Z"
}