{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Update 2016: My students are earning money because of this course! Be sure to watch the free preview videos below to see the testimonials!</strong><br></p><p><strong>-------------------------------------------</strong></p><p><strong>[Please watch the free, preview videos before signing up to ensure you can access the software I recommend.]</strong></p><p>Would you like to make money from your website?  Or maybe you'd like to profit from your social media or YouTube following.</p><p>Get ready because you are about to have a ton of fun with this affiliate program, and make some extra money in the process!</p><p>P.O.D. (print on demand) programs let you create your own virtual store and start earning right away thanks to affiliate marketing.  All you do is upload an image from your computer, add it to the product of your choice, set your commission, promote and start cashing in!</p><p>You can sell shirts, hats, mousepads, phone cases, you name it. (This course focuses more on shirts.)</p><p>What's even better is the parent company (Spreadshirt) does all the product creation, shipping and handles the customer service.  </p><p>Spreadshirt is one of my favorite affiliate programs and I know you're going to enjoy it too.</p><p>What you're going to learn...</p><ul><li><strong>How to manage your Spreadshirt account</strong></li><li><strong>How to create images with text and shapes using Paint (free) and Photoshop</strong></li><li><strong>Turn a photo into an artistic drawing for your shirts</strong></li><li><strong>Where to go for image designs (outsourcing)</strong></li><li><strong>Get strategies for setting your prices</strong></li><li><strong>Discover how to get your visitors to buy multiple products</strong></li><li><strong>Create a header for your shop</strong></li><li><strong>Integrate your shop into your website</strong></li></ul><p>If you don't have Photoshop, no worries.  I will show you how to use Paint (Windows Only) to create simple images with text and shapes.  You can download it for free.</p><p>Also, if you don't want to create your own images, you can use Spreadshirt's marketplace images.  There are hundreds of thousands of existing designs to choose from.</p><p><strong>How Does This All Work?</strong></p><p>Let's say you have a golf website and you're looking to sell some golf-related T-shirts.  You could either create some images with some golf sayings or search the Spreadshirt marketplace for some existing golf images.  </p><p>Then add the images to the shirt design of your choice.  Next, publish the images to your store and start promoting! </p><p>When a sale is made, Spreadshirt creates the shirt, ships it to your visitors, and you get the commission you set for the shirt.</p><p>How cool is that?</p><p><strong>This is Not an Advanced Design Course</strong></p><p>I will be showing you how to use Photoshop and Paint to create some simple designs with text and shapes, but <strong>this is not an advanced design course</strong>. </p><p> I outsource my designs that have the sophisticated artwork, but create my shirts with the text and shapes myself. This course focuses more on showing you how to use text and shapes and you'll also learn where to outsource images.  </p><p>However there is one intermediate lesson in the course that will show you how to take a photo and turn it into a sketch/artistic drawing for your shop. Cool stuff!</p><p>So what are you waiting for?  Spreadshirt is so much fun and I know you're going to enjoy it.  Join today so you can start learning and creating!</p><p><strong>NOTE:</strong> This course is for people creating shops for customers in the U.S. only.</p>", 
    "end_date": null, 
    "title": "How to Create an Affiliate eStore with Spreadshirt", 
    "price": "40.00", 
    "instructors": "Lisa Irby", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499284_0b25_7.jpg", 
    "course_url": "https://www.udemy.com/build-virtual-shirt-shop-spreadshirt/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T19:50:19Z"
}