{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  How to Create a CJ Affiliate Data Feed is an introductory  course that will teach you the very basics of using CJ Affiliates product  export feature to create data feeds.   Data feeds are used to retrieve a catalog of products from an affiliate  merchant, or advertiser, so that the data can be manipulated.  In affiliate marketing these data feeds can  be used to populate databases for an affiliate marketer’s website.  </p>  <p>  \t  This course focuses on using data feeds for product-based affiliate  niche websites.  By the end of the  course, you will be able to setup a product export to create your data  feed.  Note that this course does not  teach you how to use the data feed or how to create a website.  </p>  <p>  \t  This course will teach you:  </p>  <ul>  \t<li>How to signup for CJ Affiliate</li>  \t<li>How to add your first website to CJ Affiliate</li>  \t<li>How to choose an advertiser in CJ Affiliate</li>  \t<li>The basics of CJ Affiliate product exports</li>  \t<li>How to create the product export function in CJ  Affiliate</li>  </ul>  <p>  \t  This course is an introductory course with just over 35  minutes of teaching divided over 18 lectures.   Each lecture is short and concise, allowing you to get directly to what  interests you the most.  The majority of  the course are slides and screenshots that illustrate the topic clearly, or  screenshare where the content will be demonstrated.  </p>  <p>  \t  If you’ve considered an application or niche system that  utilizes CJ Affiliate (formerly Commission Junction) then this course is a must  to learn how to setup the data feeds.  </p>", 
    "end_date": null, 
    "title": "How to Setup a CJ Data Feed", 
    "price": 0, 
    "instructors": "Paul Buchanan", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295395_e91c_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-setup-a-cj-data-feed/", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-06T18:38:23Z"
}