{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is about how to market / promote your Joli Communications Chatline business as an affiliate of Joli. The target audience for this course are the affiliates of Joli. You should take this course if you have joined Joli as an affiliate and you are getting ready to take off with the business. </p><p>This course is all about how to promote your Joli chatline number. Its about how to use various marketing techniques to bring in new callers and attract more attention to your business.</p><p>This course outlines 24 different ways in which you can market and promote your chatline business. You don't have to do every single technique, but you may want to implement 7-8 of them, as in combination, you will see the result in your business.<br></p><p>Your course tutor explains every technique with the advantages and disadvantages, and a rating for cost (low to expensive), and a rating for effectiveness from 1 out of 5, to 5 out of 5. You can choose the low cost, highly effective techniques.</p><p>It is recommended that you choose your favorite five, and implement them daily. If you do nothing else, but 5 pieces of marketing every day... your business will grow. It's when you take no action, that you are in danger of just waiting - and going out of business. There is more than enough callers to go around for everyone. Its your choice, whether you want to be proactive - and apply some techniques, or reactive - and just wait for things to happen and hope that they get better!</p><p>The course will take approx 1 hour to complete. We take 6 techniques per lecture and go into them - looking at the advantages and disadvantages. We also cover how the commission and bonus structure works, and how and where to go to register as self employed.</p><p>This course is a prerequisite for those who have joined Joli as an affiliate. It is free for affiliates, and we'd encourage you to take it more than once.</p>", 
    "end_date": null, 
    "title": "Joli Marketing", 
    "price": "50.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702276_a8c0_2.jpg", 
    "course_url": "https://www.udemy.com/joli-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T18:07:56Z"
}