{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>The purpose of this course is the critically breakdown the usage, importance and relevance of Keyword Research</strong></p><p>The purpose of doing efficient keyword research is to rank your content on the top 5 of google. Right? </p><p>You want to rank in google for more exposure, to make money and to share you niche. It all starts with the Keyword Research surrounding your niche and the On Page SEO once you find the right keywords. </p><p><strong>Thats what you will learn here</strong>. You will understand keywords differently, google ranking factors, niche marketing with your content (everything on your site is a marketing tool)</p><p><strong>You’re Right: </strong>Keyword Research and On Page SEO isn’t as easy as some may make it seem. I'm here to let you know that it isn't, but it's not rocket science either. You will learn easy ways to understand and find keywords. </p><p><strong>Here we are slimming down the fat</strong><br></p><p>I also provide a list of the most profitable and traffic gaining keywords (<strong>Its all about Intent)</strong></p><p><strong>It's Not Your Fault: </strong>There is an overwhelming amount of information about keyword research and On Page SEO online. Some say \"this\" and some say \"that\". </p><p><strong>Lets Face It:</strong> The top 3 of google is where you want to be and #1 is where all the selling power lives. </p><p>Keywords are tools, just like any SEO tactic, plugin or strategy. The difference is… a keywords is THE Key that ignites all those aforementioned.</p><p> Without keywords you wouldn’t be able to properly use SEO plugins, create a SEO strategy or know which demographic you’re are targeting. Let alone know what that demographic wants.</p><p>Keyword research is like having a little glimpse into the consumer's mind. </p><p><strong>Keywords let you know what someone looking for:</strong></p><ul><li>Information </li><li>Buying Insight </li><li>Entertainment </li><li>News</li></ul><p>Actually want out of their search. </p><p><strong>I’M SURPRISED</strong>… people don’t use some of these free tool.</p><p>A common misconception is that keywords are only search for with google adwords or some paid tools (they are and those tools are very important to keyword research- it's just not it)</p><p>There is also looking through the current content on the top 10 of google's search to see what it ranking and what information is on those pages/post/</p><p>This course are for online marketers looking to gain more long tail traffic, aspiring SEO pros, the solo-entrepreneur who is looking to build niche or authority sites (there is a thin line between the two) in any industry.</p>", 
    "end_date": null, 
    "title": "Keyword Research & On Page SEO Guide for Business Websites", 
    "price": "35.00", 
    "instructors": "RJ Bryan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689250_141d_2.jpg", 
    "course_url": "https://www.udemy.com/keyword-research-on-page-seo-guide-to-making-2k-per-month/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-04T23:10:36Z"
}