{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>You are about to uncover the most effective way to generate a buyers list on autopilot. A buyers list is essential for generating tons of cash online every single day. You are not only building up a list, but an asset. This method is so effective that you only have to set it up once, and you reap the benifits from it forever. This will build your list on autopilot and generate fresh new leads to it, every single day.<br style=\"\"></p>  <p>  \t<br style=\"\">  </p>  <p>  \t      This is so effective we conducted a case study and generated 97 leads to an email list in one day. This is the best list building course on udemy. If you looking to not only generate a list, but a buyers list, you need to enroll RIGHT NOW.  </p>  <p>  \t  The method in the course is not only effective, but completely outsourced! This is unlike any other list building course out there! This is not some fluff filled course that gives you info you don&#039;t need. It&#039;s action packed an works right now! Enroll now and don&#039;t miss out on this amazing method!  </p>  <p>  \t<br style=\"\">  </p>  <p>  \t    Every single minute that you don&#039;t enroll, you are actually LOOSING money!  </p>  <p>  \t<strong style=\"\">There&#039;s also a 30-Day money back guarentee, NO QUESTIONS ASKED!</strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Enroll Now!</em></strong>  </p>  <p>  \t<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Learn How To Build A Buyers Email List On Autopilot", 
    "price": "20.00", 
    "instructors": "Francesco Iantorno", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422072_f1c7_2.jpg", 
    "course_url": "https://www.udemy.com/listbuilding/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T21:17:54Z"
}