{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><em>[Course is up-to-date with January 2016 information!]</em></strong></p><p><em>Trusted by 21,000+ students, and with impeccable reviews, you can rest assure I always over-deliver on my promises.</em></p><p>I am going to reveal to you the exact strategies I use on a daily basis to make email marketing the lifeblood of my business. I'm talking exact squeeze page templates, traffic generation -demonstrated!- and following up with your future list to guarantee you make sales.</p><p><strong>Let me tell you what you're going to learn in this information-packed, no BS course:</strong></p><ul><li><strong></strong>How to build a big and responsive list FAST.</li><li>All existing ways to monetize your list. CPA, affiliate, solo ads,.. you name it.</li><li>The <strong>LATEST</strong> <em>trips, tricks and techniques used by the biggest email marketing gurus, </em>laid out in a way that anyone can understand and apply.<span></span></li><li>How to finally jump the gun and start seeing results.</li></ul><p><strong>Here's Why It Works So Well:</strong></p><p>According to Aweber (biggest email marketing service provider in the world), <strong>every dollar invested in email marketing yields $44 in profit.</strong> That's a straight, savage 4400% return on investment.</p><p>This is because email marketing allows you to reach a targeted list of buyers every time you have something to sell, day after day.</p><p>You can continue down the path you're on trying to figure out a way to make money in Internet Marketing <em>OR</em> - <strong>you can digest my direct instructions revealing and DEMONSTRATING how I did it.</strong></p><p>Instant access to this <em>very </em>valuable information is just one click away.. Enroll now and let's get started already!</p><p><strong><em>Oh, and just to make this a complete no brainer... I'm removing all the risk! Our course comes with a 30 Day Full Money Back Guarantee!</em> <em>If you aren't blown away by the information inside it, you'll get 100% of your money back!</em></strong></p><p>Cheers and take care,</p><p>-Howard</p>", 
    "end_date": null, 
    "title": "List Building 2016 Challenge: Exploding Your Email Marketing", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/706444_be4c_2.jpg", 
    "course_url": "https://www.udemy.com/list-building-2016-challenge-exploding-your-email-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-25T16:30:41Z"
}