{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Let’s face it – the biggest problem with making money online today is that there are too many “gurus” promising you things that they can never deliver (nor did they ever intend to deliver on their promises). If you’re like most people who are trying to make money online, you’ve most likely bought your fair share of online marketing training courses.</p>\n\n<p>And my guess is, those courses haven’t really worked out for you.</p>\n\n<p>You’re lured in by these ‘gurus’ into buy their courses thinking everything is going to be very easy. But what they actually teach makes most people sick to their stomach.The usual advice you find in these courses is to sell, sell and sell. And do it all while being pushy.</p><p>During my years as a salesman, well, let’s just say I learned a thing or two about sales. And even though I was interested in learning from the  Internet marketing “gurus”, I always had my guard up, especially when they teach how to sell online. Because of that, I decided to ignore some of the information outlined in their course and follow my instincts.</p>\n\n<p>That’s when my problems online started slowly disappearing. The more I pivoted from the high-pressure sales techniques these courses were teaching, the more money I started making.</p><p>My step-by-step video course reveals the exact same methods I discovered thanks to my years of experience outside the virtual world.</p>\n\n<p>The course is laid out in an easy-to-follow manner and reveals everything you need to know about making money online by “selling” affiliate products without being pushy, aggressive or sleazy.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Step By Step Affiliate Marketing Formula", 
    "price": "20.00", 
    "instructors": "Mr Ken Rudd", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/817190_4a74_3.jpg", 
    "course_url": "https://www.udemy.com/lazy-sales-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-09T13:48:52Z"
}