{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course you will find my exact methods used to find the right products, market them in the right places and create an income stream from affiliate marketing. This is the exact method I use to every week to make a living as an affiliate marketer. I will give you 3 of my most profitable niches and show you the exact method I use to generate a profitable income and show you how to expand on those principles to grow your business.</p>\n\n<p>I will show you how to choose the products, how to find out where your competitors are adverting and how to make sure you beat them to the punch. This is just the start, but will give you a taste of how you can be profitable with just these three products.</p><p>You will then be able to use this formula and replicate it over different niches whether it be on Clickbank or JvZoo, really does not matter once you know the formula.</p><p>You will also get as a bonus my two part series on Facebook marketing which includes how to target traffic and get the lowest CPC rates. I have used this same formula and if you go to my Facebook page you will see these same actions in place growing my list as we speak.</p>\n\n<p>This is a very easy 5 video course that gets you into the game without spending a lot of money, use the techniques and when you are ready then step up and check out my other courses for a more in depth review.</p>", 
    "end_date": null, 
    "title": "The Lazy Way To Affiliate Riches", 
    "price": "20.00", 
    "instructors": "Mr Ken Rudd", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/817406_bd45_2.jpg", 
    "course_url": "https://www.udemy.com/the-lazy-way-to-affiliate-riches/", 
    "currency": "USD", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-09T18:49:24Z"
}