{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>「ライバルは居酒屋だわ」</strong></p>\n\n<p>そう言うと多くの人が驚きます。正確には居酒屋とFacebookがライバルです。僕はあまり知りませんが、21世紀の地球人はFacebookと居酒屋に生命時間の大半を費やして死んでいくそうです。そのくらいFacebookと居酒屋というコンテンツは面白い。</p>\n\n<p>新聞配達員の友人曰く、他人の出産と結婚とランチの写真を見るとイラつくそうです。旅行写真がアップされていた暁には、ディスプレイを鈍器でぶっ壊したくなる衝動に駆られると正直に白状していました。それでも見るのをやめられないFacebook。</p>\n\n<p>多くの人は気付いたのです。</p>\n\n<p><strong>「世界一面白いコンテンツは、知り合いとのコミュニケーションだ」</strong>ということに。</p>\n\n<p>映画やメルマガ、テレビ、書籍、雑誌、音楽、ゲーム、YouTubeなど、世の中にはたくさんのコンテンツが溢れています。しかも、各々のクリエイターたちはそれなりの時間とお金をかけてコンテンツを作ります。</p>\n\n<p>悲しいかな、大抵のコンテンツは、<strong>素人がFacebookに投稿した一つの写真にすら勝てない</strong>のです。だから、読まれない、見られない。</p>\n\n<p>さらにFacebookの登場は居酒屋の売上にも貢献しました。実際に居酒屋業界の売上高はワタミの1,631億円を筆頭に、年々伸び続けています。一見すると、Facebookと居酒屋は関係ないように見えますが、実際は、まるで蜂蜜のように甘い蜜月の関係にあるのです。</p>\n\n<p>Facebookをプライベートの可視化です。ようは、相手が何しているか、どこにいるかが簡単にわかるようになりました。しかもメッセンジャー機能がある。「よう、今から居酒屋、行こうぜ」「今、ワタミにいるけど、来る？」<strong>「地元のみんなで集まっているからおいでよ」</strong>というお誘いが非常に容易になりました。</p>\n\n<p>彼らの集まる場所は居酒屋。だから居酒屋の売上がFacebookのユーザー数に比例して伸びていくのです。（まだ誰も言ってないことですけど、僕は勝手にそう分析しています）</p>\n\n<p>ここでアフィリエイターに厳しい現実を突きつけねばなりません。</p>\n\n<p>居酒屋やFacebook上で行なわれている会話（コミュニケーション）よりも面白いコンテンツを作る自信がなければ、<strong>アフィリエイターはやめたほうがいいです。</strong>メルマガをやめ、ブログをやめ、YouTubeをやめましょう。</p>\n\n<p>人生は有限です。3か月もアフィリエイトに時間を投下して、スズメの涙くらいしか稼げないようであれば、これほど人生を無駄にする行為はありません。もう一度言います。生命時間は限られており、<strong>世界中の人々は刻一刻と死に向かって歩を進めているのです。</strong></p>\n\n<p>たかだか数千円を稼ぐためだけにアフィリエイトをやるなんて馬鹿げています。どうせやるなら、家計を支えるくらいでないと、投下したコストを回収できません。</p>\n\n<p>もし現時点で、居酒屋やFacebookが生み出すコンテンツを超えられないようであれば、まずは<strong>あなたが面白い人間になりましょう。</strong>少なくとも、面白いコンテンツを作れるようになりましょう。アフィリエイターの第一歩はそこからです。</p>\n\n<p>本コースが、貧乏アフィリエイターの福音書になることを願っています。</p>", 
    "end_date": null, 
    "title": "なぜ95%のアフィリエイターは、リアル貧乏脱出計画に失敗するのか？", 
    "price": 0, 
    "instructors": "Haamalu Limited Liability Company", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790488_a297_2.jpg", 
    "course_url": "https://www.udemy.com/95-affiliate/", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-12T10:15:46Z"
}