{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    コンサルティングR株式会社　代表取締役　梅津 晃氏のアフィリエイトの授業です。  </p>  <p style=\"\">  \t    アフィリエイトの基礎知識をデータを交えながらわかりやすく解説していきます。  </p>  <p style=\"\">  \t    アフィリエイト人口ってどのくらい？アフィリエイトで法人化は可能？アフィリエイトでどのくらいの収益が得られるの？という疑問から、アフィリエイトの種類の説明、おすすめのアフィリエイト、サイト実例などを交えて説明していきます。  </p>  <p style=\"\">  \t    正統派のアフィリエイトでしっかり学んで、あなたも明日から在宅ワーカーを目指そう！  </p>  <p style=\"\">  \t    －－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－  </p>  <p style=\"\">  \t    Elearnersとは？  </p>  <p style=\"\">  \t    Elearnersは社会人のための、映像学習サービスです。  </p>  <p style=\"\">  \t    日本の「学ぶ」をもっと身近にし、あなたの夢や目標の達成・成長の手助けとなる場所を目指しています。  </p>  <p style=\"\">  \t    ―スキマ時間に学べる工夫―  </p>  <p style=\"\">  \t    集中力が続くよう、１つのレクチャーは~15分程度と短めに設定。パソコン・スマートフォン・タブレット端末に対応しているため、インターネットにつながってさえいれば、家ではもちろん、通勤中や外出時のちょっとした空き時間を使って勉強できます。  </p>  <p style=\"\">  \t    だから、忙しい社会人でもスキマ時間を利用して学び続けられます。  </p>  <p style=\"\">  \t    ―現場で活躍中のプロから学ぶ授業―  </p>  <p style=\"\">  \t    各テーマにおいて「本質」を学ぶことを重視しています。現役で活躍中のプロを講師に迎え、最新のトレンドはもちろんのこと、本当に役立つことを具体的な事例と共に学ぶことができます。ただノウハウを知るのではなく体系的に学ぶので、授業を受けた後には自分で応用して実践することが可能です！  </p>  <p style=\"\">  \t    Elearnersだけではなく、Udemyでも映像を購入し、学習することができます。  </p>  <p style=\"\">  \t    例えば、こんな授業を見ることができます。  </p>  <p style=\"\">  \t    元ファンドマネージャーが教える経済の流れと連想力  </p>  <p style=\"\">  \t    「経済」というと、とっつきにくいと思う人が多いのですが、私たちはみな「経済」という活動に参加しています。なぜなら「経済」は個人、企業、政府の３つの主体で成り立っているからです。グローバルに戦ってきたファンドマネージャーを講師に迎え、3年後の日本や世界を読む力と、連想力・想像力を身につける授業です。  </p>  <p style=\"\">  \t    甘くない利用規約  </p>  <p style=\"\">  \t    弁護士法人リーガルアクシス代表弁護士　立石量彦氏の法律の授業です。ウェブサービスを運営する上で必要な「利用規約」「コピペじゃダメなの？」「自社に有利にすればいいんじゃないの？」「どうやって作るの？」  </p>  <p style=\"\">  \t    法律のプロフェッショナルが「利用規約」を解説！！ウェブサービスの運営・運営志望の方、ウェブ担当者必見です！  </p>  <p style=\"\">  \t    グローバルクラウドソーシング活用で高品質・低コスト化  </p>  <p style=\"\">  \t    日本にいながら、必要なときに必要な人材を世界中から選んで採用するというビジネスの新しいモデルが今、非常に注目を集めています。  </p>  <p style=\"\">  \t    世界最大級のクラウドソーシングサイトoDesk別ウインドウで開くでは既に290万人にも及ぶ世界中のオンラインワーカーが仕事をしていると言われ、いよいよ仕事の国境がなくなる時代が来ようとしています。  </p>  <p style=\"\">  \t    そのoDeskを実際に利用してテープ起こしや秘書業務などの単純作業からデザイン、ウェブ制作など一定のスキルが求められる作業を高品質かつ日本と比べるとはるかに安いコストで依頼し、ご自身はご自身にしかできない業務に集中するという超効率的な方法で仕事をされている大塚氏を講師に迎え、海外のリソースをどのような場面で活用するべきか、またoDeskを使って判明した海外の仕事事情などリアルな情報やノウハウを伝えていただきます。  </p>", 
    "end_date": null, 
    "title": "正統派アフィリエイトを学ぼう～初級編", 
    "price": 0, 
    "instructors": "映像学習サービス elearners", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322876_131a_4.jpg", 
    "course_url": "https://www.udemy.com/elearners0008/", 
    "subject_name": [
        "Affiliate Marketing"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-20T03:26:41Z"
}