{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>TOP RATED, WORLD CLASS MUSIC FUNDAMENTALS COURSE ON UDEMY   \t      </strong>- <em>UPDATED CONTENT for songwriting December 2015</em>  </p>    <p><strong></strong><strong>Write your own songs</strong></p><p>My course does exactly what the title describes in a simple, relatable way. I help you to create and perform your own music - whether you're a beginner musician looking to get started with your songwriting or you're a seasoned professional I will go through the process of acoustic songwriting - learn guitar (chords, scales, finger picking), vocal exercises and ranges, lyrics, building confidence, performing and much more. </p><p><strong>Why you need this course</strong></p><p>Creating your own songs isn't all that easy. On your own it can be quite confusing, difficult and frustrating. I've been through the process myself, and with the help of lifelong musicians who have helped me I know the ins and outs of songwriting and performing across a range of genres. I want to share this with my fellow beginners, musicians, with you.</p><p><strong>What you will get out of this course</strong></p><p>I will give you straightforward instructions, advice, insights and resources for you to take simple steps to create your first three songs in the genres of your choice. </p><p>I personally provide support within the course daily, answering questions and giving feedback on what you've created so far. I don't just throw you in at the deep end - I provide you with the resources to learn and develop what you need and then help you stroll through to the finish line.</p><p>My course integrates all of the aspects required to be a successful acoustic songwriter. I teach and I preach, with a live performance of a relevant original song by me at the end of each section! </p><p><strong>Why $99?</strong></p><p>As a professional songwriter, performer, and teacher for over ten years I have helped hundreds of people to learn to play guitar, sing and write their own songs. Face to face I charge $50 per hour for a student. To complete everything a student would learn in this course it would cost them between <strong>$500 - $1000</strong> for the lessons. </p><p>To reach more people than I could face to face I decided to create this course. As I add more content I intend to raise the price  but for now I've decided on $99 - the cost of just two lessons.</p><p><strong><em>By paying a small cost for this course I believe you will get your value back, with a lot more by the time you have completed it.</em></strong> </p><p>Ask yourself - how much is learning to write songs worth to you?</p><p><strong>How long will it take?</strong></p><p>Although everyone is different, on average it has taken existing students between 4 - 6 weeks to complete the course, whilst developing their skills and knowledge along the way.</p><p><strong>Who this is not for</strong></p><p>This course is not for anyone looking for a one-click fix. Although I provide you with a path walked enough times that it can be a relatively smooth journey it still requires a lot of time and effort from you to make it happen. If you're not interested in putting in your own energy to become a songwriter then this may not be the right course for you.</p><p><strong>Is there a money back guarantee if I'm not happy?</strong></p><p>Absolutely. I am confident that my course will bring you more value than you spend on the course. As one of the top featured Udemy Music Instructors my motto is 'your success is my success'. If within the first 30 days you feel my course is not going to help you to achieve your goals in creating your own songs then you get a <strong>no questions asked, full discount</strong> straight away.</p><p><strong>What materials are included?</strong></p><p>The majority of my lectures I have chosen to be in video format so that you can hear and see me when we're going through each and every area of the course.</p><p>Aswell as the course lectures, presentations, audios, pdfs and quizzes the course will soon also offers:</p><ul><li>A workbook to track your progress</li><li>A template for creating your own work timeline with goals and milestones</li><li>My full support as an instructor to answer questions, provide feedback and support</li><li>Interviews with other successful musicians</li></ul><p>I will be constantly adding more valuable content and resources to the course as time goes by. Keep checking back here if you're not sure right now and feel free to send me a message with any questions or requests you may have.</p>So go ahead and click the '<strong>Take this cours</strong><strong>e</strong>' button at the top right of your screen. I look forward to seeing you on the course.<p>Feedback from my current students: </p><p> \"<em>Wow, I'm a complete beginner..got this as a christmas present from my boyfriend. I loved it! I've already written three songs with help from the instructor and he's even given me feedback on my songs. Thank you.</em>\" - Hamza mubarik, India </p><p> \"<em>I've paid hundreds and hundreds of dollars on lessons and then John comes along with this course and I can learn, practise, and even get quick feedback for a fraction of the costs. I'd say there are still a few things the course could be improved - like maybe an interview with a famous songwriter? But this still stands well above any teacher or course I've ever used for guitar.</em>\" - Liam Jacob, Miami, United States </p>", 
    "end_date": null, 
    "title": "Acoustic Songwriting. Create your own original songs.", 
    "price": "20.00", 
    "instructors": "John Harper", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/301314_cb45.jpg", 
    "course_url": "https://www.udemy.com/acoustic/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-16T13:33:01Z"
}