{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>Music appreciation for the 21st century. </strong><strong>Learn about Classical Music in the Western world from the Middle Ages to the present. </strong>  </p>  <p>  \t<strong></strong>You’ll begin with an introduction to the various elements of music -- for example, melody, rhythm, pitch and harmony – to give you the basics and vocabulary of music theory to understand and appreciate any type of music.  You’ll then explore the History of Classical Music through its various stylistic periods, from medieval chant right up to the current cutting edge. Anyone interested in classical music will benefit from this course.  </p>  <p>  \t          ______________________________________________________________________  </p>  <p>  \t<strong>    About this course:  </strong>  </p>  <li> Over 1600 happy students</li>  <li> Updated regularly (Latest Update: On January, 2016)</li>  <li> Full, free lifetime access</li>  <li> All future extra and upgraded lectures are always included for free</li>  <li> Unconditional Udemy 30 day money-back guarantee</li>  <li><strong> See testimonials from former students below</strong></li>  <p>  \t                      ______________________________________________________________________  </p>  <p>  \t      This course is structured in 32 sections;  </p>  <p>  \t                      • the first section is devoted to the elements of music in order to give you a detailed primer in music theory: melody, rhythm, pitch, harmony, texture, tempo, dynamics and form. Section 1 includes a <strong>S</strong><strong>hort History of Rock and Roll</strong> to illustrate the musical elements and musical style.  </p>  <p>  \t                      After that, each section is devoted to one of the broad eras of music history:  </p>  <p>  \t<strong>                • The Middle Ages.</strong> Learn about early music beginning with monophony and how polyphony developed during the period of the building of the great cathedrals.  </p>  <p>  \t<strong>                • The Renaissance.</strong> What was happening in music during the period in which Michelangelo was painting the Sistine Chapel? A return to some Ancient ideals led to a rediscovery of the science of acoustics, providing a basis for the theory of modern harmony. How the course of music changed as a result of Martin Luther’s break from the Church.  </p>  <p>  \t<strong>                • The Baroque.</strong> Here we have the origins of opera, as well as a flowering of instrumental music, culminating in the works of Bach, Handel and Vivaldi.  </p>  <p>  \t<strong>                • The Classical.</strong> In reaction to the florid complexities of the Baroque, and influenced by the Age of Reason, the Classical period focused on simplicity and elegance, producing such composers as Haydn, Mozart and Beethoven.  </p>  <p>  \t<strong>                • Romanticism.</strong> The Age of Reason was too “reasonable” for the the Romanticists. They valued heightened emotion over elegance. The music of Schumann, Chopin, Wagner, Tchaikovsky, Verdi and Puccini were some of its greatest accomplishments.  </p>  <p>  \t<strong>                • The Modern Period.</strong> Formerly referred to as the 20th century period, it now needs to reflect its expansion into the 21st century. Some of the greatest composers of this period have been Stravinsky, Bartok, Schoenberg, Britten, Shostakovich, Ives, Copland and Barber.  </p>  <p>  \t                      • We conclude with a retrospective and some final remarks to wrap it all up.  </p>  <p>  \t      ______________________________________________________________________  </p>  <p>  \t<strong>Testimonials from former students.</strong> I concurrently teach this course at Santa Rosa Junior College (for core Humanities credit). Please take a moment to read a few testimonials by Santa Rosa students about this course, as they testify to my passion and command of the subject matter.  </p>  <p>  \t                      “I wanted to thank you, Bill Neely, for sharing your knowledge with us. This has been a super-duper class, and I find myself a little sad to find it drawing to a close. I've always enjoyed classical music rather passively; I now feel that I can be an active participant, with a deeper understanding of the musical concepts, the composers themselves, and their historical context. Very cool!”  </p>  <p>  \t                      —Sandra L  </p>  <p>  \t                      “My love for classical music has grown as I understand more now the times and styles and detours of styles these great composers took. I have found these lectures easy to understand and digest into my appreciation and education of classical music.”  </p>  <p>  \t                      —Kathy J  </p>  <p>  \t                      “I wanted to thank you for this wonderful class. I have a doctorate degree, and this has been one of the most thorough and informative classed I have ever taken. It has deepened my understanding and enjoyment of the music I have been listening to for the past 35 years...I wanted to let you know how much I appreciate the depth and clarity of presentation of this class. Do you offer any other online classes? I have recommended it to many of my friends…”  </p>  <p>  \t                      —Loretta Z  </p>  <p>  \t                      “I really like your lectures, very informative, interesting and filled with a lot of information… This is what I hoped for in an online course. Great lectures, this is the first online class I've taken that I felt the instructor was as dedicated to his online students as his in-person ones.  </p>  <p>  \t                      Thank you!”  </p>  <p>  \t                      —Stephanie M  </p>  <p>  \t                      “...lectures were terrific, especially the use of the history of Rock 'n' Roll to begin a very clear and concise exploration of the basics of music ...Thanks very much for teaching such an excellent course. Sincerely,”  </p>  <p>  \t                      —Daniel N  </p>  <p>  \t                      Many more testimonials available on my musicappreciationonline dot com website.  </p>", 
    "end_date": null, 
    "title": "Adventures in Classical Music—Music Appreciation for All!", 
    "price": "50.00", 
    "instructors": "William Neely", 
    "commitment": "31 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41273_40d1_7.jpg", 
    "course_url": "https://www.udemy.com/adventures-in-classical-music/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-12T05:23:45Z"
}