{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>¿Te gustaría iniciarte en la música? ¿Quieres acceder a un Conservatorio, escuela de Música o academia?, ¿Estás ya en primer curso pero te cuesta la asignatura de Lenguaje Musical? </p><p> <b><i>                                                   ¡Este es tu curso!</i></b></p><p>Te ofrezco un curso de iniciación a la música único, explicado paso a paso y completamente en vídeo de gran calidad. En los próximos 212 minutos aprenderás todo lo que necesitas para comprender el lenguaje de la música y ser capaz de hacer dictados.</p><p>Tu pantalla se convierte ahora en una gran pizarra donde te iré enseñando todos los elementos musicales: notas, silencios, figuras y duraciones, compases y tempo, sincopas y notas a contratiempo, matices dinámicos, escalas y arpegios e intervalos. Todo ello con animaciones y ejemplos para que lo veas muy claro. </p><p><b>Contenidos</b></p><p>6 Capítulos de TEORÍA musical con un TEST final y 45 EJERCICIOS AUDITIVOS (dictados) para desarrollar el oído y la escucha activa. El curso tiene como material complementario un cuadernillo para hacer los ejercicios (descargable e imprimible)<b></b></p><p><b>¿Quién puede apuntarse al curso?</b></p><p>Cualquiera que tenga interés en la música y quiera aprender desde su casa y a su ritmo. La edad recomendada es a partir de 8 años.</p><p>Le resultará especialmente práctico a los alumnos de primer curso de Lenguaje Musical de Escuelas y Centros de Música y a aquellas personas que quieran acceder a estos centros. </p><p><b>¿Qué nivel vas a alcanzar? </b></p><p>Cuando termines este curso tendrás todos los conocimientos de lenguaje musical de un primer curso de enseñanzas oficiales.</p><p><b>¿Qué necesitas?</b></p><p>Únicamente inscribirte y tener unos altavoces o auriculares. Las primeras 7 lecciones son de teoría musical pero a partir de la lección 8 tienes los ejercicios auditivos para desarrollar el oído y la escucha activa. Están presentados de forma muy original para ayudarte a mejorar rápidamente: La solución al ejercicio aparece en pantalla. Así, las notas se van colocando en el pentagrama, sincronizadas con su sonido. </p><p><b>¿Debo seguir el orden del curso?</b></p><p>Sí. Es importante que sigas el orden de las clases presentadas dentro de cada sección. No obstante, puedes mezclar las lecciones de los bloques a tu antojo. ¿Hoy quieres hacer dos ejercicios? ¡adelante! </p><p><b><i>                                    Eso es todo. ¡Nos vemos en el curso!</i></b></p>", 
    "end_date": null, 
    "title": "Aprende Lenguaje Musical Desde Cero ", 
    "price": "25.00", 
    "instructors": "Yolanda Victoria Jordán López", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537868_652d.jpg", 
    "course_url": "https://www.udemy.com/curso-lenguaje-musical-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T11:53:49Z"
}