{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t  Take a real college introductory Music Theory Online class, Basic Concepts of Music from Professor Kris Maloy. Using his 10 years of university teaching experience, he&#039;ll teach you Music Concepts: notes, scales, chords, melody and harmony, and rhythm.  </p>  <p style=\"\">  \t<strong style=\"\">Become a Great Musician</strong>  </p>  <p style=\"\">  \t  In Basic Concepts you will learn to understand music with no prior knowledge required. You&#039;ll learn the musical alphabet, scales and keys, chords, rhythm and much more, all in a beginner-friendly way in this Music Theory Online class.  </p>  <p style=\"\">  \t  By the end of this course, you&#039;ll understand Music Concepts and be able to read a full piece of famous music.  </p>  <p style=\"\">  \t<strong style=\"\">A Better Way to Learn Music Theory</strong>  </p>  <p style=\"\">  \t  Professor Maloy brings 10 years of experience teaching at four major state universities. Hundreds of his students have gone on to become real professional musicians. Enjoy over 13 hours of real college lectures.  </p>  <p style=\"\">  \t<strong style=\"\">Real College Class</strong>  </p>  <p style=\"\">  \t  This Music Theory Online class is a real college class and lectures are the same as taught at major state universities. No false promises, no false shortcuts. This is a real music theory class at a fraction of the price.  </p>  <p style=\"\">  \t<strong style=\"\">Who Should Take This Course?</strong>  </p>  <p style=\"\">  \t  Basic Music Concepts is great for beginner musicians of any age:  </p>  <p style=\"\">  \t  ·  College music majors in their first year can ace their first-year classes.  </p>  <p style=\"\">  \t  ·  High school and Junior High students can get ahead of the game.  </p>  <p style=\"\">  \t  ·  Amateur performers and garage bands can learn to read their favorite songs  </p>  <p style=\"\">  \t  ·  Performers who play by ear can write better songs.  </p>  <p style=\"\">  \t<strong style=\"\">What Former Students Say</strong>  </p>  <p style=\"\">  \t  &quot;I thoroughly enjoyed studying with Dr. Kris Maloy because he cared enough to become aware of my personal musical background and found a common ground so that he could find the best ways to explain certain concepts and ideas. I would highly recommend studying any music course with Dr. Kris Maloy and would expect you to have the same positive results and experiences that I had.&quot;  </p>  <p style=\"\">  \t  --Maggie McClure, singer/songwriter with two albums and placements in film, TV and commercials  </p>  <p style=\"\">  \t  &quot;Dr. Maloy has a piercing ability to see through the murky, convoluted mess that is music theory and pull out all of the lowest common denominators – the fundamental building blocks of method. He shares this clairvoyance with students through a practical training that sidesteps the pretense.&quot;  </p>  <p style=\"\">  \t  --Bryan Mitschell, pro drummer and audio producer, now university faculty  </p>  <p style=\"\">  \t  &quot;I found Kris&#039; methods to be sound, informative, and practical. Studying with him gave me the skills, desire and enjoyment to continue working in the field of jazz arranging.  I highly recommend Kris Maloy and his very skilled system of teaching.&quot;<br style=\"\">  \t  --Mark Giammario, pro drummer, now university faculty  </p>  <p style=\"\">  \t  &quot;Dr. Maloy has the ability to effectively communicate complicated musical ideas and techniques to musicians of any level.  Dr. Maloy’s familiarity with academic music as well as modern popular music has made his curriculum uniquely relevant. My experience with Dr. Maloy has been extremely enjoyable and enlightening and I would recommend his curriculum to any musician looking to dive deeper into important  musical concepts.&quot;<br style=\"\">  \t  --Nick Poss, pro singer/songwriter  </p>", 
    "end_date": null, 
    "title": "Basic Concepts of Music (Real College Course Preview)", 
    "price": "30.00", 
    "instructors": "Kris Maloy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/60517_3511_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-read-music-musivu/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-17T14:24:32Z"
}