{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong>COURSE UPDATES:</strong></p>\n\n<ul><li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n<p>  \t<strong>COURSE DESCRIPTION:</strong>  </p>\n\n\n\n<p>  \t    Having a basic understanding of Music Theory is essential to becoming a proficient musician (no matter what instrument you play!). MusicProfessor's Theory curriculum will help you gain valuable knowledge about how sound is made, an understanding of scales, key signatures, and rhythms, and learn how to read, write, and interpret musical notation.  </p>\n\n\n\n<p>  \t    Learning Music Theory can seem challenging and boring, but we promise that our course will keep you motivated and fill your head with tons of useful musical know-how.  MusicProfessor’s Music Theory course provides an entire year’s worth of private instruction, for a fraction of the cost, and at your own convenience.  Plus, the course is taught by a leading University Professor, Dr. Blaise Ferrandino.  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>COURSE FEATURES:</strong>  </p>\n\n\n\n<ul>  \t<li>Over 30 video lessons</li>  \t<li>Animated diagrams, musical staff, and charts</li>  \t<li>Learn how sound is made</li>  \t<li>Learn important musical terms</li>  \t<li>Master reading and interpreting different rhythms</li>  \t<li>Learn how to build Major and Minor scales</li>  \t<li>Learn how the keyboard is setup and why it’s important for all Western music</li>  \t<li>Learn to interpret Key Signatures and Time Signatures </li>  \t<li>and, most importantly, learn how to read music!</li>  </ul>\n\n\n\n<p>  \t    MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum, and, best of all, your purchase is backed by Udemy’s 30-day guarantee.  </p>\n\n\n\n<p>  \t    Fulfill your musical destiny by enrolling today!  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>NOTABLE REVIEWS</strong>  </p>\n\n\n\n<p>  \t<em>“I have enjoyed the Music Theory course.  It has enabled me to get a basic understanding of scales, time signatures, and reading ledger lines.  I started piano 40+ years ago and I wish something like this would have been around then.  A great resource.”</em>  </p>\n\n\n\n<p>  \t    -J. Ainley  </p>\n\n\n\n<p>  \t<strong><br>  \t</strong>  </p>\n\n\n\n<p>  \t<strong>ABOUT THE INSTRUCTOR:</strong>  </p>\n\n\n\n<p>  \t    Dr. Blaise J. Ferrandino is Professor and Division Chair of Music Theory and Composition at Texas Christian University where he has been since 1990. Besides his work as a composer, Ferrandino is a Music Theorist and Double Bassist. His degrees are from Ithaca College, Syracuse University, and the Hartt School. He is active in publishing, presentation, and composition/performance. At TCU he has served as Interim Director of the School of Music and Chair of the Faculty Senate. Beyond TCU, Dr. Ferrandino has served as President of the Texas Society for Music Theory and has served as a member of the National Arts Advisory Committee of the College Board. He is a College Board consultant for Music Theory in the Southwest Region.  </p>\n\n\n\n<p>  \t    Dr. Ferrandino is active in AP Music Theory teacher training, teaching week long courses for twenty years at TCU, and in Philadelphia, Albuquerque, Little Rock, Taos, and Chicago. He has organized and presented at one and two-day workshops at the College Board regional AP Music Theory Conferences. He is lead editor and author of The AP Vertical Teams Guide for Music Theory.  </p>\n\n\n\n<p>  \t    Compositions include song cycles, orchestral pieces, a wide-ranging assortment of chamber music, an opera, and solo works. His most recent published works are Song and a Dance for Double Bass and Piano commissioned by the International Society of Double Bassists to serve as the compulsory piece for their 2011 competition andCrucible, commissioned for the TCU Trombone Summit quartet competition. The musical drama Retrieving the Spirit premiered in April of 2012. Symphony for Wind Ensemble is due to premiere in Fall 2013.  </p>\n\n\n\n<p>  \t    —  </p>\n\n\n\n<p>  \t<em>This course has been provided by MusicProfessor, an online music education company.</em>  </p>", 
    "end_date": null, 
    "title": "Beginning Music Theory: Understanding Music Made Fun + Fast!", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/182122_73dc_4.jpg", 
    "course_url": "https://www.udemy.com/music-theory-a-beginners-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-13T23:01:41Z"
}