{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Breaking Down Barriers to Music Theory</strong></p><p><strong>by</strong></p><p><strong>David Jefferson B.A., M.M.</strong></p><p><em>Breaking Down Barriers to Music Theory </em>was created as a helpful resource to introduce the student to the world of music theory, and a broadening understanding of what is going on in the music they are hearing and playing.</p><p>At times, music theory to some may seem overwhelming, overcomplicated, unnecessary, time-consuming, and even scary. I personally created <em><em>Breaking Down Barriers to Music Theory</em> </em>to change that stigma. I want to prove that reading music, and understanding the music on a deeper level is totally capable by taking it in small parts, a few minutes every day, and through a very simplified approach.</p><p>This course will introduce you to the language of music, both written and played, as well as giving you the building blocks required to progress to the higher levels of music theory and analysis.</p><p>Not only do I believe in this method, but I believe in <strong>YOU</strong>, and I want to see this method work for you by doing everything possible in my power as an instructor. There is too much happening in the music around us not to appreciate every element, and in doing so, you just may begin to appreciate the music around you <em>even more</em>.</p><p><em>\"You simply won't find this much, this simple, this cheap, anywhere else!\"</em></p><p><em></em></p><p><em><br></em></p><p><em>-David Jefferson B.A., M.M.</em><br></p><p><em>Pianist, Composer, Instructor</em></p><p><em><br></em></p><p><em><br></em></p><p><em><br></em></p><p><em><br></em></p><p>(C) 2016 David C. Jefferson (C) 1999 Music Theory On Line (C) Edith-Mcintosh MCMLVI by Carl Fischer, Inc., New York</p>", 
    "end_date": null, 
    "title": "Breaking Down Barriers to Music Theory (Part 2 of 4)", 
    "price": "30.00", 
    "instructors": "Mr. David Jefferson B.A., M.M.", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/750024_4b61_2.jpg", 
    "course_url": "https://www.udemy.com/breaking-down-barriers-to-music-theory-part-2-of-4/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T12:30:48Z"
}