{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Suitable for music lovers or students of all ages and levels, that want to develop a professional musical ear so they can pursue a career musical performance, or become a literate music lover. Through this college style 32 lesson course, chock full of downloadable audio, video and pdf content, you will learn how to practice and master the fundamentals of music theory with ear-training and sight-singing exercises, using only the 7 notes of each of the 30 keys-tonalities-scales you are practicing.</p><p>You will develop a professional musical ear and establish a mastery of the tonal concepts that define this scale-key-tonality. Each of the 7 parts has 2 sub-parts (in all 14): theory and relevant ear-training and sight-singing exercises; this will cement your newly acquired knowledge through practical drills.</p><p>Starting with lesson 1, you will learn how to create, recognize, remember and practice with the 7 notes of this scale 3 types of modal scales, 4 intervals, 3 triads, 4 seventh chords and 5 ninth chords; you will enjoy clear explanations about the meaning of every combination of notes and their functions, as they establishes the value and importance of the Do Major, C Major natural scale.</p><p>The theory and practice exercises are divided in 7 parts that cover the relevant tonal combinations of the 7 notes of this scale; it will teach you how to read, write, practice and remember through deliberate listening and singing, simple to complex exercises. These are the elements of your musical vocabulary. This course leads seamlessly in the 2nd course, the la minor, a minor harmonic scale, all the way to course 32. </p><p>All listening and singing exercises are supported with theoretical definitions and notes that will make it easy to understand and permanently embed this important skill {a musical ear}.</p><p>Students completing course 1 pf 32 will have the knowledge and expertise to function fluently in the Do Major, C Major natural scale; in short time you will be able recognize, perform and create original musical patterns in this scale. In short, you will have developed Musical Perfect Pitch (the ability to recognize notes by their exact name, aka absolute pitch and also recognize structural combinations and relationships of notes, aka relative pitch). Developing a musical ear is the first step to becoming a professional and competent musician and an educated, literate music lover.</p><p>Complete with working and printable 32 PDF files (76 pages) you will be able to work alongside the author, as you study and practice each concept and exercise, and you will receive a verifiable certificate of completion upon finishing the course.</p>", 
    "end_date": null, 
    "title": "Ear-training Lesson 1 of 32 with a Juilliard Scholar", 
    "price": "25.00", 
    "instructors": "Professor David Livianu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441854_980c_11.jpg", 
    "course_url": "https://www.udemy.com/learn-music-with-a-juilliard-scholar-ear-training-1/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T11:19:34Z"
}