{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>What you get:</strong></p><ul>\n<li>In the <strong>first part</strong> of this course you are going to learn the basics of harmony and chord progressions.</li>\n<li>In the <strong>second part </strong>you will learn how to come up with great sounding harmonies and chord progressions and how to find voicings \"that work\" in your own compositions and make them sound more interesting.</li>\n<li>Along the way, we are going to share a lot of our specific composition knowledge and experience.</li>\n<li>You will get around 3 hours of studio sessions with Francois.</li>\n</ul><p><strong>What you will learn:</strong></p><ul>\n<li>Principles of western harmony</li>\n<li>Theory of chord progressions</li>\n<li>Applying this knowledge and finding better chord progressions in your own productions</li>\n</ul><ul>\n<li>We will show you how to come up with interesting and fresh chord progressions for various types of musical genres like house, pop, rock, rnb, blues, classic, future bass, progressive house and many more</li>\n<li>We are going to show you many nice sound examples - offering a practical application of our theoretical frameworks</li>\n<li>We are going to deeply analyze chord progressions and find out</li>\n</ul><ul>\n<ul>\n<li>why some chord progressions simply work and others don't</li>\n<li>rules and codes for “hit song\" progressions</li>\n</ul>\n<li><ul>\n<li></li>\n</ul></li>\n\n</ul><p><strong>Who is it made for?</strong></p><ul>\n<li>This course is designed for electronic music producers - we are going to take the perspective of someone working inside a DAW (Digital Audio Workstation - like Cubase, Logic Pro, Ableton Live, FL Studio).</li>\n<li>The course is designed for beginners but its also suitable for advanced learners of the subject as we go into great detail after our first “basics” block is covered.</li>\n</ul><p><strong>What students say:</strong></p><ul>\n<li>\"Fantastic tutorial on composition! I'll be checking more of your guys stuff out\" - Nathan L.</li>\n<li>\"I am overwhelmed by your work. You can tell how much effort and time you spend on each video/track. I just wanted to say thank you for all the tips and tricks you have shown us!\"</li>\n<li>\"The first course you provided is awesome! Give us a new one :) Love it!\" - Woy R.</li>\n<li>\"I think your course \"Producing a Modern Track from Start to Finish in Ableton\" was phenomenal. Please make more courses like this!“ - Eduardo A.</li></ul>", 
    "end_date": null, 
    "title": "Harmony and Chord Progressions", 
    "price": "50.00", 
    "instructors": "Francois Rengère, Thomas Joliet", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725996_b40b_2.jpg", 
    "course_url": "https://www.udemy.com/harmony-and-chord-progressions/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T19:21:00Z"
}