{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Learn Jazz Piano.  This course is an introduction to learning how to REALLY play piano. It uses jazz as an example, but can apply to any style of music you want to learn.  Music can help you in your daily life.  No, it can't solve everything, but it can connect you with something bigger than yourself, and offer refuge and connection in yourself, and for others when you ultimately play for and with them. Yes, it takes some discipline, but even a minute a day is a start.  This course presents information in a clear and simple way.  It doesn't teach you \"pieces\" that you learn like typing.  It teaches you how to connect your ear to the piano, and ultimately, play whatever you feel and hear inside.  And the piano is so fun, like a giant box of color paints that never runs out, so you are learning a skill that will stand you in good stead for the rest of your life.</p><p>We will look at such things as keyboard geography (the keyboard is like a city you visit, and learn to walk around!), the importance of good time and how to keep it (it's learning a rhythmic dance!) by tapping your foot, how songs are made of two melodies, how a good song teaches you its own harmony (no paper no nothing needed!) how to play what you hear, not hear what you play.  We look at how to connect your singing voice to what you play on the piano (I don't care WHAT your 3rd grade teacher said about your musical ability, all humans are musical!!), with the ultimate goal of having fun, expressing your own musical soul and playing for yourself and if you want, for and with other people.</p>  <p>  \t    It's also really cool to note that a recent study based out of Harvard Medical School shows that \"Music has the unique ability to go through alternative channels and connect different sections of the brain.\" Musicians have an \"enhanced ability to integrate sensory information from hearing, touch, and sight.\"  and \"the ability to improvise improved brain connectivity resulting in less dependence on working memory.\"  In other words, Music wires you up to better see the world.  It's like having a magical ability.  And, it's never to late to learn.</p>", 
    "end_date": null, 
    "title": "Hear It, Sing It, PLAY IT! The Secret Of Learning Jazz Piano", 
    "price": "25.00", 
    "instructors": "Sam Spitzer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240564_221d_12.jpg", 
    "course_url": "https://www.udemy.com/jazzpiano/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-10T06:30:18Z"
}