{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong></strong><strong>Learn How To Read Music Fast And Easily!</strong></p><p>If you want to learn how to read music in a very short amount of time, <strong>this course is exactly what you need</strong>. Traditional music lessons can make music theory look so boring. Everything moves so slowly. This course takes a different approach. </p><p><strong>In 4 fast and easy steps you will learn how to read sheet music.</strong></p><p>In step one, you learn <strong>melody</strong>. This is the tune of the song. You learn all about the staff, treble clef, bass clef, ledger lines, sharps and flats and so much more. All of this is presented in a way that is fun and interesting, to keep you motivated. </p><p>Then we move to step two where you learn about <strong>rhythm</strong>. You learn all about time signatures, whole notes, half notes, quarter notes and eighth notes. Then you learn all about the different rests in music and a lot more. Everything is presented in a way that is easy to understand. </p><p>In step three, without wasting any time at all, you learn all about <strong>harmony</strong>. You learn about intervals and how to easily form the most important chords in music. You learn about extended chords, chord inversions and the list goes on. </p><p>Then finally we combine everything together, melody, music and harmony, to actually <strong>read</strong> the music of songs. </p><p><em>So if you want to read music fast and easily, <strong>get this course</strong>.</em></p><p>Here's a quick look at some of the topics that this course addresses.</p><ul><li>Elements of Music - Learn Melody</li><li>Musical Notation and Pitch</li><li>Piano Keyboard - Layout of Piano Keys</li><li>Enharmonics</li><li>Key Signatures and Major Keys</li><li>Circle of Fifths</li><li>Elements of Music - Learn Rhythm</li><li>Duration of Notes and Rests and Time Signatures</li><li>How to Count Notes</li><li>Elements of Music - Learn Harmony</li><li>Melodic and Harmonic Intervals</li><li>Major, Minor, Diminished and Augmented Chords</li><li>Dominant 7th, Major 7th, Minor 7th and Minor 6th Chords</li><li>Combine Melody, Rhythm and Harmony to Play Song</li><li>Let’s Read Music</li></ul><p><strong>Take this course right now.</strong></p>", 
    "end_date": null, 
    "title": "How To Read Music Fast", 
    "price": "30.00", 
    "instructors": "Mantius Cazaubon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/781110_7f31_3.jpg", 
    "course_url": "https://www.udemy.com/readmusicfast/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-03T13:26:19Z"
}