{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>There are many ways of How to write a song. This course in particular focuses more on the melody creation first. A course inpired from the songwriting skill of the legendary singer-songwriter Sia Furler.</p>\n\n<p><strong class=\"redactor-inline-converted\">Reveals the Possible BluePrint of Sia's Song Melody Making Technique!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>The course discusses the music skill of Sia Fuler and how to mimick it. Then shows you the tools you need and the insane 6 simple steps of making a song melody in under 30 minutes (<em>with an actual composition project demo:</em> from <strong>START to FINISH</strong>): from generating a piece of melody, and working around it to create a complete music composition work with accompaniments. </p>\n\n\n\n\n\n\n\n\n\n<p>This course is structured to give you the essential information you need to make a song melody for your composition projects the quickest way possible.</p>\n\n\n\n\n\n\n\n\n\n<p>These videos are laser focused to help kickstart your music making skill effectively. </p>\n\n\n\n\n\n\n\n\n\n<p>While anyone interested in doing music composition can benefit from this course, it's a great fit for someone who is already an experienced musician, because making song melodies increases your music writing skill to create original compositions and helps you grow as a well rounded musician.</p>\n\n\n\n\n\n\n\n\n\n<p>Wondering if I'm qualified to teach you? Well, have a listen to some of my original compositions right at the curriculum section area below, videos marked \"<strong class=\"redactor-inline-converted\">preview</strong>\", then you decide if I'm the real deal!</p>", 
    "end_date": null, 
    "title": "How to Make A Song Melody in 30 Minutes Like A Rock Star", 
    "price": "20.00", 
    "instructors": "Tyrone Caballero", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/686400_6a60_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-song-melody-in-30-minutes-like-a-rock-star/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-01T21:32:40Z"
}