{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t            Have you ever wanted to understand the jargon of music? Or have you wished to understand the music that you are playing in the deeper and more meaningful way?  </p>  <p style=\"\">  \t                     This intermediate music theory course will help the student understand how music is structured in relation to keys, intervals and rhythm. The course is built to provide step by step information in a logical and systematical way. Unlike many others, this is <strong style=\"\">hands-on</strong> course.  </p>  <p style=\"\">  \t                                         Each lesson includes a video presentation, a PDF presentation that the student can print for review, a worksheet and the answer sheet. By the time you print all the documents, you will have a nice booklet with all the information that you can always refer back to and hands-on assignments that are invaluable since they help solidify the concepts learned in the video. The student should answer the question in the worksheet and check his/her work with the answer sheet. I highly recommend that the student does not skip the assignment sheets. Music theory is learned by doing it.  </p>  <p style=\"\">  \t<strong style=\"\">This course will cover:</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Half Steps &amp; Whole Steps<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Intervals<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Key Signatures<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Flat &amp; Sharp Keys<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Tetrachords<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Major Scales<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">The Circle of Keys<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Sixteenth Notes &amp; Rests<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">The Dotted Eight Note<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Alla Breve<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">3/8, 6/8, 9/8, 12/8 Time Signatures<br style=\"\">  \t</strong></li>  \t<li style=\"\"><strong style=\"\">Syncopation</strong></li>  </ul>  <p style=\"\">  \t                                         Music theory is very important for a musician; it gives us a better understanding of the music we are performing and a structural platform for improvisation. It helps us to sight read, transpose, improvise, compose, and perform better. If you understand the theory behind the music, it will help you perform the piece with a deeper knowledge. Theory is the grammar of the musical language and we need to know it in order to speak the language of music correctly. It helps us understand how music fits together and why it sounds the way it does.  </p>  <p style=\"\">  \t<strong style=\"\">                    Prerequisites</strong>:  </p>  <p style=\"\">  \t                                         Be able to read music and play the piano.  </p>  <p style=\"\">  \t                                         Understand the staff, the clefs; know the letter names of all the notes, understand the measure and how to count the whole, half, quarter, eight notes and the dotted half and quarter notes and all the rests for these notes; understand the repeat signs, first and second endings; the tie and the slur; flats, sharps and accidentals.  </p>  <p style=\"\">  \t                     I am looking forward to help you in any way I can. I have been a professional piano teacher for over 25 years and played the piano in many concerts, recitals, accompanying and conducting choirs over the year. I have written many pieces for choir and small ensemble and orchestrated and recorded many CDs. I will do my outmost to help you understand the topics in this course. Just ask if you need any help!  </p>  <p style=\"\">  \t<strong style=\"\">Enroll today and start learning music theory online!</strong> You will be empowered in your musicianship, performance and understanding of the language of music. Thank you for taking my course.  </p>", 
    "end_date": null, 
    "title": "Intermediate Music Theory - Hands-On Approach", 
    "price": "50.00", 
    "instructors": "Mihaela Williams", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/126316_5e9b_10.jpg", 
    "course_url": "https://www.udemy.com/intermediate-music-theory/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-28T00:05:58Z"
}