{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong style=\"\">In The First Two Weeks, Over 830 Students Have Already Enrolled On This Course!</strong><br style=\"\"></p><p><em style=\"\">LATEST: Course Fully Updated For March 2015</em></p><p><em style=\"\">REMEMBER: The cost of this course will increase to £60.00/$90.00 on May 1st at 9am GMT</em></p><p>**********************************************************************************************************</p><p><strong style=\"\">Have you ever wanted to read and write music?</strong><br style=\"\"></p><p>Is there an instrument that you&#039;ve always wanted to play?</p><p>Do you love to create music but need more training?</p><p>Have you tried learning music theory but found it boring, difficult, and irrelevant?</p><p>If you want to play an instrument, if you want to compose every tune that pops into your head, if you just want to learn music theory that&#039;s interesting and useful, then this course is for you. </p><p>Learn the simple and straightforward secrets of how to get a basic grip on reading music in just a few days. </p><p><strong style=\"\">The simple steps in this course have been tried and tested over seven years of one-to-one teaching with hundreds of students ranging from 4 to 70 years old.</strong></p><p>**********************************************************************************************************</p><p>This course will take you step-by-step through beginner music theory. I have included musical examples throughout so that you can see and hear the results of what I&#039;m teaching.</p><p>No previous musical training is required. You don&#039;t need a piano. You can be any age and any standard on your instrument: you don&#039;t need to be a 5 year old musical prodigy!</p><p><em style=\"\">NEW! Now includes aural and composition tests. Learn to train your ear and compose amazing music.</em></p><p>**********************************************************************************************************</p><p>About this course:</p><ul style=\"\"><li>More than 600 very happy students</li><li>No previous musical training is required</li><li>Completely free lifetime access</li><li>All new lectures and tests are always included for free</li><li>Multiple 5 Star Reviews from students who are VERY pleased</li><li>30 day money-back guarantee - that&#039;s how confident I am that you&#039;ll love my course!</li><li><strong style=\"\">Now includes a mock test for Grade 2 ABRSM. The course is therefore perfect preparation for this internationally recognised musical qualification</strong></li></ul><p>LEARN HOW TO: </p><ul style=\"\"><li>Read and write every musical note </li> <li>Compose your very own music </li> <li>Find out how to play every single scale you can imagine using my very own formula </li> <li>Rewrite any music to suit your own instrument </li> <li>Spice up your compositions by using dynamics, articulation, and ornaments</li></ul><p>Today, you can start to make, read and write music, easily, with no previous experience and without having to be the next Mozart apparent!</p><p>Liam Hindson</p>", 
    "end_date": null, 
    "title": "Learn Music Theory From Scratch- Read, Play & Write Music", 
    "price": "20.00", 
    "instructors": "Liam Hindson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/401508_b383_3.jpg", 
    "course_url": "https://www.udemy.com/note-perfect-learn-to-read-and-write-music-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T20:16:53Z"
}