{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t       Today, more and more people are wanting to learn music. Young children are learning to play the piano, guitar, violin, trumpet, and many more instruments. Music is very unlike any other activity. It is what lets you express every feeling with a simple change in volume or pitch, and captivate an audience after a single key press.  </p>  <p>  \t <strong>This is, if you know what you&#039;re doing.</strong>  </p>  <p>  \tIn this course we will cover all of the fundamentals of music as per the ABRSM syllabus for Grades 1 and 2. In ~3 hours you could be covering the same content as usually is covered in a year of music lessons!  </p>  <p>  \t<strong>Grade 1</strong>  </p>  <ul>  \t<li>The staff, notes, and rests.</li>  \t<li>Writing a 2-bar rhythm as necessary for the Grade 1 exam.</li>  \t<li>Tones and semitones</li>  \t<li>Sharps, flats, and naturals</li>  \t<li>Intervals and scales</li>  \t<li>Chords: triad chords</li>  </ul>  <p>  \t<strong>Grade 2</strong>  </p>  <ul>  \t<li>Quavers and semiquavers</li>  \t<li>More time signatures (2/2, 3/2, 4/2, and 3/8)</li>  \t<li>More key signatures</li>  \t<li>Minor key signatures</li>  \t<li><strong>EXTRA</strong> only in this course: <strong>easily find the number of accidentals for a key signature without having to learn them by heart</strong>!</li>  \t<li>Melodic and harmonic minor scales</li>  \t<li>Commonly used terms and signs in music</li>  </ul>  <p>  \tAlso, in this course, there are <strong>lots of quizzes</strong> (one after each piece of content) for you to get all this music knowledge stick in your brain!  </p>  <p>  \t       I myself have been teaching and studying music for over 12 years, and there is one thing that I notice every time I get a new student: <strong>they got taught music theory all wrong</strong>. Many of them <strong>hated</strong> music theory! My method has always helped them get rid of that <em>harmful</em> dislike for what is one of the most important parts of music.  </p>  <p>  \t       Music theory is the basis of all music. Without it, you cannot understand music, and you cannot know what the composer wanted to convey and express. Therefore you cannot play the music and captivate that audience. Without music theory, you can play random notes and hope they sound well. Maybe you can spend hours to find the tune that sounds well. Knowing how the music works, and why some things sound well and some don&#039;t, will save you all this time and let you play brilliant sounding music from the get-go. You will even be able to do this while creating music on the go, and this is called improvising.  </p>  <p>  \t       However, I won&#039;t be teaching you how to play the piano in this course. This course is for students of all instruments, or if you are wanting to create electronic music but feel like you need a more solid grasp of the music fundamentals. It would even be extremely useful if you are a parent who wants to follow along with your kids so that you can help them if they get stuck, just like my mother helped me and my siblings when we were young.  </p>  <p>  \t       This course contains simple explanations since it is aimed for the very beginner in music. It covers all the necessary contents for students of Grades 1 and 2 in the ABRSM system, which is most common in the UK, US, Canada, India, Australia, Germany, and many other countries. Most likely there are ABRSM examinations available in your country.  </p>  <p>  \t       After each lesson, you will find a quiz that is there to aid in retaining the contents covered in each lesson. In addition, at the end of each of the two Grades covered there are sample exams to help you test yourself.  </p>  <p>  \t<strong>Here&#039;s what other students are saying some of my other courses</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <blockquote>  \t      He is very down to earth, concise, and knowledgeable on the lectures he presents. I am looking forward to more advance courses from Jose -- keep up the wonderful work! - &quot;Jay-Ar Jamon&quot;  </blockquote>  <blockquote>  \t      Was nice and easy to follow for a beginner like me. I&#039;ll definitely be revisiting the course again to refresh my memory since it covered so many topics... - &quot;Clara Chen&quot;  </blockquote>", 
    "end_date": null, 
    "title": "Learn music theory: ABRSM Grades 1 and 2", 
    "price": "20.00", 
    "instructors": "Jose Salvatierra", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/158788_020f_23.jpg", 
    "course_url": "https://www.udemy.com/music-theory-abrsm-1-2/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-05T20:32:59Z"
}