{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Enroll In Udemy's #1 Rated Reading &amp; Writing Music Course Today! </strong></p>\n\n<ul><li>Have you always wanted to Learn how to read and write music?</li><li>Are you a complete beginner who is interested in learning to play a new instrument?</li><li>Or perhaps maybe you already have experience reading and writing music?</li></ul>\n\n\n\n<p><strong>Then this course is for you!</strong></p>\n\n\n\n<p>_________________________________________________________________________</p>\n\n\n\n<p><strong>Hear What Our Students Have To Say! </strong></p>\n\n\n\n<p><strong>High quality videos showing you music from beginner to advanced!</strong></p>\n\n\n\n<p>\"This course delivers on its promise. Its videos are high quality, easy to understand and learn, and they are a perfect length. If you want to learn how to read and write music, this course is a must take! Great for beginner or advanced musicians as well!\" -Aaron Joseph</p>\n\n\n\n<p><strong>Good Course For Beginners</strong></p>\n\n\n\n<p>\"Quite excellent for beginners. If you want to learn how to read music and get behind the theory of it all... this is the course you need to take.\" -Altamese Akiva</p>\n\n\n\n<p><strong>Great Course for beginners and also for those needing a refresher!</strong></p>\n\n\n\n<p>\"I do have a little knowledge of music notation but this is a great refresher. Eric explains everything clearly and precisely. I'd recommend the course to anyone who wishes to solidify his knowledge of how to read and write music.\"</p>\n\n\n\n<p>_________________________________________________________________________</p>\n\n\n\n<p><strong>⇉ Watch the promo video </strong>to see How You Can Learn To Read and Write Music Today!<br></p>\n\n\n\n<p><strong>⇉ Join Over 100,000+</strong> Students Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n<p><strong>⇉ 2500+ Five Star Reviews</strong> Shows Students Who Enrolling Are <strong>Getting Real Results!</strong></p>\n\n\n\n<p><strong>⇉ You receive</strong> more than <strong>30+ lectures and 3+ hours of HD video content</strong><strong></strong></p>\n\n\n\n<p>_________________________________________________________________________</p>\n\n\n\n<p>Hi, My name is <strong>Joe Parys</strong> and Together working with <strong>Erich Bailey</strong>, we will take your music knowledge and understanding from Beginner to Advanced though a series of video tutorial lectures and quizeses. In this course you will learn and have a full understanding of the Staff, and how it works in relation to the musical score. You will learn about all of the notes, bars, and melodies, and we will even discuss how to notate chords. Once you have the understanding of Rhythm and notation, we will move onto the more advanced Topics like: Key Signatures and Key Changes with multiple examples of what they will look like, and then hear them being played!</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>Here is What You Will Learn Throughout Our Entire Course:</strong></p>\n\n\n\n<ul><li><strong>The Basics of Reading Music</strong></li><li>To understand what the Staff is,  all of the notes on the staff, Treble Clef &amp; the Bass Clef</li><li><strong>Rhythm - The Basics</strong></li><li>The student will understand bars and note durations</li><li><strong>Rhythm - Advanced</strong></li><li>Understand more advanced topics like time signatures, dotted notes, triplets, etc...</li><li><strong>Key Signature</strong></li><li>To gain an understanding of Key Signatures and Key Changes</li><li><strong>Advanced Notation</strong></li><li>Learn Alternate Note Names, various Repeat techniques, and learn about Dynamics</li><li><strong>And So Much More! </strong></li></ul>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards understanding and learning how to read music! </p>\n\n\n\n<p>When I learn something new about music I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the Udemy <strong>30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n\n\n<p><strong>Click the \"take this course\" button at the top right now!</strong></p>\n\n\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p><strong>See you in the course!</strong></p>\n\n\n\n<p><strong>Sincerely,</strong></p>\n\n\n\n<p><strong>Joe Parys &amp; Erich Bailey </strong></p>", 
    "end_date": null, 
    "title": "Learn To Read & Write Music - Go From Beginner To Advanced ", 
    "price": "30.00", 
    "instructors": "Joe Parys, Erich Bailey", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566432_6817_2.jpg", 
    "course_url": "https://www.udemy.com/learnmusic/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T19:44:57Z"
}