{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>If you're like most guitarists, you may already know where a couple of your notes are here and there, but for the most part, you probably feel totally lost on your fret board. And who's to blame you, really? I mean, <strong>with 6 strings, and some guitars can have as many as 24 frets, that's 144 note locations to learn!</strong> Whew! That sounds pretty intense! If this sounds familiar to you, then look no further. This course will teach you, <em>step by step</em>, how to easily identify any note on your guitar. By using one simple concept, <strong>it really IS possible to learn every note on your guitar quickly AND efficiently.</strong></p><p>This course is mainly intended for beginners with no knowledge of ANY notes on their guitar. However, even if you're more of an intermediate player, or maybe you know a handful of notes already <em>but feel kind of grey about the middle and upper section of your fret board</em>, as long as you have the desire to learn <strong>every</strong> note on your guitar, this is the course for you. We'll start from the very beginning and learn the names of your strings first, so <em>no matter what your skill level is</em>, you'll be able to pick right up at any point.</p><p>The only real expectation that I have from you is that after each lesson, you'll ABSOLUTELY want to make sure to review the material so that you understand each lesson 100% before moving on. These aren't difficult lessons, but they will pile up and overwhelm you if you're moving on without being ready.</p><p>So with that said, I look forward to \"seeing\" you in class and showing you how one little piece of information can completely open up your guitar for you forever!</p>", 
    "end_date": null, 
    "title": "Learn Every Note On Your Guitar With One Simple Concept", 
    "price": "20.00", 
    "instructors": "Don Roberts", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682140_03e2_3.jpg", 
    "course_url": "https://www.udemy.com/learn-every-note-on-your-guitar-with-one-simple-concept/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T06:06:55Z"
}