{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>A class designed for the electronic musician that wants to take their tracks to the next level. In this class we will focus on learning how to organize pitches and rhythms to make dynamic and interesting melodies and harmonies. No experience with music theory is necessary. Playing an instrument and reading music is also not necessary. We will be focusing on how to use your DAW as your instrument to create with.<br></p><p>For years I've been teaching Ableton Live in the college classroom. As a University Professor, my classes are sought after, and, frankly, expensive. I believe Music Theory can be learned by anyone, and cost shouldn't be a barrier. </p><p><strong>Topics include:</strong></p><ul><li>Using the Piano Roll Editor</li><li>Octaves</li><li>Finding C and Middle C</li><li>The Perfect 5th</li><li>What it means to be \"in key\"</li><li>Moveable Patterns</li><li>Major and Minor Intervals</li><li>Building Triads</li><li>Chord Progressions</li><li>7th Chords</li><li>... And much more!!!<br></li></ul><p><strong>And of course, once you sign up any part, you automatically get huge discounts to all the upcoming parts of this class. You will not have another opportunity to learn Music Theory in a more comprehensive way than this.</strong></p><p><em>J. Anthony Allen is an Ableton Certified Trainer, and a PhD in Music Composition and master of Electronic Sounds. His music has been heard internationally in film, radio, video games, and industrial sound, as well as the concert hall and theater.</em></p><p><em>He currently as an adjunct professor of composition at the University of St. Thomas, Macphail Academy of Music, and the CEO of Slam Academy in Minneapolis.</em></p><p><em>Praise for other classes by J. Anthony Allen:</em></p><li><em>\"I've had Live Lite for a while but never quite understood how to use it because of the different options in how to arrange audio. This course explains exactly how to do that and get the most out of Live.\"<br></em></li><li>\"Great overview - I would start here for sure if you are just getting your feet wet with live. clear and to the point. session walkthroughs are great. looking forward to more\"</li><li>\"I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going thru this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.\"</li>", 
    "end_date": null, 
    "title": "Music Theory for Electronic Musicians", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62511_03cb_7.jpg", 
    "course_url": "https://www.udemy.com/music-theory-for-electronic-musicians/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-27T03:05:56Z"
}