{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Course Description</strong><br></p><p>Music theory Foundations is designed for any person interested in learning the basics of reading western sheet music. It is specifically tailored to students preparing for Music Theory  in a college or university setting, but it is perfect for anyone simply looking to learn, or improve their understanding of, basic music theory.</p><p><strong>What are the lessons like?</strong></p><p>Lessons are presented in short, information-dense modules that are easy to manage and understand. There is no rambling  in this course. The 26 complete lessons each have an accompanying quiz. There are 19 downloadable worksheets and answer-keys as well. The lessons are structured to build on each other making the flow seamless in its progress.</p><p><strong>Who teaches the course?</strong></p><p>Max Keller is currently a faculty member in the areas of music theory and composition at the Mahidol University College of Music. After surveying multiple courses online to help prepare his students for music theory at the College of Music he designed, produced, and narrated Music Theory Fundamentals. If you have any questions while studying this course Max personally responds to all discussions and messages.</p><p><strong>Who should take this course?</strong></p> <ul><li>Any beginning students should take this course without reservation </li><li>High School or Middle School students who are wanting to be ready for the next level</li><li>Anyone who wishes they could read music</li><li>A person who feels they do not have a strong foundation in music theory</li><li>College or university students taking the first year of music theory </li><li>Someone who found other music theory courses boring</li><li>People who want to take one of the best online tutorial courses for beginning music theory there is </li></ul>", 
    "end_date": null, 
    "title": "Music Theory Foundations: Music Notation Made Easy", 
    "price": "20.00", 
    "instructors": "Max Keller", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502540_1570_10.jpg", 
    "course_url": "https://www.udemy.com/music-theory-foundations/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T03:27:11Z"
}