{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Everything you need to pass ABRSM Grade 5 Music Theory with a fantastic result!</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">What is the ABRSM?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>The ABRSM (Associated Board of the Royal Schools of Music) is an internationally recognised examination board for the full spectrum of music exams. Music theory exams are available in 8 \"grades\", and grade 5 is an intermediate level. A pass at this level shows that you have a good understanding of music notation, scales, keys, time, intervals, transposition, basic harmony, chords, general knowledge about orchestral instruments, and composition. </p><p><strong class=\"redactor-inline-converted\">IMPORTANT!</strong> The term \"GRADE 5\" does not refer to a school grade - this is a separate system used by the ABRSM. Grade 1 is beginner level, and grade 8 is advanced - approximately the level of university undergraduate entrance.<br></p>\n\n\n\n\n\n\n\n<p>The graded music exams can be taken by anyone - they are available in over 93 countries and there are no age restrictions. Grade 5 music theory candidates tend to be aged 12-100! For detailed information about the ABRSM's music exams, please see their website.</p>\n\n\n\n\n\n\n\n<p><strong>Why You Need This Course</strong></p>\n\n\n\n<p>I've been specialising in teaching students taking ABRSM music theory exams for over nine years, at all grades. I know the syllabuses inside out, and I also know exactly what problems in understanding students commonly face. </p>\n\n\n\n<p>If you have ever struggled with a wordy music theory text book, been confused by conflicting information, or feel like you don't cover enough theory in your practical lessons to prepare you well enough for your exam, then I believe you will find this course to be a breath of fresh air! Music theory is actually quite logical, and as long as you can read and add up, you can pass your music theory exam with flying colours (or colors, if you are in the USA - this course uses both the UK and USA music terminology, by the way!)</p>\n\n<p>Please take a look at the free preview lectures below to get a taste for the course. I'm always around to answer questions within the course if you need any assistance at any time!</p>\n\n<ul><ul><br></ul>Recommended age for this course; 10 - adult. Very young students will benefit from watching the videos with an adult.</ul>", 
    "end_date": null, 
    "title": "Music Theory ABRSM Grade 5 (Intermediate Music Theory )", 
    "price": "50.00", 
    "instructors": "Victoria Williams", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/810274_2497.jpg", 
    "course_url": "https://www.udemy.com/abrsm-grade-5-music-theory/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-01T18:59:08Z"
}