{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong style=\"\">Music Theory: How to Compose a Melody for an Instrument (Grade 5 ABRSM)</strong></p>  <p>This music theory course will show you how to get <strong style=\"\">top marks</strong> in your <strong style=\"\">composition </strong>in the Grade 5 theory exam (ABRSM). </p><ul style=\"\"><li><strong style=\"\">Find out what the examiners are looking for in your composition</strong></li><li><strong style=\"\">Learn an easy-to-remember method for creating a great composition</strong></li><li><strong style=\"\">Find out what mistakes music theory candidates often make, so you don&#039;t make them yourself!</strong></li><li><strong style=\"\">PDFs included</strong></li></ul>  <p>  \t                                    The composition section of the ABRSM&#039;s grade 5 music theory exam is <strong style=\"\">compulsory</strong> and worth <strong style=\"\">15%</strong> of the whole exam - it&#039;s a real make-or-break question.  </p>  <p>  \t              You can only get a &quot;distinction&quot; (90%+) overall if you do really well in the composition question.  </p>  <p>Come and join me for more than 90 minutes&#039; HD video instruction, 5 flash quizzes, 9 PDFs of notes to download, music examples and online support!</p><p>We&#039;ll cover these topics in depth: <strong style=\"\">Adapting the given opening, rhythm, melody, performance directions, harmonic structure/cadences.</strong></p><p>Not sure if the course is for you? Take a look at the<strong style=\"\"> free preview videos </strong>below, and remember, you get a 30-day money back guarantee.</p><p>The most important thing to understand about this question is that you are being tested on applying <strong style=\"\">music theory</strong>, rather than your skills as a composer. After all, it is not a composition exam! You don&#039;t need to be a budding Mozart; in fact you don&#039;t even need to be able to &quot;hear music in your head&quot;. You simply need to follow the guidelines set out in this course, and <em style=\"\">success will be yours</em>.</p>    <p><strong style=\"\">Bonus Information!</strong></p>  <p>  \t          As you go along, you&#039;ll get plenty of revision of other important music theory topics, such as key and time signatures, how to work out key, melodic minor scales, beaming and intervals.  </p>    <p>  \t                           Each step is presented to you in HD video with an accompanying PDF, so that you can easily follow what I&#039;m explaining and read up on it again for consolidation. You can also use the discussion board to ask questions - I&#039;m happy to help!  </p>  <p>  \t              I&#039;ve also got some real-life compositions to show you, so that you can learn from others&#039; mistakes.  </p>    <p><strong style=\"\">A little about your teacher</strong></p><p>  \t                           I&#039;ve been tutoring students in music theory for over 8 years, and my speciality is training for the ABRSM music theory exams. I&#039;ve taken many students from being abysmal failures at composition to waltzing through on exam day and bagging a merit (80%+) or distinction (90%+) for the exam.  </p>  <p>Hope to see you soon!</p>  <p>  \t                         Victoria Williams</p><p>Founder of the website My Music Theory .com</p><p>Keywords: music theory, music fundamentals, music</p>", 
    "end_date": null, 
    "title": "Music Theory - Composition for Instruments Grade 5 ABRSM", 
    "price": "20.00", 
    "instructors": "Victoria Williams", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385602_4e5a_4.jpg", 
    "course_url": "https://www.udemy.com/grade-5-music-theory-composing-a-melody-instruments/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T12:22:13Z"
}