{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Learn Piano with Rosa -</strong><strong> </strong><strong>Rosa</strong><strong>'s Piano Online School\n-  Teaching 32 Courses!</strong></p>\n\n<p><strong>OVER 10,000  </strong>Successful students\nhave already taken my piano online courses since  July\n2014 with  <strong>231 - 5 Star Reviews</strong></p>\n\n<p><strong>Course Updated: </strong>November 15, 2015</p>\n\n<p><strong>*** ENROLL IN THE #1 RATED Music COURSE ON UDEMY TODAY! ***</strong><strong></strong><br></p>\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++<br></p>\n\n<p><strong>Review from Students who have created the DIY Circle:</strong><br></p>\n\n<p><strong>From  Alene Thornton:</strong></p>\n\n<p>Moving Circle...Such a unique idea</p>\n\n<p>I taught the Circle to all my students but never thought about turning it into a Moving Circle...really brilliant idea, Rosa. This is an invaluable tool.</p>\n\n<p><strong>From  JudyRae Harbin:</strong></p>\n\n<p><em>This moving circle such a BRILLIANT tool &amp; worthy of mass production! Thank you Rosa!!</em><em>You've done a thoroughly \"absorbable and penetrating\" job with it, as you always do!</em></p>\n\n<p><em>Thank you so much for the magic moving wheel, , and for all your work!</em></p>\n\n<p><em>Gratefully, JudyRae</em></p>\n\n<p>------</p>\n\n<p><strong>From Barbara:</strong></p>\n\n<p><em>Thanks Rosa for the instructions on making the Circle of 5th's.</em></p>\n\n<p><em>I am learning in leaps and bounds with your courses. I am more motivated than I have been in the past to keep learning. It's fun now to watch you play and hope to one day be nearly as good.</em></p>\n\n<p><em>Thanks Rosa!</em></p>\n\n<p><em>You have given us so much information in this course and I see you are still adding more. I feel like I am in college and my Major is Music. :)</em></p>\n\n<p>*******************************************************************************************<br></p><p><strong>The Circle of 5ths i</strong>s a fascinating <strong>music tool</strong> for students studying piano, guitar, ukulele ... and as a matter of fact, all instruments studies!</p>\n\n<ul><li>Have you ever wondered what the letters mean?</li><li>Do you know how to make the Circle of 5ths come alive for you?</li><li>What is the difference between Circle of 5ths &amp; Circle of 4ths?</li><li>How is it different from Circle of 12ths?</li><li>How is the Circle of 5ths related to the 12 tones in the span of an octave?</li><li>Are you often frustrated with the order of sharps &amp; flats?</li></ul>\n\n<p><strong>Here's the Secret: </strong>Turn the Static Circle of 5ths into a <strong>Dynamic Moving Circle</strong>. When you watch your circles move, you know exactly what I am talking about!</p>\n\n<p>Learn how to let the 12 tones interact with each so that they can dance together and run harmoniously.</p>\n\n<p>In this course, I will show you how to make a <strong>Do It Yourself (DIY) Circle of 5ths </strong>so that you can use this musical tool wherever you go.  If you take all my Circle of 5ths courses at different levels, you will be able to use this DIY Circle of 5ths to play by ear, to predict chord progressions, to write your own songs, to reharmonize songs with more sophisticated chords, to analyze popular standards.</p>\n\n<p>The DIY Circle of 5ths is my GIFT to all musicians. </p>\n\n<p>Let it become your best friend forever in your music journey!</p>\n\n<p><strong>Many musicians are now using my DIY Circle of 5ths</strong> and they take it along with their guitar wherever they go.  This is a compact handy tool for you to use.  Many of my students are taking it to the piano to play their favorite songs by Ear.  Also ukulele players are in awe of where the Circle of 5ths can take them to pursue their music dreams.</p>\n\n<p>Join Us!</p>\n\n<p><strong>You will also learn the following Magic Circle Tips:</strong></p>\n\n<p>Magic Circle of 5ths Tip 1: Only 12 Letters - 7 Letters &amp; 5 with Enharmonic Names</p>\n\n<p>Magic Circle of 5ths Tip 2: Make Your Circle Run</p>\n\n<p>Magic Circle of 5ths Tip 3: Put Key at 12 o clock position </p>\n\n<p>Magic Circle of 5ths Tip 4: One Circle corresponds to One Octave</p>\n\n<p>Magic Circle of 5ths Tip 5: Create your own DIY Circle - use CD</p>\n\n<p>Magic Circle of 5ths Tip 6: Circle does not move alphabetically like the piano</p>\n\n<p>Magic Circle of 5ths Tip 7: Chord Tones like to Move Up in Perfect 5ths</p>\n\n<p>Magic Circle of 5ths Tip 8: Chord Tones like to Move Up in Perfect 4ths</p>\n\n<p>Magic Circle of 5ths Tip 9: Chord Tones like to Move Up in Perfect 4ths</p>\n\n<p>Magic Circle of 5ths Tip 10: Magic Circle Reveals Key Signatures: Sharps &amp; Flats</p>\n\n<p>Magic Circle of 5ths Tip 11: Right Side - Sharps</p>\n\n<p>Magic Circle of 5ths Tip 12: Left Side - Flats</p>\n\n<p>Magic Circle of 5ths Tip 13: Add 1 More</p>\n\n<p>Magic Circle of 5ths Tip 14: Let Your Circle Become Your Music FRIEND!</p>\n\n<p>Join us and enroll into this course to make your Circle of 5ths.  Let it come alive to you as a Dynamic Circle, and not a Static circle that you often see in books.  This is very unique.  And let's have fun together!</p>\n\n<p>See you all inside,</p>\n\n<p>Rosa</p>\n\n<p>---------------------------------------</p>\n\n<p><strong>Listen to what some of her students are saying regarding her courses:</strong></p>\n\n<p><strong>Chris T</strong></p>\n\n<p><em>Rosa has an unique was of teaching, She structure the course in a way, it let us figure out things first before giving us answers, not spoon feeding us. No dry boring lesson , I feel I'm being taught by how &amp; why it 'works'... and not traditionally rigid like many other course out there. Thumbs up &amp; keep up the good work.</em></p>\n\n<p><strong>Ivan Bradley</strong></p>\n\n<p><em>I have been teaching myself to play the ukulele for the past few months but had been struggling to understand which chords went together and why. I was able to play by ear but it was entirely through guesswork. The circle of 5ths really helps you understand how chord progressions work and Rosa's moving version makes so much more sense than a static circle. It's only been a few days since I started the course but I feel that I have a much better understanding of music theory already. Plus Rosa's voice is so pleasant! I really look forward to listening to the videos and playing my ukulele after a long day at work.</em></p>\n\n<p><strong>Melody Evans</strong></p>\n\n<p><em>I play guitar, Indian flute, and dulcimer, all by ear. This class is helping me to understand music like I have always wanted to. Don't get me wrong, I love playing by ear; I have just always wanted to also understand music. It is a real time-saver for me when I can refer to my Magic Wheel instead of listening for the note or chord that fits. This has opened up a whole new aspect of music for me. Thank you, thank you.</em></p>\n\n<p><strong>Brenda</strong></p>\n\n<p><em>I finished your course The magic Circle of 5ths and I am amazed on how much I have learned. I can finally understand the circle and its purpose. I have study music for several years now, I even went to school and got an associate in music and they mention the circle of 5ths but only to remember the sharp and flats (static circle). I started to create my own compositions and I knew that the circle of 5ths was a great tool but didn't have the guidance to understand it and fully use it until I discover your course. I think you are doing a wonderful job and I can not wait to learn from the level 2 course.</em></p>\n\n<p><br></p>\n\n<p>***************************************************************************</p>\n\n<p><strong>About Rosa's Piano Online Course:</strong></p>\n\n<ul><li><em>Over </em><strong><em>10,000</em></strong><em> </em><em>very happy students already in my classes</em></li><li><em>See the </em><strong><em>5 Star Reviews</em></strong><em> from VERY satisfied students</em></li><li><em>You get free lifetime access</em></li><li><em>All videos are at your finger tips to watch anytime &amp; anywhere</em></li><li><em>All future extra lectures and upgrades are </em><strong><em>always free</em></strong></li><li><em>Unconditional  </em><strong><em>30 day money-back guarantee</em></strong><em> and that's my personal promise to your success!</em></li><li><em>Join this happy family of students </em></li><li><strong><em>Enroll into this course</em></strong></li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong><br></strong></p>\n\n<p><br><em></em></p>", 
    "end_date": null, 
    "title": "Music Tool - Make Your Circle of 5th - Guitar Piano Ukulele", 
    "price": "20.00", 
    "instructors": "Rosa Suen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530122_a76a_4.jpg", 
    "course_url": "https://www.udemy.com/fun-diy-circle-of-5ths-for-musicians-guitar-piano-ukulele/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T07:12:21Z"
}