{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>You're studying for the ABRSM Grade 7 Music Theory exam. You know that there will be a composition to write, but what is expected of you exactly? How do they judge something which seems to be so subjective? What are you supposed to do with the piano accompaniment, or series of chords printed on the page? And how do you know if your composition is any good?</p><p><strong>This course reveals all!</strong><br></p><p>The ABRSM examiners are looking for evidence in your composition, that you have a good knowledge of music theory and can <strong>apply </strong>that knowledge by creating a piece of music, in a silent exam room, with no access to a piano.</p><p>You'll need to demonstrate your skills in crafting a melody which has a strong harmonic foundation - either because it fits the given harmonic framework in the form of a piano accompaniment, or because it's based on a series of given chords, or you have created that framework yourself.</p><p>You're also tested on your compositional skills at manipulating melody - adapting ideas to create new music which is fundamentally related to the original ideas and a sound knowledge of the instrument you are writing for is, of course, essential,</p><p><strong>You will learn:</strong></p><ul><li>what the examiners are specifically looking for in your composition</li><li>how to adapt a given opening to create new material</li><li>how to fit a melody to a given piano accompaniment</li><li>how to write in the correct style for the period</li><li>how to write convincingly for the instrument in question</li><li>how to create a melody based on a series of chords</li><li>tips for creating a really great melody, even if you're not good at hearing in your head</li><li>advice on getting better at hearing in your head</li><li>about \"musical grammar\" and what you should avoid doing</li><li>both question options are covered in detail - 3a and 3b in the exam paper.</li></ul><p><strong><br></strong></p><p><strong>How you will learn:</strong><br></p><ul><li><strong></strong>Lessons are given in several formats. </li><li>Demonstrations are shown as edited live recordings, e.g. you can watch me create a composition based on a past exam paper question in real-ish time</li><li>Instructions are given in animated video format with musical and audio examples. Images are used to highlight the part of the score you need to focus on. E.g. when learning about melodic structure, the animated video will allow you to see the score and hear any relevant music, as I'm explaining.</li><li>PDFs are provided which contain full lesson notes. It's recommended that you print these off before you start, so you can write your own notes down on them as you follow the course.</li><li>Text lessons are given as recaps or for quick explanations.</li><li>You can ask me unlimited questions within the course, either using the course discussion dashboard or via private message.</li><li>Downloadable practice questions are also included.</li></ul><p><span style=\"\"><strong><br></strong></span></p><p><span style=\"\"><strong>About your teacher:</strong><br></span></p>I specialise in music theory exam coaching, in particular for the ABRSM examination board (but not exclusively!) I have taught literally thousands of students via my music theory website, which provides more free resources on music theory exam training than any other site in the world (yes really!) I teach all levels from absolute beginner up to grade 8 ABRSM level, and I love the challenges that the higher grades bring to the table. Grade 7 music theory is a really rewarding exam (and is great on your CV too!): I'm here to help you make the most of it.<p>I graduated from the University of Leeds (UK) in 1995 with a BA Hons degree in music, specialising in musicology, and I'm also a qualified teacher.</p>", 
    "end_date": null, 
    "title": "Music Theory - Melody Composition for Grade 7 ABRSM", 
    "price": "35.00", 
    "instructors": "Victoria Williams", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465156_6b7c_3.jpg", 
    "course_url": "https://www.udemy.com/music-theory-grade-7-abrsm-composition/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T17:46:33Z"
}