{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Welcome to the British School Muscat - Music Theory Grade 1 course. This course covers the complete syllabus for the ABRSM grade 1 theory exam.  Students wishing to sit this exam will gain the necessary knowledge to pass with a high mark but the course is also useful if you just want to brush up on your theory skills.  This course is made up of mainly video lectures but at the end of each section you will be expected to take a short quiz which will help you consolidate what you have been taught. At the end of your study you will have an understanding of the stave, notes &amp; note values, the treble &amp; bass clef, accidentals &amp; construction of the major scale.  You will also learn about time &amp; key signatures, dotted notes &amp; rests, the bar line, intervals, tonic triads, writing rhythms &amp; general questions on a melody.  Many practicing musicians do not take the time to study theory &amp; I feel this is a great mistake.  If you understand the basics of the subject it will help you become a better player &amp; this will in turn help you to enjoy music to the full. Most students who complete this course not only enjoy the learning experience but also go on to study at higher levels thus increasing their musical enjoyment.  The ABRSM currently operate in over 90 countries around the world so wherever you live there will probably be an opportunity to sit an exam.  I hope you enjoy the course &amp; I wish you well with your studies - GOOD LUCK.</p>", 
    "end_date": null, 
    "title": "Music Theory Grade 1 - British School Muscat", 
    "price": "50.00", 
    "instructors": "Michael Luck", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/638124_4d24_3.jpg", 
    "course_url": "https://www.udemy.com/british-school-muscat-music-theory-grade-1/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-12T11:56:36Z"
}