{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<p style=\"\">  \t\t<span style=\" color:rgb(53, 53, 53);\">Music Composition 2 is the second course in a series of two courses that teaches how music is put together and how to write your own music. The course is divided into two parts. Part one covers the study of harmonic composition. Part two covers the study of compositional form. (Rhythmic and melodic composition were studied in Music Composition 1. I</span>t is highly recommended that you take Music Composition 1 before taking this course.)  \t</p>  \t<p style=\"\">  \t\t<p style=\"\">  \t\t\t<p style=\"\">  \t\t\t\t<span style=\" color:rgb(53, 53, 53);\">Course lectures consist of both video and text. (If you would like to read rather than watch videos, each lecture can also be found in .pdf format under the downloadable materials tab) Each section of the course covers a particular concept (or related concepts). Concepts and compositional techniques are demonstrated throughout the course with real musical examples (pictures and audio samples).</span>  \t\t\t</p>  \t\t\t<p style=\"\">  \t\t\t\t<p style=\"\">  \t\t\t\t\t<p style=\"\">  \t\t\t\t\t\t<span style=\" color:rgb(53, 53, 53);\">Besides lectures, each section of the course also contains memory questions, section quiz, listening assignments, and composition assignments. Memory questions serve to summarize and reinforce key concepts learned, while the quizzes tests the students’ knowledge and understanding of the material from each section. Students who take this course will get practice notating music with music notation software. In the composition assignments students will get real life practice using the information and techniques learned in each section to write and develop their own harmonic progressions. By the end of the course students (who have taken both Music Composition 1 and Music Composition 2) will have </span><span style=\" color:rgb(53, 53, 53);\">composed a number of entire pieces in various compositional forms.</span>  \t\t\t\t\t</p>  \t\t\t\t\t<p style=\"\">  \t\t\t\t\t\t<p style=\"\">  \t\t\t\t\t\t\t<p style=\"\">  \t\t\t\t\t\t\t\t<span style=\" color:rgb(53, 53, 53);\">The length of time needed to complete the course depends on how much time is spent each day/week on the material. To complete all the assignments in each section, a suggested pace might be 1-2 weeks per section. (There are 14 sections.) </span>  \t\t\t\t\t\t\t</p>  \t\t\t\t\t\t\t<p style=\"\">  \t\t\t\t\t\t\t\t<p style=\"\">  \t\t\t\t\t\t\t\t\t<p style=\"\">  \t\t\t\t\t\t\t\t\t\t<span style=\" color:rgb(53, 53, 53);\">Who should take this course? Every student of music should know how to compose! It is a sad but true fact that most modern music teachers and music courses do not include music composition as part of the students’ musical education. In the past it was typical for students of music to be able to compose music. The “complete” musician can play an instrument, has knowledge of music theory AND can also compose! If you want to deepen your understanding of music, learn to write it!</span>  \t\t\t\t\t\t\t\t\t</p>  \t\t\t\t\t\t\t\t\t<p style=\"\">", 
    "end_date": null, 
    "title": "Music Composition 2", 
    "price": "50.00", 
    "instructors": "Jonathan Peters", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/330062_a21c_2.jpg", 
    "course_url": "https://www.udemy.com/music-composition-2/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T02:38:47Z"
}