{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">Music Master Plan is a beautifully crafted online course encompassing 3 sections: Foundation, Music Theory, and Fulfillment, comprising 8 lessons. Each lesson takes an active role in the formulation of a complete master plan from the foundation up, comparable to the formation of a magnificent building&#039;s architecture. The first section introduces the 3 primary steps to success, analogously forming the foundation of any secure structure and the basis of any successful music program. The second section reinforces the structure with 3 pillars of fortitude, providing students with strong, technical and theoretical skills needed to strengthen every musician&#039;s master plan. Finally, the last section develops the final 3 elements of a strong roof, enclosing the entire edifice to complete the massive master piece and augment every musician&#039;s dreams with fulfillment. Students will learn what it will take to lead a career as a successful musician if he or she chooses or just live a fulfilling life of musical enjoyment. In either case, students will be left weaving a tapestry of solid habits and disciplines as the formulation of an architectural master piece culminates into a pinnacle of success.</p><p style=\"\">Music Master Plan&#039;s interactive component is designed to integrate students with teachers and parents, synergistically enabling them to transcend today&#039;s competitive musicians. Parents, teachers, and other mentors who consistently play an active role in the student&#039;s routines and education create an environment where students can combine hard work, discipline, dedication and persistence into a formula of success. Music Master Plan will not only teach parents and students how this process is accomplished but serve as a catalyst in motivating and inspiring students to propel them beyond typical thresholds of complacency, quintessentially responsible for suppressing most musician&#039;s progression. </p><p style=\"\">Music Master Plan&#039;s 8 comprehensive lessons are replete with engaging videos, interactive activities, fun quizzes, and ample bonus materials. The curriculum is designed for beginning music students of all ages, but tailored particularly for students ages 8 through 18. The colorful, fun lessons keep students engaged in the learning process with colorful charts, diagrams, concept maps, and quick reference guides. Each lesson is chock-full of helpful tips, how-to&#039;s, and activities specifically designed to help students retain valuable information to augment their studies.</p><p style=\"\">Music Master Plan employs a blend of traditional learning techniques with an innovative new approach to education. This is first accomplished by watching several entertaining animated videos for each lesson. The objectives taught in the videos are then reinforced through fun, hands-on activities and interactive worksheets designed to bring students, teachers and parents together, stretch the student&#039;s thinking, solidify core curricular subject matter and practice difficult to grasp, key concepts. Each lesson is followed up by a quiz to reinforce and retain relevant information with real life application, leaving students with a feeling of confidence for the skills they have mastered. Finally, ample bonus materials and cheat sheets accompany most lessons to reward hard work and give students valuable, tangible material they will come to rely on for years.</p>", 
    "end_date": null, 
    "title": "Music Master Plan: From Music Theory to Music Career", 
    "price": "20.00", 
    "instructors": "Mimi West", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476276_5a8e.jpg", 
    "course_url": "https://www.udemy.com/music-master-plan-from-music-theory-to-music-career/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T18:21:59Z"
}