{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t  This is a course that will dive into many areas of music theory.  <strong style=\"\">This series is for those who want to download or watch my series ad-free</strong>.  The topics covered by this series include:  </p>  <ul style=\"\">  \t<li style=\"\">The science of sound (pitch, frequency, volume, etc...)</li>  \t<li style=\"\">The musical alphabet</li>  \t<li style=\"\">Notation</li>  \t<li style=\"\">Clefs</li>  \t<li style=\"\">Scales</li>  \t<li style=\"\">Steps and intervals</li>  \t<li style=\"\">Triads and extended chords</li>  \t<li style=\"\">Circle of 5ths</li>  \t<li style=\"\">Notes and rests</li>  \t<li style=\"\">Swing and polyrhythm</li>  \t<li style=\"\">Time signatures</li>  \t<li style=\"\">Chord progression and harmonizing scales</li>  \t<li style=\"\">Modes</li>  \t<li style=\"\">Transposing</li>  \t<li style=\"\">Transcription</li>  \t<li style=\"\">acoustics and psychoaoustics</li>  \t<li style=\"\">Ear training</li>  \t<li style=\"\">and MORE!!</li>  </ul>  <p style=\"\">  \tFor musicians and students taking music classes, this course does not require that you play an instrument.  We take away the aspect of an instrument and study the core of music using just notes.  No need to be an expert piano player or guitarist,  all you&#039;ll want to have is a little bit of thinking power and maybe a notepad to take some notes (music notes that is :P).  If you are a musician, applying this information to your instrument will drastically improve your knowledge and skill level.  </p>  <p style=\"\">  \t<span style=\"\">Even if you have no musical experience, this course could be for you.  With this series, not only will you dive into the basics of music but you will also learn a lot about acoustics, ear training, pitch and frequency, harmonics and overtones, and more.  Even if you are not studying to be a musician, this course has content that will help you understand sound as a whole.  This means that if you are a computer technician, an audio producer, a commercial designer, a video producer,  a studio designer, or anything else dealing with sound, you could benefit from this course!</span>  </p>  <p style=\"\">  \tThe course should not take too long to complete, but it is recommended that you stop after each video to take notes and memorize material.  For some topics, you might need to practice or rewatch the video a few times to get everything (there is a lot of content in this course).  Try to memorize...Memorizing this content will forever impact your musical knowledge and make you enjoy music that much more!  </p>", 
    "end_date": null, 
    "title": "Music Theory Classes", 
    "price": 0, 
    "instructors": "Caleb Curry", 
    "commitment": "17 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/70290_dbed_3.jpg", 
    "course_url": "https://www.udemy.com/music-theory-classes/", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-27T00:17:16Z"
}