{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course is an extension of Music Theory for Electronic Musicians, and Music Theory for Electronic Musicians 2, in which we learned how to work with the piano roll editor in a DAW to make harmonies, melodies, and whole tracks. In this class we expand on those ideas and work with harmonic patterns (harmony) that is more rich than just major and minor. </p>\n\n<p><strong>Production Techniques Through Theory<br></strong>The most important part of this class is an extensive foray into using these techniques in actual tracks. I'll be creating 9 tracks through this class, right along with you, each using a different technique so you can see exactly how I incorporate it right into my music.</p><p><strong>Full Sessions<br></strong>After each production project, I'll give you the whole session of what I made using the techniques for you to play with. You can download it, expand on it, re-work it, and even release it as your work.</p><p><strong>If Your Music is Missing Something, This is Probably It.<br></strong>If you are finding that you are writing track after track, and while they sound good, there is something they are missing - then this it. You are missing the sense of harmony that professional producers have. In this class, I'll arm you with all the tools you need to produce those tracks just like you imagine them.</p>\n\n<p><strong>Who should take this course? \n</strong>Anyone interested in producing their own music. This will get you up and running and give your tracks a unique sound in no time.</p>\n\n<p><strong>Structure\n</strong>This course consists of video lectures, which all contain a session in Ableton Live 9. If you are using a different program (or none at all), no worries! This isn't a class on how to use Ableton Live, and the concepts can be applied to any DAW.</p><p><em>Dr. Jason Allen is an Ableton Certified Trainer, and a PhD in Music Composition and master of Electronic Sounds. His music has been heard internationally in film, radio, video games, and industrial sound, as well as the concert hall and theater. His 2015 album, </em>Aniscorcia, <em>reaching the CMJ Top20 Charts and radio broadcasts nationwide. <strong>In 2014 he was named a semi-finalist for the Grammy Music Educator Award.</strong></em></p>\n\n<p><em>He currently as an adjunct professor of Composition and Music Theory at the University of St. Thomas, and the CEO of Slam Academy in Minneapolis.</em></p>\n\n<p><em><strong>Praise for classes by Dr. Jason Allen:</strong></em></p>\n\n<ul><li><em>\"Without a doubt the best explanation and east of use that one can get. It leaves you enough room to go explore. The classes go by quick, so you can be on your way at being proficient. What are you wait for!\"</em></li><li><em>\"Amazing - Seriously Loved It! I took all his courses and have to say I'm so happy! Learnt loads! Jason is an awesome teacher!\"</em></li><li><em>\"I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going through this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.\"</em></li><li><em>\"I like these courses because you can get up and running quickly without having to spend hours of time wading through TMI (too much information!). Jason hits the high points but shows you what you need to know. Thanks!\"</em></li><li><em>\"I've watched many other videos on scales and chords before, however, this one has been the best. I now understand minor scales and chords and even how to analyze songs. It really gave me the confidence to start producing music because I feel like I have some structure and guidelines to follow. AWESOME!\"</em></li><li><em>\"Clear and Informative - Jason has a clear uncluttered style (with the important dashes of humor) of presentation that is focused on the important key aspects of this course. Recommended for those starting out!\"</em></li><li><em>\"Dr. Allen does it again with his music theory series. This course really opened up everything I learned from the 1st section, and now I understand more about the composition side of things for music. I highly highly recommend this course to anyone!!! Really opened my eyes to many things I wasn't aware of.\"</em></li><li><em>\"The Best Teacher Ever, who makes you understand the ins &amp; outs of Music Theory by all means without giving what you don't want to know.\"</em></li></ul>", 
    "end_date": null, 
    "title": "Music Theory for Electronic Musicians 3: Extended Harmony", 
    "price": "40.00", 
    "instructors": "Jason Allen", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/885569_157d_2.jpg", 
    "course_url": "https://www.udemy.com/music-theory-for-electronic-musicians-3/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-22T18:55:31Z"
}