{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>If you are taking the ABRSM Grade 8 Music Theory exam, this course is for you. This question is worth 20% of the whole exam, but since it seems rather \"subjective\" - how can you know whether your composition is any good?</p><p>In this course, you'll learn exactly how to craft a high-scoring composition, which will please the examiners and please you too! </p><p>In this course you will learn:</p><ul><li>How to adapt the ideas of the given opening in the exam question, using techniques such as sequences, imitation, augmentation/diminution and others, to produce a coherent whole.</li><li>How to plan a strong, balanced structure for your composition, using clear phrases and appropriate cadences.</li><li>How to modulate - through which keys, and precisely how to do that, using a variety of methods.</li><li>How to make your performance directions meaningful and idiomatic (suitable for the instrument you're writing for).</li></ul><p><br></p><p>I've been coaching students through their music theory exams for many years, and have a wealth of experience which I'd love to share with you. I'm available via the Udemy discussion board to answer any queries you may have and listen to your comments. </p><p>The course includes several PDFs including a Cadences revision cheat sheet, and a selection of practice Composition Exercises. You are more than welcome to send me your finished product for comment and a likely score.</p>", 
    "end_date": null, 
    "title": "Music Theory - Melody Composition for Grade 8 ABRSM ", 
    "price": "35.00", 
    "instructors": "Victoria Williams", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644474_32f3.jpg", 
    "course_url": "https://www.udemy.com/composition-grade-8-abrsm-music-theory/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T07:01:18Z"
}