{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Become a Figured Bass Pro in 3 Hours (Music Theory)</strong></p><p style=\"\">This course explains in clear steps <strong style=\"\">how figured bass works</strong> and more importantly how <strong style=\"\">you can master it</strong>. We&#039;ll also take a quick peek <em style=\"\">why </em>it exists in the first place!</p><ul style=\"\"><li style=\"\">Perfect for ABRSM Grade 6 and Grade 7 Music Theory Candidates</li><li style=\"\">Step-by-step methods for acing figured bass exam-style questions</li><li style=\"\">Learn how to realize a figured bass</li><li style=\"\">Understand all chord inversions including 7th chords and suspensions</li><li style=\"\">Learn how to create a figured bass line to fit a given melody</li></ul><p style=\"\"></p><p style=\"\">All the fundamentals of musical harmony are explained to you, and you&#039;ll get plenty of tips on best practice as well, so your harmony will sound great.</p>  <p style=\"\">  \t        The course also covers specific exam questions which come up in the <strong style=\"\">ABRSM music theory exams </strong>(grades 6 and 7), as well as in the UK <strong style=\"\">A Level Music</strong> (technical study paper) and <strong style=\"\">AP Music theory</strong>.  </p>  <p style=\"\">  \t        Each lesson contains real music examples and you get to watch me working through the exam questions in real time. I&#039;ll share with you the best way to think through the questions, which rules of harmony have to be obeyed and which are simply guidelines, and how to check through your work to maximize your success.  </p>  <p style=\"\">  \t        Each musical example is worked through as per the exam question rubric, but I then show you how that music could be further decorated in practice to produce beautiful music - <strong style=\"\">all audio is included</strong> of course!  </p>  <p style=\"\">  \t        Figured bass doesn&#039;t have to be difficult. Why not take a look at the free preview lessons to get an idea of how a few rules can be transferred into writing the <strong style=\"\">best possible harmony</strong>!  </p><p style=\"\">The music fundamentals of figured bass take a little time to learn, but once you have mastered the theory, putting it into practice is the fun part. Join me now and take your music theory to the next level!</p><p style=\"\"><em style=\"\">Keywords: music theory, music fundamentals, figured bass</em></p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "Music Theory - Figured Bass in 3 Hours - ABRSM Grades 6 & 7", 
    "price": "40.00", 
    "instructors": "Victoria Williams", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/323430_ff7c.jpg", 
    "course_url": "https://www.udemy.com/become-a-figured-bass-expert-in-3-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-20T18:17:14Z"
}