{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>\"Music Theory for Beat Makers 2: Popular Chord Progressions\" is a Level 2 Course for Beat Makers and Music Producers that want to improve the quality of their music production!</p><p>If you have beat making skills but lack professional training in music theory, this course will help you understand how to play 4 popular chord progressions used in hit songs on the radio! This will instantly separate you from other beat makers trying to fumble their way around the piano and who struggle to put together more musical beats. Anyone can throw together a drum beat but not everyone can actually produce music. After taking this course you will become one of the music producers who can!</p><p>The content is divided into four sections. Each core section will cover one of the 4 chord progressions. You will learn how to play the chord progressions in the key of C (all of the white keys) to make it easy for you to learn and understand. Each section also comes with several examples of hit songs the progressions have been used in and a few tips you can use to apply these chords to your own music production.</p><p>With over 60 minutes of HD quality content and additional resources you will be able to quickly take this course so you can get back to focusing on what you love...making beats and producing music!</p><p>Enroll today!</p>", 
    "end_date": null, 
    "title": "Music Theory for Beat Makers 2", 
    "price": "20.00", 
    "instructors": "Joseph Evans Jr, Matt Guarino", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831484_bff9_6.jpg", 
    "course_url": "https://www.udemy.com/music-theory-for-beat-makers-2-popular-chord-progressions/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T16:14:44Z"
}