{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">First Piano Lessons - Learn Piano Notes on the Keyboard and Music Staff, and Basic Chords and Scales.</strong></p>\n\n<h4></h4>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This absolute beginner's course will teach you how to play piano and keyboard. This is the perfect first course and <strong>introduction</strong> to piano music. You will learn to play the piano from scratch. <br><br>Would you like to play beautiful, entertaining piano music and impress your friends and family? Are you ready to be treated like a celebrity by everyone who hears you play? Or maybe you want to take things further and become a professional player, thrilling audiences all over. If so, <strong class=\"redactor-inline-converted\">you need to enroll in this course</strong>. <br><br>This piano course is for the complete beginner who wants to thoroughly understand the notes of the piano keyboard and music staff, as well as basic scales and chords. It takes you from the very beginning. If you are new to the instrument, <strong class=\"redactor-inline-converted\">this is the perfect course for you</strong>. <br><br>Many piano courses are too advanced for beginners. They delve into advanced concepts that leave you confused. This course corrects that mistake. It lays the foundation you need and keeps everything simple and easy. <br><br>By the time you are through with the various lessons, you will have understood the notes of the piano keyboard and music staff. You will know how to read notes. You will know basic scales and chords. You will have an excellent foundation in piano music and will be well on your way. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you're an absolute beginner in search of an amazing introductory piano course that teaches you how to play the piano quickly and easily, you absolutely need this one. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here's a preview of what you will learn:</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>The Notes of the White Keys</li><li>2 + 3 Black Keys Pattern</li><li>The Notes of the Black Keys</li><li>Sharps and Flats</li><li>Half Steps and Whole Steps</li><li>Piano Keyboard Layouts/Diagrams</li><li>Middle C on Piano Keyboard</li><li>How to Read Notes</li><li>The Music Staff, Treble Clef and Bass Clef</li><li>Ledger Lines</li><li>Notes on the Keyboard and Staff</li><li>Accidentals (Sharps and Flats) on the Music Staff</li><li>How to Play Scales on Piano</li><li>How to Play Basic Piano Chords</li><li>A Lot More</li></ul>", 
    "end_date": null, 
    "title": "Piano Lessons For Absolute Beginners", 
    "price": 0, 
    "instructors": "Mantius Cazaubon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/827464_861a_3.jpg", 
    "course_url": "https://www.udemy.com/beginnerpianolessons/", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-20T21:05:37Z"
}