{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><em></em></p><strong></strong><p><strong>\"After buying loads of books on piano chords nothing has come close to this excellent course … it has to be the best on Udemy\" - Michael Fallon</strong><br></p><p><strong>\"Even if you already know your scales and chords, this course brings you through the variations so that you can do more than just play a triad each and every time.\" - Richard</strong></p><p>This course teaches you how to interpret basic chord symbols at the piano, and explains them:<br></p><ul><li>at the keyboard</li><li>in a visual and intuitive way</li><li>using real pieces of music</li></ul><p>I'll teach you concepts using original techniques that I've tested on hundreds of students over a decade, including signed artists and other industry professionals. By the end you'll know many ways of playing any chord symbol that's likely to crop up in popular music. (I'm working on a follow-up course that teaches more advanced chords that you find in jazz.)</p><p><strong>What this course is</strong></p><p>This course shows you many ways of playing:</p><ul><li>major triads (e.g. C, Eb, F#)</li><li>minor triads (e.g. Dm, Fm, G#m)</li><li>sus chords (e.g. Esus, Gsus, Bbsus)</li><li>7th chords (e.g. F#7, Am7, Cmaj7), and</li><li>slash chords (e.g. Ab/Eb, Bm/E, Dmaj7/E)</li></ul><p>so that you can:</p><ul><li>read a \"lead sheet\" (a score with a melody and chord symbols but no LH)</li><li>accompany yourself singing using just chord symbols, and</li><li>understand how the chord symbols fit a score</li></ul><p>I'll show you many ways of playing each chord so that you can not only work out what chord to play but also turn it into a complete accompaniment.</p><p><strong>What this course isn't</strong></p><p>This course doesn't teach you how to play the piano - it assumes you know how to play the piano already. And the pieces used are mostly extracts that are designed to illustrate certain types of chord, so the goal isn't to play complete pieces but to acquire skills that you can apply to other pieces.</p><p>Also, this isn't a music composition course: I don't talk very much about why certain chords sound good together. However, if you are interested in learning about chord progressions this is a good starting point.</p><p><strong>In conclusion</strong></p><p>So, if you've ever wondered what Dm7/G means then give this course a try! You can always get a refund if you decide it isn't for you.</p><p>Best of luck on your musical journey,</p><p>Benedict</p>", 
    "end_date": null, 
    "title": "Piano Chords", 
    "price": "25.00", 
    "instructors": "Benedict Westenra", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486568_c22b_10.jpg", 
    "course_url": "https://www.udemy.com/piano-chords/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-26T08:46:15Z"
}