{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Learn Piano with Rosa -</strong><strong> </strong><strong>Rosa</strong><strong>'s Piano Online School\n-  Teaching 32 Courses!</strong></p><p><strong>OVER 10,000  </strong><span></span>Successful students\nhave already taken my piano online courses since  July\n2014 with  <strong>231 - 5 Star Reviews</strong></p><p><strong>Course Updated: </strong>November 15, 2015</p><p><strong><span>*** ENROLL IN THE #1 RATED Play By Ear COURSE ON UDEMY TODAY! ***</span><span></span></strong><strong></strong><br></p><p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p><strong>Here are some Reviews by students already in less than 24 Hours after the launching of the course:</strong><br></p>    <strong>Niels Walkau:  The dream of playing by ear is ALIVE!        </strong>  <p>  \t<em>I spent years learning to play piano by rote but could never play by  ear. Embarrassing actually. I always thought I wasn't born with that  \"magical\" talent and I would have given a lot to be able to sit down and  play any tune off the top of my head. <strong>After only spending literally 30  minutes</strong> in this course, I have the <strong>confidence and evidence</strong> that IT IS  POSSIBLE to learn to play by EAR. The piano notation that Rosa  introduces is crazy easy to understand and will <strong>transform how you  understand/enjoy playing music</strong>. I am only 8 lectures in at this  point...I will report back as I make more progress...</em>  </p>    <strong>Barbara:  Learned to play 2 songs by ear in 30 min!         </strong>  <p>  \t<em>Wow! I am more excited about this course than any I have  taken before. It's <strong>accelerated learning</strong>. Once again Rosa has shared so  much knowledge with her students. Looking forward to the next course. If  you are interested in learning to play by ear don't miss this course.</em>  </p>    <p>  \t<strong>Judy Rae Harbin: </strong><strong>This course really helped me with recognizing tones and their relation to each other.   </strong>  </p>  <p>  \t<em>Rosa, as always, was totally dedicated to making it all so simple to  understand.  Like learning a <strong>whole new musical language</strong>, but so easy--   with VERY impressive videos and demonstrations of each step along the  way--typical Rosa highest quality!</em>  </p>    <p>  \t<strong>Alene Thornton:  </strong><strong>A desire to play by ear?</strong>  </p>  <p>  \t<em>As usual, I think Rosa has come up with another winning  course.  Rosa taught me this numbering system (Asian Notation or also  known as Jianpu) several years ago and I have used it every since as a  method to easily play any song in all 12 keys using just one lead sheet.   The emphasis on Part 1 of this course is learning how to pick out a  melody, and then also to write it down using the numbering system and  also how to play using just the lyrics. </em>  </p>  <p>  \t<em> She explains, in her usual easy  descriptive method, just how to know what key a song is in, what the  starting note will be, whether it's a pickup note/notes and clues to  where the melody is going next.</em>  </p>  <p>  \t<em>This first part 1 course is just the beginning of the fun!  There will  be  more to come but you will be able to <strong>visualize the advantages of  using this numbering system</strong> to make playing in any key so easy. There  are lots of fun songs to practice this method in this course <strong>for  beginners or intermediates to advanced</strong>, or anyone wanting to learn to  play by ear, no matter what level you are at now.  </em>  </p>  <p>  \t<em>Another super course!</em>  </p>  <p>  \t<strong>**********************************************************</strong>  \t</p>  <p>  \t<strong>Playing By Ear is a Fascinating Topic.</strong>  </p>  <p>  \t<strong></strong><strong>Is it your dream to be able to play your favorite song by ear?</strong>  </p>  <p>  \t                                       Many people struggle for many years to read music.  This course is going to free you from the traditional musical score sheets such that you can play by ear using my Number Method.  </p>    <p>  \t<strong>My Play by Ear Method is based on a 7 tone Number system.  It  takes only ONE HOUR to learn the system.</strong> That´s how simple the system is. You don´t believe me? Tell me about it after you learn the system from me.  And before the day finishes, you are going to have a system in your brain and hands to play some of your favorite songs by EAR. Read the reviews and you can do play by EAR today before you go to sleep.  </p>  <p>  \t      The Concept takes less than 1 Hour to learn, but to <strong>MASTER the skill, </strong>you need to have a lot of songs to practice on and this is why I have provided lots of song assignments from Beginners to Intermediate to Advanced for you to work on.  Mastering this skill will take the next 2 weeks to become GOOD at it. The Assignment &amp; the Practical applications are the most important and FUN part of the course!  </p>    <p>  \t<strong>My Testimony: </strong>Never did I dare to think that my <strong>DREAM</strong> would come true: I can now play many of my favorite songs by EAR. It's happening and HAPPENING every day. It took me 20 years to find the path to play songs by ear. I am so <strong>EXCITED</strong> that I want to share these easy-to-follow instructions so that DREAMERS like you can start playing your favorite songs by ear. For you, it will only take a few hours to finish this course to start gaining the knowledge and skill to learn how to pick out melodies of song using my <strong>7 Tone Method</strong>.  </p>  <p>  \t<strong>This Play By Ear Course is a 3 part series.</strong> This is Part 1 of a series and this course will teach you how to start picking out melodies of simple songs in Key of C.  You are going to learn about the dynamics and quality of sounds of these 7 tones so that you know how melodies move in songs, whether they go up, go down, or remain the same. In Part 2, you will learn to use the same 7 tones to play in all 12 Keys by EAR easily.  In Part 3, you will learn to harmonize all these songs with Chords.  </p>  <p>  \t                                      Although my demonstration of these songs are on the keyboard, this Play by Ear course is <strong>suitable for all musicians </strong>who want to learn to play by ear. If you play <strong>piano, guitar, ukulele or violin</strong>, and you want to learn to play by Ear, this course is also for you. My demonstration is on the piano/keyboard, but you can use the same principles to apply to your musical instrument.  </p>  <p>  \t<strong>Level:  Beginners to Advanced  </strong>  </p>  <strong>Playing By Ear Level 1 - My Unique Method!</strong><p>  \t                                      1.  Listen to tne 7 tones.  </p>  <p>  \t                                      2.  Learn to see song structure and patterns (BIG Secret)  </p>  <p>  \t                                      3.  Use a number system to see music in ONE flash  </p>  <p>  \t                                      4.  From my videos, you will be amazed to discover how EASY it is to play by ear, that you had never realized before.  </p>  <p>  \t                                      5<strong>.  </strong>Write the  7 tones into <strong>a piece of musi</strong><strong>c</strong> such that when you look at the piece of music, it totally simplifies your thought process when you play songs by ear.  It totally frees you from the traditional method of reading complicated musical staff notation.  When you listen to tones and look at numbers, you will learn to listen to sounds deeply to pick out melody of songs without struggle.  </p>    <p>  \t<strong>This Play By Ear Course Part 1 will give you:</strong>  </p>  <ul>  \t<li>21 Magic Tips to listening to the 7 Tones</li>  \t<li>Train your ears to listen to the quality of these 7 Tones</li>  \t<li>Spot musical patterns in song</li>  \t<li>Learn structure of songs</li>  \t<li>Feel the rhythm of the tune - 3/4 or 4/4</li>  \t<li>Put the 7 tones into a piece of music with bar lines</li>  \t<li>My 7 Easy Steps to Play songs by Ear</li>  </ul>    <p>  \t<strong>Play By Ear:  You will learn to pick out melodies of these  26 Songs in this course:</strong>  </p>  <p>  \t                                      1. Twinkle Twinkle Little Star  </p>  <p>  \t                                      2.  Kum Ba Yah  </p>  <p>  \t                                      3.  Mary Had A Little Lamb  </p>  <p>  \t                                      4.  Braham's Lullaby  </p>  <p>  \t                                      5.  Happy Birthday  </p>  <p>  \t                                      6.  Clementine  </p>  <p>  \t                                      7.  O Christmas Tree  </p>  <p>  \t                                      8.  Jingle Bells  </p>  <p>  \t                                      9.  We Wish You A Merry Christmas  </p>  <p>  \t                                      10.  Silent Night  </p>  <p>  \t                                      11.  Away In A Manger  </p>  <p>  \t                                      12.  Today  </p>  <p>  \t                                      13.  Oh Danny Boy  </p>  <p>  \t                                      14.  Somewhere Over the Rainbow  </p>  <p>  \t                                      15.  Changing Partners  </p>  <p>  \t                                      16.  You are my sunshine  </p>  <p>  \t                                      17.  Yesterday  </p>  <p>  \t                                      18.  Edelweiss  </p>  <p>  \t                                      19.  Do Re Mi  </p>  <p>  \t                                      20.  Moon River  </p>  <p>  \t                                      21.  Unchained Melody  </p>  <p>  \t                                      22.  Yesterday  </p>  <p>  \t                                      23.  Yesterday Once More  </p>  <p>  \t                                      24.  Colors of the Wind  </p>  <p>  \t                                      25.  Memories - The Way We Were  </p>  <p>  \t                                      26.  Misty  </p>  <p>  \t                                      Join our happy and fun music class together.  </p>  <p>  \t                                      Enroll into the course, and I'll see you inside:  </p>  <p>  \t                                      Rosa  </p><p><br></p><p>***************************************************************************</p><p><strong>About Rosa's Piano Online Course:</strong></p><ul><li><em>Over </em><strong><em>10,000</em></strong><em> </em><em>very happy students already in my classes</em></li><li><em>See the </em><strong><em>5 Star Reviews</em></strong><em> from VERY satisfied students</em></li><li><em>You get free lifetime access</em></li><li><em>All videos are at your finger tips to watch anytime &amp; anywhere</em></li><li><em>All future extra lectures and upgrades are </em><strong><em>always free</em></strong></li><li><em>Unconditional  </em><strong><em>30 day money-back guarantee</em></strong><em> and that's my personal promise to your success!</em></li><li><em>Join this happy family of students </em></li><li><strong><em>Enroll into this course</em></strong></li></ul><p><br></p><p><strong><br></strong></p><p><br><em></em></p>", 
    "end_date": null, 
    "title": "Play By Ear #1:  Pick Out  Melodies with 7 Tones in 1 Hour", 
    "price": "20.00", 
    "instructors": "Rosa Suen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390436_2d8f_5.jpg", 
    "course_url": "https://www.udemy.com/play-by-ear-1-pick-out-melody-of-songs-with-7-scale-tones/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T15:14:12Z"
}