{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">Learn how to play great songs by ear from Professor Kris Maloy. Using his 10 years of university teaching experience, he&#039;ll teach you to play music by ear and identify chords by only their sound, <strong style=\"\">no reading sheet music required.</strong></p>    <h5 style=\"\">Learn to Play by Ear </h5>    <p style=\"\">In this course you will learn to understand music using only your ear, using the example of the song &quot;The Cave&quot; by Mumford and Sons. You&#039;ll learn to recognize notes, chords and melodies by ear.&nbsp;</p>    <p style=\"\"><span style=\"\">At the end of this course you&#039;ll be able to play the song on your instrument of choice by hearing the melody, bass, harmony, and texture entirely by ear.</span></p>    <p style=\"\"><span style=\"\">A Better Way to Learn to Play by Ear</span><br style=\"\">  </p>    <p style=\"\">Professor Maloy&#039;s new system of teaching ear training teaches you how to improve your own skills. Instead of repetitive drills, you can learn to teach yourself.&nbsp;</p>  <h5 style=\"\">Who Should Take This Course?</h5>    <p style=\"\">Ear Training for Beginners is great for solo and band artists, and anyone who wants to learn to play music by ear. These skills can be applied to any song, not just &quot;The Cave.&quot;</p>  <h5 style=\"\">What Former Students Say</h5>    <p style=\"\">&quot;I thoroughly enjoyed studying with Dr. Kris Maloy because he cared enough to become aware of my personal musical background and found a common ground so that he could find the best ways to explain certain concepts and ideas.&nbsp;I would highly recommend studying any music course with Dr. Kris Maloy and would expect you to have the same positive results and experiences that I had.&quot;<br style=\"\">  <strong style=\"\">--Maggie McClure, singer/songwriter with two albums and placements in film, TV and commercials</strong></p>    <p style=\"\">&quot;Dr. Maloy has a piercing ability to see through the murky, convoluted mess that is music theory and pull out all of the lowest common denominators – the fundamental building blocks of method. He shares this clairvoyance with students through a practical training that sidesteps the pretense.&quot;<br style=\"\">  <strong style=\"\">--Bryan Mitschell, pro drummer and audio producer, now university faculty</strong></p>    <p style=\"\">&quot;I found Kris&#039; methods to be sound, informative, and practical. Studying with him gave me the skills, desire and enjoyment to continue working in the field of jazz arranging.&nbsp; I highly recommend Kris Maloy and his very skilled system of teaching.&quot;<br style=\"\">   --<strong style=\"\">Mark Giammario,&nbsp;pro drummer, now university faculty</strong></p>    <p style=\"\">&quot;Dr. Maloy has the ability to effectively communicate complicated musical ideas and techniques to musicians of any level. &nbsp;Dr. Maloy’s familiarity with academic music as well as modern popular music has made his curriculum uniquely relevant. My experience with Dr. Maloy has been extremely enjoyable and enlightening and I would recommend his curriculum to any musician looking to dive deeper into important musical concepts.&quot;<br style=\"\">  <strong style=\"\">--Nick Poss, pro singer/songwriter</strong></p>", 
    "end_date": null, 
    "title": "Play by Ear: The Cave", 
    "price": "20.00", 
    "instructors": "Kris Maloy", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61440_b41b_6.jpg", 
    "course_url": "https://www.udemy.com/play-by-ear-the-cave/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-22T10:46:16Z"
}