{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t                               This course is about teaching you how to play gospel music by ear. We want you to have enjoy the experience that music brings , joy and beautiful sound. This course is designed for beginners from ages 5 and up. What do you need for this course is a keyboard or piano, internet access, and time and patience to make beautiful music. We will show you how easy it really is once you get the basic musical foundation. Our course paves the way for you to go down the road to play gospel music.  Materials include tutorial videos, still illustrations of keyboards with notes to help reinforce the basics of music. We also include still photos for instructional purposes as well as several quizzes to confirm your understanding of music basics. The course starts with basic music theory incorporated with videos to reinforce the music theory to get you started playing piano today. This course is fun and easy and before you know it you will be playing for your own pleasure and satisfaction. You could be playing by the end of this course. Just follow our easy steps from as simple as  the alphabet. This course takes you from what are the notes on the keyboard to moving towards playing music and sounding out music via the keyboard and your own memory of music  that you may know and always wanted to play.  We are committed to teach you to play and the know how and support to get you there. This course is the beginning of something beautiful and that is music. At the end of the course you will be able to play the melody of music you may know. This course was designed to  be easily understood by beginners so thats why one should consider this course. This will help you navigate the keyboards, learn they keys,sound them out and start playing after putting it all together. We make it easy for you to start playing today.  </p>", 
    "end_date": null, 
    "title": "Play Gospel Music By Ear", 
    "price": "20.00", 
    "instructors": "Mike Fortune", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326756_7ee0.jpg", 
    "course_url": "https://www.udemy.com/play-gospel-music-by-ear/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-25T01:06:31Z"
}