{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course of instruction covers the grades 1 - 5  ABRSM theory syllabus in full. Within the syllabus you will be shown the basic principles of music theory covering key areas which will enhance your understanding and lay the foundations for study at higher levels. The learning modules cover accidentals, adding missing bar lines, intervals, key signatures, major scales, notes &amp; note values, questions on a melody, simple time signatures, single dotted notes &amp; rests, the stave, tonic triads, treble &amp; bass clef and writing a rhythm to name but a few.  The majority of the course is delivered via video tuition. However after each module you can test yourself with the end of section quiz.  Some of the modules also have links to additional information and worksheets.  This course will provide you with a fast track opportunity to gain the necessary knowledge to pass the graded theory exams. This knowledge will open up many doors for aspiring musicians. If you acquire a certain amount of understanding of the 'nuts and bolts' of theory you will be able to learn to read music with ease. Having an understanding of theory will increase your opportunities of playing music with others. If you read music you can join local groups, bands or orchestra's and enjoy playing with like minded musicians. If you need to gain your grade 1 - 5 ABRSM theory exam or if you just wish to brush up on your theory knowledge, this course if for you. ABRSM currently works in over 90 different countries around the world so there is probably the opportunity for you to sit an exam wherever you maybe in the world.</p>", 
    "end_date": null, 
    "title": "Prepare for Music Theory ABRSM 1 to 5", 
    "price": "50.00", 
    "instructors": "Michael Luck", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481428_8eca_3.jpg", 
    "course_url": "https://www.udemy.com/prepare-for-music-theory-abrsm-1-to-5/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T18:44:40Z"
}