{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Join over 800 students who are already learning to read music with this course!</em><br style=\"\">  </p>  <p style=\"\">  \t    Have you always wanted to learn to read music but found the process slow, frustrating and confusing?  </p>  <p style=\"\">  \tDo you want to be able to read melody lines in addition to playing chords?  </p>  <p style=\"\">  \t  Are you tired of books and courses that &#039;teach&#039; you to read notes by giving you pictures of notes and a staff and then tell you to memorize the notes and their names?  </p>  <p style=\"\">  \t  Have you always thought there has to be a better and more efficient way to learn to read music?  </p>  <p style=\"\">  \t        In this course, you will learn everything you need to be able to read music notes (reading rhythm is not included in this course) in a way that goes beyond just rote memorization of notes and names. This system is so simple even 4- and 5- year olds have learned to read music by using it!  </p>  <p style=\"\">  \t        Through videos, worksheets and printouts of familiar songs, you will have the opportunity to first see the concepts explained and then practice the skills you learned both in isolation and also with real music. Music is a language, and as with any language, proficiency comes with practice.  </p>  <p style=\"\">  \t        You will learn to read <em style=\"\">both </em>treble and bass clef, <em style=\"\">and as a <strong style=\"\">BONUS</strong></em>, you will learn how to build and play up to 48 chords which will add richness to the songs you play!  </p>  <p style=\"\">  \t        Whether you have always wanted to learn to read music but never tried because you felt it was too complicated, or you have previously tried to read music but failed, or even if you can already read music but want to improve your reading skills this course will help you achieve your goals.  </p>  <p style=\"\">  \t        So click the &#039;<em style=\"\">Take this Course</em>&#039; button in the upper right hand corner now to begin your journey. <strong style=\"\">There&#039;s even a 30 day absolutely no questions asked full money  back guarantee - my personal promise of your satisfaction!  You really cannot lose! </strong>Enroll today!  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>", 
    "end_date": null, 
    "title": "Reading Music Made Easy - Note Reading, Not Note Memorizing!", 
    "price": "20.00", 
    "instructors": "Karen Gibson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/286582_709d_3.jpg", 
    "course_url": "https://www.udemy.com/reading-music-made-easy-note-reading/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-23T17:26:58Z"
}