{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tThis course is all about writing a catchy song. After diving through the most important basics, such as beat, notes and scales we will focus on chords. We&#039;ll analyze and understand why to choose a chord over another in order to create a certain atmosphere. After that you&#039;ll be able to create and release tension in your song, which is very important for successful songwriting  </p>  <p>  \tA great deal of the course is about writing a great melody and how to use motives, sequences and transformations to improve your songwriting skills. We&#039;l teach you how to avoid to write boring melodies and give you lots of techniques to spice them up. After all, you want to entertain your audience, don&#039;t you?  </p>  <p>  \tWe&#039;ll cover the topics of lyrics and give you advice how to approach songwriting in case you have to fit the melody to the lyrics or vice versa.  </p>  <p>  \tWe tried to create a course that can be really helpful to you, so there are exercises after each section.  </p>  <p>  \t<span>We&#039;ve created a course that is useful for any music genre. All the example audio files can be downloaded, so that you can also practice at home.</span>  </p>  <p>  \t<span>Students should be able to finish this course within 14 days if they are very commited, or 30 days if they are taking this course part time.</span>  </p>  <p>  \t<span>The course is linear, so it is best advice to watch it from beginning to end. It is also modular though, so it is possible to rewatch a certain topic if you want to refresh your memory or feel you missed something.</span>  </p>  <p>  \t<span>If you want to know why certain chords work, why certain melodies sound good and what you can do to turn any song into a catch great song, then this course is for you.</span>  </p>", 
    "end_date": null, 
    "title": "Songwriting - Learn how to write a catchy song", 
    "price": "20.00", 
    "instructors": "Salvatore Benintende", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/388412_1213_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-a-catchy-song/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-08T09:22:35Z"
}