{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t         Es un hecho: El estudio de la teoría musical y el solfeo ayuda a  cualquier músico &quot;de oído&quot; a obtener mayor provecho de su talento.  Al  estudiar teoría musical, descubres el &quot;por qué&quot; de la música, lo cual te  ayudará a desarrollar tu talento aún mas y te dará mas opciones a la  hora de ejecutar y/o crear música.  </p>  <p>  \t <em style=\"\">Teoría de la Musica: Nivel 1</em> es un curso diseñado para aprender desde cero los fundamentos básicos de la teoría musical.  Basado en el libro <em style=\"\">Teoría de la Musica: Nivel 1</em>,  del mismo autor, es el curso ideal tanto para el estudiante que recién  comienza sus estudios musicales y desea complementar el estudio de un  instrumento con una base sólida en teoría de la música, como para el  músico &quot;de oído&quot; que desea aprender lectura y teoría musical.  El mismo ha sido estructurado para enseñarte los  fundamentos de la teoría musical en una forma coherente y organizada:  de lo mas sencillo hasta lo mas avanzado.  </p>  <p>  \t         A través de este curso tendrás la oportunidad de aprender sobre los siguientes temas:  </p>  <ul style=\"\">  \t<li>El Pentagrama</li>  \t<li>La Clave</li>  \t<li>Las Notas Musicales</li>  \t<li>El Pulso (Tiempo)</li>  \t<li>Las Figuras y Silencios Musicales Básicas</li>  \t<li>El Compás y sus Partes</li>  \t<li>El Cifrado (o Cifra) del Compás</li>  \t<li>Las Notas y las Figuras en Accíón (como interactúan las notas y las figuras en la lectura musical)</li>  \t<li>La Corchea y el Silencio de Corchea</li>  \t<li>El Puntillo</li>  \t<li>Las Repeticiones</li>  \t<li>La Alzada o Anacrusa</li>  \t<li>Las Alteraciones (Sostenidos, Bemoles y Becuadros)</li>  \t<li>Los Tonos, semitonos y Notas Enarmónicas</li>  </ul>  <p>  \t        El curso contiene una combinación de clases en vídeo y materiales suplementarios en formato pdf.  En adición, a través del curso encontraras una serie de ejercicios y preguntas de repaso, las cuales te servirán para reforzar lo aprendido en las lecciones.  </p>  <p>  \t <strong style=\"\">Incluye una copia en pdf del libro <em style=\"\">Teoría de la Música: Nivel 1</em></strong><em style=\"\">, </em><strong style=\"\">en el cual está basado este curso.</strong>  </p>  <p>  \t        No pierdas esta oportunidad.  ¡Adquiere este curso ya e iníciate hoy en el maravilloso mundo de la teoría musical!  </p>", 
    "end_date": null, 
    "title": "Teoría de la Música: Nivel 1", 
    "price": "50.00", 
    "instructors": "Ángel Candelaria", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101910_9a7c_2.jpg", 
    "course_url": "https://www.udemy.com/teoria-de-la-musica-nivel-1/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-05T16:07:39Z"
}