{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t This course is to give you a clear understanding of the basic in music. For persons wanting to know the basics of reading music this is the course for you It will also prepare you for the ARBSM Music exam. Here you will learn:  </p>  <ul style=\"\">  \t<li style=\"\">  \t<p style=\"\">  \t\t Some frequently used terms and signs concerning tempo, dynamics, performance directions and articulation marks. Simple questions will be asked about a melody written in either treble or bass clef.  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t Construction of the major scale, including the position of the tones and semitones. Scales and key signatures of the major keys of C, G, D and F in both clefs.  \t</p>  \t</li>  \t<li style=\"\">Simple time signatures, bar-lines and the grouping of the notes listed above within these times. Composition of a two-bar rhythm in answer to a given rhythm starting on the ﬁrst beat of a bar.</li>  \t<li style=\"\">Note values of semibreve, minim, crotchet, quaver and semiquaver, and their equivalent rests (candidates may use the terms ‘whole note’, ‘half note’, etc.). Tied notes. Single-dotted notes and rests</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t The stave. Treble (G) and bass (F) clefs. Names of notes on the stave, including middle C in both clefs. Sharp, ﬂat and natural signs, and their cancellation.  \t</p>  \t</li>  </ul>  <p style=\"\">  \t This course will last for three weeks or depending on how often you visit the site.  </p>  <p style=\"\">  \t What you need for this course to practice  </p>", 
    "end_date": null, 
    "title": "Theory In Music", 
    "price": "40.00", 
    "instructors": "Christopher Coke", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/78316_2ee6_5.jpg", 
    "course_url": "https://www.udemy.com/theory-in-music/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-14T01:12:22Z"
}