{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>T</strong>his course is for anyone who wants to learn how to quickly get their musical ideas <strong>out of their heads</strong><strong> and into the world.</strong> From aspiring singer-songwriters to music contractors to anyone who has ever taken a piano, bass or guitar lesson but still <strong>feels like there are holes in their useable understanding of music theory! </strong></p><p>We live in an exciting time where anyone with a PC or Mac can create and distribute music from the comfort of their own homes. There are so many great DAWs (Digital Audio Workstations) to choose from but at the end of the day they are just tools. <strong>Imagine yourself staring at a blank canvas. </strong>Next to you is a locked box and inside that box are your paints. The problem is that you don't know how to unlock the box! <strong>A working knowledge of music theory is th</strong>e key to unlocking that box and access the colors you need to create your masterpiece. <strong><br></strong></p><p><strong>This course is designed to give you a working, practical, <em>useable</em>  knowledge of music theory that will help you to get your ideas from your head to the workstation of your choice and ultimately to your audience. </strong></p><p><strong>I know how frustrating it can be to not be able to express your musical ideas.</strong> I know what its like to sit through that boring music theory class. <strong>I also know what it was like to experience a major breakthrough in my understanding that allows me to use music theory as a tool to bring ideas to fruition and communicate these ideas to musicians that I work with. </strong></p><p><span>In t</span><strong>his course I will unlock the door to the large room that is music theory in a way that will allow you to quickly put to use regardless of what instrument you play or what DAW you use.</strong></p><p>If you're ready to unlock that box, let's get started!</p>", 
    "end_date": null, 
    "title": "Usable Music Theory Part 1: Harmony and Chord Progressions", 
    "price": "20.00", 
    "instructors": "Ted Gould", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733744_2880_3.jpg", 
    "course_url": "https://www.udemy.com/musictheoryforyou/", 
    "currency": "USD", 
    "subject_name": [
        "Music Fundamentals"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T05:49:42Z"
}