{
    "selfpaced": false, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    calvin-001\n                                                                    calvin-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Qui était Jean Calvin ? Pourquoi ses idées ont-elles exercé une telle\ninfluence au 16e siècle et dans les siècles suivants ? Ce cours cherchera\nà répondre à ces deux questions.\nIl mettra en évidence l’humanisme de Calvin, sa compréhension de la pensée\nbiblique, son acuité théologique, son sens aigu des problèmes sociaux et\npolitiques. Nous aurons aussi l’occasion d’évoquer l’apport de Calvin à\nla culture (notamment à la langue française, qui lui doit considérablement)\net à la conception de l’humain devant Dieu et dans la société. Nous verrons\négalement comment Calvin fit de Genève la capitale d’une idée et d’un idéal\nde vie chrétienne, en pensant le rapport au travail et à l’argent ou en\ncréant des institutions comme la Compagnie des pasteurs, le Consistoire\net l’Académie.\nCe cours mettra également en évidence la place que Calvin occupe dans\nl’histoire de la tolérance, ou plutôt de l’intolérance, religieuse :\nl’affaire Servet (du nom de ce savant espagnol condamné à mort à Genève\npour hérésie) fera ainsi l’objet d’une analyse spécifique. Nous tenterons\négalement de montrer les apports de la théologie de Calvin (notamment la\ncompréhension renouvelée d’un Dieu en qui l’humain peut faire confiance)\net ses limites (par exemple la doctrine dite de la prédestination).\nCe cours d’introduction fera également une place à l’histoire du calvinisme\nen Europe (France, Allemagne, Provinces-Unies, Angleterre) et dans le monde\n(Amérique, Afrique du Sud, Asie).\nLe cours est donné en français avec sous-titres en anglais.---Who\nwas John Calvin? Why were his ideas so influential in the 16th century\nand well beyond his time? This course seeks to answer these two questions.\nWe will present his humanistic leanings, his interpretation of the Bible,\nhis theological vision, his acute sense of social and political questions.\nWe will consider his contribution to culture, how he contributed to shaping\nFrench language, his understanding of the human before God and in society.\nThe course will address how Calvin sought to transform the city of Geneva\ninto an idea and an ideal of Christian life, by thinking the meaning of\nwork and money, but also by creating educational and ecclesiastical institutions\n(the « Company of Pastors », the « Consistory » and\nthe « Academy »).\nThe course will locate Calvin within the history of religious toleration,\nor rather of religious intolerance. We will analyse the fate of Michel\nServet, a learned Spanish man who was condemned for heresy and executed\nin Geneva in 1553. With regard to Calvin’s theology, we will show both\nhis lasting contribution (especially his understanding of a God in whom\none may trust) as well as the limitations of his thought (for instance\nhis doctrine of predestination).\nTowards the end of this introductory course, we will turn our attention\nto the history of Calvinism in Europe (France, Germany, the United Provinces,\nEngland) and in various parts of the world (Americas, South Africa and\nAsia).\nCourse in French with English subtitles.\n\n                                            Syllabus\n                        Semaine 1 : La vie de Calvin / Week 1 : Calvin's lifeSemaine 2 : La pensée de Calvin / Week 2 : Calvin's thoughtSemaine 3 : L'éthique de Calvin / Week 3 : Calvin's ethicsSemaine 4 : La diffusion du calvinisme / Week 4 : The spread of CalvinismSemaine 5 : Lire Calvin aujourd'hui  / Week 5 : Reading Calvin today\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Calvin - Histoire et réception d'une Réforme", 
    "price": 0, 
    "instructors": "Christophe Chalamet, Michel Grandjean, François Dermange and Sarah Nicolet", 
    "institution_name": [
        "University of Geneva"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/course/calvin", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-10-23T00:00:00Z"
}