{
    "selfpaced": false, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nThis course is designed to give students a thorough introduction to Warring States (5th-3rd century BCE) Chinese thought, focusing on Confucianism, Daoism, Mohism and Legalism. Sometime known as the age of “the Hundred Schools of Thought,” this period of Chinese history witnessed the formation of all of the major indigenous schools of Chinese thought, which in turn had an impact on the development of East Asian cultural history that is still felt today. Important themes to be discussed include conceptions of the self, models of self-cultivation and rationality, and differences in spiritual and political ideals. Students will be exposed to both received texts and recently discovered archeological texts; this combination of sources will both enrich students’ understanding of the world of thought in early China and call into question the boundaries drawn between the traditionally-defined “schools” such as Daoism or Confucianism. Parallels with developments in Western philosophical and religious traditions will be highlighted. We will also explore the relevance of early Chinese thought for contemporary debates in ethics, moral education, and political philosophy, as well as the manner in which early Chinese models of the self anticipate recent developments in the evolutionary and cognitive sciences.\nAll required readings are available within the courseware, courtesy of Crown Publishers and Hackett Publishing Company. Print version of the books from which most of the readings are drawn, Trying Not to Try and Readings in Classical Chinese Philosophy, are also available for purchase through the publishers’ site or amazon.\n\nIf you are having trouble viewing the course about video, you may download it here.\n\nSee also: \n\nChinese Thought: Ancient Wisdom Meets Modern Science - Part 2\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n                                    ", 
    "end_date": "2014-12-02T00:00:00Z", 
    "title": "China300x: Chinese Thought: Ancient Wisdom Meets Modern Science", 
    "price": 0, 
    "instructors": "Edward Slingerland", 
    "institution_name": [
        "The University of British Columbia"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/chinese-thought-ancient-wisdom-meets-ubcx-china300x", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-10-14T00:00:00Z"
}