{
    "selfpaced": false, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                    \n                    \n                    We make ethical or behaviour guiding right / wrong judgments all the time but have you ever wondered where Ethics comes from, what it is about and why it is important? This course provides an introduction to traditional Chinese ethical thought and focuses on the pervasive contrast in the way Chinese and Westerners think about ethical guidance or guidance concerning what is right and what is wrong, good or bad.  Traditional Western orthodoxy uses the metaphor of a law – in its most familiar popular form, the command of a supernatural being backed by a threat of eternal punishment or reward – to explain ethical guidance. The Classical Chinese philosophers by contrast were all naturalists. They talked about ethical guidance using a path metaphor – a natural dào.\n\nWe will look at two rival directions this natural dào model took in ancient China. The first direction views ethical paths as generated from human sources such as human history and past social practices. The other Confucian version views guidance as arising from a distinctly human guiding organ, something like a combination of our faculties of heart and mind. This organ issues the right/wrong or this/not-that judgements naturally. This internal map to moral choices branches, like a plant, as we mature. The alternative to human-based naturalism in China treated normative guidance as natural in a broader sense, such as the dào of water or one guided by what is beneficial vs harmful. Finally, we will take a brief look at a development after the classical period that resulted from the invasion of the more super-naturalist, Indo-European way of thinking about guidance – Medieval Chinese Buddhism.\n\nAlthough Chinese concepts will be the focus of our discussion, all the content of this course is intended to be accessible to beginner students. For those who are beginners in Philosophy, we will include a brief introduction to the ideas of logic that further shape the Western metaphor of a law and help us understand its role in Western ethics, science and psychology so you can better understand the different ways these two philosophical metaphors explain where norms of behaviour come from, what they are about and why they are important.\n\n                                    ", 
    "end_date": "2016-08-16T00:00:00Z", 
    "title": "HKU03x: Humanity and Nature in Chinese Thought", 
    "price": 0, 
    "instructors": "Chad Hansen", 
    "institution_name": [
        "The University of Hong Kong"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/humanity-nature-chinese-thought-hkux-hku03x-0", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-14T00:00:00Z"
}