{
    "selfpaced": false, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    ethique-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Notre monde toujours plus complexe semble nous échapper. Réchauffement climatique, questions de début et de fin de vie, évolution vertigineuse des bio-technologies, inégale distribution des richesses, pressions migratoires accentuées… La tentation est grande d’une vie morale repliée sur elle-même à partir d’une éthique minimale : « fais ce que tu veux, du moment que tu ne mets pas en péril la liberté des autres ». Nous proposons de prendre le contre-pied : défendre l’idée d’une éthique qui nous plonge dans notre réalité sociale et politique, parmi nos semblables et avec eux. Et pour cela nous reposons la question de ce qui est juste, de ce qui est bien. Sans repartir de rien, sans tout réinventer.\n\nC’est pourquoi nous présentons un cours qui permet de se familiariser avec les plus importantes perspectives éthiques traversant le monde contemporain : l’éthique des vertus (ou perfectionnisme) ; l’éthique du devoir (ou déontologisme) ; l’éthique utilitariste (ou conséquentialisme) ; l’éthique de l’amour (ou éthique du don). Ainsi chacun pourra mettre de l’ordre dans ses idées, repérer les différentes manières de s’orienter dans la vie morale, comprendre les différences d’appréciation face aux diverses situations qui interpellent et sollicitent.\nQuels que soient votre champ de savoir académique, votre engagement professionnel ou vos choix personnels, il s’agit de proposer des clés d’analyse dont vous disposerez. Pour cela, nous alternerons tout au long de ce cours les présentations des grands courants, sous leur forme ancienne puis contemporaine, et des questions plus transversales ou des cas concrets. Avec un seul but : clarifier les idées\npour mieux comprendre le réel et mieux orienter l’action.\n\n                                            Syllabus\n                        18/09/2015 - Leçon 1 : Aristote et l'éthique des vertus25/09/2015 - Leçon  2 : Les éthiques des vertus contemporaines 09/10/2015 - Leçon 3 : Kant et l'éthique du devoir 16/10/2015 - Leçon 4 : Les éthiques déontologiques contemporaines 30/10/2015 - Leçon 5 : Bentham et l'éthique utilitariste06/11/2015 - Leçon 6 : Les éthiques utilitaristes contemporaines 20/11/2015 - Leçon 7 : Vers un au-delà de l'éthique ? Les éthiques du don 27/11/2015 - Leçon 8 : Mises en perspective - pour aller plus loin \n\n\n\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Le Bien, le Juste, l'Utile. Introduction aux éthiques philosophiques", 
    "price": 0, 
    "instructors": "François Dermange and Ghislain Waterlot", 
    "institution_name": [
        "University of Geneva"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/course/ethique", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-09-18T00:00:00Z"
}