{
    "selfpaced": false, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                    \n                    \n                    Military professionals are unusual in having the use of lethal force as a central, defining feature of their role, and unique in the level of force that they are authorized to use. This fact places a considerable ethical weight on military practitioners as well as the civilian decision-makers who authorize military missions.\n\nThe military profession is also unique in having a dedicated ethical framework associated with it, Just War Theory. This defines the conditions for when it is justified for a party to resort to war, the requirements for ethical conduct within the bounds of a war or armed conflict, and the conditions for a just ending to war.\n\nThe ethical challenges that military professionals face do not, however, begin and end with the use of force. As such this course combines an overview of Just War Theory with an introduction to key principles of ethics that can aid military professionals in facing every day ethical challenges.\n\nOver seven weeks, we will explore six topics:\n\nFoundations in ethical theory\nEthics within the military profession\nGoing to war\nThe conduct of war\nMilitary and society\nEthics, technology and war\n\n\nSpecific topics addressed include role morality, illegal orders and whistleblowing, the competing duties of military commanders and the ethical challenges arising from new technologies such as unmanned and autonomous weapons systems, non-lethal weapons, and cyberwarfare.\n\nLeading military ethicist Deane-Peter Baker travels around the world exploring key issues and case studies and speaking with international ethicists, military professionals, historians, philosophers, government and NGO personnel to build a comprehensive introduction to this essential field. This course is a must for military professionals, civilian policy makers, journalists, NGO personnel and anyone interested in the appropriate conduct of military affairs.\n\n\n\n                                    ", 
    "end_date": "2016-09-19T00:00:00Z", 
    "title": "Military Ethics: An Introduction", 
    "price": 0, 
    "instructors": "Deane-Peter Baker", 
    "institution_name": [
        "University of New South Wales"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/military-ethics?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-08-01T00:00:00Z"
}