{
    "selfpaced": false, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Humanities\n                                                                                                    &gt; Philosophy\n                                                            \n                            \n                                                \n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/moralities\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/moralities-001/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    moralities-001\n                                                                    moralities-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    How can we explain kindness and cruelty? Where does our sense of right and wrong come from? Why do people so often disagree about moral issues? This course explores the psychological foundations of our moral lives.\n\n                                            Syllabus\n                        Welcome to Moralities of Everyday Life!The Big QuestionsWhat is morality, anyway? What are the big debates in the field of moral psychology?CompassionWhere does concern for others come from? How is it related to empathy—and is more empathy necessarily a good thing? And what can we learn from the study of those who seemingly lack normal moral feelings, such as violent psychopaths?Origins of MoralityHere, we ask about which aspects of morality are universal. We discuss evolution, cross-cultural research, and the fascinating new science of the moral life of babies.DifferencesHow does culture influence our moral thought and moral action? What role does religion play? Why are some of us conservative and others liberal, and how do political differences influence our sense of right and wrong?Family, Friends, and StrangersOur moral feelings are usually most powerful towards our kin (such as our parents and our children) and our friends and allies. We will discuss these special bonds, and then turn to the morality of racial and ethnic bias. Then we use the tools of behavioral economics to explore the controversial question of whether we are ever truly altruistic to strangers.The Big AnswersWe’ll discuss some clever studies that show how our moral behavior is powerfully influenced—often at the unconscious level—by the situations that we find ourselves in. Such findings raise some hard problems about determinism, free will, and moral responsibility. Most of all, if our actions are determined by our brains, our genes, and our situations, in what sense can we be said to be moral agents? The course will end by trying to address this question. \n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Moralities of Everyday Life", 
    "price": 0, 
    "instructors": "Paul Bloom", 
    "institution_name": [
        "Yale University"
    ], 
    "commitment": "6-14 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/moralities", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}