{
    "selfpaced": false, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                    \n                    \n                    In this course we study the ancient, Socratic art of blowing up your beliefs as you go, to make sure they're built to last. We spend six weeks studying three Platonic dialogues - \"Euthyphro\", \"Meno\", \"Republic\" Book I - then two weeks pondering a pair of footnotes to Plato: contemporary moral theory and moral psychology. \n\nPlatonic? Socratic? Socrates was the teacher, but he said he never did. Plato was the student who put words in his teacher's mouth. You'll get a feel for it.\n\nWe have a book: the new 4th edition of \"Reason and Persuasion\", by the instructor (and his wife, Belle Waring, the translator.) It contains the Plato you need, plus introductory material and in-depth, chapter-length commentaries. (Don't worry! John Holbo knows better than to read his book to the camera. The videos cover the same material, but the presentation is different.) \n\nThe book is offered free in PDF form - the whole thing, and individual chapter slices. It is also available in print and other e-editions. See the course content for links and information.\n\nThe course is suitable for beginning students of Plato and philosophy, but is intended to offer something to more advanced students as well. We seek new, odd angles on old, basic angles. Tricky! The strategy is to make a wide-ranging, interdisciplinary approach.  Lots of contemporary connections, to make the weird bits intuitive; plus plenty of ancient color, still bright after all these years. So: arguments and ideas, new possibilities, old stories, fun facts. Plus cartoons. \n\nThe results can get elaborate (some book chapters and some lesson videos run long.) But each video comes with a brief summary of its contents. The lessons progress. I put them in this order for reasons. But there's no reason you can't skip over and around to find whatever seems most interesting. There are any number of self-contained mini-courses contained in this 8-week course. You are welcome to them.\n\nPlato has meant different things to different people. He's got his own ideas, no doubt. (Also, his own Ideas.) But these have, over the centuries, been worn into crossing paths for other feet; been built up into new platforms for projecting other voices. (Plato did it to Socrates, so fair is fair.) So your learning outcome should be: arrival somewhere interesting, in your head, where you haven't been before. I wouldn't presume to dictate more exactly.\n\n                                            Syllabus\n                        Plato's Euthyphro I: Bad Dads, Good ArgumentsWe start with Plato's \"Euthyphro\", a short dialogue in which Socrates debates the nature of holiness with a priest, Euthyphro. (The Bad Dad is Euthyphro's. Maybe. If he's a murderer. Do you think he's a murderer?) But mostly the videos for this first week and general and introductory. Plato, Socrates. Who are they? How should I read? For more detail, click \"Advice About Reading\", under \"Overview\", below.Plato's Euthyphro II: Two ProblemsThis is our second week reading \"Euthyphro\". (But we hardly got into it last week!) The two problems are: 1) Should Euthyphro do? 2) What is holiness? Mostly the dialogue concerns 2) but 1) is there for a reason. Suppose a friend asks you for advice: 'I think dad murdered someone. What should I do?' Probably you wouldn't pull down the dictionary and look up 'holiness', right? But why not? Food for thought. This lesson also contains quite a bit of background about ancient Greek religion and law.Plato’s Meno: What is Virtue?We're moving on to our next dialogue, Plato's \"Meno\". Meno is a slick fellow: sophist-in-training. He wants to know whether Socrates thinks virtue can be taught. Socrates doesn't even know what it is! Meno doesn't see the problem. He can talk about this stuff! But his tongue gets stung numb by the Socratic stingray. Overall, the dialogue has a peculiar virtue-geometry-virtue structure. And we meet two more characters: the boy, who learns geometry; the sturdy citizen, Anytus, who doesn't trust sophists. In this first \"Meno\" lesson, we don’t get past the poetry that introduces the geometry. (What's with that?) We consider difficulties defining ‘virtue’, and whether definitions are a good thing to ask for. We consider some oddities about virtue. Why does everything think they know what it is? And: is there any science around here?Plato's Meno: Virtue - Geometry - Virtue.We are still working on Plato’s “Meno”. This week we get to the geometry lesson and  Socrates’ tentative definition/formula for success: virtue is mindfulness. That means: when you do things, you do them for the right reasons, and with knowledge of those reasons. That sounds good, but it’s kind of a high bar for humans to clear. Could it turns out that there is such a thing as virtue, only none of us have it? Plato's Republic, Book I: Again, With Fathers and SonsWe move on to Plato's \"Republic\". The subject is justice. Socrates investigates the nature of justice by envisioning a kind of Utopia, an ideal society, in which justice shall be evident because it is writ large – in the fabric of the City – and small – in the interstices of our very Souls. But we don’t get to that in our actual Plato reading, which is only Book I of \"Republic\". That’s like Chapter 1. There are 10 Books in all. In Book I Socrates debates three figures – the father, son and the sophist – each of whom has rather inadequate notions of justice, so it seems. Why read Book I by itself (apart from the fact that we obviously don’t have time to read the whole thing?) It works pretty well as a stand-alone text. It’s self-contained, even though Book 2 cracks it open to start over again. (Maybe originally it was written to stand alone, and only later Plato wrote the rest as a sequel? That’s just guessing.) In my commentary, and in the video lectures, I try to tell you what you need to know about \"Republic\", as a whole, to help frame this first bit of it.Plato's Republic, Book I: Thrasymachus.We finish up “Republic”, Book I. We have gotten to Thrasymachus, the main attraction. He’s attractive-repulsive, as a person. ‘Justice is the advantage of the stronger!’ In this Lesson I lay out his views. I think it’s best to see him as suspended between a few theoretical possibilities, not really settled on one. But he’s definitely an egoist. But egoism and justice aren’t the same thing, are they? I relate the Thrasymachus material to the rest of “Republic”, in which a refined version of Thrasymachus’ view eventually receives a long, considerate response from Socrates. He builds Utopia to refute Thrasymachus. So the guy must be important.\nMoral PsychologyWe're done with Plato! Well, not really. The point is to prove we'll never be done with him! But we're moving on to contemporary moral psychology. This lesson is on moral psychology. How does the moral mind think – work, function? The moral brain. (Psychologists are natural scientists. They figure your mind is your brain although that identification can get puzzling, we shall see.) I discuss one figure in particular: Jonathan Haidt. A popular writer, with good ideas. Also, some bad ones (I say) so that makes it livelier. He knocks Plato. I try to knock back, sometimes on Plato’s behalf. Plato is obviously very concerned with moral psychology. So many colorful, mythic images of all that! Haidt ventures more than a short distance into philosophy, when he sallies forth to correct philosophers, ancient and modern, for doing bad psychology. All very interesting. And I hope, like me, you find having a bit of Plato under your belt, at this point, helps you to organize your thoughts, see positions and patterns. In the first lesson I compared studying Plato to learning chess gambits. No one knows how to win, outright. But some strategies are more ... winning. (But there are always standard defenses.) l A lot of scientific progress has been made in the study of the human mind. But there are a lot of deep, stubbornly un-dissolved conceptual mysteries hereabouts. That means a lot of ancient debate patterns – same old lines, same old counters to the old lines - stay relevant. It’s important to be able to say: hey, we learned something new today! But also: ah, this debate is a version of that old thing we’ve been batting back and forth for centuries! (Even though it’s got new stuff stuck on – fMRI data, or what have you.) Being able to see the old and the new isn’t everything, but it’s a start. Let’s get started.Ethics and EthnosOne more week on moral psychology. We’re almost done! This week we’re still talking about Jonathan Haidt, but then I shift to consider as well, the work of another psychologist, who is also a philosopher (by training): Joshua Greene. I talk about his popular book, \"Moral Tribes: Emotion, Reason, and the Gap Between Us And Them\". (By ‘popular’ I mean: written for a popular, i.e. non-scholarly specialist audience. I think it sold ok, too. But I don’t really have knowledge of that.) Per the title, it’s about tribalism, which is a big theme in \"Reason and Persuasion\", from \"Euthyphro\" to \"Republic\". Aristotle said we are political animals, by which he meant: living in a Greek style polis is the best! But you know what’s way more popular? Being an ethnic animal. (Greek ethnoi = tribe.)  We have an instinct to stick with ‘our own’: family, friends, party, country. How much do we know about what’s going on in the brain, when we are like that? How should the facts about our instincts figure in our moral philosophies? \n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Reason and Persuasion: Thinking Through Three Dialogues By Plato", 
    "price": 0, 
    "instructors": "John Holbo", 
    "institution_name": [
        "National University of Singapore"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/plato-dialogues", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}