{
    "selfpaced": true, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                    \n                    \n                    德国思想巨擎马克斯·韦伯在20世纪初，以其深邃的洞察力发现了欧洲文明进程中宗教信仰对近代资本主义诞生做出的特殊贡献，从而提出了不同于马克思“经济基础决定上层建筑”的历史发展观，并由此引发了一系列引人深思的文化、社会和宗教学问题。本课程将以对马克斯·韦伯的《新教伦理与资本主义精神》的深度阅读为基础，让学生对韦伯的宗教社会学研究有初步的了解，进而深入思考文化与社会互动的基本关系，提升学生的人文素养和培养独立思维精神。\n\n本课程在系统介绍韦伯《新教伦理与资本主义精神》背景的基础上，让学生直接、深入阅读文本本身，同时补充一些欧洲文化史的相关内容（文艺复兴、新教改革、启蒙运动、资本主义兴起），并穿插一些韦伯社会研究方法论的基本观念（例如理想型、价值中立、选择亲缘性等），使得学生深入思考文化和社会之间的双向、互动的关系。此外，本课程还将着重培养学生扩展阅读（韦伯的其他著作，如《儒教与道教》、《经济与社会》等）和独立思考的能力。如有可能，本课程还将引导大家来反思个人的生活选择，例如对时间、金钱和职业的态度。\n\n                                            Syllabus\n                        导论“未经反思的生活是不值得过的。”古希腊哲学家苏格拉底这样告诉我们。如果将这一原则运用于这门慕课，那么在开始上课之前，郁喆隽老师就要来反思一下为何要阅读这本书——《新教伦理与资本主义精神》，以及为什么要开设这门慕课。因此，本模块将不会急于直接进入文本本身，而是要处理一些准备性的大问题。导论将紧紧围绕“反思”一词展开，分别解说“何谓反思”、“为何反思”以及“如何反思”等问题，以此为本慕课设定一些目标和基调。韦伯和他的时代在展开对文本的深度阅读之前，本模块将系统地介绍韦伯的生平、精神特征和他所处的时代——德意志第二帝国。此外，本模块还涉及一些更为一般的问题，例如如何理解一个学者。这些内容都构成理解《新教伦理与资本主义精神》这本书不可或缺的背景。韦伯作为一个人，度过了怎样的人生，经历了哪些事件？他所处的时代，以及国家的基本状况，为韦伯写作该书提供了哪些基本的“问题意识”？了解了这些，将有助于我们更为深入地理解文本本身。宗教与资本主义本模块将开始直接深入分析《新教伦理与资本主义精神》的文本，大致对应书中第一卷的内容。本慕课的文本解读采取“剥洋葱”的方式：郁老师不会直接告诉大家韦伯的结论，而是层层推进，逐步分析韦伯问题的由来，阐明他对一些当时流行观点的看法，并最终导出本书的核心问题之一，即宗教与经济的关系。在此过程中，我们还将涉及一些本书的核心概念，如“苦行”、“资本主义精神”和路德的职业观等。基督宗教与西方文明本模块有意在两个文本解读中间安排一些对宗教内容的解说。自启蒙运动以降，自然主义和世俗主义大致成为当代人的基本假设。这可能导致我们忽视或低估宗教对文化、文明的影响。而且在一些国家的国民教育体系中，也较少涉及有关宗教的内容。因此，郁喆隽老师将从历史和文化的角度切入，大致介绍世界宗教的基本状况，并用大量的实例来说明什么是基督宗教、基督宗教的历史脉络、以及基督宗教对西方文明的塑造作用。入世禁欲的宗教基础本模块再次回到文本的深度解读，大致对应《新教伦理与资本主义精神》全书的第二卷内容。在本模块中，我们将跟随韦伯的思路，面对全书最为精要的分析段落，来回答第一卷中提出的基本问题。本模块将处理如下一些关系：苦行与新教教派、苦行与资本主义精神。我们将看到，韦伯如何以加尔文教派的神恩蒙选和预定论为重点，阐明其神学特征与资本主义诞生之间的“选择亲缘性”。其中也涉及一些当代人无法回避的基本问题，如怎样面对时间、职业和财富等。韦伯与亚洲韦伯在《新教伦理与资本主义精神》中处理的虽然是有关欧洲基督宗教的问题，但他提出的设问在 20世纪对亚洲产生了重大的影响。本模块将以《诸世界宗教的经济伦理》中所提出的“韦伯问题”为切入点，展开对韦伯另一部名著《儒教与道教》的解读，并简要介绍亚洲学者对儒家伦理与资本主义关系的研究。在本模块最后部分，我们将对课程进行总结和回顾，回到一些关于文化与文明的大问题。郁喆隽老师希望经过本慕课的学习，所有人对这些问题都有了全新的认识。\n                                    ", 
    "end_date": "2015-10-13T00:00:00Z", 
    "title": "《新教伦理与资本主义精神》导读", 
    "price": 0, 
    "instructors": "郁喆隽 ", 
    "institution_name": [
        "Fudan University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/max-weber", 
    "duration": "6 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-09-01T00:00:00Z"
}