{
    "selfpaced": false, 
    "topic_name": [
        "Philosophy"
    ], 
    "description": "\n\n                    \n                    \n                    这是一个全球化、信息化、快餐化的时代；全球化拷问着人们的文化根基，信息化拷问着人们的价值信仰，快餐化拷问着人们的经典阅读。 民族的就是世界的。为继承弘扬中华文化传统，我们特意打造这门课，希冀提供一个阅读哲学经典、传承中国文化、铸造民族精神的平台，让中国文化走向世界、走向未来。\n        本课分十个专题，分别介绍《周易》、孔子《论语》、老子《道德经》，《大学》与《中庸》，《庄子》，《孙子兵法》，《墨经》，《心经》，以及朱熹理学、王阳明《传习录》等著作和人物的思想。既有对儒释道经典的介绍，也有对理学、心学思想的阐释，以期以一种更广阔的视角看待中国传统哲学，让学生能够对中国传统哲学有一种全方位的认识。\n\n课程大纲\n\n第一章 《周易》导读\n\n第二章 《道德经》导读\n\n第三章 《论语》导读 \n\n第四章 《大学》《中庸》导读\n\n第五章 《孙子兵法》导读\n\n第六章 《墨经》导读\n\n第七章 《心经》导读\n\n第八章  《庄子》导读\n\n第九章  朱熹理学相关著作导读\n\n第十章 《传习录》导读\n\n                                            Syllabus\n                        《周易》导读《周易》纲纪群伦，广大精微，包罗万象，是中华文明的源头活水，是中国传统思想文化中自然哲学与人文实践的理论根源，是古代汉民族思想、智慧的结晶。燕老师讲授的《周易》导读，在对《周易》基本知识讲解的基础上，  力求通过古今结合，中外对比的讲解方式，从人生观，道德观和对话观等全新的角度，深入阐释《周易》三个重要的卦的卦辞和爻辞，以及它们所蕴含的启示，希冀能帮助你揭开这一古老而神秘的宝典的面纱。《周易》的作者是谁？《周易》呈现了怎样的人生观，道德观和对话观？你认为《周易》在这些方面会带给你什么样的启示？希望你带着自己的思考，参与到此专题的学习中，并能够更好掌握《周易》的基本概念，更重要的是能获得学习《周易》的方法。学习之余，你可通过选取《周易正义》，《周易今注今译》等专著进行更进一步的学习，做到孔子所讲的“玩索而有得”。《道德经》导读 “一个人在中国文化中被称为老子，大家还没什么意见，那这个人一定有蛮高的智慧才可以。”关于老子的记载并不多，在《史记》里边有《老子韩非子列传》共有四百五十个字左右提到过老子，从《老子韩非子列传》提到的关于“孔子向老子问道”的内容记载，我们可以引申出来中国文化和中国哲学的基本的架构其实就是儒道互补。朱光潜先生曾说过，以往发生的很多轰轰烈烈的事儿和我们有多少干系呢，只有那些思想家的智慧像黑夜中的星星，在黑暗中指点我们前进的道路。让我们跟着课程，寻找智慧的光芒。《论语》导读孔子是我国最伟大的思想家之一，同时也许也是对后世影响最大的一位。无论是他提出的“礼”、“义”观，还是他所奉行的“中庸之道”，都在中国传承了千年。上至帝王将相，下至贩夫走卒，都潜移默化地受着孔子的影响。理解孔子，是理解中国文化基因的必然。在本次课程中，妥建清老师将从《论语》的形式题材、文本意义出发，深入到孔子的学习方法、思想内涵，从而推至后世对于孔子的历史评价，以期能帮助你更好地理解孔子，认识到一个丰满的、立体的“孔子”。孔子作为儒家的创始人，他的思想始终扎根于中国传统文化的最深处，而他对于“仁”的体悟以及他的学习思考方法，也对我们当下的工作学习有着极强的现实意义。《大学》和《中庸》导读 《礼记》是一部经典的儒家思想著作，其中以《大学》《中庸》两篇最具有代表性，深刻阐述了儒家学者的人生目标、政治目标以及修养功夫。龚老师将在本次课程中重点为你介绍中庸与中和精神的践行意义、践行方法以及如何清除障碍以坚守中庸。此外还包括对《大学》中八条目政治意义的具体阐发，详细阐述了儒家对于弟子应承担修身、齐家、治国、平天下的政治期许以及他们所应具备的生命操守，生动形象地为我们揭示了作为一个合格的儒生应该具备何种操守，又应该以何种修养功夫完成自我修炼实现＂自成＂。《孙子兵法》导读将要导读的著作，对于爱好军事的同学是一个好消息，但是如果你认为它仅仅是一本军事著作，那显然你是OUT了。它缜密的军事、哲学思想体系，深远的哲理、变化无穷的战略战术，在现代远远不局限于一本军事著作的范畴，而是被广泛运用于政治斗争、商业竞争等各个领域。它就是《孙子兵法》。\n在这一课程中，邓妙子老师的《孙子兵法》导读包括四个部分的内容：孙子其人其书，用间篇，谋攻篇和军势篇。本周课程需要同学们完成15道单元测试题和1道课堂讨论题。《墨经》导读 《墨经》是对整个先秦时期百家争鸣思想的总结，是中国哲学当中可以与世界接轨的部分。通过学习可以较为有效地了解中国哲学中这一并不为人们所熟知的重要组成部分，进而使对整个中国传统文化有一个更为全面的认识。在学习本专题前，你可曾就以下问题作过思考：  为什么墨家学说没有像儒家思想那样广为流传？《墨经》是如何为墨家提倡的“兼爱”思想辩护并做进一步阐释的？如果你带着自己的思考与疑问，投入本次学习中，相信你会有意外的收获。《心经》导读 我们经常听闻“色即是空，空即是色”，你知道这句话出自哪里吗？是的，它出自《摩诃般若波罗蜜多心经》，简称《心经》。该经是佛教经纶中最为简短精炼，而内容又极为丰富的一部经典。《心经》所揭示的缘起性空之理，是大乘一切经教建立的理论基石。如实准确的把握此经的思想内涵，对于学习经教，指导修行，都具有重要意义。《心经》不仅对人的修行有重要的指导作用，而且对人的为人处世有多方面的启示。所以我们在学习《心经》的时候应该熟悉的掌握《心经》在佛教哲学中的重要地位，掌握对《心经》原文的基本意义的理解，掌握心经的基本的性空的思想。本章课程张帆老师为我们讲授的《心经》，将包括以下内容：从四圣谛了解《心经》的基本概念，《心经》的解析和中国佛教宗派及其演变。如果你是一名初学者，希望能更好的读懂《心经》，掌握《心经》的基本理念，我推荐你可以看弘一法师著的《般若波罗蜜多心经讲录》，能够很好的帮助大家更快的理解和掌握《心经》的基本理念和思想。《庄子》导读 想必你已经知道“庄生梦蝶”这个美丽而又富有诗意的典故，典故里的庄子，名周，字子休 ，号南华真人，为道教四大真人之一。庄子与道家始祖老子并称“老庄”，他们的哲学思想体系，被思想学术界尊为“老庄哲学”。其著作《庄子》里的文章，大都想象奇幻，构思巧妙，文笔汪洋恣肆，具有浪漫主义的艺术风格，瑰丽诡谲，意出尘外，乃先秦诸子文章的典范之作。庄子之语看似夸言万里，想象漫无边际，然皆有根基，重于史料议理，有着深远隐幽之意。本章课程就让我们在韩老师的带领下，探赜索隐，一品《庄子》之妙！朱熹思想导读 天理与人欲的关系问题是宋明理学讨论的主要问题，也是朱熹理学讨论的主要问题。朱熹认为人人都有高度的理性自觉，能够自觉控制自己的感观欲望，约束自己非分的欲念，以其精致的哲学论证确立了自己的价值判断，即存天理，灭人欲。本周课程将由李重老师主讲，以天理、人欲以及两者辩证关系为着眼点，分析朱熹理欲思想的特征及其所蕴涵的价值意蕴。\n你可曾思考过，何为天理？何为人欲？希望你能带着自己的认识，走进朱熹的思想天地，与之交集，与之交锋。《传习录》导读 做一个圣贤之人是中国古人的最高目标。那么，什么是贤人的标准呢？根据《左传》的说法，贤人应当达到“立德、立言、立功”三不朽的标准。据说在中国历史上，能达到这三条标准的人只有两个半，分别是诸葛亮、王阳明和曾国藩，前两位分别是一个，而曾国藩是半个。\n本专题便是围绕这位名副其实的贤人——王阳明及其思想展开的。“心即是理”，“知行合一”，“致良知”，对这些心学里的关键词，或许你似曾耳闻，或许你茫然不解，又或许你已了然于胸。但是燕老师通过中西比较的独到思考，信手拈来的古诗佳句，深入浅出的典故解读，必将把你引入另一种佳境，在这里你将看到燕老师轻松地这些关键词串在一条线上，它们紧密关联又相互衔接，在这里你体悟到的将不仅仅是心学，更是一种哲理人生！\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "中国哲学经典著作导读", 
    "price": 0, 
    "instructors": "妥 建清, 张 帆, 雒 自新, 邓 妙子, 龚 建平,  鹏杰, 燕 连福 and  重", 
    "institution_name": [
        "Xi'an Jiaotong University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/chinese-philosophy", 
    "duration": "10 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}