{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    What you’ll achieve:\nIn this project-centered course*, you will use the Business Model Canvas innovation tool to approach either a personal or corporate challenge or opportunity. You’ll learn to identify and communicate the nine key elements of a business model: Customer Segments, Value Proposition, Channels, Customer Relationships, Key Resources, Key Activities, Key Partners, Revenue Streams, and Cost Structure.\n\nYour completed project will be a polished Business Model Canvas that outlines the business case for a new product or service to address your selected challenge or opportunity. You’ll present your case in both a one-page document and a 10-minute video presentation.\n\nWhat you need to get started:\nThis project-centered course is designed for anyone who wants to understand innovation best practices and the intra-corporate entrepreneurial (intrapreneur) skills needed to lead innovation projects, teams, and strategies. Entry- and senior-level professionals in a variety of industries - including education, healthcare, business, and not-for-profit - will benefit from the course materials and project experience. The only prerequisite is a strong desire to understand best practices in innovation and to master the skills needed to transform a new idea into a profitable reality.\n\nTo complete the project, you’ll need to access the Business Model Canvas from either the Kauffman Foundation (http://www.entrepreneurship.org) or Strategyzer.com (http://www.Strategyzer.com), or via the Creative Commons license offered by Strategyzer AG (http://www.businessmodelgeneration.com/downloads/business_model_canvas_poster.pdf).\n\n*About Project-Centered Courses: Coursera's project-centered courses are designed to help you complete a personally meaningful real-world project, with your instructor and a community of like-minded learners providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share.\n\n                                            Syllabus\n                        The Business Model Canvas: A Tool for Entrepreneurs and InnovatorsAre you interested in starting your own business? Are you an entrepreneur who wants to accelerate profitable growth by improving your business model? Are you an intrapreneur, inside of an organization, who has a new idea that could make your customers smile and your competitors cry? If yes, then the Business Model Canvas is the best place to start. It is a proven tool for creating, assessing or reinventing a business model.The Customer Segments Every business model should start with selecting the customer segments that will benefit the most from your new idea, product, service, or solution. It's very tempting to select numerous customer segments that might have an interest in your value propositions. However, especially if you're just starting out, it's often best to choose just one, the most important, customer segment!The Value Propositions According to the authors of the Business Model Generation; \"The value proposition is the reason why customers turn to one company over another. It solves the customer problem or satisfies a customer need...some value propositions may be innovative and represent a new or disruptive offer. Others may be similar offers, but with added features and attributes.\" Channels and Customer Relationships Channels are a critical element of the business model. They are how a company communicates with and reaches its customer segments. Channels are typically direct or indirect and has five phases: awareness, evaluation, purchase, delivery, and after sales. Customer relationships can range from highly personal to automated. Either way, the objective is to develop authentic relationships that lead to trust and customer loyalty.Revenue Streams and Key Resources According to the authors of the Business Model Generation; \"If customers comprise the heart of a business model, revenue streams are its arteries.\" A business model typically has two different types of revenue streams--transactional and recurring. Key resources represent the most important assets required to make a business model work. The resources fall into several categories including physical, intellectual, human, and financial.Key Activities and Key PartnershipsThe key activities are what an entrepreneur or intrapreneur needs in order to create and offer a value proposition, reach markets, build and maintain customer relationships and generate revenues. Strategic partnerships have become a cornerstone of most business models. Entrepreneurs typically need the help of partners to create and deliver the value propositions. Innovation especially is a team sport.The Cost Structure The final building block focuses on what costs will be incurred as we create and deliver the value propositions to the customer segments. The most common categories of cost are cost-driven and value-driven. Costs can also be described as fixed costs and variable costs. Costs typically should be minimized in every business model but low cost structures are more important to some business models than to others. Think how Wal-Mart's business model is different from that of a luxury hotel.Presenting the Business ModelNow that your business model canvas is complete, it's time to tell your business model story to others. Successful entrepreneurs and innovators are masters at pitching their ideas and business models to stakeholders. The animated video titled \"Telling Your Story\" gives excellent advice on how to present your business model canvas.\n                                    ", "end_date": "2016-08-15T00:00:00Z", "title": " Business Model Canvas: A Tool for Entrepreneurs and Innovators (Project-Centered Course)", "price": 0, "instructors": "Dan Stotz", "institution_name": ["University System of Georgia"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/business-model-canvas", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}