{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    This course gives you access to Odyssey 3.14 - an original approach developed to help you invent or reinvent a business model. \n\nThis highly innovative approach has been developed by Laurence Lehmann-Ortega and Hélène Musikas and has been shown to be very effective. It is taught to top executives, entrepreneurs, and HEC students.\n\nYou will learn about the concept and tools that combine innovation and strategy. Starting with the 3 pillars that make up the core business model, this approach recommends 14 directions to consider in order to invent or reinvent the business model.\nWhether you are a graduate student, an executive or an entrepreneur, you will learn from examples and from your peers how to challenge your views in order to be innovative and come up with new ideas. \nOdyssey 3.14 is the result of over ten years of research, consulting and teaching. Over 100 companies that have successfully invented or reinvented their business model have been thoroughly analyzed and will inspire you to develop your own new, innovative business model.\n\nAt the end of the course, you will be able to :\n•\tDefine what a business model is and how it relates to other the tools and frameworks in strategy\n•\tUnderstand the 3 components of the business model and how they are linked\n•\tRemember the 14 directions in which to explore and imagine a new business model\n•\tUnderstand the Odyssey 3.14 global approach, which means being able to apply this approach to any industry\n\n                                            Syllabus\n                        Introduction to business model innovationWelcome to Odyssey 3.14! This introductory module aims at familiarizing you with innovation and business models. It will also give you an overview of the course and of your assignments.The 3 components of a business modelThis module describes in details the 3 components of the business model, which is the basis for the Odyssey 3.14 approach14 directions: 7 directions on the value proposition sideThis module explores the 7 directions on the value proposition side of the business model. Those are the 7 first directions out of the 14 directions of the Odyssey 3.14 approach. Each direction will be illustrated by several real life examples.14 directions: 7 directions on the value architecture sideThis module explores the 7 directions on the value architecture side of the business model. Those are the 7 last directions out of the 14 directions of the Odyssey 3.14 approach. Each direction will be illustrated by several real life examples.It's your turn to apply the Odyssey 3.14 approach!During this module, you will have to imagine an new, innovative business model by applying the Odyssey 3.14 approach. Creativity is key, both in coming up with the new model and in your presentation to your peer participants!\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "(Re)-invent your business model with the Odyssey 3.14 approach", "price": 0, "instructors": "Laurence Lehmann-Ortega and Hélène Musikas", "institution_name": ["HEC Paris"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/business-model", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}