{"selfpaced": true, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    The path for entrepreneurs to grow their companies outside of well-developed entrepreneurial ecosystems like Silicon Valley is challenging. Most markets around the world do not look like Silicon Valley, and they never will. But there are other models to support new businesses. In transitioning markets (where entrepreneurs do not have much access to private sector financing), government officials, donors, and business leaders are experimenting with creative approaches to support the growth of entrepreneurs. Northeast Ohio, whose largest city is Cleveland, is one such community. During our time together in this course, we will be exploring some of these innovative approaches. \n\nA massive intervention of government and donor resources in Northeast Ohio has been in place for over ten years. In that time, Northeast Ohio has experienced success (including job creation and follow-on funding) with alternative methods of financing startups, but it has not been easy. Yes, some progress has been made, but whether or not they've hit on ultimate success has yet to be determined. A dynamic entrepreneurial ecosystem takes many years, even decades, to develop. Government officials and donors typically are looking for shorter term success with their support programs which makes long-term support for entrepreneurship challenging. \n\nDuring this course, we will hear from entrepreneurs who have launched products and services ranging from medical devices to LED lights to whiskey. You will learn how these entrepreneurs engaged with resources made available to them through a variety of programs and intermediary organizations. We have chosen to talk with many business people that are still in the process of developing their companies and whose ultimate success or failure is still to be determined. \n\nIn addition to learning about Cleveland's attempts to support entrepreneurship, you will also be hearing in the lectures from leaders in selected markets around the world including Greece, Vietnam, Tunisia, Argentina, Rwanda and China about how they are working to support the growth of start-up companies.\n\nOne of our goals is to learn from you how different communities around the world are approaching implementing strategies and methods to support businesses. Taking what we've learned from our examples in class, I will ask you to reflect on how to best grow entrepreneurship where you live. I am excited to use this global platform to create a dialogue where information flows in multiple directions. \n\nMost MOOCs rebroadcast professors’ lectures, but this course will be different. Don’t expect to see me standing in front of the camera, talking and lecturing every module. Instead, the lectures will be relatively short in length and will have more of the feel of an engaging documentary than a static classroom setting.\n\n                                            Syllabus\n                        Course OverviewThe Course Welcome and Overview video lays the foundation for the course and provides context for what we are calling the “Cleveland Case Study.” We’ll explore how my hometown of Cleveland, Ohio is working to support start-up companies with the help of government and philanthropy/donors working in conjunction with the private sector.The Role of GovernmentThe Role of Government video lecture examines the role of government in an entrepreneurial ecosystem. You will learn how an entrepreneur from India developed a technology in a university lab and turned it into a medical device company in Cleveland with the support of government funding. As with all of lectures, you will also hear international perspectives on the topic, this time from Vietnam and Tunisia. In reviewing this lesson, consider the following questions. How can governments avoid bias? What is follow-on capital? What is government matching funds? How can both be used as tools to support startup initiatives? How can a government measure the success of its entrepreneurial support programs? What role does corruption play in government support?The Role of Philanthropy/DonorsThe Role of Philanthropy/Donors video lecture explores how foundations in Cleveland came together to form the The Fund for Our Economic Future (http://www.thefundneo.org/) to provide funding alongside government and the private sector to entrepreneurs. Consider the following questions when reviewing the materials.  Why donors get involved in supporting entrepreneurs? How donors may differ from government and private investors? What are the challenges of maintaining donor interest in entrepreneurship over the long haul? What makes philanthropies decide to dedicate resources to entrepreneurship and economic development? What is donor fatigue and what causes it? How are the metrics of success for a philanthropy similar and different from those of the government/private sector? Are donors more or less risk tolerant than their government and private sector counterparts? What role can corporations play in the international philanthropic setting? The Role of Intermediary Organizations/NGOsGovernments and donors are often forbidden by law or uncomfortable funding entrepreneurs directly so they provide grants to non-governmental organizations (NGOs) who then in turn offer capital, mentoring or other services to promising entrepreneurs. The Role of Intermediary Organizations/NGOs video lecture examines several examples of NGOs that do this type of work in Cleveland and around the world. Some key points covered in the lecture are: Why are intermediary organizations created? How do intermediary organizations measure success? What are the challenges of intermediary organizations?Leveraging Anchor InstitutionsThe Leveraging Anchor Institutions video lecture focuses on the role that anchor institutions such as universities can play in supporting the growth of entrepreneurship including supporting increased commercialization activity, licensing versus new company formation, and measuring success. While completing this module, consider the following questions. What are the different ways that anchor institutions stimulate entrepreneurship?\nWhy might an anchor institution provide financial support for an early stage company?\nHow can an anchor institution's research capabilities translate into support for early stage companies?\nWhat are the different ways that anchor institutes measure their own success?\nAccess to Capital and MentoringEntrepreneurs working outside of Silicon Valley with struggle with everyday: where to find capital (and mentoring) to grow their start-up companies.  The Access to Capital and Mentoring module includes three video lectures: Seed Accelerators, Angel Investors, and Venture Capital.  We trace how donors and government backers in Cleveland and selected international markets have come together with the private sector to support each of these areas. While completing this module, consider the following questions. Given the challenges, why would an angel investor invest in a highly risky startup? How is an angel investor motivated differently from other investors? Who has traditionally supported seed accelerators? Why do seed accelerators ask for equity in the companies that they support? Course Wrap-Up and Looking AheadThe Course Wrap-Up and Looking Ahead video lecture explores how much progress has been made in Cleveland and if the situation has really improved for entrepreneurs. Thought leaders and entrepreneurs provide advice for other communities around the world looking to support the growth of entrepreneurship.\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Beyond Silicon Valley: Growing Entrepreneurship in Transitioning Economies", "price": 0, "instructors": " and Michael Goldberg", "institution_name": ["Case Western Reserve University"], "commitment": "2-3 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/entrepreneurship-development", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}