{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    Skill at discovering new ideas, and delivering them, may be one of the most important practical job skills, in today’s and tomorrow’s job market. Creativity is an acquired skill, one that improves with practice. This course aims to empower individuals who believe they have lost their innate creativity, because they, their employers or teachers prefer the three R's: replication, repetition and rote, to innovation. We show how to re-ignite rusty creative powers. \n\nDuring this course, you will learn proven tools, frameworks and concepts useful for discovery– generating an endless stream of new ideas implementing at least some of those ideas with skill and persistence, based on books and articles written by the instructors. \n\nIn the first part of the course, you will learn a proven structured method for generating and implementing world-changing ideas known as ‘Zoom in, Zoom out, Zoom in’  that makes creativity more accessible to everyone. In the following weeks, you will learn practical proven tools useful for delivering ideas by employing the basic principles of business and management. You will practice the method, use it to tackle challenging real-world needs and produce a 2-3 minutes video presenting your idea.\n\nCourse Learning Outcomes\n\nOn successfully completing this four-week course, you will be able to:\n- Manage a process to generate an unending stream of creative ideas\n- Lead a process of innovation and implement ideas through all phases from discovery to delivery.\n- Apply creativity to a wide range of strategic management issues.\n- Solve problems with a high degree of innovation, creative thinking and risk taking.\n- Use and apply proven structured method for generating and implementing world-changing ideas known as ‘Zoom in, Zoom out, Zoom in’.\n- Develop and implement an innovation in your own practice.\n- Identify new and unfamiliar challenges and reflect on these challenges from a creative point of view, action they require and service they provide.\n- Demonstrate creative problem solving skills for defining, structuring and solving real world operations management problems.\n\n                                            Syllabus\n                        What is Creativity?Zoom in, Zoom out, Zoom inCreativity in practiceReinventing yourselfBonus material (ungraded module)In this module, Shlomo Maital Interviews Arie Ruttenberg. Most of the interview is in Hebrew, yet, subtitles are available for non-Hebrew speakers.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Cracking the Creativity Code: Discovering Ideas", "price": 0, "instructors": "Shlomo Maital", "institution_name": ["Technion - Israel Institute of Technology"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/startup-entrepreneurship-discovering-ideas", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}