{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    This course will allow you to identify and evaluate opportunities for creating a tech business, and to better understand its principal issues on a human, technical, commercial, environmental and financial level.\n\nAs such, you will obtain solid foundations either for building your own tech business, or for joining one.\n\nDeciding to create or to join a tech business in these early years is an out-of-the-ordinary adventure, and it certainly won’t be straightforward: you need to be ready to accept that not all \"good\" ideas will lead to success, and that only a very small number of projects lead to great success. You must learn to overhaul your relationship with failure, which is a valuable source of experience and should be managed according to the logic of “acceptable loss”: the entrepreneur loves uncertainty, not excessive risk. The creation of tech businesses gives you a genuine opportunity to change the world, but requires you to adopt a particular state of mind and to be able to acquire knowledge, know-how and interpersonal skills.\n\nYou will have the chance to work alongside passionate and exciting people from a whole multitude of backgrounds. From a technological point of view, these women and men have constructed numerous companies of a global scale.\n\nThe development trajectory of a tech business is full of mishaps which require you to be both agile and greatly prepared to build on a strong idea, choose your market, develop your proposal, assemble a team worthy of the task in hand, and finding financing.\n\nThe course is made up of methodological sessions as well as first-hand accounts from entrepreneurs and people who have succeeded in creating tech businesses themselves. You will thus be able to get to know the essential dilemmas with which high-tech business creators are confronted with, beginning with the initial decision to set up your very own structure, which itself represents a significant life decision.\n\nYou will also see that the creation of a tech business is much more a collective adventure than an individual one.\n\nIn the English version, all of the reading content, quizzes and assesments will be in English, whilst the videos will have French audio and English subtitles.\n\n                                            Syllabus\n                        From laboratory invention to formulation of an innovative conceptBefore any technical or financial consideration, the creation of a technology company is above all a human adventure that requires each associate to make personal choices. Besides your initial intuition that a new cutting-edge technology offer is marketable, we want to familiarize you with several development methods and practices. Mostly you will be asked to explore what the potential applications of your offer will be and the different ways to make it stand out from the existing offers.Fostering the development of your conceptThis session will familiarize you with the principal steps for bringing an innovative project to fruition. Among other things, we will evoke the fundamentals of managing a project and the knowledge acquisition process that enables you to make crucial decisions for the company over time.\n\nWe will also investigate the principal pillars of your strategic project and suggest some guidelines for the company strategy. You will be asked to understand the dynamics of the market that you are targeting and to identify what it takes to be leader in your segment. Your margin for maneuver will not be the same if your innovation creates a new market versus if it substitutes an existing offer.\n\nWe will also invite you to analyze the customer-perceived utility value, in terms of benefits as well as sacrifices.\n\nFinally, we will tackle an essential aspect concerning the valorization of a technology and the development of a company – intellectual property – and give you several solutions in order to use it wisely.Identifying the actors of technological innovationYoung technology companies often spring out of research work conducted in public or private laboratories. The technology transfer of this work can take place directly by license agreements. But in certain cases, the creation ex-nihilo of a company is the option used to transform academic learning and outcomes into an innovative product or service. This session will familiarize you with the purpose of a technology transfer service at a top-tier university with respect to scientific production.\n\nYou will learn about how a young researcher decided to create his own company to exploit his research work immediately after completing his thesis.\n\nWe will return once again to the importance of the team and the manner in which tech startups are structured. We will notably examine the role of the leader and conflict management, commonplace in startups.\n\nFinally, you will hear about the experiences of two management sciences researchers who studied the emergence of several dozen cooperative scientific projects at the Ecole Polytechnique.How to calculate your financing needs and to find fundingThe development of an innovative technology is an exciting adventure that is often like an obstacle course when it comes to finding the first sources of financing. Though new technologies are fascinating, many investors are reluctant to finance them because there are real technical, sales and human risks at stake.\n\nEven so, many sources of financing exist and tech entrepreneurs demonstrate tremendous creativity to successfully move forward from the development stage of a breakthrough technology to the commercialization of an innovative and profitable offer.\n\nThis session deals with the financing of the innovation and will show you how to assess your financing needs and how to find the corresponding resources. You will also gain insight into the reasoning of venture capitalists, who sometimes finance companies at a very early stage.Defining your business modelDeveloping a technology, building a team and financing the startup are not the only challenges that you and your colleagues will face. The elaboration of a credible value proposition and a scalable and profitable business model require a lot of back-and-forth discussions because the clients and sales terms and conditions of your offer will often be very different than originally planned.\n\nTo win over financial partners, you will have to present the essentials of your project in a business plan and we will familiarize you with its main components in this session.\n\nFinally, you will view two case studies about entrepreneurs who created their companies on the basis of their research work. One of them sold his company and the other did several rounds of venture capital to speed up development before his IPO.End of the course and final examThese last two weeks do not include any new elements of the course. You can organize yourselves however you wish over this period to review lessons and take the final exam.\n\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Creating and Developing a Tech Startup", "price": 0, "instructors": "Romain Beaume and Etienne Krieger", "institution_name": ["École Polytechnique", "HEC Paris"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/tech-startup", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}