{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    This course assists aspiring and active entrepreneurs in developing great ideas into great companies. With strong economies presenting rich opportunities for new venture creation, and challenging economic times presenting the necessity for many to make their own job, the need to develop the skills to develop and act on innovative business opportunities is increasingly vital. \n\nUsing proven content, methods, and models for new venture opportunity assessment and analysis, you will learn how to identify and analyze entrepreneurial opportunities. Entrepreneurial mindset, strategic decision making, and business modeling are core elements of the course. Our goal is to demystify the startup process, and to help you build the skills to identify and act on innovative opportunities now, and in the future.\n\nWith this course, students experience a sampling of the ideas and techniques explored in the University of Maryland's master's degree in technology entrepreneurship, an innovative 100% online program. Learn more at http://mte.umd.edu.\n\n                                            Syllabus\n                        Introduction to Innovation and EntrepreneurshipThis module includes a welcome to the course, an orientation to our teaching approach and faculty, and an introduction to the fundamentals of innovation and entrepreneurship.Entrepreneurial Mindset, Motivations, and BehaviorsThis module explores entrepreneurial thinking with attention to entrepreneurial mindset, entrepreneurial motivations, and entrepreneurial behaviors.Industry UnderstandingThis module examines how to recognize entrepreneurial opportunities based on market conditions and industry factors.Customer Understanding and Business ModelingThis module introduces approaches to understanding customers, developing compelling solutions, and crafting winning business models.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Developing Innovative Ideas for New Companies: The First Step in Entrepreneurship", "price": 0, "instructors": "James Green", "institution_name": ["University of Maryland, College Park"], "commitment": "3-5 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/innovative-ideas", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}