{"selfpaced": true, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    In this course, you’ll learn how to pitch your business and secure the funding you’ll need to launch your new company. We’ll show you how to write clear, compelling, and targeted mission and vision statements, set quarterly and annual goals, and find mentors, co-founders, and contractors to provide help along the way. This will help you establish a strong foundation for your business and confidently pursue viable funding models, including bootstrapping, crowdsourcing, accelerators, incubators, and more. As the culmination of all of your hard work, you'll complete the course by developing your own unique pitch deck that you can use to secure investment, and launch your business.\n\nThis course is part of our Tech Entrepreneur Nanodegree Program, click [here to learn more](https://www.udacity.com/course/tech-entrepreneur-nanodegree--nd007).Why Take This Course?By taking this course, you'll master critical steps necessary for the ultimate success of your new business. You'll learn how to define your vision and how to build a team around that vision. You'll then learn how to transform your vision into an engaging story that will inspire investors to fund your business. \n\nYou’ll do this by learning from some of the top voices in Silicon Valley, including Matt Kaufman, VP of Operations at Crunchbase, Gil Ben-Artzy, Co-Founder of UpWest Labs, and Gigi Levy-Weiss, Founding Partner of NFX Guild. Hear from successful entrepreneurs, including Noam Schwartz of SimilarWeb, Krispy Uccello of Google, and Art Gillespie of Udacity.\n\n                                            Syllabus\n                        ###Lesson 1: Set Your Goals\nWrite your mission and vision statements, set your milestones, and decide on the steps you plan to take to reach these goals.\n\n###Lesson 2: Define the Skills You Need\nPrepare to start building your team by analyzing your goals, evaluating needs, and identifying skill gaps.\n\n###Lesson 3: Build Your Team\nStart building your team by finding co-founders, mentors, freelancers, and employees to fill the skills gaps you identified in the previous lesson.\n\n###Lesson 4: Get Capital for Your Business\nChoose between bootstrapping, angel investors, venture capitalists, incubators, and accelerators as options for financing your business.\n\n###Lesson 5: Create Your Pitch Deck\nBuild your story and prepare a pitch deck you can use to gain customers or secure investment for your business.\n                                    ", "end_date": "2016-05-10T00:00:00Z", "title": "Get Your Startup Started", "price": 0, "instructors": "", "institution_name": ["Google"], "commitment": "6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.udacity.com/course/get-your-startup-started--ud806?utm_medium=referral&utm_campaign=api", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2016-04-19T00:00:00Z"}