{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    Where do great business ideas come from? We all have compelling business concepts that we've been thinking about for years. In this course we will explore how to use observational tools and other techniques for idea generation and we will talk about how to evaluate the good ideas from the bad. The goal is to settle on a business idea that you are not only passionate about but also has real market application.\n\nAt the end of this course learners will be able to:\n   -build a resource inventory from which they can assess and create market opportunities;\n   -pursue market opportunities consistent with personal passions and capabilities; and\n   -triage potential ideas in terms of which have the greatest potential for commercial and personal success.\n\n                                            Syllabus\n                        Ideation: Tools for ideation.How do entrepreneurs come up with great ideas? This is an age old question. Lets explore where great ideas and solutions come from and how to put yourself in a position to change the business world.Ideation: Intro to Design Thinking MethodologyIn this module we will explore the lessons of Design Thinking Methodology and how it can be used as a powerful tool for developing new and innovative solutions. Ideation: Intro to Customer DiscoveryMore often than not the best solutions don't lie with you but rather they are with your customers. In this module we will talk about how to develop a customer discovery plan that can lead to powerful business innovation. \n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "The Search for Great Ideas: Harnessing creativity to empower innovation. ", "price": 0, "instructors": "David Wheeler, Forrest S. Carter and Ken Szymusiak", "institution_name": ["Michigan State University"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/start-your-own-business-2-ideation", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}