{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    Interested to start your own business? Or learning more about entrepreneurship? Or even to apply the entrepreneurial spirit in your current job?\r\nDuring this course, we will examine the vital process behind the creation and construction of an emerging entrepreneurial company, and we will follow the life cycle of an idea into a company. We will examine the sources of ideas and how to evaluate, and we will discuss some innovative business models, and how to design your business model. Osoukk together we will identify and target customers, and will design your marketing strategy, including pricing and distribution channels. We will examine the financing of your company emerging strategy, including guaranteed sources and types of financing that you can get them as head of risk and investment financiers individuals money, in addition to the strategic search for funding. We will discuss the emerging company operations and how to set up and management of technology and human resources and the rest of their own operations. We will conclude by discussing the emerging company's future plan. In case of success - we will discuss the different growth strategies that can be overused. In cases of failure - we'll discuss how it can fail safely and play again.\r\nOver the course of this, we will use many of the case studies of entrepreneurs Arabs and we will discuss their journeys to start and grow their companies. We will provide you with resources that will help you to start your own business.\n\n                                    ", "end_date": "2015-12-23T00:00:00Z", "title": "من فكرة الى شركة: مقدمة في ريادة الأعمال", "price": 0, "instructors": "Nada Bashir and Ayman Ismail", "institution_name": ["American University in Cairo"], "commitment": "2 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edraak.org/course/course-v1%3AAUC%2BEntr_101%2BEntr_2015/", "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["Edraak"], "start_date": "2015-11-11T00:00:00Z"}