{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Being depressed can be hard to talk about.</strong> It is not easy to talk about with someone who has never lived with it, because it is not sadness. It lasts and we dont know if its ever going to be better. Depression makes us feel helpless and we are not. There is a lot of things we can do even by ourselves.</p><p><br></p><p>Based on all the times I tried and failed, all the research, my own positive breakthrough, the consistency in results and getting it I've really worked hard and refined it into a system. It means I took out the junk and left the best so its all power.<span></span></p><p><br></p><p><strong>\"It's hard to put into words what coming out of depression feels. All I know is that I feel right now in a way that I thought i'd never be able to again.\"</strong><strong></strong><br></p><p><strong><br></strong></p><p>And now you can learn too, I want to show you this system. To help you get the result you want, to cure depression from robbing you of life, to help with the tiredness, to make you enjoy life!<br></p><p><br></p><p><strong>This program is perfect if you can relate to these...</strong></p><p>You are always tired and its hard doing everything you want in a day<br>Its hard completing tasks.<br>Feeling worried even about small things<br>Negative thoughts are often playing over and over in your mind.<br>Sleep does't help, either problems falling asleep or waking up tired.<br>Difficult to concentrate on anything, you are more forgetful then ever.<br>You can feel bad about what you have or haven't done.</p><p><br></p><p><strong>Are you ready to finally..</strong>.</p><p>Have energy to do the everyday tasks and feel less tired?<br>Have more motivation and enthusiasm to get things done?<br>Remove never ending worrying and start enjoying life?<br>Be more successful in personal and professional life?<br>Stop feeling overwhelmed by life?<br>Remove negative thoughts, self-doubt?</p><p><br></p><p>Now make a click on the \"Take This Course\" Button next to this video. Then you get to pay with your credit card or paypal, all done with two simple clicks. That will give you access to this system within 5 minutes.</p><p><br></p><p>There is a 30 day money back guarantee - no questions asked!</p><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "6 Steps To Beat Depression", 
    "price": 0, 
    "instructors": "Simon Berg", 
    "commitment": "27 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631774_0402_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-cure-depression/", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T22:24:47Z"
}