{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Michael Magyar is a graduate of Framingham\nState University and the creator of this course.<em><strong> </strong></em>Michael earned a Bachelor of Sociology Degree with a\nPsychology minor in 1999. Michael became one of the leading presenters among\ninmates on the disease of addiction during his time in jail at the Essex County\nCorrectional Facility (The Farm) in Lawrence, Massachusetts. While on parole\nand probation, he created the Addict’s Map of Consciousness and presented it to\nthe homeless veterans during his inpatient stay at the Crescent House\nTransitional Residence Program in Lowell, Massachusetts. The map is the\nbackbone of addiction recovery. It will allow the student of this course  to experience Zen-like moments and will most certainly question his or her own understanding of social learning, cognitive processes and behavior theory.</p>\n\n<p>The disease of addiction begins as a\ndisease of the spirit and usually ends up as a disease of the body, mind and\nspirit. It becomes progressively worse until finally devouring the addict’s\nmoral, physical, mental, emotional, economic, social and legal life. Because addiction is\na spiritual disease it requires a spiritual remedy. Our modern day treatment\nplans have not been that successful. About 1 in every 50 American men is\ncurrently behind bars from addiction related charges. More and more people are\ndying every day from overdose and relapse. Perhaps it’s time to put away the\nbrain scans and magnetic resonance imaging and go back to school -- very old\nschool. Choosing a treatment plan from one of our ancient spiritual doctrines,\nwith the concept of God or not, may give the addict the best chance from\nbecoming the complete failure that is addiction. </p>\n\n<p>Finding a way out of fear is the way out of\naddiction and may provide the addict the best chance to keep his or her life.\nThis course is about recognizing your fears and learning  how your own\naddiction to instincts naturally makes you an addict. This course centers around the spiritual principles found throughout the literature of Narcotics Anonymous and\nAlcoholics Anonymous. </p><p>Kavita Maharaj, an internationally recognized registered meditation teacher and trainer provided insight on Vipassana meditation for this course.</p>", 
    "end_date": null, 
    "title": "Addiction Recovery Made Simple: Advanced Tactics for Addicts", 
    "price": 0, 
    "instructors": "Mr. Michael Magyar", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698644_6c8f_6.jpg", 
    "course_url": "https://www.udemy.com/addiction/", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T23:05:13Z"
}