{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \t  This course has over 19 lectures and more than 2 hours of content, including interviews with sought-after professionals in the field, that anyone who loves someone with autism, Asperger’s, or PDD-NOS should know.  About 30 percent of children wit autism have low muscle tone.  </p>  <p>  \t  How do you know if your child may have low muscle tone?  Ask yourself these questions:  </p>  <ul style=\"\">  \t<p>  \t\t  ·Has your child missed milestones?  \t</p>  \t<p>  \t\t  ·Was your child a floppy baby?  \t</p>  \t<p>  \t\t  ·Is your child a picky eater?  \t</p>  \t<p>  \t\t  ·Does your child appear to not feel pain?  \t</p>  \t<p>  \t\t  ·Is your child overly sensitive to light touch but under sensitive to deep touch?  \t</p>  \t<p>  \t\t  ·Does your child see the details but miss the big picture?  \t</p>  \t<p>  \t\t  ·Does your child have poor posture?  \t</p>  \t<p>  \t\t  ·Can you child ride a two-wheeled bike?  \t</p>  \t<p>  \t\t  ·Is your child clumsy?  \t</p>  \t<p>  \t\t  ·Is your child awkward?  \t</p>  \t<p>  \t\t  ·Does your child avoid eye contact?  \t</p>  \t<p>  \t\t  ·Does your child have poor handwriting?  \t</p>  \t<p>  \t\t  ·Does your child bump into objects?  \t</p>  \t<p>  \t\t  ·Is your child a toe-walker?  \t</p>  \t<p>  \t\t  ·Does your child move around a lot?  \t</p>  \t<p>  \t\t  ·Does your child get fixated on one thing?  \t</p>  \t<p>  \t\t  ·Does your child have gastrointestinal problems?  \t</p>  \t<p>  \t\t  ·Does your child have an altered immune system?  \t</p>  \t<p>  \t\t  ·Do your child’s behaviors include hand flapping or spinning?  \t</p>  \t<p>  \t\t  ·Does your child look out of the sides of his or her eyes?  \t</p>  \t<p>  \t\t  ·Does your child overreact or under react to stimuli?  \t</p>  \t<p>  \t\t  ·Does your child look down or away when someone’s talking?  \t</p>  \t<p>  \t\t  ·Does your child avoid sports like baseball, where there’s a fast-moving ball coming at him or her?  \t</p>  </ul>  <p>  \t<strong style=\"\">Imagine if these behaviors are simply coping mechanisms due to an underdeveloped neurological system, specifically low muscle tone, and that you can help it develop.</strong>  </p>  <p>  \t  Autism, among other conditions, affects muscle tone (including that of the eyes and the vestibular system, which I’ll cover in another course) in many individuals.  In fact, in many cases it may the foundation of autism symptoms.  </p>  <p>  \t  Your child may be overloaded with sensory information (the lights are too bright, the sounds are too loud) or underloaded and seek stimulation to function as well as he or she can.  Every day is a struggle to understand the world.  </p>  <p>  \t  Autism is in large part a developmental problem, which means that certain neurologically-connections  haven’t fully development. The brain – and its neurological connection to muscles – are part of autism and developmental delays.  </p>  <p>  \t  Low muscle tone can interfere with motor and sensory development, which in turn affects the child’s view of the world and his or her place in it.  It affects perceptions and the ability to feel physical pain and to empathize with others, among many other things.  </p>  <p>  \t<strong style=\"\">Piecing the autism puzzle together </strong>  </p>  <p>  \t  In this course, I will present information through lectures, PDFs, and video interviews with experts.  You will have the opportunity to:  </p>  <ul style=\"\">  \t<p>  \t\t  ·Learn how motor activity helps the brain to develop  \t</p>  \t<p>  \t\t  ·Learn the most common reason why children with autism miss one or more milestones  \t</p>  \t<p>  \t\t  ·Learn about primitive reflexes and what role do they play in autism  \t</p>  \t<p>  \t\t  ·Learn  about muscle tone, balance, and motor coordination  \t</p>  \t<p>  \t\t  ·Learn about the connection between low muscle tone and emotions  \t</p>  \t<p>  \t\t  ·Learn  how the brain controls the digestive system  \t</p>  \t<p>  \t\t  ·Learn how the brain controls the immune system  \t</p>  \t<p>  \t\t  ·Learn about functional disconnection  \t</p>  \t<p>  \t\t  ·Learn about asymmetry of sides in muscle tone and how that imbalance leads to imbalanced feedback to the brain  \t</p>  \t<p>  \t\t  ·Learn how about the connection of vision to autism  \t</p>  \t<p>  \t\t  ·Learn how it can be treated  \t</p>  </ul>  <p>  \t  This therapy is <em style=\"\">not</em> a quick fix.  And it may not apply to your child.  But it might, and it might change the course of his or her life.  </p>  <p>  \t  You may be able to unleash your child’s potential.  In this course, I hope to help you stop the senseless struggles and the needless suffering and watch your child <strong style=\"\">blossom.</strong>  </p>", 
    "end_date": null, 
    "title": "Autism and  Low Muscle Tone", 
    "price": "30.00", 
    "instructors": "Stacie Berg", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421152_f93e_2.jpg", 
    "course_url": "https://www.udemy.com/autism-and-low-muscle-tone/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-13T15:53:26Z"
}