{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>TOP RATED MENTAL HEALTH COURSE ON UDEMY </strong>  </p>    <p>  \t<strong>==============================================</strong>  </p>    <p>  \t<strong><em>LATEST: Course updated 16th October 2015</em></strong>  </p>    <p>  \t<em>                    - Free six months access to subscription-based mental well-being  app - Rize - enrolled students only. Limited time offer.</em>  </p>    <p>  \t                              Do you sometimes find stress getting the better of you? - can't shut your thoughts off when you want to relax, feeling held back from living a healthy lifestyle where you're reaching the goals you really want from life? Maybe you're interested in developing an emotional resilience - able to bounce back much more easily from the challenges life can throw at all of us sometimes, or you're looking for a way to enhance the quality of your life.  </p>  <p>  \t              This course has been specifically designed to explain simply yet effectively the subject of mental well-being. The curriculum has been tailored to make sure that your learning experience will be relevant, accessible, simple, engaging and effective.  </p><p>  \t                                                With over 3+ hours of videos, audio lectures, interactive quizzes and a handful of text-based lectures I will lead you through a range of therapeutic concepts - accessible to you through your computer or on your smartphone via the Udemy app.  </p>  <p>  \t                              Through this course I will help you to find the right tools for you that can help you to support your mental well-being. Therefore within the lectures I provide simple, interactive exercises that will enable you to try out and integrate the concepts within the course into your life.  </p>  <p>  \t                                                                             My course includes:  </p>  <p>  \t                                      - The basics of the exercises we will be using, and your supplemental worksheet 'diary'  \t                              - Evidence based therapeutic concepts and exercises that you can practise here with me and then integrate into your daily life  \t                                      - Simple and lifestyle changes to aim for and accomplish  \t                                      - Exercises that will help you to 'flourish'  \t                                      - Supplementary materials   \t                                      - Milestone quizzes to make sure you're absorbing all the information we're throwing your way  </p>  <p>  \t                              - Free access to my subscription-based app - Rize  \t  \t                                    Mental well-being is important to your health. It helps you to manage your mental health, your focus, lifestyle, and reaching your goals in life. By integrating therapeutic and evidence-based concepts such as mood tracking, cognitive behavioural therapy, mindfulness, physical exercise and diet, activity plans, flourishing, and more you can make a big difference to your life..  </p>  <p>  \t                                                                             The course will take on average thirty days to complete, with no more than twenty minutes each day.  </p>  <p>  \t                                      If you're unsure don't worry: I offer a full 30 day money back guarantee if you're not completely happy with the course.  </p>  <p>  \t                              I have provided some of my lecture material as available for a free preview. So scroll down and take a look to get a feel for my course and see if it might be right for you.  </p>  <p>  \t                      Here are a few of the reviews for my course, so you can see what my current students are saying about it:  </p>  <p>  \t<strong>* * * * *</strong>  </p>  <p>  \t                    \"The instructor obviously took his time to structure this course. What I  like is that it flows well, and when I messaged him with a few parts I  was unsure about it took less than an hour to hear back from him! 100%  recommended.\" - Liam Jacob  </p>  <p>  \t                    * * * * *  </p>  <p>  \t                    \"This is an amazing course to go through. It explains magnificently how  our mental health connected to our physical and social health. I like  the easy flow of the lectures.I am looking forward to read the reference  books as well. This course gave me an entire new perspective on my life and world  around me and how can I improve my thought process. I was surprised when I found some of the examples actually are like my  own ways of thinking and I am happy to learn how I can remove those  negative thinking and move forward. I am going to follow all the mental,  physical and lifestyle improvement activities suggested. I would thank the instructor for sharing important sites for urgent  support. I think lots of people will benefit from it.\" - Jia Sen  </p>  <p>  \t                              When you're ready to, click the \"Take this course\" button on the top right of your screen, become a part of our learning community and start improving your mental well-being.  </p>  <p>  \t                              I look forward to seeing you on the course and to helping you to Rize, one thought at a time.  </p>", 
    "end_date": null, 
    "title": "Balance your mood, manage your stress and flourish", 
    "price": "20.00", 
    "instructors": "John Harper", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/270960_079d_10.jpg", 
    "course_url": "https://www.udemy.com/rize/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-29T13:20:45Z"
}