{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Beat Depression - start living again is a Self Help Guide written to help sufferers with depression, their Family and Friends.</p>\n\n<p>It is written by an ex sufferer in simple easy to understand ways and does not use any complicated medical terms or jargon. His research over 3 years found little or nothing written that would really help anyone understand depression or what to do about it.</p>\n\n\n\n\n\n\n\n<p>He wrote a book about his experience to explain the 10 feelings he identified and published the Second Edition in 2013. It is called \"Depression: The already drowning Man\" and has sold in over 20 Countries world-wide. The book was widely acclaimed and was endorsed by Doctors and Psychiatrists, sufferers and their Family or Friends. Hundreds of readers have awarded the book marks out of 10 and the average to date is 9.3.</p>\n\n\n\n\n\n\n\n<p>However, the book only covers what the feelings are and makes no attempt to explain what to do to help overcome them. Instead of writing a Third Edition with some helpful suggestions the author thought it more helpful to create this Course which is more easily accessible on-line and does offer some help in addition to any medication or counselling the sufferer might already be receiving..</p>\n\n\n\n\n\n\n\n<p>The Course contains 18 \"bite sized\" Lectures of between 3 and 9 minutes which each use a series of slides and an image meant to imply how a suffer might feel with a particular feeling. It doesn't use talking head videos of the author (or anyone else) as he felt that would be distracting. The Lectures also include ideas on what to do to overcome each of 10 feelings he has identified.</p>\n\n\n\n\n\n\n\n\n\n<p>The Course also includes 3 downloadable PDF's with information and techniques designed to support the sufferers recovery and return to well being.</p>\n\n\n\n\n\n\n\n\n\n<p>The Course is broken done into 19 Lectures in 4 Sections. The Main Section covers the 10 feelings in 10 Lectures and takes 66 minutes to complete. It is supported by 9 Lectures in 3 more Sections which offer additional explanatory material and handouts and they take 54 minutes to complete.</p>\n\n\n\n\n\n\n\n\n\n<p>Depression is a horrible illness and anyone suffering with it is desperate to find a <strong>FAST</strong> solution to how they feel. Family and friends are also anxious to find out what depression is and how they can help and support the sufferer they know and love. Anyone taking this Course will learn how to understand Depression better, how to deal with it or support someone who has it and, potentially, even avoid getting depression themselves!</p>\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Beat Depression - start living again", 
    "price": "20.00", 
    "instructors": "John Swallow", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/798746_e384.jpg", 
    "course_url": "https://www.udemy.com/course-how-to-beat-depression/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-20T11:26:25Z"
}