{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course offers you relief from <strong>depression symptoms</strong> in a very short period of time:</p><ul><li>Meditation</li><li>Nutrition tips</li><li>Lifestyle habits changes</li><li>Complementary and alternative ways of treatment guide</li><li>A practical step by step guide on how to change the way you treat yourself</li><li>Happy Mindshift: How to force yourself to change perspective</li><li>No medication</li></ul><p>Take this course and <strong>free yourself from daily stress and sadness</strong>. Forget about pills and chemicals. Now you can heal and balance yourself in no time using natural treatments and simply changing your perspective. Change your mind and become happy. No one even has to know that you are depressed! <br></p><p>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%</p><p><strong>What students say about this course:</strong></p><p><em>\" Mr. Ayman A.</em>: <strong>A</strong><strong>mazing</strong></p><p>This course was excellent and rich with useful information. It is clear that this course has been prepared professionally\"</p><p>\"Paul P.: <strong>I learned a lot!</strong></p><p>I did not take this course because I have an issue with depression. Rather, I took it because I have never had such an issue and I don't understand the people I know who are suffering from it. I learned a lot here about what depression is, what causes it, and the ways to help work through it. Definitely a worthwhile course!\"</p><p>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%</p><p><strong>What will you get out of this course? </strong>Well, a completely changed point of view about yourself and your life. About building interpersonal relationships the right way. About treating yourself in a way that it will be impossible to get depressed again!  After this DIY tutorial you will become the person you want to be very shortly. Happy and depression free! </p>", 
    "end_date": null, 
    "title": "Beat Depression by generating Happiness habits", 
    "price": "20.00", 
    "instructors": "Elena Seranova", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350546_51b3_2.jpg", 
    "course_url": "https://www.udemy.com/beat-depression-in-2-weeks/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T06:49:35Z"
}