{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Do you worry over and over that you are in the \"wrong\" relationship? Do you panic over whether your partner is funny/smart/attractive enough? Are you anxious around your partner at random times, when all you want to do is be in love?</strong></p><p>You aren't alone. Many people struggle with these concerns. They can come down to relationship anxiety, and can be termed in certain situations as relationship OCD. </p><p>This course is a one stop shop to starting or furthering your recovery from relationship OCD (rOCD). </p><p>You’ll learn strategies based in exposure and response prevention therapy (ERP), Acceptance and commitment therapy (ACT), mindfulness, meditation, the tips I learned through experimentation and research, and finally I have added a Q&amp;A section to answer your burning questions, empowering you to BEAT RELATIONSHIP OCD. </p><p><strong>Key features:</strong></p><ul><li>33 videos</li><li>Learn how to face your OCD relationship fears</li><li>Learn how to accept your intrusive thoughts about your partner</li><li>How to use an acceptance and ERP script to cope and recover from rOCD</li><li>12 key rOCD questions answered with actionable advice</li><li>8 Key tips - including using flow, the reset button and changing your view of love</li><li>LifeTime access to this course, 24 hours a day, 7 days a week!</li></ul><p><strong>Am I a therapist? </strong></p><ul><li>Nope, I’m just a fellow sufferer who was forced to beat relationship OCD. This course is the product of my struggle, my research and my experimentation! </li></ul>", 
    "end_date": null, 
    "title": "Beat Relationship OCD (rOCD) And Obsessive Thinking!", 
    "price": "50.00", 
    "instructors": "Stuart Ralph", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765442_7a24_3.jpg", 
    "course_url": "https://www.udemy.com/beat-relationship-ocd-rocd-and-enjoy-your-relationship/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T13:58:48Z"
}