{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>FasterEFT ist gleichzeitig eine wunderbare Selbsthilfemethode, wie auch ein hoch-effizientes Therapie-Tool. Es wurde von Robert G. Smith (USA) entwickelt und vor allem über Robert Smith's Video-Kanal \"healing magic\" bekannt. Dort sind inzwischen schon über 900 kostenlose Videos online, und es werden immer mehr. Diese Videos sind wundervoll und ich kann jedem nur empfehlen sie anzuschauen.</p><p>Allerdings sind sie alle in englischer Sprache (für einige wurden von Katharina Hille deutsche Untertitel geschrieben) und aufgrund der schieren Menge an Videos findet man manchmal \"den Wald vor lauter Bäumen nicht\".</p><p>Darum hat Katharina Hille (Heilpraktkerin) diesen Kurs entwickelt, für alle die sich für FasterEFT interessieren oder einfach auf der Suche nach einer Methode sind, mit der man Ängste, Depressionen, Schmerzen und Stress auflösen kann.</p><p>Katharina Hille wurde von Robert G. Smith ausgebildet (ist derzeit Level-II).</p><p>Dieser Kurs ist eine allgemeine Einführung in FasterEFT: zum Kennenlernen und selbst anwenden. Der Kurs ist allerdings keine FasterEFT-Ausbildung, diese kann ausschließlich bei Robert G. Smith selbst absolviert werden.</p><p>Der Kurs dauert knapp 75 Minuten und richtet sich an alle die sich für FasterEFT interessieren und lernen möchten, wie sie es für sich selbst anwenden können. Er erklärt genau was FasterEFT ist, wer es entwickelt hat, wie es funktioniert, wie man es in seinen Alltag integrieren kann und wo man im Internet mehr Infos, andere Interessierte und auch FasterEFT-Practitioner findet.</p><p>Nach diesem Kurs weißt du, was FasterEFT ist, wobei es dir helfen kann und wie genau es funktioniert.</p><p>Durch diesen Kurs lernst du, wie du verändern kannst, wie du dich fühlst und zwar jederzeit.</p><p>Übrigens: Ich würde mich freuen, wenn Du die Kommentar-Funktion innerhalb des Kurses nutzt. Du kannst damit feedback geben, vielleicht in Kontakt mit anderen Kursteilnehmern treten oder mir auch Fragen stellen, auf die ich natürlich schnellstmöglich antworten werde. Wenn dir also irgendwas noch nicht ganz klar ist oder du über etwas bestimmtes mehr wissen möchtest, dann frag mich. <br> Dafür bin ich als Kursleiterin da!</p>", 
    "end_date": null, 
    "title": "Befrei dich vom Stress mit Faster EFT", 
    "price": "25.00", 
    "instructors": "Katharina Hille", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607174_95eb_5.jpg", 
    "course_url": "https://www.udemy.com/stressfrei-mit-fastereft/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T18:21:49Z"
}