{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is taught by Dr. David Grand, who’s famous for his creation of Brainspotting, a powerful approach for creating change and healing at the neurological level by focusing on where a person is looking.</p><p>You’ll learn how to not only balance, but also enhance, the way the brain functions so that you can enjoy improved mental clarity, performance, relaxation, meditation, studying, and creativity.</p><p>Whether you want to learn this method for yourself or you’re a therapist in search of the best ways to encourage healing in your patients, this course will dive deep into Brainspotting and its many benefits.</p><p><strong>Learn Brainspotting to Heal Physical and Emotional Ailments</strong></p><ul><li>Comprehend Brainspotting’s History and Most Effective Applications</li><li>Learn Brainspotting’s Three Modes: Gazespotting, Inside Window, &amp; Outside Window</li><li>Use Brainspotting to Harness Neuroplasticity for Natural Healing in Yourself or Your Patients</li><li>Heal Trauma, Release Mental Blocks, and Maximize Creative and Physical Potential</li></ul><p><strong><br>Tap into the Brain’s Power to Promote Natural Healing</strong></p><p>Dr. Grand uses this course to reveal key insights that have allowed him to create a revolutionary therapeutic tool called Brainspotting. </p><p>This new method has been making waves in the field of brain-based therapy and psychological health.</p><p>Brainspotting combines talk therapy’s benefits with the brain’s power to promote rapid healing. It also focuses on the fact that where you look with your eyes relates directly to what’s going on in your brain.  </p><p>You’ll move through four sessions that will show you how to harness the brain’s self-scanning system. This will allow you to locate and resolve old traumas, overcome obstacles in physical performance, and unleash creativity.</p><p><strong>Contents and Overview</strong></p><p>This course starts off with an overview of Brainspotting’s history and application, including how it has been used to treat everyone from athletes and businesspeople, to artists and survivors of disasters.</p><p>Dr. Grand will focus on showing you how Brainspotting can be applied to those suffering with mental health problems, particularly trauma. You’ll also learn how it can be applied to anyone who’s hoping to enhance their creative or athletic performance.</p><p>You’ll even view live demonstrations of Brainspotting coaching. </p><p>This will allow you to really see the immediate benefits and understand how you can apply this technique on yourself or on one of your patients.</p><p>To enhance other systems of psychological self-care or therapy, and to help spark effective, rapid change and healing, you’ll also master how to use the brain’s natural scanning system to promote healing naturally.</p><p>By the end of this course, you’ll have a thorough understanding of Dr. Grand’s work in Brainspotting, and how this therapy can be used to overcome a variety of physical and emotional ailments.</p><p>You will be able to apply Brainspotting techniques to promote healing, particularly if you’re a therapist and you work with patients who have difficulty overcoming traumas or fears.</p>", 
    "end_date": null, 
    "title": "Brainspotting by David Grand, PhD", 
    "price": "50.00", 
    "instructors": "Sounds True, David Grand", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757544_1516.jpg", 
    "course_url": "https://www.udemy.com/brainspotting-by-david-grand/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T19:54:51Z"
}