{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">CBT Therapy: Online Counselling &amp; Cognitive Behavioural Therapy (CBT) Training Course</strong></p>\n\n<p>  \t      This course is intended for everyone, regardless of their preferred learning style. </p>\n\n<p>It comes with unparalleled support from the course creator, Libby Seery, and she is available to her students 7 days a week.</p>\n\n\n\n<p>But equally, it is perfect for those preferring to work independently.  It is comprehensive, and yet easy to follow.</p>\n\n\n\n<p>  \t      This CBT therapy: online counselling and cognitive behavioural therapy (CBT) training course is designed so that everyone can benefit and make significant changes to their personal and professional life. It's suitable for beginners, right through to established practitioners. Those who wish to build on their existing knowledge of CBT, and those who have no prior experience of the subject.  </p>\n\n\n\n<p>This CBT therapy: online counselling and cognitive behavioural therapy (CBT) training course is also suitable for:  </p>\n\n\n\n<ul>  \t<li>those who wish to further their career in this field, or any other coaching / therapy       based fields. </li>  \t<li>for people who are interested in self help and self development. </li>  \t<li>for anyone who wants to train in becoming their own counsellor and CBT therapist.</li>  </ul>\n\n\n\n<p>  \t      There is no specific time frame in which the course should be completed, in fact we encourage you to take a break after certain lectures, to ensure that you have the space and time to complete the exercises, in full.  </p>\n\n\n\n<p><strong>CBT therapy: online counselling and cognitive behavioural therapy (CBT) training course is comprehensive and here are just some of the things covered:</strong>  </p>\n\n\n\n<ul>  \t<li>What CBT is, Who uses CBT, and what CBT can be used for</li>  \t<li>How to apply CBT when used as a self help therapy</li>  \t<li>Principles of CBT</li>  \t<li>Understanding the CBT triangle</li>  \t<li>Recognising our emotions</li>  \t<li>Identifying thoughts feelings and behaviours</li>  \t<li>Understanding our thoughts feelings and behaviours</li>  \t<li>Negative automatic thoughts</li>  \t<li>Recognising thinking traps</li>  \t<li>Identifying negative cycles</li>  \t<li>Challenging negative patterns of thoughts feelings and behaviours</li>  \t<li>Finding alternatives</li>  \t<li>Changing unhelpful thoughts feelings and behaviours</li>  </ul>\n\n\n\n<p>  \t      We also have a number of bonus lectures, including a special section on Anxiety.</p>\n\n\n\n<p>  \t      This CBT therapy: online counselling and cognitive behavioural therapy (CBT) training course will be life changing, as you learn how adaptive CBT is, and how you can apply it to many situations, big or small. You'll learn new life therapy skills and techniques.</p>\n\n\n\n<p>  \t      You'll have an understanding of the principles of CBT and their relevance to your life and others around you. Be able to identify and make changes to negative patterns of thoughts, feelings and behaviours. This course will equip, and prepare you, for the next stage of your learning, in advanced Counselling Skills, and the next stage of learning to become your own CBT therapist.  </p>", 
    "end_date": null, 
    "title": "CBT Therapy - Cognitive Behavioural Therapy", 
    "price": "20.00", 
    "instructors": "Libby Seery", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248826_0b4c_5.jpg", 
    "course_url": "https://www.udemy.com/train-to-be-your-own-counsellor-cbt-therapist/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-23T16:57:33Z"
}