{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em></em>Cognitive Behavioral Therapy (CBT) for psychosis is an evidence-based method to reduce distress and disability related to psychotic experiences, and to support a possible full recovery. Psychotic experiences are conceptualized as being understandable in relationship to an individual's life story, and capable of being altered when people experiment with different ways of thinking and behaving. Learn how to collaborate with people having these experiences, “exploring the evidence\" rather than imposing beliefs, and developing coping options so people are not forced to rely entirely on the often limited effectiveness of medication to address problems.</p><p>The course starts by examining the nature of psychosis and CBT, providing a foundation for understanding how CBT can be helpful. Then the basic style of CBT for psychosis is introduced, followed by an introduction to two of the most important techniques. Finally, applications of CBT are explored for some of the main problem areas, such as hearing distressing voices, paranoia, delusional beliefs, disorganization, and negative symptoms.</p><p>Included in the course are video lectures, slides with some diagrams, video demonstrations of CBT for psychosis being practiced, and links to additional resources for further study. </p><p>CBT for psychosis uses a minimal amount of jargon, and the concepts and practices tend to be easily understandable.</p><p>The course will take 5 hours to complete.</p><p>5 hours of continuing education credits are available for social workers, psychologists, and nurses in the US, and also for licensed professional counselors and marriage and family therapists is some states in the US. (See the “What am I going to get from taking this course\" section for more details on those.)</p>", 
    "end_date": null, 
    "title": "CBT for Psychosis", 
    "price": "50.00", 
    "instructors": "Ron Unger", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327288_0184_2.jpg", 
    "course_url": "https://www.udemy.com/cbt-for-psychosis/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-26T00:10:26Z"
}