{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>CBT, Cognitive Behavioural Therapy for Depression, Anxiety, Phobias and Panic Attacks</p><p>Do you suffer from depression, anxiety, phobias or panic attacks? Many of us do to some degree or another. If so, this course on CBT for depression, anxiety and phobias is exactly what you’re looking for. CBT or Cognitive Behavioural Therapy is an innovative and effective approach to psychotherapy that has helped millions of people around the world manage and overcome a wide range of issues related to unwanted thoughts, feelings and behaviours.</p>\n\n\n\n\n\n<p>One of the most defining features of CBT is its focus on teaching people to be their own therapists. The idea is not to make you dependent on years of therapy, but to teach you practical strategies and methods that you can use to deal with current problems right now, as well as to handle any future issues.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Depression, anxiety and phobias are some of the most common mental issues that people face in everyday life, and CBT can provide you with solutions to these problems immediately. In this course we’ll look at each of these in turn and outline strategies and methods you can use in order take control of your own mental health.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Here we’re offering a way for you to take charge of where your life is going. A way to be aware of the big and small things that happen in your life from minute to minute and day to day. We’ll address negative thought patterns, which will eliminate negative feelings and destructive behavioural patterns. CBT can provide you with solutions to anxiety, phobias, panic attacks and more, producing tangible results in a very short space of time.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>How this will work in practice is that we will take a look at each type of issue. First depression, then anxiety and finally phobias. After ensuring that what issue actually involves has been made clear, we’ll look at under what circumstances each issue would qualify as something that needs serious attention. As a last step we’ll go over the aspects of CBT that you can apply all by yourself, without the need for external support or guidance.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>CBT really is an amazing versatile model that can be applied to an array of problematic symptoms, producing positive results for you, right now. Don’t suffer a moment longer, take this course and discover the magic of CBT. As with all my courses, I’m on hand to provide support, 7 days a week.</p>\n\n\n\n<p>This CBT cognitive behavioural therapy for depression, anxiety and phobias course, includes 35 downloadable resources. The course syllabus includes:</p>\n\n\n\n<ul><li>Introduction</li><li>Life Assessment</li><li>What is Depression</li><li>Suicidal Ideation</li><li>your Own Thoughts on Depression</li><li>Why Am I Depressed</li><li>Assessing Your Depression</li><li>Recording Your Thoughts and Feelings</li><li>Using CBT To Deal with Depression - First Steps</li><li>Using CBT To Deal with Depression - Next Steps</li><li>Sleep Diary</li><li>Targeting The Engines of Depression</li><li>ABC Model</li><li>What is Anxiety</li><li>Why Do I Feel Anxious</li><li>Assessing My Anxiety</li><li>Using CBT To Deal with Anxiety </li><li>Seven Types of Thinking Errors</li><li>Realistic Thinking</li><li>Getting Over Social Anxiety - Part 1</li><li>Getting Over Social Anxiety - Part 2</li><li>The STAR Model</li><li>Dealing with Panic Attacks</li><li>Two Types of Thinking</li><li>Introduction To Core Beliefs</li><li>How Do Core Beliefs Develop</li><li>Identifying Negative Core Beliefs</li><li>Generating 'In-Between' Beliefs</li><li>Exposure Therapy</li><li>A Crash Course in Phobias - Part 1</li><li>A Crash Course in Phobias - Part 2</li><li>Challenging Obsessions</li><li>Facing Your Fears</li><li>What is Agoraphobia</li><li>The Negative Cycle of Agoraphobia</li><li>How Do I Manage Agoraphobia</li><li>Conclusion</li></ul>", 
    "end_date": null, 
    "title": "CBT for Depression, Anxiety, Phobias and Panic Attacks", 
    "price": "20.00", 
    "instructors": "Libby Seery", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/870998_9f50_5.jpg", 
    "course_url": "https://www.udemy.com/cbt-for-depression-anxiety-phobias-and-panic-attacks/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-07T06:15:56Z"
}