{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Cet enseignement porte sur le <strong>TDAH</strong> ou Trouble Dysfonctionnel de l'Attention avec ou sans Hyperactivité (anciennement appelé trouble déficitaire de l'attention).</p><p>Il est souvent compliqué pour les parents, les proches, d'une personne atteinte de TDAH, de comprendre de quoi il retourne exactement. Comment comprendre que la personne à qui l'on demande de se concentrer, se laisse distraire aussi rapidement ? Comment peut elle ne pas se souvenir d'une leçon qu'elle a apprise le jour précédent, sur lequel elle a passé beaucoup de temps avec ses parents ?</p><p>Au cours de cette leçon, nous passerons en revue les symptômes du TDAH, le manque d'attention, l'agitation, l'impulsivité. Nous approfondirons ces différentes notions et verrons que ce trouble peut se manifester de bien des manières et ce chez une même personne.</p><p>Cet enseignement sur le TDAH est constitué de <em>vidéos explicatives</em>, de textes et de références disponibles sur internet, la majeure partie de ce cours est faite de vidéos afin de le rendre plus vivant et interactif. Quelques quizz le ponctuent afin  d'aider chacun à vérifier qu'il a bien compris les notions essentielles.</p><p>Nous passons en revue les différentes modalités de <strong>traitement du TDAH</strong>, qui peuvent être proposées. </p><p>Une section spécifique de cet enseignement est centrée sur le <strong>TDAH de l'adulte</strong> qu'il convient de ne pas oublier.</p>", 
    "end_date": null, 
    "title": "Comprendre le TDAH", 
    "price": "25.00", 
    "instructors": "Louis Vera", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530650_41a7_3.jpg", 
    "course_url": "https://www.udemy.com/tdah-enfant-ado-adulte/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T20:04:29Z"
}