{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong>UPDATED FOR MARCH 2016. 3,000+ STUDENTS! NINE 5-STAR REVIEWS!</strong>  </p>  <p>  \t                             Michael L says, <em>\"Expert guidance on overcoming depression. … In a nutshell, if you're looking to learn how to deal with depression, this course will help you get there effectively.\"</em>  </p>  <p>  \t                             Michelle C says, <em>\"Doctors should make this course available to their patients.\"</em>  </p>  <p>  \t                             Marge says, <em>\"Great tools with this course. For anyone using CBT, these will be great tools to keep going back to.\"</em>  </p>  <p>  \t<strong>FREE BONUS</strong> ($80 Value): With this course you get full lifetime access to 4 online tools that help you beat depression faster &amp; easier.  </p>    <p>  \t                                                                                   When you're depressed, you don't want to go anywhere, see anyone, do anything… You have less energy, have trouble concentrating, and can struggle just to get out of bed…  </p>  <p>  \t<strong>Depression hurts in so many ways.</strong>  </p>  <p>  \t                                                                                   Sadness, loss of interest, stress, anxiety…  </p>  <p>  \t<strong>This course can help.</strong>  </p>  <p>  \t                                                                                   My name is David Fonvielle, and I struggled with depression for over 10 years, before I taught myself how to get rid of depression for good, on my own, without drugs, pills, medication, or antidepressants, using only the 100% natural depression treatment I teach in this course.  </p>  <p>  \t                                                                                   By doing exactly what I teach in this course, I have not struggled with depression since 2006, I enjoy life more than I ever dreamed possible when I was depressed, and I have no fear at all of my depression returning.  </p>  <p>  \t                                                                                   This is because I have used a <strong>clinically proven strategy </strong>for eliminating depression for good, as well as <strong>4 depression-busting online tools</strong> that I developed to make it very easy for me to stay depression-free.  </p>  <p>  \t<em><strong>You get these 4 depression-busting tools for FREE, as part of this course (an $80 value!)</strong></em>  </p>  <p>  \t                                                                                   With the Confidence &amp; Success Tool, Daily Happiness Tool, Feel Good Tool, and Positive Thinking Tool, you can be guaranteed that you will stop suffering from depression faster and easier than you ever dreamed possible, even if antidepressants haven't worked for you in the past.  </p>  <p>  \t                                                                                   In fact, if you do everything you learn in this course and use these 4 depression-busting tools, <strong>you'll feel much better than you do now in 1 week or less</strong>.  </p>  <p>  \t                                                                                   You have to actually do the things that this course instructs you to do, but if you do, you will definitely feel better. Guaranteed.  </p>  <p>  \t                                                                                   In this course, you'll learn how to deal with depression with a <strong>step by step plan for becoming depression-free in 30 days or less</strong>, so that you no longer suffer from any symptoms of depression at all, and instead you enjoy life more than ever.  </p>  <p>  \t                                                                                   To help you achieve this even faster and easier, in this course <strong>I reveal all my secrets for getting rid of depression</strong> and staying depression-free, including:  </p>  <ol>  \t<li>What things I've done that most depressed people never do (this is how to get over depression faster than most people by doing things that the majority of depressed people don't do)</li>  \t<li>What mistakes most depressed people make that make it harder for them to stop being depressed</li>  \t<li>How to avoid those mistakes so you don't suffer the same fate as most depressed people (this is a huge key for learning how to get out of depression)</li>  \t<li>How to feel less depressed about anything in 5 minutes or less</li>  \t<li>How to feel happier in 2 minutes or less every day by doing just 1 thing</li>  \t<li>How to get rid of any stressful, depressing negative thought for good</li>  </ol>  <p>  \t                                                                                 ...and much, much more!  </p>  <p>  \t                                                                                   After successfully eliminating depression from my life, here's what I can tell you: <strong>learning how to overcome depression is a skill that you can develop</strong>, just like any other skill, and in this course <strong>I teach you step by step how to develop this skill</strong> in order to cure yourself of depression for once and for all, so that you never have to suffer from it again.  </p>  <p>  \t                                                                                   So are you ready to stop suffering from depression? Then make sure you start this course today -- right now -- to enjoy relief from depression and all of its negative effects.  </p>  <p>  \t<em><strong>  Some more information about this course:  </strong></em>  </p>  <ul>  \t<li>The <strong>low price will increase shortly</strong> - the course is currently only $199 but will increase soon</li>  \t<li>You have <strong>unlimited lifetime access at no extra costs, ever</strong></li>  \t<li><strong>All future additional lectures, bonuses, etc. in this course are always free</strong></li>  \t<li>There's an unconditional, never any questions asked <strong>full 30 day money-back-in-full guarantee</strong></li>  \t<li><strong>My help is always available to you</strong> if you have a question</li>  </ul>  <p>  \t                                                                                   With this course and the 4 online tools you get for free, <strong>you can feel better than you do now within a day</strong>, and in a week, you can feel amazed by how much better and less depressed you feel.  </p>  <p>  \t                                                                                   And within 30 days, you could even achieve <strong>being completely depression-free</strong>, just like I did, and have no signs or symptoms of depression at all.  </p>  <p>  \t                                                                                   So don't waste another second: <strong>quit suffering from depression and start enjoying living your life again.  </strong>  </p>  <p>  \t<strong>Enrol now!</strong>  </p>", 
    "end_date": null, 
    "title": "Depression Help: Overcome Depression Naturally in 30 Days", 
    "price": "20.00", 
    "instructors": "David Fonvielle", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348676_fefd_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-cure-depression-naturally-stop-being-depressed/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T23:21:18Z"
}