{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Receiving an Autism diagnosis for your child is a stressful and oftentimes overwhelming event.  This course will provide you a basic understanding of what an Autism diagnosis means and actionable next steps to take for your child so you can become informed and confident in your path forward.</p>\n\n<p>Led by Karli Koning, M.Ed BCBA, the first and only Board Certified Behavior Analyst (BCBA) instructor presenting on Udemy, this course will give you access to expert knowledge and actionable advice at a fraction of the price of a regular BCBA consultation. Karli has spent over ten years working directly with children with special needs and their parents in school, in-home, and clinical settings.  The information presented is <strong class=\"redactor-inline-converted\">not gleaned from internet research and repackaged by marketing gurus</strong>, but rather by the <strong class=\"redactor-inline-converted\">expertise of a real world practitioner in the field of Autism Spectrum Disorder (ASD).</strong></p>\n\n\n\n\n\n\n\n\n\n<p>In <strong class=\"redactor-inline-converted\">16 lectures</strong> and <strong>one hour of video lectures</strong>, you will learn a basic understanding of Autism services and interventions, key vocabulary terms, initial steps to take, and goals for your child. In depth instruction is included on various treatments and intervention methods as well as how to choose the right one for your child.  You will also receive resources for further investigation.</p>\n\n\n\n\n\n\n\n\n\n<p>Professional endorsements for Karli:</p>\n\n\n\n\n\n\n\n<p>\"Since working with Karli, we have been able to see behavior as a function and not an action. We successfully worked as a team to create an environment where our son could find success and everyone could focus on his strengths. He has grown at home and in school, making great gains socially.\" - C.T., Parent</p>\n\n\n\n\n\n\n\n\n\n<p>\"Our school was lacking structure during recess time, which allowed for behavioral concerns. Karli was able to help us create a system where everyone was safe and motivated to make good choices. Teachers felt empowered and started making personal connections with students during the less structured times. Positive interactions increased with the focus of what we wanted to see and not the negative.\" -TT, Principal </p>\n\n\n\n\n\n\n\n<p>If your child has been diagnosed with Autism Spectrum Disorder, you should take this course because you will learn:</p>\n\n\n\n\n\n<ul><li>Where to begin and what comes next</li><li>How to sort through the noise </li><li>Key vocabulary terms</li><li>How to consider the right services</li><li>Which interventions are worth pursuing</li></ul>", 
    "end_date": null, 
    "title": "Diagnosis Autism: Now What?", 
    "price": "50.00", 
    "instructors": "Autism Specialists, BCBAs Limited Cue", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/873120_e5da.jpg", 
    "course_url": "https://www.udemy.com/diagnosis-autism-now-what/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-09T05:29:32Z"
}