{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t     This course is designed for healthcare professionals wishing to learn more about the mood disorders. The emphasis is on the symptoms and the experience of mood disorders, rather than on causes or treatment strategies. Much of the course is geared toward diagnosis, using the formal manual criteria to evaluate client behavior and reported symptoms in the clinical setting.  </p>  <p style=\"\">  \t    Course participants receive a 30-page set of notes in pdf format that review the content of all lectures.  </p>  <p style=\"\">  \t     The lectures include:  </p>  <p style=\"\">  \t     The Floating Diamond Model - A strategy for parsing the depressive experience into physiological, cognitive, emotional, and behavioral aspects. This is useful conceptually for clinicians, patients/clients, and family/friends/supporters.  </p>  <p style=\"\">  \t     Major Depressive Episode - Separated into lectures on a) the critical mood-related criteria, and b) the remaining criteria.  </p>  <p style=\"\">  \t     Diagnosis of Major Depressive Disorder.  </p>  <p style=\"\">  \t     Nondiagnostic experiential aspects of the depression experience; and an examination of the manner in which symptoms self-perpetuate and magnify one another (&quot;snowballs and reverberations&quot;).  </p>  <p style=\"\">  \t     Minor depression and dysthymia, or persistent depressive disorder - Including diagnostic criteria for the latter.  </p>  <p style=\"\">  \t     Bipolar disorders - Including strategies for diagnosis of manic and hypomanic episodes, bipolar 1 and 2 disorder, and cyclothymia.  </p>  <p style=\"\">  \t     Other mood disorders - Including premenstrual dysphoric disorder and the array of &quot;miscellaneous&quot; categories for individuals who do not meet criteria for the primary syndromes.  </p>  <p style=\"\">  \t     Epidemiology - A brief consideration of issues such as gender ratio, age of onset, cost of mood disorders to society, and the possibility that mood disorders are increasing in prevalence.  </p>  <p style=\"\">  \t<strong style=\"\">30 Day Guarantee</strong>: Not sure? You don&#039;t have to be. We have a 30-day complete money back guarantee, no questions asked.  </p>", 
    "end_date": null, 
    "title": "Diagnosing Depression and Related Mood Disorders", 
    "price": "20.00", 
    "instructors": "Randy Paterson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/159358_06e7_6.jpg", 
    "course_url": "https://www.udemy.com/diagnosingdepression/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-06T19:04:26Z"
}