{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em><strong>How to use EFT (Emotional Freedom Techniques) and Gentle Behaviour Therapy to help deal with OCD.</strong></em></p><p>Do you have OCD? Obsessive-Compulsive Disorder?</p><p><strong>How common is OCD?</strong></p><p>The closest estimates are that about 1 in 100 people – or <strong>between 2 to 3 million individuals </strong>- in the United States – currently have OCD. This is roughly the same number as people living in Houston, Texas.</p><p>At least 1 in 200 – or <strong>500,000 – children, youth and teens have OCD</strong>. This is equal to the number of kids with diabetes. That means four or five kids with OCD are likely to be enrolled in any average size elementary school. In medium to large high schools, there can be over 20 students struggling with the problems caused from suffering from OCD.</p><p><strong></strong></p><p><strong>Men, women and children of all races and backgrounds can be affected by OCD.</strong></p><p>According to a recent Miami Herald article:</p><p> \"Brain-imaging research has helped to uncover the brain-related dysfunction that manifests as OCD. Thus, like Alzheimer’s disease and depression, <strong>OCD is a disease of the brain</strong>. OCD can run in families; rituals <strong>can be learned by children from their parents</strong>.\"</p><p>\"Fortunately, <strong>OCD is treatable</strong>...forms of psychotherapy can have marked success in alleviating the distress and disability associated with OCD.\"</p><p>In this course, Joan Kaylor takes you through effective EFT and Gentle Behavior Therapy modules, guiding you towards a better situation dealing with your compulsive thoughts.</p><p>You will learn the basics of EFT and Gentle Behavior Therapy<span>. Then you will discover through experiential lectures, how this modality can affect your thoughts.</span></p><p><span>Sessions include:</span></p><ul><li><strong>Gentle EFT for Checking</strong><strong></strong></li><li>Gentle EFT for Counting</li><li><strong>Gentle EFT for Touching</strong><strong></strong></li><li>Gentle EFT for Fear of Getting AIDS</li><li><strong>Gentle EFT for Fear of Harming Others</strong><strong></strong></li><li>Gentle EFT for Pure Obsessionals<span><br></span></li><li><strong>Gentle EFT for Sexual Obsessions</strong><strong></strong></li><li>And much more...</li></ul><p><span><span><span><span><span><span><span>If you are ready to make a change then <strong>this course is for you</strong>. If you know someone who is OCD, then this course will help you understand them better and give you tools to help you deal with them.</span></span></span></span></span></span></span></p><p>We are here at all stages to guide you with any hands-on advice that you may need - that's also all included in the course - there is nothing extra to pay! <strong>Remember, Joan been in private practice since 1994!</strong><br></p><p><strong><em>Still unsure?</em></strong></p><p><em>Well, every moment you delay is now actually costing you <strong>Peace of Mind</strong>... and Udemy offers you a full \"never any questions asked\", fully unlimited, 30 day full money back guarantee.</em></p><p><strong><em>Udemy covers you, fully, so you are never taking any risk at all! And if you achieve a quiet mind, what is that worth to you?</em></strong></p>", 
    "end_date": null, 
    "title": "EFT for OCD using Gentle Behavior Therapy", 
    "price": "30.00", 
    "instructors": "Scott Paton, Joan Kaylor", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/714906_029c_3.jpg", 
    "course_url": "https://www.udemy.com/eft-ocd-using-gentle-behavior-therapy/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-03T22:41:13Z"
}