{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>****Course updated January, 2016!****</strong></p><p>Joan Kaylor stopped pulling out her hair in 1989. She has been <strong>helping children, teens and adults stop pulling hair and picking skin since 1994</strong> when she became a professional counselor. Trichotillomania and Dermatillomania are body focused repetitive behaviors. They regulate emotions and help to soothe when we are upset, overwhelmed, bored or stressed. Joan considers pulling and picking to be addictions. </p><p>The treatment is completely different from obsessive compulsive disorders. Healing from an addiction is work. <strong>It can be done.</strong> In this course, Joan will teach you strategies to let go of the urges and counseling for the shame and depression and family stress that come with Trich and picking. </p><p>Joan Kaylor has <strong>treated 1000's of individuals</strong> and families with Trichotillomania and Dermatillomania.</p><strong>There is lots of hope and through EFT (Emotional Freedom Techniques), Joan will take you through a gentle process to relieve your urges to pull your hair or pick at your skin.</strong><p><strong>Trichotillomania and Dermatillomania </strong></p><p>Trichotillomania (trick-o-til-o-MAY-nee-ah) is a disorder that causes people to pull out the hair from their scalp, eyelashes, eyebrows, pubic area, underarms, beard, chest, legs or other parts of the body, resulting in noticeable bald patches. Hair pulling varies greatly in its severity, location on the body, and response to treatment. For some people, at some times, Trichotillomania is mild and can be quelled with a bit of extra awareness and concentration. For others, at times the urge may be so strong that it makes thinking of anything else nearly impossible.</p><p>Skin Picking Disorder (also known as Excoriation Disorder or SPD) is a serious and poorly understood problem. People who suffer from SPD repetitively touch, rub, scratch, pick at, or dig into their skin, often in an attempt to remove small irregularities or perceived imperfections. This behavior may result in skin discoloration or scarring. In more serious cases, severe tissue damage and visible disfigurement can result.</p><p>Trichotillomania may affect as much as 12% of the population. Women are four times more likely to be affected than men. </p><p>Symptoms usually begin before age 17. The hair may come out in round patches or across the scalp. The effect is an uneven appearance. The person may pluck other hairy areas, such as the eyebrows, eyelashes, or body hair.</p><p><strong>These symptoms are usually seen in children:</strong></p><ul><li>An uneven appearance to the hair</li><li>Bare patches or all around (diffuse) loss of hair</li><li>Bowel blockage (obstruction) if people eat the hair they pull out</li><li>Constant tugging, pulling, or twisting of hair</li><li>Denying the hair pulling</li><li>Hair regrowth that feels like stubble in the bare spots</li><li>Increasing sense of tension before the hair pulling</li><li>Other self-injury behaviors</li><li>Sense of relief, pleasure, or gratification after the hair pulling</li></ul><p><strong>Most people with this disorder also have problems with:</strong></p><ul><li>Feeling sad or depressed</li><li>Anxiety</li><li>Poor self image</li></ul><p>For some, Trichotillomania is <strong>a lifelong disorder</strong>. However, treatment often reduces the hair pulling and the feelings of depression, anxiety, or poor self image.</p>", 
    "end_date": null, 
    "title": "EFT Emotional Freedom Technique: Hair Pulling & Skin Picking", 
    "price": "40.00", 
    "instructors": "Scott Paton, Joan Kaylor", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396610_aff1_4.jpg", 
    "course_url": "https://www.udemy.com/eft-emotional-freedom-techniques-for-hair-pulling-skin-picking/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T16:25:45Z"
}