{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Faster EFT is a combination of EFT (Emotional Freedom Technique), NLP (Neuro Linguistic Programming) and Hypnosis.  It works with the sub-conscious mind to clear any limiting beliefs that are holding you back from living the life you deserve.</p><p>This course will teach you how to use this amazing cutting-edge technique to transform your life.</p><p>This course includes 8 video lectures, a power point presentation with audio, 2 bonus meditations, practical worksheets and diagrams to print off.</p><p><strong>These are the amazing benefits of using Faster EFT:</strong></p><p>* Can help you to de-stress and promote relaxation and a clear mind<br>* Will help you clear your fears, past hurts/traumas, anger, anxiety<br>* Can help you clear an addiction<br>* transform your life in a positive way<br>* transform your relationships with yourself and others<br>* Increase your self-esteem and confidence<br>* and many more</p><p><strong>During this course, you will learn:</strong></p><p>* All about the amazing Faster EFT technique and how it can help you <br>* How to use Faster EFT to clear your fears<br>* How to use Faster EFT to reduce/eliminate pain<br>* How to use Faster EFT to help children<br></p><p><strong>Requirements of this course are:</strong></p><p>*  A desire to transform your life in a positive way<br>* A commitment to healing yourself<br></p><p>The Target Audience of this Course:</p><p>* This course is designed for the complete beginner to someone who has knowledge of holistic therapies. </p><p>* It is aimed at anyone wanting to better their lives and heal parts of themselves that need healing.</p>", 
    "end_date": null, 
    "title": "Eliminate Stress Now with FasterEFT (Hypnosis)", 
    "price": "30.00", 
    "instructors": "Danielle Rossetti", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635554_3408.jpg", 
    "course_url": "https://www.udemy.com/transform-your-life-with-fastereft-eft-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T04:41:37Z"
}