{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Heal Your Grief: Changer Your Life After Loss In 60 Minutes!!</strong>  </p>  <p style=\"\">  \t        I want to show you a new approach to grief and loss!!  </p>  <p style=\"\">  \t        Have you experienced the following scenarios?  </p>  <ul style=\"\">  \t<li style=\"\">Loss of someone you love and without knowing how to move on</li>  \t<li style=\"\">Feeling overwhelmed from grief, confused not knowing where to turn?</li>  \t<li style=\"\">Filled with sadness and unable to concentrate on your daily routine</li>  \t<li style=\"\">Desire to transform and  heal your grief, but don’t know how to do it</li>  </ul>  <p style=\"\">  \t                        Then, you are on the right track! My name is Tom and I can help you in overcoming your sadness and healing your grief.  </p>  <p style=\"\">  \t                        Like you, I found it hard to overcome my emotions (anger,sadness,disbelief) and feelings (heavyness, guilt,fatigue)  after my mother passed away. For me, the moment my mom left me felt like the end of my life.  I know that you also feel the same way after losing someone you truly love and that’s the reason why I am here.  </p>  <p style=\"\">  \t                        Believe it or not, you can heal your grief and transform your life after loss in 60 minutes. I am here to present you a course that can change your perception on loss forever. My course includes the following:  </p>  <ul style=\"\">  \t<li style=\"\">7 video modules</li>  \t<li style=\"\">7 pdf exercise sheets</li>  \t<li style=\"\">7 module audio mp3 recordings</li>  \t<li style=\"\">Bonus videos</li>  \t<li style=\"\">Free book and much more!</li>  </ul>  <p style=\"\">  \t                        This step-by-step course allows you to dissolve the pain that has been holding you back. It takes a few hours to complete and its results are extremely remarkable.  </p>  <p style=\"\">  \t                        With my course, you will witness the following benefits:  </p>  <ul style=\"\">  \t<li style=\"\">A new approach on loss</li>  \t<li style=\"\">Learn how to smile after the death of your loved ones</li>  \t<li style=\"\">Freedom  from pain and guilt  </li>  \t<li style=\"\">Learn how to accept the real situation  </li>  \t<li style=\"\">Overcome your grief easily and much more!</li>  </ul>  <p style=\"\">  \t                        My course assists you in various areas involving self-awareness, personal development and human behaviour. This course also helps you in gaining more understanding to live life to the fullest.  </p>  <p style=\"\">  \t                        Whether you are suffering from extreme grief, loss or sadness, this course can help you in many ways. What are you waiting for? Make a right move and start transforming your life now!  </p>", 
    "end_date": null, 
    "title": "Healing Your Grief:  How To Work Through Loss In Your Life", 
    "price": "20.00", 
    "instructors": "Tom Sweetman", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356838_2cb3_14.jpg", 
    "course_url": "https://www.udemy.com/heal-your-grief-change-your-life-after-loss-in-60-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T07:49:50Z"
}