{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn the basic concepts, tools and habits you need to order to heal from the effects of abuse and trauma.</p>\n\n\n\n<p><strong>Build stronger, more fulfilling relationships with your loved ones and look forward to the future with hope and gratitude with this course on healing from abuse and trauma.</strong>\n\n  </p>\n\n\n\n<p>·      Identify Your Feelings</p><p>·      Communicate Your Feelings</p>\n\n<p>·      Learn Dynamic Coping Techniques\n\n  </p>\n\n<p>·      Discover and Eliminate Negative Habits Caused by Abuse and Trauma\n\n  </p>\n\n<p>·      Develop New Ways of Owning and Acting on Your Feelings\n\n  </p>\n\n\n\n<p><strong>Create New Neural Pathways in Your Brain</strong>\n\n  </p>\n\n<p>The latest research shows that Cognitive Behavioral Therapy (CBT) is a highly effective tool in combating the negative effects of Abuse and Trauma.  In this course you will learn specific CBT techniques that will help you improve intimacy, eliminate negative behaviors and regulate your impulse control.  As you master the techniques in this course you will be creating new neural pathways in your brain.  This course will help you physically change how your brain operates simply by applying your willpower and your brain in tandem toward a shared goal: Healing from the effects of abuse and trauma.<br></p>\n\n\n\n<p><strong>Content and Overview</strong>\n\n  </p>\n\n<p>With this course I’ve distilled hours and hours of experience working with clients down to 32 lectures that cover everything you need to know about healing from abuse and trauma.  You’ll explore the role abuse and trauma plays in your life.  You’ll examine the importance of identifying and owning your feelings.  You’ll learn how to place blame where it really belongs and how you have a choice when it comes to reacting to negative events.<br></p>\n\n\n\n<p>When you’ve completed this course you’ll have tools that you can use over and over again to combat the negative effects of abuse and trauma.  You’ll be equipped to find hope in the future.  You’ll uncover levels of gratitude for yourself and find increased closeness and intimacy with loved ones.\n\n  </p>\n\n\n\n<p>Each short video has a real-world “homework” assignment that should take about a week to complete. </p>", 
    "end_date": null, 
    "title": "Healing from Abuse & Trauma: Facing the Future with Hope", 
    "price": "50.00", 
    "instructors": "Louisa Link-McDowell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/886470_54c5_3.jpg", 
    "course_url": "https://www.udemy.com/abuse-trauma/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-23T17:10:10Z"
}