{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>APRIL 4, 2016 UPDATE: </strong>Udemy has introduced a new pricing structure today. Please message me with any questions you may have regarding this.<br><strong></strong></p><p><strong>Anxiety first came knocking on the door of my life in 2011.</strong> I had no idea what was wrong with me. I thought I had cancer. I was convinced I was going to die. I felt like I was going crazy.</p>\n\n<p><em>Then I went to the doctor.</em></p>\n\n<p>Everything looked fine from a physical perspective. I was forced to accept the truth I had been denying for some time—<strong>I was suffering severe anxiety with panic attacks.</strong></p>\n\n<p>At one point, it seemed like a hole from which I would never be able to escape. Then I started looking. I read everything I could on anxiety. I began watching videos and listening to meditation videos.</p>\n\n<p><em>I found peace.</em></p>\n\n<p><strong>Today, I still struggle with anxiety, but I am able to cope with it. I know how to spot anxiety from a mile off. I know what it looks like and how to reduce it.</strong></p>\n\n<p>Now, I want to share these same strategies with you.</p>\n\n<p><strong>Nothing in this course is magical.</strong></p>\n\n<p>Nothing in this course is going to eliminate your anxiety overnight. That just isn't how it works.</p>\n\n<p>However, I am confident that given enough time you too can find peace, and I would be honored to help you on the journey.</p>\n\n<p><strong>All course updates are 100% FREE. </strong>Buy this course one time and you own it for life. Not only that, but you will also gain lifetime access to me as your personal instructor, and to all future course updates.</p>\n\n<p><strong></strong>The course comes with a genuine 30 day, no hassles, money-back guarantee. So, there is absolutely nothing to risk here. <strong>Begin your journey toward peace, today!</strong></p>", 
    "end_date": null, 
    "title": "How to Eliminate Anxiety and Panic Attacks", 
    "price": "20.00", 
    "instructors": "Cody Ray Miller", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550670_1aa8.jpg", 
    "course_url": "https://www.udemy.com/banish-anxiety-and-panic-attacks-with-psychological-self-therapies/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T02:46:22Z"
}