{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Just imagine casting away your fears and worries, achieving your goals and aspirations. Mindfulness can transform your life. </p><p style=\"\">Impossible? This is a common response, but let me share with you my secret tools and techniques to take control of your life. I did it, so can you!</p><p style=\"\">You will discover through my mindfulness techniques, how to expose a more vibrant you, full of energy with a real zest for life, decisive, determined and driven.</p><p style=\"\">Anyone can practice mindfulness. My step-by-step approach will equip you with the essentials to de-clutter your life, overcome the fears and barriers to change and create the space you need to shape the life you want.</p><p style=\"\">I will share my own stories, managing major life upheaval, leaving a relationship, moving home, overcoming empty nest syndrome, starting a business, losing weight, managing depression. It really is a personal insight!</p><p style=\"\">The course is designed in easy steps, based on my own personal 25 years experience as a Psychotherapist and Coaching people just like you. </p><p style=\"\">The course begins with understanding the tides of change. It explains how to develop mindfulness practice. We unpick the workings of the mind, its endless chatter with techniques on how to tone it down.</p><p style=\"\">I will help you understand your emotions. The power and influence of our emotions. We will delve into the miraculous nature of the body, its intuitive guidance and practice techniques to enhance it.</p><p style=\"\">The content is designed to be accessible, anytime, any place, any level. You could progress through the course in a single day, or invest time depending on your needs. For maximum benefit, it is recommended that you use a notebook or word document.</p><p style=\"\">There are practical exercises, audio meditations to help you develop a rich understanding of mindfulness techniques and how to deploy it in your life.</p>", 
    "end_date": null, 
    "title": "How to change your life through mindfulness", 
    "price": "20.00", 
    "instructors": "Rebecca Jane", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370952_61af_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-change-your-life-through-mindfulness/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T20:36:40Z"
}