{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>“This course is not sponsored by or affiliated with Udemy, Inc.”How to Identify Depression using a checklist test. Depression checklist to explore depression signs and depression symptoms. Methods of feeling better. Help for depression symptoms. Have you been feeling sad a lot lately, can’t seem to shake the blues? Do you know someone who has changed in some way, like no energy, lack of concentration, libido decreased? In this class we will explore the faces of depression. How do the mental health professionals determine if we are sad or are experiencing a Major Depressive Disorder episode? AND what do we do then? Are we stuck being sad for life, can we change the way we are feeling? Do we have to take medication to make it all better? What can we do to be the real US again.<br></p><p>Feeling sad, low energy, low libido, irritable can indicate you are experiencing an episode of Major Depressive Disorder. Notice the diagnosis is “disorder” this is not a mental Illness that is untreatable and maintained only with medication. It is a disorder and like physical flu can go away. </p>\n\n<p>In this class we will be discussing Adult Depression. Depression presents itself differently in teens and children. Dysthymia is a depression that is milder than Major Depression and lasts for at least two years. Bipolar Disorder is also a Mood Disorder that usually includes Depression. In this class I want to explore Depression that is not dysthymia or bipolar disorder. This class offers a printable check list to determine if your sad is deep enough to be diagnosed as a Major Depressive Disorder Episode. </p>", 
    "end_date": null, 
    "title": "How to Identify Depression. Checklist and Help Included", 
    "price": "20.00", 
    "instructors": "Yvonne Sinclair M.A., LMFT", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626310_3070.jpg", 
    "course_url": "https://www.udemy.com/major-depressive-disorder-evaluation-explanation/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T21:10:59Z"
}