{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>There is a light at the end of tunnel. We’ll provide you a step by step supportive pathway that will make you free from sexual addiction without destroying your self esteem or negatively impacting your relationships.</p>\n\n<p><strong>The Practical Exercises In This Course Coupled With Solidly Researched Advice Will Help You Overcome Sexual and Pornography Addiction.</strong></p>\n\n\n\n<p>Here's what you'll learn from this course:</p>\n\n\n\n<ul><li>You'll get worksheets with every section that will help you implement recovery techniques and skills into your life.</li></ul>\n\n\n\n<ul><li>You'll learn the 'why' behind your addiction and easy-to-use relapse prevention techniques like The NoPorn Phrase, Urge Surfing, Acupressure desensitization, the Noporn TAP, and more.</li></ul>\n\n\n\n<ul><li>You’ll learn the neuroscience behind porn and sexual addiction, how you got addicted, and what you need to do to get past the fastest growing addiction in the world.</li></ul>\n\n\n\n<ul><li>You'll learn how to make the most out of porn blockers.</li></ul>\n\n\n\n<ul><li>You’ll learn how to take power away from your thoughts and urges, and how to make life about what you want, not what your urges want.</li></ul>\n\n\n\n<ul><li>You'll learn mindfulness skills that will improve all other areas of your life, allowing you to reach full mastery of your emotions and thoughts.</li></ul>\n\n\n\n<ul><li>You’ll get over 6 hours of audio exercises designed to train mindfulness and other skills you need to move from porn and sex addiction to life mastery.</li></ul>\n\n\n\n<ul><li>You’ll learn how to effectively deal your negative beliefs and time managment.</li></ul>\n\n\n\n<ul><li>You'll learn how to move towards an authentic intimacy and healthy sexuality.</li></ul>\n\n\n\n<ul><li>You'll learn how to recover from porn-induced impotence with sexual mindfulness techniques, and how you can use the same techniques to get in touch with your authentic healthy sexuality. </li><li>You'll master self-compassion and self-forgiveness, allowing you to let go of guilt associated with sexual addiction. .</li></ul>\n\n\n\n<ul><li>You'll form healthier relationships with not only yourself but with others that you care about.</li></ul>\n\n\n\n\n\n<p><strong>This program is your first step towards a recovery that will last.</strong></p>\n\n\n\n<p>Using non-shaming advice, we offer a step-by-step approach to limit or stop the use of pornography when it has become a problem, but more importantly, we've provided a path for you to re-establish a positive sense of self.</p>\n\n\n\n\n\n<p>This program has no religious affiliation. We might use some tools that are typically used in religious tradition, but we only use them in a way that’s supported by the latest research.</p>", 
    "end_date": null, 
    "title": "How To Free Yourself From Adult Video Sexual Addiction", 
    "price": "50.00", 
    "instructors": "BSC Psychology Matt Peplinski", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/856026_5a0d_3.jpg", 
    "course_url": "https://www.udemy.com/sexual-addiction-recovery/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-21T18:26:52Z"
}