{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this course titled 'Hypnosis- Overcome Morning Sickness Now Using Self Hypnosis' By Pradeep Aggarwal , you will learn -</p><p>Morning Sickness is a pregnancy discomfort that affects many pregnant women during their 12th week of pregnancy. Symptoms may be present early in the morning and reduce as the day progresses. Common symptoms include nausea and vomiting. <br> <br> </p>  <ul><li><strong>Psychological Reasons for Morning Sickness</strong></li></ul>  <p>There are many reasons that cause morning sickness because a woman undergoes many hormonal changes during the course of pregnancy. However, there may be few psychological reasons also that cause morning sickness like <strong>STRESS and ANXIETY.</strong></p>    <p>Some researchers have proposed that certain women are psychologically prone to having nausea and vomiting during pregnancy as an abnormal response to stress and anxiety.</p><p>In this course you will learn visualization , positive affirmations and self hypnosis techniques to overcome the problem of morning sickness psychologically and mentally and will gradually see improvement in your health over the course of time by regularly following the exercises and techniques.</p><p>By the end of the course you will be able to overcome the problem of morning sickness and feel more positive about your self.<br></p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 6 lectures in English including a bonus E-book</p>", 
    "end_date": null, 
    "title": "Hypnosis- Overcome Morning Sickness Now Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632198_9006.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-overcome-morning-sickness-now-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T09:25:50Z"
}