{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Jede Krankheit hat ihren Sinn. Wenn wir uns der seelischen Konflikte und krankmachenden Muster hinter den Symptomen bewusst werden, können wir den tieferen Sinn hinter Krankheitsbildern sehen. Dadurch eröffnet sich ein neuer und besserer Weg, sich selbst zu finden. </p>\n\n<p>Dieser Online Lehrgang bietet die Vorteile von Buch und Film in einem: Im lebendigen Vortrag vor der Kamera erklärt Ruediger Dahlke die Bedeutung hinter häufigen alltäglichen Krankheiten. In eigenen Kapiteln geht er auf die großen Volkskrankheiten wie Herzerkrankungen, Krebs und Burnout ein. <br></p>\n\n<p><strong>Credits:</strong><br>Dozent, Inhalt &amp; Vortrag: Dr. Ruediger Dahlke<br>Regie: Hannes Rauchberger, Thomas Pavlousek<br>Musik: Davinia Leonne<br>Produktion: AlphaVillePro / Hannes Rauchberger  <br>© 2016<br>__________________</p>\n\n<p>Rechtshinweis: </p><p>Alle Informationen und Ratschläge in diesem Online-Lehrgang wurden mit größter Sorgfalt erarbeitet und geprüft. Übernehmen Sie aber nicht unreflektiert diese Informationen und Ratschläge. Eine Haftung des Dozenten/Autors und der Filmemacher für Personen-, Sach- oder Vermögensschäden wird ausgeschlossen. Das in diesem Online-Lehrgang enthaltene Programm ist urheberrechtlich geschützt und darf nur zu privatem Zweck vorgeführt werden. Unerlaubte Kopierung, Distribution oder Verleih ist untersagt.  </p>\n\n\n\n<p>© 2016 AlphaVillePro<br>All Rights reserved.   </p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Krankheitsbilder", 
    "price": "20.00", 
    "instructors": "Ruediger Dahlke", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831188_fb02_4.jpg", 
    "course_url": "https://www.udemy.com/krankheitsbilder/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T09:42:49Z"
}