{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The <em>Learn to Thrive with Adult ADHD</em> video series is the most comprehensive and effective approach available outside of a specialist's office. Phil Boissiere, the leading ADHD therapist and coach in Silicon Valley has put all of his most powerful tools all in one place. The very techniques that have helped hundreds of people reach their ultimate potential in the face of adult ADHD are available in this powerful video series.</p><p>Every step of the way Phil is with you, motivating you and empowering to make real change in your life. The video series is easy to understand, cuts straight to the point, and shows you step by step how to manage adult ADHD. The entire series was shot in beautiful HD quality video and utilizes a multitude of graphics and prompts to guide you along.</p><p>The <i>Learn to Thrive with Adult ADHD</i> video series took Phil and his team hundreds of hours and over $30,000 to produce. Every effort was made to make it visually appealing, empowering, and rich with research based approaches for managing ADHD. Check out what people are saying about the series:</p><p>-“I've used the Beyond Focused methods to reach ultimate performance. It must be life changing for people with ADHD.” -Arjun Dhingra, Taekwondo World Champion</p><p>-“I learned to thrive for sure. Phil's video series helped me find work, learn how to use my strengths, and transformed my marriage.” -Todd, Silicon Valley engineer</p><p>-“Every day was a battle for me. Now I start each day with confidence in my skill set. I can't tell you how different my life is now.” -Susanne, Stanford student and athlete</p><p>-“I am now the mom I always wanted to be. No more losing things, no more arguments, no more tears.” -Karen, mother of 3 in Rhode Island</p><p>The series includes the following modules:</p><p>1. Scheduling</p><p>2. Systems of Organization</p><p>3. Minimization of Distraction</p><p>4. Task Mangagement</p><p>5. Project Management</p><p>6. Positive Visualization</p><p>7. Cognitive Behavioral Therapy</p><p>8. Dealing with Emotions</p><p>9. Personal &amp; Professional Success</p><p>10. Improved Relationships</p><p>11. Nutrition</p><p>12. Exercise</p>", 
    "end_date": null, 
    "title": "Learn to Thrive with Adult ADHD", 
    "price": "50.00", 
    "instructors": "Phil Boissiere", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499088_2fe4_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-thrive-with-adult-adhd/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T16:24:54Z"
}