{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t Hypnotherapy is an art, a science, and a skill. Being effective at helping clients achieve their goals and objectives requires both attention to details and mastery of fundamental concepts. In this course you will learn all the fundamentals of effective hypnotherapy. Studies show that students who master the fundamental elements of the hypnotherapeutic process achieve rapid success while helping their clients heal.  </p>  <p>  \t Two things make this course particularly effective: 1) It is presented in a unique way that resembles an actual hypnotherapy session, thus helping you train your mind and ears along the skill lines you will use as a practicing professional. 2) The coverage of each of the fundamentals is of such depth and meaningfulness that students immediately identify with the material in an intuitive way.  </p>  <p>  \t As a result of this combination of factors student retention and success is maximized without requiring memorization of meaningless information. The course is pleasant to watch, funny at times, interesting, and of superb technical quality.  </p><p>The course covers important applications of hypnotherapy, such as weight adjustment, smoke cessation, self-hypnosis and meditation, frequently requested by clients. You will learn how to start a professional practice, and how to work with difficult clients. </p><p>I have been a full-time hypnotherapist since 1996, with more than 31000 actual sessions, and personally trained thousands of hypnotherapists. This course contains the same material I teach at our school, but for thousands of Dollars less. </p><p>Working with experienced hypnotherapists who feel \"stuck\" from time to time shows that a review of the fundamentals often solves the problem. This is a thorough academic course that requires work and time to master the concepts. It is intended for a person who wants to be a professional hypnotherapist, or one who wants refresh the fundamentals of a successful clinical encounter. This course is not intended for the person who needs help, or the person seeking hypnotherapy services. </p>", 
    "end_date": null, 
    "title": "Learn Hypnotherapy: The Successful Hypnotherapist's Guide", 
    "price": "50.00", 
    "instructors": "Flavio Souza-Campos, Ph.D.", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235400_0b98_11.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-hypnotherapy/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-02T05:26:50Z"
}