{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\t         Do you find it hard to let go and just relax?  Tried mind/body techniques that took too long to get results?  And never experienced that blissful peace everyone talks about?\r\n</p>\r\n<p>\r\n\t         You find yourself wondering why:\r\n</p>\r\n<ul>\r\n\t<li>I find it hard to relax when I take a deep breath.  What am I supposed to feel? Maybe I&#039;m not doing it right.</li>\r\n\t<li>I try to meditate but it takes too long to learn.  I get bored.  I can&#039;t stop my mind from wandering.  So why bother?</li>\r\n\t<li>Visualizing...what does that even mean?  Am I supposed to see pictures?  I don&#039;t.</li>\r\n\t<li>What is the relaxation response?</li>\r\n</ul>\r\n<p>\r\n\t         If this describes your self-talk lately...Welcome to Learning the <strong>Joy</strong> of Relaxation.\r\n</p>\r\n<p>\r\n\t         Learning how to relax should be a joy.  Not a chore.  I designed this course to address those worries.  It is a five part experiential workshop revealing four techniques to experience the ultimate radiant relaxation response.\r\n</p>\r\n<p>\r\n\t         In each workshop you will discover:\r\n</p>\r\n<ul>\r\n\t<li>Calming Deep Breath - <em>the first thing you should do for effortless results.</em></li>\r\n\t<li>Mindful and Mantra Meditation Parts 1 and 2 - <em>what you should know to stop the mind chatter.</em></li>\r\n\t<li>Vivid Imagery Visualization Parts 1 and 2 -<em> how to do it even when you don&#039;t see images.</em></li>\r\n\t<li>Deep Muscle Progressive Relaxation - <em>why it is called the anti-anxiety technique.</em></li>\r\n\t<li>How to Create a Radiant Relaxation Response - <em>the secret formula</em>.</li>\r\n</ul>\r\n<p>\r\n\t         The topics are presented in an uncomplicated and easy to absorb format.  I get to the heart of what makes them work.  And present steps for quick results.\r\n</p>\r\n<p>\r\n\t         You will engage all your senses in an immersive relaxation experience.  All you have to do is:\r\n</p>\r\n<ul>\r\n\t<li>Download the PDF text materials.</li>\r\n\t<li>Sit back and listen to the audios.</li>\r\n\t<li>Watch the PowerPoint videos.</li>\r\n\t<li>Actively practice the script exercises and Just Relax Like This MP3 recordings.</li>\r\n\t<li>Keep a pencil handy and a favorite photo for Vivid Imagery Visualization.</li>\r\n</ul>\r\n<p>\r\n\t         I included two bonuses with this course to encourage you to continue your relaxation practice:\r\n</p>\r\n<p>\r\n\t         Bonus #1 - Be A More Vibrant Person: How to Fit Relaxation Into Your Busy Day\r\n</p>\r\n<p>\r\n\t         Bonus #2 - The Calming Breath Guided Relaxation and Meditation Video\r\n</p>\r\n<p>\r\n\t         When you complete &quot;Learning the Joy of Relaxation&quot; you will have experienced relaxation methods that add to your coping ability, energy and quality of life.  You will be able to release tension in minutes and create a calming inner peace.  At any time.  Any place.  Every day.\r\n</p>", 
    "end_date": null, 
    "title": "Learning the Joy of Relaxation", 
    "price": "20.00", 
    "instructors": "Barbara Mitchell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99494_7bb7_4.jpg", 
    "course_url": "https://www.udemy.com/learning-the-joy-of-relaxation/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-30T14:48:01Z"
}