{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Enroll in this course and get the best-selling ebook/workbook, Tame Your ADHD Brain, complimentary for students!</p>  <p>  \t<em>&gt;&gt;Join </em><em>over <strong>4,0</strong><strong>00</strong> other students who have jacked up their productivity in this bestselling course&lt;&lt;</em></p>  <p>  \t                                                                                Are you sick of the <strong>endless frustrations </strong>of being unable to productively focus?  </p>  <p>  \t                                                                                                                                        Can you imagine that your life would be significantly better if you could amp up your brainpower and get more done?  </p>  <p>  \t                                                                                                                                        Do you ever hear those stories about people, even those who've been diagnosed with severe ADHD, who manage to become <em>insanely</em> successful lawyers, doctors, entrepreneurs??  </p>  <p>  \t                                                                                                                                Let me give you a hint: it's<strong> not</strong> because they are smarter or try harder...  </p>  <p>  \t                                  ---------------------------------  </p>  <p>  \t                                  &gt;&gt;&gt;In fact this course comes from the exact strategies that I used to go from being <strong>one of those problematic ADHD kids to being a serial entrepreneur who travels the world while running two companies</strong>, starting at the age of 22. I want to share with you the empowering habits and lifestyle changes that enabled me to accomplish this!&lt;&lt;&lt;  </p>  <p>  \t                                  -------------------------------  </p>  <p>  \t                                                                                Join this class to learn strategies that this community have been using to succeed for years -getting better relationships, careers, sleep, and overall mental stability!  </p>  <p>  \t<em>In this course you will learn:</em>  </p>  <ul>  \t<li>  \t  \t\t<em><strong>Exactly</strong> how your brain is functioning when you are feeling unfocused or impulsive  </em>  \t  \t</li>  \t<li>  \t  \t\t<em>                                                                               Simple (and <strong>weird!</strong>) habits and exercises that can improve brain function and performance dramatically...or completely kill both if you don't do them  </em>  \t  \t</li>  \t<li>  \t  \t\t<em>                                                                               The fastest ways to crush disorganization, distractions, and undermotivation  </em>  \t  \t</li>  \t<li>  \t  \t\t<em>                                                                               Mental exercises to that have been scientifically proven to reverse the neurology of distraction  </em>  \t  \t</li>  \t<li>  \t  \t\t<em>                                                                               Tools and Guides to help you use all of this and more to see positive results fast!</em>  \t  \t</li>  </ul>  <p>  \t                                                                                                                                        You might be thinking: \"How do I know if this is going to work for <em>me</em>???\"  </p>  <p>  \t                                                                                                                                        I've built an entire organization, called Control My ADHD, around these strategies which have worked for countless people from <em>half a dozen countries</em>.  </p>  <p>  \t                                                                                                                                        The kind of feedback this course has been getting:  </p>  <p>  \t<strong>\"Every sentence contains great strategies for succeeding with ADHD.\" </strong>- Tyler G  </p>  <p>  \t<strong>\"Loved it!\"</strong> - Emma B.  </p>  <p>  \t<strong>\"This was one of the <em>smartest decisions</em> I've ever made...it's been an <em>amazing resource</em> in my time of need\"</strong> - Renu R  </p>  <p>  \t<strong>\"Finally a <em>new</em> and <em>exciting</em> solution for those who struggle with ADHD.\" </strong>- Mary Robertson, RN, ADHD Coach, Former President of CHADD  </p>  <p>  \t                                                                                                                                        No matter where you are with managing your ADHD, or even if you don't have ADHD but still struggle with disorganization and lack of focus, I guarantee you'll learn at least one MAJOR strategy from this class that will change your life for the better (see the testimonials above for proof!).  </p>  <p>  \t                                                                                                              I will personally respond to any questions you may have as you go through the material, so there's no worry of having leftover concerns or questions. So sign up now!  </p>  <p>  \t                                                                                                                                        See you on the other side,  </p>  <p>  \t                                                                                                                                        Grant Weherley, Featured Udemy Instructor, ADDA, APA, Founder of Control My ADHD and Author of <em>Break The System</em>  </p>  <p>  \t                                                                                                              P.S. I charge people thousands to get these same strategies through coaching. The current price was set so low to make it a<strong> total no-brainer </strong>for you.  </p>", 
    "end_date": null, 
    "title": "Master Your ADHD Brain!", 
    "price": "25.00", 
    "instructors": "Grant Weherley", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/114694_0d40_9.jpg", 
    "course_url": "https://www.udemy.com/adhd-mastery-training-turn-symptoms-into-strengths/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-03T18:03:02Z"
}