{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">UPDATED CONTENT: <br style=\"\">  \t       - </em>Interview - How can mindfulness improve our mental well-being  </p>  <p style=\"\">  \t<em style=\"\">LATEST: Course updated 21st December 2014</em>  </p>  <p style=\"\">  \t<br style=\"\">  \t       Have you ever felt stuck in your own head? Have you wanted to have more control over your thoughts and your feelings...how you look at the world around you and how you make your decisions?  </p>  <p style=\"\">  \t         Our course on mindfulness will take you through:  </p>  <p style=\"\">  \t         - Best practise breathing methods to focus your mind, reduce your stress and anxiety, and get you feeling more in control  </p>  <p style=\"\">  \t         - Focusing practises to help you to delve into how to get yourself out of your head and start allowing those nagging thoughts to drift away  </p>  <p style=\"\">  \t         - How to accept and let go of pain; physical, mental and emotional  </p>  <p style=\"\">  \t         - Many more exercises and techniques you can begin to integrate into your daily life  </p>  <p style=\"\">  \t         - How to open access to a higher range of your brain&#039;s true potential  </p>  <p style=\"\">  \t         Mindfulness will take ten minutes out of your day, can be accessed from any of your devices, and you can listen to our short, supportive audio&#039;s from anywhere any time - on the bus home from work, in your room, or even when you&#039;re around a stressful situation.  </p>  <p style=\"\">  \t         We provide you with a 30 day guarantee. If you feel this course isn&#039;t of value to you, you can get a full refund..absolutely no questions asked.  </p>  <p style=\"\">  \t<br style=\"\">  \t         More than 45% of people between 18 - 50 say they now practise mindfulness in their day to day lives! So go ahead..it&#039;s risk free. Click the enroll button in the top right corner of this page and you can start taking more control of your thoughts, emotions. Breathe yourself into a better life.<br style=\"\">  \t<br style=\"\">  \t         All you need is the ability to breath, nothing else. We&#039;ll do the rest for you.  </p>", 
    "end_date": null, 
    "title": "Mindfulness - breathe yourself into a better life", 
    "price": "20.00", 
    "instructors": "John Harper", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324070_524a.jpg", 
    "course_url": "https://www.udemy.com/mindfulness/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T11:52:48Z"
}