{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hello and thank you for your interest in this course.</p><p>My name is Ross Pelton and I&#039;m known as <strong style=\"\">The Natural Pharmacist.</strong> I&#039;ve been a pharmacist, a nutritionist, an author and a health consultant for over 30 years. For years I have been alarmed at the widespread use of antidepressant and anti-anxiety drugs and their serious side effects. Now, I&#039;m very excited to offer this course on <strong style=\"\">Natural Therapies For Depression And Anxiety</strong>. I think it is important for people to realize that effective natural therapies for depression and anxiety are available. </p><p>This is an in-depth look at the multiple causes of these conditions as well as the natural therapies that can be used for both prevention and treatment. This is a content-heavy class, suitable for healthcare professionals as well as individuals who are serious about finding natural ways to combat depression and anxiety.</p><p>This course, which is over 4 hours long, is divided into short (5-10 minute) videos. Each short video section addresses one or two specific topics. Don&#039;t let the length of the course or the depth of material deter you. I truly believe that this information can change lives and I am excited to be sharing it with you</p><p>I extend best wishes for better health and greater happiness.  </p><p>Sincerely, Ross<br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Natural Therapies for Depression and Anxiety", 
    "price": "50.00", 
    "instructors": "Ross Pelton", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476482_762b_4.jpg", 
    "course_url": "https://www.udemy.com/natural-therapies-for-depression-and-anxiety/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T21:33:25Z"
}