{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t    This e-learning course on <em style=\"\">Positive Mental Health</em>,  developed and presented by Carolyn Barber, offers a foundation for  understanding the various components of mental health and well-being. It  will be of value to professionals in the caring professions as well as  to informal carers supporting people with mental health problems and,  indeed, for individuals wanting to make a positive contribution to their  own mental health. It is the equivalent of a full-day&#039;s continuous professional development, but constructed in such a way as to enable flexible study to suit your own schedule.  </p>  <p style=\"\">  \t   It is based on a 5Cs model of mental health based on five key elements:  </p>  <ul style=\"\">  \t<li style=\"\">Challenge</li>  \t<li style=\"\">Character</li>  \t<li style=\"\">Composure</li>  \t<li style=\"\">Connection</li>  \t<li style=\"\">Creativity</li>  </ul>  <p style=\"\">  \t  The course explores each of these in turn, offering first an overview of the important role of the element concerned, then a review of what light research and theory cast on it, a consideration of different approaches to addressing the important issues involved and, finally, additional information about particular tools or methods that can prove helpful in promoting positive mental health.  </p>  <p style=\"\">  \t  In today&#039;s pressurised and fast-moving world many people are experiencing difficulties in maintaining good mental health. So, whether you are looking towards improving your own mental health or you work in a setting where supporting others to meet their mental health needs, this course will will give you a firm foundation on which to build.  </p>  <p style=\"\">  \t  Written and presented by a highly experienced expert in the mental health field, this course offers an excellent basis for learning how to rise to the many mental health challenges we face.  </p>", 
    "end_date": null, 
    "title": "Positive Mental Health", 
    "price": "35.00", 
    "instructors": "Carolyn Barber, Neil Thompson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/248942_6743_2.jpg", 
    "course_url": "https://www.udemy.com/positive-mental-health/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-23T20:13:13Z"
}