{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Anxiety</strong><strong style=\"\"> &amp; Depression </strong>are two of the most common mental health concerns in our society. They are often experienced as a complex set of emotional and functional challenges. </p><p style=\"\">The science of mind-body medicine helps us understand the ongoing connection between the mind and body and see how anxiety and depression may be triggered by a variety of factors. These can include nutritional, psychological, physical, emotional, environmental, social, and spiritual factors, as well as genetic tendencies or brain disease. While we often hear about a biochemical cause, meaning that certain chemicals in the brain called neurotransmitters are out of balance, it is not clear if the level of neurotransmitters is the actual cause of anxiety and depression, or simply a symptom that a person is anxious or depressed.</p><p style=\"\">Anxiety and depression are not the same, but they often occur together. It is not uncommon for people with depression to experience anxiety and people with anxiety to become depressed. There is also overlap in some of the treatments, so it is beneficial to learn about both conditions.</p><strong style=\"\"><p style=\"\">Qigong: You will learn effective movements to help you cope with the condition, simple to learn but very easy to implement on a daily basis needing no special effort to be made.</p></strong><p style=\"\">All of the curriculum is self contained and consists mostly of audio visual learning, allowing your to practise the movements without having to remember what to do, which might increase anxiety.</p>", 
    "end_date": null, 
    "title": "Qigong for Anxiety and Depression", 
    "price": 0, 
    "instructors": "Andy Wright", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568166_9454_4.jpg", 
    "course_url": "https://www.udemy.com/qigong-for-anxiety-and-depression/", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T10:42:33Z"
}