{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Do you feel down more often than up? Or do you find fear is preventing you from moving forward in your life? Are you seeking a way to deal with your emotions that is natural, easy and simple to use?</p><p><em></em>This practical hands-on course will teach you techniques you can use each day to help you release feelings of anxiety and depression while increasing feelings of relaxation.</p><p>This course introduces you to the centuries old techniques of Acupressure and Reiki. Both of these systems are known for their positive impact on the physical and energetic body while being easy to learn and administer.</p><p>This course provides you with techniques you will learn over the span of 10 days to perform an energetic cleanse so that you can start living your life in the present moment rather than seeing through past memories and beliefs that are not helping you to live your best life.</p><p>For less than the cost of one Accupressure/Reiki session, you can learn how to use these amazing modalities for yourself.</p><p>After the 10 days, you will keep using the techniques you have learned in this course to continue the process of emotional detoxification so that your body, mind and life are aligned with who you truly are.</p><p><strong>Important Note:</strong> Students who wish to receive Reiki attunements will be asked to provide personal information (name, email) when they schedule these attunements. Note: information provided is confidential and only used for the purpose of the attunement ceremony.<br></p>", 
    "end_date": null, 
    "title": "Reiki and Acupressure for Anxiety and Depression", 
    "price": "20.00", 
    "instructors": "Lisa Powers, Dr. Jakob Bargak", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697610_921d_9.jpg", 
    "course_url": "https://www.udemy.com/reiki-and-acupressure-for-anxiety-and-depression/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T22:58:34Z"
}