{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>You don't have to be a victim of winter any more. You can learn to cope better with winter without depending on medications or light therapy. Cognitive Behavioral therapy or CBT has been shown to be as effective as light therapy and possibly better in the long term for preventing future episodes of SAD. CBT skills can help you to change your relationship to winter in a more positive direction. Imagine being less depressed or not depressed at all next winter and all winters to come? <em>Say Goodbye to Seasonal Affective Disorder and Winter Blues </em>is an empowering learning experience where you will acquire skills, knowledge, and better understanding of yourself that will help you cope with this winter and all winters to come.</p><p>The course is organized into ten lectures that present different facets of CBT, each building on the skills you learned before. You can expect to change your behavior, that is, how active you are during the winter season and your patterns of thinking—these are the “behavior” and “cognitive” components of CBT. Each lecture will assign homework that will consist of monitoring and changing your behavior and thoughts. Doing the homework is the key to change and the more you do it, the more benefit you’ll get from the course. Unlike homework assigned in school, there are no right or wrong answers to these homework practices and they won’t be graded. There are video lectures for each topic accompanied by PowerPoint presentations and all the forms that you’ll need to do your homework and practice these skills. You’ll proceed through the lectures at your own pace and move on to the next lecture once you’ve had a chance to do the homework from the previous lecture. </p><p><em>Please Note: This course is a comprehensive psychoeducational program that has been shown to be effective for treating SAD. This course does not constitute a psychotherapeutic relationship and if your symptoms worsen, you should consult with your primary care provider or mental health clinician. </em></p>", 
    "end_date": null, 
    "title": "Say Goodbye to Seasonal Affective Disorder and Winter Blues", 
    "price": "30.00", 
    "instructors": "Arnie Kozak", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630466_1514.jpg", 
    "course_url": "https://www.udemy.com/say-goodbye-to-seasonal-affective-disorder-and-winter-blues/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T15:23:49Z"
}