{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \tLearn and understand how the human brain develops fears, phobias, worries, anxieties and obsessions. Once understood it can be unlearnt bit by bit in simple steps.  </p>  <p style=\"\">  \t<strong style=\"\">Reclaim, the Feelgood Way,  those parts of your life which are restricted by your anxieties.</strong>  </p>  <ul style=\"\">  \t<li>Understand why you have anxiety problems and others don&#039;t</li>  \t<li>Recognise what you need to change to reduce or overcome your anxieties</li>  \t<li>Learn simple step-by-step ways to change your anxiety habits for good</li>  \t<li>Do it at your own pace</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Gain the knowledge you need to stop struggling and move on with your life</strong>  </p>  <p style=\"\">  \tAnxiety is a normal human emotion. Some of us simply learn to have too much of it (unintentionally of course).  </p>  <p style=\"\">  \t    Have you tried lots of ways to get rid of it or overcome it? Maybe you&#039;ve had some sort of psychological therapy? Maybe you&#039;ve had medication? Have you read books about it? But these haven&#039;t really had any lasting effect?  </p>  <p style=\"\">  \t    It <strong style=\"\">is</strong> possible to reduce or completely overcome these anxiety habits but you must go about it in the right way.  </p>  <p style=\"\">  \t    This course is based on sound psychological theory and it has been tested by me.  </p>  <p style=\"\">  \t     I am a clinical psychologist who in earlier life suffered for twenty years with panic attacks and obsessions. I got by with various coping strategies. I thought I was treating myself by doing what my professional training had taught me, but it never worked totally. It was only when too many things went wrong all at once and I lapsed into an acute anxiety state that I really had to look at what wasn&#039;t working and why. I wasn&#039;t able to leave the house for fear of having a panic attack. I even had them in the house.  </p>  <p style=\"\">  \t    This was my lucky break because I <strong style=\"\">had </strong>to analyse what was going on and work out once and for all how to get rid it. And I did.  </p>  <p style=\"\">  \t    I know that this works. I also know that many people fail because they don&#039;t actually <strong style=\"\">do</strong> what they need to do. I too was guilty of this for many years. In recent years I have had patients attend my courses and come along afterwards and tell me it doesn&#039;t work. I then tell them that <em style=\"\">&quot;</em><strong style=\"\">It</strong> works. You&#039;re not doing it!&quot; After that we go through it again step by step to find which bit they are doing wrong - and it&#039;s always there!  </p>  <p style=\"\">  \t    Anxiety is not a virus or a disease that you catch. Anxiety is a normal human response that some of us learn to apply too often. This isn&#039;t intentional. But because it is learnt, it can be unlearnt if done the right way. I will show you the right way.  </p>  <p style=\"\">  \t    The course is mainly in two parts. The first part can be done as slowly or as quickly as you wish. It teaches you to understand what anxiety is, where it comes from and how it develops. With this knowledge the steps needed to overcome it make total sense. Nobody will keep at any task if they don&#039;t fully understand why they&#039;re doing it! This is often where traditional approaches to psychological therapy go wrong. It&#039;s not that the approach is unsound, it&#039;s just delivered in the wrong way.  </p>  <p style=\"\">  \t      The second part of the course leads you step by step towards incorporating new ways of thinking into your everyday life. There are new habits for your general wellbeing and also specific ways of responding when the anxiety threatens. Learnt properly by practising the techniques taught, these new habits will gradually replace your old anxiety habits.  </p>  <p style=\"\">  \t      The lessons themselves are mainly video. There are pdf notes that can be downloaded as well as audio tracks for practising. The main therapeutic approach used is Acceptance and Commitment Therapy. This is known as third wave CBT and it incorporates the practice of mindfulness. For anyone who is averse to doing long meditations, these are entirely optional. Very short (30 seconds) meditations are enough to do the job!  </p>  <p style=\"\">  \t    In order to benefit from this course you must be prepared for it to take time and to actually practise what you are asked to practise. After all, you wouldn&#039;t expect to become a great pianist if you never practised between lessons would you? Yet all too often people having psychological therapy think they can get by with just the therapy sessions!  </p>  <p style=\"\">  \t    One thing I know from personal experience is that if you actually follow the steps you will overcome your anxiety habit. If you cheat… well, I think you know the answer to that!  </p>  <p style=\"\">  \t    I look forward to having you on my course  </p>", 
    "end_date": null, 
    "title": "Stop Struggling with Anxiety - Overcome It the Feelgood Way", 
    "price": "45.00", 
    "instructors": "Sue Breton", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/323892_20fa_3.jpg", 
    "course_url": "https://www.udemy.com/overcoming-anxiety/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T07:10:07Z"
}