{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<h5><strong style=\"\">Say goodbye to Stress forever</strong></h5>  <p>  \t <em style=\"\">How would you like to be Stress Free in 7 days?<br style=\"\">  \t  Are you always worrying about life, money, family, or even your health?<br style=\"\">  \t  Do you wake up at around 4am in the morning and then struggle to get back to sleep?<br style=\"\">  \t  Is the merry-go-round of thought in your head, seemingly non-stop?<br style=\"\">  \t  Is your stress affecting your health, your relationships, your career or even your loved ones?<br style=\"\">  \t  Why won’t any of the ‘other’ stress remedies out there help you?<br style=\"\">  \t  What can be done to stop you feeling stressed forever?</em>  </p>  <p>  \t My name is Damian Mark Smyth, and I am a stress management coach. I am also a teacher and trainer in a field of modern psychology called the ‘Three Principles’. This area of prevention has been proven to work with even the most extreme cases (including in maximum security prisons) and it will give you the freedom you require from stress forever.  </p>  <p>  \t I should know. I recently went through a divorce and custody battle and came through it completely unscathed. In fact, people were often saying to me how impossibly calm I was throughout the whole thing.  </p>  <p>  \t You too can learn the secrets about stress that will change your life around so you will no longer have to live with the constant fear, worry and anxiety.  </p>  <p>  \t You too will be stress-free in 7 days.  </p>  <p>  \t This course is designed to give you the understanding behind the human operating system and to show you how the process works. As with anything else, once you have an understanding of how a system works, it’s a darn sight easier to then correct it. Think about your car. If you know how it’s put together and functions, it’s a lot easier to fix it when it goes haywire.  </p>  <p>  \t There are no catches, no tricks, no hidden surprises... all of the ideas in this course are simple to follow and even easier to put into practice. In fact, there is a great deal of ‘doing nothing’ involved. And there’s a very good reason for this: When we listen through what we know, we limit ourselves to what we already know. So I will be asking you to leave what you already know ‘at the door’ before you enter.  </p>  <p>  \t The reason this programme works and is life changing is BECAUSE it’s different to what you already know. That’s got you to where you are right now - without a solution. This programme IS the solution.  </p>  <p>  \t <strong style=\"\">So get ready for a life changing seven days, as we get you stress free forever!</strong>  </p>  <p>  \t <strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t <em style=\"\">All the modules in this programme come with an audio download, along with the written version, which means you have the choice of how to use the material. </em>  </p>  <p>  \t <em style=\"\">Either way, the course is interactive, so please provide answers to the questions at the bottom of the module. This will help me tailor the understanding that you will be getting to your personal requirements and answer any queries you may have. It will also help me to get a better idea of who you are and how to achieve stress free success quickly and efficiently.</em>  </p>  <p>  \t <em style=\"\">The approach outlined within this course is very different to other, more traditional &#039;stress management&#039; programs. Therefore it is likely that you will have insights and queries that may well need addressing by me - this is an online coaching course as much as an instructional process.</em>  </p>", 
    "end_date": null, 
    "title": "Stress Management", 
    "price": "20.00", 
    "instructors": "Damian Smyth", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/56017_5267_6.jpg", 
    "course_url": "https://www.udemy.com/stressed-to-relaxed-in-7-days/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-23T13:39:55Z"
}