{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\r\n\t             1. What is <strong>stress</strong> and how does it affect <strong>physical</strong> and <strong>emotional health</strong>?\r\n</p>\r\n<p>\r\n\t             2. Look at ways to cope with stress\r\n</p>\r\n<p>\r\n\t             3. Use <strong>mindfulness</strong> <strong>meditation</strong> techniques\r\n</p>\r\n<p>\r\n\t             4. Create positive and meaningful personal contacts\r\n</p>\r\n<p>\r\n\t             5. Explore ways to create <strong>emotional health</strong>.\r\n</p>\r\n<p>\r\n\t        In this course you will learn to identify <strong>stress</strong>, establish what situations, thoughts or feelings stress you out and learn ways to reduce this stress. Identifying <strong>mind traps</strong>, will help you to become more aware of your <strong>thinking patterns</strong> and enable you to be more <strong>mindful</strong> of them, allowing you to increase your <strong>resilience</strong> to <strong>stressors</strong> and life difficulties.\r\n</p>\r\n<p>\r\n\t       The course consists of video lectures with voice and documents, together with supplementary materials such as videos, and audios to enhance your practice. If you complete the course in one sitting it should take about half a day to one day to complete.\r\n</p>\r\n<p>\r\n\t      In a review of research into the <strong>benefits of mindfulness</strong>, the <strong>American Psychological Association</strong> found that many studies show that practicing <strong>mindfulness reduces stress</strong>. (Davis, D. M., Hayes, J., A. What are the benefits of mindfulness? Monitor on Psychology, July/August 2012). Studies show evidence that <strong>mindfulness </strong>increases <strong>positive emotions </strong>and decreases negative emotions and anxiety. Farb et al., found that mindfulness shifts a person&#039;s ability to use <strong>emotion regulation strategies</strong>, enabling them to experience emotion selectively.\r\n</p>\r\n<p>\r\n\t      Farb NAS, Anderson AK, Mayberg H, et al. Minding one&#039;s emotions: <em>Mindfulness training alters the neural expression of sadness.</em> Emotion. 2010;10(1):25&ndash;33.\r\n</p>\r\n<p>\r\n\t      Besides these <strong>benefits</strong> there are many others, such as: <strong>boosting working memory</strong>, ability to <strong>focus attention, becoming less emotionally reactive, increased relationship satisfaction, increased immune functioning, improved sense of well-being,</strong> to list a few.\r\n</p>\r\n<p>\r\n\t   Reference: American Psychological Association: <a href=\"http://www.apa.org/monitor/2012/07-08/ce-corner.aspx\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">http://www.apa.org/monitor/2012/07-08/ce-corner.aspx</a>\r\n</p>", 
    "end_date": null, 
    "title": "Stress Reduction & Wellness", 
    "price": "20.00", 
    "instructors": "Carol Knox", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94460_42a4_11.jpg", 
    "course_url": "https://www.udemy.com/stress-reduction/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T11:00:15Z"
}