{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t   Do you want to become more focused, flexible, and relaxed? Don&#039;t have time for long workouts?  </p>  <p style=\"\">  \t   This course in nourishing Tai Chi forms for focusing the mind taught by Rami Rones will show you how to do a Tai Chi routine in a simple, step-by-step proven method. Not one for all the extra philosophy behind the techniques? No worries. This course is purposefully abridged and focuses entirely on the forms.  </p>  <p style=\"\">  \t   The course begins with a short introduction to Rami&#039;s goals for the course. Immediately after, you&#039;ll dive right into learning and practicing the Tai Chi form. At the end, we&#039;ve included a bonus section of stretches and breathing exercises that will help you take the benefits of the Tai Chi form to the next level.  </p>  <p style=\"\">  \t   Rami has synthesized over 30 years of Tai Chi and mind-body teaching and practice to create this Tai Chi course for beginners. You will experience the same teaching he has done with the thousands of elite athletes, adults, teenagers, “weekend warriors”, martial artists and others to become more successful and confident.  </p>  <p style=\"\">  \t   He has designed a number of medical clinical trials such as the investigation of the benefits of Tai Chi and Fibromyalgia, Tai Chi and Knee Osteoarthritis.  Much of his research design is also included in this course.  His Fibromyalgia and Tai Chi study was published in the New England Journal of Medicine and featured in the New York Times.  </p>  <p style=\"\">  \t   You will also benefit from his extensive teaching at the internationally recognized Dana-Farber Cancer Institute, Tufts Medical Center and the Boston Medical Center where he continues to help patients deal with, and recover from, a wide variety of ailments and and the side effects that often occur with various treatments.  </p>  <p style=\"\">  \t   Rami’s incredible knowledge, teaching ability and engaging personality makes this Tai Chi for Beginners course a joy for anyone interested in improving their physical and mental well-being.  </p>  <p style=\"\">  \t   This course is designed to be used for about 15 minutes, three times a week.  </p>", 
    "end_date": null, 
    "title": "Tai Chi for a Focused Mind - Pure and Simple", 
    "price": "20.00", 
    "instructors": "Ramel Rones", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230748_88d9_2.jpg", 
    "course_url": "https://www.udemy.com/tai-chi-for-a-focused-mind-pure-and-simple/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T12:17:31Z"
}