{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Learn the basic concepts, tools and habits you need to control your anger and calm the “beast within.”\n\n  </p>\n\n\n\n<p><strong>Build stronger, more fulfilling relationships with family, friends, co-workers and employers with this course on Anger Management.</strong>\n\n  </p>\n\n\n\n<p>·      Identify the Anger Cycle\n\n  </p>\n\n<p>·      Commit to Being Anger-Free for 24 Hours\n\n  </p>\n\n<p>·      Learn About Your Anger Style\n\n  </p>\n\n<p>·      Discover the True Cost of Anger\n\n  </p>\n\n<p>·      Develop New Habits to Bypass Your Anger Triggers\n\n  </p>\n\n\n\n<p><strong>Create New Neural Pathways In Your Brain</strong></p>\n\n<p>The latest research shows that Cognitive Behavioral Therapy (CBT) is a highly effective tool in combating the negative effects of Anger.  In this course you will learn specific CBT techniques that will help you regulate and control anger triggers and impulses.  As you master the techniques in this course you will be creating new neural pathways in your brain.  This course will help you physically change how your brain operates simply by applying your willpower and your brain in tandem toward a shared goal: Anger Management.\n\n  </p>\n\n\n\n<p><strong>Content and Overview</strong></p>\n\n<p>With this course I’ve distilled hours and hours of experience working with clients down to 24 lectures that cover everything you need to know about controlling and managing your anger.  You’ll explore the role anger plays in your life – good and bad.  You’ll examine the different ways anger can manifest itself (hint: it’s not always about screaming and trashing hotel rooms).  You’ll learn how we distort reality in ways that feed our anger… and how to combat those distortions.  \n\n  </p>\n\n\n\n<p>When you’ve completed this course you’ll be equipped to “get in front of” your anger and use it to feed the fires of creativity and competition instead of letting your anger burn you, and those around you, down to the ground.\n\n  </p>\n\n\n\n<p>Each short video has a real-world “homework” assignment that should take about a week to complete. </p><p><br></p>", 
    "end_date": null, 
    "title": "Taming the Angry Monster Inside", 
    "price": "50.00", 
    "instructors": "Louisa Link-McDowell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833884_b720_3.jpg", 
    "course_url": "https://www.udemy.com/anger-management-n/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T21:03:41Z"
}