{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Did you miss an important meeting even though you programmed it into your phone? Or zoned out of a conversation while “quickly” reading a text message?</p><p>Do you feel like your cell phone and tablet are actually making your life <em>more</em> difficult?</p><p>Modern technology is amazing! It can make our lives simpler and make us more efficient. But it can also distract us and prevent us from maximizing our memory. Current research provides us with insights on how to take advantage of technology while also avoiding the pitfalls that come along with it.</p><p>You’re the boss of your own life. Get technology to work <em>for</em> you!</p><p><strong>What do I need to know before watching this video?</strong></p><p>No science background is necessary.</p><p><strong>Who is the target audience?</strong></p><p>Anyone who needs or wants simple, usable, and proven strategies to get technology to work for them based on the latest brain science.</p><p><strong>In this lecture you will learn:</strong></p><p>– How to make  modern technology like your cell phone, Google, and tablets work for you instead of against you.</p><p><span>– The real reason you can’t you remember phone numbers anymore.</span></p><p><span>– If Google is impacting your memory is in a positive or negative manner.</span></p><p><span>– How multitasking makes us less efficient.</span></p><p><span>– How our brain works differently when we are reading on a screen versus on paper?</span></p><p><span>– The pros and cons of our cell phones on our brains.</span></p><p>– How to maximize our memory based on how our brains work.</p><ul>  </ul>", 
    "end_date": null, 
    "title": "The Impact Of Modern Technology On Our Brains", 
    "price": "20.00", 
    "instructors": "Dr. Marc Milstein", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393450_0267_3.jpg", 
    "course_url": "https://www.udemy.com/the-impact-of-modern-technology-on-our-brains/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T22:50:35Z"
}