{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Course Description</strong></p><p style=\"\">This course is aimed at helping moms who feel exhausted physically and mentally, and want more energy to be able to thrive for their kids. Many moms have projects, fun activities, and parenting techniques that they want to incorporate throughout the day for their kids but simply feel like they run out of steam before they can implement them. If you feel like you are constantly on the edge of breaking down, fighting baby blues or depression then this course can help you take your health back. This course provides the workout and nutritional components that you need to finally have the energy mentally and physically to thrive for yourself and kids. </p><p style=\"\"><strong style=\"\">Learn How To Beat Exhaustion And Have The Energy You Need To Thrive Everyday</strong></p><ul style=\"\"><li style=\"\">Exercise to increase energy and strength without feeling exhausted or sore afterwards.</li><li style=\"\">Learn natural supplements that fight depression and baby blues.</li><li style=\"\">Learn how to reduce restless sleep.</li><li style=\"\">Eat in a way that increases mental clarity and energy.</li><li style=\"\">Learn how to mentally prepare each morning in 5 minutes.</li></ul><strong style=\"\">There Is No Role More Important &amp; More Taxing Than Motherhood</strong>Mothers shape our future through the raising of their children. Most mothers are the first up in their family, and the last to go to sleep due to the many daily tasks that come along with raising kids. Due to the many different demands placed on mothers over 28% report they fight depression and a feeling of exhaustion.  Finding a solution that fits into a mothers busy day can be difficult. The Mommy Energy Solution program helps provides moms with an easy to implement program that will increase their energy, increase mentally clarity, battle depression and exhaustion, and help moms Thrive.<span style=\"\"></span><p style=\"\"><strong style=\"\">Content &amp; Overview</strong></p><p style=\"\">Moms will learn how to help their bodies become stronger so that simple tasks like picking up their kids, bags of groceries, and picking up laundry actually feel lighter and easier. With the detailed Mommy Energy Solution workout you will never end feeling tired or sore for days to follow. You will feel more energized and stronger from your first workout. Since moms are always on the go an busy the workout is only 30 minutes long and only needs to be done twice a week.  </p><p style=\"\">Moms will learn how to eat, and use natural supplements that will help increase their mental clarity. The eating and supplement recommendations covered in this course not only help increase mental clarity but also help decrease depression symptoms which many mothers can find themselves fighting. </p><p style=\"\">As you increase your mental clarity through this course you will feel more focused, and present when you are with your kids, and moving throughout your day. Also included in the course is a easy 5 minute routine that will help you get mentally prepared and organized for your day.</p><p style=\"\">Moms will also learn how to decrease restless sleep so that they can wake up feeling energized and excited for the day ahead. </p><p style=\"\">After covering all of the above information in detail the course ends with a 3 week implementation guide. It starts off with the most basic and easy to implement steps and gradually incorporates the entire Mommy energy Solution program into a 3 week program that any mom can implement.  </p><p style=\"\"><strong style=\"\">What are the requirements?</strong></p><ul style=\"\"><li style=\"\">The willingness to take action.</li><li style=\"\">A gym membership or 2 dumbbells with weights for a home workout. </li></ul><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li style=\"\">The ability to end exhaustion, and the energy to thrive for yourself and family.</li><li style=\"\">Detailed workout program that will leave you stronger without feeling sore and tired.</li><li style=\"\">Videos that show exactly how to complete the exercises safely and from anywhere.</li><li style=\"\">Easy to use natural supplements to help fight depression, and increase mental clarity.</li><li style=\"\">A printable workout log so that workouts are easy to create and follow.</li><li style=\"\">Your kids and daily chores will actually feel easier and lighter.</li><li style=\"\">A detailed 3 week guide to implementing the entire program.</li><li style=\"\">A 15 minute daily routine to help end restless sleep.</li></ul>", 
    "end_date": null, 
    "title": "The outplay your kids, never get tired mommy energy solution", 
    "price": "50.00", 
    "instructors": "Benjamin David Platt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/446372_f44d_2.jpg", 
    "course_url": "https://www.udemy.com/the-mommy-energy-solution/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-13T07:11:15Z"
}