{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><u><strong>Understanding the workings behind the method</strong></u></p><p>In this course I am going to lecture about the workings behind the hypnosis method.</p><p>I will be outlining the importance of the white light, Frequencies and the law of attraction. A discussion about your reality and what hypnosis generally is will be gone into. Since I am foremost a big fan of hypnosis tapes, I will briefly go over how to use tapes to increase your frequency. I will also touch on subjects such as past lives, and future lives, and bring more knowledge. For the purpose of creating an impact on your subconscious, so you don´t need to listen to hours of lecture, the lectures are short and concise. I recommend playing them over and over again so you can grasp the depth of what I am saying in each lecture. I will start off by “What is Hypnosis &amp; the White Light?”. This first lecture is intended to give you a fairly god understanding of the importance of alpha brainwave, and the visualisation of a white light. With this knowledge, you will be able to understand more about your own nature.</p><p>Then I will proceed in the second lecture to bring about a understanding of what reality is, and the importance of raising the brainwave frequency that you hold. This is not a lecture telling you that this is how reality is, and no other way is acceptable. It is rather a understanding from my point of view, and that understanding is not set. It will definitely keep expanding as I move to life, but so far this is what I see. That reality is created by your thoughts. I will underline this in this second lecture.</p><p>Third, and probably the most famous, I will go through the concept called “The law of Attraction”. The Law of attraction merely states that “like attracts like”. I will give you examples and try to provoke you to think in a more expanded way. This is done intentionally to stretch your use of your own mind, by giving you more perspectives on how reality works. </p><p>I will also touch on the subject of fears regarding hypnosis. This will be gone through with help of the views of two most importan yogis. Paramahansa Yoganandya and Vivekananda. This is done, obviously to break down the common view of hypnosis made up by hollywood. Instead I want to clarify how such an important method can be used for your own good, and to enhance the experience of your life.</p><p>At the end , I will shortly go through how a hypnosis tape is supposed to be used. The subconscious registers everything, and a tape will work, no matter where your conscious mind is drifting. All you need is to be in a relaxed state, and play it over and over again.</p><p>The course is in totality a little over 30 minutes separated into five parts.</p><p><strong></strong><br></p><p><strong>What you will get out of the course?</strong><br><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong><br></p><p>The goals is for the student to be able to understand the core of what hypnosis represents. What this means is that you should be able to discern hypnosis from other methods that also uses the alpha brainwave. You will be able to grasp the importance of the use of hypnosis, if you want to create your own reality according to the law of attraction. Or if you want to be able to lose the fear of hypnosis. Understanding creates less fear of things, and ones you are finished with all the lectures, nobody else should be able to play tricks with you in the name of hypnosis. Mostly hypnosis has been misunderstood because of the media´s depiction of it. Nobody can actually control you against your will, and anyone who claims so, is merely someone using manipulative ways to distort your understanding of hypnosis so they can have their way with your mind. At the end you should have a little knowledge about making your own tapes, and how increasing brainwave frequencies improves the quality of your life. </p>", 
    "end_date": null, 
    "title": "The Complete Understanding of Hypnosis: Go pro fast", 
    "price": "50.00", 
    "instructors": "Mark J", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780174_029e_2.jpg", 
    "course_url": "https://www.udemy.com/understandinghypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T17:57:05Z"
}