{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t <em>The course contains over 3.5 hours of video and audio content based on the Seishindo Transformation Method.</em>  </p>  <p>  \t <strong>Introduction</strong>  </p>  <p>  \t <strong></strong>If you would like to stress less and live in a more emotionally fulfilling manner, this program can benefit you greatly. In this course, you are taught various traditional Japanese breathing methods for nourishing and calming your brain, your body, and your emotions.  </p>  <p>  \t            This course melds the exercises and theoretical principles of <em>Aikido</em> and <em>Noguchi Seitai</em> with Ericksonian Hypnosis, NLP (Neuro Linguistic Programming), Self-relations Psychotherapy, and recent discoveries in neuroscience research.  </p>  <p>  \t            The course employs a mixture of images, music, and verbal guidance to lead you through a process that helps you feel more alive and at peace in your everyday life. Little by little, you will notice that your stress melts away and is replaced by a feeling of calm confidence. You will wind up feeling healthier, more at ease, and better able to enjoy the positive aspects of your life.  </p>  <p>  \t   \t <strong>What makes our course special</strong>  </p>  <p>  \t            Our video and audio tracks communicate directly to your unconscious mind. You will find that you are influenced on a level of experience that comes prior to thinking. Rather than suggesting what you \"should\" be doing, we give you a direct experience to engage in. We feel this is the most effective way to learn to manage stress since most of the stress we create in our daily lives is generated on an unconscious level—we simply aren't aware of what we do to generate our stress. In taking part in our course you will learn how to change what you do with your body as a way to change the way you think and feel. This is the essence of what <em>Aikido</em> and <em>Noguchi Seitai </em>teaches.  </p>  <p>  \t            We provide you with the music that accompanies each exercise. By listening to the music at your leisure, you will revivify the learning you received when engaging in the exercises. You have had a similar experience many times in your life when hearing a piece of music you associate with a particular person, activity, or circumstance. Hearing the music leads you to recall the memories and feelings connected to your experience.  </p>  <p>  \t            All of our videos and audio content is downloadable and we also provide you with the mp3 version. This makes it possible for you to engage in our program on your mobile phone, portable audio device, and computer, whenever and wherever you like without having to access your web browser.  </p>  <p>  \t  \t<strong>Structure of the Course</strong>  </p>  <p>  \t <strong></strong>This course contains five main lectures (including 13 downloadable files): Two of the exercises are videos accompanied with music and verbal guidance. I walk you through the exercises as you passively take in the music and visual images. The other three exercises are audio tracks with music and verbal guidance. Make sure you go to the \"Download\" section of the course (to the right of each Lecture) to get all the files. You will also find detailed notes there as well about the lecture you are participating in.  </p>  <p>  \t            While you are free to engage in the course in any manner you wish, we suggest that you progress in the order the exercises are presented.  </p>  <p>  \t            A foundational concept of the program is this: You will be learning step by step, and the more you practice the more you will replace old debilitating habits with new more beneficial habits. It is my hope that you will find great enjoyment and learning, by engaging in the exercises for many years to come!  </p>  <p>  \t  \t<strong>Course exercises</strong>  </p>  <p>  \t<em><strong>1. Mushin Breathing. </strong></em>This exercise is based on the Japanese concept of <em>mushin</em>. When you experience <em>mushin </em>you are centered and calm, yet active. At such times your thinking mind and your body are coordinated, and act as one.  </p>  <p>  \t            You do neither too much or too little, as you release all extraneous action and thought. Nothing comes between your thought and your action, and nothing is left over or undone. This is the experience you can have at any given moment, prior to reflecting on your experience in any way.  </p>  <p>  \t            In this exercise you are guided through a process to help you become fully present in the moment, by breathing, moving, letting go, and living fully in the here and now. The more often you can let go of your concerns about the past and future, the healthier and more emotionally balanced you will feel.  </p>  <p>  \t<strong><em>2. Slow Expansive Breathing. </em></strong>The way you breathe is crucial to cultivating high quality physical and emotional health. Breathing fully can help you to slow down, and feel more in control of yourself, and your life. The better able you are to breathe fully the better you will feel during the course of your day.  </p>  <p>  \tBreathing fully increases blood flow throughout your body, providing your system with copious amounts of oxygen, while also cleansing your body of carbon dioxide and other toxins.  </p>  <p>  \t            This exercise offers you a core component in learning how to breathe fully while remaining relaxed. By engaging in this exercise, over time you will come to feel calm and solution oriented. Relax, take in what I have to say, listen to the accompanying music, and breathe… simple to engage in as I guide you through the entire process.  </p>  <p>  \t            This exercise leads you through a breathing cycle that is six seconds in, a second or two of rest, six seconds out, and another second or two of rest. The idea being that it is really important to take in copious amounts of oxygen.  </p>  <p>  \t            Most people will find this duration of breathing to be fairly easy to follow. But if you find yourself struggling to keep up with me, simply breathe for one or two cycles, rest while not attempting to keep up, and then breathe with me for another cycle or two, when the timing is right for you. After a bit of practice you will find that your breathing capacity expands, which will help you to relax even further.  </p>  <p>  \t<strong><em>3. Mu Breathing. </em></strong>This exercise is based on the Japanese concept of <em>m</em><em>u. Mu</em> can be said to mean “emptiness or nothing\". When you have nothing, then everything is possible. When you “think nothing\" you are free from your daily concerns. Experiencing <em>m</em><em>u</em> gives you a sense of the full potential that life can offer you. In Japanese culture, nothing is more revered than nothing!  </p>  <p>  \t            When you focus on nothing and bring mindful awareness to your breathing process, you increase your overall health and vitality. Mindful breathing also calms your thinking mind, and lessens unnecessary internal chatter and “worry\", so you can feel your rightful place in the world.  </p>  <p>  \t            In this exercise, you will learn how to experience and benefit from the potential of <em>mu</em>, as you open up to all that life is offering you.  </p>  <p>  \t<strong><em>4. Aikido Breathing - Demonstration. </em></strong>This exercise offers you a classic breathing technique used in Aikido. I teach you some theory, and the “how to\" of the exercise and then we engage in this breathing process together.  </p>  <p>  \t            The idea behind this exercise is for you to slowly take in copious amounts of oxygen in order to feed your brain and calm your overall system. When you breathe slowly in an expansive manner, your brain gets the resources it requires, and over time you find that your thought process slows down, and you wind up feeling more at ease in the moment.  </p>  <p>  \t            After engaging in this exercise numerous times, you will likely find that your thinking process fades away completely for short periods, and this is a great aid in helping you to feel safe and calm. You will discover what a wonderful treat it is to have no internal dialogue at times! Less internal chatter leads to less stress and greater self-confidence.  </p>  <p>  \t            The act of slowing down your thinking mind, also calms your body, and thus your overall system will feel a great sense of rejuvenation. Without thoughts running through your mind, you will be free to simply attend to your moment to moment experience, and you will have a great sense of wonderment and exploration.  </p>  <p>  \t<strong><em>5. Aikido Breathing- Practice. </em></strong>This exercise offers the same practice as the previous exercise but this time with most of the explanation stripped away.  </p>  <p>  \t            Once you feel confident with what you need to do in <em>Aikido Breathing- Demonstration</em>, this <em>Practice</em> version of the exercise will wind up being the recording you will likely use the most often.  </p>  <p>  \t  \t<strong>A bit of theory </strong>  </p>  <p>  \t <strong></strong>An insufficient intake of oxygen plays an important role in creating stress.  </p>  <p>  \t            And the less oxygen you take in, the less you breathe out carbon dioxide and other toxins. Thus your system gets clogged and you wind up with “brain fog\" – the inability to think clearly and stay focused.  </p>  <p>  \t            Tight muscles and bad posture also play a role in creating stress by inhibiting blood and oxygen flow to your brain and the rest of your body, which leads you to magnify the challenges you face. Thus you wind up fixating on your potential problems rather than focusing on your potential solutions.  </p>  <p>  \t            Glucose, oxygen, and the proper levels of nitric oxide and carbon dioxide are all important elements in fueling, rejuvenating, and healing yourself. When you breathe expansively, you maximize the synthesis and supply of these various elements throughout your system. In the process you prepare yourself to meet the many challenges you face, with presence and tranquility, and thus lessen the stress in your life.  </p>  <p>  \t            Follow our program and little by little you will find yourself living with greater presence and tranquility.  </p>", 
    "end_date": null, 
    "title": "Traditional Japanese Stress Management", 
    "price": "25.00", 
    "instructors": "Charlie Badenhop", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/148108_098f_7.jpg", 
    "course_url": "https://www.udemy.com/traditional-japanese-stress-management-module-1/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-17T01:15:17Z"
}