{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Note:</strong> <em>As a special introductory offer, this course is priced at $10 for a limited time. This price will increase in increments to reflect the actual development costs of the program. Once you have purchased the program, however, it is yours. No price changes apply or alter your access to the course.</em></p><p>Depression is one of the most difficult experiences in life, yet it is one of the most common of psychological complaints. Regardless of what causes it for a particular person (and there are usually multiple risk factors involved), depression will affect all aspects of a person's experience: their emotional state, their behavior, their thoughts, and their physical functioning. Unfortunately, changes in each of these areas tend to magnify changes in the others, creating a spiral of symptoms.<br></p><p>Cognitive behavior therapy (CBT) works to disrupt these spirals by focusing on elements within the person's control - in particular, the behavior and thoughts (not too surprisingly, given the name!). This course presents an understanding of depression, then advocates an emphasis on action to start the cycle moving in the upward direction. </p><p>Most people, during depression, want to feel better. Once that happens, they reason, their motivation will return and then they can begin reclaiming their lives. Unfortunately, this leaves them in an existence in which the depressed state is maintained. In CBT we reverse the plan: Take action, then get motivated, then feel better. </p><p>Nice idea - but how do you take action without motivation? Answer: Using a structured system of behavioral activation - essentially, gradual goal setting targeting the areas of life likely to produce the greatest payoffs in mood. Once the mood lifts, even by a tiny amount, their is a slight clearing in \"brain fog,\" enabling a bit more action, which can improve the mood just a bit more, challenging the negative thoughts that depression brings, and raising the energy enough to do a tiny bit more. We create a feed-forward cycle that mimics the downward collapse into depression.</p><p>Great, but how do you know where to start? We review the areas that have received the most research support, and provide concrete guidelines about how to make the most of them. You will be asked to examine your life in a series of exercises designed to identify your own targets for initial work. </p><p>The ideas given in this program are taken from the research literature, as well as from the author's books <em>Your Depression Map </em>and <em>How to be Miserable</em>, as well as the <em>Changeways Core Program</em>, which is a CBT-based depression group therapy protocol in use around the world (and translated into six languages). </p><p>It is important to understand that depression can be a severe problem requiring care by a healthcare professional who can assess you directly. This program is not a substitute for such care. If you suspect that you have clinical depression, please see your doctor and consider enlisting the help of a psychologist or other qualified counsellor. </p><p>What if you have done so and it is clear that you are not clinically depressed, but simply in a dull, dissatisfying, or unmotivated place in your life? The techniques in this course are also recommended and helpful for many people in this situation. In fact, without the severe loss of energy that depression brings, you may be able to make use of the strategies in a more accelerated fashion.</p><p>Remember, though: Watching videos doesn't help anyone very much. Most of the course recommendations involve getting away from the computer and getting involved in outside life. You'll get a 100-page guidebook to help you in your efforts.</p>", 
    "end_date": null, 
    "title": "UnDoing Depression", 
    "price": "40.00", 
    "instructors": "Randy Paterson", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312484_b1e1_2.jpg", 
    "course_url": "https://www.udemy.com/undoing-depression/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T22:16:05Z"
}