{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><b>Hypnosis can help you to lose weight</b></p><p>ACTUAL STUDENT REVIEW</p><p><i>“This course has shown me that my weight is really just a symptom of how I relate to myself. I now feel armed with the tools that I need to improve many things about my life\"</i></p><p>-<strong> Jane Watkins</strong></p><p>“Hypnosis is the epitome of mind-body medicine. It can enable the mind to tell the body how to react, and modify the messages that the body sends to the mind.\" <strong>–</strong> <b>New York Times</b></p><p><b>Would you like to enjoy real and sustainable weight loss?</b></p><p>Hypnosis is a natural state of consciousness in which the subconscious mind can be programmed for positive changes. </p><p>While hypnosis is not a magical cure for weight loss, skilful use of the hypnotic state can help you to improve the elements of your life that reflect into your weight.</p><p>Self Hypnosis for Weight Loss is equivalent to five sessions of Clinical Hypnotherapy for losing weight. In this life changing course, Nicholas Harris will guide you in practical therapy processes that have helped thousands of people to successfully lose weight.</p><p>If you are ready to feel better about yourself, expand your life, improve your relationships, increase your job opportunities, get better sleep and enjoy overall health and wellbeing then this course is for you!</p><p>Using hypnosis, you will train your mind to help you <b>want to</b><i> </i>eat healthily and exercise regularly. You will create a positive relationship with food, increase your self-confidence and resolve emotional blocks in your life.</p><p>These tried and tested methods communicate with your subconscious mind in a powerful way, helping you to form positive new thought patterns. Rather than worrying and feeling bad about your weight, you can focus on other things – enjoying your work, hobbies, friends, family and romantic relationships.</p><p>This course will help you to wake up feeling refreshed, going through your day feeling stronger, healthier and happier.</p><p>Welcome to Self Hypnosis for Weight Loss. It is time to change your life.</p><p><b>You have everything you need to look and feel great</b></p><p>Have you ever noticed the relationship between your weight and your sense of general wellbeing?</p><p>By the end of this course, you will feel more in control of every part of your life – not just your weight. Armed with a clear understanding of what you need to do to make the changes you want (and with the tools necessary for success), you will be empowered to walk the path of health.</p><p><strong>Enrol in the course today. Join our community - over 400 students are already losing weight</strong></p><p><i><em>Your enrolment in this course is backed by Udemy's 30 day, 100% money back guarantee. Enrol today and begin feeling better about yourself tomorrow.</em></i></p><p><strong>You have nothing to lose and everything to gain.  Welcome to Self Hypnosis for Weight Loss.</strong></p>", 
    "end_date": null, 
    "title": "Weight Loss with Self Hypnosis: Hypnotherapy to lose weight", 
    "price": "50.00", 
    "instructors": "Nicholas Harris", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236052_1224_2.jpg", 
    "course_url": "https://www.udemy.com/self-hypnosis-for-weight-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-03T01:54:11Z"
}