{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t          Join over 1200 students learning about the causes of depression!  </p>  <p style=\"\">  \t          Clinical depression is one of the most widespread and potentially disabling health conditions of our age. It is caused by multiple factors - none of which seem essential and only a few of which are sufficient to bring about the full condition. A huge body of research examines the various risk factors for depression.  </p>  <p style=\"\">  \t                  In this course, we look at the various risk factors associated with the mood disorders - particularly major depression. We use an expanded version of the Floating Diamond model presented in the &quot;What Is Depression?&quot; course: The Depression Map. This is based on the model that forms the basis for the presenter&#039;s book on the subject, <em style=\"\">Your Depression Map</em>.  </p>  <p style=\"\">  \t                  We range from biological and historical causes, through lifestyle and situational factors, to the often-neglected area of meaning. Along the way we look at the literature concerning diet, cognitive vulnerabilities, emotional tolerance, social isolation, exercise, and more.  </p>  <p style=\"\">  \t                  The course also provides a basic primer in depression biology, investigating the idea that there may be a biochemical underpinning to depression. Although this is almost certainly a part of the picture, the science to back the idea up is often lacking, and researchers increasingly suspect that long-held ideas may not be as useful as was once thought.  </p>  <p style=\"\">  \t                  Students receive an extensive notes package providing summaries of each lecture. Those taking the course to learn more about their own condition can follow along with an informal inventory of the causes covered.  </p>  <p style=\"\">  \t<strong style=\"\">            NOTE</strong>:  This course does not constitute treatment for depression or any other concern. It is designed for informational purposes only. Anyone with a history of depression should consult a healthcare professional for the assessment and treatment of their condition.  </p>  <p style=\"\">  \t                  As well, this course does not focus on the treatment or self-care of depression - these are topics to be examined in other courses. Our emphasis is solely on the risk factors.  </p>  <p style=\"\">  \t<strong style=\"\">30 Day Guarantee</strong>: Not sure? You don&#039;t have to be. We have a 30-day complete money back guarantee, no questions asked. As well, some of the lectures are available for free preview with no payment required, so you can get a feel for the course before you buy.  </p>", 
    "end_date": null, 
    "title": "What Causes Clinical Depression?", 
    "price": "20.00", 
    "instructors": "Randy Paterson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/158278_442d_3.jpg", 
    "course_url": "https://www.udemy.com/what-causes-depression/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-04T23:39:23Z"
}