{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t              Join our community of over 1700 students learning about the nature of depression!  </p>\n\n<p>  \t                  Depression, by some estimates, is the leading cause of disability in the developed world. Millions of people experience it each year. Yet many people who have depression have never been told much about it.  </p>\n\n<p>  \t                           This course describes the nature of the most common mood disorders - including major depression, dysthymia, and bipolar disorder. We review the symptoms used in making the diagnosis, and the challenges in properly diagnosing a problem for which there is no simple blood test.  </p>\n\n<p>  \t                           The course provides a model - the Floating Diamond - for breaking down and understanding the various elements of the depressive experience. Using it, we discover that depression is not, in fact, a mood disorder. It is a disorder of virtually everything: physiology, thoughts, behaviour, and, yes, emotion.  </p>\n\n<p>  \t                           We explore a central problem in depression: the fact that symptoms (such as sleep disruption) tend to feed back and intensify the disorder. Depression is not simply a vicious circle - it is a COLLECTION of vicious circles, all working at once.  </p>\n\n<p>  \t                           We move beyond the diagnostic criteria to discuss the additional symptoms and aspects of the depressive experience, exploring factors such as brain fog, memory disruption, sexual problems, and more.  </p>\n\n<p>  \t                           CAUTIONS:  Depression is an enormous topic, and in this course we are mainly focussed on the experience of the problem. We do not go into detail about either causes or treatment approaches - these will be covered in other courses. As well, this course is not a substitute for treatment, which should be carried out with the help of a qualified healthcare professional. We also caution against any attempt at self-diagnosis.  </p>\n\n<p>  \t<strong>30 Day Guarantee</strong>: Not sure? You don't have to be. We have a 30-day complete money back guarantee, no questions asked. Some of the lectures are also available as free previews, so you can get a sense of the course before you buy.  </p>", 
    "end_date": null, 
    "title": "What is Clinical Depression?", 
    "price": "20.00", 
    "instructors": "Randy Paterson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147026_e577_4.jpg", 
    "course_url": "https://www.udemy.com/what-is-depression/", 
    "currency": "USD", 
    "subject_name": [
        "Mental Health"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-14T22:56:30Z"
}