{"selfpaced": true, "topic_name": ["Communication Skills"], "description": "\n\n                    \n                    \n                    En el acelerado ambiente empresarial de hoy en día, a los empleados de todo nivel se les pide que se encarguen cada vez de más tareas, que cumplan más plazos, que asuman más responsabilidad y que se adapten a más innovación. Además de esos retos está la cuestión de la gran diversidad de personas con las que uno trabaja, y que continuamente están cambiando, por lo que es necesario saber manejar las diferencias generacionales, culturales, de sexo y de edad. La comunicación, tanto verbal como no verbal, constituye la base de todo lo que hacemos y decimos y es trascendental en el entorno laboral del siglo XXI. Afortunadamente, es posible aprender a comunicarse, y con la instrucción adecuada uno puede mejorar. El propósito de este curso es sensibilizar a los alumnos sobre la importancia de la comunicación en el lugar de trabajo y enseñarles nuevas destrezas interpersonales, a fin de que se vuelvan en general mejores comunicadores. Estos son algunos de los temas tratados: proceso y funciones de la comunicación, patrones conductuales, percepción de la realidad, señales verbales y no verbales, confianza, asertividad, tacto, control de la ira, críticas y observaciones positivas, resolución de conflictos, creación de equipos, liderazgo, entrevistas, empleo eficaz de la tecnología (correo electrónico, Skype, mensajes de texto, etc.) para comunicarse.\n\n                                            Syllabus\n                        La comunicación con los compañerosLa comunicación con los superioresLa comunicación con ejecutivosLa comunicación con los subordinados inmediatos\n                                    ", "end_date": "2015-11-27T00:00:00Z", "title": "La comunicación laboral en el siglo XXI ", "price": 0, "instructors": "Patricia  Bravo, MBA, SPHR ", "institution_name": ["University of California, Irvine"], "commitment": "", "subject_name": ["Personal Development"], "course_url": "https://www.coursera.org/learn/communication-in-the-workplacees", "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2015-10-30T00:00:00Z"}