{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Visual Arts\n                                                            \n                            \n                                                \n                    \n                    \n                    *Note - This is an Archived course*\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\nHow do we understand architecture? One way of answering this question is by looking through the lens of history. This course will examine architecture through time, beginning with First Societies and extending to the 15th century. Though the course is chronological, it is not intended as a linear narrative, but rather aims to provide a more global view, by focusing on different architectural \"moments.\" The lectures will give students the appropriate grounding for understanding a range of buildings and contexts. The material in the lectures will be supplemented by readings from the textbook A Global History of Architecture. Each lecture analyzes a particular architectural transformation arising from a dynamic cultural situation. How did the introduction of iron in the ninth century BCE impact regional politics and the development of architecture? How did new religious formations, such as Buddhism and Hinduism, produce new architectural understandings? What were the architectural consequences of the changing political landscape in northern Italy in the 14th century? How did rock-cut architecture move across space and time from West Asia to India to Africa? How did the emergence of corn impact the rise of religious and temple construction in Mexico? These are typical questions that the lectures will address.\n\nAll required readings are available within the courseware, courtesy of Wiley. Print or electronic versions of the A Global History of Architecture, Second Edition and Architecture of First Societies are also available for purchase.\n\nThe course is aimed for a general audience at the undergraduate level with an interest in history. All lectures will be in English.\n\nBefore your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\n                                    ", 
    "end_date": "2014-12-16T00:00:00Z", 
    "title": "4.605x: A Global History of Architecture — Part 1", 
    "price": 0, 
    "instructors": "Mark Jarzombek and Vikramāditya “Vikram” Prakāsh", 
    "institution_name": [
        "Massachusetts Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/global-history-architecture-part-1-mitx-4-605x", 
    "duration": "12 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-09-23T00:00:00Z"
}