{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    Course videos are presented in Mandarin with English subtitles.\n\nChina's architectural history spans thousands of years. In this course, we will explore the ancient cities of Chang'an of Han, Luoyang of Northern Wei, Chang'an and Luoyang of Sui and Tang, Kaifeng of Song and Dadu of Yuan, and delve into the history of the awe-inspiring ancient buildings that still grace the landscape of these bustling cities. The course will cover construction and aesthetics of these imperial palaces, religious structures, pagodas, tombs and gardens. We will study the basis of Chinese architecture, the wood framed building, as well as the brick and stone construction of many Buddhist pagodas and tombs. The course will culminate in an examination of the Summer Palace in Beijing, the ancient royal garden at the Chengde Mountain Resort, and the private gardens of the Ming and Qing dynasties. Two seminal textbooks on the Song and Qing dynasties are included in the course in electronic form.\n\n关于本课程\n\n数千年的中国历史上，曾出现了很多伟大的城市，汉长安、北魏洛阳、隋唐长安和洛阳、北宋开封、元大都，都是当时世界上最繁华的大都市。这些城市 虽已星光黯淡，却留下了一座座优美壮丽的建筑杰作，令人叹为观止。中国的宫殿、宗教建筑、佛塔、陵寝和园林等建筑类型，无论建造技术还是美学追求，都达到 了很高的水平。中国古代的建筑有着自成体系的一套营造方法，以木结构为主，也有不少砖石结构的佛塔和陵寝。北京颐和园、承德避暑山庄是古代皇家园林代表， 明清私家园林则是数千年中国园林艺术的结晶。宋《营造法式》和清《工部工程做法则例》是中国官式建筑两部重要文本，对于理解中国建筑有着重要的意义。课程 资料中也将包括这两部著作的电子版。\n\nBefore your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.\n\n                                    ", 
    "end_date": "2015-01-08T00:00:00Z", 
    "title": "80000901x: History of Chinese Architecture", 
    "price": 0, 
    "instructors": "Wang Guixiang and Lv Zhou", 
    "institution_name": [
        "Tsinghua University"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/history-chinese-architecture-tsinghuax-80000901x", 
    "duration": "15 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-09-25T00:00:00Z"
}