{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course. \n\nCourse videos are presented in Mandarin with English subtitles.\n\nIn 8000901-1X, History of Chinese Architecture: Part 1, we know the development of Chinese architecture from the remote antiquity to the Song, Liao and Jin dynasty. In Part 2 we’ll go on looking at Chinese architecture of the Yuan, Ming and Qing period. We’ll explore the city of Dadu of Yuan and Beijing of Ming and Qing, and delve into the history of the awe-inspiring ancient buildings that still grace the landscape of these bustling cities. The course will cover construction and aesthetics of these imperial palaces, religious structures, pagodas, tombs and gardens. The course will culminate in an examination of the Summer Palace in Beijing, the ancient royal garden at the Chengde Mountain Resort, and the private gardens of the Ming and Qing dynasties. Dwellings from various region and nationalities of China blossomed. The seminal textbook in the Qing dynasty will also be included in this course.\n\n在8000901_1X 中国建筑史（上）中，我们了解了从远古到两宋辽金的中国建筑发展历程。在下半讲中，我们将继续学习元明清时期的中国建筑。元大都和明清北京是当时世界上最繁华的大都市，也留下了一座座优美壮丽的建筑杰作，令人叹为观止。宫殿、宗教建筑、佛塔、陵寝和园林等建筑类型，无论建造技术还是美学追求，都达到了很高的水平。北京颐和园、承德避暑山庄是古代皇家园林代表，明清私家园林则是数千年中国园林艺术的结晶。各地的民居和少数民族建筑异彩纷呈。清《工程做法则例》是中国官式建筑的重要文本之一，对于理解中国建筑有着重要的意义。\n\n                                    ", 
    "end_date": "2014-05-02T00:00:00Z", 
    "title": "80000901_2x: History of Chinese Architecture: Part 2", 
    "price": 0, 
    "instructors": "Wang Guixiang", 
    "institution_name": [
        "Tsinghua University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/tsinghuax/tsinghuax-800009012x-history-chinese-1391", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-02-28T00:00:00Z"
}