{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    From place to space: To turn a place into a space. To see spaces like architects do.\r\nArchitecture 101\r\nTo learn more about architecture 101, we kindly invite you to read about it in the first part of the course description, here. Being this part 2 (from place to space), in order to understand the whole picture, it is better to start from part 1.\r\nArchitecture 101 (part 2: from place to space)\r\nIn part 1 of our course, we explore the state of nothingness and start moving towards the idea of “place”. In part 2, we deal with the concept of “place” and our conceptual journey goes on towards “space”.\r\nIn short:\r\npart 1: from nothingness to place part 2: from place to space part 3: from space to architecture\r\nPlaces to stay, to move, to eat, to cook, to love. Place to live. Place to die. Places for our bodies, places on our bodies.\r\nPlaces to clean and remember. We went all over the place... Different places for doing so many different things. Different places and different positions, all weaven to different states of mind.\r\nOf course, in this 6-month journey called “Architecture 101”, we expect the final output to be about making architecture. And it will be (part 3).\r\nBut as we said before: we cannot make architecture without understanding what space is, and we cannot sense any kind of space before knowing about “place”, and we cannot imagine any kind of place without getting into a mental and physical state of pure nothingness.\r\nSo now, how do we go from to place to space?\r\nAs John Cage told us in the first week of part 1, \"There is no such thing as an empty space or an empty time. There is always something to see, something to hear. In fact, try as we may to make a silence, we cannot.\"\r\n“In a small room one does not say what one would in a large room.” (Louis Kahn)\r\nWhat more could we add?\r\nIn this part of the course, we will understand what kind of matter surrounds us and how this matters to us. What matters? This is what we will need to find out.\r\nThen, we will try to define the boundaries of this matter at hand. Adding a new dimension to the whole thing, we will put ourselves into context. A physical and a mental context. All of this, using a “hands-on” system (you will learn by doing).\r\nCourse Structure\r\nWeek 1: taking measurements Week 2: proportions Week 3: technical drawing Week 4: papercut models Week 5: the history of place / the history of space Week 6: in a world of webzines Week 7: what is an “exam”? Week 8: what is a “break”?\r\nLearning Objectives\r\nWe will see spaces like architects do. We will explore the ways in which place becomes space. We will learn to measure and project ideas into a 3 dimensional way.\r\nWe will also learn a significative amount of extremely interesting (and totally useless) things.\r\nAll of the above refers to the conceptual part of our course. Then, since we love having our students making practical things, you will also learn lots of technical things using a number of interesting applications.\r\nWhat will I make?\r\nA scale model in a box (a box with a given proportion, size, appearance) in which you will represent a specific “space”. If one thousand people finish this part 3, we will have a fabulous collection of 1000 boxes. A cool exhibition is on its way. Makes sense, don’t you think?\r\nPrior knowledge\r\nThis is the 2nd part of a tripartite course called Architecture 101. To have followed the first part is highly recommended, however not required.\r\nThen, in terms of other kinds of prior knowledge, nothing in particular is required. However, in terms of technical equipment, this course will be easier to follow for those with access to a smartphone or tablet.\r\nYou don’t need a smartphone or tablet. But, as we wrote, we imagined a class with thousands of people lost in their phones, from all around the world. In commuters, we trust!\r\nWorkload\r\nBetween 3 and 7 hours a week. From Monday to Friday, for a total of 6 weeks, you will receive an email with a 15 second-video to watch (to get you in the mood), and a pdf with some instructions for completing an assignment and a series of references (to go deeper in the subject at hand).\r\nThen, you will get to work on your assignment. Once you complete your assignment, you will upload it to the iversity platform and share it on your preferred social media account(s). Ideally Instagram.\r\nThen, during the weekend, we will give you some time to catch up.\r\nAre you ready?\n\n                                    ", 
    "end_date": "2014-04-13T00:00:00Z", 
    "title": "Architecture 101 - Part II: From Place to Space", 
    "price": 0, 
    "instructors": "Petronela Nita, Anne-Sophie Gauvin and Stefano Mirti", 
    "institution_name": [], 
    "commitment": "3-7 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://iversity.org/en/courses/architecture-101-part-ii", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2014-03-02T00:00:00Z"
}