{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    Have you ever wanted to understand contemporary art, but weren’t sure how to go about it? Well, this course will give you the tools you need to understand ANY contemporary work of art, no matter how obscure or difficult it seems. From Pop Art to today’s museum installations, from Andy Warhol to Damien Hirst, this course will cover that past five decades of the main developments in art history. It will take you close in, and close up to the works of the most famous, and famously difficult, artists of the past five decades. By taking you on a guided tour of the works of contemporary art’s most important artists, you will develop the skills to recognize and appreciate this art’s major protagonists. Artists covered, week by week, will include Jackson Pollock, Mark Rothko, Andy Warhol, Jean-Michel Basquiat, Franics Bacon, Joseph Beuys, Gerhard Richter, Odd Nerdrum, Anselm Kiefer, Damien Hirst, Anish Kapoor, Jannis Kounellis, and Christian Boltanski. The detailed discussions of their works, in jargon free and comprehensible language, will enable you to understand the significance of contemporary art as a whole.\r\nLEARNING OUTCOMES\r\nThe student will come to have a grasp of the main developments of contemporary art and will be conversant with its vocabulary and ideas. He or she will be able to recognize the main thematic debates of this art and be conversant with them.\n\n                                            Syllabus\n                        Week One: Introduction and Abstract Expressionism: Marcel Duchamp, Jackson Pollock and Mark Rothko\r\nWeek Two: Pop Art: Andy Warhol, Paul Thek and Jean-Michel Basquiat\r\nWeek Three: Postwar German Art Part 1: Joseph Beuys and Odd Nerdrum\r\nWeek Four: Postwar German Art Part 2: Gerhard Richter and Anselm Kiefer\r\nWeek Five: The Postwar Art of Rome and Paris: Jannis Kounellis and Christian Boltanski\r\nWeek Six: Postwar British Art: Francis Bacon, Damien Hirst and Anish Kapoor\r\nWeek Seven: Land Art: James Turrell and Andy Goldsworthy\r\nWeek Eight: Media Old and New: Susan Rothenberg and Bill Viola\n                                    ", 
    "end_date": "2014-12-01T00:00:00Z", 
    "title": "Art201: Understanding Contemporary Art", 
    "price": 0, 
    "instructors": "John David Ebert", 
    "institution_name": [
        "Open Online Academy, New York"
    ], 
    "commitment": "1 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.ooed.org/learn/understanding-contemporary-art-fall-2014", 
    "duration": "9 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "EdCast"
    ], 
    "start_date": "2014-09-29T00:00:00Z"
}