{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    How can we understand museums today? Who are museums for and why are they working to engage new audiences? How do we respond emotionally to museum objects and spaces? And how can museums play a role in the pursuit of social justice, human rights, or health and wellbeing?\n\nLearn how modern museums impact our world\n\nIn this this free online course, you will explore all of these topics through a range of inspirational case studies and thought-provoking ideas. These show how modern museums seek to impact our contemporary world.\n\nThroughout, you will be encouraged to share your thoughts and contribute to these key questions from your own perspective.\n\nMeet museum studies researchers and professionals\n\nThe course has been created by leading academic researchers and museum professionals in the field of museum studies. It is a collaboration between the School of Museum Studies at the University of Leicester and National Museums Liverpool.\n\nThe University of Leicester has played a key role in the development of the field of museum studies over the last 50 years and is home to an amazing body of world-leading research and a site for inspirational teaching.\n\nNational Museums Liverpool is one of the UK’s leading museum services, where you can see first-hand how museum professionals today imagine and make the modern, 21st century museum.\n\nPhoto image © Ben Kirkpatrick\n\n\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Behind the Scenes at the 21st Century Museum", 
    "price": 0, 
    "instructors": "Suzanne MacLeod", 
    "institution_name": [
        "University of Leicester"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "http://www.futurelearn.com/courses/museum?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}