{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    On November 9, 2013 the devastating typhoon Haiyan hit the Phillipines, causing more than 5,000 deaths and destroying the homes and cities for millions. Natural disasters are happening more and more often due to climate change. We can’t do much to stop them, but as architects we can help with the recovery and to build shelters that would withstand them.\r\nThe goal of this online course is to generate design ideas for resilient schools for the victims of Typhoon Haiyan and other natural disasters. The participants in this course will design schools, which could be implemented by the Department of Education and Architecture for Humanity in the Philippines. We will engage with a team of architects, planners, engineers, and social workers. After the course, the projects and instructions will be placed on the open source platform Open Online Architecture (OOArch.org), so anyone can download and use them.\r\nAn international jury will select the best projects, which will eventually be built. We’ll have weekly lectures and daily discussions on our forum. A team of professors, consultants, and teaching assistants led by Prof. Ivan Shumkov will guide and assist all students in their work.\r\nLearning Outcomes\r\nStudents will learn about resilient architeture and how it can be used in communities in need. They will improve their design and collaboration skills. During the second week of the course, each student will design individual proposals and post them on the forum. All students will be publish their design proposals and ask others for feedback and help on their projects. They will form collaboration teams, which will work together on developing integral projects that include aspects of architectural design, engineering, social space, community development, economical feasibility, sustainability and resilience.\r\nWorkload\r\nThe involvement in the course is flexible. For architects, this is meant to be an intensive design studio course, so participants are expected to dedicate 10-20 hours a week. For others, who act as advisors and collaborators, it could take 2-5 hours of work weekly.\r\nCourse Format\r\nThe course will be organized similar to a competition for design ideas, but will encourage collaborations and teamwork. We will use peer-to-peer review as a way to exchange feedback. We will also have a course forum and team groups on Google+ where students will exchange and discuss design ideas. During the course, the projects will be developed to the phase of schematic design. At the end of the course, the 5-10 best proposals will be selected and further developed with the guidance of the course professor, consultants, and the local authorities. Some of the proposals will eventually be build if funding and local support are secured.\r\nPrior Knowledge\r\nPrevious experience in design is recommended, but there will be opportunities for others to participate. The course work will be collaboration between people from many different backgrounds: design, engineering, economics, healthcare, social studies. They will share and exchange their knowledge, skills and energy to design solutions that are resilient, feasible, sustainable, buildable, etc.\r\nCourse Certification\r\nAfter completing the course assignments, students will receive a letter of participation according to their role and degree of involvement: architect, designer, project manager, engineer, consultant, advisor, economist, communications, etc. Students who submit the final Resilient School project will be eligible for the official certificate of successful completion of the course.\n\n                                            Syllabus\n                        Week 1: Welcome and IntroductionWeek 2: Schools and Resilient ArchitectureWeek 3: Classroom Unit DesignWeek 4: Aggregation and Site DesignWeek 5: Resilient School DesignWeek 6: Design Submission and Feedback\n                                    ", 
    "end_date": "2014-02-18T00:00:00Z", 
    "title": "Designing Resilient Schools", 
    "price": 0, 
    "instructors": "Illac Angelo Diaz and Ivan Shumkov", 
    "institution_name": [
        "Open Online Academy, New York"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://iversity.org/courses/designing-resilient-schools", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2014-01-14T00:00:00Z"
}