{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    What is the course about? What are Digital Arts? Questions to the digital.Digital Arts focus on art that engages with, uses and is impacted by the digital. This course doesn’t focus on technology but presents it as a tool to facilitate ideas, placing emphasis upon its creative and artistic use. The program encourages students to explore the possibilities and potential of technologies within an art context. It offers the opportunity to develop a project from proposal to final exhibition. You will be asked to research content, materials and methods. Written work and practical work in the course combine as an investigation of the relationship to the subject and contemporary practice.Let's understand Digital Arts together by exploring the topics above as well as experiencing interviews and art works from well-known artists.\n\n                                            Syllabus\n                        Chapter 1: (2 November - 8 November)This chapter is an introduction to video art, performance art and photography. The starting point is: what is life? The motivation of creativity.We are investigating each medium from its beginning through history to the present day, dissecting it to its components. What is the main motivation for artists? What message does the work communicate? What kind of shapes or forms can you find? What is the medium of the work?Homework:Art example in Second Life (virtual world), Video art presentationChapter 2: (9 November - 15 November)What is life? Life and beauty: The work and concepts of contemporary photographic and video artists.Starting from a philosophical viewpoint we examine the approaches on life, beauty and art illustrating our argument with various examples.Homework:Artistic work will be analysed from the perspective of motivation and the outcome of the work. What message does the work communicate? What kind of shapes or forms can you find? What is the medium of the work?Chapter 3: (16 November - 22 November)What is life? Life and death: To understand and articulate how meaning of images is visually communicated. In this chapter we look into life, death and trauma. These moments in everybody’s life give cause to artists to delve into the core of human existence and wonder about the human condition.Homework:Artistic work will be analysed from the perspective of motivation and the outcome of the work. What message does the work communicate? What kind of shapes or forms can you find? What is the medium of the work?Chapter 4: (23 November - 29 November)What is life? Life and documentation: The “language” of creative expression and how this can improve your own artistic work. The boundaries of artistic expression are not confined in the studio or art gallery. Artists document life performed in its natural state and how people interact with their environment.Homework:Video presentation - Artistic work will be analysed from the perspective of motivation and the outcome of the work. What message does the work communicate? What kind of shapes or forms can you find? What is the medium of the work?Chapter 5: (30 November - 6 December)What is life? Life and Eros: The ability to identify and explain the basic visual and conceptual elements that are common to all works of art.Many say that love is the motivating force of life. In worldwide mythology love and lust are responsible for cosmogonic events such as the birth of heroes and the beginning of wars among other circumstances. Art inspired by mythology, cinema or real (or virtual) life is a staple theme motivating artists since antiquity.Homework:Artistic work will be analysed from the perspective of motivation and the outcome of the work. What message does the work communicate? What kind of shapes or forms can you find? What is the medium of the work?Chapter 6: (7 December - 13 December)What is life? Life and memory: The key contemporary photographic and video-film narratives.Memories are a key component of who we are. Its subjective and fragmentary nature forms our personality. It is a matter of philosophical debate since ancient times. Through art we record and preserve and try to dominate its fleeting state.Homework:(Plus exercises) Artistic work will be analyzed from the perspective of motivation and the outcome of the work.What message does the work communicate? What kind of shapes or forms can you find? What is the medium of the work?Chapter 7: (14 December - 20 December)What is life? Celebrating life: An understanding of the history of video art and the impact of video on contemporary culture.In this chapter, we recap on what we have discussed in the previous chapters. Life isn’t just one thing. It is beauty and death, love and memories. Here we celebrate the multifaceted thing that is life.XMAS BREAKFinal chapter 8: Final show\n                                    ", 
    "end_date": "2015-12-28T00:00:00Z", 
    "title": "Digital Arts", 
    "price": 0, 
    "instructors": "Angelina Voskopoulou", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://iversity.org/en/courses/digital-arts", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2015-11-02T00:00:00Z"
}