{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    How do we deal with the challenges and threats to vernacular architecture and make sure that it is sustained in this modern urbanized world? This is the key question we will try to answer in this course.\n\nThis architecture course takes you on a journey of understanding and appreciating the value of our everyday built environment. In the first two modules, we will explore the deeper socio-cultural meaning of rural vernacular architecture and look at the urban vernacular and challenges of people migrating from villages to live in cities; in module 3, we will focus on what we call ‘informal settlements’ in Asian cities; and in the final two modules, we will explore answers to a few questions that are very relevant to the current status and future development of vernacular architecture, such as:\n\nHow can we conserve and sustain our vernacular cultural heritage?\n\tHow can we reconcile tradition with modernity and originality?\nWe will also cast our eyes into the future, and discuss how the field of vernacular architecture might evolve and develop in the years to come.\n\nUltimately, the goal of this 5-week course is to help you establish your own viewpoints about the more complex or even contradictory issues in vernacular architecture, so you can make informed decisions regarding the protection and conservation of your local vernacular environments.\n\nSpecial note: This course can be taken independently from The Search of Vernacular Architecture of Asia, Part 1.\n\n                                    ", 
    "end_date": "2016-08-30T00:00:00Z", 
    "title": "HKU02.2x: The Search for Vernacular Architecture of Asia, Part 2", 
    "price": 0, 
    "instructors": "David P. Y. Lung and Howard Davis", 
    "institution_name": [
        "The University of Hong Kong"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/search-vernacular-architecture-asia-part-hkux-hku02-2x", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-07-26T00:00:00Z"
}