{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    If you are unable to access Youtube, the introductory video is available via XuetangX.  Connect with the course team and fellow learners on Facebook at https://www.facebook.com/HKUxArchitecture\n\nThis 5-week introductory course is for those who would like to explore and be fascinated by vernacular architecture – the subject and study of everyday buildings, landscapes and sites which are not designed by professional architects but “ordinary” practitioners. It explores vernacular architecture as an expression of local identity, indigenous traditions, and assimilation of different cultures.\n\nThis course covers topics such as native building materials, the interaction between people, culture and the vernacular, as well as the vernacular landscape. It has a special emphasis on the built heritage of Asia, which allows students to take a closer look at examples in diverse locales, such as the leather yurts in Mongolia, timber houses in Japan, brick, mud and straw houses in India, reinforced concrete fortified towers and grey brick courtyard houses in Southern China including Macau and Hong Kong.\n\nDesigned to promote discussion and dialogue while contributing to the discourse surrounding the concept of the vernacular, this course challenges the perception of tradition and stimulates a deeper analysis of one’s local environment. Indeed, we are keen to hear about how you link your new understanding to vernacular architecture in your neighborhood.\n\nThose who wish to extend their experience and exploration please also join our subsequent 5-week course The Search for Vernacular Architecture of Asia, Part 2 in Summer 2015.\n\n                                    ", 
    "end_date": "2015-05-19T00:00:00Z", 
    "title": "HKU02.1x: The Search for Vernacular Architecture of Asia, Part 1", 
    "price": 0, 
    "instructors": "David P. Y. Lung", 
    "institution_name": [
        "The University of Hong Kong"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/search-vernacular-architecture-asia-part-hkux-hku02-1x", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-04-14T00:00:00Z"
}