{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    Todas las imágenes, también las generadas más recientemente por la cultura popular y por los medios de masas, tienen una historia con antecedentes más o menos lejanos en el tiempo. Son imágenes simbólicas herederas de tradiciones iconográficas que conviene conocer para sacar el máximo provecho tanto de la experiencia personal de espectador (saber mirar) como a la aplicación de esa experiencia creativa al terreno profesional en los diferentes ámbitos del trabajo creativo. Este curso online fortalece todo tipo de oficios vinculados con la comunicación (periodística, publicitaria o audiovisual) o con el diseño gráfico y ambiental (arquitectura, ingeniería, artes, etc.).La cultura moderna (o posmoderna) se caracteriza por el dominio creciente de lo visual en todos los ámbitos de la vida cotidiana. Aunque la influencia en las mentalidades no es tanta como les gustaría a políticos, empresarios y publicistas, no cabe duda de que los nuevos medios son el vehículo de transmisión de valores, modos y costumbres más importante de nuestro tiempo. Los nuevos soportes (fotografía, cine, Tv, vídeo, cómic, grafitti, internet) y nuevos géneros (infografía, diseño gráfico, moda, publicidad, performance, net.art, etc..) han ido relegando a un segundo plano los lenguajes tradicionales de creatividad (pintura, escultura, arquitectura, artes decorativas, etc.), que imitan estos nuevos cauces de comunicación, en vez de alimentarlos en forma y contenido, como ocurría al principio.Pero el bombardeo de imágenes con mensaje al que estamos sometidos cada día a través de los Mass Media, puede hacernos olvidar que este lenguaje visual también tiene sus códigos, que se han ido elaborando en el tiempo, con raíces históricas vinculadas con el arte y la sabiduría universales. Aunque la cultura visual excede con creces el campo artístico para ocuparse de otros ámbitos sociales, culturales, económicos, políticos o de la historia de las mentalidades, sigue siendo muy útil apoyarse en la historia del arte para introducirse en este mar sin orillas de la Cultura Visual contemporánea. Esta asignatura permite que, una vez adquiridos los conocimientos básicos de arte y cultura de la imagen, el alumno pueda reconocer los estereotipos visuales dominantes en nuestra sociedad global, en todos los formatos visuales hoy dominantes.\n\n                                    ", 
    "end_date": "2015-10-06T00:00:00Z", 
    "title": "Introdución a la Cultura Visual: los fundamentos artísticos", 
    "price": 0, 
    "instructors": "Jorge Latorre", 
    "institution_name": [
        "Open Online Academy, New York"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.ooed.org/learn/introducion-a-la-cultura-visual-los-fundamentos-artisticos-fall-2015", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "EdCast"
    ], 
    "start_date": "2015-09-01T00:00:00Z"
}