{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    Although taking, sharing, and viewing photographs has become second nature for many of us, our regular engagement with images does not necessarily make us visually literate. This course aims to address the gap between seeing and truly understanding photographs by introducing a diversity of ideas, approaches, and technologies that inform their making. In this course you will look closely at photographs from the collection of The Museum of Modern Art and hear a variety of perspectives on what a photograph is and the ways that photography has been used throughout its nearly 180 year history: as a means of artistic expression, as a tool for science and exploration; as an instrument of documentation; to tell stories and record histories; and as a mode of communication and critique in our ever increasingly visual culture.\n\n                                            Syllabus\n                        Introduction to Seeing Through Photographs“Photography is a foreign language everyone thinks he speaks.” -- Philip-Lorca di CorciaOne Subject, Many PerspectivesDiscover photography's roots in both art and science by observing the diverse ways the medium has been used across time to capture a single subject familiar to us all. Documentary PhotographyExplore a variety of approaches to documentary photography, from those that aim to produce objective records to those that critique the reliability of photographs as evidence.Pictures of PeopleExamine pictures of people—as individuals or as representatives of a type, posed or captured unaware—and discover how the choices made by both photographer and subject inform our assumptions about those depicted.Constructing Narratives &amp; Challenging HistoriesLearn to look critically at the way photographs have been used to construct narratives that shape our understanding of ourselves and the world around us.Ocean of Images: Photography &amp; Contemporary CultureMany artists are turning to our image-saturated world as both a source for and subject of their work. Explore how they examine—and frequently disrupt—current methods of image production, presentation, and circulation.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Seeing Through Photographs", 
    "price": 0, 
    "instructors": "Sarah Meister", 
    "institution_name": [
        "The Museum of Modern Art"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/photography", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}