{
    "selfpaced": false, 
    "topic_name": [
        "Visual Arts"
    ], 
    "description": "\n\n                    \n                    \n                    Are you curious how superheroes like Batman®, Superman®, Spider-Man®, and The Avengers® became global cultural phenomena appearing in multi-million dollar movies? This course will help you answer that question and improve your understanding of comics as culture.\n\nSuperman &amp; Batman are Trademarks of DC Comics.\nSpider-Man &amp; The Avengers are Trademarks of Marvel Comics.\n\n                                            Syllabus\n                        The Origins of SuperheroesWelcome to Superhero Entertainment. This is the first module. We will begin with the development of comic strips where we will look at the character, The Yellow Kid. Then we will learn about why pulps and science fiction magazines are important to the development of comic books. In the last lecture, we will look at the development of comic books in the USA and differentiate a medium from a genre. Please fill in the pre-course survey so that we can learn more about you. Thank you!The Original SuperheroesWelcome to module 2, The Original Superheroes. We will begin by looking at the origins of comic book superheroes. In the second lecture we will look at how World War II moved comic book superheroes to the center of American culture and made them symbols of patriotism and the American way. In the last lesson, we will see how the end of WWII and anti-comic book campaigns in the 1950s impacted superhero comics.You will also have your first quiz in this module. Good luck!Superheroes Across Mediums (1938 - 1958)Welcome to module 3, Superheroes Across Mediums (1938 - 1958). We will begin by looking at the the spread of superheroes from comic books to comic strips and radio serials. Then we will look at how these superheroes spread to movie serials as well as animation. Lastly, we'll look at how comic book superheroes moved to television, with a particular focus on Superman.Superhero Resurgence (1956 - 1986)Welcome to module 4, Superhero Resurgence (1956 - 1986). We will first begin by covering the concept of reconceptualization or rebooting of comic book superheroes. Then we will look at Marvel’s contribution to the rebirth of superhero comic books. We'll also look at the period of comic book superheroes that is often called Superheroes Plus and the importance of this concept for the development of superhero entertainments. Lastly, we'll look at the period of comic book superheroes that in many ways was a high point of the superhero genre. Here we will mostly look at 1986 and a number of comics published that year including The Dark Knight Returns and Watchmen. You will have your second quiz in this module. Good luck!Superheroes On Screen: DC Characters in TV and MoviesWelcome to module 5, Superheroes On Screen: DC Characters in TV and Movies. There are 7 lectures in this module where we will look at the different superheroes that made it to TV and cinema. We will look at the Batman TV series, Superman the movie, the Wonder Woman TV series, Tim Burton's Batman, The Flash TV series in the 1990s, the Lois and Clark TV series, and lastly the Smallville TV series.Making Movies the Marvel WayWelcome to module 6, Making Movies the Marvel Way. We will begin by looking at Blade and see how this movie shaped Marvel's movie making. Then we will look at the place of the X-Men, Spider-Man, the Fantastic Four, Iron Man, Thor, Captain America, and The Avengers movies in reshaping and positioning Marvel as a blockbuster feature film studio. At the end of this module you will have your third quiz and you can start working on your peer assessment essay. Good luck on both!Authors and AudiencesWelcome to module 7, Authors and Audiences. We will begin by looking at the authorship of Superman and Batman and why DC owns the rights to the characters. Then we will look at the authorship of Marvel's major characters. In the last lecture, we will look at the audience for superheroes, particularly the composition of the audience and the ways audiences engage with superheroes.Comedy, Satires, and Send-UpsWelcome to module 8, Comedy, Satires, and Send-Ups. This is the last module for this course. Congratulation on making it this far. We will begin by looking at the forgotten comic elements in early superheroes. Then we will look at the ridiculousness of superheroes and how easy it is to poke fun at superheroes. You will have your last quiz in this module. Good luck! Please also complete the post-course survey to let us know about your experience in this course.\nThank you.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Superhero Entertainments", 
    "price": 0, 
    "instructors": "Ian Gordon", 
    "institution_name": [
        "National University of Singapore"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/superhero", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-16T00:00:00Z"
}