{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    Data is everywhere and can be obtained from many different sources. Digital data can be obtained from social media, images, audio recordings and sensors, and electronic data is quite often available as real-time data streams.\n\nMany of these datasets have the potential to provide solutions to important problems, and advice in making decisions in health, science, sociology, engineering, business, information technology, and government.\n\nHowever, the size, complexity, quality and diversity of these datasets often make them difficult to process and analyse using standard statistical methods, software or equipment.\n\nTake a unique, multi-faceted approach to big data\n\nFor this reason, we use new technological or methodological solutions. Join us for this free online course and we’ll share these with you using our unique, multi-faceted approach to big data. We’ll show you how you can meet the demand for analytics in your field.\n\nAfter a brief introduction to big data and an overview of some of the statistical and mathematical approaches for analysing it, we’ll explore real-world case studies. These will demonstrate the power of big data and, most importantly, the process of getting from data to decisions.\n\nThen we’ll give you an overview of some of the tools you can use for storing and managing large datasets.\n\nContinue learning with the Big Data Analytics program\n\nThis course is one of four in the Big Data Analytics program on FutureLearn from the ARC Centre of Excellence for Mathematical and Statistical Frontiers at Queensland University of Technology (QUT).\n\nThe program enables you to understand how big data is collected and managed, before exploring statistical inference, machine learning, mathematical modelling and data visualisation.\n\nWhen you complete all four courses and buy a Certificate of Achievement for each, you will earn a FutureLearn Award as proof of completing the program of study.\n\n\n                                    ", 
    "end_date": "2016-08-22T00:00:00Z", 
    "title": "Big Data: from Data to Decisions", 
    "price": 0, 
    "instructors": "Tomasz Bednarz, Ian Turner and Kerrie Mengersen", 
    "institution_name": [
        "Queensland University of Technology"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/big-data-decisions?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-08-08T00:00:00Z"
}