{
    "selfpaced": true, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    The amount of data generated by the information society is growing day by day, and will continue to grow thanks to the explosion of social networks, the smarts cities, the big data, mobile devices, sensors, etc. This exponential increase in the volume of data that are generated makes it imperative the use of systems that are capable of analysing and turn them into useful information. For this reason, our society, our businesses and institutions need intelligence at the moment to integrate within their organizational processes and decision, and this involves integrating tools of business analytics or smart data. This course provides an introduction to these tools of business intelligence, the associated main methodologies and current trends within this area.\n\n                                            Syllabus\n                        1.  Introduction to the system of Business Intelligence (BI)BI introduction to the system of BI. Levels of analytics in the company.  Lifespan of information.  Management of BI projects.  BI market trends.2.  Architecture of BI systemsCorporate information and Data Warehouse.  Process ETL. Metadata. Multidimensional design. OLAP.  Control tables. 3.  Business Analytics: ClusteringIntroduction to business analytics.  Hierarchical clustering.  Non-hierarchic clustering: k-means algorithm.  4.  Business Analytics: ClassificationIntroduction to classification problems.  Decision trees.  Support Vector Machines (SVM).5.  Trends in BIOpen Source BI. Big Data systems.  Social BI systems, Geographic BI systems. Customer Experience.\n                                    ", 
    "end_date": "2016-01-05T00:00:00Z", 
    "title": "Business Intelligence", 
    "price": 0, 
    "instructors": "David Masip", 
    "institution_name": [
        "Universitat Oberta de Catalunya"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "http://platform.europeanmoocs.eu/course_business_intelligence", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "EMMA"
    ], 
    "start_date": "2015-12-01T00:00:00Z"
}