{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    You have probably heard that this is the era of “Big Data”. Stories about\n    companies or scientists using data to recommend movies, discover who is\n    pregnant based on credit card receipts, or confirm the existence of the\n    Higgs Boson regularly appear in Forbes, the Economist, the Wall Street\n    Journal, and The New York Times. But how does one turn data into this type\n    of insight? The answer is data analysis and applied statistics. Data analysis\n    is the process of finding the right data to answer your question, understanding\n    the processes underlying the data, discovering the important patterns in\n    the data, and then communicating your results to have the biggest possible\n    impact. There is a critical shortage of people with these skills in the\n    workforce, which is why Hal Varian (Chief Economist at Google) says that\n    being a statistician will be the sexy job for the next 10 years.\n    \n    This course is an applied statistics course focusing on data analysis.\n    The course will begin with an overview of how to organize, perform, and\n    write-up data analyses. Then we will cover some of the most popular and\n    widely used statistical methods like linear regression, principal components\n    analysis, cross-validation, and p-values. Instead of focusing on mathematical\n    details, the lectures will be designed to help you apply these techniques\n    to real data using the R statistical programming language, interpret the\n    results, and diagnose potential problems in your analysis. You will also\n    have the opportunity to critique and assist your fellow classmates with\n    their data analyses.\n\n                                    ", 
    "end_date": "2013-12-23T00:00:00Z", 
    "title": "Data Analysis", 
    "price": 0, 
    "instructors": "Jeff Leek", 
    "institution_name": [
        "Johns Hopkins University"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/course/dataanalysis", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2013-10-28T00:00:00Z"
}