{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, you will develop and test hypotheses about your data. You will learn a variety of statistical tests, as well as strategies to know how to apply the appropriate one to your specific data and question. Using your choice of two powerful statistical software packages (SAS or Python), you will explore ANOVA, Chi-Square, and Pearson correlation analysis. This course will guide you through basic statistical principles to give you the tools to answer questions you have developed. Throughout the course, you will share your progress with others to gain valuable feedback and provide insight to other learners about their work.\n\n                                            Syllabus\n                        Hypothesis Testing and ANOVAThis session starts where the Data Management and Visualization course left off. Now that you have selected a data set and research question, managed your variables of interest and visualized their relationship graphically, we are ready to test those relationships statistically. The first group of videos describe the process of hypothesis testing which you will use throughout this course to test relationships between different kinds of variables (quantitative and categorical). Next, we show you how to test hypotheses in the context of Analysis of Variance (when you have one quantitative variable and one categorical variable). Your task will be to write a program that manages any additional variables you may need and runs and interprets an Analysis of Variance test. Note that if your research question does not include one quantitative variable, you can use one from your data set just to get some practice with the tool. If your research question does not include a categorical variable, you can categorize one that is quantitative.Chi Square Test of IndependenceThis session shows you how to test hypotheses in the context of a Chi-Square Test of Independence (when you have two categorical variables). Your task will be to write a program that manages any additional variables you may need and runs and interprets a Chi-Square Test of Independence. Note that if your research question only includes quantitative variables, you can categorize those just to get some practice with the tool. Pearson CorrelationThis session shows you how to test hypotheses in the context of a Pearson Correlation (when you have two quantitative variables). Your task will be to write a program that manages any additional variables you may need and runs and interprets a correlation coefficient. Note that if your research question only includes categorical variables, you can choose other variables from your data set just to get some practice with the tool. Exploring Statistical InteractionsIn this session, we will discuss the basic concept of statistical interaction (also known as moderation). In statistics, moderation occurs when the relationship between two variables depends on a third variable. The effect of a moderating variable is often characterized statistically as an interaction; that is, a third variable that affects the direction and/or strength of the relation between your explanatory (X) and response (Y) variable. Your task will be to test your own research question in the context of one or more potential moderating variables. \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Data Analysis Tools", 
    "price": 0, 
    "instructors": "Jen Rose", 
    "institution_name": [
        "Wesleyan University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/data-analysis-tools", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}