{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    Whether being used to customize advertising to millions of website visitors or streamline inventory ordering at a small restaurant, data is becoming more integral to success. Too often, we’re not sure how use data to find answers to the questions that will make us more successful in what we do. In this course, you will discover what data is and think about what questions you have that can be answered by the data – even if you’ve never thought about data before. Based on existing data, you will learn to develop a research question, describe the variables and their relationships, calculate basic statistics, and present your results clearly. By the end of the course, you will be able to use powerful data analysis tools – either SAS or Python – to manage and visualize your data, including how to deal with missing data, variable groups, and graphs. Throughout the course, you will share your progress with others to gain valuable feedback, while also learning how your peers use data to answer their own questions.\n\n                                            Syllabus\n                        Selecting a research questionWe would like to welcome you to Wesleyan University's Data Analysis and Interpretation Specialization. In this session, we will discuss the basics of data analysis. Your task will be to select a data set that you would like to work with and to review available code books that help you develop your own research question. You will also set up a Tumblr blog that will allow you to reflect on these experiences, submit assignments and share your work with others throughout the course. First, you may want to check out the welcome videoWriting your first program - SAS or PythonIn this session, we will discuss how to write a basic program that allows you to load a data set and examine frequency distributions. Your task will be to write a program that helps you to explore the variables you have selected for your own research question. You may choose either Python or SAS. Both are made freely available, and we have created a helpful guide to support you in making the decision. Once you have selected your platform, just follow the instructions in the appropriate \"GETTING STARTED....\" file, and then check out this week's video lessons aimed at helping you write and run your first program. You need only view the lessons for one of the statistical platforms (SAS or Python).\nManaging DataIn this session, we will help you to make and implement even more decisions with data. Statisticians often call this task 'data management', while computer scientists like the term 'data munging'. Whatever you call it, it is a vital and ongoing process when working with data. Your task will be to write a program that manages the variables you have selected for your own research question. Visualizing DataIn this session we will discuss descriptive statistics and get you visualizing your newly data managed variables individually and as graphs showing the relationships between them.  Supplemental Materials (All Weeks)\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Data Management and Visualization", 
    "price": 0, 
    "instructors": "Lisa Dierker and Jen Rose", 
    "institution_name": [
        "Wesleyan University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/data-visualization", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}