{
    "selfpaced": true, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    EX101x is for all of those struggling with data analysis. That crazy data collection from your boss? Megabytes of sensor data to analyze? Looking for a smart way visualize your data in order to make sense out of it? We’ve got you covered!\n\nUsing video lectures and hands-on exercises, we will teach you cutting-edge techniques and best practices that will boost your data analysis and visualization skills.\n\nWe will take a deep dive into data analysis with spreadsheets: PivotTables, VLOOKUPS, Named ranges, what-if analyses, making great graphs - all those will be covered in the first weeks of the course. After that, we will investigate the quality of the spreadsheet model, and especially how to make sure your spreadsheet remains error-free and robust.\n\nFinally, once we have mastered spreadsheets, we will demonstrate other ways to store and analyze data. We will also look into how Python, a programming language, can help us with analyzing and manipulating data in spreadsheets.\n\nEX101x is created using Excel 2013 and Windows. Most assignments can be made using another spreadsheet program and operating system as well, but we cannot offer full support for all configurations.\n\nThe goal of this course is to help you to overcome data analysis challenges in your work, research or studies. Therefore we encourage you to participate actively and to raise real data analysis problems that you face in our discussion forums. \n\nThis course is part of the Data Analysis XSeries.\n\nLICENSEThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License.\n\n                                    ", 
    "end_date": "2015-10-27T00:00:00Z", 
    "title": "EX101x: Data Analysis: Take It to the MAX()", 
    "price": 0, 
    "instructors": "Felienne Hermans", 
    "institution_name": [
        "Delft University of Technology"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/data-analysis-take-it-max-delftx-ex101x-0", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-01T00:00:00Z"
}