{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    Struggling with data at work? Wasting valuable time working in multiple spreadsheets to gain an overview of your business? Find it hard to gain sharp insights from piles of data on your desktop?\n\nIf you are looking to enhance your efficiency in the office and improve your performance by making sense of data faster and smarter, then this advanced data analysis course is for you.\n\nIf you have already sharpened your spreadsheet skills in EX101x Data Analysis: Take It to the MAX(), this course will help you dig deeper. You will learn advanced techniques for robust data analysis in a business environment. This course covers the main tasks required from data analysts today, including importing, summarizing, interpreting, analyzing and visualizing data. It aims to equip you with the tools that will enable you to be an independent data analyst. Most techniques will be taught in Excel with add-ons and free tools available online. We encourage you to use your own data in this course but if not available, the course team can provide.\n\nThis course is part of the Data Analysis XSeries. \n\nLICENSE\n\nThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License.\n\n                                    ", 
    "end_date": "2016-06-15T00:00:00Z", 
    "title": "EX102x: Data Analysis: Visualization and Dashboard Design", 
    "price": 0, 
    "instructors": "Felienne Hermans", 
    "institution_name": [
        "Delft University of Technology"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/data-analysis-visualization-dashboard-delftx-ex102x", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-04-20T00:00:00Z"
}