{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    *********\nA new, improved version of the Big Data Specialization will become available on June 6! As such, enrollment for this course and all courses in this original Big Data Specialization will close on June 6. \n\nThe original Big Data Specialization will continue to run until September 2016, when the Capstone will be offered for learners in this version of the Specialization.\n\nIf you are in the middle of the Specialization and have purchased the entire original Big Data Specialization before June 6, Coursera will reach out to you to offer you the option of staying in the original Specialization or taking the new version. \n\nIf you are just getting started on this Specialization, we recommend that you wait until June 6 to enroll in the new version. \n\n*********\n\n\nThis course is for novice programmers or business people who'd like to understand more advanced tools used to wrangle and analyze big data. In this course you will be guided in basic approaches  to querying and exploring data using higher level tools built on top of a Hadoop Platform.   You will be walked through query interfaces, environments, and the canonical situations for tools like HBASE, HIVE, Pig, as well as more general tools like Spark-SQL.   After this course you will be able to identify the kinds of analysis you can get of big data and how to interpret these results.\n\n                                            Syllabus\n                        HBASE: Hadoop's databaseIn this Module we will talk about HBase - Hadoop’s database, a distributed, scalable, big data store. HIVE: a Hadoop-based data warehouseIn this Module we will learn about Hive, the data warehousing infrastructure based on Hadoop that facilitates querying and managing large datasets residing in distributed storage.PIG: A Dataflow Engine for HadoopWouldn’t it be nice if you could quickly gather/sample/view and perform simple analysis on HDFS data? Then PIG might fly for you!  This module will introduce the essential concepts and basic execution of PIG.Splunk: Log Analysis and MoreWelcome to the data analytics with Splunk module- this week, we’re going to go further in our quest to examine different ways and tools to deploy analytics on large dataset and gain valuable insight.Spark for AnalyticsWelcome to Spark for Analytics, this week we will learn about Spark SQL. Spark SQL provides a higher level interface to process your data and write more expressive code. We'll focus on data exploration, cleaning and plotting.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Introduction to Big Data Analytics", 
    "price": 0, 
    "instructors": "Paul Rodriguez, Andrea Zonca and Natasha Balac", 
    "institution_name": [
        "University of California, San Diego "
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/bigdata-analytics", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}