{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    Increasingly, we’re bombarded with all sorts of data about how society is changing: opinion poll trends; migration data; economic results; government debt levels; and MPs’ expenses claims.\n\nMore often than not, the data are presented to bolster a (sometimes contentious) claim, so the ability to read such information with confidence is an increasingly important skill for both modern citizens and those studying the social sciences.\n\nWhat do social statistics and economic data really reveal?\n\nIn this free online course, we’ll look at ways of cutting through the confusion to decide what numbers reveal, and when and why they (sometimes deliberately) mislead. We’ll ask:\n\n\n  How do we make sense of all these numbers?\n  How can we decide which ones to trust and which to doubt?\n  And how do we know which might reveal important trends and which are less dramatic than they sound?\n\n\nBy the end of the course, you will have improved your data literacy skills; developed an understanding of how social statistics are created and used; and become a more critical consumer and user of social and economic data.\n\nLearn with experts in quantitative social science\n\nThe course is led by a team of experts from The Sheffield Methods Institute at the University of Sheffield - one of 15 centres charged by the Q-Step Programme with improving British social science undergraduates’ quantitative skills.\n\nBetween them, they have considerable expertise in the use and analysis of social data, and in teaching data literacy and analysis skills in an accessible, engaging yet rigorous way.\n\nYou can find out more about tricky data with this post on the FutureLearn blog from Dr Andrew Bell: Blue Monday and the problem of junk science.\n\n\n                                    ", 
    "end_date": "2016-02-29T00:00:00Z", 
    "title": "Making Sense of Data in the Media", 
    "price": 0, 
    "instructors": "Todd Hartman, Aneta Piekut Educator and Mark Taylor", 
    "institution_name": [
        "The University of Sheffield"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/media-data?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-02-08T00:00:00Z"
}