{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/mmds\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/mmds-003/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    mmds-001\n                                                                    mmds-002\n                                                                    mmds-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    We introduce the participant to modern distributed file systems and MapReduce, including what distinguishes good MapReduce algorithms from good algorithms in general.  The rest of the course is devoted to algorithms for extracting models and information from large datasets.  Participants will learn how Google's PageRank algorithm models importance of Web pages and some of the many extensions that have been used for a variety of purposes.  We'll cover locality-sensitive hashing, a bit of magic that allows you to find similar items in a set of items so large you cannot possibly compare each pair.  When data is stored as a very large, sparse matrix, dimensionality reduction is often a good way to model the data, but standard approaches do not scale well; we'll talk about efficient approaches.  Many other large-scale algorithms are covered as well, as outlined in the course syllabus.\n\n                                            Syllabus\n                        Week 1:\nMapReduce\nLink Analysis -- PageRank\nWeek 2:\nLocality-Sensitive Hashing -- Basics + Applications\nDistance Measures\nNearest Neighbors\nFrequent Itemsets\nWeek 3:\nData Stream Mining\nAnalysis of Large Graphs\nWeek 4:\nRecommender Systems\nDimensionality Reduction\nWeek 5:\nClustering\nComputational Advertising\nWeek 6:\nSupport-Vector Machines\nDecision Trees\nMapReduce Algorithms\nWeek 7:\nMore About Link Analysis --  Topic-specific PageRank, Link Spam.\nMore About Locality-Sensitive Hashing\n                                    ", 
    "end_date": "2015-10-31T00:00:00Z", 
    "title": "Mining Massive Datasets", 
    "price": 0, 
    "instructors": "Jure Leskovec, Anand Rajaraman, Jeff Ullman and ", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "8-10 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/course/mmds", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-09-12T00:00:00Z"
}