{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    Organizaciones tan diferentes como Amazon, Cemex o Costco utilizan el análisis de datos para una mejor toma de decisiones que les permita identificar a sus clientes más rentables, retener y contratar talento o bien optimizar sus cadenas de suministro. Lo cierto es que las organizaciones compiten ahora tomando decisiones basadas en la explotación de los datos y uso de métodos estadísticos. Sin embargo, la forma en que estos datos se obtienen, manipulan y utilizan, puede definir el fracaso o el éxito de estas organizaciones.\n\nEl primer paso antes de convertir estos datos en información que agregue valor a la organización es recolectar y limpiar dichos datos. En este curso podrás reconocer y recolectar los tipos de datos disponibles de manera estructurada y no estructurada en el mundo de negocios actual,  así como preparar, aplicar y limpiar estos datos para su posterior explotación. Adicionalmente, serás capaz de realizar una exploración de los datos que te permita elaborar un análisis preliminar del proceso de negocio bajo estudio.\n\nAl  terminar este curso habrás desarrollado la capacidad de comprender y aplicar de manera efectiva las metodologías y técnicas relacionadas con la recopilación de datos, utilizando un software de última generación, como el Watson Analytics.\n\nAgradecemos a Fundación Televisa por su participación en la producción de este curso; con lo cual colabora a inspirar y desarrollar el potencial de las personas, a través de su compromiso con la educación y la cultura.\n\n                                            Syllabus\n                        El reto de tomar mejores decisionesEn este módulo, comprende la parte teórica del curso, examinarás cómo en este nuevo entorno de negocios las organizaciones utilizan el análisis de datos para competir y obtener una ventaja competitiva. Identificarás los tipos de datos y sus características a efecto que reconozcas el nivel de madurez de la organización (con respecto al uso de datos).Recopilación de datosEn este módulo conocerás más sobre los datos y el valor de los mismos. Explorarás el uso de la  herramienta computacional de Watson Analytics para la recolección de datos que te permitirá importar datos estructurados y realizar un análisis descriptivo de los mismos.Un mundo de datos no ordenadosEn este módulo aprenderás el manejo de datos no estructurados utilizando la herramienta computacional Import-io para la lectura de datos de algún sitio web, así como la importación a Watson Analytics de datos de Twitter. Este módulo comprende la parte práctica del curso, por lo que al final del mismo deberás resolver un caso práctico utilizando las dos herramientas antes descritas.Exploración de datosAl finalizar este módulo serás capaz de explorar los datos  utilizando las capacidades de visualización de la herramienta Watson Analytics. De la misma manera, aprenderás a encontrar patrones y relaciones en los datos que representan respuestas a problemas de negocio.  \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Recolección y exploración de datos", 
    "price": 0, 
    "instructors": "Dr. Jorge Alonso Ramírez Medina ", 
    "institution_name": [
        "Tecnológico de Monterrey"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/ordenamiento-datos", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}