{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    This course will provide learners with an introduction to research data management and sharing. After completing this course, learners will understand the diversity of data and their management needs across the research data lifecycle, be able to identify the components of good data management plans, and be familiar with best practices for working with data including the organization, documentation, and storage and security of data. Learners will also understand the impetus and importance of archiving and sharing data as well as how to assess the trustworthiness of repositories. \n\nToday, an increasing number of funding agencies, journals, and other stakeholders are requiring data producers to share, archive, and plan for the management of their data. In order to respond to these requirements, researchers and information professionals will need the data management and curation knowledge and skills that support the long-term preservation, access, and reuse of data. Effectively managing data can also help optimize research outputs, increase the impact of research, and support open scientific inquiry. After completing this course, learners will be better equipped to manage data throughout the entire research data lifecycle from project planning to the end of the project when data ideally are shared and made available within a trustworthy repository.\n\nThis course was developed by the Curating Research Assets and Data Using Lifecycle Education (CRADLE) Project in collaboration with EDINA at the University of Edinburgh. \n\nThis course was made possible in part by the Institute of Museum and Library Services under award #RE-06-13-0052-13. The views, findings, conclusions or recommendations expressed in this Research Data Management and Sharing MOOC do not necessarily represent those of the Institute of Museum and Library Services.\n\nHashtag: #RDMSmooc\n\n                                            Syllabus\n                        Understanding Research DataThis week introduces multiple types of research data in an array of contexts as well as important data management concepts including metadata and the research data lifecycle. We will also define the concept of data management, identify the roles and responsibilities of key stakeholders, and examine various data management tasks throughout the research data lifecycle. Data Management PlanningThis week provides an overview of Data Management Plans (DMPs) including the components of good DMPs, the DMP policies of several funding agencies, and information on data management planning tools.  Working with DataThis week is brought to you by EDINA and the Data Library at the University of Edinburgh and is presented by Sarah Jones from the Digital Curation Centre. Sarah will introduce strategies for organizing research data including versioning and file naming conventions as well as data file formatting and transformations. She will also discuss why documenting data and data citation are important. Finally, she will present issues involved in storing, securing, and backing up research data.   Sharing DataThis week examines the benefits and challenges of sharing research data. We will also discuss how to protect confidentiality and how data ownership can affect data sharing. Finally, we will examine different types of access restrictions that may be placed on data as well as how to enable data sharing through the application of a standard license.Archiving DataDuring the final week of the course, we will examine the preservation needs of research data, introduce the concepts of authenticity and integrity, and identify the different types of metadata and their role in data discovery and reuse. We will also discuss the role of trustworthy repositories as well as how repositories demonstrate their trustworthiness through audit and certification. Finally, we will present key archival standards and best practices for ensuring data remains accessible and understandable for the long-term.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Research Data Management and Sharing", 
    "price": 0, 
    "instructors": "Helen Tibbo, Sarah Jones (Guest Instructor) and Cuna Ekmekcioglu", 
    "institution_name": [
        "The University of North Carolina at Chapel Hill", 
        "University of Edinburgh"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/data-management", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}