{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    Анализ данных и машинное обучение существенно опираются на результаты из математического анализа, линейной алгебры, методов оптимизации, теории вероятностей. Без фундаментальных знаний по этим наукам невозможно понимать, как устроены методы анализа данных. Данный курс направлен на то, чтобы сформировать этот фундамент. Мы обойдёмся без сложных формул и доказательств и сделаем упор на интерпретации и понимании смысла математических понятий и объектов. \n\nДля успешного применения методов анализа данных нужно уметь программировать. Фактическим стандартом для этого в наши дни является язык Python. В данном курсе мы предлагаем познакомиться с его синтаксисом, а также научиться работать с его основными библиотеками, полезными для анализа данных.\n\nВ этом курсе вы познакомитесь с фундаментальными математическими понятиями, необходимыми для анализа данных, и получите начальный навык программирования на Python. Курс состоит из двух больших частей. Первая часть курса – практическая, она посвящена языку программирования Python. Вы познакомитесь с синтаксисом и идеологией языка, научитесь писать простые программы. Также вы узнаете о библиотеках, которые часто применяются на практике для анализе данных, например, NumPy, SciPy, Matplotlib и Pandas. Вторая часть курса посвящена таким разделам математики как линейная алгебра, математический анализ, методы оптимизации и теория вероятностей. При этом, упор делается на разъяснение математических понятий и их применение на практике, а не на вывод сложных формул и доказательство теорем.\n\n                                            Syllabus\n                        ВведениеДобро пожаловать! На этой неделе мы начнём осваивать язык Python — один из главных инструментов специалиста в науке о данных, и вспомним кое-что о производных, которые активно используются при настройке моделей машинного обучения.Библиотеки Python и линейная алгебраНа этой неделе мы познакомимся с Python-библиотеками, содержащими большое количество полезных инструментов: от быстрых операций с многомерными массивами до визуализации и реализации различных математических методов. Кроме того, мы освоим линейную алгебру — основной математический аппарат для работы с данными: в большинстве задач данные можно представить в виде векторов или матриц.Оптимизация и матричные разложенияНа этой неделе мы научимся с помощью методов оптимизации находить наилучшие значения параметров системы, чтобы минимизировать затраты или максимизировать точность предсказаний, а также познакомимся с матричными разложениями, которые используются при построении регрессионных моделей, для уменьшения размерности данных, в рекомендательных системах и в анализе текстов. СлучайностьНа этой неделе мы освоим базовые концепции теории вероятностей и статистики, которые необходимы для понимания механизма работы практически всех методов анализа данных. Мы разберёмся с самыми популярными распределениями, узнаем, какие явления ими описываются и какими статистиками оцениваются их параметры, а также научимся строить доверительные интервалы.\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "Математика и Python для анализа данных", 
    "price": 0, 
    "instructors": "Евгений Соколов, Эмели Драль, Виктор Кантор and Евгений Рябенко", 
    "institution_name": [
        "Moscow Institute of Physics and Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/mathematics-and-python", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}