{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                    \n                    本课程是北京大学开设的一门在线跨学科选修课程，主要面向信息技术、社会学和经济学等专业的本科生。课程内容涉及用计算思维的方法讨论社会学和经济学的一些经典问题。学习运用计算思维分析社会学、经济学问题的方法，加深对某些生活现象的理解，体会计算与社会科学的互动。\nLearn to analyze and reason about problems in social sciences with computational thinking, appreciate interactions between computing and social sciences, as well as gain deeper understanding of some common phenomena in life and society\n\n                                            Syllabus\n                        网络与图论图论是研究网络结构的基础。本章首先介绍图论的一些基本概念，包括节点、边、路径、连通性、聚集系数等。进而运用这些图结构的若干基本概念探讨社会网络的一些典型结构，以及影响网络中边的形成的一些基本过程。网络的结构性因素，如关系的强弱，边的嵌入性，节点的属性，网络中的结构洞等等，在信息传播过程中都发挥着独特的作用，影响着社交网络本身的演化。社会选择与社会影响本章将讨论存在于网络节点和边以外的因素，即网络所处的环境或背景，如何对社交网络结构及其演化产生影响。主要内容包括同质性概念及其形成的基本原理，同质性指社交网络中相互连接的个体倾向于“类似”，即社交网络中个体之间的相似性及相容性对他们之间是否形成边产生重要的影响。通过对同质性现象的定量表达方式来刻画一些典型网络的形成过程。小世界现象小世界现象包含两个层面：社会网络中存在非常丰富的短路径；人们可以有效地通过这些短路径搜索到目标节点。本章提出两个小世界模型：小世界基本模型和精细模型。小世界基本模型体现了现实社会网络中短路径在其中存在的必然性；小世界精细模型则刻画了社会网络中短路经的搜索过程，从而验证了短路径的可达性。本章进一步讨论了针对简单网络结构计算具体搜索结果的方法。\n万维网结构、链接分析与网络搜索本章采用图论的一些基本概念，包括有向图，有向边，有向路径，节点的入度和出度，短路经和超大分量等概念，来分析万维网结构，其中被链接的基本单位是网页，彼此相关的网页通过某种链接方式被联系起来。对万维网结构进行分析，有助于分析其中信息的属性，行为和演变过程。本章进一步通过分析网页之间的链接关系介绍了现代搜索引擎网页排名算法。万维网中一篇网页具有两个属性：权威性体现了主题相关网页被其他网页的链入情况（被关注），中枢性则体现了一个网页对其他主题相关网页的链接行为（推荐），网页的权威值和中枢值依据反复改进规则计算最终形成网页的排名结果。博弈本章通过几个典型的博弈首先介绍博弈的三个基本要素：参与人、策略、回报，通过刻画双人博弈的收益矩阵推理博弈的解。进一步，引入博弈论中的几个基本概念，纳什均衡，占优策略，社会最优等等。最终，针对没有纳什均衡的博弈，引入混合策略博弈，利用参与者随机性行为的概率来预测其相应的策略，推理博弈的均衡解。博弈论的思想运用在本课程许多地方，例如，下一章的交通网络流量博弈，以及拍卖中的博弈等。网络流量博弈，拍卖、匹配市场本章包含两部分内容，一是运用博弈论的思想构建两个模型，交通网络流量模型和拍卖模型，可以视为是博弈论思想的扩展应用。针对这样两个模型，讨论参与者的最佳策略（选择哪条路线，或怎样出价），以及在均衡状态下的社会成本，是否能够达到社会最优，即所有参与者利益总和最大化。另一部分内容介绍匹配市场的概念，匹配问题的基本框架是，买方、卖方、估值、价格、收益，展示了利用二部图描述匹配问题中的供需关系及其在“市场经济”机制下的动态性。进一步讨论市场清仓价的存在性，证明了这一价格能够使得买方和卖方价值总和达到最高，并且构建一种构造市场清仓价的方法。搜索引擎广告位的定价本章主要讨论基于关键词的广告位销售问题和定价机制。结合前面章节讨论的匹配市场、单品拍卖以及博弈论的思想构建多广告位和多广告主之间的交易规则。采用三种不同的方法进行讨论，匹配市场的基本原则，GSP定价机制——单品次价拍卖直接扩展，VCG定价机制——单品次价拍卖优化扩展。进一步展示了这三种定价机制基于不同的理论和原则，形成广告位和广告主之间的匹配关系和价格各有不同，具有不同的性质和特点，理解它们之间的内在关系和性质有助于更好地理解前面章节涉及到的匹配市场、拍卖、博弈论。关系的平衡本章从两个角度入手讨论网络的关系均衡问题。第一，网络结构均衡，赋予网络中的边“正”“负”的涵义，如朋友关系或敌对关系，对具有这种关系的网络建模，通过纯数学的分析方法，清晰地把握网络结构中这两种力量之间的张力，分析网络所追求的结构平衡随时间的变化趋势。结构平衡理论常应用于对国际关系网络分析以及商品评估网站数据分析中。第二，网络权力均衡，针对节点在网络中的位置如何影响其权力的问题，发展出一套形式化的数学模型，通过引入节点的外部选项和剩余的方法来量化网络节点的权力，并利用纳什议价解的原则刻画了理性行为的平衡结果。权利均衡模型主要应用于经济交易等社会互动活动的分析。网络中的级联行为本章对一种新思想或新技术在网络中的传播行为构建模型，结合网络的图结构分析个体如何受到其相邻网络节点的影响。该模型引入一个门槛值的概念，门槛值体现了旧事物的阻力，以及新旧事物之间博弈均衡的要求，个体的选择策略可以理解为一个众人参与的博弈。此模型博弈的结果可能存在多重均衡，导致新事物完全级联，新旧事物并存等等。本章进一步分析了影响级联过程的几个要素：新事物的优势，网络结构，以及初用节点的选择。从众行为和事物的流行性本章从个体决策依赖于他人的选择这一出发点，研究整个群体的聚合效应。首先通过构建一个信息级联的简单通用模型，利用贝叶斯公式推理和分析信息级联现象，并揭示人们的从众行为尽管常常是下意识的，但也有一定的理性分析基础。进一步讨论事物的流行性分布问题，通过实际数据测量的方法展示流行度分布呈幂律分布，通过构建一个创建网页的模型，揭示了“富者更富”是这种幂律分布的成因。幂律、长尾、Zipf定律是大数据展现出来的与流行性相关的几个概念，课程采用一种市场的视角，展示了一条将它们串起来的线索，并展示了利用幂律分布函数计算产品销量的基本方法。信息不对称对市场的影响制度是带有政策意味的事物，一组规则、一些惯例或某些机制等。本章讨论市场制度在人群中聚合和转达信息的作用。分析了市场事件中的内生性与外生性，及它们对市场本身的不同意义。展示了利用效用函数分析简单预测市场的方法，并推理了自我实现的预期，预期与现实的一致性。针对柠檬市场，讨论了信息不对称对柠檬市场的影响。最终分析了质量信号对消减信息不对称的抑制作用。表决表决是信息聚合的一种形式，其作用是一群人对一组有限的备选项进行评估。本章首先定义个体成员的偏好具有完备性和传递性两个属性，进而分析了一些表决系统，及其存在的弊病，提出了合理的表决系统应该具有的两个性质：帕累托原则和无关候选项的独立性。展示了在单峰偏好关系下形成表决结果的一种有效方法。期末考试\n                                    ", 
    "end_date": "2016-08-29T00:00:00Z", 
    "title": "人群与网络 ", 
    "price": 0, 
    "instructors": "李晓明 （Li Xiaoming）, 邱泽奇 （Qiu Zeqi） and 王卫红（Wang Weihong）  ", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/renqun-wangluo", 
    "duration": "13 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}