{
    "selfpaced": false, 
    "topic_name": [
        "Data Science and Big Data"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    fdubigdata-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    本课程主要讨论人、媒介、信息在社会化媒体环境下的新规律。包括媒体的结构性框架、信息接受者的注意力路径、信息传播路径的优化；网络人群识别的方式和工具；网络人群聚合方式和互动规律；网络口碑产生的内在动因、外在驱动力、各类数据分析工具和方法；以及移动时代的终端竞争。\n\n\n\nThis course focuses on regular patterns of interactions among people, media and information under surrounding social media. The curriculum mainly concerns: the framework and structures of net medias; the\ninteresting focus and evolution of the message-acceptor; the optimization of info-transition paths; methods and tools for detecting online communities; the building, development and interaction within, inside and between online communities; word-of-mouth dynamics along the social net; terminal-competition in mobile medias; useful data analytics.\n\n                                            Syllabus\n                        第一周:  序言 \n计算机信息技术的变革，是造就数字媒体，改变人、媒介、信息之间关系的核心。\n\n第二周：我们是否认清今天互联网世界的基本结构？解释：社会化媒体及其基础平台，媒体结构性框架、信息传播流动路径。\n\n第三周：我们是否能识别并洞察生存在社会化媒体中的各类人群？分析社会化媒体人群的识别方式、识别工具。\n\n第四周：我们是否能厘清网络社会人群的镶嵌、连接和涌现的规律？分析网络社会人群在不同阶段聚合的方式和规律。\n\n第五周：我们是否能够获知网络人群之间产生互动、对话的缘由？分析互动多寡、情感关系、亲疏程度、互惠行为和最终产生的效果有何必然关联。\n\n第六周：我们是否理解网络口碑的产生、作用及其对社会发展的影响？分析网络口碑产生的内在动因、外在驱动力；以及各类网络口碑的评测工具和评估方法。\n\n第七周：我们是否以APP为例能够理解占据移动互联网入口的独特作用？以手机终端APP为例，分析其应用类别、独特价值；以及APP广告的投放形式、定位、用户分析，以及知识性及交互性。\n\n第八周：我们是否能够区别网络公关和网络营销的本质差别？当代公共传播采用社会化媒体已成常态，解析在线活动策划的基本方法、大数据公关的新要求和新标准。\n\n第九周：我们是否理解移动时代的终端革命：搜索引擎之价值？分析移动搜索入口的演变，移动搜索终端的竞争，桌面搜索和移动搜索终端的竞争；媒体使用者的终端使用习惯与媒体接触习惯。解释搜索引擎在品牌传播、市场推广中的现状与问题、价值与前景。\n\n第十周：课程小结。\n\n \n\n1st week: Introduction. IT\nrevolution brings up digital media and transforms the relationship among\npeople, media &amp; information.\n\n2nd week: The fundamental\nstructure of web. Social media as a platform, the framework of media, the paths\nof messages transition &amp; diffusion.\n\n3rd week: Observation and\ndiscrimination of the special crowds (communities) living in the words of social\nmedia. Introduction of useful methods &amp; tools for identifying online\ncommunities (data analytics).\n\n4th week: Clarifying the\nprinciples of embedding, concatenation and emergence operations in online\nsociety. Analysis the different stages in the development of community.\n\n5th week: Emotional\nrelationships among online crowds. Sentimental analysis in social network.\n\n6th week: Understanding the\nword-of-mouth in social network; how it is engendered or formed, its dynamics, and\nits effects in online society, with test tools and estimate methods.\n\n7th week: The unique effect\nof occupying the entrance in webs. Take APP as case-study to show the values of\nthe terminals of mobile phones, the classification of APP, position analysis, the types of putting-on the market, customer analysis and effects,\netc. of advertisement.  \n\n8th week: PR vs. Marketing\nin socialnet. Net is already a popular social stage for modern public\ncommunication. Analysis the basic methods for online planning or strategy, the\nnew standards &amp; criteria for Big Data PR.\n\n9th week: The importance of\nsearching engines in the mobile epoch. The evolution of mobile searching, competition in the terminals of mobile searching, the competition in between desk &amp;\nmobile search engines, users’ habits with media equipment and their effects.\nThe current situation, perspectives and problems with applying search engines in\nbrand communication, market promotion, etc.\n\n10th\nweek: Summary and discussion.\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "大数据与信息传播         Big Data and Information Dissemination", 
    "price": 0, 
    "instructors": "Shian Cheng  程 士安", 
    "institution_name": [
        "Fudan University"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/course/fdubigdata", 
    "duration": null, 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-04-01T00:00:00Z"
}