{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    The most successful products and services offer rich and colorful user experiences that take into account social and cultural patterns. Learn how to create excellent user experience (UX) designs which are user-centered and consider factors such as consumer demand, ability and cultural background.\n\nUnderstanding UX design, or how to design with the user in mind, is not only a requirement for designers, but also a skill product managers and developers should develop throughout their careers. This UX/UI course should help product developers, managers and marketers as well as designers develop unique critical, analytical perspectives in user experience and user interface.Theoretical knowledge of the human factor is at the heart of user-centered design and evaluation. This course will focus around this theme, starting with specific design cases and gradually diving deeper into the newest research findings, taking learners from the simplest to the most complicated studies of user analysis, task analysis, user interface design, cross-cultural design, user experience design, robot and human interaction design, the newest health care and human factor research projects, and more.\n\nFAQs\n\nWhat are the textbook and the reference books for this course?\n\nHeim, S. (2007). The Resonant Interface. Pearson Education Limited. (English language reprint edition published by Publishing House of Electronics Industry).\n\nWhat is the grading breakdown?\n\n20% quizzes\n\n40% discussion\n\n40% final report\n\nHow can I get the certificate?\n\nIf your final score is no less than 50.\n\n \n\n                                            Syllabus\n                        Week 0: is for the pre-study or review of the knowledge in calculus and linear algebra, which will be used in this course.Week 1: Introduction of Human Factors HCI and Human-Centered DesignWeek 2-3: Chinese User Experience Design: Observation of ChineseWeek 4: Chinese User Experience Design: A Case studyWeek 5: Human-Robot InteractionWeek 6: Research and Practice at TsinghuaWeek 7: is for final report.\n                                    ", 
    "end_date": "2016-01-15T00:00:00Z", 
    "title": "70167012x: User Experience (UX) Design: Human Factors and Culture in Design | 设计的人因与文化", 
    "price": 0, 
    "instructors": "Pei-Luen Patrick Rau", 
    "institution_name": [
        "Tsinghua University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/user-experience-ux-design-human-factors-tsinghuax-70167012x", 
    "duration": "13 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-10-16T00:00:00Z"
}