{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    What makes an interface intuitive? How can I tell whether one design works better than another? This course will teach you fundamental principles of design and how to effectively evaluate your work with users. You'll learn fundamental principles of visual design so that you can effectively organize and present information with your interfaces. You'll learn principles of perception and cognition that inform effective interaction design. And you'll learn how to perform and analyze controlled experiments online. In many cases, we'll use Web design as the anchoring domain. A lot of the examples will come from the Web, and we'll talk just a bit about Web technologies in particular. When we do so, it will be to support the main goal of this course, which is helping you build human-centered design skills, so that you have the principles and methods to create excellent interfaces with any technology.\n\n                                            Syllabus\n                        Welcome and Course OverviewWelcome to the course! Here are some helpful resources to guide you through this course.Direct Manipulation and RepresentationsOur lecture videos this module begin with the major innovation of the graphical interface: enabling people to perform input directly on top of output. This directness makes interfaces easier to learn because it enables people to recognize familiar elements. And continuous feedback makes interfaces easier to use, encourages exploration, and prevents errors. To illustrate the benefits of direct manipulation in real interfaces, the videos provide several examples of both particular designs and interface styles. I find that's a lot more useful than just stating abstract principles. Now is a good time to remind everyone that I am not endorsing (or rejecting) any particular product, organization, or person. What I am doing: real people in the real world make real design decisions -- you can learn from this -- and in this course I'll discuss these concrete examples so you can gain real knowledge. The rest of the videos will cover topics related to the importance of representations, such as understanding a user's mental model and helping people to distribute cognition. I will show some examples of how representational differences can impact performance. As you watch these videos, think about how you have arranged or lamented representations in your everyday life. Maybe you put your keys by the door, sunglasses on your hat, or a post-it on your laptop? You'll get a chance to delve into these examples in the assignment.Visual Design and Information DesignSo far, many examples in our videos have been physical. I like physical examples because they’re often easier to understand, and they durably express fundamental principles. Equipped with those fundamentals, we'll now focus more on concrete issues in interaction design to help you flesh out your interactive prototypes.\n\nThis module’s videos introduce visual and information design. These are the nuts and bolts of user interfaces: scale, contrast, pattern, shape, color, typography, and layout. What I hope you'll take away from these lectures is a newfound appreciation for how subtle changes in this visual variables can powerfully impact people's experience of documents and interfaces. Dive into the first visual design lecture here. Visual design organizes the world of information. As this module’s lectures show, that visual organization provides important cues, yet the structure itself is often invisibleDesigning ExperimentsAfter you’ve made a design, how do you know whether it is good? Or if your team has a couple ideas it is considering, how do you know which one is better? Rather than arguing, throwing chairs, or playing rochambeau, we suggest getting your designs in front of real users to see how well they actually work. To enable you to do this, our final module of lectures will introduce you to designing, running, and analyzing experiments. Testing your ideas with people and using what you learn to make them better can often mean the difference between a flop and a hit. Testing also gives you a chance to flex your rapid prototyping muscles. Build several interfaces quickly, try them out with people, and use what you learn to revise them. Through repeated iteration and testing, you can end up with a wonderfully polished interface.\n\nFor me, the most exhilarating aspect of running experiments is the element of surprise. Nearly every time my students, colleagues, and I run a study, we learn something that we never even thought to think of. Sometimes it's a roadblock or bug. Other times, it's an unexpected new use of a system -- many great startups have emerged out of finding unexpected new uses for technology. Either way, it'll give you new fodder for design. As in the prototyping lectures, the evaluation lectures emphasize comparison -- testing multiple ideas. In many ways, design is choice, and comparing multiple interfaces helps you make good choices. Learn more about designing studies here.The description goes here\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Design Principles: an Introduction", 
    "price": 0, 
    "instructors": "Scott  Klemmer", 
    "institution_name": [
        "University of California, San Diego "
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/design-principles", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}