{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    At IDEO.org, we've helped thousands of people embrace human-centered design and unlock their creative problem solving potential. And time and again, we've heard our broader community ask for the tools that they need to introduce their colleagues, teams, and networks to the same approach. You asked, we answered. Introducing the Facilitator's Guide.\r\nThe Facilitator's Guide to Introducing Human-Centered Design is a step-by-step guide to help you introduce new learners to this creative approach to problem solving. Building on your moderate to deep experience with human-centered design and workshop facilitation, you'll learn to plan and lead a one-day, hands-on introductory workshop for 5 to 20 people who have little to no knowledge of human-centered design. The materials include a script, presentation, worksheets, and agendas to maximize your success.\r\nThis resource will deepen facilitators' knowledge of human-centered design by engaging others in the conversation. It also allows facilitators to catalyze new learners to dive deeper into the approach through resources like IDEO.org's Design Kit: The Course for Human-Centered Design and Design Kit: Prototyping.\r\nWe strongly recommend that those interested in using the Facilitator's Guide first complete Design Kit: The Course for Human-Centered Design or have a strong background in human-centered design before engaging others in the process.\n\n                                    ", 
    "end_date": "2017-02-25T00:00:00Z", 
    "title": "Design Kit: Facilitator's Guide", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Ideo.org"
    ], 
    "commitment": "5-7 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://novoed.com/facilitators-guide-2016-2", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2016-12-31T00:00:00Z"
}