{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    The first Macromedia University MOOC Design Thinking is about understanding and implementing the methodology of Design Thinking. You will learn how Design Thinking uses creative, human centered techniques as a strategic approach to stimulate innovation. At MHMK, Macromedia University of Applied Sciences, we believe that human needs and experience should drive innovation – not technology. Being a school whose graduates will engage in designing the digital landscape surrounding us, we like to share our conviction of a good, decent and ethical way of creating tomorrows products and services.\r\nWhat to Expect\r\nThe Macromedia MOOC Design Thinking links theoretical frames with practice. You will look into fundamentals like historical and theoretical aspects of design, design models and design systems. You will gain deeper insights into the Design Thinking methodology and the human-centered design approach. You will learn how to apply teamwork and communications skills, and you will hear about creativity methods and visualization tools in the context of strategic design. And last but not least, the Macromedia MOOC Design Thinking will teach you how to evaluate ideas and concepts and why an innovation attitude and intercultural communication competence is crucial for a successful implementation.\r\nWeek by week we invite you to meet academics, professionals and students, who are using Design Thinking in the creative industries as well as in management in order to solve problems of great complexity. Each week is divided into three or four lectures/chapters. Each lecture is divided in several lessons/units, which are usually not longer than 5 mInutes. The lessons are made of video material, slides, additional reading material and tasks.\r\nExpect to view approx. 80 minutes of lectures per week which sums up to altogether 5 hours per week incl. self-study time.\r\nWhy this MOOC is interdisciplinary\r\nOriginating in the Design Department of MHMK, Macromedia University of Applied Sciences in Munich, the Macromedia MOOC Design Thinking is emphasizing the rewarding link between management and creativity. To us, managing creativity means drawing on various findings and multidiscliplinary methods, yet guiding them through standardized and verifiable management procedures. Besides Design and Art history, the background of our MOOC team therefore ranges from business, psychology and human resource to transmedia, visualization, narration, and journalism, for instance. We will thus be able to discuss Design Thinking from various perspectives.\r\n\r\nLearning Outcomes\r\nOur MOOC will help you answer the following questions: 1. What is Design Thinking? Which benefits may I expect when implementing it as a management strategy?  2. How can innovation be systematically triggered ?  How can I implement Design Thinking into my own projects? 3. Talking about the potential of Design Thinking – what kind of best practices are there ?  4. What kind of team do I need to in order to initialize a Design Thinking process?\r\n\r\nPrior Knowledge\r\nNo prior knowledge of Design Thinking is needed in order to attend the MOOC.  Interest in creative techniques, innovation and management is welcome. - You don't know what human centered design, strategic design or participatory innovation culture is? - Great, you'll learn it here. - You are a business development specialist? - Great, we hope to inspire you. Please feel free to help us inspire others by sharing interesting links, events and projects on our Facebook page.\n\n                                    ", 
    "end_date": "2015-05-20T00:00:00Z", 
    "title": "Design Thinking", 
    "price": 0, 
    "instructors": "Oliver Szasz", 
    "institution_name": [
        "MHMK Macromedia University for Media and Communication"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://iversity.org/en/courses/design-thinking-2nd-iteration", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "iversity"
    ], 
    "start_date": "2015-04-15T00:00:00Z"
}