{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    Are you a design practitioner eager to become more strategic? Are you a business professional who wants to become more innovative? In this course, made by the world’s first strategic design school, you’ll follow the lead of big successful companies who already create new business opportunities and spark innovation by practicing design.\n\nThis course will introduce you to a hands-on design approach for finding new business opportunities. You will experience first-hand how design can be of value for your organisation. You’ll be challenged to create your own concepts that generate new business opportunities.\n\nThis course is produced by the same team that created the Strategic Product Design master programme at TU Delft, one of the oldest and most established programmes of strategic design in the world. Moreover, industry experts will help bridging design practice and business theory in a way that is unique in the present educational landscape.\n\n \n\nLICENSE\n\nThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License.\n\n                                    ", 
    "end_date": "2016-10-17T00:00:00Z", 
    "title": "DPB001x: Design Practice in Business", 
    "price": 0, 
    "instructors": "Dirk Snelders, Giulia Calabretta, Christine De Lille, Boris Eisenbart, Erik Jan Hultink, Roland van der Vorst and Pinar Cankurtaran", 
    "institution_name": [
        "Delft University of Technology"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/design-practice-business-delftx-dpb001x", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-08-29T00:00:00Z"
}