{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    ¿Qué es el diseño? ¿Qué hacen los diseñadores para practicar su arte y que crean? ¿Qué importancia tiene el diseño de las corporaciones en la sociedad y la cultura? ¿Quiénes son algunos de los diseñadores más importantes de nuestra época y que han hecho? ¿Cómo uno puede convertirse en diseñador? Estas son algunas de las preguntas que exploraremos en este cuso introductorio de diseño. Con frecuencia se ha descrito el diseño como solución de problemas, el proceso de convertir las ideas en realidad o los medios, mediante los cuales podemos hacer que el mundo sea un lugar mejor. En este curso, hablaremos de una variedad de definiciones de diseño, la naturaleza del proceso de diseño y formas de práctica de diseño como el diseño de productos, diseño de experiencia de usuario, diseño gráfico, diseño interior y diseño de modas. Hablaremos de estos temas mediante los análisis de casos de varias cosas icónicas y cotidianas que nos rodean. \n\nEste curso le ayudará a entender tales conceptos como el pensamiento creativo, estrategia de diseño, investigación de diseño, y el proceso del diseño para que  los aplique a su propio trabajo.\n\n                                            Syllabus\n                        Modulo: ¿Que es diseño?Durante esta semana se explorara las diversas perspectivas del Diseño y se introducirán conceptos relacionados al proceso del diseño y el pensamiento del diseño.  Contestaremos la pregunta ¿Que es diseño? y enfatizaremos las características de diseño en productos que utilizamos a diario (por ejemplo: en el vino, la cerveza, las copas de champaña, etc.)  Al igual que en prototipos innovadores (por ejemplo: los equipos de bomberos, una cámara retrovisor en la sillas de ruedas). Durante la Semana 1: (a) exploraremos los elementos esenciales del curso y los consejos para ser éxitos en él; (b) aprenderemos  acerca  del campo de diseño y las características  esenciales de éste; (c) definiremos el concepto de diseño según es utilizado en varias profesiones y contextos (Diseño Industrial, Arquitectura).\nModulo: ¿Qué es el proceso de diseño?Esta semana introduciremos el proceso de diseño y continuaremos explorando las múltiples perspectivas del diseño.  Contestaremos la pregunta ¿Qué es el proceso de diseño? y, por medio de ejemplos concretos, demostraremos una tarea importante de cada paso del proceso de diseño (ej. innovaciones medicas).  En la Semana 2 (a) describiremos las fases esenciales del proceso de diseño; (b) ilustraremos las tareas más importantes de cada fase del proceso de diseño; (c) definiremos el contexto de diseño de acuerdo a las profesiones y los contextos donde se utiliza (Diseño de Interiores, Diseño de Paisajes, Diseño Gráfico, Diseño de Interacción).Modulo: ¿Cuáles son las metas del diseño?Esta semana introduciremos las tres metas del diseño y continuaremos explorando las múltiples perspectivas del diseño. Contestaremos la pregunta, ¿Cuáles son las metas del diseño? y discutiremos los conceptos de belleza, utilidad y sostenibilidad según han sido aplicadas por diseñadores actuales. En la Semana 3: (a) definiremos las tres metas del diseño; (b) daremos ejemplos de los conceptos de belleza, utilidad y sostenibilidad; (c) definiremos el concepto de diseño, de acuerdo con distintas profesiones y contextos (Diseño de Transporte, Diseño de Modas).\nModulo: ¿Que es pensamiento de diseño?Esta semana introduciremos el concepto del pensamiento de diseño y continuaremos explorando las múltiples perspectivas de diseño.  Contestaremos la pregunta, ¿Qué es pensamiento de diseño? y discutiremos quince características asociadas con este enfoque sistemático.  En la Semana 4: (a) resumiremos los elementos fundamentales del pensamiento de diseño; (b) explicaremos las 15 características del pensamiento de diseño; (c) definiremos el concepto de diseño según es utilizado en varias profesiones y contextos (Diseño de servicio).Módulo: ¿Que es el impacto del diseño?En la última semana se examinará los impactos positivos y negativos que el diseño tiene en nuestra sociedad y en nuestro planeta.  Particularmente, analizaremos la pregunta, ¿Cuál es el impacto del diseño? desde una perspectiva local y global.  Llegaremos a una conclusión con miras hacia el futuro del campo de diseño y destacaremos lo más importante de las lecciones aprendidas.  Durante la Semana 5: (a) examinaremos los impactos positivos y negativos del diseño;(b) identificaremos las fuerzas sociales, técnicas y económicas que impactarán el futuro del diseño;(c) reconoceremos tendencias actuales que organizarán el proceso del diseño;(d) desarrollaremos una perspectiva global del diseño y del proceso de diseño.\n\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Entender el diseño", 
    "price": 0, 
    "instructors": "Prasad Boradkar", 
    "institution_name": [
        "Arizona State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/entender-diseno", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}