{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    When developing designs, it is important to pick a point of view and consider multiple design options using prototypes. This course will teach you to rapidly instantiate your point of view using multiple prototyping tools, from paper prototypes to the Wizard of Oz method, to test and iterate your ideas quickly. The design strategies you learn in this course will be applicable in a variety of contexts, from services, to interfaces, to products.\n\n                                            Syllabus\n                        This course will be available in a self-paced format. The courses in the Interaction Design Specialization may be taken in any order.Many people can see the same problem, but take very different strategies for approaching that problem. This course will help you consider what your approach will be, while creating multiple alternatives so you have the opportunity to pick something good - not just the first thing that comes to mind.Once you have identified your approach, why wait months to get feedback? In this course, you’ll learn how to make a quick prototype with feedback in hours. We will cover a repertoire of strategies for quick prototyping so you can get feedback quickly, in order to help build consensus on your design team and decide how to move forward. The design strategies you learn in this course will be applicable in a variety of contexts from services, to interfaces, to products. Topics include:developing a point of viewconsidering multiple approaches to a problemcosts and benefits of different strategies for quick prototypingmethods of prototyping (e.g., paper prototypes, digital mockups, video prototyping, Wizard of Oz)\n                                    ", 
    "end_date": "2015-11-05T00:00:00Z", 
    "title": "From Point of View to Prototype", 
    "price": 0, 
    "instructors": "Scott  Klemmer", 
    "institution_name": [
        "University of California, San Diego "
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/course/pov", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-10-15T00:00:00Z"
}