{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso sobre “User eXperience” e “Interaction Design” (UxIxD) tiene por objetivo brindarte una introducción general sobre las herramientas y métodos utilizados en la actualidad para el diseño y la aplicación eficiente de interfaces de usuario. El curso te brindará una base firme basada en experiencias reales y teorías confirmadas científicamente, así como una selección de herramientas y soluciones aplicadas a problemas de actualidad. El enfoque práctico del curso será basado en ejemplos de interfaces Web y Mobile, los cuáles aprenderás a comprender y evaluar con métodos de usabilidad comprobados. Al concluir el curso habrás obtenido un esquema general sobre el temario basado en prácticas reales, métodos modernos para saber diseñar “para” usuarios de sistemas de información, y la aplicabilidad y beneficios de las técnicas más modernas sobre UxIxD.\n\n                                            Syllabus\n                        Semana 1: Inducción a la plataforma y foros de la comunidad TelescopioSemana 2: Introducción a Experiencia del Usuario (User eXperience - UX)Semana 3: Diseñando para UX: Principios de Diseño de Interaccción (Interaction Design - IxD)Semana 4: Ingeniería de Usabilidad Web y Métodos de EvaluaciónSemana 5: Prácticas de Evaluación de Usabilidad Web\n                                    ", 
    "end_date": "2015-07-27T00:00:00Z", 
    "title": "Fundamentos de la Experiencia del Usuario y Diseño de Interacción", 
    "price": 0, 
    "instructors": "Victor M. Garcia", 
    "institution_name": [
        "Galileo University"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "http://telescopio.galileo.edu/curso/uxixd/", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-06-22T00:00:00Z"
}