{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    This course, which is Part Three in the series of Startup Entrepreneurship specialization, offers Life Lessons from a Master Innovator, with proven achievements. During this course you will listen to conversations and interviews with Mr. David (Dadi) Perlmutter, who until recently was Executive VP of Intel corporate. Dadi will talk about 10 life lessons, based on his 34 years as a rebel innovator and entrepreneur. \n\nWe will share with you the following lessons: \nLove and Knowledge are infinite: grow and share; \nLearn from Failures and Successes; \nNothing Moves without a Vision; \nHave a Differentiated Market Transforming Strategy; \nDare to Take Action; \nFight Resistance; \nIt is All About the Ecosystem; \nBuild a Team; \nKeep it Simple and Work Hard.\n\nBy the end of the course the learner will:\n* Know how to lead a process of innovation and implement ideas through all its phases from discovery to delivery in your own field of choice.\n* Know how to apply creativity to  generate creative ideas in a wide range of strategic management issues.\n* Know how to solve problems in general, with a high degree of innovative creative thinking, to widen the range of possible choices\n* Identify new and unfamiliar challenges and needs, reflect on them from a creative point of view (zoom in), decide on the   \naction they require (zoom out)  and generate a novel and useful solution\n* Transform ideas into real value-creating products, services and processes.\n* Be able to analyze both success and failure  and draw conclusions from both, for improving future innovative efforts.\n* Be able to identify and create key features of innovative products and services and in doing so,  generate strategically differentiated innovations that are unique\n* Be able to present your  ideas persuasively and overcome resistance.\n* Know how to simplify a complex product and make it user friendly.\n\n\nCourse assignments will include participation in two discussion groups and four assignments. In each assignment you will be asked to deal with a question relating to an interview you have seen.\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "Innovation Career Lessons from a Master", 
    "price": 0, 
    "instructors": "Shlomo Maital", 
    "institution_name": [
        "Technion - Israel Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/startup-entrepreneurship-innovation-career-lessons", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-01T00:00:00Z"
}