{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    La innovación ha cobrado una importancia significativa en las corporaciones de hoy, y con frecuencia es vista como un motor importante de crecimiento y éxito en una organización. En este curso introductorio, usted aprenderá sobre el significado, la importancia, el proceso e impacto de la innovación. Aunque la palabra innovación se describe más comúnmente  como el proceso de convertir las ideas en productos o servicios que aportan valor al público, la palabra innovación tiene múltiples definiciones, y hablaremos sobre lo que significa en los mundos de negocios, diseño e ingeniería. \n\nAprenderemos sobre un nuevo modelo de innovación llamado Innovación Estratégica Integral, que se puede usar por los individuos y las organizaciones interesadas en generar pensamientos fuera de lo establecido para transformar la forma de pensar de tema de costumbre al pensamiento creativo. Cubriremos en detalle todos los pasos del proceso de innovación. Comenzando con identificar a los problemas que necesitan soluciones innovadoras, investigar y analizar, generar conceptos, seleccionar soluciones prometedoras e implementarlas, hablaremos de una variedad de herramientas que se pueden usar durante cada paso del proceso. \n\nLos aprendices dejarán el curso con un entendimiento profundo de lo que es la innovación y cómo pueden utilizar las herramientas y técnicas de innovación en su propio trabajo.\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Innovar", 
    "price": 0, 
    "instructors": "Prasad Boradkar", 
    "institution_name": [
        "Arizona State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/innovacion-diseno", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-12-31T00:00:00Z"
}