{
    "selfpaced": true, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    Everyone designs. Design occurs anytime you deliberately change an environment to make things better. When you decide what seat to take in an auditorium you’re designing your experience. When you rearrange the furniture in a room or draft an email, you’re designing. \n\nThis course provides a summary of key concepts from the first two chapters of The Design of Everyday Things  (Revised and Expanded Edition, November 2013) by Don Norman. It’s intended to be enjoyable and informative for anyone curious about design: everyday people, technical people, designers, and non-designers alike.Why Take This Course?This course will provide you with the knowledge needed to start recognizing the role of design in today’s world, and to start making better design decisions in your own life. In addition to learning basic design concepts such as affordances and signifiers, you will also gain practice in observing and applying design principles.\n\n                                            Syllabus\n                        Lesson 1: Affordances and Signifiers (4 hours)\n\nLesson 2: Conceptual Models and the System Image (4 hours)\n\nLesson 3: Gulfs of Evaluation and Execution (1 hour)\n\nFinal Project: Design the User Interface (UI) for a Timebank (7 hours) \n\n*The times include watching instructional videos, completing the course exercises, and finishing projects. In total, this course should take an average of 16 hours.\n                                    ", 
    "end_date": "2014-12-31T00:00:00Z", 
    "title": "Intro to the Design of Everyday Things", 
    "price": 0, 
    "instructors": "Don Norman and Kristian Simsarian", 
    "institution_name": [], 
    "commitment": "6 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.udacity.com/course/intro-to-the-design-of-everyday-things--design101?utm_medium=referral&utm_campaign=api", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2014-12-17T00:00:00Z"
}