{
    "selfpaced": true, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    Prototyping allows you to spend ten minutes -- instead of ten hours -- finding an amazing design for your product.  This course will guide you through the iterative process of prototyping an app and conducting user research. You will start by making a low fidelity paper prototype, conducting research with users, and using that research to inform your next iteration. Together with InVision we’ll guide you through creating interactive prototypes. This means you don’t have to code an app before putting it in front of users! Along the way, you’ll learn how and where prototyping fits into your app design process and how you can use prototyping to become a better entrepreneur.\n\nThis course is part of our Tech Entrepreneur Nanodegree Program, click [here to learn more](https://www.udacity.com/course/tech-entrepreneur-nanodegree--nd007).Why Take This Course?Prototyping is an art that exists to save you time and money in the app development process. It allows you to identify design flaws quickly so you waste as little time as possible building a phenomenal app. By learning this art, you’ll create quality apps faster and have confidence in the viability of your products. \n\nBy the end of the course, you’ll be comfortable with the prototyping process, be able to get quality user feedback, and use the feedback to create great apps.\n\n                                            Syllabus\n                        You’ll learn basic paper prototyping, conducting user research, and understanding feedback on your app. You’ll also learn how to use InVision to create interactive medium-fidelity prototypes and conduct user research remotely. Finally, you will learn how to continue prototyping new features as you move further in the app development lifecycle and how to present your research to friends, investors, and anyone else who is interested in your work.\n\n\n###Lesson 1: Low-Fidelity Prototypes &amp; User Research\nIn this lesson, you’ll learn the fundamentals of prototyping, as well as the process of making paper prototypes and presenting them to users. \n\n###Lesson 2: Medium-Fidelity Prototypes with inVision\nIn this lesson, you’ll learn how to incorporate feedback, make interactive prototypes using InVision, and how to conduct further user research remotely.  \n\n###Lesson 3: Lifelong Prototyping \nIn this lesson, you’ll learn how to refine your prototypes further, how to involve prototyping and user research in new app features, and how to present your prototypes and research.\n                                    ", 
    "end_date": "2015-10-31T00:00:00Z", 
    "title": "Rapid Prototyping", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.udacity.com/course/rapid-prototyping--ud723?utm_medium=referral&utm_campaign=api", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-10-10T00:00:00Z"
}