{
    "selfpaced": false, 
    "topic_name": [
        "Design & Creativity"
    ], 
    "description": "\n\n                    \n                    \n                    What makes for a great user experience? How can you consistently design experiences that work well, are easy to use and  people want to use? This course will teach you the core process of experience design and how to effectively evaluate your work with the people for whom you are designing. You'll learn fundamental methods of design research that will enable  you to effectively understand people, the sequences of their actions, and the context in which they work. Through the assignments, you’ll learn practical techniques for making sense of what you see and transform your observations into meaningful actionable insights and unique opportunity areas for design.  You’ll also explore how to generate ideas in response to the opportunities identified and learn methods for making your ideas tangible. By answering specific questions and refining your concepts, you’ll move closer to making your ideas real. We’ll use cases from a variety of industries including health, education, transportation, finance, and beyond to illustrate how these methods work across different domains. \n\nGood luck and we hope you enjoy the course!\n\n                                            Syllabus\n                        Design Research \nOur course begins with the first step for generating great user experiences: understanding what people do, think, say, and feel. In this module, you’ll learn how to keep an open mind while learning more about how people’s needs, goals, values play out in their day-to-day lives and their hopes for the future. You’ll consider the different activities they do, in what order, and the larger systems in which they interact. You’ll start by generating lists of questions and move through different research methods to answer your specific questions. To illustrate these research methods, the lessons share several examples from real design projects across a variety of fields.\n \nWhat I hope you’ll take away from this module is the importance and thrill of going out to talk with and learn from people when and where they do their everyday activities, rather than basing your designs on assumptions. Through these techniques you’ll gain a new perspective on the problem and identify opportunities for creating a meaningful and accessible designed IdeationOnce you’ve identified an opportunity area, how do you generate great ideas? In this module, you’ll learn the thrills and challenges of ideation. We’ll start with the two common pitfalls to generating good ideas: fixation and judgment. We discuss rules to follow including getting every idea out regardless of whether it’s good or bad and techniques for building on ideas. Through concrete examples taken from the field, we’ll cover five popular ideation techniques that designers use when they have a problem they want to solve. We’ll also discuss who to include in the brainstorming process and why. We’ll conclude with a discussion of how to choose which ideas to pursue and which ones to leave on the table. \n \nWe hope you'll take away a newfound appreciation for all of the different ways you can generate ideas within an opportunity area and how different techniques and configurations will influence the types of ideas you generate.SynthesisAfter you’ve collected all of this new and exciting information, what do you do with it? How do you aggregate the data? Find connections and tensions? Move from what people say to what it means? In this module, you’ll learn how to make sense of the rich data you collected and how to turn it into actionable insights that will lead to meaningful new experiences. We’ll start by looking at how to organize all of the data and photos you’ve collected and then we’ll discuss four common synthesis techniques that designers use: personas, journey maps, diagramming and the 2x2 matrix. After making sense of the data, you’ll be able to identify clear opportunity areas for design including a focus, stakeholder, a need, and an actionable insight. With each technique, I’ll share a real world application so you can get a sense of how designers use these tools. By the end of the lesson, I hope you’ll feel confident in your ability to take lots of disparate bits of data and turn them into an actionable opportunity area for design..\n\nPrototypingAfter you’ve gone through the ideation process, how do you make your ideas tangible so that you can test them with others and answer critical questions necessary for pushing your idea forward? To help you make ideas real, our final lesson will introduce you to the rules of prototyping including building ideas quickly, making a lot of prototypes, and providing only essential details. We’ll discuss questions you’ll want to ask when testing your idea with different people. You’ll learn the importance of making many prototypes so as not to get attached to any one idea and so you can pick the parts that work best for each idea. Through rapid iteration and testing, you will more quickly get to a meaningful and accessible experience that you will be proud of. We’ll conclude with four popular forms of prototyping including storyboards, role-plays, walkthroughs and touch-points – all forms of prototyping you can do with materials you can find around your home. No coding needed!\n\nWhat I hope you'll take away from this lesson is a love of making ideas tangible to answer specific questions and how different forms of prototyping will influence the questions you can answer. So we can take all of those ideas written on sticky notes and make them real!\n                                    ", 
    "end_date": "2016-06-27T00:00:00Z", 
    "title": "User Experience: Research & Prototyping", 
    "price": 0, 
    "instructors": "Scott  Klemmer and Elizabeth Gerber", 
    "institution_name": [
        "University of California, San Diego "
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/user-research", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}