{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    This course is presented in Mandarin.\nIf you are having difficulty viewing this video in mainland China, you can also find it here.\n\t课程介绍视频也可以访问中国网站\nThis course builds on a century of inspiring research into circuit analysis and design. Exploring the nature of circuits as complex systems, the methods implemented here can serve as valuable references and templates toward other problem solving. Required as a fundamental course for EE and interested students at Peking University, it has been adapted here to be suitable for most students. The EE students in Peking University will be enrolled into a flipped-classroom version of this MOOC, in which they are required to join in a classroom discussion after finishing the post-video homework. For the benefit of all MOOC students, the class discussion will be recorded and shared on edX.\nThe video clips of lectures interleaved with quick questions, as well as the peer-to-peer homework assessment, online final exam and certificate issue by PKU, are similar to other typical MOOCs.\n现代社会中电子系统已经是无处不在。而电子线路技术经过上百年的发展、数百万学者和工程师的锤炼，一直是电子工程专业最重要的理论、实验和技术基础。同时，在电路技术的发展中，也酝酿出了一些重要的理念（譬如滤波、反馈等等），对其它学科产生了重要影响。\n\t因此，这门课程中，既注重为本专业的学生完整地培养电路的基础知识、概念和方法（需完整地观看授课视频和课堂讨论视频），也努力满足让电路课的知识和方法为非本专业的学生带来最大的收获—— 一方面可以了解生活中一些电子系统的基本原理，另一方面电路理论中的一些普适性的理念，是可以有触类旁通的作用的，由此尽可能使学生都能在思维的深度和广度上有所收获。\n\t作为试水的国内首批大规模网络公开课程之一，本课程注重轻松而有效的学习气氛，以学生的综合收获作为导向指标，强调的是启发和领悟，而非简单的算题答题能力。\n\t本课程也在同期面向北大校内正常选课的电子学系的二年级本科生开课，采用易址教学模式（Flipped-learning）——本校学生观看MOOC视频后，还需参与教室内的现场讨论。\n\tMOOC课程进度稍滞后于校内授课，以便教室内现场讨论的录像能制作后，上传至服务器并共享给所有选课学生。\n\t由于授课方式的更新，本课程尚无适用的已版教材。故由教师提供电子版自编讲义，每周提前发放（PDF格式）。\n\t所有学生需观看12周的教学视频，按时完成相应的作业，并在期末参加线上考试。 结课成绩 = 练习题50% +期末考试50% 。其中，在线练习题的成绩，是把两次最低的练习分数除外之后进行平均。 成绩位于前70%者，可以获得北大提供的课程结业证书；前20%的学生，可获得荣誉证书；在线上讨论和问答中表现优异的少数学生，将通过评选方式进入课程名人堂。\n\t作为网络公开课程，在选课人数较多的情形下，教师和助教不可能逐一回答每位同学的所有问题。如果你在学习过程中遇到了问题，课程论坛是解决问题的首选场所——你可以在每次视频课程或本课程的总论坛进行提问和讨论，而所有的问答都将根据学生投票进行人气排名。对于人气排名较高的比较重要、瞩目、有价值的问题，助教和教师会优先回答。\n \nThe course is one of the PKU-DeTao MOOCs, which is a joint effort by Peking University and DeTao Masters Academy. 该课程是“北大-德稻网络开放课程”中的一门，由北京大学与德稻教育联合提供。\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "04832430X: Electronic Circuits", 
    "price": 0, 
    "instructors": "Chen Jiang", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edx.org/course/pekingx/pekingx-04832430x-electronic-circuits-1093", 
    "duration": null, 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2013-09-23T00:00:00Z"
}