{
    "selfpaced": true, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    We encounter signals and systems extensively in our day-to-day lives, from making a phone call, listening to a song, editing photos, manipulating audio files, using speech recognition softwares like Siri and Google now, to taking EEGs, ECGs and X-Ray images. Each of these involves gathering, storing, transmitting and processing information from the physical world. This course will equip you to deal with these tasks efficiently by learning the basic mathematical framework of signals and systems.\nThis course is divided into two parts. In the first part (EE210.1x), we explored the various properties of signals and systems, characterization of Linear Shift Invariant Systems, convolution and Fourier Transform. Building on that, in this part (EE210.2x) we will deal with the Sampling theorem, Z-Transform, discrete Fourier transform and Laplace transform. The contents of the first part are prerequisites for doing this part. Ideas introduced in this course will be useful in understanding further electrical engineering courses which deal with control systems, communication systems, power systems, digital signal processing, statistical signal analysis and digital message transmission. The concepts taught in this course are also useful to students of other disciplines like mechanical, chemical, aerospace and other branches of engineering and science.\n\n                                    ", 
    "end_date": "2016-08-11T00:00:00Z", 
    "title": "EE210.2X: Signals and Systems, Part 2", 
    "price": 0, 
    "instructors": "Vikram Gadre", 
    "institution_name": [
        "IIT(Indian Institute of Technology Bombay)"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edx.org/course/signals-systems-part-2-iitbombayx-ee210-2x-1", 
    "duration": "18 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-04-07T00:00:00Z"
}