{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    The word 'wavelet' refers to a little wave. Wavelets are functions designed to be considerably localized in both time and frequency domains. There are many practical situations in which one needs to analyze the signal simultaneously in both the time and frequency domains, for example, in audio processing, image enhancement, analysis and processing, geophysics and in biomedical engineering. Such analysis requires the engineer and researcher to deal with such functions, that have an inherent ability to localize as much as possible in the two domains simultaneously.This poses a fundamental challenge because such a simultaneous localization is ultimately restricted by the uncertainty principle for signal processing. Wavelet transforms have recently gained popularity in those fields where Fourier analysis has been traditionally used because of the property which enables them to capture local signal behavior. The whole idea of wavelets manifests itself differently in many different disciplines, although the basic principles remain the same. Aim of the course is to introduce the idea of wavelets. Haar wavelets has been introduced as an important tool in the analysis of signal at various level of resolution. Keeping this goal in mind, idea of representing a general finite energy signal by a piecewise constant representation is developed. Concept of Ladder of  subspaces, in particular the notion of 'approximation' and 'Incremental' subspaces is introduced. Connection between wavelet analysis and multirate digital systems have been emphasized, which brings us to the need of establishing equivalence of sequences and finite energy signals and this goal is achieved by the application of basic ideas from linear algebra. Towards the end, relation between wavelets and multirate filter banks, from the point of view of implementation is explained.\n\n                                            Syllabus\n                        Week 1IntroductionOrigin of WaveletsHaar WaveletDyadic WaveletDilates and Translates of Haar WaveletsL2 Norm of a Function\r\nWeek 2 Piecewise Constant Representation of a Function Ladder of Subspaces Scaling Function for Haar Wavelet Vector Representation of SequencesProperties of Norm Parseval's Theorem\r\nWeek 3Equivalence of sequences and functionsAngle between functions and decomposition of functions in terms of decomposition of sequencesIntroduction to Filter BankHaar Analysis Filter Bank in Z-domainHaar Synthesis Filter Bank in Z-domain\r\nWeek 4Moving from Z-domain to frequency domainFrequency response of Haar Analysis Filter bankPower complementary and Magnitude Complementary of Haar Filter BankIdeal two-band filter bankDisqualification of Ideal filter bankRealizable two-band filter bank\r\nWeek 5Relating Fourier transform of φ (t) and filter bankFourier transform of scaling function φ (t)Construction of φ (t) and ψ (t) from filter bank.\n                                    ", 
    "end_date": "2016-04-18T00:00:00Z", 
    "title": "Foundations of Wavelets and Multirate Digital Signal Processing", 
    "price": 0, 
    "instructors": "Vikram Gadre", 
    "institution_name": [
        "IIT(Indian Institute of Technology Bombay)"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://onlinecourses.nptel.ac.in/noc16_ec05", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NPTEL"
    ], 
    "start_date": "2016-03-14T00:00:00Z"
}