{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    The course focuses on the creation, manipulation, transmission, and reception of information by electronic means. The topics covered include elementary signal theory; time- and frequency-domain analysis of signals; conversion of analog signals to a digital form; and how information can be represented with signals. Signal processing, both analog and digital, allow information to be extracted and manipulated. The course then turns to information theory, which demonstrates the technological advantages of digital transmission.\n\nThe course text was written by the instructor for this course and is entirely online. You can print your own hard copy or view the material entirely online.\n\n                                            Syllabus\n                        Elements of signal and system theoryWeek 1: Digital and analog information; block diagrams: sources, systems, sinks. Simple signals and systems. Complex numbers. Analog Signal Processing Weeks 2-3: Representation of signals by electrical quantities (electric currents and electromagnetic radiation). Elementary circuit theory: resistors and sources, KVL and KCL, power, equivalent circuits. Circuits with memory: impedance, transfer functions, Thévenin and Mayer-Norton equivalent circuits.Frequency Domain Ideas Weeks 4-5: Fourier series and Fourier transforms. Signals in time and frequency domains. Encoding information in the frequency domain. Filtering signals. Modeling the speech signal. Digital Signal Processing Weeks 6-8: Analog-to-digital (A/D) conversion: Sampling Theorem, amplitude quantization, data rate. Discrete-time signals and systems. Discrete-time Fourier transform, discrete Fourier transform and the fast Fourier transform. Digital implementation of analog filtering. Communicating information Weeks 9-10: Fundamentals of communication: channel models, wireline and wireless channels. Analog (AM) communication: modulation and demodulation, noise (signal-to-noise ratio, white noise models), linear filters for noise reduction.Weeks 11-12: Digital communication: binary signal sets, digital channel models. Entropy and Shannon's Source Coding Theorem: lossless and lossy compression; redundancy. Error-correcting codes: Shannon’s Noisy Channel Coding Theorem, channel capacity, Hamming codes. Comparison of analog and digital communication.\n                                    ", 
    "end_date": "2014-04-14T00:00:00Z", 
    "title": "Fundamentals of Electrical Engineering", 
    "price": 0, 
    "instructors": "Don H. Johnson", 
    "institution_name": [
        "Rice University"
    ], 
    "commitment": "8-10 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/course/eefun", 
    "duration": "12 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-01-20T00:00:00Z"
}