{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    The course is intended to provide an understanding of the materials and devices used in the current semiconductor industry. It caters to undergraduate and graduate students with a diverse background in Chemical, Mechanical, Metallurgy, Materials Science, and Physics. The course provides the students with the basic physics behind semiconductor materials, types of semiconductors, and the reason for the dominance of silicon in the electronics industry. The course also covers the basics of devices with emphasis on their electronic characteristics. Optical devices like LEDs, lasers, solar cells, and their properties will also be explained. \n\n                                            Syllabus\n                        Week 1 – Introduction, Energy bands in solids, Semiconductors band gap formationWeek 2 – Problem set on week #1 and Intrinsic semiconductors. Week 3 – Extrinsic semiconductors, Fermi level variations, and conductivity. Week 4 – Problem set on week #3. Metal-semiconductor junctions and Introduction to pn junctions Week 5 – pn junctions under bias, Junction breakdown, and Heterojunctions. Problem set on week#4 and 5. Week 6 – Transistors, Types of transistors, MOSFETs, Problem set on week#6. Week 7 – Optoelectronic devices – Introduction. LEDs and Lasers. Week 8 – Photo detectors and solar cells. Problem set on opto electronic devices, week #7 and 8.\n                                    ", 
    "end_date": "2016-03-14T00:00:00Z", 
    "title": "Fundamentals of electronic materials and devices", 
    "price": 0, 
    "instructors": "Parasuraman Swaminathan", 
    "institution_name": [
        "IIT ( Indian Institute of Technology Madras)"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://onlinecourses.nptel.ac.in/noc16_mm01", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NPTEL"
    ], 
    "start_date": "2016-01-18T00:00:00Z"
}