{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    informationtheory-001\n                                                                    informationtheory-002\n                                                                    informationtheory-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    The lectures are based on the first 11 chapters of Prof. Raymond Yeung’s textbook entitled Information Theory and Network Coding (Springer 2008).\n\nChapter 1 The Science of Information Chapter 2 Information Measures Chapter 3 The I-Measure Chapter 4 Zero-Error Data Compression Chapter 5 Weak Typicality Chapter 6 Strong Typicality Chapter 7 Discrete Memoryless Channels Chapter 8 Rate-Distortion Theory Chapter 9 The Blahut-Arimoto Algorithms Chapter 10 Differential Entropy Chapter 11 Continuous-Valued Channels\nThis book and its predecessor, A First Course in Information Theory (Kluwer 2002,\nessentially the first edition of the 2008 book), have been adopted by over 60\nuniversities around the world as either a textbook or reference text. The electronic version\nof the 2008 book can be downloaded for free (with institutional subscription).At the completion of this course, the student should be able to:Demonstrate knowledge and understanding of the fundamentals of information theory.Appreciate the notion of fundamental limits in communication systems and more generally all systems.Develop deeper understanding of communication systems.Apply the concepts of information theory to various disciplines in information science.\n\n                                            Syllabus\n                        The lectures are based on the first 11 chapters of Prof. Raymond Yeung’s textbook entitled Information Theory and Network Coding (Springer 2008) listed above.\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Information Theory", 
    "price": 0, 
    "instructors": "Raymond W. Yeung", 
    "institution_name": [
        "The Chinese University of Hong Kong"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/course/informationtheory", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-01-05T00:00:00Z"
}