{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    Le traitement du signal est présent dans tous les domaines de notre vie, que l’on parle de télécommunications, de télévision, de transports ou de médecine. Ce MOOC est une introduction aux principes de base du traitement du signal. Il est basé sur des cours dispensés au CNAM, de niveau L1 à L3 (Bac à Bac+3). Les thèmes abordés sont la représentation temporelle et spectrale des signaux, le filtrage, la numérisation et les applications. Ils font appel à des connaissances en mathématiques telles que l’intégration et la manipulation des nombres complexes.Le cours a une durée de six semaines, chaque semaine étant subdivisée en six séquences de dix minutes environ. Des évaluations intermédiaires sous forme de QCM non notés après chaque séquence et de problèmes notés en fin de semaine (QCM), ainsi qu’une évaluation finale également notée (QCM final) permettront aux étudiants d’obtenir l’attestation de réussite.A l’issue du MOOC les étudiants ne seront pas des experts du traitement du signal mais auront une connaissance des bases (spectre, filtrage, numérisation) ainsi qu’un aperçu des techniques numériques en traitement du signal.\n\n                                            Syllabus\n                        Semaine 1 : Filtrage, convolution et série de FourierIntroduction au traitement du signalSystèmes Linéaires Invariant Temporellement et convolutionSérie de Fourier, principes et propriétésSemaine 2 : Transformée de Fourier et analyse spectraleTransformée de Fourier, définition, propriétésAnalyse spectrale, principe et fenêtragePrincipe des modulations d'amplitudeSemaine 3 : Applications à l'analyse specrale et aux modulations, signaux aléatoiresMultipexage, modulation, architecture d'un récepteurAnalyse spectrale avec analyseur de spectre et logicile de traitement du signalIntroduction aux signaux aléatoiresSemaine 4 : Echantillonnage et traitement numérique des signauxCaractérisation spectrale des signaux aléatoiresEchantillonnage des signaux et chaîne de traitement du signalIntroduction au traitement numérique du signalSemaine 5 : Filtrage numériqueTransformée de Fourier Discrète et RapideFonction de transfert en z, principes, pôles, zéros et stabilitéFiltres numériques à réponse impulsionnelle finie (RIF)Semaine 6 : Filtrage numérique et applicationsFiltres numériques à réponse impulsionnelle infinie (RII)Application au filtre à moyenne mobileApplication de filtres à encoches au filtrage audioApplication du filtrage numérique à un système acoustique\n                                    ", 
    "end_date": "2016-03-28T00:00:00Z", 
    "title": "Introduction au traitement du signal", 
    "price": 0, 
    "instructors": "Daniel Roviras", 
    "institution_name": [
        "CNAM"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/CNAM/01008S02/session02/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-02-15T00:00:00Z"
}