{
    "selfpaced": true, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    PLEASE NOTE: This version of the course has been formed from an earlier version, which was actively run by the instructor and his teaching assistants. Some of what is mentioned in the video lectures and the accompanying material regarding logistics, book availability and method of grading may no longer be relevant to the present version. Neither the instructor nor the original teaching assistants are running this version of the course. There will be no certificate offered for this course.\n\nLearn how MOS transistors work, and how to model them. The understanding provided in this course is essential not only for device modelers, but also for designers of high-performance circuits.\n\n                                            Syllabus\n                        About This Course and Overview of the MOS TransistorWelcome to the “MOS Transistors” course! We are very excited to be able to offer this course, and are looking forward to working with you.Preliminaries and BackgroundThe Two-Terminal and Three-Terminal MOS StructuresThe Long-Channel MOS Transistor – Part 1This is the first module we are dealing with the complete transistor; much of this material, as well as next module's material, will form the core of what we will be covering in the rest of the course. We hope you will spend extra time studying to make sure you understand this material in depth. The total viewing time in each of these two modules is shorter, which should help. \nThe Long-Channel MOS Transistor – Part 2This material concludes the lectures on the long-channel transistor in DC operation. As mentioned earlier, these lectures will form the core on which many of our subsequent discussions will be based. Small-Dimension Effects 1In this module we are dealing with phenomena that occur when the transistor dimensions are made small; this is important knowledge to have when one is dealing with modern devices. Small-Dimension Effects 2; Modeling for Circuits SimulationThis module we will finish with small dimension effects, and then talk about models for circuit simulation (the circuit designers among you are probably already using such models). We discuss what it takes to make a good model for circuit simulation (among other things: a lot of caution and care, and about 20,000 lines of code!), and how you can spot possible problems with such models. Although models for circuit simulation include capabilities we have not yet discussed, such as charge modeling, we think you know enough about models at this point to be able to follow this general discussion (which is out of sequence – it’s from Chap. 10 in the book, where you can find much more on the subject). Large-Signal Dynamic OperationIn this module there is a significant departure from what we have done up to this point: we will allow the terminal voltages of the transistor to vary with time. We will determine the resulting terminal currents, which will now include a “charging” component. We will do this both for moderate and for very high “speeds”. The transient response of circuits involves similar calculations, only done by computer for an ensemble of transistors and other devices. Small-Signal Modeling IThe material for this module deals with small-signal modeling, and constitutes an important part of the description of MOS transistor behavior. It relates small changes in terminal voltages to the resulting small changes in currents. Small-signal modeling is key to analog circuit design, but not only; it is also used in high-performance digital circuit design (e.g., in designing memory sense amplifiers). Small-Signal Modeling IIThis material concludes our discussion of small-signal modeling; it shows how we can model the transistor at frequencies at which the simple model we derived last week is not valid. Such modeling is important in high-frequency applications, e.g. transceiver design. Final ExamThe exam is open book, open notes, open videos. It covers the material of the first nine weeks of videos in the course. You are NOT allowed to discuss the exam, directly or indirectly, with anyone. Anybody found in violation of this rule will be removed from the course. You should, of course, feel free to report technical issues with the exam and its submission. End of CourseAlthough your knowledge of this material will not be tested in the final exam, we urge you to go through it, as it deals with important topics, namely noise, ion implantation and substrate nonuniformity, and statistical variability; these topics will help complete your understanding of MOS transistors. \n                                    ", 
    "end_date": "2016-08-29T00:00:00Z", 
    "title": "MOS Transistors", 
    "price": 0, 
    "instructors": "Yannis Tsividis", 
    "institution_name": [
        "Columbia University"
    ], 
    "commitment": "8-10 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/mosfet", 
    "duration": "11 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}