{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    En este curso aprenderemos los fundamentos del diseño de los circuitos digitales actuales, siguiendo una orientación eminentemente práctica.\n\nA diferencia de otros cursos más \"clásicos\" de Circuitos Digitales, nuestro interés se centrará más en el Sistema que en la Electrónica que lo sustenta. Este enfoque nos permitirá sentar las bases del diseño de Sistemas Digitales complejos.\n\nSe trata de un curso muy adecuado para estudiantes de primeros cursos de carreras de Ingenierías cercanas a las TIC (Tecnologías de la Información y de las Comunicaciones), y para todas aquellas personas que deseen introducirse en el mundo de los Sistemas Digitales. Por otra parte, este primer curso de Sistemas Digitales es un paso obligado para aquellas personas que deseen posteriormente profundizar en temas como el hardware de computadores y/o los circuitos integrados de aplicación específica, con todas las aplicaciones que ello implica (robótica, biónica, control industrial, etc.).\n\nAl acabar el curso serás capaz de:\n\n   *  Diseñar Sistemas Digitales de complejidad media.\n   *  Comprender la descripción de Sistemas Digitales mediante lenguajes de alto nivel como VHDL.\n   *  Comprender el funcionamiento de los computadores a su nivel más básico (lenguaje máquina), así como su materialización e interpretación a través de sistemas digitales algorítmicos.\n\n\nACLARACIONES\n* Puedes realizar el curso de manera gratuita. Con ello puedes acceder a todo los contenidos (vídeos, lecturas, cuestionarios, foros). Sin embargo, no permite la opción de obtener un certificado. \n* Obtener el certificado implica cumplir una serie de requisitos, entre los cuales, abonar el coste asociado.\n\n                                            Syllabus\n                        Todo lo que necesitas saber para comenzar el cursoEn este primer módulo hemos recopilado todo aquello que necesitas saber para comenzar el curso en condiciones. Consta de 4 bloques en los que encontrarás (1) una explicación, en el apartado de \"Bienvenida\", de cómo funciona el curso, (2) información sobre cuestiones de interés general como ¿cómo seré evaluado?, ¿cómo puedo conseguir un certificado?, ¿cómo funcionan los foros?, etc., (3) los manuales de instalación de una máquina virtual que necesitarás instalar en tu ordenador para seguir el curso y (4) un conjunto de vídeos y ejercicios sobre el sistema de numeración binario, los algoritmos y el pseudocódigo por si necesitas refrescar conocimientos.¿Qué son los Sistemas Digitales?TEMA 1: Este módulo es una introducción a los sistemas digitales. Contiene: (1) los vídeos de las lecciones_L y los ejercicios correspondientes, (2) dos vídeos_P en los que se introduce el procesador que iremos diseñando a lo largo del curso y (3) unas explicaciones, en forma de vídeos, una wiki y unas FAQs, sobre el funcionamiento de VerilUOC_Desktop, herramienta que necesitarás conocer para realizar los ejercicios del siguiente módulo. Lee el \"Índice de las lecciones\" y \"Léeme\" en el apartado de VerilUOC_Desktop para más informació.Circuitos Combinacionales (I)TEMA 2: En este módulo estudiaremos los circuitos combinacionales. Lee el \"Índice de las lecciones\" para más información. Para resolver los ejercicios de este módulo necesitarás utilizar VerilUOC_Desktop. Recuerda que en el apartado \"VerilUOC_Desktop\" del módulo anterior (semana 2) tienes toda la información que necesitas sobre el funcionamiento de dicha herramienta.Circuitos Combinacionales (II)TEMA 3: Continuamos con el estudio de los circuitos combinacionales. Si bien en el módulo anterior trabajamos las técnicas clásicas de diseño de circuitos combinacionales, aquí nos centraremos en otros temas como las herramientas de ayuda al diseño, de las que daremos algunas pinceladas, o la síntesis de este tipo de circuitos a partir de  su descripción algorítmica. Lee el \"Índice de las lecciones\" para más información. También para resolver los ejercicios de este módulo necesitarás utilizar VerilUOC_Desktop. Recuerda que en el apartado \"VerilUOC_Desktop\" del módulo 2 tienes toda la información que necesitas sobre el funcionamiento de dicha herramienta.Circuitos aritméticos + Introducción al VHDLTEMA 4: Este módulo tiene un doble objetivo. En primer lugar completaremos el estudio de los circuitos combinacionales presentando unos pocos circuitos aritméticos de cierta complejidad. En segundo lugar introduciremos el lenguaje de descripción hardware VHDL que utilizaremos más adelante para describir formalmente los circuitos. Es importante entender que el objetivo que persigue esta introducción al VHDL no es el formar expertos capaces de modelizar y diseñar circuitos a partir de VHDL, cosa que obviamente requeriría mucho más tiempo y esfuerzo del que le dedicamos aquí, sino el de proporcionarte unos conocimientos básicos de este lenguaje que te permitan interpretar (entender) un código VHDL de complejidad media. Circuitos Secuenciales (I)TEMA 5: En este módulo comenzamos el estudio de los circuitos secuenciales, circuitos que tienen capacidad de memoria. Lee el \"Índice de las lecciones\" para más información. Para resolver los ejercicios de este módulo necesitarás utilizar VerilUOC_Desktop. Sobre dicha herramienta: (1) recuerda que en caso duda puedes consultar el apartado \"VerilUOC_Desktop\" del módulo 2; y (2) repasa, o visualiza por primera vez si todavía no lo has hecho, la parte en la que se explica VerilChart en el vídeo 2 del módulo 2.Circuitos Secuenciales (II)TEMA 6: Continuamos estudiando los circuitos secuenciales, centrándonos ahora en los registros, registros de desplazamiento, contadores y (una breve ojeada a las) memorias. Como siempre te recomendamos que leas el \"Índice de las lecciones\" para más información. Recuerda que la información sobre VerilUOC_Desktop la puedes encontrar en el módulo 2.Máquinas de estados finitosTEMA 7: Este módulo tiene un doble objetivo. En primer lugar se completa el estudio de los circuitos secuenciales viendo, a semejanza de lo que hicimos en la lección L3.4, cómo implementar estos circuitos a partir del algoritmo que describe su funcionamiento y, en segundo lugar, definiremos formalmente las máquinas de estados finitos (MEFs) y veremos cómo modelarlas en VHDL. Implementación de sistemas digitalesFELICIDADES: Has llegado al último módulo del curso. En este módulo daremos unas pinceladas acerca de cómo se construyen hoy en día los sistemas digitales, desde los más pequeños hasta los sistemas que incluyen millones de puertas. Con las limitaciones de este curso no nos será posible profundizar mucho en el tema, pero esperamos que lo que veas te guste y te motive para seguir aprendiendo.\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "Sistemas Digitales: De las puertas lógicas al procesador", 
    "price": 0, 
    "instructors": "Elena Valderrama, Jean Pierre Deschamps and Lluis Terés", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/sistemas-digitales", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}