{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    هو مساق للمهتمين في التعرف على أدوات الاستشعار الحديثة التي تستعين بتقانة النانو (وهي التقانة التي تبحث في المجال بين واحد إلى مئة نانوميتر، أي في أجزاء من المليار من المتر) لفرز ومراقبة الأحداث المختلفة في حياتنا الشخصية أو العملية.  في أطار هذا المساق، سنكتشف معا عالم النانو المذهل الذي يتعامل مع الوحدات الأساسية في بناء المادة.  وبهذا سوف نمهد الطريق لتطبيقات إبداعية لانهائية تطبق في كل جزء من حياتنا اليومية، بدءا من تشخيصات وعلاجات (في الجسم الحي أو خارجه) للأمراض، وثم نستمر في تقانة مراقبة جودة المنتوجات وما يختص بالبيئة، وننهي في تقانة مراقبة القضايا الأمنية.  سنتعلم في هذا السعي كيف نصَنع هذه الأدوات الجديدة، وكيف نميزها، وكيف نتحكم بها، وكيف ندمجها في التطبيقات المختلفة.\n\n_ _ _ _ _ _ _ _ _ _ _ _ _\n\nوصف المساق\nتقانة ومستشعرات النانو هو مجال يحوي اختصاصات عديدة ومتداخلة ويجمع بين الكيمياء/البيوكيمياء، الفيزياء، البيولوجيا، علم المواد، هندسة الإلكترونيات وغيرها. سيعرض المساق الحالي بعض مبادئ التقانة ومواد النانو الاساسيّة ودورها الهام في اجهزة و خواص الاستشعار. في هذا المساق سيتم نقاش معلومات شيقة من تخصصات متعددة في مجال العلوم والهندسة في المستوى النانوي, مستهدفا فهم الاختلافات الفيزيائية الأساسية لمستشعرات النانو. عند إنهاء هذا المساق، يكون قد تعلم الطالب تصنيع، تمييز ومعالجة مواد النانو ومستشعرات النانو، وكيفية  تسخيرها لبناء تطبيقات جديدة. وأيضا سيطبق الطالب معرفته في تقانة ومستشعرات النانو ضمن مشروع حسب اهتمامه الشخصي.\n\n\nاهداف المساق\nهدف المساق الرئيسي هو تطوير التفكير النقدي, الابداعي والمبتكر. ان المساق يشجع العمل ضمن فريق ذو افراد من مجالات وحضارات مختلفة, لبناء \"مخازن أفكار\" عالمية لابتكار افكار جديدة. سوف يطلب منكم خلال المساق ان تقوموا بالتفكير بطريقة مبدعة, غير اعتيادية وان تقترحوا افكار جديدة. \n\nيستهدف هذا المساق تشجيع المعرفة بالمواضيع التالية: \n\n1)        أهمية المواد النانوية في تطبيقات الاستشعار.\n2)     الأساليب المستخدمة في تحديد خصائص المستشعرات النانوية·\n3)        الأساليب المستخدمة لتكييف مواد النانو بهدف استعمالها في تطبيقات استشعار خاصة.\n4)       جسيمات النانو الفلزية والشبه موصلة.\n5)        أنابيب النانو وأسلاك النانو العضوية وغير العضوية.\n6)        المستشعرات الضوئية، الميكانيكية، والكيميائية المبنية من مواد النانو.\n7)         المستشعرات المبنية من هجين من المواد النانوية.\n \n\nالكتب المطلوبة:\n·         Jiří Janata, Principles of Chemical Sensors, Springer, 2d Edition (1989).\n·         Roger George Jackson, Novel Sensors and Sensing, CRC Press (2004).\n\nنبذه عن البروفيسور حسام حايك:\n\nالبروفيسور حسام حايك هو خبير في مجال التقانة والمستشعرات النانوية، وتشخيص أمراض بوسائل غير باضعة. حاصل على العديد من الجوائز والأوسمة المرموقة في العالم: جائزة ماري كوري للتميز العلمي، جائزة ERC، جائزة الصحة الأوروبية 7-FP. البروفيسور حايك حاصل على أكثر من 42 وسام وجائزه دولية لإنجازاته العلمية، ويشمل ذلك وسام الفارس (التي تمنحه الحكومة الفرنسية) والذي يعد من أعرق اوسمه الشرف في العالم. وقد أدرج اسمه ضمن \"قائمة افضل 35 شاب عالم في العالم\". كذلك حاز البروفيسور حايك على جائزة ديسكفري من مؤسسة بيل وميليندا غيتس. البروفيسور حايك هو مؤسس ورئيس مجموعه مكونه من 8 فرق أبحاث وشركات أوروبية لتطوير جيل متقدم من الإلكترونيات الجزيئية لتشخيص الأمراض. وهو يشغل أيضا منصب محرر مساعد لمجلتين علميتين ويقوم بدور عضو استشاري علمي بارز في العديد من الشركات والمعاهد الوطنية والدولية، وكذلك مقيم علمي في المفوضية الأوروبية.\n\n البريد الإلكتروني: hhossam@technion.ac.il \n\n_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ \n\n الطاقم:\n\n\nميتال بار-سيجف: حاصلة على اللقب الأول  B.A في الكيمياء (بامتياز) وحاصله أيضا على اللقب الأول B.Sc.  في هندسة المواد (بامتياز) من معهد العلوم التطبيقية – التخنيون (كلاهما عام 2010). عملت أثناء دراستها في شركة  \"تاور سيميكوندكتور\" وبعد التخرج عملت في معهد ألفريد-مان في التخنيون كمهندسة للتطوير والتنمية. حاليا، تقوم ميتال بتحضير الدكتوراه (المسار المباشر) في معهد الإلكترونيات الجزيئية على اسم راسل باري في  التخنيون تحت إشراف البروفيسور حسام حايك. موضوع بحث الدكتوراه هو تطوير الجلد الإلكتروني بواسطة مواد النانو.\n\nعبير وتد: حاصله على اللقب الأول B.Sc واللقب الثاني M.Sc. في موضوع الهندسة المدنية بتخصصي هندسة المباني وهندسة المواصلات من معهد العلوم التطبيقية – التخنيون (عامي 1998 و- 2005 على التوالي). كما وحصلت على اللقب الثاني M.Sc. في موضوع تدريس العلوم والتكنولوجيا من التخنيون عام 2013. تركزت أبحاثها على تدريس العلوم عن طريق البحث العلمي في المختبرات. عبير تعمل حاليا محاضره في أكاديمية القاسمي-كلية أكاديمية للتربية (باقة الغربية، إسرائيل)، وهي تشغل أيضا منصب رئيسة قسم الهندسة المدنية في الأكاديمية.\n\nمايا اشر، مساعدة تدريس: حاصله على اللقب الأول B.Sc واللقب الثاني M.Sc. في دراسات الاتصالات من كلية سابير الاكاديمية وجامعة بن چوريون- اسرائيل (2009, 2013 على التوالي).\nعملت مايا كمحاضرة في الجامعة المفتوحة- اسرائيل. وحالياً، تقوم باكمال دراستها للدكتوراه في قسم التعليم في العلوم والتقانة في التخنيون تحت اشراف البروفسور ميري باراك. موضوع بحثها يتمركز حول دراسة التعلم التعاوني عبر الإنترنت في مجموعات صغيرة متعددة الثقافات. \n\nمحمد خطيب، مساعد تدريس: حاصل على اللقب الاول B.Sc في هندسة البيوكيمياء من معهد العلوم التطبيقية – التخنيون (2015). حالياً، يكمل محمد دراسة الدكتوراه (مسار خاص) في قسم هندسة الكيمياء, معهد العلوم التطبيقية – التخنيون، تحت اشراف البروفسور حسام حايك. موضوع بحثه يتمركز حول اجهزة الكترونية قادرة على اشفاء ذاتها، من اجل مراقبة ورصد امراض معدية.\n\nميري باراك، مستشارة تربوية: بروفيسور مساعد في قسم التعليم في العلوم والتقانة، معهد العفوم التطبيقية- التخنيون. هي رئيسة مجموعة التقانات العلمية والتعليمية ومستشارة طلاب الدراسات العليا. فعالياتها الاكادمية تتمركز حول تطوير، دمج وتقييم مناهج تعليم العلوم في المدارس والتعليم العالي. دراساتها تتضمن استعمال معلومات وتقانات اتصال، مع التشديد على الويب 2.0 الناشئ والتطبيقات السحابية، من اجل تعليم ناجع وعمليات تفكير عليا.\n\n                                            Syllabus\n                        الاسبوع الرابع - المستشعرات المستندة الى جسيمات النانو الفلزيةThe description goes hereالاسبوع السابع - المستشعرات المستندة الى الأنابيب النانويّة الكربونيّةThe description goes hereالاسبوع الثامن - المستشعرات المستندة للهياكل النانويّة لأكسيد الفلزThe description goes hereالاسبوع التاسع - المستشعرات المستندة الى الهياكل النانويّة البوليميريّةThe description goes hereالاسبوع العاشر - الجلد الألكتروني المستند الى تقنيّة النانوThe description goes here\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": " التقانة والمستشعرات النانوية - الجزء الثاني", 
    "price": 0, 
    "instructors": "Hossam Haick", 
    "institution_name": [
        "Technion - Israel Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.coursera.org/learn/taknulujia-alnnanu2", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}