{
    "selfpaced": false, 
    "topic_name": [
        "Electrical Engineering"
    ], 
    "description": "\n\n                    \n                    \n                    يعلّمك مساق مقدمة إلى أنظمة الخلايا الشمسية ،والمكون من جزأين، تصميم نظام خلايا كهروضوئية بالكامل وذلك من خلال تركيزه على تكنولوجيا توليد الكهرباء بشكل رئيسي والتعريف بتكنولوجيا تحويل الطاقة الشمسية إلى كل من طاقة كهربائية أو حرارية أو وقود شمسي. يقدّم هذا المساق أجهزة الخلايا الكهروضوئية كأشباه موصلات متطورة، تؤمن الكهرباء من ضوء الشمس مباشرةً. كما يتمحور المساق حول فهم مبدأ عمل وطرق تصنيع الخلايا الشمسية وكيفية بناء وحدات الخلايا الكهروضوئية ومن ثم تصميم نظام خلايا كهروضوئية متكامل. بالاضافة لذلك، ستتمكن من فهم مبادئ التحويل الكهروضوئي (أي تحويل الضوء إلى كهرباء) حيث سنشرح مزايا وقيود وتحديات تقنيات الخلايا الشمسية المختلفة مثل تكنولوجيا الخلايا الشمسية المؤلفة من السيليكون البلوري، وتقنيات الخلايا الشمسية ذات الطبقات الرقيقة إلى جانب أحدث مبادئ الخلايا الشمسية والأكثر تطورًا بطريقة مطابقة لكيفية دراستها مخبرياً. سيتطرّق المساق بطبيعة الحال لعرض مواصفات وحدات الطاقة الشمسية والمواد شبه الموصلة الملائمة والأجهزة المادية وتقنيات تصنيع الخلايا الشمسية إلى جانب تصميم نظام شمسي متكامل خاص بتطبيق معين وشرحه لإرشادات ومبادئ تصميم نظام خلايا شمسية متكامل مناسب للتطبيقات المنزلية بشكل خاص. كما وسيناقش منهجيات التخزين البديلة وصولًا إلى الوقود الشمسي أو تحويل الطاقة الشمسية إلى حرارة وسيستعرض جوانب التكاليف، وتطور السوق، ومجالات التطبيق من الخلايا الشمسية. سنقوم في هذا المساق (الجزء الاول و الجزء الثاني) بما يلي:\r\n\r\nشرح المفاهيم المختلفة لتحويل الطاقة الشمسية إلى طاقة كهربائية، حرارية أو وقود شمسي.\r\nشرح مبادئ العمل الفيزيائية لتحويل طاقة الخلايا الكهروضوئية باستخدام الخلايا الشمسية.\r\nتوضيح و وصف مختلف تقنيات الخلايا الشمسية، وما توصّلت إليه حاليًا إلى جانب التحديات التكنولوجية المستقبلية التي قد تواجه كلًا منها.\r\nتحليل أداء الخلايا والوحدات الشمسية.\r\nتصميم نظام خلايا كهروضوئية نظريًا وبالكامل لتطبيق معين.\r\n\n\n                                    ", 
    "end_date": "2015-09-13T00:00:00Z", 
    "title": "مقدمة إلى  أنظمة الخلايا الشمسية", 
    "price": 0, 
    "instructors": "Arno Smits and Ahmed Dqamsh", 
    "institution_name": [
        "Delft University of Technology"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Engineering"
    ], 
    "course_url": "https://www.edraak.org/course/DelftX/ET.3034TU/3T2014/", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Edraak"
    ], 
    "start_date": "2015-08-09T00:00:00Z"
}