{"selfpaced": false, "topic_name": ["Higher Education"], "description": "\n\n                    \n                    \n                    To many adult educators, reflective practice is a crucial skill in their continuing professional development. However, the process of doing it effectively is never easy as Brookfield (1998) pointed out in noting that “to some extent, we are all prisoners trapped within the perceptual frameworks that determine how we view our experiences…”\r\nOur course is for adult educators or teachers who are interested in using a structured method to examine their own teaching/training practices. Through using four perspectives better known as Brookfield's Four Reflective Lens, this course attempts to address the limitations of our perspectives in the reflection process.\r\nThe 4 lenses are\r\n\r\nAutobiographical: examining our autobiographies, both as learners and adult educators\r\nLearner: learning to see ourselves through our learners’ eyes\r\nPeer: accessing our colleagues’ perspectives on our practice;\r\nTheoretical: examining the theoretical literature for alternative interpretations to our experiences\r\n\r\nThis programme is self-paced and designed for those who want to get started in their reflective practice straightaway. You will learn more about each lens through a video example of how the particular lens is applied by practitioners. This followed by worksheets and questions that gets you to apply the lens in your professional practice.\r\nOur course is for adult educators or teachers who are interested in using a structured method to examine their own teaching/training practices. Whether you are a vocational education instructor, a lecturer or professional trainer and facilitator working with adults, this course will help you get started in the practice of conducting a systematic inquiry into your own practice with the intent to improve what you are doing.\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Reflective Practice for Adult Educators", "price": 0, "instructors": "", "institution_name": ["Institute for Adult Learning"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "https://www.canvas.net/browse/ial/courses/reflective-practice-adult-educators", "duration": null, "language_name": ["English"], "provider_name": ["Canvas.net"], "start_date": "2015-02-23T00:00:00Z"}