{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    Design Thinking is a popular new idea in the business world – organizations as diverse as entrepreneurial start-ups, big established corporations, and government and social service organizations are experimenting with Design Thinking as an alternative\napproach to traditional problem-solving. Accelerated by the spectacular rise of Apple and IDEO, Design Thinking is seen as offering a new approach better-suited for dealing with the accelerating pressures for growth and innovation faced by so many organizations\ntoday. But Design Thinking can remain mysterious for people interested in introducing this approach into their decision-making processes. Demystifying it is the focus of this course.\n\nThough designing as a\ncraft requires years of dedicated education and talent to master, Design Thinking, as a problem solving\napproach, does not. In this course, we work with the following model that\ncontains 4 questions and several tools: \n\n\n    \nThe 4 sequential questions that take us on a journey through an\nassessment of current reality (what is?), the envisioning of a new future (what\nif?), the development of some concepts for new business opportunities (what wows?), and the testing of some of\nthose in the marketplace (what works?). The process of Design Thinking begins with data gathering: at the outset of the design process, designers gather a great deal of data on the users for whom they would like to create value. They mostly do this through ethnographic methods, such as experience\n    mapping, rather than traditional methods, such as focus groups and surveys. Farther along in the process, designers make their new ideas concrete (in the form of prototypes) and go out and collect better data from the real world in a process that is hypothesis-driven. That is, they treat their new ideas as hypotheses to be tested. They surface the assumptions underlying their hypotheses and test them, usually looking for the kind of behavioral metrics that will allow them to iterate their way to improved value\n    propositions.\n\nAccompanying the 4 questions is a set of tools to help\nbusiness people achieve the same kind of disciplined approach to innovation and\ngrowth that they bring to the rest of their business. In this course, we will\nlook at several stories from different organizations\n– major corporations like IBM,\nentrepreneurial start-ups like MeYouHealth,\nand even social service organizations like The Good Kitchen – all\nusing the Design Thinking tools and approach to achieve better outcomes.\n\n                                            Syllabus\n                        Week 1: What is Design Thinking? We will begin our course by unpacking\nwhat we mean by Design Thinking and why it is more effective than traditional\nbusiness methods when the goal is innovation in the business environment. By looking at the case history of The Good Kitchen, a Denmark program for providing meals for\nthe elderly, we will explore how the mindset and practice of the innovation\nteam that partnered with innovation consultant Hatch &amp; Bloom enabled them\nto achieve innovation and growth. We’ll conclude Week 1 by examining what\nkinds of problems and challenges are best suited for a Design Thinking\napproach.Week 2: How can we prepare ourselves to\nbe leaders of innovation? Design Thinking is not only about process and tools. It is about people as\nwell: about you as a design thinker\nand about the people you want to create value for and with. And so, before we jump\ninto the process of using Design Thinking to generate and test ideas, we want\nto first focus on your own mindset and look at whether your mind is prepared to both see and act\non opportunity when it shows up in your world. We will examine this issue by\nlooking at the stories of two very capable managers, George and Geoff, and how their differing mindsets affect their ability to lead innovation and\ngrowth. We\nwill also look at the role of visualization tools that use imagery and storytelling\nto bring ideas to life.\n\nWeek 3: How can you use Design Thinking\nto generate ideas? Now we will dive deeper into the Design Thinking process, looking at how we can\nuse it to generate better ideas. This week, we will look at the story of an\nentrepreneur, Chris Cartter, and his start-up, MeYouHealth, as they worked with\nBoston design firm, Essential Design, to understand the kind of\nopportunity that social networking might hold for helping us to improve our\nhealth. Examining\nwhat already exists is the first step in the Design Thinking process. As part\nof assessing what is, designers\n“follow the customer home” and explore the problems they are trying to solve in\nlife versus their product use. Once they have thoroughly explored and\nlooked for patterns in what is, designers\nlook toward the future and ask what if? These two questions – what is and what\nif – along with their associated tools will\nbe the focus of Week 3. This is the creative part of the process, but it also\ncontains a disciplined approach.Week 4: How can you use Design Thinking\nto test ideas? Having generated all\nthese great ideas, what’s next? The Design Thinking process now helps us to\ntake the many ideas we have generated and figure out how to determine which\nones are likely to produce the specific kinds of outcomes we want, whether these\ntake the form of improved nutrition for the elderly (The Good Kitchen), healthier lifestyle choices (MeYouHealth) or even more “hot leads” emanating from your trade shows\n(in the IBM example we will look at this week). This week,\nwe will follow the activities of an IBM team working\nclosely with experience marketing agency George P. Johnson as they develop and test ideas for a revolutionary\napproach to trade show participation. This process begins by asking what wows? This question brings together\nthe customer and business cases supporting our new concepts. Typically, the\n“wow” zone occurs at the intersection of three criteria: somebody wants it, we\ncan create and deliver it, and doing so has the potential to produce the\noutcomes we as an organization want. Then\nwe ask what works? and conduct small experiments to test if our assumptions\nare accurate. We'll conclude the week by reviewing what we have covered.\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Design Thinking for Business Innovation", "price": 0, "instructors": "Jeanne M. Liedtka", "institution_name": ["University of Virginia"], "commitment": "2-4 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/course/designbiz", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-02-16T00:00:00Z"}