{"selfpaced": true, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    Entrepreneurship is a way of thinking and a frame of mind that can be learnt and cultivated. It is not only about making money but more about making a difference and transforming the world. \r\nGlobal Entrepreneurship, is a collaborative course between Taylor's University, Open Learning and Pozible. The course aims at unleashing the potential of everyone participating. Students will be working on real entrepreneurial projects, in teams of students from other parts of the world. Students will be using crowd funding techniques to realise projects that will have a global positive impact. Get ready to change the world!\n\n                                            Syllabus\n                        1. Introduction: Why Entrepreneurship? \r\nEntrepreneurship is the art of making the world a better place, through orchestrating various resources with the intention of creating value and enriching life. Entrepreneurship represents a set of skills that can be utilised by anyone to enhance the quality of life in both for-profit and not-for-profit contexts. In this course you will work on a real-life project, together with your on-campus and online colleagues with the intention of realising opportunities and adding value. A cornerstone of this course is fund raising using crowd funding techniques. This lecture introduces the course, outlining the philosophy and the expectations.\r\n2. Entrepreneurship, Learning, Language and the Brain\r\nEntrepreneurs are positive people who see opportunities where others see challenges. They do not stop at recognising the opportunity, they are willing to work hard and take risk to convert the opportunity into a real value. This lecture builds on the materials presented in the previous lecture and introducing Entrepreneurship as a frame of mind that can be learned and nurtured. Through the use of the right language and the correct technique, we can build myelin around rewire our brains to be highly effective entrepreneurs able to recognise opportunity and deliver value and make a difference in the world.   \r\n3. Crowd Funding\r\nThe 21st Century is the Century of entrepreneurs. It is for the first time in the history of humankind where technology enables and empowers every individual to be integrated into the global value network and compete with the big players. You can buy, sell and accept credit cards working from your garage, a feat that was considered impossible a decade or so ago.Technology enables the masses to organise themselves and work together towards a common cause. This lecture will introduce the basics of crowd funding so that you can run a successful crowd funding campaign for your project. The lecture is delivered by Adrianna Tan from Pozible.com the crowd funding platform that we are collaborating with on this course.\r\n4. Build an Entrepreneur dream team \r\nAn Entrepreneurs’ goal is not fix all their weaknesses, but rather to amplify their strengths and surround themselves with people who can complement them. Building a successful team is a highly important skill and in this lecture you will learn the basics of building effective teams that will work towards having the core competencies necessary to deliver the promised value to the stakeholders.\r\n5. Entrepreneurship Eco System\r\nEntrepreneurs create products and services that we need and desire to have. These products and services make life easier, safer and more enjoyable. They affect the way work, study and play. Entrepreneurs achieve this through creating a balance between what is technologically feasible, economically viable and humanly desirable. The value is created and delivered to customers and funders within an eco system. In this lecture you will be exposed to the basic components of the eco system in which value is created and delivers to the customers.\r\n6. Think like an Entrepreneur \r\nEntrepreneurs are very optimistic people. They see opportunities where others see problems and obstacles and they keep a rather romantic view of the world, believing that they can make it a better place. In this lecture, you will learn language and thinking skills and techniques that will help you think like an Entrepreneur, identifying opportunities and taking appropriate actions to realise them.\r\n7. Business Plan\r\nBusiness plans are how entrepreneurs communicate their ideas and plans of new ventures. A business plan is a document that outlines the venture’s potential including the business value, the customers’ segments, the resources needed and the expected profit.\r\n8. Communicate like an Entrepreneur \r\nBusiness is all about people. Whether your staff, customers, investors or the governmental officials, you will need to communicate, communicate and communicate. This lecture will provide you with a framework for an effective communication that can use not only in business context, but also in your life at large.\r\n9. Sell like an Entrepreneur \r\nUnderstanding markets and marketing is an important skill for an Entrepreneur. This lecture will introduce you to the essentials of marketing.\r\n10. Inspire like an Entrepreneur \r\nEntrepreneurship is a journey that you will need to inspire people to join you on. In this lecture, you will learn the importance of well articulated Vision and Mission for a business as well as functions of management.\r\n11. Manage Finances like an Entrepreneur \r\nMoney is the bloodline of an enterprise. Whether for-profit or not-for-profit, an organisation will need money to operate. This lecture will expose you to the fundamental financial knowledge necessary for running your business including reading the essential financial documents.\r\n12. Business Registration\r\nBusiness registration is both a practical and legal requirement. This lecture will introduce the basics and the necessary steps of setting up a company in Malaysia.\n                                    ", "end_date": "2014-07-14T00:00:00Z", "title": "Global Entrepreneurship", "price": 0, "instructors": "Mushtak Al-Atabi", "institution_name": ["Taylor's University"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.openlearning.com/courses/GlobalEntrepreneurship", "duration": "14 weeks", "language_name": ["English"], "provider_name": ["OpenLearning"], "start_date": "2014-04-07T00:00:00Z"}