{"selfpaced": true, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    This course focuses on the common growth challenges faced by existing private businesses when they attempt to grow substantially.\n\n                                            Syllabus\n                        Course OverviewThis module introduces the course.The Truth About GrowthThis module presents an overview of growth in business with common myths and truths.  There is a required reading: Edward D. Hess, \"Growth is the\nDynamic Confluence of Strategy, Entrepreneurship, and Values.\" An option case study reading on Eyebobs Eyeware, Inc is also available. Please visit the Eyebobs website at https://www.eyebobs.com and think about whether Julie's vision and customer value proposition connects with you. What do you like about the site? What do you dislike? Why is her website so important to her\nbusiness? What should Julie do to keep her website \"fresh\"?Feller's Gourmet WorkshopThis module presents an series of questions to discover if you are ready\nfor growth.  The required reading is by Edward D. Hess, 3 Fellers\nBakery, Case Study. The 4 P'sThis module presents the four P's of growing a business: planning,\nprioritization, pace and processes. The four ways to grow your business are improvements, innovations, scaling, and strategic acquisitions. The required reading is Edward D. Hess, \"Defender Direct, Inc.: A Business of Growing Leaders,\" Case Study.Four Ways to Grow a BusinessThis module reviews the four ways to grow a business.  The required\nreading is  Edward D. Hess, Sanju Jacob and Monidipa Mukherjee,\n\"Enchanting Travels,\" Case Study. Creating a Growth PlanThis module dives into the logistics of creating a growth plan for Barger\n&amp; Sons, Inc.  The required reading is  Edward D. Hess, \"C.R. Barger &amp;\nSons, Inc.,\" Case Study.   Eric Barger faces a big growth challenge. His\nprimary product is concrete septic tanks. His product does not differ from\nhis competitor's products. His business is not well known. He does not\nsell to the end user. His customers buy based primarily on price. His\nbusiness has stopped growing and is not that profitable. His father has\nsaid the business must grow or it will be closed. Your assignment is to\nuse the concepts you learned in the previous modules to create a growth\nplan for this business. For this assignment, please list all the growth\nideas you can create for him to consider. Do not narrow his choices, but\nbe realistic with your ideas. It will help you to think about growth\noptions using the four ways to grow a business: improvements, innovation,\nscaling, and strategic acquisitions. A second way to think about his\ngrowth options is in functional business terms: product design; supply of\nraw materials; product manufacturing; product pricing and terms; product\nsales; delivery; customer service; technology; and marketing. Your end\nwork should be a list of  realistic growth ideas.Final ExamThis is the final exam. \n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Grow to Greatness: Smart Growth for Private Businesses, Part I", "price": 0, "instructors": "Edward D. Hess", "institution_name": ["University of Virginia"], "commitment": "4-6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/smart-growth-strategy-1", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-06T00:00:00Z"}