{"selfpaced": false, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    There is no doubt that technological innovation is one of the key elements driving human progress. However, new technologies raise ethical questions, have serious implications for society and the environment and pose new risks, often unknown and unknowable before the new technologies reach maturity.\n\nFor example, how can we make sure that “smart cities” and other data-based services strike a balance between the benefits the service provides and the risks it poses to the security of citizens? What are the ethical questions surrounding self-driving vehicles or autonomous weapons? What are the health risks of nanotechnologies? All these create new risks and raise serious ethical questions. The challenge is to innovate in a way that benefits both companies and society – to innovate responsibly.\n\nThis course provides both a theoretical and practical framework for assessing and designing responsible innovations, combined with real-world examples. The first part (weeks 1 and 2) of the course focuses on ethical questions and concerns, such as: a fair distribution of costs and benefits, moral obligations and individual and collective responsibilities. The second part (weeks 3 and 4) deals with (unknown) risks and safety of new technologies including a number of qualitative and quantitative risk assessment methods. The last part of the course (weeks 5, 6 and 7) is about the management of responsible innovations and evolving a new, value driven, design process.\n\nCase studies during the course include nanotechnology, self-driving vehicles, smart meters for electricity, autonomous weapons, nuclear energy and CO2capture and storage together with their related ethical and safety concerns.  Affordable innovations for low-income groups and emerging markets are also covered in the course.\n\nThe course includes a free e-book.\n\nThe course will be of benefit to innovation and risk managers, entrepreneurs, policy analysts, engineers, designers and strategic advisors who are looking for a methodical approach with which to judge responsible innovations.\n\n \n\n                                    ", "end_date": "2016-06-20T00:00:00Z", "title": "RI101x: Responsible Innovation: Ethics, Safety and Technology", "price": 0, "instructors": "Jeroen van den Hoven", "institution_name": ["Delft University of Technology"], "commitment": "6-8 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/responsible-innovation-ethics-safety-delftx-ri101x", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-04-11T00:00:00Z"}