{"selfpaced": true, "topic_name": ["Entrepreneurship"], "description": "\n\n                    \n                    \n                    Size bir sır vermek istiyoruz: Yenilik sadece doktora öğrencileriyle dolu araştırma laboratuvarlarından çıkmıyor. Çoğunlukla yeniliği kendileri için önemli bir sorunu çözmek isteyen sıradan insanlar yaratıyor. Bunu siz de yapabilirsiniz.\n\nÖnce neye ihtiyacınız olduğunu düşünün. Sonra başkalarının da bunu isteyip istemediğini öğrenin. Eğer istiyorlarsa, önce kendiniz için geliştirdiğiniz bu yeni ürün veya hizmeti diğerlerine sunmak için kâr amaçlı veya kâr amaçlı olmayan bir girişim oluşturabilirsiniz.\n\nSonsuz sayıda kullanıcı yeniliği örneği var. Bir sörfçü, sörf yaparken selfie çekebilmek için GoPro'yu yarattı. Bir öğrenci flaş belleğini unuttuktan sonra Dropbox'ı buldu. İki parasız girişimci kirayı ödeyebilmek için salonlarını kiraya verince Airbnb ortaya çıktı. Girişimlerinin nasıl başarılı olduğunu bizimle paylaşacaklar.\n\nKullanıcı yeniliğini ortaya çıkaran profesör Eric von Hippel'ın verdiği bu derste hangi sorunları çözmeyi seçebileceğinizi ve yeniliklerinizi başkalarıyla nasıl paylaşabileceğinizi öğreneceksiniz.\n\nSiz de yenilik yaratabilirsiniz.\n\n \n\n                                    ", "end_date": "2017-01-04T00:00:00Z", "title": "uINOV8x_TUR: Kullanıcıdan doğan yenilikçilik: Girişimciliğe Yolculuk", "price": 0, "instructors": "Eric von Hippel and Erdin Beshimov", "institution_name": ["Massachusetts Institute of Technology"], "commitment": "2 hours", "subject_name": ["Business & Management"], "course_url": "https://www.edx.org/course/kullanicidan-dogan-yenilikcilik-mitx-uinov8xtur", "duration": "57 weeks", "language_name": ["Others"], "provider_name": ["edX"], "start_date": "2015-12-02T00:00:00Z"}