{"selfpaced": false, "topic_name": ["Psychology"], "description": "\n\n                    \n                    \n                    Economics, psychology, and neuroscience are converging today into a unified discipline of Neuroeconomics with the ultimate aim of creating a single, general theory of human decision-making. \n\nNeuroeconomics provides biologists, economists, psychologists and social scientists with a deeper understanding of how they make their own decisions and how others decide. Neuroscience, when allied with psychology and economics, creates powerful new models to explain why we make decisions. Neurobiological mechanisms of decision-making, decisions under risk, trust and cooperation will be central issues in this course. You will be provided with the most recent evidence from brain-imaging techniques (fMRI, TMS, etc.) and introduced to the explanatory models behind them.\n\nThe course does not require any prior study of economics and neuroscience; however, it might require you to study novel interdisciplinary materials. The course provides an introduction to the methodology, assumptions, and main findings of  Neuroeconomics. Our students have different backgrounds; therefore, I have adapted and simplified the course to allow all students to understand the interdisciplinary content. This course will help you to start your progress in the field of Neuroeconomics and to further develop your skills during other more advanced courses and trainings in the future. For some topics, the course will also provide supplementary videos to reveal the opinions of leading experts in the field. Each module provides optional reading material.\n\nThe course structure is as follows: During each video, you will have to answer some relevant questions. Your answers will not affect your final grade. At the end of each module, you must complete a quiz consisting of 15 questions. To pass the course, you must reach a satisfactory standard in all the course modules by completing all graded quizzes and the final exam. In addition to watching video lectures and taking quizzes, you will receive an invitation to join our forum. We plan to join the discussions in the forum on a weekly basis.\n\nWelcome to Neuroeconomics World!\n\n                                            Syllabus\n                         Introduction to the CourseWelcome to the new field of Neuroeconomics!\n\nI hope you have an opportunity to reserve some time to explore the course content, course logic and our grading policy. The course consists of nine lectures covering main topics of Neuroeconomics. This class is completely self-paced: You can learn as fast as you like.\n\nThe course does not require any prior study of economics and neuroscience; however, it might require you to study novel interdisciplinary materials. The course provides an introduction to the methodology, assumptions, and main findings of Neuroeconomics. Our students have different backgrounds; therefore, I have adapted and simplified the course to allow all students to understand the interdisciplinary content. This course will help you to start your progress in the field of Neuroeconomics and to further develop your skills during other more advanced courses and trainings in the future.\n\nHave a good time with this new field of science!\n\nBest regards,\nVasily KlucharevIntroduction and Scope of NeuroeconomicsThis lecture will provide an introduction to the course and a historical overview of the field and will explore major assumptions of Neuroeconomics. We'll discuss the need for Neuroeconomics and the limitations of the traditional fields of economics, psychology, and neuroscience. Can we predict decisions based on neural activity? Can we change human decisions using brain stimulation techniques? Does Neuroeconomics change views on free will and free decisions? This lecture will deal with these and other questions. Overall, I'll try to convince you that Neuroeconomics radically transforms the way we normally think about human behavior. Have a good time with a new field of science!Neuroanatomy, Neurophysiology, and Neuroimaging: Tools of Neuroeconomics We will start with a short introduction to cognitive neuroscience, brain anatomy, and brain functions and continue with a discussion of various methods of measuring brain activity, including brain imaging methods (EEG, MEG, fMRI), transcranial brain stimulation (TMS), cell recording, and data visualization, and interpretation of the results. The main goal of this lecture is to help you read and understand results of Neuroeconomics papers. I will introduce terminology and experimental methods that we will use throughout the whole course.Introducing Brain Models of Decision-Making and Choice Now we will start our journey in Neuroeconomic theories and findings. You will learn the main features of the Diffusion Model, the most popular theoretical model of decision-making in Neuroeconomics. We will apply this model to single-neuron activity in a monkey cortex and to the human brain in order to understand how brains program decisions. For advanced students, I recommend a guest lecture provided by Dr. Sebastian Horn (Max Planck Institute for Human Development, Berlin), who gives a more fundamental explanation of the drift diffusion model. Enjoy Neuroeconomics!Neural Representation of Subjective ValueWhy do we make decisions? Perhaps we do so to activate our neurons. During this lecture, we will discuss how neurons assign values to different options during the decision-making process. We will also discuss the central role of the nucleus accumbens and orbitofrontal cortex in the valuation process. To make adaptive decisions, we must evaluate the costs and benefits of available options. Neuroeconomics has set itself the ambitious goal of understanding the brain mechanisms that are responsible for these evaluative processes. Neuroeconomics has also focused on describing the neural signals related to learning the value of stimuli and actions. Overall, this lecture will present some key ideas of Neuroeconomics. Affective Mechanisms of Decision-Making The influence of emotions on decision-making is largely ignored in decision theories. Our objective in this lecture is to explore the role of emotion in decision-making and to introduce theories and basic findings of Neuroeconomics in this context. For example, the neuroeconomic studies of decision-making in neurological patients who can no longer process emotional information normally suggest that people make judgments based not only on evaluations of the values of options and probabilities of outcomes but often primarily on emotions.Dual Process Theory of Decision-Making: Toward a Neuroeconomics PerspectiveStudies in Neuroeconomics have found evidence suggesting that the brain may employ multiple levels of processing when making decisions, and this conclusion is consistent with dual-processing theories that have received extensive theoretical consideration in the field of cognitive psychology. During this lecture, we will discuss the classic and cutting-edge research studies supporting dual process theory. Additionally, I recommend you to attend the guest lecture provided by Dr. Samuel McClure (Stanford University), who is a leading neuroeconomist investigating dual-process mechanisms.Decision-Making under Risk: Toward a Neuroeconomics MechanismMany of our decisions involve uncertainty or imperfect knowledge about how our choices lead to outcomes. The important aspect of uncertainty most commonly considered by economists and neuroeconomists is risk, which refers to situations in which we know the probabilities of possible outcomes. For example, if you play roulette in Monte Carlo, you are making a decision under risk since you know the probability of winning and thus how much you should expect to lose. Here I will introduce a neuroeconomic approach to studying decisions under risk and an anticipatory affect model suggesting that the balance of activity in the set brain areas (insular cortex and nucleus accumbens) promotes either approach toward or avoidance of risk. Additionally, Dr. Brian Knutson (Stanford University) provides his comments on the functional role of the nucleus accumbens in a guest lecture.The Social Brain: Games in the BrainAncient Greek philosophers observed that we are fundamentally a social species. Indeed, the human brain has evolved to deal with complex social interactions. Day by day, we collectively analyze problems or situations and evaluate alternative courses of action within social groups. Game theory has proven useful in the investigation of the neural basis of social interactions and social decision-making. In particular, researchers have investigated what happens in the brains of subjects involved in games where each player can choose between cooperative and non-cooperative behaviors or between altruistic and selfish behaviors. Here we will apply game theory to studying the neural mechanism of decisions to cooperate or to defect. I will also introduce the mirror neurons mechanism of social interaction. Evolutionary Perspective of Decision-Making Neuroeconomics investigates the origins of human decision-making by examining whether similar choice biases are seen in nonhuman primates, our closest phylogenetic relatives. Comparative studies can identify shared versus human-unique tendencies in decision-making. Here we will compare animal and human decision-making mechanisms. I will also introduce the theory of biological markets. At the beginning of the lecture, we will discuss the ontogenetic origin of human cooperation.Final ExamThis is the final quiz. To pass, you must answer at least 24 out of 30 questions correctly. Good luck with your exams!\n                                    ", "end_date": "2015-12-21T00:00:00Z", "title": "Introduction to Neuroeconomics: How the Brain Makes Decisions", "price": 0, "instructors": "Vasily  Klucharev", "institution_name": ["Higher School of Economics"], "commitment": "6-8 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/neuroeconomics", "duration": "9 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-10-19T00:00:00Z"}