{"selfpaced": false, "topic_name": ["Psychology"], "description": "\n\n                    \n                    \n                    Learn to provide psychological first aid to people in an emergency by employing the RAPID model: Reflective listening, Assessment of needs, Prioritization, Intervention, and Disposition.\n\nUtilizing the RAPID model (Reflective listening, Assessment of needs, Prioritization, Intervention, and Disposition), this specialized course provides perspectives on injuries and trauma that are beyond those physical in nature. The RAPID model is readily applicable to public health settings, the workplace, the military, faith-based organizations, mass disaster venues, and even the demands of more commonplace critical events, e.g., dealing with the psychological aftermath of accidents, robberies, suicide, homicide, or community violence. In addition, the RAPID model has been found effective in promoting personal and community resilience.\n\nParticipants will increase their abilities to: \n - Discuss key concepts related to PFA\n - Listen reflectively\n - Differentiate benign, non-incapacitating psychological/ behavioral crisis reactions from more severe, potentially incapacitating, crisis reactions\n - Prioritize (triage) psychological/ behavioral crisis reactions \n - Mitigate acute distress and dysfunction, as appropriate \n - Recognize when to facilitate access to further mental health support \n - Practice self-care \n\nDeveloped in collaboration with Johns Hopkins Open Education Lab.\n\n                                            Syllabus\n                        IntroductionIn this first week, we have some materials to get you oriented, a pre-course survey, two lectures on history and terms and concepts and a simulated look at PFA in action.Reflective Listening/RapportThis week, we'll be looking more closely at the R component of our RAPID model. Assessment  and PrioritizationThis week, we'll be looking more closely at the A and P components of our RAPID model. A stands for Assessment, and P stands for Prioritization. Intervention and DispositionThis week, we'll be looking more closely at the I and D components of our RAPID model in Lectures 7 and 8, respectively. I stands for Intervention, and D stands for Disposition. Self-Care and Wrap-UpNow that we've gone through the entire RAPID model, we'll turn our intention to you, the provider. \n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "Psychological First Aid", "price": 0, "instructors": "George Everly", "institution_name": ["Johns Hopkins University"], "commitment": "1-3 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.coursera.org/learn/psychological-first-aid", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}